{
    "title": "NVIDIA GeForce RTX 4070 Ti SUPER GPU Sales Remain Strong In Launch Week, RX \n7600 XT Disappoints",
    "date": "1/30/2024",
    "url": "https://wccftech.com/nvidia-geforce-rtx-4070-ti-super-gpu-sales-remain-strong-launch-week-rx-7600-xt-disappoints/",
    "text": "NVIDIA's recently released GeForce RTX 4070 Ti SUPER GPU is off to a great start in its launch week in terms of overall sales. It's been a week since NVIDIA launched its GeForce RTX 4070 Ti SUPER GPU and the sales show that the graphics card has seen a strong reception from the gaming community. In its first week, the RTX 4070 Ti SUPER GPU has become the best seller among the entire RTX 40 family, outselling the RTX 4060 Ti at certain retailers. ⚡️ GPU Retail Sales Week 4 '24 (mindfactory)☝️ RTX \"Super\" eating up Radeon share ℹ️ Units$AMD: 1660 units sold, 47.7%, ASP: 580 (+52)$NVDA: 1790, 51.44%, ASP: 717 (+31)$INTC: 30, 0.86%, ASP: 238 ℹ️ Revenue#AMD: 962050, 42.72%#Nvidia: 1282571, 56.96%#Intel: 7140, 0.32%… pic.twitter.com/fgxZ8XOAdX — TechEpiphany (@TechEpiphanyYT) January 30, 2024  Data from Germany's biggest retailer, MindFactory shared by TechEpiphany, shows that the NVIDIA GeForce RTX 40 GPUs have now outperformed the AMD Radeon RX 7000 GPUs in terms of sales and sales remain very strong for the GeForce RTX 4070 Ti SUPER, a $799 US graphics card. The RX 7800 XT still has the best sales figures of 500 units sold throughout the week versus the 400 units for the RTX 4070 Ti SUPER but that GPU costs $499 US and has recently hit discounted deals below $500 US. ASUS TUF GeForce RTX 4070 Ti SUPER takes the #1 selling graphics card spot at Amazon 😀👍 https://t.co/8xyxzTTlBG pic.twitter.com/A8t4Obyy1E — Jacob Freeman (@GeForce_JacobF) January 25, 2024  Other NVIDIA graphics cards that managed to sell well through the week were the RTX 4060 Ti and RTX 4070 series which have also seen price reductions at certain retailers. Meanwhile, in Japan, ITMedia reports that the NVIDIA GeForce RTX 4070 Ti SUPER GPU has been a real hit with the graphics cards selling well. The upgrade in specifications, especially the 16 GB VRAM is a well-worth and much-needed addition to the card as you can see from our review. Most graphics cards are also available at MSRP and the 4070 Ti SUPER has been far better received than the RTX 4070 SUPER. Over at Amazon UK and US, the NVIDIA GeForce RTX 4070 Ti SUPER also managed to claim the top spots in the \"Best Seller\" GPUs list for several days as gamers lined up to buy the new graphics card. Immediately after sales began, the reaction varied depending on the shop, but it seems to be generally agreed that the reaction was better than the RTX 4070 SUPER equipped card. TSUKUMO eX. said, ``Even though the RTX 4070 Ti cards, whose prices have stabilized, are still in stock, they are selling quite well.'' On the other hand, I heard from another shop, ``The response has been decent, but there has been a lot of progress, and I personally think it's good for further growth.'' via ITMedia Meanwhile, AMD's Radeon RX 7600 XT GPU hasn't been that well received. Despite doubling the VRAM and a $329 US price point, the graphics card hasn't sold well. It is expected that with a few price adjustments in the coming months, the graphics card may become a decent solution. Retail outlets were expecting that the 16 GB VRAM would have made the card a popular choice among AI consumers but that hasn't particularly been the case. In China, retailers are focusing on the RX 6750 GRE series and older RDNA 2 SKUs in favor of the RX 7600 series since those offer better perf per dollar value. As of January 26, many shops were still waiting for responses. One shop said, ``It is said that it has 16GB of memory and is resistant to generated AI, but I feel that the number of people who buy it for that purpose has come a little way. I hope that the price will calm down and sales will gradually increase. I think so,” he said. via ITMedia We are still just a week into the launch of the latest GPUs from NVIDIA and AMD so we will continue to see if these sales figures continue moving forward or gradually slow down as the first wave of the buying spree ends. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}