{
    "title": "2 \"Magnificent Seven\" Stocks That Could Outperform the Nasdaq in 2024",
    "date": "1/5/2024",
    "url": "https://www.fool.com/investing/2024/01/05/2-magnificent-seven-stocks-that-could-outperform-t/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The Magnificent Seven film released in 1960, and its 2016 reboot by the same name depicts seven American gunmen hired to protect a small village from a band of outlaws. However, the movie's name was repurposed in 2023, when Bank of America analyst Michael Hartnett used the phrase to describe the seven most influential tech stocks. The companies he considers to be the \"Magnificent Seven\" include Alphabet (GOOG 2.04%) (GOOGL 2.15%), Amazon, Apple, Meta Platforms, Microsoft, Nvidia (NVDA 3.12%), and Tesla. These tech names dominate their respective markets and have all delivered more growth over the past 12 months than the Nasdaq Composite.  Data by YCharts Meanwhile, many of these companies will likely continue beating the market in the new year thanks to budding markets like artificial intelligence (AI) and cloud computing. So, here are two \"Magnificent Seven\" stocks that could outperform the Nasdaq in 2024. Shares in Nvidia skyrocketed in 2023 as it cornered the market on AI chips, achieving an estimated 90% market share. The company beat all other chipmakers to the punch while competitors including Advanced Micro Devices and Intel have yet to catch up. As a result, Nvidia has formed lucrative partnerships with AI-minded companies across tech, supplying its hardware to countless names. While many companies are currently in a race to develop the most advanced AI models and produce attractive software tools for the commercial and consumer sectors, Nvidia is cashing in by selling its hardware to most of these organizations. So as AI chip demand has soared, so have Nvidia's earnings. In the third quarter of fiscal 2024 (ended October 2023), the company's revenue climbed 206% year over year, while operating income increased by more than 1,600%. The legendary results were mainly attributed to a spike in AI graphic processing unit (GPU) sales, represented by a 279% rise in data center revenue. In 2024, competition could heat up in the chip industry, with AMD and Intel both expected to begin shipping new AI products. However, Nvidia's immense dominance will likely be challenging to overcome. Meanwhile, data from Grand View Research shows the AI market is projected to expand at a compound annual growth rate (CAGR) of 37% until at least 2030 and exceed a value of $1 trillion, suggesting there will be plenty of room for Nvidia to retain its leading position and alternative chip options to enter the industry.  Data by YCharts This chart shows that Nvidia's earnings could achieve nearly $20 per share in fiscal 2025. Multiplying that figure by the company's forward price-to-earnings ratio (P/E) of 40 yields a stock price of $800, projecting 61% growth over the next year. Considering the Nasdaq Composite has risen at a CAGR of 25% over the past five years, I'd say there's an excellent chance Nvidia will once again outperform it in 2024. Alphabet is another Magnificent Seven stock with considerable growth potential in the new year. The company has ramped up its expansion into AI in 2023, unveiling its highly anticipated AI model, Gemini, in early December. According to Alphabet CEO Sundar Pichai, the new model \"represents one of the biggest science and engineering efforts\" the company has undertaken. Gemini is expected to be highly competitive with OpenAI's ChatGPT-4 and could open countless growth opportunities for Alphabet in AI. Alphabet already has a powerful position in tech as the home of potent brands, including Google, YouTube, and Android. In fact, the company boasts at least nine products with over 1 billion users, with the top being Google Search, Android, and Chrome. The tech giant has used its vast user base to build a lucrative advertising business, responsible for about 25% of the $680 billion digital ad market, according to Statista. However, the popularity of its services could just as easily be used to bolster its position in AI. With the power of Gemini, Alphabet could expand its AI tools on Google Cloud, create a Search experience closer to ChatGPT, offer more pointed advertising, and improve the user experience on YouTube.  Data by YCharts Alphabet's earnings are projected to hit nearly $7 per share next fiscal year. Running a similar calculation to Nvidia and multiplying that figure by Alphabet's forward P/E of 24 results in a share price of $168. Based on the company's current stock position, that would deliver growth of 21%. While that doesn't outperform the Nasdaq Composite's CAGR of 25% over the past five years, there are plenty of reasons to believe that's a conservative estimate. In 2024, Alphabet will probably begin seeing a return on its investment in AI with the help of Gemini, which could considerably boost its earnings and shares. As a result, I wouldn't bet against seeing this Magnificent Seven stock beat the Nasdaq in 2024. It's a compelling buy right now. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Bank of America is an advertising partner of The Ascent, a Motley Fool company. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Bank of America, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}