{
    "title": null,
    "date": "1/9/2024",
    "url": "https://www.fool.com/investing/2024/01/09/nasdaq-will-soar-1-stock-split-ai-stock-to-buy-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Forward stock splits can help investors in two ways. The most obvious benefit is that a stock split lowers the price per share, making the stock more accessible. The less obvious benefit is that a stock split tells investors the underlying company is doing something right. To elaborate, stock splits follow tremendous share price appreciation, which rarely happens without solid financial results and some competitive advantage. Consider these recent stock splits. All nine companies satisfy those conditions. These nine companies have something else in common: They are all components of the Nasdaq Composite (^IXIC 0.16%), an index widely seen as a benchmark for growth stocks. That is relevant because history says now is a good time to put money into Nasdaq stocks. The Nasdaq Composite nosedived 33% in 2022, dragged down by fierce inflation, aggressive interest rate hikes, and recession fears. But there was a silver lining in that catastrophic decline. Prior to 2022, the Nasdaq had only notched a calendar-year loss of 10% or more eight times since its inception in 1971. But following those double-digit declines, the index rebounded by a median of 52% over the next two years. For context, the Nasdaq has gained about 40% since the end of 2022, by that record leaving implied upside of 12% through the end of 2024. Of course, past performance is never a guarantee of future returns. The Nasdaq crashed in 2022 due to headwinds created by a global pandemic for which there is no historical precedent, so its continued recovery in 2024 may not fit historical patterns. That said, the Nasdaq returned about 10.3% annually over the last two decades. In that context, patient investors still have good reason to put money into Nasdaq stocks today. This brings me back to the stock splits listed. Wall Street is particularly bullish on Nvidia. The chipmaker has a median 12-month price target of $650 per share, which implies 33% upside from its current price. Nvidia reported incredible financial results in the third quarter (ended Oct. 29, 2023), crushing expectations on the top and bottom lines. Revenue soared 206% to $18.1 billion on record data center sales, driven by demand for artificial intelligence (AI) products. The company also delivered strong performances in its gaming and professional visualization segments. Additionally, Nvidia said third-quarter non-GAAP (generally accepted accounting principles) net income rocketed 593% to $4.02 per diluted share. The impetus behind that improved profitability was a 19-percentage-point increase in non-GAAP gross profit margin. Management attributed that margin expansion to an improved data center product mix, suggesting that high-margin software and services accounted for more of total sales. In the fourth quarter, the company expects revenue to reach $20 billion, implying a sequential acceleration to 230% revenue growth. Management also expects adjusted operating expenses to increase just 24%, implying that non-GAAP net income will once again grow much faster than revenue. As a caveat, Nvidia cannot sustain triple-digit growth indefinitely. Investors should expect that trajectory to moderate at some point, but the stock is still a worthwhile investment, given that Nvidia is the gold standard in AI computing. The company holds 80% to 95% market share in machine learning (ML) chips with its graphics processing units (GPUs), and it consistently delivers top results at the MLPerf benchmarks, the industry standard in evaluating the performance of AI hardware, software, and services. Nvidia has bolstered its data center portfolio in recent years by expanding into high-performance networking products, central processing units (CPUs), and subscription software and cloud services. That new strategy makes Nvidia even more important to the data center value chain, and it enhances its ability to monetize AI. For instance, the Nvidia InfiniBand networking platform provides the throughput data centers require to support AI workloads. CEO Jensen Huang says most large-scale AI factories are standardizing on InfiniBand. Similarly, DGX Cloud is a service that provides on-demand access to supercomputing infrastructure and Nvidia AI Enterprise software, democratizing access to AI development tools. In short, DGX Cloud lets businesses build and deploy AI applications across a range of disciplines without spending hundreds of thousands of dollars on AI infrastructure. Finally, Nvidia has expanded its semiconductor product portfolio by entering the CPU market. That means its compute platform can now support data center AI workloads at the networking level, the CPU level, and the software and services level, in addition to the GPU level. Huang says the three new elements of the company's growth strategy are hitting their stride, hinting at sustained momentum in the coming years. Today, Nvidia values its addressable market at $1 trillion, but that figure will continue to climb higher as more enterprises incorporate AI and ML into their products and services. Indeed, the AI market is forecast to grow at 37% annually through 2030. In that context, investors can expect Nvidia to achieve annual revenue growth in the mid-20% range for years to come. Moreover, analysts at Morningstar expect the company to grow revenue at 22% annually over the next decade. That forecast implies total sales growth of 630% over the next 10 years, which makes its current valuation of 27.3 times sales look reasonable, even though it is a premium to the three-year average of 23.5 times sales. There is no guarantee that Nvidia shareholders will see a positive return in the next 12 months, nor is the Nasdaq Composite guaranteed to gain value in 2024. But patient investors willing to hold Nvidia stock for at least five years should feel comfortable buying a small position today. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Amazon, Nvidia, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Celsius, Monster Beverage, Nvidia, Palo Alto Networks, and Tesla. The Motley Fool recommends DexCom. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}