{
    "title": "Believe It Or Not, Nvidia Stock Is Still Cheap At All-Time Highs \n(NASDAQ:NVDA)",
    "date": "1/12/2024",
    "url": "https://seekingalpha.com/article/4662529-believe-it-or-not-nvidia-stock-is-still-cheap-at-all-time-highs",
    "text": "Antonio Bordunovi Antonio Bordunovi Nvidia Corporation (NASDAQ:NVDA) shares just made new all-time highs. But to me, there's still plenty of room left for this stock to run higher. As I write this, stock is trading north of $540 and has a $1.31 trillion market cap. NVDA shares are up by 9.75% on a year-to-date basis (and we're less than 2 weeks into the new year). I spend a lot of time reading about stocks on social media. Seeking Alpha, X, Reddit, etc, etc, etc. Doing so doesn't help me much with my research. But, it does give me a sense of the retail investor sentiment surrounding popular stocks. And right now, everywhere I look, I see people crying foul about Nvidia's ongoing rally. They're saying it's unsustainable. It's crazy. It's a prime example of irrational greed in the market. It's like sheep chasing tech stocks over a cliff, akin to the .com bubble. Well, I think these are all bad takes. Honestly, I'm not sure why it's so difficult for the bears to rationalize Nvidia's success. After the stock's amazing performance over the past decade or so, the most recent leg-up of the rally shouldn't have come as a surprise to anyone. Nvidia has been the top-performing company in the Nasdaq several times throughout the last decade. NVDA shares rose by nearly 246% last year. The stock is up nearly 1400% during the past 5 years. And during the past decade, it's up by more than 13,200%. And do you know what's even more amazing than all of those gains? The fact is that NVDA shares are cheaper now than they've been for the vast majority of the last 20 years. That's baffling to many investors. And yet, it's true. Today, at $540/share, NVDA shares are cheaper than they were a little over a year ago when they were trading for $150/share. How could this be? Simply put, as amazing as NVDA's share price rally has been over the last year or so, its fundamental growth has been stronger. Fundamentals, not rabid greed, are what is pushing NVDA shares higher. And justifiably so. This stock's rally has been based upon the numbers…and the numbers keep getting better. Because of the amazing cash flow that this company is generating right now, I believe that there is still significant upside ahead. I recently named Nvidia as my Top Pick For 2024. In that article, I highlighted my thesis for a realistic upside potential of ~75% this year. A lot of my readers, loyal followers, and paying subscribers were surprised by this because, at first glance, NVDA seems like the type of speculative growth stock that I typically avoid. But, to me, this stock is a great value (that is supported by underlying fundamentals) and, therefore, I really wanted to hammer home that idea again here because, even at new all-time highs, NVDA remains one of the most appealing buys in the market to me. Let's start with the valuation because this is the crux of my bullish thesis here. NVDA shares rose by 246% last year…and yet, analysts believe that its EPS is going to rise by 268% once the Q4 results are officially tallied up. That disconnect, combined with the fact that it doesn't appear as though the market is properly pricing in forward-12 month growth potential, has resulted in a fantastic opportunity here. When I say that NVDA is cheaper now than it was a year ago - when shares were a fraction of today's price - I'm talking about NVDA's forward P/E ratio. When you look at NVDA on a ttm basis, shares appear to be pricey. They're trading with a ttm P/E in the 50x area. NVDA's blended P/E ratio (using trailing data and Q4 expectations) is 46x. Now, considering that this is a company that is likely to grow its EPS by ~270% last year and ~70% this year, those are acceptable multiples from a PEG basis. I suspect any value investor will admit that a sub-1.0x PEG is attractive. But, from a price-to-earnings standpoint, things get much more appealing when you apply a forward multiple to shares. Right now, NVDA trades for ~$540. It's expected to generate ~$20.40 in EPS this year. And therefore, on a forward-looking basis, shares are trading for roughly 26.5x. That means that NVDA is much cheaper than other popular growth stocks like Microsoft (MSFT), Amazon (AMZN), Salesforce (CRM), and ASML Holding (ASML). That 26.5x forward P/E means that NVDA is cheaper than more defensive names like Apple (AAPL), Costco (COST), and Church & Dwight (CHD). There are a slew of well-known consumer staples stocks, from Coca-Cola (KO) to Colgate-Palmolive (CL) that trade with premiums just below NVDA's (in the low-20x levels). And yet, these companies offer growth prospects that are a tiny fraction of NVDA's potential. With that in mind, it doesn't seem very rational to pay something like 23x for a blue chip defensive stock growing at 5-8% when you could pay 26x for a blue chip tech stock growing at 70%, does it? What's more, that 70% growth for 2023 may prove to be overly conservative (as crazy as that sounds). Coming into 2023, analysts completely underestimated NVDA's potential. During the company's first 3 earnings reports of 2023, NVDA absolutely blew expectations out of the water (and posted guidance that was billions of dollars above Wall Street's sales and earnings expectations). During the first quarter, NVDA beat on both the top and bottom lines, but these weren't massive beats (for instance, the consensus EPS estimates coming into the quarter was $0.92 and NVDA posted $1.09 in earnings). The guidance here is what caught the market off guard and sparked NVDA's 2023 rally. NVDA called for Q2 sales of ~$11b, which was roughly 50% above analyst consensus. Companies post beat and raise quarters all of the time, but rarely have I seen the market so wrong about guidance from mega-cap companies like this. That bullish guidance caused shares to jump by more than 25% in the afterhours trade. During the second quarter, NVDA posted EPS of $2.70, which was way about the consensus estimate of $2.09 coming into the print. Sales came in ahead of that amazing Q1 guidance, $13.51b. By then, the analyst consensus had caught up to NVDA's Q1 guidance at $11.22b. However, it turns out that the Q1 number was a low bar for the company. Its $2b+ beat represented y/y revenue growth in the triple digits (and 88% on a sequential basis). And, most impressive of all, NVDA's Q2 net income jumped from $656m to $6.19b (on a y/y basis). Q2 is when NVDA's CEO, Jensen Huang, mentioned that the transition from existing data center infrastructure to data centers capable of generative AI is a trillion dollar opportunity. That's trillion, with a T. And this statement caught the market's attention in a big way and kept the sentiment surrounding shares positive. During Q3, EPS came in at $4.02 (above consensus estimates of $3.37). NVDA's sales totaled $18.1b, tripling the $5.9b that it posted a year prior. What I found most interesting about the quarter is that not only did NVDA post 206% sales growth, but its gross margin expanded from 53.9% to 74.0%. Honestly, I don't think I've ever seen anything like this. If those figures don't signal unprecedented demand, I don't know what does. NVDA's net income was $9.24b during Q3, up from $680m during the same quarter from the prior year. To me, NVDA's Q3 report was just as impressive as its prior two (if not more so); however, the stock hasn't moved much since. Simply put, this company is printing cash. And yet, prior to the most recent leg of the rally, the market hadn't rewarded NVDA for the Q3 beat. To me, this is where the current opportunity arises from. FAST Graphs FAST Graphs If you place the same blended P/E multiple on NVDA's fiscal 2025 expectations (for reference, those are this year's earnings; NVDA is currently in Q1FY2025) that the market placed on its earnings during the first and second quarters of 2023, then we're talking about a $1000.00 share price. The ~50x multiple that shares traded with then is is-line with the 5-year average, adding a bit of credence to the idea that NVDA shares could rise to the 4-digit territory in the relatively near future. Now, I don't think that's likely. I don't think NVDA should trade for 50x earnings because the level of growth that I expect to see in 2024 isn't sustainable. But, I think a ~35x multiple is more than fair when we're talking about the high margin sale that NVDA is expected to generate. I've highlighted the 35x level in the chart above. As you can see, it's represented pretty strong support for shares during recent selloffs. Therefore, I think this is a pretty conservative target, and with it in mind, I wouldn't be surprised to see shares trade in the $700+ range by the end of the year (35 x $20.44 = $715.40). That's using a 35x multiple on the current consensus in the $20.50 range. In a year or so, with the benefit of hindsight, I wouldn't be surprised if that EPS estimate is too low. NVDA has beaten Wall Street consensus EPS estimates during 18 out of the last 20 quarters. I wouldn't be surprised if that trend continues here and, therefore, I don't think it's crazy to say that NVDA could generate earnings in the $21-$22 range this year. Seeking Alpha Seeking Alpha A 35x multiple on $21.50 of earnings is ~$750. That represents ~40% upside from here (even after the stock's nearly 10% year-to-date rally). The failure to recognize that NVDA's fundamental growth has outpaced its share price performance over the last year or so is why there are so many people sitting on the sidelines here, pouting about NVDA's rally. Bears who are calling for a massive selloff here, simply because of the stock's rapid acceleration higher, are being irrational. They're being emotional. And they're not paying attention to the numbers. Resentment isn't going to lead to riches. Now's the time to reexamine NVDA's income statements and realize that winning the AI race has turned NVDA into one of the world's largest cash cows. The most common complaint that I see from the bears about NVDA's valuation is that this growth isn't sustainable. Obviously, that's the case. I wouldn't expect any company to maintain a triple digit EPS growth rate for very long. Fiscal 2025's ~70% growth expectations aren't going to last long either. But here's the deal: that's okay. Nvidia doesn't have to grow at this pace for long to justify its current share price. I've already laid out my argument for current consensus more than justifying today's prices (and representing significant upside potential). But, even if you think I'm being overly aggressive with my ~35x target multiple, ongoing EPS growth reduces NVDA's forward P/E the further and further out into the future that you look. Seeking Alpha Seeking Alpha I'm not very interested in peering too far out into the future because I don't think that anyone can make accurate estimates when we're talking about performance more than a year or two down the road. But, I think it's worth mentioning that Wall Street analysts don't believe NVDA's growth story ends this year. Looking at Seeking Alpha's data, 30 analysts have provided fiscal 2026 EPS estimates. Those estimates range from $19 to nearly $33. The consensus is $24.01 right now, representing 20%+ growth (on top of 2025's massive growth expectations). At $540/share, Nvidia is trading for just 22x consensus 24 months out. As someone who plans on holding his shares for much longer than this, this is comforting. Placing a 1.5x PEG on the stock just a few years down the road results in a 30x multiple on $24 in earnings, or a $720 share price. Once again, that's a PEG multiple that seems pretty conservative for the type of results that I expect to see NVDA post between now and then. The fact that this valuation method lines up well with my existing P/E target leads me to believe that there is still plenty of upside from here at all-time highs. At Microsoft's Ignite event late last year, Huang said that AI will be bigger than the internet. Here's the full quote: \"Generative AI is the single most significant platform transition in computing history. In the last 40 years, nothing has been this big. It's bigger than PC, it's bigger than mobile, and it's gonna be bigger than the internet, by far.\" Admittedly, that's a tough concept to grasp. As someone who basically grew up alongside the Internet, I can remember what life was like before the Internet, I can remember its early days, and today, just about everything that I do all day involves the Internet, in some way, shape, or form. The Internet has revolutionized the way that billions live their lives, and it's amazing to think about the ways in which AI could change things in the coming decades. For instance, in December MIT researchers announced that they'd discovered new antibiotics using AI. It's been decades since a new antibiotics have been introduced for treatment, and that has led to concerns about the rise of \"super bugs\" that are resistant to most of mankind's threats against them. Well, the MIT discovery can kill methicillin-resistant Staphylococcus aureus (MRSA), and I suspect this will be just one of many ways that AI positively impacts society moving forward. With that being said, I definitely don't doubt CEO Huang. He's proven himself to be a visionary, time and time again. He's placed Nvidia in a leading position in several strong secular growth trends in the past and it appears as though his focus on Nvidia's data center technology has done so again. NVDA has a massive lead in both the hardware and software arenas (with its CUDA platform) when it comes to implementing AI chips and the total addressable market here is massive. Sure, there are competitive threats that could result in lower margins (AMD's new AI chips, for instance, or the rise of competing and/or open source software platforms); however, the way I see it, the only way that it makes sense for a bear to talk about overvaluation here is if they believe that NVDA's fundamentals are going to go into secular decline after 2025/2026 (because at this point, strong growth in these years is essentially guaranteed). Given NVDA's ability to adapt, evolve, and pivot in the past, I highlight doubt that's going to be the case. I admit, no company is immune to disruption. And sure, it's possible that NVDA goes the way of a company like Intel and completely loses its relevance. But at this point, that seems highly unlike to me. Bank of America analyst, Vivek Arya, who also happens to have a $700 price target on shares, recently stated that NVDA could generate $100b in incremental free cash flow during the next two years. That's a massive war chest when it comes to fighting off the competition. There are few companies in the world that will be able to compete with that. And ultimately, I trust that NVDA will continue to be productive with its cash flows (from an R&D and M&A standpoint), bolstering its moat. Also, I expect to see more shareholder returns moving forward, mostly in the form of buybacks, which has the potential to accelerate EPS growth even more (via financial engineering). Vivek and I aren't the only two who're very bullish on NVDA moving forward. Yahoo finance trades 50+ analysts who've offered opinions on NVDA shares and the current average price target is $636 (representing 18% upside potential). As you can see below, during December this stock has 33 \"Buy\" ratings and 18 \"Strong Buy\" ratings across Wall Street. Yahoo Finance Yahoo Finance So, with all of these numbers in mind, I pose a question to the bears… How rational is it to assume that all of these people (and the institutions that they work for) are wrong? Are they all drinking the Kool-Aid? Or maybe, just maybe, could it be time to get with the program and acknowledge that this is a gem of a company, potentially the bluest of all blue chips in the growth space, and it's trading in the bargain barrel. NVDA has generated a lot of wealth for me and my family. It's definitely played a large role in my outperformance over the last decade or so and moving forward, it's factoring in heavily to my financial freedom plans. I hope that everyone is able to reach their financial goals and live out their dreams. When I look at my portfolio, NVDA is a stock that can get me to where I want to go. I'm curious to hear about your outlook for the stock in the comment section below. Best wishes, all! Dividend Kings helps you determine the best safe dividend stocks to buy via our Master List. Membership also includes Click here for a two-week free trial so we can help you achieve better long-term total returns and your financial dreams. This article was written by Nicholas Ward is a Senior Investment Analyst with Wide Moat Research and the former editor-in-chief and portfolio manager at The Intelligent Dividend Investor, The Dividend Growth Club, and The Income Minded Millennial. Nicholas is a contributor to the investing group The Dividend Kings where he shares analysis on dividend growth stocks. The Dividend Kings is a group of analysts, led by Dividend Sensei, that teach members how to invest more wisely in dividend stocks. The focus is on helping investors safeguard and grow their money in all market conditions through the highest-quality dividend investments. Features include: 13 model portfolios, buy ideas, company research reports, and a thriving chat community for readers looking to learn how to invest more intelligently in dividend stocks. Learn More. Analyst’s Disclosure: I/we have a beneficial long position in the shares of A, AAPL, ABBV, ACN, ADP, AMGN, AMZN, APD, ARCC, ARE, ASML, AVB, AVGO, BAH, BAM, BEPC, BIPC, BIL, BLK, BN, BR, BTI, BX, CME, CNI, CP, CPT, CRM, CSCO, CSL, DE, DHR, ECL, ENB, ESS, FRT, SPAXX, GOOGL, HON, HSY, ICE, ITW, JNJ, KO, LHX, LMT, LOW, MA, MAIN, MCD, MCO, MKC, MO, MRK, MSCI, MSFT, NKE, NNN, NOC, NVDA, O, ORCC, OTIS, PEP, PFE, PH, PLD, PLTR, QCOM, REXR, RSG, RTX, RY, SBUX, SHW, SPGI, TMO, TD, TXN, USFR, UNH, V, VLTO, WM, ZTS either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}