{
    "title": "Forget Nvidia. Here's a Better \"Magnificent Seven\" Stock for 2024.",
    "date": "1/13/2024",
    "url": "https://www.fool.com/investing/2024/01/13/forget-nvidia-heres-a-better-magnificent-seven-sto/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Among the \"Magnificent Seven\" stocks, Nvidia (NASDAQ: NVDA) had the best run in 2023, rising 239%. With that kind of one-year performance, investors shouldn't expect another repeat, or even for Nvidia to once again claim the crown of the best \"Magnificent Seven\" stock in 2024. Instead, I think investors should be looking at Alphabet (GOOG 2.04%) (GOOGL 2.15%) to outperform its peers. Alphabet also had a strong 2023, up 58%. But it's valued much lower than Nvidia despite strong tailwinds. This all adds up to what should be a phenomenal year for Alphabet stock in 2024. First and foremost, Alphabet's primary business is advertising. While most people are excited about its artificial intelligence (AI) capabilities or cloud computing, the reality is that nearly 80% of revenue comes from its ad business. Alphabet has multiple ad streams, but its largest is its Google Search division. While this segment struggled throughout late 2022 and early 2023, the third quarter was different, as it grew revenue by 11% to $44 billion. Another key platform is YouTube, which holds the highest screen time among all streaming services. Revenue grew 12% in Q3, but expect this segment to have a big year as ad spending bounces back. Data source: Nielsen. While ads keep the lights on for Alphabet, other investments are starting to take shape. Artificial intelligence has been a key investment theme for Alphabet ever since CEO Sundar Pichai declared Alphabet an AI-first company. While this takes several forms (including optimizing the ad business to be more AI-powered), the latest iteration has been generative AI. This movement took the world by storm when ChatGPT became popular in late 2022, and multiple companies began offering generative AI solutions for business. However, these models need to be built on a platform, and Alphabet's Gemini looks like a top option. Gemini beat the competition in several key benchmark tests, including becoming the first model to outperform human experts on the massive multitask language understanding test. Alphabet has yet to monetize this platform, but investors can expect that sometime in 2024. Also in Alphabet's AI aspirations is its cloud computing business, Google Cloud. Google Cloud currently sits in third place in terms of market share, but that position isn't a big deal considering how large this market is. Google Cloud has steadily grown above 20% year over year, yet hasn't optimized for profits. With an operating margin of just 3%, Google Cloud could be a massive profit boost when the company changes its mindset from growth at all costs to profitability. While that likely won't happen in 2024, it's a long-term booster for investors to consider. Despite these strong tailwinds, Alphabet still trades at a reasonable valuation. Alphabet's stock looks far more reasonable than Nvidia's 70 times trailing and 43 times forward earnings.  GOOGL PE Ratio data by YCharts A valuation of 20 times forward earnings isn't a bad price, especially considering that Alphabet's stock hasn't traded that low in some time. Furthermore, with the right conditions, Alphabet could easily surpass these projections, making it an even better stock to own in 2024. While Nvidia is still a strong business, the stock has gotten ahead of itself. Investors are better off purchasing a stock like Alphabet right now, which provides growth at a reasonable price. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}