{
    "title": null,
    "date": "1/10/2024",
    "url": "https://investorplace.com/market360/2024/01/opportunity-knocks-seize-the-moment-with-nvidia-stock/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Even after a stellar performance in 2023, NVDA stock is surprisingly cheap Advertisement Source: Poetra.RH / Shutterstock.com Nvidia (NASDAQ:NVDA) took the spotlight on Wall Street last year as the demand for artificial intelligence hardware soared. Don’t assume that another company has to take Nvidia’s place in 2024, though. NVDA stock fully deserves an “A” grade as a prime momentum play that’s actually a good value, as well. The idea here isn’t to try to pick the “Magnificent Seven” stock that will outperform all the others this year. You don’t need to play the prediction game or have a crystal ball if you own a few shares of Nvidia stock. It’s important to learn about Nvidia, listen to tech experts, and stay invested if you believe in its growth prospects. Nvidia was certainly a darling of the financial market in 2023. The skeptics and worry warts were wrong last year about Nvidia. They discovered the hazards of opportunity costs when investors fail to understand market trends and growth stories. They’ll continue to be wrong in 2024, no doubt. The critics will claim that Nvidia stock is too pricey to buy now. Bernstein analyst Stacy Ragson has a message for them: “Today Nvidia is in fact the cheapest of the ‘AI narrative’ stocks out there.” Ragson calculates that Nvidia trades at 25 times the company’s forward earnings, which represents the company’s lowest forward earnings multiple since the end of 2018. Yet, Ragson isn’t the only Wall Street expert that emphasizes Nvidia’s surprisingly reasonable valuation. In a similar vein, Baron Capital’s Michael Lippert recently estimated that Nvidia “is trading at mid-20 times one-year-forward estimated earnings.” Lippert is essentially echoing Ragson’s argument here. Lippert’s reasonable conclusion is that NVDA “isn’t an expensive stock.” Furthermore, Lippert emphasized that AI isn’t a “hype cycle,” and that the “business has exploded, and everyone is trying to focus on the sustainability of that new level of business” (presumably, referring to AI hardware and Nvidia’s business in that industry). Some investors don’t appreciate Nvidia’s value proposition, but many analysts do. As more experts brace themselves for another solid year of returns with Nvidia stock, you can determine whether you want to add a few shares now to your portfolio. Just to provide another bullish argument, consider the commentary of Bank of America Global Research analyst Vivek Arya. Nvidia’s “solid [free cash flow] generation creates optionality,” Arya remarked. This argument certainly passes the common-sense test. After all, Nvidia’s FCF allows the company to invest in product upgrades and entirely new products, among other areas. In any case, Arya expects Nvidia to “consider assets that help it create a more meaningful recurring revenue profile.” Perhaps the most optimistic assessment of all, however, comes from Wedbush analyst Dan Ives.  He believes that the “new tech bull market has begun” even though the first few trading sessions of 2024 didn’t favor technology stocks. Of course, the “new tech bull market” will heavily depend on the AI hardware industry’s continued growth. Much like Lippert’s remark on this topic, Ives insists, “This is not hype.” Even beyond that, Ives believes that the technology market is on the cusp of a “1995 moment.” Just look at how tech stocks performed from 1995 through 1999, and you’ll see how bullish Ives’ assessment is. There’s no denying that Nvidia is a fast-growing business because of the demand for AI-enabled processors and accelerators. Yet, there’s also a convincing argument that Nvidia stock offers a good value. If you’re a skeptic who missed out on last year’s rally in AI-focused stocks, don’t fret. Think about the opportunity cost that you might incur if you continue to sit on the sidelines. When all is said and done, NVDA stock earns an “A” grade and is a sensible way to prepare your portfolio for a potential “1995 moment” in 2024. On the date of publication, Louis Navellier had a long position in NVDA. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Artificial Intelligence, Semiconductor, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/opportunity-knocks-seize-the-moment-with-nvidia-stock/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Artificial Intelligence Stocks to Buy Uncategorized Stocks to Buy Stocks to Sell Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}