{
    "title": "15 semiconductor companies that have followed Nvidia's lead by showing \npricing power and improved efficiency",
    "date": "1/31/2024",
    "url": "https://finance.yahoo.com/news/15-semiconductor-companies-followed-nvidia-161400257.html",
    "text": "When thinking about an industry group in the stock market, you can look ahead at sales and profit estimates, or you can look back to see which companies have been faring best by common measures. My wife and I sold our home to her son at a $100,000 discount. He’s now selling at a $250,000 profit. Do I ask for a cut? Meta stuns Wall Street with its first dividend. Amazon and Alphabet could be next. My partner is against marriage. I’m not on the deed to his home, but he set up a revocable trust in case he dies first. Is this risky? Amazon’s big earnings beat and upbeat cloud talk send its stock soaring America’s No. 1 emerging real-estate market is a costly coastal California city, report says In October, estimated sales figures for 60 chip makers and manufacturers of related equipment showed that analysts expected Nvidia Corp. NVDA to have the fastest pace of sales growth through calendar 2025. Nvidia took the industry lead last year through its dominance of the market for graphics processing units (GPU) being deployed by data centers to support their corporate customers’ rollout of artificial intelligence technology. Nvidia’s stock returned 239% in 2023, while the iShares Semiconductor ETF SOXX, which tracks the PHLX Semiconductor Index of 30 stocks SOX, returned 67%. It was a good year for the broad stock market, with the SPDR S&P 500 ETF Trust SPY returning 26%. Now we are taking a look back — but not very far back — to see which semiconductor companies have shown improved pricing power while also increasing their operating profitability. We began the screen with the 30 companies whose stocks are held within the SOXX portfolio, then added the 30 additional companies in the S&P Composite 1500 Index XX:SP1500 that are in the semiconductor industry, as determined by FactSet, or in the Semiconductors and Semiconductor Equipment Global Industry Classification Standard group. The S&P Composite 1500 is made up of the S&P 500 SPX, the S&P MidCap 400 MID and the S&P SmallCap 600 SML. The Ratings Game:  AMD earnings could make its pricey stock even more expensive, this analyst says We screened the 60 semiconductor companies for the following: Based on their most recent available quarterly filings, 16 companies, including Nvidia, showed improved quarterly gross margins and operating margins from the year-earlier fiscal quarters. Here they are, sorted by market capitalization: Company Ticker Market cap. ($bil) Quarterly gross margin Gross margin – year-earlier quarter Quarterly operating margin Operating margin – year-earlier quarter Nvidia Corp. NVDA $1,551 73.95% 53.57% 59.54% 16.98% Intel Corp. INTC $181 45.74% 39.17% 25.68% 21.29% Applied Materials Inc. AMAT $138 47.01% 45.65% 31.25% 31.11% KLA Corp. KLAC $81 61.95% 58.72% 44.03% 43.51% Microchip Technology Inc. MCHP $47 61.04% 59.35% 49.05% 48.77% TE Connectivity Ltd. TEL $45 34.66% 30.15% 24.15% 20.31% Entegris Inc. ENTG $18 35.56% 30.82% 13.86% 12.62% First Solar Inc. FSLR $16 46.84% 3.36% 45.51% 2.07% Enphase Energy Inc. ENPH $15 46.31% 41.59% 24.94% 23.32% Lattice Semiconductor Corp. LSCC $8 65.49% 64.64% 35.82% 34.77% Fabrinet FN $8 12.85% 12.05% 11.64% 10.57% Rambus Inc. RMBS $8 69.40% 68.25% 28.34% 28.12% MKS Instruments Inc. MKSI $7 38.20% 35.43% 22.64% 22.33% Allegro MicroSystems Inc. ALGM $5 57.89% 55.54% 31.95% 29.26% Cirrus Logic Inc. CRUS $4 51.26% 50.18% 24.88% 24.68% Veeco Instruments Inc. VECO $2 42.15% 39.23% 16.60% 14.25% Source: FactSet It is the nature of some businesses to have higher profit margins than others. So a direct comparison between companies with different business models may not be useful. But it cannot hurt for any company’s margins to improve. Leaving the group in the same order, here’s a summary of ratings and price targets among analysts polled by FactSet: Company Ticker Share “buy” ratings Share neutral ratings Share “sell” ratings Jan. 30 price Consensus price target Implied 12-month upside potential Nvidia Corp. NVDA 92% 8% 0% $627.74 $674.54 7% Intel Corp. INTC 17% 66% 17% $42.92 $44.32 3% Applied Materials Inc. AMAT 63% 34% 3% $166.24 $172.43 4% KLA Corp. KLAC 52% 40% 8% $595.35 $660.70 11% Microchip Technology Inc. MCHP 69% 31% 0% $85.96 $93.66 9% TE Connectivity Ltd. TEL 50% 50% 0% $145.23 $161.33 11% Entegris Inc. ENTG 69% 31% 0% $121.96 $115.76 -5% First Solar Inc. FSLR 81% 19% 0% $149.03 $230.14 54% Enphase Energy Inc. ENPH 55% 43% 2% $106.35 $125.49 18% Lattice Semiconductor Corp. LSCC 69% 31% 0% $61.19 $77.64 27% Fabrinet FN 57% 29% 14% $219.83 $202.64 -8% Rambus Inc. RMBS 86% 14% 0% $71.43 $79.95 12% MKS Instruments Inc. MKSI 71% 29% 0% $110.19 $100.17 -9% Allegro MicroSystems Inc. ALGM 78% 22% 0% $26.56 $39.51 49% Cirrus Logic Inc. CRUS 80% 20% 0% $78.53 $93.01 18% Veeco Instruments Inc. VECO 71% 29% 0% $32.50 $34.57 6% Source: FactSet Keep in mind that analysts working for brokerage firms tend to set 12-month price targets. That can be a short period for long-term investors. If you are considering individual stocks for investment, you should do your own research to form your own opinion about companies’ ability to remain competitive. One way to begin this process is by clicking on the tickers. Click here for Tomi Kilgore’s detailed guide to the wealth of information available for free on the MarketWatch quote page. Don’t miss:  Too much ‘Magnificent Seven’? A revenue-weighted index fund may be the solution. Apple’s stock falls as its return to growth could prove short-lived Meta’s stock soars toward record on first-ever dividend — but Zuckerberg sees ‘unpredictable and volatile’ years ahead ‘I don’t like the idea of dying alone’: I’m 54, twice divorced and have $2.3 million. My girlfriend wants to get married. How do I protect myself? Plug Power’s stock heads for three-month high as business hits a milestone Elon Musk to move for Tesla shareholders to vote on reincorporating in Texas Related Quotes "
}