{
    "title": null,
    "date": "2/8/2024",
    "url": "https://siliconangle.com/2024/02/08/equinix-nvidia-partner-simplify-deployment-ai-infrastructure/",
    "text": "UPDATED 14:09 EST / FEBRUARY 08 2024 by \nZeus Kerravala Digital infrastructure company Equinix Inc. recently launched a private cloud service that allows organizations to manage their own Nvidia Corp. DGX supercomputing infrastructure for building custom generative artificial intelligence models. Operated by Equinix, the new service integrates Nvidia’s DGX systems, networking, and AI Enterprise software, a suite of tools for deploying AI applications. The potential use cases for generative AI are vast and span multiple industries. In healthcare, it’s revolutionizing drug discovery and patient care. In financial services, it analyzes vast amounts of data, aiding in customer service and fraud detection. In retail, it’s enhancing customer experiences by providing personalized content. Despite the enthusiasm, many companies lack expertise in building and managing complex AI systems. Because of privacy and security concerns, organizations across different industries also desire control over their AI models and data. That’s why Equinix partnered with Nvidia to ensure that companies can position AI close to their data — whether they’re training new models or using advanced AI techniques like retrieval-augmented generative AI — explained Charlie Boyle, vice president of DGX systems at Nvidia, during an analyst briefing announcing the service. “Our customers have come to us over the years saying they need AI functionality to add to their business applications, Boyle said. “Every day they don’t have that functionality is a day of lost opportunity. So, we want to make it very easy and flexible for them by working with Equinix to build a turnkey solution.” Delivering a validated, turnkey design is the key to this partnership. Over the years, customers have screamed that they want disaggregated solutions to create choice and flexibility in their infrastructure deployments. However, as the adage goes, be careful what you ask for. Now that data center technology has been fully disaggregated, customers struggle with assembling the right components in an optimized way that enables them to move forward with initiatives, like AI today, but also scale in the future. The partnership with Equinix and Nvidia, delivered as a service, does just that. Here’s how the service works: Equinix and its regional partners determine a customer’s requirements for AI infrastructure, which are translated into detailed specifications. This process is simplified by a single invoice for all the purchased technology. Meanwhile, Nvidia and Equinix work behind the scenes to configure and deploy the necessary systems within Equinix’s global network of data centers. Equinix deploys Nvidia infrastructure for customers across 250 International Business Exchange data centers in 32 countries. This ensures secure and fast connections to the internet and cloud services while adhering to strict data safety and compliance standards. At the same time, customers get access to Nvidia’s AI software and receive support from Equinix and Nvidia experts. This facilitates smoother development of AI apps, allows them to scale their solutions worldwide, and eliminates the need for in-house expertise. The private cloud service leverages Nvidia’s AI data center infrastructure platform DGX SuperPOD. This means organizations can quickly set up their AI infrastructure without running into problems related to data center space, power supply, and infrastructure management. By handling the complex task of setting up systems for customers, Equinix and Nvidia provide a new level of convenience, according to Jon Lin, executive vice president and general manager of data center services at Equinix. “It’s challenging for enterprises to deploy Nvidia DGX inside of their existing legacy data centers, which may not have enough power or cooling to support new workloads and capabilities,” Lin said. “We’re hearing loud and clear from our enterprise customers that sustainability is at the forefront of everything they’re thinking about on their infrastructure.” Given the operational demands of AI infrastructure, such as increased power and cooling needs, sustainability is a core part of the new service. For example, Equinix has pledged to power its operations entirely with renewable energy sources, including the data centers housing Nvidia’s AI systems. The company also uses equipment that requires less energy and water for cooling. Lastly, customers get detailed reporting on sustainability metrics specific to their deployments so they can meet their own sustainability goals. The last point is a strong value proposition for the partnership. Every information technology and business leader I’ve talked to in the past year has sustainability as a top initiative. They also have AI as another focus area, but AI infrastructure requires massive cooling, data center space and wholesale infrastructure upgrades, which is at odds with sustainability. The Equinix service-led model helps customers move forward with AI and offload the sustainability management to Equinix, which has years of expertise in this area. With its global accessibility, expert management, and commitment to sustainability, this service is ideally suited for organizations looking to leverage AI without the hassle of developing and managing their own infrastructure. Zeus Kerravala is a principal analyst at ZK Research, a division of Kerravala Consulting. He wrote this article for SiliconANGLE. THANK YOU Blockchain-focused cryptography startup Zama raises $73M to protect data in use Bipartisan bill could see TikTok banned in US if it doesn’t split with China OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions Taalas raises $50M to develop chips optimized for specific AI models Claroty secures $100M to enhance cyber-physical system security Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research Blockchain-focused cryptography startup Zama raises $73M to protect data in use SECURITY - BY MIKE WHEATLEY . 4 HOURS AGO Bipartisan bill could see TikTok banned in US if it doesn’t split with China POLICY - BY JAMES FARRELL . 7 HOURS AGO OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions AI - BY MIKE WHEATLEY . 9 HOURS AGO Taalas raises $50M to develop chips optimized for specific AI models AI - BY MARIA DEUTSCHER . 10 HOURS AGO Claroty secures $100M to enhance cyber-physical system security SECURITY - BY DUNCAN RILEY . 10 HOURS AGO Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research AI - BY MARIA DEUTSCHER . 11 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}