{
    "title": "NVIDIA Accelerates Quantum Computing Exploration at Australia's Pawsey \nSupercomputing Centre",
    "date": "2/18/2024",
    "url": "https://nvidianews.nvidia.com/news/nvidia-accelerates-quantum-computing-exploration-at-australias-pawsey-supercomputing-centre",
    "text": "SCA2024 -- NVIDIA today announced that Australia’s Pawsey Supercomputing Research Centre will add the NVIDIA® CUDA Quantum platform accelerated by NVIDIA Grace Hopper™ Superchips to its National Supercomputing and Quantum Computing Innovation Hub, furthering its work driving breakthroughs in quantum computing. Researchers at the Perth-based center will leverage CUDA Quantum — an open-source hybrid quantum computing platform that features powerful simulation tools, and capabilities to program hybrid CPU, GPU and QPU systems — as well as, the NVIDIA cuQuantum software development kit of optimized libraries and tools for accelerating quantum computing workflows. The NVIDIA Grace Hopper Superchip — which combines the NVIDIA Grace CPU and Hopper GPU architectures — provides extreme performance to run high-fidelity and scalable quantum simulations on accelerators and seamlessly interface with future quantum hardware infrastructure. “High-performance simulation is essential for researchers to address the biggest challenges in quantum computing — from algorithm discovery and device design to the invention of powerful methods for error correction, calibration and control,” said Tim Costa, director of HPC and quantum computing at NVIDIA. “CUDA Quantum, together with the NVIDIA Grace Hopper Superchip, allows innovators such as Pawsey Supercomputing Research Centre to achieve these essential breakthroughs and accelerate the timeline to useful quantum-integrated supercomputing.” “Pawsey Supercomputing Centre’s research and test-bed facility is helping to advance scientific exploration for all of Australia as well as the world,” said Mark Stickells, executive director at the Pawsey Supercomputing Research Centre. “NVIDIA’s CUDA Quantum platform will allow our scientists to push the boundaries of what’s possible in quantum computing research.” Australia’s national science agency, CSIRO (Commonwealth Scientific and Industrial Research Organisation), estimates the domestic market opportunity from quantum computing to be worth $2.5 billion annually in revenue, with the potential to create 10,000 new jobs by 2040. Achieving this will require quantum computing to be embedded in other scientific domains, with applications in astronomy, life sciences, medicine, finance and more. Pushing the Boundaries of Quantum Computing\r\nPawsey will deploy the system to run quantum workloads directly from traditional high performance computing systems, leveraging their processing power and developing hybrid algorithms that intelligently divide calculations into classical and quantum kernels, using the quantum device to improve computing efficiency. Quantum machine learning, chemistry simulations, image processing for radio astronomy, financial analysis, bioinformatics and specialized quantum simulators will be studied, starting with various quantum variational algorithms. Pawsey is deploying eight NVIDIA Grace Hopper Superchip nodes based on NVIDIA MGX™ modular architecture. GH200 Superchips eliminate the need for a traditional CPU-to-GPU PCIe connection by combining an Arm-based NVIDIA Grace™ CPU with an NVIDIA H100 Tensor Core GPU in the same package, using NVIDIA NVLink™-C2C chip interconnects. This increases the bandwidth between GPU and CPU by 7x compared with the latest PCIe technology. It delivers up to 10x higher performance for applications running terabytes of data, giving quantum-classical researchers unprecedented power to solve the world’s most complex problems. Pawsey is committed to making the NVIDIA Grace Hopper platform available to the Australian quantum community, as well as its international partners. About NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling industrial digitalization across markets. NVIDIA is now a full-stack computing infrastructure company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/. Certain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features, and availability of NVIDIA’s products and technologies, including NVIDIA CUDA Quantum platform, NVIDIA Grace Hopper Superchips, NVIDIA cuQuantum, NVIDIA MGX modular architecture, NVIDIA Grace CPU, NVIDIA H100 Tensor Core GPU, and NVIDIA NVLink-C2C chip interconnects; the benefits, impact, features, and timing of our collaborations with third parties and their strategies; and the estimated domestic market opportunity from quantum computing and its potential to create new jobs are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. © 2024 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, CUDA, NVIDIA Grace, NVIDIA Grace Hopper, NVIDIA MGX, and NVLink are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice. Download / File Link About NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling industrial digitalization across markets. NVIDIA is now a full-stack computing infrastructure company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/. Certain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features, and availability of NVIDIA’s products and technologies, including NVIDIA CUDA Quantum platform, NVIDIA Grace Hopper Superchips, NVIDIA cuQuantum, NVIDIA MGX modular architecture, NVIDIA Grace CPU, NVIDIA H100 Tensor Core GPU, and NVIDIA NVLink-C2C chip interconnects; the benefits, impact, features, and timing of our collaborations with third parties and their strategies; and the estimated domestic market opportunity from quantum computing and its potential to create new jobs are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. © 2024 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, CUDA, NVIDIA Grace, NVIDIA Grace Hopper, NVIDIA MGX, and NVLink are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice. Global contacts for media inquiries. Newsroom updates delivered to your inbox. "
}