{
    "title": "Morning Brew: Gilead Acquires CymaBay in $4.3B Deal, Nvidia Leads S&P 500 \nSurge",
    "date": "2/12/2024",
    "url": "https://www.gurufocus.com/news/2285761/morning-brew-gilead-acquires-cymabay-in-43b-deal-nvidia-leads-sp-500-surge",
    "text": "Shares of Beamr Imaging (BMR, Financial) soared premarket after the company announced its collaboration with Nvidia for automated video modernization, which will be presented at the ACM Mile-High-Video 2024 conference. Beamr is also set to launch a new video cloud service on Amazon’s AWS, leveraging Nvidia technology. Gilead Sciences (GILD, Financial) has entered into an agreement to acquire CymaBay Therapeutics (CBAY, Financial) for $4.3 billion, offering a 27% premium over CymaBay's recent closing share price. The acquisition is expected to close in the first quarter of 2024, subject to regulatory approvals, and will expand Gilead's portfolio in therapies for liver and other chronic diseases. Stock index futures indicated a mixed sentiment with a focus on the upcoming CPI report. The market is also paying attention to several Federal Reserve speakers and the potential implications for interest rates. Meanwhile, the 10-year Treasury yield saw a slight decrease. Sportsbooks experienced a challenging Super Bowl, with key results not favoring their unbalanced books. The Kansas City Chiefs' victory and the total points being over 46.5 led to significant payouts, contrary to the sportsbooks' interests. Nvidia (NVDA, Financial) has been a major contributor to the S&P 500's rise above 5,000, with its market cap increasing by $600 billion in the past two months. Other tech giants like Meta (META, Financial), Amazon (AMZN, Financial), and Microsoft (MSFT, Financial) have also seen significant gains, while Apple (AAPL, Financial) and Tesla (TSLA, Financial) have experienced declines. Diamondback Energy (FANG, Financial) saw its stock price increase premarket after announcing a merger with Endeavor Energy Resources, creating a combined company valued at approximately $26 billion. Rivian Automotive (RIVN, Financial) shares, on the other hand, slipped ahead of the market open. ContextLogic (WISH, Financial) shares surged after confirming the sale of its assets, including the Wish ecommerce platform, to Singaporean e-commerce company Qoo10 for $173 million in cash. AbbVie (ABBV, Financial) updated its earnings outlook for Q1 2024, reflecting a slight dilutive impact from its acquisition of ImmunoGen (IMGN, Financial). The company also reaffirmed its full-year 2024 guidance, including the dilutive impact from the ImmunoGen deal. Barstool Sports inked a multi-year partnership with DraftKings (DKNG, Financial), marking a significant deal for both companies as they look to expand their sports betting footprint. Investors withdrew $15.7 billion from funds, with equity funds experiencing the largest outflows. However, certain ETFs like the iShares Core S&P 500 ETF (IVV, Financial) and the JPMorgan Global Select Equity ETF (JGLO, Financial) managed to attract significant inflows. Macquarie Equity downgraded Unity Software (U, Financial) to Underperform and reiterated an Outperform rating on AppLovin (APP, Financial), while maintaining a Neutral rating on Digital Turbine (APPS, Financial), amidst a challenging outlook for mobile advertising in 2024. Lowe’s (LOW, Financial) received an upgrade from J.P. Morgan, which sees an improving environment for the home-improvement sector. The bank also raised its price target for Lowe's and added it to its Analyst Focus List. Pfizer (PFE, Financial) ran its first Super Bowl ad, focusing on its oncology efforts and signaling its growth ambitions beyond the COVID-19 vaccine market. The ad featured historical scientists and inventors singing to Queen's \"Don't Stop Me Now.\" Joby Aviation (JOBY, Financial) shares climbed after finalizing a partnership to introduce air taxi services in Dubai, while monday.com (MNDY, Financial) surged ahead of its Q4 earnings release, which later reported a significant beat on EPS and revenue estimates. Syra Health (SYRA, Financial) announced a contract with the County of Fairfax, Virginia, to provide nursing care and staff temporary healthcare positions, leading to a premarket stock price increase. Fairfax Financial (FRFHF, Financial) responded to a short report by Muddy Waters, calling it \"false and misleading,\" and plans to address the claims in its upcoming earnings call. Diamondback Energy (FANG, Financial) confirmed its merger with Endeavor Energy Resources, creating a significant presence in the Permian Basin and leading to a stock dividend increase. Alexandria Real Estate Equities (ARE, Financial) disclosed AstraZeneca's (AZN, Financial) $300 million investment in a cell manufacturing facility at ARE's Shady Grove mega campus, strengthening their long-term partnership. Related Stock Tickers: We'd love to learn more about your experiences on GuruFocus.com and how we can improve! "
}