{
    "title": "Cathie Wood sells a major tech stock (again)",
    "date": "2/6/2024",
    "url": "https://www.dcourier.com/news/2024/feb/06/cathie-wood-sells-a-major-tech-stock-again/",
    "text": "  Cathie Wood, head of Ark Investment Management, has achieved rock-star status in the money-management world, even drawing a nickname from her followers – Mama Cathie. Presumably, she’s watching protectively over her investor-children. But her returns don’t indicate that she’s been the dearest mommy. Wood’s flagship Ark Innovation ETF,  (ARKK)  - Get Free Report, with $7.5 billion in assets, has generated a return of just 5% for the last 12 months. And the annualized return is negative 32% for the past three years and a mere positive 2% for five years. That’s not too impressive, as the S&P 500 posted positive returns of 21% for one year, 11% for three years, and 15% for five years. Wood’s goal is at least 15% annual returns over five years. PATRICK T&period FALLON&solGetty Images She did have one stupendous year, leading Ark Innovation to a return of 153% in 2020. That and clear presentations of her investment philosophy in ubiquitous media appearances help explain her popularity. Related: Analysts revamp Amazon stock-price targets after earnings Wood’s investment strategy isn’t difficult to digest. Ark’s ETFs generally buy young, small stocks in the high-technology categories of artificial intelligence, blockchain, DNA sequencing, energy storage, and robotics. She sees those sectors as game changers for the global economy. As you might expect, these stocks are quite volatile, so the Ark funds are subject to quite a rollercoaster ride. And Wood frequently trades in and out of her top names. Investment research giant Morningstar is unimpressed with Wood and Ark Innovation ETF. “ARK Innovation has dubious ability to successfully navigate the challenging territory it explores,” wrote Morningstar analyst Robby Greengold. The potential of Wood’s five high-tech platforms listed above is “compelling,” he said. “But Ark’s ability to spot the winners among them and navigate their myriad risks is less so. The strategy’s booms and busts have culminated in middling total returns and extreme volatility since its 2014 inception.” Greengold isn’t enamored with Wood’s investment style. “Her reliance on her instincts to construct the portfolio is a liability,” he said. It’s not an investment-by-the-books portfolio. “The strategy narrowly invests in stocks with paltry current earnings, elevated valuations, and highly correlated stock prices,” Greengold said. “Their extreme volatility underscores their highly uncertain futures.” Wood has defended herself from Morningstar’s criticism. “I do know there are companies like that one [Morningstar] that do not understand what we're doing,” she said. “We do not fit into their style boxes. And I think style boxes will become a thing of the past as technology blurs the lines between and among sectors.” On Friday, Ark Genomic Revolution ETF  (ARKG)  - Get Free Report unloaded 3,022 shares of the semiconductor titan Nvidia  (NVDA)  - Get Free Report worth $2 million as of that day’s close. Ark’s previous move with Nvidia's stock was a sale on Jan. 22. Wood has periodically sold Nvidia since last May. More From Wall Street Analysts: Last September, she called it a “really expensive and very obvious” stock, according to Bloomberg. The shares have more than tripled over the past year amid enthusiasm for the company’s connection to artificial intelligence. Nvidia is the largest producer of highly powerful and energy-efficient graphic processing units (GPUs) used to train and run AI apps. On the buy side, Ark funds picked up stock of electric vehicle giant Tesla  (TSLA)  - Get Free Report for the seventh day in a row, snatching 114,811 shares Friday, valued at $21.6 million as of that day’s close. Tesla has lost 29% over the past six months amid weak earnings, production problems, and controversy surrounding Chief Executive Elon Musk’s compensation. Wood has repeatedly purchased Tesla shares when they have dropped in recent years, voicing support for Musk and his mission to provide non-polluting autos. Tesla is the second biggest holding in Ark Innovation ETF, after Coinbase  (COIN)  - Get Free Report. Ark funds also grabbed 47,926 shares of online securities brokerage Robinhood Markets on Friday, valued at $509,000 as of that day’s close. Robinhood stock has slid 11% over the last month. After a brief spurt following its initial public offering in July 2021, the stock has struggled and is now down 72% from the IPO. Meanwhile, Ark funds sold 261,981 shares of video conferencing service Zoom Video Communications  (ZM)  - Get Free Report, valued at $16.8 million as of Wednesday’s close. It has dropped 20% in the past 12 months but remains up 77% from its April 2019 IPO. Demand for the company’s products soared during the pandemic but has slowed since then. Zoom is the fourth biggest holding in Ark Innovation. Related: Veteran fund manager picks favorite stocks for 2024 Click Below to: Contents of this site are © Copyright 2024 Prescott Newspapers, Inc. and Western News&Info®, Inc. All rights reserved. |  Terms of Service | Privacy Policy "
}