{
    "title": "NVIDIA Forming A New Business Unit Focused on Custom-Chip Development For \nAI, Game Consoles, Auto & More",
    "date": "2/9/2024",
    "url": "https://wccftech.com/nvidia-forming-new-business-unit-focusing-custom-chip-development-ai-game-consoles/",
    "text": "NVIDIA is all set to challenge the custom chip segment in markets such as AI, Game Consoles, Auto & Telecom, as the firm is reportedly working on a new business unit to cater to the immense demand. It seems like NVIDIA wants to consolidate itself in the industry without giving any space for its competitors to make room, especially when considering the financial side of things. After making concrete efforts to diversify its supply chain, NVIDIA is now aiming to expand itself into newly emerging domains of the artificial intelligence markets. Reuters is now reporting that NVIDIA is forming a new division solely responsible for catering to the needs of clients aiming to acquire custom chips. Well, this news isn't much of a shocker, because the tech giants currently dominating the AI space, such as Microsoft and Meta, are already in the race to develop their custom AI chips to combat the level of competition in the industry. Since this technically puts NVIDIA's products backstage, Team Green finds it best to integrate into the competition rather than stand against it. It is now creating a division responsible for developing certain chips depending upon how their clients \"like.\" It is reported that NVIDIA will directly compete with Broadcom and Marvell Technology, two names that are well-known for developing custom AI solutions for companies. The specifics of the new division haven't been disclosed yet, but it seems like NVIDIA will bet huge on it, likely through huge financing and recruitment waves. It is said that the company has already sat down with Amazon, Meta, Microsoft, Google, and OpenAI to offer them \"custom AI chip\" services, but right now, nothing has been confirmed yet, so we probably should wait for more concrete announcements. Some of these customers also include video game companies and console manufacturers. The company has a history with gaming devices such as its Shield platform and it also powers the Nintendo Switch handheld & is likely to power its successor too. According to multiple analysts, the custom chip markets are expected to grow to a whopping $30 billion in 2023. It is typical of NVIDIA to jump into a revenue stream when it is at its early stages, similar to what the firm did with AI. The competition in the markets is starting to heat up, and it seems like, for now, the spotlight is on NVIDIA, whether it is in the form of client adoption or financial results. News Source: Reuters Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}