{
    "title": "Loop Capital Just Raised Its Price Target on Nvidia (NVDA) Stock to $1200",
    "date": "2/16/2024",
    "url": "https://investorplace.com/2024/02/loop-capital-just-raised-its-price-target-on-nvidia-nvda-stock-to-1200/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Some on the Street are worried about the high valuation of NVDA stock Advertisement Source: Michael Vi / Shutterstock.com Investment bank Loop Capital has thrust Nvidia (NASDAQ:NVDA) stock back into the spotlight today by starting coverage of the shares with a Street-high price target of $1,200. According to Loop, the chipmaker’s financial results will probably significantly beat analysts’ mean estimates this year and in each of the subsequent two years. Another investment bank, Oppenheimer, was also bullish on NVDA stock this morning, which raised its price target on the shares to $850. Loop Capital’s analysts initiated coverage of NVDA with a “buy” rating, along with their $1,200 price target. The bank believes that large data centers’ demand for chips used to create and maintain artificial intelligence (AI) will continue to be strong for the next three to five years. As the leading maker of such chips, Nvidia is likely to benefit from that trend. Indeed, Loop expects the firm to be able to sell as many chips as it can make this year and next year. Meanwhile, Oppenheimer predicts that Nvidia’s fourth quarter results, expected to be unveiled on Feb. 21, will come in above analysts’ average estimates. The investment bank believes the firm’s strong revenue from data centers will be the biggest positive catalyst for its better-than-expected results. However, Oppenheimer did add that there is a significant amount of anticipation about the firm’s updates regarding the status of its China operations. Washington has prevented Nvidia from selling certain advanced chips in China, “which has historically accounted for 20-25% of its data center revenue,” Investing.com noted. Oppenheimer kept an “outperform” rating on the shares. The Street appears, on the whole, to be extremely upbeat about Nvidia’s ability to thrive amid the AI boom, as 38 firms have a strong buy rating on the name, 11 have buy ratings on the stock, and only four have hold ratings on it. Also noteworthy is that heading into today, the shares have jumped 27% in the last month, 47% in the previous three months, and 230% in the last year. On the other hand, some on the Street are expressing worries about the stock’s high valuation, as the shares now have an elevated forward price-earnings ratio of 35.8 and a very high trailing price-sales ratio of 40 times. On the date of publication, Larry Ramer did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. Artificial Intelligence, Semiconductor, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/loop-capital-just-raised-its-price-target-on-nvidia-nvda-stock-to-1200/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}