{
    "title": null,
    "date": "1/3/2024",
    "url": "https://finance.yahoo.com/video/why-arista-networks-could-top-215942087.html",
    "text": "The tech sector dominated markets in 2023, driven by the Magnificent Seven stocks and endless talks about AI. Nvidia (NVDA) was one of the seven that more than exceeded expectations, but could there be some new contenders for top tech stocks? Argus Director of Research Jim Kelleher joins Yahoo Finance to discuss some of the top tech stocks that investors should keep an eye on, including Arista Networks (ANET). Kelleher points to Arista's business model, particularly its data centers, as a key factor in his choice \"They're truly the first real cloud-based networking company. They send to serve what they call cloud titans which would mean Google Cloud (GOOG, GOOGL), Microsoft Azure (MSFT), AWS or Amazon (AMZN),\" Kelleher says. \"So, they do serve that vertical which is a big part of their business, but they also serve enterprise customers and pushing into smaller enterprises and pushing up into the carrier space.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino. - Jim, there's another name I want to ask you about, that is not one, even though it's a big company, it's not one that we talk about as often. And it's Arista Networks. Also one of your picks here, and one that you think is going to benefit from the continued AI boom. This like NVIDIA had a good year last year, not quite as good, but it did almost double. So where does it fit into that whole ecosystem? JIM KELLEHER: Well, so, it's just a great business they are in anyway, connecting data centers. We look at, we look at the massive amount of computing power needed but all that information, all that data needs to traverse from data center to its ultimate destination. So you need networking elements. They're truly the first real cloud-based networking company and they tend to serve what they call cloud Titans, which would mean basically Google Cloud, Microsoft, Azure, AWS, or Amazon. So they do serve that vertical, which is a big part of their business, but they also serve large enterprise customers, and they're pushing into smaller enterprises, and they're pushing up into the carrier space. So they originally guided that after a great 2022, their cloud business would be down in 2023. And then, of course, here comes ChatGPT at the end of 2022, and then gathering momentum through the year. And everyone wanting to be in on the gold rush. So their cloud business related specifically to generative AI has really taken off. And they're another one where the sky is the limit, until we see how this business really shapes out. But because it is so early in the generative AI delivered as a cloud service day, we're not sure how big it's going to be. But we will see, and we certainly think Arista, in the same way that NVIDIA is uniquely positioned to drive things in terms of fueling large language models, we think Arista is uniquely positioned to deliver generative AI across the networking element. Related Quotes "
}