{
    "title": "Preylock Scores $181M Refi on Nvidia HQ in Santa Clara",
    "date": "1/26/2024",
    "url": "https://therealdeal.com/sanfrancisco/2024/01/26/preylock-scores-181m-refi-on-nvidia-hq-in-santa-clara/",
    "text": "search JPMorgan provides senior mortgage and mezzanine loans on 551K sf office hub SHARE THIS ARTICLE FONT SIZE  Secure a long-term tenant — whose stock price has quadrupled over the last year — and lenders will come. Preylock Holdings has scored new debt to finance Nvidia’s sprawling headquarters in Santa Clara, according to a report from ratings agency KBRA. JPMorgan Chase Bank gave Preylock a $130 million senior mortgage and a $50.5 million mezzanine loan, backed by the AI software company’s roughly 550,000-square-foot office and lab campus. The five-year senior loan has a fixed interest rate of 6.88 percent. The senior mortgage will probably become part of a commercial mortgage-backed securities loan, the KBRA report said. The CMBS package is set to close next month, according to data from Trepp. Preylock, based in Los Angeles, used the new debt, plus $8.5 million in equity, to pay off a $167 million loan from Natixis and fund tenant improvement reserves. Preylock bought the campus for $109 million in 2017, records show. Since purchasing the property, Preylock has worked with Nvidia to build out lab space. By signing up, you agree to TheRealDeal Terms of Use and acknowledge the data practices in our Privacy Policy. “The majority of this campus is for research and development — that was helpful in the refi process,” Preylock’s Brett Lipman said, adding multiple lenders were interested in participating in a refinancing deal. Lipman said the entire seven-building campus was appraised last year at $350 million, or about $636 per square foot. Since closing the deal, Preylock has received “multiple unsolicited offers” from real estate firms to buy the office campus, given the tenant and its focus on artificial intelligence, Lipman said, but said the firm’s investor base is “pleased with the campus’ performance to date.” Last year, the campus at 2220 Central Expressway was fully leased to two tenants — Nvidia, which makes computer graphics processors, and Futurewei, a research and development firm focused on open-source technology. But in December, Nvidia decided to take over about 109,000 square feet of Futurewei’s 171,000-square-foot lease, according to KBRA. In June, Nvidia will take over Futurewei’s remaining 62,000 square feet. Under Nvidia’s lease and sublease agreements, the firm pays about $15.6 million in base rent per year and will pay a further $2 million once the June deal is in effect. Nvidia has been a stock market darling over the last year, soaring 208 percent since January 2023. Its market capitalization has skyrocketed to hit $1.5 trillion, from about $370 billion at the beginning of last year. All rights reserved © 2024 The Real Deal is a registered Trademark of Korangy Publishing Inc. "
}