{
    "title": "Nvidia, AMD Shares Offer Over 30% Upside Potential, Analyst Says Ahead Of \nEarnings: What's Driving The Ch",
    "date": "1/16/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36636821/nvidia-amd-shares-offer-over-30-upside-potential-analyst-says-ahead-of-earnings-wha",
    "text": "High-flier Nvidia Corp. NVDA, Advanced Micro Devices, Inc. AMD and a few other chip makers received price target boosts from KeyBanc Capital Markets on Monday. The Analyst: John Vinh maintained his Outperform ratings on AMD, Nvidia, Arm Holdings plc ARM,  Micron Technology, Inc. MU and Qualcomm, Inc. QCOM. The analyst lifted the price target for each of these, with the upward adjustments as follows: See Also: Best Semiconductor Stocks The Semiconductor Thesis: According to KeyBanc’s supply-chain investigation, the findings were mixed, indicating overall weak trends in broad end-demand. There’s inventory destocking in auto and industrial markets, the PC industry remains stagnant, iPhone trends are weak in China, and traditional server demand is also low, as mentioned by Vinh. Android smartphone demand, however, has sustained, the analyst said. He also noted strong AI-related demand. Vinh said he sees positive implications for AMD due to a meaningful inflection in demand for the MI300X AI accelerator, positioning the company on track to derive $8 billion in data center GPU revenue in 2024. Genoa server processor will likely continue to gain share versus Intel Corp’s INTC Sapphire Rapids in 2024, giving AMD a 30-35% market share in servers, he said. The implications for Nvidia are mixed, Vinh said, as he noted that the company lowered its AI forecast for the second half of 2024, likely due to its desire to diversify its CoWoS capacity. “Despite the reduction, NVDA's AI capacity is well in excess of Street estimates and enough to support over $100B in data center revenues in CY24,” he said. Semiconductor Price Action: The iShares Semiconductor ETF SOXX fell 0.58% to $554.14 in premarket trading on Thursday, according to Benzinga Pro data. The ETF has shed 3.3% so far in January after advancing over 67% in 2023. Read Next: Semiconductor Stocks Soar To All-Time Highs: On Track For Strongest Year Since 2008, But Are They Too Expensive Now? Image Source – Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}