{
    "title": "CES 2024: Everything revealed so far, from Nvidia and Sony to the weirdest \nreveals and helpful AI",
    "date": "1/12/2024",
    "url": "https://techcrunch.com/2024/01/12/ces-2024-everything-you-need-to-know/",
    "text": "CES 2024 is here! The TechCrunch team is in Las Vegas this week to take in all of the action and decipher what it means to you. You already know what we’re expecting, so sit back, relax and stay tuned throughout the week as we bring you the products, announcements and startup news that you need to know. Kicking off the first day were some bigger announcements from companies, including Nvidia, LG, Sony and Samsung. Those livestreams have ended, but you can watch most of their archives and catch up right here. And with the event still ongoing, and the show floor open, here’s how you can follow along with our team’s coverage. Or, to dive into each day’s updates directly, you can follow these links: Coast Runner CNC mill shown at CES 2024. Image Credits: Haje Kamps Coast Runner CNC mill shown at CES 2024. Image Credits: Haje Kamps Earlier in the week, Haje Jan Kamps took a closer look at Rownd. Then he found Coast Runner, a new entrant in the desktop CNC milling industry. This company, Haje writes, is promising to make the technology accessible to everyone, from professionals to hobbyists and is breaking down the barriers of traditional CNC milling with a focus on power, compact size and, most importantly, education. In today’s Equity, Alex Wilhelm and Mary Ann Azevedo are joined by Kirsten Korosec and Haje Jan Kamps to discuss, among other things, some of the cool stuff that came out of CES, including this Bane-style mask, ChatGPT in cars and eVTOLs. Haje Jan Kamps is taking another look at 444, a smart pepper spray startup he had written about at CES 2023. 444, he writes, is back again, now with a Mace partnership under its belt and about to start manufacturing. Nanoleaf’s new Matter-compatible indoor light strips. Image Credits: Nanoleaf Nanoleaf’s new Matter-compatible indoor light strips. Image Credits: Nanoleaf With all of the collaboration — and CES announcements — between top electronic companies to get Matter, the smart home networking protocol, off the ground, 2024 could be Matter’s best year yet. Kyle Wiggers has a list of the devices to show us why. Image Credits: Louise Image Credits: Louise After seeing all the examples of artificial intelligence baked into the booths of CES, Devin Coldewey put together a list of gadgets, products and software he thought actually might do some good. Also, Haje Jan Kamps writes about the MMGuardian, a smartphone produced in collaboration with Samsung that’s tapping into the power of AI to make phone use safer for kids and teenagers. Harri Weber and Sean O’Kane discuss the examples of hydrogen-power vehicles (TechCrunch+ gets into that too) on the CES floor and why it’s now a popular alternative energy after previously fizzling out. Or, they write, “is it yet another example of companies making promises at CES that they won’t be able to keep?” Image Credits: Polestar Image Credits: Polestar Kirsten Korosec caught up with Polestar CEO Thomas Ingenlath who discussed the integration of the Google built-in, a branded product that embeds Google apps and services directly into the company’s EVs. Don’t worry, Ingenlath says the EV maker isn’t dropping Android Auto or Apple CarPlay as a result. eyeQ shown off at CES 2024. Image Credits: Haje Kamps (opens in a new window)/ TechCrunch eyeQ shown off at CES 2024. Image Credits: Haje Kamps (opens in a new window)/ TechCrunch With cameras in different places, it’s often difficult to maintain eye contact with someone on video calls. There is AI for that, however, one company is taking a different approach. EyeQ is developing a device that attaches to your laptop and, through the use of a mirror, enables you to maintain eye contact with the person you’re speaking to, even while looking at your screen. A Hyundai Motor Co. Nexo fuel cell electric vehicle displayed at the 2021 Ulsan International Hydrogen Energy Exhibition & Forum (H2WORLD) in Ulsan, South Korea, on Wednesday, Nov. 10, 2021. South Korea will cut prices of liquefied natural gas needed to produce hydrogen for fuel cell vehicles for three years to encourage usage of the technology. Photographer: SeongJoon Cho/Bloomberg via Getty Images A Hyundai Motor Co. Nexo fuel cell electric vehicle displayed at the 2021 Ulsan International Hydrogen Energy Exhibition & Forum (H2WORLD) in Ulsan, South Korea, on Wednesday, Nov. 10, 2021. South Korea will cut prices of liquefied natural gas needed to produce hydrogen for fuel cell vehicles for three years to encourage usage of the technology. Photographer: SeongJoon Cho/Bloomberg via Getty Images As Tim De Chant notes, Hyundai has invested in hydrogen fuel cells for decades, but it has also been one of the more successful legacy automakers at navigating the electric transition. So it’s odd now that a company with so much momentum on its side would throw a hydrogen Hail Mary at CES. Meanwhile, Haje Jan Kamps had a lot of time to contemplate how Siri works while driving to Las Vegas. He shares some areas where Apple’s voice assistant, Siri, is being left in the dust by its competitors. Image Credits: Whispp (opens in a new window) Image Credits: Whispp (opens in a new window) Whispp is working to change the game for individuals with speech disorders and voice disabilities, bringing voice boxes into the current millennium with its groundbreaking AI-powered assistive speech and phone-calling app. The company launched its newest phone-calling feature that converts whispered and vocal cord-impaired speech into a user’s natural voice in real time. Rownd CNC lathe at CES 2024 in Las Vegas. Image Credits: Rownd Rownd CNC lathe at CES 2024 in Las Vegas. Image Credits: Rownd Haje Jan Kamps was keeping tabs on Rownd’s new tabletop CNC lathe and got to see it in action this week. He writes that what sets Rownd Lathe apart is not just its relatively affordable hardware (the machine retails at around $5k) but the accompanying software that democratizes the design process, enabling beginners to easily create or utilize pre-made designs from the open-source Rownd Library. Watch it craft a chess pawn. Zoe Care smart plug. Image Credits: Zoe Care Zoe Care smart plug. Image Credits: Zoe Care Devin Coldewey found what Zoe Care was doing in the area of fall detection and elderly autonomy interesting. The company uses existing Wi-Fi signals (and the way our bodies change how Wi-Fi reception works) to detect humans and their activities. Unlike the Serenity desktop fall detection network we discussed earlier this week, Zoe’s device doubles as a smart plug, and uses a sensor to gather and analyze Wi-Fi signals. If a fall is detected, these signals are translated into alerts on a mobile application. Covering up to 800 sq. ft., just one device can secure multiple rooms or even an entire floor, making it an efficient, cost-effective solution. A red car illustration with a loading bar on the windshield. Image Credits: Lyudinka/Getty Images (modified by TechCrunch) A red car illustration with a loading bar on the windshield. Image Credits: Lyudinka/Getty Images (modified by TechCrunch) That’s the question Harri Weber set out to answer after hearing the phrase uttered all over the CES floor. In it’s most simplest definition, it’s a vehicle defined by software. However, as Harri spoke with various experts, we learn the term can mean various things. Go inside the journey to find out why this is such a popular automotive buzzword. Image credits: LG Image credits: LG One thing is consistent throughout every CES: weird and unexpected gadgets and gizmos appear from unexpected places. We have a rundown of some of the most noteworthy products and services here, which include expensive binoculars with birdwatching AI, voice-absorbing muzzles, pay-as-you-go bathroom access and a router that tries to fit your aesthetic. Image credits: Haje Kamps / TechCrunch Image credits: Haje Kamps / TechCrunch Beyond the outright strange products and platforms, there are some hidden gems amid the big booths and name brands at CES. Our own Haje Jan Kamps has highlighted several already that stand out from the crowd. He gave Breggz’s $2,000 earbuds a listen and discovered they actually deliver on their price point for audio perfectionists. He took a look at Augmental’s impressive ambitions to create accessible interfaces that can accommodate for voiceless communication. And he explored Nowatch’s purposeful fitness tracker that uses AI to keep you aware of your health goals without overly stressing you out. Image Credits: Kirsten Korosec Image Credits: Kirsten Korosec Supernal’s electric vertical takeoff and landing (eVTOL) aircraft got a showcase from its parent company Hyundai Motor Group on the ground in Las Vegas, as the so-named S-A2 moves closer to its planned 2028 launch for shuttling passengers. Head here for a full rundown on the aircraft, and the challenges in expanding airborne mobility. Image Credits: Devin Coldewey / TechCrunch Image Credits: Devin Coldewey / TechCrunch Mobinn, a new spinoff from Hyundai, is taking to CES to show off how its new delivery robot can use its flexible wheels to navigate stairs and changes in elevation to drop off deliveries, with tests already being conducted in Korea. Climb aboard the full story here. Image Credits: Walmart Image Credits: Walmart Walmart president and CEO Doug McMillon shared some new technologies the retail giant has been working on, including augmented reality (AR), drones, generative artificial intelligence, and other AI tech meant to improve the shopping experience for customers. Within the presentation were some new tools for managing product search and replenishment and a new beta AR social commerce platform called “Shop with Friends.” Get the scoop on all of the new products. Image Credits: Devin Coldewey / TechCrunch Image Credits: Devin Coldewey / TechCrunch Put this in one in the “thoughtful” category. OneCourt, a startup founded by recent University of Washington graduates, debuted a lap-top miniature field that enables someone who is blind or with low vision feel the position of sports players and the ball in near real time. The OneCourt team takes this information and transmits it to a haptic display with a touchable cover imitating the pitch or field lines. See how it works. Image Credits: rabbit Image Credits: rabbit Devin writes that the idea behind the $200 rabbit r1 is simple: “it lets you keep your phone in your pocket when you need to do some simple task like ordering a car to your location, looking up a few places to eat where you’re meeting friends, or finding some lodging options for a weekend on the coast. Instead of pulling out your phone, unlocking it, finding the app, opening it, and working your way through the UI (so laborious!), you pull out the r1 instead and give it a command in natural language.” Now hop over to the story for more. Move over, Siri. The rabbit r1 is a pocket AI assistant that can navigate your apps for you, without you having to pick up your phone. Check out our preview from #CES2024: https://t.co/R6naLv9ckH pic.twitter.com/aUbz0WW1xI — TechCrunch (@TechCrunch) January 9, 2024  Image Credits: Honda Image Credits: Honda First, we have your look at Honda’s upcoming 0 series electric vehicles that is a thin and light take on what Harri writes has typically been a thick and heavy EV trend. The automaker teased two concept vehicles, the Saloon and Space-Hub, and said the first commercial model in its 0 series EV lineup will launch in North America in 2026. Get a look at the specs and more. Next, Vietnamese EV startup VinFast is getting into the electric pickup truck game with the reveal of a new concept called the VF Wild. The truck will have midsize pickup dimensions, and a folding mid-gate to allow the five-foot bed to turn into something functionally closer to an eight-foot bed (when the rear seats are down). Not much else is known at the moment. The company also officially announced plans to start selling its smallest EV, the VF3, outside of Vietnam. Learn more. Meanwhile, Google has a new feature for EV drivers to track and display real-time battery information in Google Maps. The feature is available in EVs with Android Auto, a secondary interface that runs on the user’s phone and wirelessly communicates and projects features like navigation, media and messaging from their Android-based smartphone to the vehicle display. From here, Android Auto shares real-time battery information with Google Maps. Find what your looking for here. Say hello to the Honda 0 series EVs 🚗 The Saloon and Space-Hub concept models made their debut at #CES2024, along with a new H logo. What do you think of their futuristic designs? pic.twitter.com/sBaQC1UAcj — TechCrunch (@TechCrunch) January 9, 2024  Image Credits: Google Image Credits: Google Google and Samsung announced they are combining their sharing solutions into a singular cross-Android solution under the Quick Share name. The new offering grows the network of devices that users can share content with across the Android ecosystem, including Chromebooks. By integrating Google’s Nearby Share and Samsung’s Quick Share, the two experiences create “the best default, built-in-option for peer-to-peer content sharing” across all types of devices in the Android and Chromebook ecosystems, according to the companies. Google also announced that it is working with PC manufacturers like LG to expand Quick Share to Windows PCs as a pre-installed app. Quick Share will start rolling out to current Nearby Share–enabled devices next month. Cherish Health’s Serenity. Image Credits: Haje Kamps (opens in a new window)/ TechCrunch Cherish Health’s Serenity. Image Credits: Haje Kamps (opens in a new window)/ TechCrunch First, Serenity is showing off its fall-detection system for the first time at CES. It’s easy to use — just plug it in, no app or configurations required. It utilizes advanced radar technology and AI to track up to two individuals within a 40-foot range, even through walls, and offers detailed information about someone’s activities. See how Serenity’s technology sets it apart. Next, Vivoo, a company offering a broad range of at-home tests, launched a new test that can detect urinary tract infections (UTIs). Vivoo’s At-Home UTI Test streamlines the diagnostic process for UTIs and utilizes your phone’s camera to record and analyze the color readout of the test strips. It then gives advice and context for the readings in its free app. Meanwhile, Tack One, a Singapore-based startup, unveiled the new generation of its Tack GPS Plus, an AI-powered location technology device to help make sure your kids, elderly parents and pets are safe. Here’s what’s new: longer battery life and subscription fees starting from $2.95 monthly for a two-year subscription plan. The startup launched its GPS tracker in 2021 to address the pain point of the short battery life on the market and lower the tracking service cost, making location tracking extremely affordable. Tack One’s battery lasts 30 days on a single charge and a patent-pending indoor elevation finder feature. Find out more on the specs and pricing. Skyted’s voice capturing mask. Image Credits: Haje Kamps Skyted’s voice capturing mask. Image Credits: Haje Kamps You read about Skyted’s voice-capturing mask last week, now see what it looks like in real life. “We launched a mobile application that will give you information about how big your ‘sound bubble’ is. If, for example, you’re sitting in an airplane, you don’t want the person next to you to hear what you’re saying,” says Gauthier Daridon, connectivity engineer at Skyted, in an interview with TechCrunch at CES in Las Vegas. “So our application will explain that you are ‘perceptible’ and ‘intelligible’ at certain distances.” Get more of the scoop on how it works. Image Credits: Character.AI Image Credits: Character.AI Amazon says it will be the first company to support Matter Casting, the video- and audio-beaming feature of the Matter smart home standard, on its smart displays and smart TVs. When it comes to Amazon’s Prime Video app for Android and iOS, users will be able to cast content to supported Amazon devices — starting with the Echo Show 15 — by tapping the new dedicated Matter Casting button. Beyond that, Amazon says that Matter Casting support will arrive on Fire TVs including smart TVs from Panasonic with Fire TV built in, and — on the app side — Plex, Pluto TV, Sling TV, Starz and ZDF later this year.  Read more. And, Amazon announced back in September that it would be coming out with some new tools to build large language model-powered experiences. Today, we got to see them in action, including new generative AI-powered Alexa experiences, including AI chatbot platform Character.AI, AI music company Splash and Voice AI game developer Volley. All three experiences are available in the Amazon Alexa Skill Store. Learn more about Alexa’s experiences. Image Credits: Intuition Robotics Image Credits: Intuition Robotics Intuition Robotics’ ElliQ, which went on the market last March, and found some success through partnerships with assistive care facilities. After some fresh funding, the company unveils ElliQ 3, featuring some design tweaks like a more powerful hardware, increased memory, updated core processor, a lighter apparatus and – of course – generative AI integration. Read more. Image Credits: Kodiak Image Credits: Kodiak Autonomous trucking startup Kodiak Robotics revealed a semi-truck that founder Don Burnette says “is the linchpin in its plans to launch commercial driverless operations this year.” The company specifically set out to include redundancy in its safety features so that there is a backup in case anything were to fail while on the highway with a driver behind the wheel. Get a breakdown of the mechanical components and safety systems. Fox has partnered with Polygon Labs, a developer of scaling networks for Ethereum, to release an open source protocol — called Verify — for media companies to register their articles, photographs and more. Fox and Polygon are pitching the protocol as a means for outlets to protect their IP while letting consumers verify the authenticity of content. Learn more about the protocol. Image Credits: Ultrahuman Image Credits: Ultrahuman Indian wearable startup Ultrahuman is getting into the smart home game with the upcoming launch of connected hardware that’s designed to monitor the “health” of your home, as its marketing puts it. The device, which it’s calling the Ultrahuman Home, has a price of $349 and a shipping date slated to start in July. Check out the specs. From storage to flight in 30 minutes. A 16-foot road trailer can hold everything needed to take the Helix to uncongested, Class G airspace areas. Image Credits: Pivotal From storage to flight in 30 minutes. A 16-foot road trailer can hold everything needed to take the Helix to uncongested, Class G airspace areas. Image Credits: Pivotal Pivotal, which is backed by Larry Page, has begun U.S. sales of its lightweight electric Helix aircraft, which notably does not require a pilot’s license to be able to fly. That doesn’t mean those paying at least the $190,000 base price will go without mandatory training; a number of rules and regulations still apply. You can get the full breakdown of their launch pricing and specs right here. Mercedes-AMG and will.i.am launch immersive MBUX SOUND DRIVE experience at CES 2024. Image Credits: Mercedes-Benz Mercedes-AMG and will.i.am launch immersive MBUX SOUND DRIVE experience at CES 2024. Image Credits: Mercedes-Benz If you thought that sounded a little ridiculous, contributor Tim Stevens did too — at least until taking part in the startup Sound Drive’s demo at CES that left him feeling surprisingly impressed with the underlying tech. Read his full impressions of what it’s like to experience music “conducted by the road.”  Sony took the final major press conference slot on Monday, with an expected focus around creators; the success of its IP across its gaming, film and streaming studios; and a focus on its partnership with Honda to imagine the mobility space as a “creativity space.” The latter was demonstrated in part by teasing Fortnite in its Afeela car and driving it onstage with a PlayStation 5 controller. Its “digital birth certificate” also reminded us of the brighter side of NFTs, which Haje explains in detail here. Kia PBV Concept Lineup. Image Credits: Kia Kia PBV Concept Lineup. Image Credits: Kia Kia’s new EV vans come with a modular twist. In addition to using a modular powertrain, the vehicles will also have modular tops that allow for many different cabin options. But they remained vague on pricing, specs and expected launch dates for this new fleet of commercial EVs. Read more. Image Credits: Samsung Image Credits: Samsung Meet the new and improved Ballie, Samsung Electronic’s home robot, which it previewed today. It’s around the size of a bowling ball with a battery designed to last two to three hours. Ballie sports a spatial lidar sensor to help it navigate rooms and obstacles, as well as a 1080p projector with two lenses that allows the robot to project movies and video calls and even act as a second PC monitor. Learn more. Expanding beyond cute, rolling robots, Samsung showcased its wider initiatives for connected homes. Aside from expected UI and feature updates for its existing SmartThings home automation platform, Samsung showed off a “map view” for users that creates an interactive home map that even includes animated avatars of residents and pets. Learn more. Also, Samsung devoted some of its keynote speech to its commitment of sustainability. “We start by incorporating recycled materials into some of our most loved products, such as recycled fishing nets in our Galaxy,” said Inhee Chung, VP of corporate sustainability at Samsung. “Smartphones, recycled plastic in our TVs, and recycled aluminum in our bespoke refrigerators. Recycled plastic accounted for 14% of the total plastic used in our products in 2022. And we’re working towards increasing this amount.” Read more. Remember Samsung's Ballie? The round robot first revealed in 2020 has made a comeback at #CES2024. https://t.co/CCO8T1g0lH pic.twitter.com/OkrXr8jgiE — TechCrunch (@TechCrunch) January 8, 2024  Image Credits: Timekettle Image Credits: Timekettle Timekettle announced the X1 Interpreter Hub, a more robust solution, designed for meetings. Timekettle calls it “the world’s first multi-language simultaneous interpretation system.” The system works out of the box, without having to download a separate app. For in-person meetings, two devices are touched together to initiate conversation translation. The handheld devices house earbuds, similar to past Timekettle products. All told, the X1 is capable of supporting up to 20 people at once in five different languages. Read more. LG Signature OLED T. Image Credits: LG LG Signature OLED T. Image Credits: LG Televisions aren’t naturally pretty or used as a design feature, but LG Electronics is out to change that perception. Today, consumer technology giant unveiled what it touts is “the world’s first” wireless transparent OLED TV. The LG Signature OLED T combines a transparent 4K OLED screen with LG’s wireless video and audio transmission technology. Neoplants at CES 2024. Image Credits: Haje Kamps / TechCrunch Neoplants at CES 2024. Image Credits: Haje Kamps / TechCrunch French startup Neoplants is showing off its progress with its houseplants that work as air purifiers designed for the home. The bio-engineered plants can, according to the company, replace 20 “regular” houseplants, as measured by how many pollutants the plants can remove from the air. Image Credits: Samsung Image Credits: Samsung Ahead of Samsung Electronics’ press conference later today, we look at some of its product plans that include a “new generation of products that can be folded inward and outward,” along with “monitor-sized” folding and sliding OLEDs. Samsung also unveiled a “Transparent MICRO LED” display for the first time. GeForce RTX 4080 SUPER. Image Credits: Nvidia GeForce RTX 4080 SUPER. Image Credits: Nvidia Today, Nvidia gets into artificial intelligence in a big way with the unveiling of its GeForce RTX, including the GeForce RTX 40 Super series of desktop graphics cards. Much of these are meant for gaming, and Nvidia said 14 titles will get the RTX upgrade treatment, including Horizon Forbidden West, Pax Dei, and Diablo IV. The RTX 4080 Super starts at $999. Nvidia also announced that its partnership with Getty Images will include a new service for iStock customers, which can create licensable images trained on the existing iStock photo library. Nvidia also showed off ACE, which uses AI to create unique reactions from in-game NPCs, which gives an uncanny valley sheen on top of prompt response dialog. At #CES2024, NVIDIA demonstrated their Avatar Cloud Engine (ACE) for gaming, which aims to give NPCs AI-generated dialogue. pic.twitter.com/QKRervzvjY — TechCrunch (@TechCrunch) January 8, 2024  Speaking of chips, AMD debuted its new Ryzen 8000G processors for the desktop, with a big focus on their AI capabilities.  Image Credits: Bosch Image Credits: Bosch Bosch is showing off two technologies this week in eye-tracking while driving: One will see that you have tired eyes and ask if you need an espresso when you arrive home. If yes, its connect technology will tell your fancy machine to have one ready. The other is a bit more complicated in that it’s developed to track what you’re looking at as you drive. Image Credits: Haje Kamps (opens in a new window) / TechCrunch (opens in a new window) Image Credits: Haje Kamps (opens in a new window) / TechCrunch (opens in a new window) We have a collection of small home appliances for the kitchen, from grills to smart microwaves and everything in between, that is sure to get you cooking this year, if you aren’t already. Image Credits: Volkswagen Image Credits: Volkswagen The German automaker plans to add an AI-powered chatbot into all Volkswagen models equipped with its IDA voice assistant. For now, it’s not available in the U.S. Image Credits: Apple Image Credits: Apple And Apple, in a surprise announcement preempting CES, stole some of the show’s thunder by announcing the Vision Pro will be available in the U.S. The consumer electronics giant confirmed that the Vision Pro will be available in the U.S. starting February 2. Pre-orders for the $3,500 spatial computing device open Friday, January 19. Some companies made announcements ahead of the big event. Check out what’s already made headlines: Withings’ new multiscope device checks vitals for telehealth visits Invoxia has a new smart collar suitable for both cats and dogs This app lets restaurants and coffee shops charge to use the bathroom Aurora and Continental pass first major hurdle in commercial self-driving trucks deal This startup is bringing a ‘voice frequency absorber’ to CES 2024 For just $139, this startup turns your iPhone into a BlackBerry-era relic Qualcomm next-gen XR chip promises up to 4.3K resolution per eye Urbanista integrates Powerfoyle tech with solar-powered headphones Moonwalker robotic shoes get lighter and smarter  "
}