{
    "title": "Nvidia Vs. Palantir: Which AI Stock Has More Upside Potential? - NVIDIA \n(NASDAQ:NVDA), Palantir Technolog",
    "date": "1/8/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36538203/nvidia-vs-palantir-which-ai-stock-has-more-upside-potential",
    "text": "NVIDIA Corp NVDA and Palantir Technologies Inc PLTR are two popular investor choices when it comes to artificial intelligence (AI). Both stocks have had a good run in 2023, with Nvidia stock up 245% and Palantir stock up 168%. In 2024, investors’ key questions are: Let’s first look at whether there’s more room to run. Nvidia’s stock is currently trading at around $490. Consensus price target for the stock stands at $600. This implies an upside over 20% for Nvidia stock. Moreover, BofA Securities analyst Vivek Arya is bullish on Nvidia’s strategic trajectory. Arya sees Nvidia’s next two years being fueled by robust FCF and an evolving approach to recurring revenue. Read More: Nvidia Is Analyst’s Top Sector Pick With Potential $100B FCF For Growth Initiatives Such As AI Palantir, on the other hand, is trading at around $16 with a consensus price target for Palantir stock at $13.21. The stock did have a good run in 2023. However, Palantir stock’s current price is being seen by Wall Street as primarily driven by the AI hype. On Jan. 5, Jefferies analyst Brent Hill downgraded Palantir, expressing concerns about the overhyped artificial intelligence euphoria and lack of a clear monetization strategy. The firm lowered its price target, expecting about 20% downside from the previous close. Also Read: Palantir Faces Scrutiny Over Alleged Contract Breach With NHS: Report While the second question ‘which stock offers more upside’ may appear answered, here’s a quick peek into analyst consensus on the two AI stocks: Analysts who’ve looked at the fundamental business strength behind these two AI picks, also believe Nvidia stock may offer more upside in 2024 — around 30%. An investment in Palantir stock, on the other, appears to be risky per the current analyst consensus on the stock. A forward P/E ratio comparison also hints at more value at the Nvidia front. Trailing P/E for Palantir is currently a whopping 228.29 – hence off the chart! Now Read: Emerging AI Trends In 2024: BlackRock Sees Shift Beyond Semiconductors, Cloud To Model Infrastructure © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}