{
    "title": "The future is here whether you want it or not as AI briefly makes Nvidia \nthe 4th most valuable corporation on Earth with ...",
    "date": "2/13/2024",
    "url": "https://sg.news.yahoo.com/future-whether-want-not-ai-124419267.html",
    "text": "If AI's good for anything, it's for allowing tech companies to summit new, Mansa Musa-like heights in their various market caps. Last month, Microsoft rode the AI boom to a $2.9 trillion valuation, pipping Apple to the post as the most valuable corporation on Earth. And now Nvidia's getting in on the fun, too. Bloomberg reports that Nvidia briefly overtook Amazon yesterday, hitting a market cap of $1.83 trillion in a rally that saw it briefly become the fourth most valuable company in the world behind Alphabet ($1.84 trillion), Apple ($2.89 trillion), and Microsoft (currently $3.09 trillion). And while you might think it's entirely because I finally gave up and forked over an eye-watering amount of money for an RTX 4080, it turns out that, actually, it was because of AI. While other corporations out there are riding the AI wave, it's mostly Nvidia's chips that are making it happen. According to a chart from the Financial Times, Nvidia's estimated revenue from data centre chip spending by the beginning of January 24 totalled about $16 billion, four times higher than Intel's revenue for the same ($4 billion) and eight times higher than AMD's ($2 billion). Even more wild, that's a level of revenue the company has reached in under a year: Around February/March 2023, Nvidia's data centre chip revenue was about even with Intel's at $4 billion. No wonder, then, that the company found itself beating out Bezos in the scrum of yesterday's markets, albeit briefly. By the time markets closed, Nvidia was back down in fifth place with a paltry market cap of a mere $1.78 trillion (imagine!), while Amazon was at $1.79 trillion. There's no reason to imagine Nvidia is going to start falling behind, but it's hard to make predictions about whether it can keep its momentum up. Saxo Bank's Peter Garnry (quoted by Bloomberg) attributed Nvidia's rise to \"riding the investment wave of the current AI boom with massive capital expenditures being deployed in data centres.\" With companies like Microsoft and, well, Amazon rushing to make chips of their own, who's to say how long Nvidia will enjoy its current privileged position? Forest City, a $100 billion luxury development in Malaysia, is banking on tourism to shed its \"ghost town\" image. Four gunmen are among 11 people arrested following a shooting massacre in a packed Moscow concert hall, according to Russia's President Vladimir Putin.  The men were from Tajikistan, according to Russian news reports.  Mr Putin has claimed the gunmen attempted to flee to Ukraine in the aftermath of the mass shooting, in which at least 133 people were killed.  A man allegedly fell from height at Changi Airport Terminal 1, and was taken to Changi General Hospital. Read more. K Shanmugam criticised the Israeli embassy in Singapore's post comparing mentions of Israel and Palestine in the Quran. Here's what he and other ministers said. The series is dedicated to inspirational men and women in Singapore leading healthy and active lifestyles. This week: Pilates instructor Jasmine Lee.  Cara Delevingne just posed naked in the new Stella McCartney campaign alongside a pile of trash and a trio of grey Falabella bags Prince Harry has put the acrimonious rift with his brother behind him to “reach out” privately after being told the Princess of Wales was undergoing treatment for cancer. Childhood fan who is dying of pancreatic cancer managed the home side to victory over Ajax at Anfield in a legends match  The Daily Beast/Getty Images/BBCA controversial British royal commentator is under fire for a “disgusting” tweet ahead of Kate Middleton’s Friday announcement that she has cancer and is undergoing chemotherapy.An hour before the Princess of Wales released the video announcement of her diagnosis, Omid Scobie posted a photo on X, formally known as Twitter, of his alarm clock being set to 6 p.m. GMT. Scobie told The Daily Beast that hearing “there would be an announcement of some kind from the Pala Singapore’s prosecutor filed more corruption charges against former transport minister S. Iswaran, the latest in the biggest political scandal to hit the the city-state in close to four decades. Ukraine's withdrawal under heavy fire in the battle of Avdiivka should be a wake-up call for the US Army, an officer argued.  Italy’s one-euro-home sales have attracted interest in recent few years, but towns like Patrica, located south of Rome, have struggled to offload their empty homes. Ronda Rousey’s name doesn’t hit as hard on this side of the Pond. In America, however, she’s one of the most significant sports personalities of the 21st century. Not only was she the first female superstar of the Ultimate Fighting Championship (UFC), the world’s biggest mixed martial arts (MMA) league, but she was also a key name – possibly the key name – in the increasing mainstream prominence of women’s sport. In the Jilin province of China, a one-year-old Huacaya alpaca named Roi Chun hilariously answers the phone for its owner during a scam call on March 10. As the caller outlines their scheme, the alpaca responds with a constant 'hmm,' much to the caller's confusion and eventual frustration.  The post Lai Li Economical Bee Hoon: Affordable fried noodles, $0.80 chee cheong fun & Nyonya kueh by elderly couple appeared first on SETHLUI.com. Islamic State published a photo of the four attackers it said had “dealt a strong blow to Russia with a bloody attack” on Saturday, in a post detailing how it planned and conducted the assault on a Moscow concert hall that claimed more than 130 lives. The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach  British driver George Russell was left in a state of panic after his high-speed crash in Sunday’s Australian Grand Prix as he was left stranded in the middle of the Albert Park track in his stricken Mercedes. Videos posted on Russian social media showed the attackers calmly walking through Crocus City Hall and shooting people, with more than 140 now dead Liam Jones was onboard the MSC Euribia departing from Southampton for trip to Europe when tragedy struck "
}