{
    "title": "PS5 in Decline; Nvidia Trumps Amazon; Waymo Recall",
    "date": "2/14/2024",
    "url": "https://www.cmcmarkets.com/en/opto/ps5-in-decline-nvidia-trumps-amazon-waymo-recall",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. 5 Top Stories By OPTO  14 Feb 2024, 16:55 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. “Looking ahead, PS5 will enter the latter stage of its life cycle,” said Senior Vice President Naomi Matsuoka during Sony’s [SONY] earnings call on Wednesday. “For this reason, we expect the annual sales pace of PS5 hardware will start falling from the next fiscal year.” Sony logged record revenue in the quarter ended in December, and announced it is to list its financial arm in October 2025, reversing a $3.7bn take-private deal in 2020. Alphabet’s [GOOGL] self-driving vehicle unit Waymo has filed a voluntary recall notice with federal regulators, it announced Tuesday, after consulting with the National Highway Traffic Safety Administration and reviewing two incidents that took place in Phoenix in December last year. The recall will allow Waymo to update its vehicles’ software in light of the incidents, when two of its robotaxis crashed into the same truck in quick succession. Since the start of February Jeff Bezos has sold almost 24 million shares in Amazon [AMZN], worth more than $4bn in total. Last November, Amazon disclosed an agreement that would let him sell up to 50 million shares by 2025. He has not clarified the reasons for the sale, but Bloomberg speculated that it could be related to his relocation to Miami from Seattle (Washington state recently implemented a 7% capital gains tax). After a five-month investigation, the European Commission has found that Apple’s [AAPL] iMessage and Microsoft’s [MSFT] Bing, Edge and Microsoft Advertising do not qualify as gatekeeper services. This means they will not fall under the EU’s Digital Markets Act, which takes effect in early March. Lazar Radic, an antitrust expert at the International Center for Law and Economics, told Reuters that the decision “is a good sign that the Commission has considered market realities”. Having overtaken Amazon on Tuesday, Nvidia [NVDA] was poised to take Alphabet’s [GOOGL] position as the third-most valuable company on Wall Street. Nvidia closed the day with a stock market value of $1.78trn, ahead of the e-commerce giant’s $1.75trn. Alphabet, meanwhile, fell 1.6%, leaving its market cap at $1.81trn — within reach of the chipmaker, which is surging on seemingly inexhaustible interest in AI Disclaimer Past performance is not a reliable indicator of future results. CMC Markets is an execution-only service provider. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. CMC Markets does not endorse or offer opinion on the trading strategies used by the author. Their trading strategies do not guarantee any return and CMC Markets shall not be held responsible for any loss that you may incur, either directly or indirectly, arising from any investment based on any information contained herein. *Tax treatment depends on individual circumstances and can change or may differ in a jurisdiction other than the UK. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles 5 Top Stories Temu Splashes Out; SoftBank Soars; Paytm On the Brink? PDD-owned e-commerce app Temu splashed some serious cash on advertisements during Sunday’s Super Bowl in the US. 13 Feb 2024 5 Top Stories Nissan Tumbles; Google AI Fund; Waymo Torched The automaker’s share price saw its biggest drop in more than two decades, wiping out $1.8bn of its market value, after quarterly earnings disappointed. 12 Feb 2024 Analysis “Incredible Margin Growth” — Dave Mazza on Meta’s Bumper Earnings Dave Mazza, Chief Strategy Officer of Roundhill ETFs, explains why Meta’s Q4 earnings led to a record single-day market cap gain. 09 Feb 2024 5 Top Stories Arm Pops; Uber Turns Profit; Disney + Fortnite Shares in Arm shot up by more than 37% Wednesday: huge news for SoftBank, which owns some 90% of its outstanding stock. 08 Feb 2024 © 2024 CMC Markets Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money. CMC Markets UK plc (173730) and CMC Spreadbet plc (170627) are authorised and regulated by the Financial Conduct Authority in the United Kingdom. "
}