{
    "title": "As Magnificent Seven Stocks Nvidia, Meta Soar, These Tests Loom",
    "date": "2/5/2024",
    "url": "https://www.investors.com/research/how-to-find-the-best-stocks-to-buy/nvidia-stock-meta-uber-soar-as-these-tests-loom/",
    "text": "BREAKING: Futures Fall Slightly Meta Platforms (META) gapped up more than 20% on earnings last week, while Nvidia (NVDA) flies to yet another record high ahead of it next performance report on Feb. 21. But a busy week of Fedspeak and a slew of earnings reports from fellow IBD Leaderboard stocks loom for Wall Street watchers. IBD Leaderboard stocks reporting this week include ELF Beauty (ELF), ARM Holdings (ARM), Trex (TREX), Spotify (SPOT) and Uber Technologies (UBER). Investment management firms KKR (KKR) and Apollo Global Management (APO) are also on deck. From the IBD Leaderboard watchlist, travel stock Expedia (EXPE) will let fly its numbers on Thursday, while industry peer Booking Holdings (BKNG) is scheduled for Feb. 22. Wall Street hails Nvidia and Meta as Magnificent Seven stocks. But the latest list of new buys by the best mutual funds, which comes out Friday, highlights a different set of seven stocks showing magnificent demand. In addition to Nvidia and Meta, Uber also makes this stock screen as well as IBD Leaderboard. Top money managers on the list scooped up a massive $12.4 billion in Uber stock. They also invested an estimated $5.5 billion in Nvidia and $1.4 billion in Meta. Microsoft (MSFT) also joins other members of this crop of seven companies raking in more than $1 billion in this month's report, including Fair Isaac (FICO), Arista Networks (ANET) and Fiserv (FI). With the Nasdaq, Dow and S&P 500 all trading right around their all-time highs, IBD's recommended stock market exposure level stands at the highest-possible 80% to 100% range. As a result, Nvidia, Meta, Uber stock and many other IBD Leaderboard companies are now extended beyond their buy ranges. ServiceNow (NOW), Novo Nordisk (NVO), Spotify, ELF, Apollo and ARM stock fit that bill. Cybersecurity stock Zscaler (ZS) also joins that group. But ZS stock fell just under 5% Monday on news the company's chief operating officer suddenly resigned amid management changes. With earnings due Tuesday, KKR stock has cleared an 85.66 buy point in a flat base. The alternative asset management giant currently trades right around the top of the buy zone. Earlier, KKR cleared a trendline near 83. ELF Beauty, which also reports Tuesday, completed a three-weeks-tight pattern near 161. Clearing this level is an opportunity to add some more shares. But note that the follow-up buy should only be a fraction of the full-size position, and it's always risky to make new stock purchases right before a company reports. Follow Matthew Galgani on X (formerly Twitter) at @IBD_MGalgani. YOU MAY ALSO LIKE: Nvidia Stock Spikes To Record High After Goldman Sachs Endorsement Pre-Earnings Uber Option Trade Offers 129% Annual Return Top Funds Kick Off 2024 With Huge Bet On MSFT Stock — And 1 Sector Stock Picks: Google, Nvidia Reveal 7 Telltale Traits To Monitor Identify Bases And Buy Points With This Pattern Recognition Tool 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500 stock Super Micro has more than tripled. Tesla remains the... 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}