{
    "title": "Nvidia is now worth as much as the stock market in China |",
    "date": "2/10/2024",
    "url": "https://cryptodnes.bg/en/nvidia-veche-struva-kolkoto-fondviya-pazar-kitai/",
    "text": "Nvidia's meteoric rise has caught the attention of market watchers, as the company's valuation now equals that of the entire Chinese stock market. In a recent Bank of America report, Michael Harnett, chief investment strategist, highlighted Nvidia's stunning $600 billion jump in value over the past few months, which increased its market capitalization to $1.7 trillion. This puts the tech giant on par with the combined market value of all Chinese companies listed on the Hong Kong Stock Exchange. The chipmaker's rise has been nothing short of extraordinary, with its market capitalization nearly quadrupling since the start of last year. Its shares have risen 2023% in 239 alone, and they continued to gain 41% this year through Thursday's data. Impressively, only four public companies in the US can boast higher valuations. Meanwhile China's economic problems weighed on its stock market, with weak growth and a prolonged downturn in the real estate market dampening investor sentiment. The country is grappling with deflationary pressures, further exacerbating the situation. The Hang Seng Index, a key metric for Hong Kong-listed Chinese stocks, has fallen a significant 26% over the past year, and is down a further 8% year-to-date. Despite the difficult economic context, Hartnett believes there may still be opportunities for savvy investors. Identifying Chinese companies with sustainable management, strong financial positions and stable earnings can bring significant returns. Drawing parallels with Japan's experience in the 90s, Hartnett points out how a select group of 15 companies weathered the storm and saw a remarkable 400% growth in bull market conditions.  The CEO of a hedge fund valued at $60 billion has expressed concern about the rapid growth of the US national debt. Reports suggest that Argentines are increasingly turning to Bitcoin (BTC) as a hedge against currency depreciation instead of the US dollar. In the period between February 2022 and December 2023, India and Russia, which are members of the BRICS, started deals in crude oil worth billions of dollars. A lesser-known Chinese Large Language Model (LLM) has emerged as a potential competitor to the massive generative artificial intelligence (AI) platform ChatGPT developed by OpenAI. QR code to bitcoin address: QR code to ethereum address: Your email address will not be published. Save my name and email in this browser for the next time I comment. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. All Bitcoin, Ethereum, Cryptocurrencies, Blockchain and Fintech news in one place! "
}