{
    "title": "Forget Nvidia: 2 Tech Stocks to Buy Instead",
    "date": "2/9/2024",
    "url": "https://www.fool.com/investing/2024/02/09/forget-nvidia-2-tech-stocks-to-buy-instead/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Technology stocks are having a great few months as investors regain confidence in this sector thanks to new catalysts such as artificial intelligence (AI). This goes part way to explaining why the tech-laden Nasdaq-100 Technology Sector index is up a solid 45% in the past year. Nvidia (NVDA 3.12%) played a central role in driving the impressive surge in tech stocks. Shares of the graphics card specialist have tripled over the past year thanks to AI. The company will release its fiscal 2024 fourth-quarter results later this month, and analysts expect Nvidia's revenue to increase a solid 119% year over year to $59 billion. What's more, Nvidia's earnings are set to jump from $3.34 per share in fiscal 2023 to $12.30 per share in fiscal 2024 as per consensus estimates. Even better, Nvidia could sustain its healthy stock market momentum as analysts have been raising their growth estimates thanks to the company's dominant position in AI chips. That could lead to eye-popping multiyear growth for the company.  NVDA Revenue Estimates for Current Fiscal Year data by YCharts However, Nvidia's expensive price-to-sales multiple of 37 and price-to-earnings multiple of 87 may lead value investors to look for better bets in the technology space (even if Nvidia is able to justify its expensive valuation by delivering stellar growth). The good news is that there are a couple of other tech stocks significantly cheaper than Nvidia that investors should consider buying right away before they fly higher. Share prices of Meta Platforms (META 0.36%) shot up 155% in the past year, and the company's latest earnings report suggests that the rally is here to stay. Meta stock jumped 20% on the day after the company released its fourth-quarter 2023 results on Feb. 1. The social media giant reported a nice year-over-year jump of 25% in revenue to $40.1 billion, while earnings increased a whopping 103% to $5.33 per share. The numbers were well ahead of Wall Street's expectations, as analysts would have settled for $4.82 per share in earnings on $39.1 billion in revenue. More importantly, Meta's revenue guidance of $34.5 billion to $37 billion for the current quarter turned out to be better than consensus expectations of $33.9 billion. The midpoint of the guidance range points toward a year-over-year increase of 25%. However, there was another factor that led to a sharp spike in Meta stock following its earnings release -- the company's announcement that it is initiating a quarterly dividend. Meta will pay a cash dividend of $0.50 per share next month, and it intends to pay a quarterly dividend going forward. Given that the digital ad market that Meta serves is set to grow 13.2% in 2024, up from last year's 10.7% growth, it won't be surprising to see the company sustain its impressive growth momentum through 2024. Additionally, digital ad spending is predicted to increase by 11% in 2025, followed by almost 10% growth in 2026. All this indicates why analysts recently raised their growth expectations for Meta.  META Revenue Estimates for Current Fiscal Year data by YCharts Meta stock is trading at 9 times sales right now, which is almost in line with its five-year average sales multiple and is a significantly cheaper multiple than Nvidia. Assuming it can maintain such a multiple next year and hits $197 billion in revenue, as the chart above indicates, its market cap could increase to $1.77 trillion over the next three years. That would be a nice jump of 46% from its current market cap. However, if the market rewards Meta with a higher sales multiple thanks to its accelerating growth, it could deliver more upside. That's why investors looking to buy a top tech stock right now should consider buying Meta before it jumps higher. Amazon (AMZN 0.40%) is another tech stock that got a nice boost following the release of its fourth-quarter 2023 results on Feb. 1. Shares of the e-commerce and cloud computing giant jumped 8% as the company's revenue increased 14% year over year to $170 billion, beating the $166.2 billion consensus estimate. Amazon's earnings, on the other hand, jumped from just $0.03 per share in the year-ago period to $1 per share last quarter, handsomely exceeding the $0.80 per share Wall Street estimate. The company's robust year-over-year growth was driven by improvements across all of its business segments, while a slower increase in its expenses led to a strong bottom-line jump. What's more, Amazon is expecting to deliver double-digit growth once again in the current quarter at the midpoint of its guidance range. It forecasts revenue to land between $138 billion and $143.5 billion in the current quarter, an increase of 8% to 13% over the prior-year period. The company's operating income guidance of $8 billion to $12 billion points toward a big jump from the year-ago period's figure of $4.8 billion, and it is ahead of the $9.1 billion Wall Street estimate at the midpoint. However, don't be surprised to see Amazon clocking faster growth as it has been tapping AI to make its mark in fast-growing markets. First, the company is integrating generative AI tools into its e-commerce platform. It has rolled out an AI-powered shopping assistant, christened Rufus, which Amazon says has been \"trained on Amazon's product catalog and information from across the web to answer customer questions on shopping needs, products, and comparisons, make recommendations based on this context, and facilitate product discovery.\" The company believes that Rufus will make it easier for customers to find and purchase products on its platform. Such tools can help Amazon capture a greater share of the e-commerce market, which is expected to clock 9.4% growth in 2024 and generate $6.33 trillion in revenue. By 2027, the global e-commerce market is anticipated to clock annual sales of over $8 trillion. So, Amazon's focus on giving tools to customers that could help elevate their shopping experience could act as a catalyst for its long-term growth. On the other hand, Amazon is in a nice position to capitalize on the fast-growing market for AI in the cloud. The company has been collaborating with Nvidia to bring the latest hardware and software to customers so that they can train AI models and build generative AI applications in a cost-effective manner. Amazon Web Services is the top provider of cloud infrastructure services in the world, with a market share of 32%. With the market for AI in the cloud predicted to jump to $887 billion in 2032 from $43 billion in 2022, Amazon's focus on this market could eventually lead to huge gains in the long run. As such, it is not surprising to see why analysts are predicting the company's earnings to increase at an impressive annual rate of 87% for the next five years. That's why investors would do well to buy Amazon stock while it is trading at a relatively cheaper 59 times trailing earnings when compared to Nvidia's multiple of 83, especially considering that the latter's earnings are forecast to grow at 102% a year for the next five years. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Meta Platforms, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}