{
    "title": "Singtel data centre unit partners Nvidia in key deals to become leading \nplayer in region",
    "date": "1/31/2024",
    "url": "https://www.straitstimes.com/business/singtel-data-centre-unit-solidifies-aim-to-be-leading-player-in-region-with-key-deals",
    "text": "SINGAPORE - Singtel’s data centre subsidiary, Digital InfraCo, moved to solidify its ambition to become the region’s leading infrastructure provider, especially in the rapidly growing area of artificial intelligence computing, by inking agreements with key industry players. On Jan 31, the company signed four memorandums of understanding with a slew of partners who are vital to the ecosystem of the data centre business. These include chipmaker Nvidia, whose powerful graphics processing units (GPUs) enable machine learning and other data-intensive processes; regional suppliers of renewable energy to aid in the company’s push towards net zero; technology businesses that will help create a test bed for improving power and water efficiency; and five institutes of higher learning that will produce a pipeline of talent for the industry. On the agreements signed, Digital InfraCo chief executive Bill Chang said: “As we build out our data centre business, we are putting in place a purpose-driven, fully aligned group of ecosystem partners with distinctive capabilities and unique platforms that will help us grow this digital infrastructure in an AI world – sustainably and responsibly.” Singtel on Jan 31 also launched the Nxera brand for its entire data centre business, which was previously known as RDC, or Regional Data Centres. Speaking at the brand launch at the Singtel headquarters in Comcentre, Deputy Prime Minister Heng Swee Keat said that the digital economy in Asean is projected to more than triple to US$1 trillion (S$1.3 trillion) by 2030, up from about US$300 billion today. He said this figure could further double if the region is able to achieve digital integration and harmonisation through the proposed Asean Digital Economy Framework Agreement, which is slated to be the world’s first for a regional grouping. With the company’s collaboration with Nvidia, Singtel’s Digital InfraCo will become the chipmaker’s cloud partner in the region. The aim is to provide access to AI for both large and small businesses through the company’s data centres that will host Nvidia’s GPU clusters, said Mr Chang. Although Mr Chang, who is also Nxera’s CEO, declined to put a value on its planned investment in Nvidia chips for the AI segment, recent developments provide some clues. For one, Malaysian conglomerate YTL announced in December it is partnering Nvidia to develop AI infrastructure in the nation in a US$4.3 billion investment deal. For Digital InfraCo, Mr Chang expects its investment in GPU chips to be organic, rising in step with demand from end users. When asked if the branding exercise was in preparation for a listing, Mr Chang told The Straits Times that “Nxera’s shareholders are the ones to make such a decision”. He said: “It’s only been less than a year since the RDC unit was spun off as a separate business line, with (private equity firm) KKR investing $1.1 billion for a 20 per cent stake in the company in September 2023.” Mr Chang also shared that at this stage, “we currently have only two data centres operational at 60MW, as the older and less energy efficient ones will be phased out”. Meanwhile, other new and sustainable AI data centres are still being built in Singapore and across the region, said Mr Chang. When these are completed over the next few years, they will raise Nxera’s capacity beyond 200MW, he said. “For now – all I can say is: Watch this space,” he added. Mr Chang elaborated on some of the targets that Nxera will need to meet in the interim. “For one, we are committed to reducing our carbon emissions to meet our operational net-zero target in emissions by 2028 and to do this, we aim to make all our data centres the most sustainable and energy efficient in the region to power the AI revolution.” A data centre is perfectly efficient if its PUE (power usage effectiveness) is exactly 1, such that the only power being used is for the computing equipment, while nothing is wasted on any other uses. “We will leverage our experience with DC Tuas, which is expected to have a full-load PUE of 1.23, and replicate that across all our data centres,” Mr Chang said. On the talent front, a Regional Sustainable Data Centre Academy will be formed by mid-2024 with the Singapore Institute of Technology and the Nanyang, Singapore and Temasek polytechnics, as well as the Institute of Technical Education, as Nxera’s initial partners. “While all five institutions have existing data centre-related course work, we want to help shape the curriculum and support everyone from undergrads to those undertaking continuing education – from our own employees to those of our partners and suppliers,” said Mr Chang. “The goal is to produce at least 150 professionals annually – from skilled technicians, all the way through to those doing their master’s degree.” Mr Chang said the company will not only jointly develop curriculum and training programmes with these institutions, but will also provide opportunities for the students to gain hands-on experience through internships. Commenting on the hype surrounding AI at the moment, Mr Chang said he believes that the industry is still at an early stage. He likened it to the “Palm Pilot moment”, just before smartphones took the world by storm. “We will probably see AI become mainstream in under five years,” he said. Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2024 SPH Media Limited. All rights reserved. "
}