{
    "title": "Could AMD Become the Next Nvidia?",
    "date": "1/15/2024",
    "url": "https://www.fool.com/investing/2024/01/15/could-amd-become-the-next-nvidia/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia captivated Wall Street last year as its business exploded amid a boom in artificial intelligence (AI). Its stock is up 224% year over year alongside soaring earnings. Increased interest in AI caused a spike in demand for graphics processing units (GPUs), with Nvidia best positioned to supply its hardware to the entire market. The chipmaker likely has plenty of room left to run. However, explosive growth over the last 12 months has made it a slightly expensive investment option. As a result, many investors are now on the hunt for the \"next Nvidia\" -- a company with the infrastructure to meet rising chip demand and deliver significant gains similarly. Advanced Micro Devices (AMD 0.54%) looks like a no-brainer alternative to Nvidia. The company has solid positions in many of the same industries and has held the second-largest market share in desktop GPUs for years. Meanwhile, this year, AMD will ship a new AI GPU designed to challenge Nvidia's offerings. AMD might not be able to dethrone Nvidia. However, with how rapidly markets like AI are growing, there will likely be room for Nvidia to retain its dominance and for AMD to become a titan of AI chips. The launch of OpenAI's ChatGPT in November 2022 made many rethink what is currently possible with AI. Excitement soared as the public realized the technology could advance countless industries, from healthcare to consumer products, education, manufacturing, autonomous vehicles, and more. Nvidia shined as the primary chip supplier to the rapidly expanding market. However, its success highlighted how far other chipmakers, like AMD, had fallen behind in AI. As a result, AMD spent the rest of the year developing hardware that could compete with Nvidia, and its new chips are finally here. AMD unveiled the MI300X AI GPU last December, with the company promising it is on par with Nvidia's H100 for training and that it beats the H100 for inference by 10% to 20%. AMD's new chip is already turning heads, with Microsoft announcing in November that its Azure cloud platform would become the first such platform to use the MI300X to optimize its AI capabilities. Microsoft holds a 49% stake in OpenAI, making the company a powerful partner for AMD. Alongside an agreement with Meta -- which will see it utilizing the new chips as well -- AMD's future in AI looks bright. In 2023, Nvidia became the first chipmaker to exceed a market cap of $1 trillion. AMD still has a long way to go before coming anywhere close to that figure, with its market cap at $237 billion. However, that could mean it has far more growth potential over the long term. AMD is gearing up for a potentially stellar growth year. If it could match even half of the growth Nvidia enjoyed in 2023, the company's shares could be one of the best investments right now.  Data by YCharts. PE Ratio = price-to-earnings ratio. However, AMD is only just getting started in AI, with its earnings yet to reflect the company's heavy investment in the market. As a result, valuation metrics like price-to-earnings (P/E) and price-to-free-cash-flow ratios (seen in the chart above) show AMD's stock is significantly more expensive than Nvidia's. These metrics help determine a stock's value as they take into account a company's financial health. For both, the lower the figure, the better the value. Over the last year, AMD's free cash flow has plunged 47% to $1 billion, while Nvidia's has soared 360% to over $17 billion. AMD is bleeding money, tanking the value of its shares. Consequently, it might be worth waiting to invest in AMD until its stock reaches a more attractive price point.  Data by YCharts. EPS = earnings per share. Moreover, earnings-per-share (EPS) estimates show Nvidia's earnings could hit $24 per share over the next two fiscal years, while AMD's might reach $5 per share. Multiplying those figures by the companies' forward P/Es (Nvidia's 45 and AMD's 38) yields stock prices of $1,080 for Nvidia and $190 for AMD. If projections are correct, Nvidia's stock would climb 97% over the next two fiscal years, and AMD's would rise 30%. AMD has the infrastructure and experience to someday achieve a position similar to Nvidia's in AI. However, its expensive stock price makes it too much of a risk for now, with Nvidia still a more attractive option. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}