{
    "title": "Nvidia is a fast-growing giant",
    "date": "1/26/2024",
    "url": "https://www.spokesman.com/stories/2024/jan/24/nvidia-is-a-fast-growing-giant/",
    "text": "Subscriber Actions Staff Options Connect With Us With a recent market value over $1.4 trillion, Nvidia (Nasdaq: NVDA) is one of the largest semiconductor companies around, specializing in graphic processing units (GPUs) used for gaming and cryptocurrency mining, among other things, as well as artificial intelligence (AI) technology. Its stock has boosted the wealth of many shareholders, averaging annual growth of more than 60% over the past decade. Nvidia’s stock has often seemed overvalued, keeping many cautious investors away – while the stock kept rising. Recently, though, Nvidia shares, while not bargain-priced, have seemed close to reasonably valued, presenting an opportunity for risk-tolerant long-term investors. Despite its huge size, Nvidia is still growing briskly, with revenue up a whopping 206% year over year in its third quarter and net income up more than 1,250%. Such numbers are not likely to be the norm, though. Remember that stock performances are never guaranteed. Nvidia has rivals looking to take some of its market share, and its business is cyclical, rising or falling along with the economy. On top of that, the U.S. government has restricted chip exports to China and other countries, putting pressure on Nvidia. Still, the stock is worth considering, even if its torrid growth rate slows. (The Motley Fool owns shares of and has recommended Nvidia.) Q. What’s the difference between swing trading and day trading? – M.T., Walnut Creek, California A. Both are short-term trading practices where folks aim to profit from changes, or swings, in a security’s value over a short period. As you might guess, a day trader will buy, say, a certain stock and hold it for only a few minutes or hours, selling it by the end of the day. A swing trader is a little more patient, selling within a few weeks, at most. Both strategies will often employ “technical analysis,” which involves looking for promising patterns in graphs of stock prices without much regard for the underlying businesses. Swing traders may incorporate some “fundamental analysis,” too, assessing the financial health, competitive strengths, growth prospects and more of the companies whose stocks they’re trading. In general, we strongly recommend favoring fundamental analysis and investing in stocks for years if not decades. Short-term trading can seem more like speculating or gambling than actual investing. The Securities and Exchange Commission has warned, “Day trading is extremely risky and can result in substantial financial losses in a very short period of time.” Q. What are some unusual or amusing ticker symbols? – K.B., Potomac, Maryland A. There are plenty! For example: Yum! Brands (YUM), the parent of KFC, Taco Bell and Pizza Hut; National Beverage (FIZZ); Gibraltar Industries (ROCK); Petco Health and Wellness (WOOF); Molson Coors Beverage (TAP); Southwest Airlines (LUV); 3M (MMM); Harley-Davidson (HOG); Olympic Steel (ZEUS); Heineken (HEINY); Ferrari N.V. (RACE); and Viper Energy (VNOM). Before they were bought out, eyewear maker Oakley sported the symbol OO, mattress maker Sealy had ZZ and auction house Sotheby’s had BID. My most regrettable investing move happened decades ago. I went to my broker and told him I wanted to buy stock in steelmaker Nucor in my IRA. The broker said he was expecting it to split. I bought 160 shares in October of 2004. When I looked closer at the stock, I saw that it had just split – weeks earlier. I was too late to have my shares split. My loss on 160 shares was $8,568. – L.W., Missouri The Fool responds: It seems that you might be misunderstanding how stock splits work – as many people do. The good news, though, is that you probably did not lose anything at all, because a stock split doesn’t really alter the value of a stock holding. For example, imagine that you buy 160 shares of a stock for $100 each, spending $16,000. If the stock splits 2-for-1, you’ll get two shares for each of your shares, and the stock price will be adjusted downward proportionately. So you’ll have twice as many shares, each worth about half as much. If the split happened when the stock was still at $100, you’d end up with 320 shares priced around $50 each, for a total value of about … $16,000. We hope you’ve hung on to your shares, because Nucor’s stock has risen more than 650% since you bought, averaging annual gains of 12% – and that’s not even including its dividends. Local journalism is essential. Give directly to The Spokesman-Review's Northwest Passages community forums series -- which helps to offset the costs of several reporter and editor positions at the newspaper -- by using the easy options below. Gifts processed in this system are not tax deductible, but are predominately used to help meet the local financial requirements needed to receive national matching-grant funds.  Get breaking news delivered to your inbox as it happens. With the help of gynecologic oncology specialists at Providence, Amy beat cancer—and found the courage to accomplish things she’d never dreamed of. Follow Us Subscribe Help User Advertising More Contact Us © Copyright 2024, The Spokesman-Review | Community Guidelines | Terms of Service | Privacy Policy | Copyright Policy "
}