{
    "title": "Kore.ai Secures $150M Investment for Advancing Enterprise AI Solutions, \nwith NVIDIA and Others Participating",
    "date": "1/30/2024",
    "url": "https://www.datanami.com/this-just-in/kore-ai-secures-150m-investment-for-advancing-enterprise-ai-solutions-with-nvidia-and-others-participating/",
    "text": " Translation Disclaimer ORLANDO, Fla., Jan. 30, 2024 — Kore.ai, a leader in enterprise conversational and generative AI platform technology, today announced $150 million in funding. The strategic growth investment was led by FTV Capital, a sector-focused growth equity investor with a successful 25+ year track record investing across enterprise technology, along with participation from NVIDIA and existing investors such as Vistara Growth, Sweetwater PE, NextEquity, Nicola and Beedie. The new funding will accelerate Kore.ai’s market expansion and continuous innovation in AI to deliver tangible business and human value at scale. The AI market has seen rapid growth and disruption driven by advancements in technology and shifting user expectations. Gartner estimates the conversational AI market to reach $377 billion in revenue by 2032, up from $66 billion in 2023. This reflects an exponential demand for enhanced customer experiences, streamlined business operations and innovative GenAI applications addressing specific business tasks. Kore.ai provides an enterprise-grade no-code platform to help companies of all sizes power business interactions with AI safely and responsibly while driving significant revenue and cost savings. From conversational virtual assistants to generative AI (Gen AI) applications, Kore.ai’s differentiated platform offers purpose-built workflows, highly configurable tools and a flexible, open architecture that are recognized as the leading approach by customers and analysts. This gives teams the ability to craft custom solutions or deploy pre-built, domain-trained virtual assistants across multiple industries such as banking, healthcare and retail and across a variety of functional roles such as IT, HR and others, to accelerate time-to-value. “We have been working with advanced AI for a decade now – our deep technology expertise and market understanding put us in a prime position to take advantage of the momentum and to do AI right in order to meet growing customer needs,” said Raj Koneru, founder and CEO of Kore.ai. “Sitting above the infrastructure layer and LLM chaos, our open approach grants businesses freedom of choice with built-in guardrails for effective AI implementation. As we look to enhance our Gen AI-powered innovations and drive wider adoption across a variety of market segments, we are pleased to have the backing of FTV Capital, a firm that has significant experience in our space and invaluable connections across the enterprise to augment our exciting growth trajectory.” “We’ve spent significant time examining the landscape and evaluating advanced-AI platforms, and Kore.ai clearly stood out with its proven enterprise-grade platform capabilities, visionary leadership, strong R&D focus, established global customer base and clear path to profitability,” said Kapil Venkatachalam, partner at FTV Capital. “We’re excited to partner with such an experienced and high-caliber team that consistently delivers world-class innovations, and we look forward to leveraging our deep knowledge and network to catalyze Kore.ai’s success.” Market understanding and expertise across diverse use cases Today, several Fortune 2000 companies across a variety of industry verticals leverage Kore.ai to enhance their customer, employee and contact center agent experiences and drive measurable ROI. Customers include leading financial institutions, such as PNC Bank and large global banks, as well as major brands such as AT&T, Cigna, Coca-Cola, Airbus and Roche. Over the past several years Kore.ai has consistently demonstrated triple-digit year-over-year growth in revenues. The company automates 450 million interactions a day for about 200 million consumers and two million enterprise users worldwide. In addition to domestic growth, Kore.ai’s growth has been fueled by rising demand from emerging markets in Asia Pacific, Europe, LatAm and the Middle East. As a result, Kore.ai has added new Global 2000 enterprise customers across major verticals. Kore.ai has been recognized as a leader and an innovator by top analysts, including being named a leader in Gartner’s Magic Quadrant for Enterprise Conversational Al Platforms twice in a row. About Kore.ai Kore.ai is a leading provider of advanced AI technology with a decade of experience in helping enterprises realize business value through the safe and responsible use of AI. The company’s innovative platform, no-code tools and solutions are used to deliver end-to-end customer and employee experiences from automated to human assisted and to build generative AI enabled applications. Kore.ai takes an open approach allowing companies to choose the LLMs and infrastructure that best meet their business needs. Trusted by over 200 partners and 400 Fortune 2000 companies, Kore.ai helps them navigate their AI strategy. The company has a strong patent portfolio in the AI space and has been recognized as a leader and an innovator by top analysts. Headquartered in Orlando Kore.ai has a network of offices to support customers including in India, the UK, Middle East, Japan, South Korea, and Europe. Visit Kore.ai to learn more. Source: Kore.ai Comments are closed. Sorry. No data so far. Sorry. No data so far. Sorry. No data so far.   View More… "
}