{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.wionews.com/business-economy/nvidia-and-amd-shares-soar-as-analysts-boost-price-targets-amid-ai-optimism-680791",
    "text": "Nvidia, currently holding a dominant position in the advanced AI chip market, faces competition from AMD, which is anticipated to make strides this year, increasing deliveries of its own chips to enterprise clients, according to Barclays analysts led by Tom O'Malley. Shares of Nvidia and Advanced Micro Devices (AMD) experienced a significant surge on Tuesday as investor confidence in the growing demand for artificial intelligence (AI)-powered chips prompted Wall Street analysts to raise their price targets for these semiconductor giants. This is based on a Reuters report. Nvidia, currently holding a dominant position in the advanced AI chip market, faces competition from AMD, which is anticipated to make strides this year, increasing deliveries of its own chips to enterprise clients, according to Barclays analysts led by Tom O'Malley. Barclays analysts noted in an investor note that with supply constraints, customers often resort to using the entire Nvidia platform to secure priority shipments of accelerators. They anticipate that 2024 will be the year when AI opens up further, with other chipmakers like AMD gaining market share. Nvidia's stock witnessed a 3 per cent increase, reaching $563.65 and setting a new record high. Simultaneously, AMD shares surged by 7.5 per cent to $157.57, reaching their highest level in over two years. Nvidia's shares more than tripled in value in the past year, making it the world's most valuable chipmaker, while AMD's shares more than doubled. Barclays raised its price target for AMD shares to $200 from $120, reflecting the positive outlook for the company. KeyBanc analysts also increased their price target for AMD to $195 from $170. Nvidia, too, received a price target hike to $740 from $650 from KeyBanc. Both Nvidia and AMD are currently among the top gainers in the PHLX semiconductor index, which showed a 1.15 per cent increase during the session. Analysts covering Nvidia's stock maintain a median price target of $625, slightly down from $627.50 a month ago. The collective recommendation for the stock is \"buy.\" Conversely, analysts covering AMD's shares have a median price target of $145, up from $130 a month ago, with a collective recommendation to buy the stock [Reuters]. In a strategic move, Nvidia plans to commence mass production later this year of an AI chip tailored for its Chinese customers, aligning with tightened US export rules. On the other hand, AMD, aiming to challenge Nvidia's flagship microprocessors, announced two new AI data centre chips in December. (With inputs from Reuters) "
}