{
    "title": "History Says the Nasdaq Will Surge in 2024: 2 Magnificent Stock-Split \nStocks to Buy Before It's Too Late",
    "date": "1/13/2024",
    "url": "https://finance.yahoo.com/news/history-says-nasdaq-surge-2024-133000905.html",
    "text": "If you want to jump into the market in 2024, historical patterns are on your side. According to an analysis of the Nasdaq Composite going back to 1971, the tech-heavy index has risen an average of 19% every year following a recovery year like we experienced in 2023. For investors, stock-split stocks can be a way to bet on the pattern continuing. Stock splits occur when a company divides each share into lower-priced units to make them more liquid and available to smaller investors. While these events don't impact company fundamentals, they are an encouraging sign that a stock is moving in the right direction. Let's discuss why two recently split stocks -- Nvidia (NASDAQ: NVDA) and Monster Beverage (NASDAQ: MNST) -- could be great buys in the new year and beyond. Aside from a massive crash in 2022, Nvidia's stock has risen almost exponentially over the last decade. To keep prices down to Earth, its management has conducted five stock splits -- most recently, a 4-for-1 conversion in July 2021. And while shares have risen dramatically since then, it's not too late for investors to bet on continued success. Historically, Nvidia's growth has relied on its ability to take advantage of new technologies faster than rivals. This started with its graphics processing units (GPUs), which were initially designed to render video game visuals before finding another use in cryptocurrency mining. But generative artificial intelligence (AI) may be the big break that defines Nvidia's future for the foreseeable future. In the third quarter, AI chip sales helped send revenue up 206% year over year to $18.1 billion. With industry experts expecting the market for AI training hardware to expand from $45 billion to $400 billion by 2027, Nvidia has plenty of room for continued growth. To be fair, competition will probably increase. But Nvidia's economic moat comes from its speed to market, which has given it a robust developer community that has built software and servers around its hardware and may be reluctant to switch to less-compatible rivals. Like Nvidia, Monster Beverage stock has risen dramatically over the past decade, leading to constant stock splits (six in total). The most recent conversion occurred in March of last year and gave investors two shares for each one they previously owned. And despite its $60 billion market cap, the energy drink maker still enjoys healthy business momentum. While net sales increased by a modest 14.3% year over year to $1.9 billion, the company enjoyed particularly impressive growth in its new alcohol business, which saw sales jump a whopping 58% to $42.3 million following the rollout of new products such as The Beast Unleashed line of malt alcohol drinks -- designed to appeal to its existing energy drink customers with similar flavors and branding. Monster's burgeoning success in alcohol highlights its brand appeal and ability to use its existing supply chains and distribution networks to diversify its operations. With a forward price-to-earnings (P/E) ratio of 31, Monster stock is slightly more expensive than the Nasdaq-100 average of 28. However, the premium looks justified, considering its bottom-line momentum. Third-quarter net income rose 40% year over year to $452 million. While stock splits and historical patterns can make investors more confident in putting money into the stock market, fundamentals should be the biggest consideration. Nvidia and Monster Energy have performed well in the past. But more importantly, both companies have what it takes to continue rewarding investors over the long term. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Monster Beverage and Nvidia. The Motley Fool has a disclosure policy. History Says the Nasdaq Will Surge in 2024: 2 Magnificent Stock-Split Stocks to Buy Before It's Too Late was originally published by The Motley Fool Related Quotes "
}