{
    "title": null,
    "date": "1/29/2024",
    "url": "https://www.marketwatch.com/story/stock-investors-are-partying-like-its-1999-and-maybe-it-is-yardeni-says-a6476f12",
    "text": "“Is Nvidia today’s Cisco? It’s possible. If so, then it has a lot more upside before it crashes — if it crashes.” Is it possible that the meltup phase of the bull market (which started on Oct. 12, 2022) has begun already — having started following the correction low on Oct. 27, 2023? Yes, it is possible. Since that recent low, investors have become much less concerned about such adverse macro issues as a recession, higher interest rates, persistent inflation, and the federal government’s deficit. Instead, they are excited about the likelihood that the U.S. Federal Reserve will cut interest rates this year as inflation continues to subside. They are also exuberant about the potential impact of artificial intelligence (AI) on the earnings of technology companies. Their exuberance for AI started when OpenAI introduced ChatGPT on Nov. 30, 2022. Since then, Nvidia’s \n        NVDA,\n        +3.12%\n       stock is up more than 250% because it is the leading semiconductor manufacturer of AI chips. It has led the S&P 500 Semiconductor stock price index to a gain of 108% since then. Nvidia’s share price performance is starting to remind us of the parabolic ascent of Cisco Systems \n        CSCO,\n        -0.20%\n       stock during the tech bubble of the late 1990s. The company manufactured key equipment necessary to expand the internet, and its share price increased eightfold from the end of 1997 through March 2000. The stock then crashed, even though the internet continued to proliferate rapidly.  Is Nvidia today’s Cisco? It’s possible. If so, then it has a lot more upside before it crashes — if it crashes. Fed Chair Jerome Powell has studied the history of Fed chairs, especially Paul Volcker. Unlike Volcker, Powell might succeed in bringing inflation down without a recession. The financial markets are expecting him to lower interest rates this year now that his inflation mission is nearly accomplished. Indeed, he and other Fed officials have opined that they might have to lower the federal funds rate to keep the inflation-adjusted federal funds rate from rising as inflation falls further. “When bubbles inflate to a certain point, it doesn’t take much to pop them.” In this scenario, Powell risks fueling irrational exuberance, a phenomenon former Fed Chair Alan Greenspan discussed in his famous Dec. 5, 1996 speech titled “The Challenge of Central Banking in a Democratic Society.” He was merely thinking out loud, musing Hamlet-like over an important question: “How do we know when irrational exuberance has unduly escalated asset values, which then become subject to unexpected and prolonged contractions … ? And how do we factor that assessment into monetary policy?” But that term “irrational exuberance” struck a chord with investors and became a self-fulfilling prophecy. When bubbles inflate to a certain point, it doesn’t take much to pop them. The financial press recently reported that money market mutual funds (MMMF) have attracted a record $6.0 trillion in assets, with $2.3 trillion in retail MMMF and $3.6 trillion in institutional accounts. If the Fed lowers interest rates, lots of that money might move into the bond and stock markets, fueling meltups in both markets, especially the stock market. Over the years, we’ve learned that recessions can be caused by bursting speculative bubbles. If Powell and his colleagues take a victory lap and celebrate their success at bringing down price inflation without causing a recession by lowering interest rates, they run the risk of fueling asset inflation. When that bubble bursts, a recession most likely would ensue. The Fed’s last big mistake was falling behind the inflation curve in 2021 and early 2022. The Fed’s next big mistake could be inflating a speculative stock market bubble. Powell must know that. If so, then he should reiterate that he is in no rush to lower interest rates. So instead of a repeat of the inflationary 1970s or a replay of the productivity-led boom of the 1920s, the current decade has the potential to play out like the tech-led stock market party of the 1990s. To quote Prince: “Let’s party like it’s 1999.” Ed Yardeni is president of Yardeni Research Inc., a provider of global investment strategy and asset-allocation analyses and recommendations. This article is excerpted from Yardeni Research’s “Deep Dive” for Jan. 26, 2024. Individual investors can read Yardeni’s research here. Follow him on LinkedIn and his blog. More: 12 reasons why you’ll see the S&P 500 at 5,400 in 2024 Plus: 5 real risks that could crush stocks in 2024 — and why they won’t Riding a wave is exciting as long as it lasts — but watch out when it crashes. Ed Yardeni is a contributor to MarketWatch and president of  Yardeni Research, a provider of global investment strategy. Ed Yardeni is a contributor to MarketWatch and president of  Yardeni Research, a provider of global investment strategy. Visit a quote page and your recently viewed tickers will be displayed here. "
}