{
    "title": null,
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/how-to-watch-nvidias-ces-press-conference-130008106.html",
    "text": "It’s that time of year again. The annual CES trade show in Las Vegas is upon us and NVIDIA is holding a major press conference that will offer details regarding “a spectrum of cutting-edge technologies.” It goes down on Monday, January 8, at 8AM PT / 11AM ET, the day before CES 2024 officially kicks off. You can watch it directly on NVIDIA’s website, or you can hit up the company’s YouTube page or Twitch channel. So what’s on the agenda for CES 2024? It’s the two most beloved letters in all of tech: AI. NVIDIA will be focusing primarily on “its latest advancements in artificial intelligence,” including generative AI. NVIDIA has been open about AI taking center stage at the event, but it’s been cagey regarding specific announcements. The company has become something of a juggernaut in the space these past couple of years, so there will likely be plenty of new information about its next-gen AI supercomputer chips. There will also be announcements involving “consumer technologies and robotics\", so AI won’t be the only star of the show. NVIDIA, after all, is a multi-tentacled behemoth of a company. It’s involved in industrial digitization, maintaining data centers and much more. Oh yeah. It also makes GPUs. In addition to the primary press conference, NVIDIA will be maintaining a robust presence throughout CES 2024. The company says its tech will be the focus of 14 other conference sessions, with titles like “Reshaping Retail – AI Creating Opportunity” and “Cracking the Smart Car.” To that end, NVIDIA promises demos with a diverse lineup of companies, from Samsung to Mercedes-Benz. NVIDIA spent a lot of time on AI during last year’s keynote, but the company also unveiled new hardware like its updated Geforce GPUs and a refreshed lineup of RTX 40 series laptops. It also went into more detail regarding new and improved cloud based productivity software, among other announcements. In other words, there will very likely be some hardware reveals hidden amongst all of that AI bluster. Engadget has a large team on the ground in Las Vegas covering the event — follow along for all of our coverage. Now that the press conference is in the books, we have a sub-10-minute recap video live on our site. Key among the announcements: NVIDIA revealed its RTX 40 Super GPUs, including the $999 4080. The company also said it would offer streaming day passes to GeForce Now subscribers. We're reporting live from CES 2024 in Las Vegas from January 6-12. Keep up with all the latest news from the show here. "
}