{
    "title": "Nvidia Leads AI Chip Rivalry with New GPUs, While AMD and Intel Bet Big on \nAI PCs",
    "date": "1/11/2024",
    "url": "https://markets.businessinsider.com/news/stocks/nvidia-leads-ai-chip-rivalry-with-new-gpus-while-amd-and-intel-bet-big-on-ai-pcs-1032961320",
    "text": "Advanced Micro Devices, Inc (NASDAQ:AMD) and Intel Corp (NASDAQ:INTC), significant players in the chipmaking industry, are focusing on competing with Nvidia Corp (NASDAQ:NVDA), particularly in the AI chip market. At the CES technology trade show, Nvidia, a U.S. company, has maintained its lead in this market since last year. The company revealed three new GPUs – RTX 4060 Super, RTX 4070 Ti Super, and RTX 4080 Super – designed for AI-ready laptops, the Nikkei Asia reports. These chips are featured in Acer, Dell, HP, Lenovo, and Samsung models. Nvidia’s AI chips, including the high-end A100 and H100 models, have gained traction, particularly with the rise of generative AI, like ChatGPT. However, their top chips face U.S. export restrictions to China, though the newly announced GPUs are exempt from these curbs.  In contrast, AMD and Intel are betting on AI personal computers (PCs), which embed AI chips for local AI model processing. This strategy differs from Nvidia’s focus on server-based AI, relying on data centers. At CES, both companies unveiled processors specifically for AI PCs. These chips feature a dedicated neural processing unit (NPU), offering enhanced data privacy, longer battery life, and expanded AI applications compared to regular PCs. Despite this innovation, Intel and AMD acknowledge that widespread consumer adoption of AI PCs may be slow, as the initial models will not differ significantly from traditional PCs until companies develop more AI-native applications. Intel CEO Pat Gelsinger and AMD’s Don Woligroski emphasized their commitment to this emerging technology at CES, with Woligroski highlighting the industry’s collective effort towards AI PCs.  Additionally, Intel introduced an AI chip for cars, with Zeeker, under China’s Geely, set to be the first adopter. Analysts have flagged Nvidia’s supremacy with H100 GPU versus its rivals. The analysts acknowledge Nvidia’s strengthened competitive edge in the AI market, particularly with its accelerated launch of the H200, which will likely maintain market dominance and set new standards for GPUs. Additionally, Nvidia is adapting to U.S. export regulations by preparing new chip models, including the H20, L20, and L2, specifically for the Chinese market, where it holds a dominant position. The AI rivalry plot is getting thicker with critical developments from the chip designers.  Nvidia’s AI product line has substantially increased its sales and market value, potentially allowing it to overtake Intel in total revenue. Intel is gearing up to launch its Gaudi 3 AI accelerator in 2024, aiming to challenge Nvidia’s H100. Concurrently, AMD is stepping into the AI accelerator arena with its upcoming MI300, targeting a rapidly expanding market projected to reach over $400 billion in four years. AMD is optimistic about its MI300X chip, expecting to exceed its $2 billion revenue forecast in 2024 due to solid pre-orders and a lack of supply constraints. The company is confident in competing with Nvidia, especially in inferencing, thanks to its high high-bandwidth memory (HBM) content.  Additionally, AMD anticipates continued server CPU market share growth, bolstered by its partnership with Taiwan Semiconductor Manufacturing Co (NYSE:TSM). They also foresee growth in the PC market, with AI PC launches in 2025 expected to drive a new refresh cycle in collaboration with Microsoft Corp (NASDAQ:MSFT). Intel is adopting a unique strategy by moving AI processing to individual devices, focusing on the emerging AI PC market, which it anticipates will represent 80% of all PC sales in the next four years. Nvidia stock gained 240% last year, versus AMD at 115% and Intel at 59%. Price Action: NVDA shares traded lower by 0.36% at $541.53 on Wednesday.  Also Read: Semiconductor Supply In Automotive Industry Has Caught Up With Demand, AMD and Nvidia Set for Prominent AI and Automotive Role: Analyst Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Wikimedia Commons Indices Commodities Currencies Stocks "
}