{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.news-journal.com/arena/thestreet/stock-market-today-record-stock-rally-stalls-nvidia-eyes-2-trillion/article_6880b82f-e5aa-51be-8f0e-575208095cd7.html",
    "text": "Thunderstorms likely this morning. Then a chance of scattered thunderstorms this afternoon. High 69F. Winds SW at 10 to 15 mph. Chance of rain 90%.. Mostly clear. Low 42F. Winds W at 5 to 10 mph. Updated: March 25, 2024 @ 6:57 am  Check back for updates throughout the trading day U.S. equity futures were mixed Friday, blunted in part by a rise in Treasury bond yields, as investors looked to pause from the market's recent tech-led rally that lifted stocks to a record close last night. Nvidia's  (NVDA)  stunning Thursday surge, which added more than $277 billion to the AI-chip maker's market value — the single-largest market gain in U.S. history — helped power the S&P 500 to an all-time high of 5,087.03 points. Investors repriced AI and tech stocks across the board in the wake of Nvidia's stronger-than-expected fourth-quarter earnings, which included a robust near-term sales outlook, driving the Nasdaq nearly 3% higher and to within 1% of the all-time high it reached in November 2021. Nvidia shares, meanwhile, were still marked 1.75% higher in premarket trading to indicate an opening bell price of $799.21 each and a market value of $1.95 trillion. Related: Analysts revamp Nvidia price targets as stock tests $2 trillion Adding to the bullish sentiment: another round of solid jobs data, which showed applications for unemployment benefits falling to 201,000 over the week ended Feb. 17, as well as indications that broader business activity continued to accelerate in February. However, inflation concerns have rekindled among bond traders over the past week, first sparked by a stronger-than-expected January Consumer Price Index report and fanned with hawkish commentary from Federal Reserve officials and minutes from the central bank's last policy meeting. Federal Reserve Governor Christopher Waller, in fact, told an event in Minneapolis last night that \"the risk of waiting a little longer to ease policy is lower than the risk of acting too soon and possibly halting or reversing the progress we’ve made on inflation.\" Benchmark 10-year note yields, which have risen around 45 basis points over the past three weeks, were last marked 2 basis points higher from Thursday's close at 4.345% in the wake of Waller's comments. The odds of a May Fed rate cut, meanwhile, have slumped to around 20%, with bets on reductions beginning in June pegged at around 52.8%, according to CME Group's FedWatch tool. On Wall Street, stocks are set for a mixed but muted open to finish off the week, with futures contracts tied to the S&P 500 indicating a 2 point opening bell bump from last night's record close. Futures linked to the Dow Jones Industrial Average, meanwhile, are indicating a 65 point gain while those tied to the Nasdaq suggest a 20 point pullback. In overseas markets, Europe's Stoxx 600 was marked 0.13% higher in early Frankfurt trading, while Britain's FTSE 100 was little changed from last night's close. Overnight in Asia, the regionwide MSCI ex-Japan index was marked 0.13% higher into the close of trading, while Japan's Nikkei 225 was closed for the annual observance of the Emperor's Birthday. Related: Veteran fund manager picks favorite stocks for 2024 Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}