{
    "title": "The Head Of NVIDIA Warned That AI Will Leave Programmers Without Work, And \nIt Is Better To Study As Farmers",
    "date": "2/26/2024",
    "url": "https://technewsspace.com/the-head-of-nvidia-warned-that-ai-will-leave-programmers-without-work-and-it-is-better-to-study-as-farmers/",
    "text": "The founder and permanent head of NVIDIA, Jensen Huang, is known for his categorical forecasts in the field of information technology development, and during his speech at the World Government Summit event in Dubai he once again stated that in the near future, knowledge of programming languages ​​will not be needed for specialists. because artificial intelligence will write the code.  Image Source: NVIDIA From this point of view, as specified, the CEO of NVIDIA does not consider it important to teach children programming skills, since in the future for software development it will be enough to clearly formulate the technical specifications in natural language, and artificial intelligence will do all the work for the programmer. The head of the company does not share the point of view that over the past 10 or 15 years has dominated among information technology specialists, who have called for children to be taught programming skills from an early age. “In reality, things are almost completely the opposite,” — Jensen Huang summarized. “Our job is to create a technology that will eliminate the need for people to program, and the programming language will essentially become human. Everyone in this world can be considered a programmer, and this is the miracle of artificial intelligence.” — the head of NVIDIA traditionally said emotionally. He believes it makes sense for young people to spend their time acquiring more valuable skills in biotechnology, education, manufacturing and agriculture. Industry expert Patrick Moorhead does not share such views, recalling that over the past 30 years, many technologies that make the work of programmers easier were constantly considered by the community as a replacement for these specialists, but in reality, the demand for software developers in the labor market is only growing . At least after ChatGPT entered the market, programming vacancies increased by 6%. Robbie Elmers is a staff writer for Tech News Space, covering software, applications and services. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  TECH NEWS SPACE The Tech News Space team monitors news from the world of high technology, science, the gaming industry and delivers them to its readers in a timely manner. "
}