{
    "title": "Nvidia (NVDA) Is Now 3rd Largest in Market Cap: More Upside Left?",
    "date": "2/15/2024",
    "url": "https://www.zacks.com/stock/news/2226648/nvidia-nvda-is-now-3rd-largest-in-market-cap-more-upside-left",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Shutterstock Tirthankar Chakraborty\n                    February 15, 2024 AMZN Quick QuoteAMZN AAPL Quick QuoteAAPL MSFT Quick QuoteMSFT NVDA Quick QuoteNVDA GOOGL Quick QuoteGOOGL Better trading starts here. You follow Analyst Blog - edit You follow Tirthankar Chakraborty - edit Tirthankar Chakraborty Analyst Blog Nvidia Corporation (NVDA Quick QuoteNVDA  -  Free Report)     outshined Google parent Alphabet Inc. (GOOGL Quick QuoteGOOGL  -  Free Report)     in terms of market capitalization on Feb 14, to become the third-largest company in the United States. The boom in artificial intelligence (AI) helped the chipmaker’s shares scale northward and close at $739 a share in the last trading session, giving the company a market value of $1.825 trillion, more than Alphabet’s $1.822 trillion market capitalization. Nvidia already surpassed Jeff Bezos’ Amazon.com, Inc. (AMZN Quick QuoteAMZN  -  Free Report)     a day before, in terms of market value. Nvidia has now become a beloved stock among market pundits on the back of elevated demand for AI chips, thereby making the company more valuable than several software companies that develop and apply AI-related technology in their products. Alphabet and Amazon require AI server chips for their cloud-related services. Nonetheless, before the current AI boom, Nvidia was known for providing consumer graphic processors to PC makers, a less money-spinning market. Nvidia was the seventh-largest company two years ago in respect of market value, while it was the twelfth-largest three years back. Notably, the chip-making behemoth was outside the list of the top 20 largest market capitalization companies four years ago. But at the moment, Nvidia is lagging only behind Microsoft Corporation (MSFT Quick QuoteMSFT  -  Free Report)     and Apple Inc. (AAPL Quick QuoteAAPL  -  Free Report)    . Nvidia’s meteoric rise, particularly in the past year, is due to its dominance in the graphics processing unit (GPU) market. Interest in AI was propelled by the launch of OpenAI’s ChatGPT, which compelled tech bigwigs to restructure their business models. GPU sales skyrocketed on increased demand for AI services and helped Nvidia’s business grow by leaps and bounds. What’s more, the AI market is projected to witness a CAGR of 15.83% from 2024 to 2030 and reach a market volume of $738.8 billion by 2030, per Statista. Thus, Nvidia is further poised to do well in the near term, and its supremacy in the chip market will be challenging for its adversaries like Intel and AMD. While improvement in GPU sales is primarily responsible for Nvidia’s stellar performance, recovery in the PC market is also expected to benefit the chipmaker. PC sales took a beating due to a rise in price pressures. However, the Federal Reserve’s aggressive monetary tightening measures curbed inflationary pressure in recent times and helped Nvidia’s PC shipments improve in its latest reported quarter. Thanks to such an encouraging scenario, investors should place their bets on Nvidia despite the stock being pricey. Nvidia has more upside, with its expected earnings growth rate for the current year coming in at a whopping 268.9%. Its shares have already outperformed the broader S&P 500 in the past year (+235.1% vs +22.0%).  Image Source: Zacks Investment Research The Zacks Consensus Estimate for Nvidia’s current-year earnings has moved up 0.2% over the past 60 days. Additionally, Nvidia’s net profit margin is a solid 42.1%, way more than the 20% mark, which indicates a high margin. This means the chipmaker can control its operational expenses and generate enough profit from sales, a tell-tale sign that its shares should further scale upward. At the same time, Nvidia is a cash-rich company, thereby remaining immune to market vagaries. As of October 2023, Nvidia has an enormous $18.28 billion in cash and cash equivalents. Nvidia rightfully carries a Zacks Rank #2 (Buy) and a Growth Score of A, a combination that offers the best opportunities in the growth investing space. You can see the complete list of today’s Zacks Rank #1 (Strong Buy) stocks here. Amazon.com, Inc. (AMZN) - free report >> Apple Inc. (AAPL) - free report >> Microsoft Corporation (MSFT) - free report >> NVIDIA Corporation (NVDA) - free report >> Alphabet Inc. (GOOGL) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy   |   No cost, no obligation to buy anything ever. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.18%  per year. These returns cover a period from January 1, 1988 through January 1, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}