{
    "title": "Nvidia: Amazon down, Alphabet next?",
    "date": "2/18/2024",
    "url": "https://www.cmcmarkets.com/en-au/analysis/nvidia-amazon-down-alphabet-next",
    "text": " Trade on the go Download our apps CFD app Share Trading app Trade the way that suits you Invest in Shares Invest in over 35,000 domestic and international shares and ETFs from 15 global markets. Plus a wide range of domestic products including Options, mFunds, warrants and more. Trade CFDs Trade contracts for difference (CFDs) on over 12,000+ products including FX Pairs, Indices, Commodities, Shares, Cryptocurrencies, and Treasuries.  Written by CMC Markets 18 Feb 2024, 11:30 Share this On Tuesday, AI darling Nvidia (NVDA:US) came close to surpassing Alphabet (GOOGL:US) as the third most valuable company on Wall Street, marking a significant milestone for the leading AI chipmaker. With Nvidia's market capitalization exceeding Amazon's (AMZN:US) for the first time in twenty years, totaling $1.78 trillion after a slight 0.17% slip in its shares, it emerged as a formidable contender. Amazon's market value stood at $1.75 trillion following a 2.15% decline in its stock. Meanwhile, Alphabet, the parent company of Google was down 1.62%, leaving its market capitalization at $1.81 trillion. This development underscores the evolving dynamics within the tech industry's landscape. Nvidia has emerged as a prominent beneficiary of the tech industry's fervent pursuit to integrate AI into their offerings, with its graphics processors facing scarcity due to hefty purchases by Meta Platforms (META:US) and other major tech players, amounting to billions of dollars. Mizuho revised Nvidia’s target price upwards to $825 from $625 in anticipation of the company's upcoming quarterly results scheduled for Feb. 21. Despite closing Tuesday at $721.28, Mizuho's analyst Vijay Rakesh highlighted a surge in demand for Nvidia's top-tier H100 processor, though supply still falls significantly short. With Nvidia maintaining a dominant position, controlling approximately 80% of the high-end AI chip market, its stock has surged by 46% this year, following a remarkable triple-digit growth in 2023. This optimistic outlook extends to other tech firms like Microsoft (MSFT:US) and Meta, whose shares have soared to record highs fueled by AI prospects. Alphabet, on the other hand, integrated chatbot technology into its Google search engine and marketed generative AI tools to cloud customers. Despite hitting an all-time high, Alphabet's stock faced a setback post its Jan. 30 quarterly report, falling short of investors' expectations. Nevertheless, its stock has managed a 4% increase in 2024. Although Nvidia briefly surpassed Amazon in market capitalization on Monday, Amazon regained its lead by the end of the trading session. The last time Nvidia held a higher valuation than Amazon was in 2002, when both were valued at less than $6 billion. By mid-2004, Nvidia's market value had plummeted to under $2 billion, while Alphabet debuted its shares with a valuation of $23 billion.  Latest from CMC The 2024 Bitcoin halving explained: Critical factors for investors This analysis will break down the underlying mechanics of the halving, explain how it can impact Bitcoin's price, and review key considerations for the upcoming April 2024 halving. 14 Mar 2024 Navigating temptation: Strategies to avoid going short too early AI and Semiconductor boom: A look at AMD and ARM's Trajectory Nvidia: Amazon down, Alphabet next? Related articles The 2024 Bitcoin halving explained: Critical factors for investors This analysis will break down the underlying mechanics of the halving, explain how it can impact Bitcoin's price, and review key considerations for the upcoming April 2024 halving. 14 Mar 2024 Navigating temptation: Strategies to avoid going short too early As many markets hover around all-time highs, investors are increasingly opting for short positions. This timely analysis addresses risk management and pitfalls to avoid during this period, with a focus on leveraging divergences as a valuable trading signal. 27 Feb 2024 AI and Semiconductor boom: A look at AMD and ARM's Trajectory This analysis examines the technical trends, price drivers, and future trajectory for these stocks. 21 Feb 2024 Nvidia: Amazon down, Alphabet next? NVIDIA is vying for the top spot among tech giants like Amazon and Alphabet, but what are the current dynamics shaping this competition? 18 Feb 2024 Aus 1300 303 888 CFD lines open 24hrs, Monday morning–Saturday morning Share Trading lines open 7.30am – 7.00pm (Sydney time), Monday–Friday Contact Download our app Get greater control and flexibility for peak performance trading when you're on the go. CFD app Share Trading app Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Cboe (previously known as Chi-X), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Product Disclosure Statement ('PDS') or Information Memorandum (for CMC Pro accounts) and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Please also refer to our Financial Services Guide and Information Memorandum (for CMC Pro accounts) containing details of our fees and charges and our Target Market Determinations for our CFD products and Exchange Traded Options which include a description of who our financial products are suitable for. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. © 2024 CMC Markets Welcome to CMC Markets Support! To begin, please select the product your query is related to. "
}