{
    "title": "Early pricing of RTX 4070 Super and other Nvidia GPU refreshes fills us \nwith hope – our only worry is stock levels",
    "date": "1/15/2024",
    "url": "https://www.techradar.com/computing/gpu/early-pricing-of-rtx-4070-super-and-other-nvidia-gpu-refreshes-fills-us-with-hope-our-only-worry-is-stock-levels",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Are these graphics cards going to sell out in a flash? Nvidia’s RTX 4070 Super graphics cards – and other incoming Super refreshes – have already been spotted priced up at US retailers ahead of their imminent launch. The RTX 4070 Super represents the majority of the products now listed at retailers such as Newegg and Best Buy in the US, which isn’t surprising, as those are the graphics cards that go on sale first – in just a couple of days, in fact, on January 17. Now, only some of those RTX 4070 Super GPUs have a price attached, but from what we can see, it looks like pricing will be nicely pitched. A good number of the graphics cards listed are priced at the MSRP of $599 – which is the cost of Nvidia’s own Founders Edition – including the MSI Ventus 2X, PNY Verto, Zotac Twin Edge, and the Gigabyte Super Windforce OC. What’s quite interesting to see is Best Buy putting an OC or overclocked model, the latter one from Gigabyte, at the MSRP – unless this is a mistake. Typically, these overclocked models will be a bit more expensive than the recommended price tag. For example, elsewhere we see MSI’s Ventus 2X OC version of the RTX 4070 Super at $610 – though again, that’s encouragingly not much more than the MSRP. Neither is the Super Ventus 3X OC at $630, though the Gaming X Slim is a bit costlier at $650. So far, though, the overall pricing looks commendably palatable. As mentioned, the RTX 4070 Super will be out of the door first, followed a week later by the RTX 4070 Ti Super, and then another week after that, the RTX 4080 Super will hit shelves. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. As those latter two GPUs are further out, there aren’t many products priced as would be expected, but we do have a few price tags. MSI’s RTX 4070 Ti Super Ventus 3X is priced at $899 and the Gigabyte 4070 Ti Super Gaming OC is $849. Those are both overclocked models, and pricing isn’t too far above the MSRP of $799. MSI’s RTX 4080 Super Ventus 3X is $1,099 and the Gigabyte RTX 4080 Super Gaming OC is $1,049, compared to the $999 recommended price, so again this is in line with the 4070 Ti Super and reasonable. All of this is US pricing, of course (hat tip to Tom’s Hardware for flagging the products), but we can expect similar pitching for price tags in other regions, relative to the MSRP in those countries. Stock levels of the RTX 4070 Super graphics card are going to be very keenly watched because it’s the first new model out of the door, and it’s likely to be in high demand, especially given the pricing (and promised performance) as noted. The good news is that according to previous rumors, the RTX 4070 Super is where Nvidia is focusing most of its production capacity with these new refreshes. That make sense, as it’s the most affordable graphics card here – and will sell more on that basis alone. So, we shall see what kind of stock volume Nvidia has been able to muster compared to demand levels. Will RTX 4070 Super stock disappear off the shelves on day one? And will price gougers get in on the act? Time will tell, but we’re hoping that Nvidia will have some decent production muscle behind this initial card based on chatter from the grapevine. On the other hand, we’re far from sure about the following models, the RTX 4070 Ti Super and 4080 Super – rumor has it these will be thinner on the ground. Indeed, Nvidia may want to clear existing 4070 Ti and 4080 stock before the new refreshes (that effectively replace them) are pushed harder, anyway. (Although as a sidenote, the RTX 4080 has been so unpopular, hopefully inventory levels are pretty low by now, anyway). There will be costlier models of these various RTX Super refreshes, of course, than the ones priced up here. As ever, the very top-end boards will command a real premium (that’ll be reflected to some extent in their performance). It’ll be fascinating to watch which of these products manages to snag a spot on our best graphics cards list (because it’s likely that one, or perhaps more, will do just that). Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). New leaks suggest the Nvidia RTX 5080 will offer better ray tracing and pricing than 4080 Another driver update, another set of huge performance boosts for free, as Intel Arc GPUs keep getting better Popular SSD vendor uses clever trick to make slower, less durable flash components perform much better — but don't expect miracles By Mackenzie FrazierMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 By David NieldMarch 23, 2024 By Darren AllanMarch 23, 2024 By Hamish HectorMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 By Marc McLarenMarch 23, 2024 By Cesar CadenasMarch 22, 2024 By James IdeMarch 22, 2024 By Cesar CadenasMarch 22, 2024 By Sead FadilpašićMarch 22, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}