{
    "title": "3 Must-Watch Stocks Just as Unstoppable as Nvidia",
    "date": "1/30/2024",
    "url": "https://investorplace.com/2024/01/3-must-watch-stocks-just-as-unstoppable-as-nvidia/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. These low-tech high flyers are stocks as strong as Nvidia Advertisement Source: sdx15/Shutterstock Nvidia (NASDAQ:NVDA) remains one of the hottest stocks in the market right now, with shares eeking out yet another 2.35% gain on Monday’s session. After Nvidia stock’s January jump, shares are flirting with 30% in year-to-date gains. That’s an impressive annual return, let alone one posted in under a month. As to when (or if) shares of the chip giant are bound to reverse course remains the top question on the minds of shareholders and those enjoying the Nvidia show from the sidelines. Some way or another, NVDA stock has found a way to keep pulling rabbits out of hats, something that could easily continue through 2024. Either way, Nvidia stock remains a dangerous stock to bet against amid its AI tailwind. Though momentum investors still have lots to love about Nvidia and its latest melt-up, I’d argue it’s worth checking in on other stocks that have already gained traction in recent weeks. Indeed, many such plays may be overheated after their respective rallies. However, each is worth keeping tabs on as we march into earnings season. Let’s check in briefly with three momentum stocks as strong as Nvidia that I’d stash in the “must-watch” category. Warren Buffett’s low-tech conglomerate Berkshire Hathaway (NYSE:BRK-B, BRK-A) has been steadily (and pretty quietly) making new highs in recent sessions. Just last week, the stock hit $385 and change after enjoying a remarkable seven-day win streak. Thanks, in part, to its huge investment in Apple (NASDAQ:AAPL), Japanese companies and various other firms, Berkshire Hathaway is now a stock that has something for value and momentum investors to love. Though Berkshire hasn’t been ultra active of late, it has made intriguing moves, including buying more shares of Liberty SiriusXM Group (NASDAQ:LSXMA). With shares of LSXMA currently trading at just 11.6 times trailing price-to-earnings (P/E), it’s not hard to imagine why Buffett’s firm has picked up a few more shares. Indeed, the stock looks cheap in a market that may be getting a tad overheated. As Berkshire continues playing the long-term game, it remains one of the more value-conscious picks to make the new all-time high list. And it’s worth tuning into if you’re off-put by some of the tech scene right now. T-Mobile US (NASDAQ:TMUS) stock also recently hit new heights after clocking in a handful of respectable quarters last year. More recently, the firm missed earnings estimates for its fourth quarter but topped on sales. Despite the initial adverse reaction, investors now seem more forgiving, given the company’s high hopes for new customer additions in 2024. Undoubtedly, the red-hot wireless play has been flying above and beyond its peers in the telecom industry. Led higher by an impressive network (it’s one to beat) and competitive prices, T-Mobile stands out as one of the market gainers that doesn’t seem content just sitting around. T-Mobile stock’s impressive performance (shares up 134% in the last five years) versus the peer group suggests the wireless scene is transforming into a winner-takes-most sort of environment. And as our high-speed data consumption grows, it’s hard not to want to jump on the T-Mobile bandwagon as it looks to enter the industry’s newest chapter of growth. At writing, shares trade at 23.4 times trailing price-to-earnings (P/E). That’s not a hefty multiple to pay for an industry leader with a distinct edge and a management team that knows how to get things done. For 2024, analysts expect TMUS stock to continue doing what it does best: make higher highs. Costco (NASDAQ:COST) is another low-tech stock having a breakout moment, of sorts. With shares flirting with $700 per share — one more big up day will do it — COST may very well be the next momentum stock to hog the headlines should Nvidia stock’s rally begin to falter. Either way, Costco’s management seems well-equipped to make the most of the traffic surge in its stores. Many Costco shoppers have a bulk appetite for the Kirkland Signature brand (Costco’s high-quality private label) these days, and it is not a mystery as to why. Costco does private labels far better than any other large-scale retailer, in my opinion. With Kirkland, Costco shows us that consumers don’t need to compromise on quality to save money amid hard times. As Costco expands Kirkland (perhaps they should sell Kirkland Signature gold bars next?), Costco stands out as a momentum stock that can (and likely will) grow into its seemingly expensive trailing P/E — currently 46.73. On the date of publication, Joey Frenette owned shares of Berkshire Hathaway (Class B) and Apple. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joey Frenette is a seasoned investment writer specializing in technology and consumer stocks. Contributing to the Motley Fool Canada, TipRanks, and Barchart, Joey excels in spotting mispriced stocks with long-term growth potential in a fast-paced market.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/3-must-watch-stocks-just-as-unstoppable-as-nvidia/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}