{
    "title": "Nvidia: AI fuels tech transformation for retail and consumer packaged goods",
    "date": "1/11/2024",
    "url": "https://siliconangle.com/2024/01/11/nvidia-ai-fuels-tech-transformation-retail-consumer-packaged-goods/",
    "text": "UPDATED 15:57 EDT / JANUARY 11 2024 GUEST COLUMN\t\t\t\t\t        \t                        by \nZeus Kerravala Artificial intelligence is on the verge of a significant growth spurt in retail, according to a new report from Nvidia Corp. In conjunction with its NRF 2024 activities, Nvidia released its first “State of AI in Retail and CPG” report Tuesday. The study shows a bullish outlook for AI, with more than 60% of retailers saying they’ll increase AI infrastructure investments over the coming 18 months. The report, which covers survey results of more than 400 respondents around the globe, including executives and individual contributors, looked at a range of AI topics, use cases, challenges, infrastructure investments and deployment models. The study asked about revenue impact, an important metric to understand. Many retailers operate on razor-thin margins, and deploying technology that does not help the top line can turn small profits into losses. The study found that 69% of retail respondents currently using AI report that it has led to increased revenue, with 15% saying it has helped increase revenue by more than 15%. Digging deeper, Nvidia says that a top priority for AI is improving operational efficiency. Seventy-two percent of retailers using AI say it has led to lower operating costs. In fact, 23% percent say they’ve reduced expenses by more than 15%. This is obviously another important data point because it makes the business more profitable. Most information technology projects address revenue or operational efficiency, so the fact AI accomplishes both makes it almost a “no brainer” for retailers. One of the most difficult challenges for organizations to overcome with AI is where to start. The report dove into key use cases, which can help retailers that have not yet embraced AI to put a plan in place. According to the report, retailers are deploying a variety of use cases, including demand forecasting, store analytics and generative AI. The report looked at 30 use cases analyzed by the survey — and 14 were used by more than 20% of respondents. Shrinkage, which is a massive problem for retailers, amounting to $112 billion annually, is a big focus of AI for retailers — especially in the C-suite, with 54% of those executives placing it at the top of applications for AI, which underscores how it can enhance security and asset protection. Retailers are employing a variety of use cases for AI, and 64% say they’ll extend their AI infrastructure investments over the next 18 months, showing a significant commitment to AI. The report says 34% of the respondents are planning to increase investments by more than 15%. If revenue is increasing because of AI, AI is likely being tied to customer experience. According to Nvidia, generative AI is at the top of the retail use cases for CX improvement. Retailers are moving beyond personalized recommendations to conversational AI, adaptive advertising, promotions and pricing, product tagging, cataloging and deployment of brand avatars. The report shows that 86% of retailers want to transform customer experiences with generative AI. And to get there, 98% say they’ll invest in generative AI infrastructure over the next 18 months. The report underscores the significance of retailers adopting an omnichannel approach that combines online and offline channels for a cohesive consumer experience. E-commerce is the dominant channel, actively used by 79% of retailers. In addition, mobile applications are rising, with more than half of retailers using them to bridge the gap between digital and physical shopping. Despite the surge in digital shopping, 30% of respondents say physical stores present the most substantial revenue growth opportunity. Nvidia has been advancing AI with its technology and has been the industry’s strongest advocate to accelerate market adoption. This report is a welcome perspective and will be a good baseline for the development of AI in retail. It shows that AI, in short order, has become part of the retail landscape and will continue to grow quickly and make a significant difference for retailers. But I’m interested in seeing how the numbers track over the coming years. Zeus Kerravala is a principal analyst at ZK Research, a division of Kerravala Consulting. THANK YOU BlackBerry: Global financial sector faces 'death by a million cuts' through malware attacks Google DeepMind's SIMA AI agent can play video games its never seen before Together AI closes on another bumper funding round and its value soars to $1.25B Solid earnings beat and strong revenue forecast sends UiPath's stock higher IoT security startup Nozomi Networks closes $100M funding round Alice & Bob selected for France's PROQCIMA $548M quantum computing initiative BlackBerry: Global financial sector faces 'death by a million cuts' through malware attacks SECURITY - BY DUNCAN RILEY . 3 HOURS AGO Google DeepMind's SIMA AI agent can play video games its never seen before AI - BY MIKE WHEATLEY . 6 HOURS AGO Together AI closes on another bumper funding round and its value soars to $1.25B AI - BY MIKE WHEATLEY . 7 HOURS AGO Solid earnings beat and strong revenue forecast sends UiPath's stock higher AI - BY MIKE WHEATLEY . 8 HOURS AGO IoT security startup Nozomi Networks closes $100M funding round SECURITY - BY MARIA DEUTSCHER . 8 HOURS AGO Alice & Bob selected for France's PROQCIMA $548M quantum computing initiative EMERGING TECH - BY DUNCAN RILEY . 9 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}