{
    "title": "What's Going On With Nvidia Stock Monday? - NVIDIA (NASDAQ:NVDA)",
    "date": "1/8/2024",
    "url": "https://www.benzinga.com/government/24/01/36528313/whats-going-on-with-nvidia-stock-monday",
    "text": "Nvidia Corp NVDA, a key player in the AI chip market, is grappling with the repercussions of U.S. regulations that have barred the sale of its high-performance AI chips to China since October. These regulations have led Nvidia to design a new lineup of lower-powered AI chips. Still, this shift has not been well-received by major Chinese cloud companies, some of Nvidia's most significant global customers. Companies like Alibaba Group Holding Limited BABA and Tencent Holding Ltd TCEHY have indicated their intentions to substantially reduce their orders of Nvidia's chips compared to their original plans when Nvidia offered its now-restricted products, the Wall Street Journal reports. Also Read: Nvidia Navigates US Tech Restrictions, Eyes Growth in China and India Markets Amidst Global Shifts This reluctance stems from a growing interest in local alternatives and in-house developments. Major Chinese firms, including AI pioneer Baidu Inc BIDU and TikTok owner ByteDance, are also turning to domestic chip producers like Huawei Technologies, reducing their reliance on Nvidia's offerings. Previous reports indicated companies like Tencent and Huawei promoting their AI chips as potent Nvidia rivals. The uncertainty surrounding Nvidia's ability to continue supplying chips to the Chinese market further complicated the situation. U.S. regulators have committed to reviewing chip-export controls regularly, and further tightening performance limits are possible. This uncertainty has prompted Chinese tech firms to modify their business strategies to prepare for a future with less access to Nvidia's products. Nvidia's CEO Jensen Huang has acknowledged the challenge posed by Huawei, calling it a \"formidable competitor\" in China. Despite Nvidia's efforts to adapt its products to comply with U.S. rules, the company sold over $1 billion of modified chips to Chinese customers in 2023. Chinese cloud companies, currently sourcing about 80% of high-end AI chips from Nvidia, may reduce this to 50%-60% within five years. Nvidia is working on a new lineup of less powerful processors for Chinese buyers and has recently launched the GeForce RTX 4090 D, adapted after U.S. curbs. Nvidia plans to mass-produce a new artificial intelligence (AI) chip, the H20, designed explicitly for the Chinese market in the second quarter of 2024. This move aims to adhere to U.S. export regulations, Reuters reports. Originally slated for launch in November, Nvidia postponed the H20's release to server manufacturers' integration challenges. The initial production volume will be limited, focusing on major customers' orders. The H20 is the most advanced among three China-targeted chips Nvidia developed following the October restrictions. Alongside the H20, Nvidia has also developed the L20 and L2 chips under these restrictions. In December, Nvidia released a modified gaming chip that complies with the new rules. These developments are part of Nvidia's strategy to maintain its market presence in China after the U.S. restricted exports of its advanced A800 and H800 AI chips. The H20, L20, and L2 offer cutting-edge AI features but with reduced computing power to align with the new export regulations. Nvidia stock gained over 214% last year. Price Action: NVDA shares traded higher by 0.66% at $494.08 on the last check Monday. Nvidia Debuts New RTX Super Series, Shaking Up the Graphics Card Arena Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\r\nPhoto via Wikimedia Commons © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}