{
    "title": "One company that performed better than Bitcoin over ten years",
    "date": "1/12/2024",
    "url": "https://mybroadband.co.za/news/hardware/521455-one-company-that-performed-better-than-bitcoin-over-ten-years.html",
    "text": "MyBroadband Nvidia has outperformed Bitcoin over the past ten years, its share price skyrocketing from around $4 per share in January 2014 to $548 — a 13,600% increase. At the same time, Bitcoin increased by 5,442% — from $830 in January 2014 to around $46,000 in January 2015. A fair criticism of using this timeframe is that Bitcoin was near a local high, a “blow-off top”, as some analysts call it. Thanks to Bitcoin’s extreme volatility, comparisons like this are heavily influenced by timing. For example, if you were to compare from January 2015 when Nvidia was at around $5 and Bitcoin at $265, the cryptocurrency has the edge. However, if you use January 2019 as the starting point, when both assets were near a local low and, with the benefit of hindsight, about to head into a major bull run, Nvidia still wins. While Nvidia is best known among PC gamers for its graphics chips, the company has seen strong demand for its products from other industries. Its rally was fuelled by excitement over self-driving cars, unprecedented demand for its chips during the 2020–2021 cryptocurrency bull run, and increased demand for artificial intelligence computing power. Optimism over the demand self-driving cars would create for Nvidia’s products dates back several years. Although analysts like Joseph Spak may have got the timelines wrong — he said in 2018 the consensus was that robo-taxis would be a reality by 2020 and “only scale from there” — development in the field continues. Ark Invest CEO Cathie Wood told Bloomberg last year they believe “transportation is going autonomous.” Wood said the robo-taxi sector would generate at least $8 trillion in revenue by 2030. However, while some investors are betting on Nvidia’s product for self-driving vehicles, Nvidia Drive, Wood’s company famously sold most of its Nvidia holdings. They are betting that Elon Musk’s Tesla will deliver the greatest gains in the full self-driving revolution. Nvidia announced at CES this week that it has signed deals with Li Auto, GWM, ZEEKR, and Xiaomi to power the autonomous driving systems in their electric vehicles. Between April 2020 and November 2021, Nvidia’s share price soared as cryptocurrency miners slurped up every powerful graphics card they could find. The price chart above illustrates the correlation between the Bitcoin price and Nvidia’s share price during that period. As Bitcoin’s price plummeted, so did Nvidia’s. It should be noted that the Bitcoin price is a stand-in for the whole cryptocurrency market in this instance. Nvidia’s chips were not used to mine Bitcoin directly, as its mining algorithm does not favour the type of computing power available in graphics chips. Instead, miners used graphics hardware to mine alternative cryptocurrencies, especially Ethereum. News that Ethereum would be switching away from proof-of-work mining algorithms dragged on Nvidia’s price. The blockchain completed its switch away from mining in an upgrade called “The Merge” in September 2022, causing graphics card prices to plummet. Then, at the end of 2022, ChatGPT burst onto the scene, and Nvidia soared — along with the demand for its hardware that is used extensively in training large language models. Most recently, J.P. Morgan’s Harlan Sur said he believes Nvidia has even more room to grow beyond the current AI fever thanks to its healthcare products. “Nvidia’s ability to drive accelerated computational solutions through its HPC and AI/DL platforms continue to drive significant revenue opportunity for the firm,” Sur stated. “Moreover, the team continues to see strong market expansion potential driven by opportunities in wearables, medical/imaging/robotics, and computer-aided drug discovery.” Business Insider reported in December that one of the consequences of Nvidia’s success is that long-time staff members have become millionaires. Citing an anonymous source at the company, the report said even middle managers made over $1 million (R18.7 million) per year in total compensation thanks to the stock options they receive as part of their pay packages. It should be noted that stock awards like these are usually incentives for remaining at the company and ensuring its long-term success, and can’t be sold immediately. According to the report, there was some negativity from newer employees who complained that old-timers had stopped pulling their weight and were in “semi-retirement mode”. However, staff told Business Insider that they remained extremely loyal and had faith in Nvidia CEO Jensen Huang’s leadership. bitcoin Cathie Wood Ethereum GWM Harlan Sur Headline JP Morgan Li Auto Nvidia robotaxis Xiaomi ZEEKR Comments section policy: MyBroadband has a new article comments policy which aims to encourage constructive discussions. To get your comments published, make sure it is civil and adds value to the discussion.   How do you purchase your airtime and/or mobile data?  View Results "
}