{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.benzinga.com/news/earnings/24/01/36681157/why-are-nvidia-and-amd-stocks-are-trading-higher-thursday",
    "text": "Nvidia Corp NVDA is trading higher Thursday along with peers, including Advanced Micro Devices, Inc AMD, after their crucial supplier, Taiwan Semiconductor Manufacturing Company Ltd TSM, impressed the Street with its fourth-quarter results. The Taiwan contract chipmaker clocked a fourth-quarter revenue of $19.62 billion, down by 1.5% year-on-year, beating the consensus of $19.45 billion. EPS of $1.44 beat the consensus of $1.37. TSMC expects FY24 revenue to grow in the low to mid-20% range. The contract chipmaker expects a FY24 capital budget of $28 billion – $32 billion vs $30.45 billion reported in 2023. Bernstein analyst Stacy Rasgon hailed Nvidia as the cheapest stock to gain exposure to an artificial intelligence frenzy. KeyBanc analyst John Vinh noted over 30% upside from Nvidia and AMD due to their AI moat. At CES, Truist analyst William Stein met with executives representing Nvidia and its peers. Despite recent negative updates from other tech companies, the tone of the meetings was more optimistic than expected. Stein maintained a positive outlook on the semiconductor industry, with Nvidia and AMD among his top picks. A key focus at this year’s CES was AI, with consumer and edge AI applications featuring prominently. This aligns with statements from Intel Corp INTC and AMD about AI moving from the cloud to consumer objects and PCs, indicating a significant opportunity for semiconductor companies in these markets. Gaming technology also continued to be a significant focus, with Intel displaying its new 14th-gen mobile processors and Nvidia announcing new Super versions of its GeForce GPUs and the open beta of RTX Remix for enhancing classic games with AI tools. Regarding market performance, Nvidia will likely launch a China-specific chip by 2Q24. Meanwhile, India’s Yotta plans to deploy Nvidia’s H100s and H200s by 2025 significantly. Nvidia stock has gained over 228% in the last 12 months thanks to the AI frenzy while AMD gained 134%. Price Actions: NVDA shares traded higher by 2.20% at $572.88 on the last check Thursday. AMD shares traded higher by 1.84% at $163.12. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Is AMD a Good Stock To Buy? Wall Street analysts view Advanced Micro Devices AMD on the whole as a Buy, given the history of coverage over the past three months. Tom O’Malley from Barclays in Advanced Micro Devices is the most optimistic, expecting a 66.67% rise in the stock in the coming year. But looking at how the market as a whole thinks of the stock, you can reference historical price action for views on whether investors feel strongly about the stock one way or another. In the past 3 months, Advanced Micro Devices rose 63.61%, which indicates that opinion improved on the business and how attractive it is to own based on either its stock price, or underlying fundamentals, like revenue, which rose 4.22% over the past year. A complete overview of how Wall Street views individual stocks is available here, while real time updates on the latest analyst actions will be delivered via Benzinga PRO. Try it for free. Image Via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}