{
    "title": null,
    "date": "1/10/2024",
    "url": "https://investorplace.com/2024/01/hot-stocks-to-watch-the-next-3-trillion-dollar-companies/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. The next trillion dollar companies have some of the strongest stocks available to investors Advertisement Source: Serhii Milekhin / Shutterstock.com Apple is currently the world’s most valuable stock with a market capitalization of $2.86 trillion. It was the first company to reach that threshold and to this date is the only one to have done so. Apple first passed the $3 trillion mark in June of 2023. It remained there through July until ultimately dipping back again below $3 trillion. Then the company again ascended past that mark in December. The question of which company will next pass $3 trillion in market cap is an interesting one and has an answer that won’t surprise many readers. The leading tech companies of the day have, by far and away, the best chances of doing so next. Microsoft (NASDAQ:MSFT) Is presumed to be the next stock to pass evaluation of $3 trillion. When Apple passed that mark back in the summer, speculation and headlines began to focus on who was logically next. The answer of course was Microsoft. The logic behind that assertion is very simple:  Microsoft will get there through its continued monetization of artificial intelligence. At least that’s what this article from Barron’s assumes. Wedbush analyst Dan Ives believes that Microsoft is on track to pass that threshold early this year. When he made that prediction, in July, he had roughly six months to go. Today, Microsoft’s valuation sits at $2.76 trillion so Ives has a decent chance of being correct. I just like to make one point about his assertion that Microsoft will get to $3 trillion due to monetization of artificial intelligence. Yes, Microsoft is monetizing AI in the sense that capital is flowing into its shares because of AI. However, the company isn’t directly seeing massive sales spikes of its products directly due to AI, at least not on the level of the firm immediately below. Regardless, I think Ives is right and Microsoft is almost certainly going to be the second company to reach such a valuation. Nvidia (NASDAQ:NVDA) joined the ranks of stocks with a market cap of $1 trillion back in June. It has never dipped below that level since but that said the march to $3 trillion is going to be difficult, isn’t it? Actually though, if you look at the math behind Nvidia’s current price and target price, $3 trillion isn’t actually that far away. The company shares currently trade for $490 and carry an average target price of $663.74. If Nvidia’s shares rise to that level, its market cap will rise above $1.6 trillion. Here’s where it gets interesting: the high Target price on Wall Street for NVDA shares is $1,100. With 2.47 billion shares outstanding that equates to a market capitalization above $2.7 trillion. Projections vary wildly and are simply educated guesses. However, I think there is a distinct possibility for Nvidia to reach $1,100 in 2024. The company will release its h200 chip this year which will improve upon its industry leading h100 chip. What if the h200 chip, which is expected to be twice as powerful as the h100, fetches prices twice as high as those for the h100 chip? $1,100 then becomes a much more realistic price level for the company’s shares. Google’s (NASDAQ:GOOG,GOOGL) current market cap is approximately $1.7 trillion. The company has yet to reach $2 trillion in market cap and came closest, at $1.98 trillion in late 2021. That said, it’s clear that Google has a very strong chance of becoming one of the next three trillion dollar companies. Current projections regarding price and earnings suggest that that could happen sometime in the next few years. Let’s look at those projections and run the numbers. I’ll be using the company’s current price to earnings ratio of 26 and assuming that that will hold steady. That’s an unrealistic assumption but it will at least provide us some sort of guidance in doing the arithmetic comparison. Google’s shares have had an average EPS of $5.91 throughout all of 2023. Assuming that P/E ratio of 26 that equates to a rough price of $150 for its shares. With 5.73 billion shares outstanding, that equates to a market cap of approximately $1.7 trillion. Based on this projection of Google’s future earnings, the company should surpass a market cap of 3 trillion in 2027. Its EPS is expected to average $10.66 in 2027. That puts its value at $3.06 trillion assuming a steady P/E ratio of 26 and the same number of shares outstanding.  On the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Alex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/hot-stocks-to-watch-the-next-3-trillion-dollar-companies/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}