{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.pymnts.com/artificial-intelligence-2/2024/google-microsoft-nvidia-and-others-join-federal-pilot-to-democratize-ai-access/",
    "text": "Artificial intelligence (AI) has captivated the world — but also spurred fears of industry capture. After all, while AI has the potential to make information, tools and resources more accessible to a wider range of people, in order to effectively democratize access to information, access to AI systems themselves needs to be democratized. And while AI in the United States is advancing rapidly, opportunities to pursue cutting-edge AI research and new AI applications are often inaccessible to researchers. The National Science Foundation (NSF) on Wednesday (Jan. 24) announced an ambitious federal program designed to increase access to AI resources, including tools, data and computing infrastructure, beyond just the world’s most valuable tech businesses. The pilot program, called the National Artificial Intelligence Research Resource (NAIRR), comes after the White House’s executive order mandating that barriers to entry to AI infrastructure be lowered. “By creating an equitable cyberinfrastructure for cutting-edge AI that builds on-ramps for participation for a wide range of researchers and communities, the NAIRR could build AI capacity across the nation and support responsible AI research and development, thereby driving innovation and ensuring long-term U.S. competitiveness in this critical technology area,” said NSF Director Sethuraman Panchanathan. Of course, the world’s most valuable tech businesses will be participating in the program themselves, with Google, Amazon Web Services (AWS), Meta, Microsoft, NVIDIA, Intel, IBM, OpenAI and Anthropic, among others, providing resources, funding and tools alongside 11 federal agencies. “The NAIRR is a vision of a national research infrastructure that will provide access to computing, data, models and software to empower researchers and communities,” said Katie Antypas, director of the Office of Advanced Cyberinfrastructure at the NSF. “Smaller institutions, rural institutions, institutions serving underrepresented populations are key communities we’re trying to reach with the NAIRR. These communities are less likely to have resources to build their own computing or data resources,” Antypas added. “AI is increasingly defining our era, and its potential can best be fulfilled with broad access to its transformative capabilities,” said NVIDIA founder and CEO Jensen Huang in statement. The NAIRR pilot will run for two years, until 2026. Read more: A Look at U.S. Initiatives on AI Use and Its Development Alongside 25 private sector AI organizations, the NAIRR pilot program’s public sector contributors include the Department of Defense (DOD), Department of Energy (DOE), NASA, National Institutes of Health (NIH), National Institute of Standards and Technology (NIST), the Defense Advanced Research Projects Agency (DARPA), among others. “Partnerships are really at the core of the NAIRR pilot. … It’s been incredibly impressive to see this breadth of partners come together in these 90 days, bringing together government, industry, nonprofits and philanthropies,” said Tess DeBlanc-Knowles, NSF’s special assistant to the director for artificial intelligence. “This commitment is more than just an investment in technology; it’s an investment in our future, and a testament to the power of broad collaboration in unlocking the full potential of AI to benefit humanity,” Eric Horvitz, chief scientific officer at Microsoft, wrote in a statement. Contributions range from access to, and use of, the DOE’s Summit supercomputer, to datasets from NASA and the National Oceanic and Atmospheric Administration, to access to foundational AI models from OpenAI, Anthropic and Meta, and tens of millions in credits to cloud and infrastructure platforms and resources from Microsoft, NVIDIA and others. Shaunt Sarkissian, founder and CEO at AI-ID, told PYMNTS in June that industry players should approach lawmakers with the attitude of, “We know this is new, we know it’s a little bit spooky, let’s work together.” Read also: Who Will Power the GenAI Operating System? The launch of the NAIRR pilot on Wednesday meets a goal outlined in the White House’s October 2023 executive order directing the NSF to launch a pilot for the NAIRR within 90 days. The pilot will focus on four areas, NAIRR Open, NAIRR Secure, NAIRR Software, and NAIRR Classroom. NAIRR Open, led by the NSF, will support open AI research by providing access to diverse AI resources; while NAIRR Secure, which will be co-led by the NIH and DOE, will support AI research requiring privacy and security-preserving resources as well as assemble “exemplar” privacy-preserving resources, per the NAIRR site. NAIRR Software, another focus area led by the NSF, will facilitate and investigate interoperable use of AI software, platforms, tools and services for NAIRR pilot resources; while NAIRR Classroom will reach new communities through education, training, user support and outreach. PYMNTS reported earlier this week (Jan. 23) about how colleges and universities are increasingly weaving AI into their lesson plans.  We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}