{
    "title": "Nvidia's scorching shares drew hedge funds in Q4, filings show",
    "date": "2/15/2024",
    "url": "https://www.channelnewsasia.com/business/nvidias-scorching-shares-drew-hedge-funds-q4-filings-show-4124526",
    "text": "Business Business FILE PHOTO: A view of a Nvidia logo at their headquarters in Taipei, Taiwan May 31, 2023. REUTERS/Ann Wang/File Photo This audio is AI-generated. (This Feb. 14 story has been corrected to change stock performance to 'nearly 240 per cent' from 65 per cent, in paragraph 2) By David Randall NEW YORK :     Several well-known funds jumped into shares of chipmaker Nvidia at the end of last year, securities filings showed on Wednesday, potentially setting themselves up to benefit from the nearly 50 per cent gain the stock has notched so far in 2024. Nvidia has been a top beneficiary of technology companies' race to build artificial intelligence into their products and services, with investor excitement over the new technology sending the stock up nearly 240 per cent last year. The chipmaker overtook Alphabet as the third most valuable U.S. company on Wednesday, with a market capitalization of $1.78 trillion. Among the funds adding new stakes in Nvidia were Rokos Capital Management, which bought more than 254,000 shares, a stake worth more than $126 million as of the end of December. Bridgewater Associates, the hedge fund founded by billionaire Ray Dalio, increased its stake in Nvidia by 458 per cent to more than 268,000 shares. The position was valued at $133 million at the end of December. Arrowstreet Capital, meanwhile, added 3.9 million shares to its previous small position, leaving it with a $2.1 billion position. Some funds, meanwhile, sold all or part of their stakes. Greg Poole's Echo Street Capital Management sold all of its more than 355,000 shares. D1 Capital Partners sold nearly 147,000 shares, closing out its position, while Discovery Capital Management sold its about 119,000 shares, which had been 9.2 per cent of its prior portfolio. The positions were revealed in securities filings known as 13Fs that hedge funds and other institutional investors file at the end of each quarter. While they are backward-looking and do not reveal current holdings or short positions, the filings are one of the few ways to gain insight into the portfolios of often-secretive funds. Nvidia will release its quarterly earnings results on Feb. 21. Analysts, on average, see the company's January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging more than 400 per cent to $11.38 billion.   This service is not intended for persons residing in the E.U. By clicking subscribe, I agree to receive news updates and promotional material from Mediacorp and Mediacorp's partners. Copyright© Mediacorp 2024. Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with CNA to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us "
}