{
    "title": "Northern Data Group to present future of AI, high-performance computing and \ncryptocurrency at NVIDIA GTC 2024",
    "date": "2/29/2024",
    "url": "https://www.arabianbusiness.com/resources/northern-data-group-pioneers-high-performance-computing-to-boost-business-infrastructure",
    "text": "بالعربية Русский  Arabian Business Resources > Northern Data Group to present future of AI, high-performance computing and cryptocurrency at NVIDIA GTC 2024 by\nAdmin Meet Northern Data Group at NVIDIA GTC 2024 to get inside track on the future of cryptocurrency, artificial intelligence and high-performance computing infrastructure Northern Data Group, a leading provider of high-performance computing infrastructure solutions, is pioneering next-generation technology services for partners. As a world-leader in the fields of cryptocurrency, artificial intelligence and high-performance computing it will be among the presenters and NVIDIA GTC 2024, a pioneering conference for the AI industry. NVIDIA GTC will be held in California, USA next month and see industry experts gather for more than 900 sessions to discuss and inspire the future of AI. Tech specialists Northern Data Group will be in attendance. It supports businesses and research institutions through three core business divisions: With its high-performance computing infrastructure, Northern Data Group looks to support partners in the AI, ML, and Generative AI industries. Northern Group is an Elite Partner of $2bn chip giant NVIDIA. As a leading partner it is also a Platinum Sponsor at NVIDIA GTC in San Jose, California. The world’s leading artificial intelligence conference for developers, engineers, researchers and IT professionals puts data science, artificial intelligence and machine learning under the spotlight and Northern Data Group will be presenting technical demonstrations of its latest innovations. In a session titled “Balancing power, planet and innovation – how to credibly address sustainability and ethics for Generative AI innovations”, Northern Data Group COO Rosanne Kincaid-Smith and Karl Havard, Managing Director of Taiga Cloud will discuss key tends in the industry. Director of Engineering at Taiga Cloud, Christof Stührmann, will also discuss cloud computing and a new generation of innovation at the event. Find out more here. Follow us on Brand View allows our business partners to share content with Arabian Business readers.The content is supplied by Arabian Business Brand View Partners.  "
}