{
    "title": "AI Hype Has Made Nvidia More Valuable Than Amazon",
    "date": "2/13/2024",
    "url": "https://markets.businessinsider.com/news/stocks/artificial-intelligence-nvidia-stock-amazon-nvda-amzn-ai-semiconductor-chips-2024-2",
    "text": "       Nvidia surpassed Amazon to become the fourth most valuable company in America and the fifth most valuable company in the world on Tuesday. The milestone was briefly reached during Monday's trading session, but ultimately reversed by the end of the day. On Tuesday, Nvidia shares jumped about 1% despite a broader decline in the stock market, while Amazon shares declined by about 1.5%. Nvidia has not been worth more than Amazon since April 2002, which was a period of weakness for both companies while the dot-com bubble was still bursting. Back then, Nvidia had a valuation of about $6 billion, compared to Amazon's $5.5 billion valuation. Since then, both companies have seen their stock prices soar by more than 24,000%. Now, on the back of strong demand for its AI chips, Nvidia has reached a valuation of $1.80 trillion — about $36 billion ahead of Amazon's $1.76 trillion valuation and about $20 billion behind the next biggest company, Alphabet. The only other companies worth more than Nvidia are Saudi Aramco, Apple, and Microsoft. Investors will be looking to Nvidia's upcoming earnings report next week to see if it can keep up the momentum. Expectations are high after Nvidia reported a spate of better-than-expected earnings results last year, helping build up the current rally. Bank of America expects Nvidia's stock to continue climbing. In a note from earlier this month, the bank raised its price target on Nvidia to $800 and said that if everything goes right for the company, it could generate long-term earnings per share of $80. The surge in earnings estimates for Nvidia helps shed light on a rather rare phenomenon in the stock market: despite Nvidia stock soaring nearly 250% over the past year, its price-to-earnings ratio has actually declined. In February 2023, Nvidia had a trailing 12-month price-to-earnings ratio of about 125x. Today, the company's trailing price-to-earnings ratio is 96x. In other words, Nvidia stock has actually gotten cheaper over the past year even as its stock price has more than tripled. Read next Indices Commodities Currencies Stocks Jump to "
}