{
    "title": "SoftBank mulls $100 billion AI-chip play as big cash sloshes around the \nsemiconductor sector",
    "date": "2/19/2024",
    "url": "https://fortune.com/2024/02/19/softbank-ai-chips-nvidia-altman-globalfoundries-intel/",
    "text": "As the share prices of Arm and Nvidia have demonstrated in the last month—they’re up 63% and 26% respectively over that period—the chip sector is arguably where the action is these days. And the excitement continues to ratchet up. The biggest (in money terms) news came on Friday, when Bloomberg reported that Masayoshi Son’s SoftBank planned to attack Nvidia head-on with a new AI chip venture, for which Son was hoping to raise $100 billion. Of that sum, $30 billion would apparently come from SoftBank and $70 billion from Middle Eastern institutions. The venture is reportedly codenamed Izanagi, in reference to the Japanese creator deity. SoftBank used to have a $3.6 billion stake in Nvidia, but dumped it all at the start of 2019, and now wants to create a rival. The Izanagi news sent SoftBank’s share price up by nearly 5% today. If the plan comes to fruition, it will be interesting to see any alliance between it and Arm, in which SoftBank has a 90% stake. As Arm’s chip designs have become crucial to chipmakers such as Nvidia, Arm risks raising antitrust concerns if it partners with any chipmakers. Just ask Nvidia, whose planned $40 billion takeover of Arm collapsed two years ago in the face of regulatory scrutiny. (Nvidia did however recently take a $147 million stake in Arm, which currently enjoys a market cap of $132 billion.) SoftBank’s big chip play is yet another indicator of its pivot from funding startups—which mostly turned out pretty badly—to focusing on semiconductors. The company is awash with cash, thanks to both a windfall stemming from the 2020 merger of T-Mobile US with SoftBank’s Sprint, and the sudden rise in Arm’s fortunes. (It may or may not be worth noting at this point that SoftBank is among the rumored potential buyers for the U.K. AI-chip firm Graphcore, which is hemorrhaging money and desperately seeking a way out.) As for looking to the Middle East for the rest of Izanagi’s funding…well, that sounds familiar. OpenAI CEO Sam Altman is doing the same thing for his proposed, supposedly multi-trillion-dollar AI-chip venture, and Bloomberg reported Friday that he’s seeking the U.S. government’s blessing, for a couple reasons. First, there’s a likelihood of major Middle Eastern backing sparking a national-security review. Second, if this ends up being a separate venture from OpenAI but OpenAI ends up being a customer or competitor, Altman could place himself in a conflict of interest that might attract antitrust scrutiny. Speaking of the U.S. government, the Biden administration is starting to hand out the first really enormous piles of subsidies under the 2022 CHIPS Act, to stimulate semiconductor manufacturing on American soil. (Microchip Technology has already been awarded $162 million, and BAE Systems $35 million.) Today, the government announced it had signed preliminary terms with GlobalFoundries, in which the giant chipmaking contractor will receive $1.5 billion to build out and modernize its U.S. production capabilities. And Bloomberg reports that Intel may receive $10 billion to support the onshoring of some of its manufacturing. Even if the up-to-$7 trillion Altman is reportedly seeking for his chip venture is fantasy money, the real sums in play these days are eye-watering enough. More news below. David Meyer Want to send thoughts or suggestions to Data Sheet? Drop a line here. TikTok EU probe. As predicted earlier this month, the European Commission has opened a formal investigation into TikTok’s potential breaching of the EU’s new Digital Services Act (DSA) content rules. The Commission, which enforces the new law on Big Tech firms, says it suspects TikTok may have designed its app to “stimulate behavioral addictions and/or create so-called ‘rabbit-hole effects,’” with possible consequences for children’s rights and online radicalization. It also doesn’t like TikTok’s age-verification processes and other child-protection measures, nor its lack of transparency around research data and ads. DSA fines can run up to 6% of global revenues. Election interference alliance. Generative AI companies like Microsoft, OpenAI, and Adobe have banded together with social media platforms such as Meta, TikTok, and X to sign an accord aimed at countering AI disinformation in this grand slam of an election year (over half the world’s population will see elections). As Reuters reports, the companies will work on tools for detecting misleading AI-generated content, and will try to educate voters about the dangers out there. A big however: There’s no stated timeline for meeting these commitments. U.K. school phone bans. The British government is planning to give schools official guidance on how to implement bans on mobile phone usage, the Guardian reports. Some schools already have bans in place, but many education leaders point out that the targeted problems—compulsive use, online bullying, and so on—occur when the kids are out of school and therefore not subject to the bans. —The OpenAI valuation at which the company has struck a deal with its workers, allowing them to sell their stakes, according to Bloomberg. The tender offer was delayed by the drama of CEO Sam Altman’s ouster and return late last year. Shares of Nintendo drop as much as 8.8% as it reportedly delays its next Switch console, the latest bad news for a struggling gaming sector, by Lionel Lim Apple’s looming $540 million EU fine is a warning sign to other U.S. companies, by Peter Vanham SEC greenlights Trump’s Truth Social public offering, by Chris Morris Elon Musk said it was ‘time to move on’ from hybrids years ago—but a windfall from them will help Japanese carmakers challenge Tesla in EVs, by Steve Mollman Coinbase is doing everything right. That might not be enough, by Jeff John Roberts Mark Zuckerberg says his daughter ‘thought that I was a cattle rancher’ for a while thanks to his unusual hobby in Hawaii, by Steve Mollman Air Canada’s chatbot regrets. Canada’s small-claims court has forced Air Canada to honor the policy its customer-services AI chatbot made up when dealing with a grieving passenger. Air Canada’s actual policy does not allow passengers to retrospectively request bereavement rates after they’ve made the booking, but the chatbot told Jake Moffatt, whose grandma had just died, that he could book his flight immediately and then claim a bereavement refund within 90 days. As Ars Technica reports, Air Canada refused to issue the refund and, when Moffatt took it to Canada’s Civil Resolution Tribunal, tried to argue that it wasn’t responsible for what its chatbot said. No dice. This is the web version of Data Sheet, a daily newsletter on the business of tech. Sign up to get it delivered free to your inbox. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}