{
    "title": "Will Nvidia Be a $2 Trillion Company in 2024?",
    "date": "2/3/2024",
    "url": "https://finance.yahoo.com/news/nvidia-2-trillion-company-2024-123300000.html",
    "text": "Right now, only two U.S. companies have market caps greater than $2 trillion, Microsoft and Apple. As of Jan. 31, Nvidia (NASDAQ: NVDA) is the fifth-largest U.S. company (sixth-largest globally) with a $1.5 trillion market cap. So, for Nvidia to reach a $2 trillion valuation in 2024, it would need to grow 33% from its current stock price. Is this out of the question? Or could Nvidia become the third company to obtain a $2 trillion market cap? Nvidia's primary business is graphics processing units (GPUs). Although this hardware was originally slated to be used by individuals who wanted better graphics than their processors could create while gaming, the uses quickly expanded. Now, GPUs are used to power gaming rigs, mine cryptocurrency, process engineering simulations, and create artificial intelligence (AI) models. The latter example is why Nvidia's stock has been a powerhouse over the past year, as AI demand has dramatically improved Nvidia's financial situation. In the second and third quarters of fiscal year 2024 (ended July 30 and October 29, respectively), Nvidia posted year-over-year revenue growth of 101% and 206%. This strength is expected to continue into the fourth quarter and beyond, as management guided for $20 billion in revenue, indicating 231% growth year over year. Clearly, AI is having a massive effect on Nvidia, and with the purpose-built AI supercomputer infrastructure buildout not yet complete, it has a ways to go. But is reaching a $2 trillion market cap realistic? Nvidia's prospects are well known. As a result, the stock has garnered a premium valuation because investors have already baked in substantial business gains. Few people would consider the stock cheap, with the stock trading at 83 times trailing and 51 times forward earnings. If Nvidia's stock price rose an additional 33%, so would these valuations, bringing these two valuation metrics to 110 times trailing and 68 times forward earnings. But this doesn't take into account Nvidia's earnings growth throughout 2023. If you look at Nvidia's forward price-to-earnings ratio for fiscal year 2025, it's 31 times earnings -- a far more reasonable level. A 33% increase from that ratio would be 41.2 times earnings, still cheaper than where the stock is today. So, if Nvidia continues to deliver solid results, investors shouldn't be surprised if the stock can increase enough to achieve the $2 trillion valuation sometime this year. A key piece of information will be provided to investors when it reports Q4 results sometime in late February: FY 2025 guidance. This will clue investors into what can be expected this year. With Nvidia's current valuation, nothing less than incredible sales growth will do, which could be setting the stock up for failure. However, with AI demand still ramping up, I wouldn't be surprised if it reported a strong quarter with jaw-dropping guidance. But my biggest concern isn't with what Nvidia does over the next year or two; it's what happens after that. Nvidia is a hardware company, and once the infrastructure is built out, Nvidia won't have the same demand for GPUs as it has now. This will inevitably lead to a substantial revenue drop. Unfortunately, I have no idea when that is coming. So it could happen this year or a decade from now. If it's the former, I'll be proven right by not buying the stock. If it's the latter, I'll miss out on a massive winner. What's my plan? I'm going to see what Nvidia says in its Q4 guidance. If it's great, then I will likely purchase some shares. I'll likely pass on the stock if it's not what I want to see. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 29, 2024  Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Will Nvidia Be a $2 Trillion Company in 2024? was originally published by The Motley Fool Related Quotes "
}