{
    "title": "Stock Market Today: Dow Jones Falls On Surprise GDP Data; Cathie Wood Sells \nMore Nvidia Stock",
    "date": "2/28/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-nasdaq-sp500-cathie-wood-nvidia-nvda-stock/",
    "text": "BREAKING: Futures Fall Slightly The Dow Jones Industrial Average and the other major indexes dropped after weaker-than-expected GDP data ahead of the opening bell Wednesday. Meanwhile, famed investor Cathie Wood continued to sell shares of Nvidia (NVDA) on the stock market today. The Dow Jones Industrial Average lost 0.4% in morning action, while the S&P 500 was down 0.3%. The tech-heavy Nasdaq composite dropped 0.6% after the opening bell. Among U.S. exchange traded funds, the Nasdaq 100 tracker Invesco QQQ Trust (QQQ) exchange traded fund was down 0.6%, as the SPDR S&P 500 ETF (SPY) fell 0.3%. The 10-year Treasury yield ticked lower to 4.29%. Further, oil prices continue to hover around their recent highs, as West Texas Intermediate futures inched lower, back near $79 a barrel. Cathie Wood's Ark Genomic Revolution (ARKG) ETF sold nearly 6,700 shares of Nvidia stock Tuesday, or about $5.2 million worth using the closing price, per daily trade disclosures. On Monday, the fund sold another 2,700 shares of Nvidia. The Commerce Department said its second estimate of fourth-quarter GDP dipped to 3.2%. It was expected to remain unchanged from the agency's first reading, which came in at 3.3%. Personal consumption expenditures rose to 3.0%, above the 2.8% estimate. After Wednesday's open, earnings movers include Advance Auto Parts (AAP), Baidu (BIDU), eBay (EBAY) and TJX (TJX). Advance Auto shares climbed 3% in morning action, while Baidu shares dropped 7%. EBay rallied more than 7%. And TJX stock rose almost 1% in early trading. On Tuesday, the Dow Jones Industrial Average fell 0.3%, as the S&P 500 rose 0.2%. The tech-heavy Nasdaq composite climbed 0.4%. Tuesday's Big Picture column commented, \"While the stock market uptrend continues to show signs of strength, actionable stocks remain in short supply. That's because current stock market leaders that started to move in late October and early November are way past proper entry points. In many cases, stocks setting up now could be laggards in their group.\" Now is an important time to read IBD's The Big Picture column amid the continuing stock market rally. Be sure to read how to adjust to changing market conditions, with IBD's new exposure levels. Learn How To Time The Stock Market With IBD's ETF Market Strategy Birkenstock (BIRK), Lennar (LEN), SharkNinja (SN), Toll Brothers (TOL) and Weatherford (WFRD) — plus Dow Jones components Disney (DIS), Dow (DOW) and Procter & Gamble (PG) — are among the best stocks to buy and watch on the stock market today. Disney and Weatherford were featured in this Stocks Near A Buy Zone column. A great resource for daily breakouts is IBD MarketSmith's \"Breaking Out Today\" list. It shows MarketSmith Growth 250 stocks that are breaking out past new buy points. There were two breakouts Tuesday, including Qualcomm (QCOM), which broke out past a 157.98 flat-base entry. Meanwhile, the MarketSmith \"Near Pivot\" list shows stocks nearing buy points in bases, like Boot Barn (BOOT), which is approaching a 91.57 cup-with-handle entry. Get Real-Time Buy And Sell Alerts On Stock Market Leaders With IBD Leaderboard Disney is forming a big cup-with-handle base with a 112.92 buy point, according to IBD MarketSmith chart analysis. Shares are trading about 3% below the new buy point. Disney stock gained 0.8% on the stock market today. Consumer products giant Procter & Gamble declined 0.6% Tuesday, still in buy range above a 158.38 buy point in a cup base. P&G stock dipped 0.1% early Wednesday. Following last week's gains, chemicals giant Dow is in buy range past a 55.90 buy point in a flat base. Dow shares declined 1.4% Wednesday. 4 Top Growth Stocks To Watch In The Stock Market Rally Birkenstock is trying to break out past a choppy cup-with-handle's 51.09 buy point, according to IBD MarketSmith, with a 0.9% gain Tuesday. Earnings are due out Feb. 29. Birkenstock shares were down 0.6% Wednesday. Homebuilder Lennar remains just below its flat base's 156.01 buy point. Lennar shares rose 0.6% early Wednesday. Fellow homebuilder Toll Brothers is at the top of its buy range above a flat base's 105.91 buy point. Toll Brothers stock climbed 0.6% Wednesday morning. Recent IBD Stock Of The Day, SharkNinja, is above a flat base's 53.40 buy point. The buy zone runs up to 56.07. And the stock was up 0.4% Wednesday. Oil stock Weatherford remains in buy range above a 102.65 buy point in a cup base, despite a 0.9% drop Tuesday. The 5% buy range tops out at 107.78. The stock moved up 0.4% early Wednesday. IBD's latest newsletter MarketDiem gives you actionable ideas for stocks, options and crypto right in your inbox These are four best stocks to watch in today's stock market, including a Dow Jones leader. Join IBD experts as they analyze leading stocks in the current stock market rally on IBD Live Among Magnificent Seven stocks, Nvidia lost 1.7% and Tesla (TSLA) climbed 1.5% Wednesday. Nvidia shares continue to hold just off last week's record highs. They closed more than 50% past a 505.48 buy point in a flat base after a Jan. 8 breakout move. Tesla slashed gains to just 0.2% Tuesday, still moving up for a second straight day. Shares hit new recent highs before backing off. Among Dow Jones stocks in the Magnificent Seven, Apple (AAPL) and Microsoft (MSFT) traded lower after Wednesday's stock market open. Apple is forming a flat base with a buy point at 199.62. But Apple stock must first retake the key 50-day moving average, as it searches for support around its long-term 200-day line. Shares fell 0.8% Wednesday. Microsoft shares remain out of buy range past a 384.30 buy point in a flat base, despite a 0.7% fall Tuesday. The software giant fell 0.1% on the stock market today. Be sure to follow Scott Lehtonen on X, formerly known as Twitter, at @IBD_SLehtonen for more on growth stocks, the Dow Jones Industrial Average and the stock market today. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Nvidia Partner Rides AI Megatrends To 3,594% Gain — With More To Come Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/25/2024\nThe dovish Fed and the Nvidia-led AI boom continue to be the big stock market catalysts. Uber and Eli Llly... 3/25/2024\nThe dovish Fed and the Nvidia-led AI boom continue to... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}