{
    "title": null,
    "date": "2/8/2024",
    "url": "https://stocknews.com/news/nvda-mrvl-imos-3-chip-stocks-poised-for-2024-growth/",
    "text": "Login \n        Join Login \n                                            Join NVDA – The chip industry is poised to remain resilient, owing to soaring demand for chips across diverse sectors, rapid technological advancements, and government support. To that end, let’s explore chip stocks Marvell Technology (MRVL), NVIDIA Corporation (NVDA), and ChipMOS TECHNOLOGIES (IMOS), poised for substantial growth in 2024. Read on…. Feb 8, 2024 The importance of semiconductors in today’s tech-reliant society cannot be understated. The chip industry is anticipated to thrive amid lucrative government investments and continuous technological innovation, leading to the creation of advanced chips that cater to diverse industry requirements. Given the industry’s promising prospects, in this piece, we assessed three chip stocks to determine how they can help investors tap into the industry’s tailwinds. While chip stock ChipMOS TECHNOLOGIES INC. (IMOS) could be a wise portfolio addition in 2024, I think Marvell Technology, Inc. (MRVL) and NVIDIA Corporation (NVDA) should be kept on one’s watchlist for better entry opportunities. Before delving deeper into the fundamentals of the three stocks possessing substantial growth potential, let’s take a quick look at the industry landscape. The semiconductor industry demonstrated remarkable resilience during the latter part of 2023. According to the Semiconductor Industry Association (SIA), global semiconductor sales stood at $526.80 billion in 2023, and market growth is expected to reach double digits in 2024, attesting to the industry’s strength in the current year. Significant benefits, observed from recent subsidies announced by the Biden administration, have significantly boosted chip production within the U.S., helping the country maintain a competitive edge globally. The subsidies, a part of the Chips and Science Act, aim to allocate $53 billion to support the construction of the chip manufacturing plants. This move enables companies to develop finer semiconductors, thereby enhancing sectors like AI and military technology. Recent mergers and acquisitions have significantly broadened the industry’s product range, reinforced the market presence of companies, and significantly augmented chip market growth. Furthermore, expansions in cutting-edge logic and foundry capacity, applications in generative AI and high-performance computing (HPC), and resurgent end-demand for chips expand the opportunity window for further expansion in the chip industry. 2024 STOCK MARKET OUTLOOK The global semiconductor chip market is anticipated to reach $1.12 trillion, growing at a CAGR of 7.1% by 2032. Considering these conducive trends, let’s look at the fundamentals of the three Semiconductor & Wireless Chip stocks, starting with number 3. Stock #3: Marvell Technology, Inc. (MRVL) MRVL provides data infrastructure semiconductor solutions, spanning the data center core to the network edge. The company develops, scales complex System-on-a-Chip architectures, integrating analog, mixed-signal, and digital signal processing functionality. On January 31, MRVL paid its shareholders a quarterly dividend of $0.06 per share of common stock. Its annualized dividend rate of $0.24 per share translates to a dividend yield of 0.35% on the current share price. Its four-year average yield is 0.52%. The company has paid dividends for 11 consecutive years. On December 6, 2023, MRVL delivered two optical PAM4 digital signal processors (optical DSPs), Perseus and Marvell Spica Gen2, to enable cloud operators to serve the exploding demand for AI, accelerated computing, and cloud services by optimizing the performance, bandwidth, and efficiency of the optical links connecting data infrastructure. MRVL has long been at the forefront of expanding the applications and use cases for optical inside data centers. Perseus and Spica Gen2 represent the latest steps in that voyage. MRVL’s trailing-12-month cash from operations of $1.18 billion is significantly higher than the industry average of $81.24 million. Its trailing-12-month EBITDA and levered FCF margins of 18.17% and 26.84% are 101.5% and 210.2% higher than the industry averages of 9.02% and 8.65%, respectively. Over the past three and five years, its revenue grew at CAGRs of 23.9% and 15%, respectively, while its total assets grew at 26.1% and 16.2% CAGRs over the same periods. For the fiscal third quarter that ended October 28, 2023, MRVL’s net revenue and non-GAAP gross profit stood at $1.42 billion and $859.20 million, respectively. For the same quarter, its non-GAAP net income and non-GAAP net income per share stood at $354.10 million and $0.41, respectively. Moreover, for the same quarter, its cash and cash equivalents at end of period increased marginally year-over-year to $725.60 million. Street expects MRVL’s revenue and EPS for the fiscal fourth quarter of 2024 (ended January 2024) to increase marginally year-over-year to $1.42 billion and $0.46, respectively. The company surpassed consensus revenue estimates in each of the trailing four quarters and consensus EPS estimates in three of the trailing four quarters, which is impressive. The stock has gained 69.3% over the past nine months to close the last trading session at $69.37. Over the past year, it has gained 48.3%. MRVL’s fundamentals are reflected in its POWR Ratings. The stock has an overall C rating, equating to Neutral in our proprietary rating system. The POWR Ratings are calculated by considering 118 distinct factors, with each factor weighted to an optimal degree. The stock has a B grade for Growth and Sentiment. Within the 91-stock Semiconductor & Wireless Chip industry, it is ranked #61. To see additional POWR Ratings for Value, Momentum, Stability, and Quality for MRVL, click here. Stock #2: NVIDIA Corporation (NVDA) NVDA provides graphics, and compute and networking solutions in the U.S., Taiwan, China, and internationally. The company has two segments: Compute & Networking and Graphics. On February 6, NVDA collaborated with Cisco (CSCO) to deliver AI infrastructure solutions for the data center that are easy to deploy and manage, enabling the massive computing power that enterprises need to succeed in the AI era. CSCO, with its industry-leading expertise in Ethernet networking and extensive partner ecosystem, together with NVDA, the inventor of the GPU that fueled the AI boom, share a vision and commitment to help customers navigate the transitions for AI with highly secure Ethernet-based infrastructure. Working closely with CSCO, NVDA is making it easier than ever for enterprises to obtain the infrastructure they need to benefit from AI, the most powerful technology force. Its annualized dividend rate of $0.16 per share translates to a dividend yield of 0.02% on the current share price. Its four-year average yield is 0.10%. NVDA’s dividend payments have grown at a 1% CAGR over the past five years. NVDA’s trailing-12-month cash from operations of $18.84 billion is significantly higher than the industry average of $81.24 million. Likewise, its trailing-12-month ROCE, ROTC, and ROTA of 69.17%, 33.23%, and 34.88% are significantly higher than the industry averages of 1.45%, 2.46%, and 0.59%, respectively. Over the past three and five years, its revenue grew at CAGRs of 44.8% and 29.3%, respectively, while its total assets grew at 26.3% and 31.7% CAGRs over the same periods. For the fiscal third quarter that ended October 29, 2023, NVDA’s revenue and non-GAAP gross profit increased 205.5% and 308% year-over-year to $18.12 billion and $13.58 billion, respectively. Moreover, its free cash flow stood at $7.04 billion, up significantly from the prior-year quarter. For the same quarter, its non-GAAP net income and non-GAAP net income per share stood at $10.02 billion and $4.02, up 588.2% and 593.1% from the year-ago quarter, respectively. Street expects NVDA’s revenue and EPS for the fiscal fourth quarter of 2024 (ended January 2024) to increase 235.1% and 415.3% year-over-year to $20.27 billion and $4.53, respectively. The company surpassed consensus revenue and EPS estimates in each of the trailing four quarters. The stock has gained 216.2% over the past year to close the last trading session at $700.99. Over the past nine months, it has gained 144.4%. NVDA’s prospects are reflected in its POWR Ratings. The stock has an overall C rating, equating to Neutral in our proprietary rating system. NVDA has an A grade for Growth and Sentiment and a B for Quality. Within the same industry, it is ranked #22. Beyond what we’ve stated above, we have also rated the stock for Value, Momentum, and Stability. Get all ratings of NVDA here. Stock #1: ChipMOS TECHNOLOGIES INC. (IMOS) Headquartered in Hsinchu, Taiwan, IMOS researches, develops, manufactures, and sells high-integration and high-precision integrated circuits, and related assembly and testing services in the People’s Republic of China, Japan, Singapore, and internationally. It operates through Testing; Assembly; Testing and Assembly for LCD, OLED and Other Display Panel Driver Semiconductors; Bumping; and Others segments. It pays an annual dividend of $1.50 per share, which translates to a dividend yield of 5.61% on the current share price. Its four-year average yield is 7.03%. IMOS’ dividend payments have grown at a 6.4% CAGR over the past three years. IMOS’ trailing-12-month CAPEX/Sales of 16.48% is 590.7% higher than the industry average of 2.39%. Its trailing-12-month EBITDA and net income margins of 29.44% and 8.04% are 226.5% and 267.8% higher than the industry averages of 9.02% and 2.19%, respectively. IMOS’ revenue and EBITDA grew at 2.6% and 6.8% CAGRs, respectively, over the past five years. Over the past three and five years, its tangible book value grew at CAGRs of 6.8% and 6.9%, respectively, while its levered free cash flow grew at 27.6% and 46.3% CAGRs over the same periods. IMOS’ revenue for January 2024 amounted to TWD1.71 billion ($54.45 million), representing an increase of 28.4% year-over-year. For the fiscal third quarter that ended September 30, 2023, IMOS’ revenue and gross profit increased 6.2% and 9.5% year-over-year to TWD5.58 billion ($177.90 million) and TWD889.08 million ($28.34 million), respectively. For the same quarter, its profit for the period and earnings per share stood at TWD580.57 million ($18.50 million) and TWD0.80, respectively. As of September 30, 2023, IMOS’ total current assets stood at TWD20.08 billion ($639.86 million), compared to TWD16.01 billion ($510.19 million) as of September 30, 2022. Street expects IMOS’ revenue for the fiscal first quarter ending March 2024 to increase 7.7% year-over-year to $161.36 million. The company surpassed consensus revenue estimates in three of the trailing four quarters. The stock has gained 15% over the past three months to close the last trading session at $26.74. Over the past six months, it has gained 13.9%. IMOS’ robust prospects are reflected in its POWR Ratings. The stock has an overall A rating, equating to a Strong Buy in our proprietary rating system. IMOS has a B grade for Growth, Value, Momentum, and Stability. It is ranked first within the same industry. Click here for the additional POWR Ratings for IMOS (Sentiment and Quality). What To Do Next? Get your hands on this special report with 3 low priced companies with tremendous upside potential even in today’s volatile markets: 3 Stocks to DOUBLE This Year > Want More Great Investing Ideas? 3 Stocks to DOUBLE This Year Updated: 2024 Stock Market Outlook > 10 Stocks to SELL NOW! NVDA shares were unchanged in premarket trading Thursday. Year-to-date, NVDA has gained 41.55%, versus a 4.79% rise in the benchmark S&P 500 index during the same period. From her school days, Neha harbored a profound fascination for finance, a passion that steered her toward a career as an investment analyst following the completion of her bachelor's degree in commerce. Currently enrolled in the CFA program, Neha is dedicated to further enriching her comprehension of investment fundamentals.\r\n\r\nNeha's primary objective is to aid retail investors in discerning optimal investment opportunities by diligently evaluating crucial aspects of financial instruments, with a primary focus on stocks and ETFs. Her commitment lies in empowering individuals to make informed and strategic investment decisions in the dynamic world of finance. More... Copyright © 2024. Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions.Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use, please see disclaimer. "
}