{
    "title": "NVIDIA Q4 Preview: A Post-Earnings Correction Can Be A Buy Opportunity \n(NASDAQ:NVDA)",
    "date": "2/17/2024",
    "url": "https://seekingalpha.com/article/4671155-nvidia-q4-preview-post-earnings-correction-buy-opportunity",
    "text": "olm26250 olm26250 In my last coverage of NVIDIA (NASDAQ:NVDA) on May 30, 2023, I had a 'Neutral/Hold' stance on the stock, suggesting a performance outlook in-line with the S&P 500 (SPY) (SPX). This view more or less played out until January 2024, when the stock blasted up again to overall lead to outperformance over the market of +62.06%: Performance since Hunting Alpha's last coverage of NVIDIA (Seeking Alpha, Hunting Alpha's Last Article on NVIDIA) Performance since Hunting Alpha's last coverage of NVIDIA (Seeking Alpha, Hunting Alpha's Last Article on NVIDIA) As I did not provide any update to my stance in a pinned comment update, it is fair to say some alpha potential was lost here. I am bullish on NVIDIA heading into Q4 FY24 results. If there is a post-earnings correction, I intend to be a buyer provided these trends remain intact: Remaining performance obligations (RPO) represents the size of NVDA's backlog. RPO includes deferred revenue and yet-to-be invoiced revenue in future periods. This is a key number to keep track of as it is a leading indicator of future revenue potential. After 11 quarters (from Q3 FY21 to Q1 FY24) of broadly stagnant RPO levels around the $650 range, the last 2 quarters have seen an acceleration in YoY RPO growth: RPO YoY (Company Filings, Hunting Alpha Analysis) RPO YoY (Company Filings, Hunting Alpha Analysis) RPO recognized beyond the NTM currently makes up 58% of the overall RPO mix, standing at $520 million. This longer-term RPO is starting to see strong acceleration as visible from QoQ net new RPO movements: Net new beyond NTM RPO QoQ (USD mn) (Company Filings, Hunting Alpha Analysis) Net new beyond NTM RPO QoQ (USD mn) (Company Filings, Hunting Alpha Analysis) I view this as a particularly positive sign as it suggests NVIDIA's customers are locking in longer-term contracts. This provides good revenue stability and visibility well into 2025. Indeed, CEO Jensen Huang confirmed the same thing qualitatively when he confidently stated the following in the Q3 FY24 earnings call: Absolutely believe that data center can grow through 2025... Data center related product revenues make up 80.1% of the overall revenue mix. It is also growing the fastest at 279% YoY and 41% QoQ, driven by consumer internet companies, which make up almost half of overall data center revenues and cloud-service providers such as Google (GOOGL) (GOOG), Microsoft (MSFT) and Amazon (AMZN). I would like to emphasize that Enterprise AI adoption enables NVIDIA to continue expanding a high quality franchise via with very sticky products (as NVIDIA's chips are unrivalled) and a host of license and usage-based monetization opportunities. I see clear parallels to what Microsoft has been able to do with penetration of its software products across enterprises across the world - something I've discussed in more detail in my last coverage of MSFT. Importantly, the growth opportunity here is very much in its early innings as CEO Jensen Huang noted in the last earnings call (my bolded highlight): Large language model start-ups, consumer Internet companies and global cloud service providers are the first movers. The next waves are starting to build. NVIDIA's has 2 key product segments; a) Graphics; which primarily relates to graphics processing units (GPU)s used in gaming and PCs and b) Compute & Networking; which includes chips used for high performance computing in data center, networking, automotive ADAS, robotics and also special-purpose cryptocurrency mining uses. The key growth driver for the company right now is in the Compute & Networking segment, which has seen an explosion in growth: Compute & Networking Growth (Company Filings, Hunting Alpha Analysis) Compute & Networking Growth (Company Filings, Hunting Alpha Analysis) This is leading to a material mix shift in the revenue profile: Compute & Networking Revenue Mix (Company Filings, Hunting Alpha Analysis) Compute & Networking Revenue Mix (Company Filings, Hunting Alpha Analysis) I expect this to continue and management's narrative indicates the same thing as they flagged gaming revenues to see QoQ weakness in their Q4 FY24 outlook in the Q3 FY24 earnings call, driven by slower notebook demand. This mix-shift is accretive to margins since the Compute & Networking segment is ticking at 70% EBIT margins vs Graphics' 40% range. Hence, I expect margins for Q4 FY24 to continue ticking up, particularly at the gross margins level as the margin difference in the two segments is attributable to pricing effects more so than lower opex intensity: Normalized gross profit margin (Company Filings, Hunting Alpha Analysis) Normalized gross profit margin (Company Filings, Hunting Alpha Analysis) NVIDIA 1-yr fwd PE and Market Capitalization (Capital IQ, Hunting Alpha Analysis) NVIDIA 1-yr fwd PE and Market Capitalization (Capital IQ, Hunting Alpha Analysis) NVIDIA is trading at near-peak market capitalization levels at $1.8 trillion. However, its 1-yr fwd PE levels are near 5-yr trough levels at 36.8x. Given the bullish growth outlook, I believe this presents a potential buying opportunity. If this is your first time reading a Hunting Alpha article using Technical Analysis, you may want to read this post, which explains how and why I read the charts the way I do. NVIDIA Technical Analysis Relative to the S&P500 (TradingView, Hunting Alpha Analysis) NVIDIA Technical Analysis Relative to the S&P500 (TradingView, Hunting Alpha Analysis) On the monthly logarithmic chart of NVIDIA vs the S&P 500, the bullish breakout has already occurred. For a technically-aligned entry, I identify the next opportunity to buy to be at a pullback toward the consolidation levels. I use logarithmic charts as it better represents the growth picture in NVIDIA's adjusted (accounting for dividends) share price appreciation. I am bullish on NVIDIA as the backlog growth is very strong, giving healthy revenue stability and visibility beyond 2025. The company is in the early innings of a golden growth age as many other enterprises are yet to jump on the Enterprise AI bandwagon and new norm. Currently, the growth has been fueled mostly from large language model start-ups, consumer Internet companies and global cloud service providers. Financials, manufacturing companies, retail companies and the rest are yet to meaningfully begin investing in custom AI model infrastructure. I anticipate a favorable top-line mix shift to continue leading to favorable margin expansion in Q4 FY24 and beyond. Valuations are also in the buy-zone as the 1-yr fwd PE multiples are near the 5-yr trough levels. However, from a risks and positioning perspective, given the strong pre-earnings rally in the stock over the last month, I recognize that there may be a case of 'buy-the-rumor, sell-the-news' going on now as I see investor sentiment leading to some instances of this kind of activity. A recent example is Shopify (SHOP), which saw a post-earnings sell-off after reporting beats on revenues and margins. Hence, to avoid that risk, I prefer to wait till NVIDIA's earnings release on 21 February 2024, looking to buy upon weakness if it occurs. As usual, I will update my stance in a pinned comment to this article. Hence, I maintain my 'Neutral/Hold' stance for now. Strong Buy: Expect the company to outperform the S&P 500 on a total shareholder return basis, with higher than usual confidence Buy: Expect the company to outperform the S&P 500 on a total shareholder return basis Neutral/hold: Expect the company to perform in-line with the S&P 500 on a total shareholder return basis Sell: Expect the company to underperform the S&P 500 on a total shareholder return basis Strong Sell: Expect the company to underperform the S&P 500 on a total shareholder return basis, with higher than usual confidence The typical time-horizon for my views is multiple quarters to around a year. It is not set in stone. However, I will share updates on my changes in stance in a pinned comment to this article and may also publish a new article discussing the reasons for the change in view. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}