{
    "title": null,
    "date": "1/10/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36570947/is-nvidia-a-buy-after-2023s-stratospheric-rally-fund-manager-gary-black-thinks-its-",
    "text": "Shares of Nvidia Corp. NVDA have been on a tear since the beginning of 2023, reflecting investor confidence in the chipmaker’s AI capabilities. Despite this upward trend, a fund manager believes the stock is attractively valued given its growth potential. What Happened: Nvidia reached a new high on Tuesday, rallying 1.70% during the kickoff of the 2024 Consumer Electronics Show, closing at $531.40, according to Benzinga Pro data. The stock outperformed the Nasdaq 100 Index (up 0.17%) and the iShares Semiconductor ETF SOXX, which remained nearly flat. This rally contributed to Nvidia’s impressive gain of 264% since 2023. Chart courtesy of Benzinga See Also: How to Buy Nvidia (NVDA) Stock Gary Black, Future Fund managing partner and co-founder, said on X that investors are recognizing Nvidia’s continued affordability. Currently trading at 26.5 times the consensus adjusted earnings per share estimate for 2024, the company is expected to achieve a compounded annual growth rate of 28% in earnings per share between 2024 and 2028. Examining the reasons for this outperformance, Black, renowned for his bullish Tesla thesis, highlighted Nvidia’s best-in-class products, excellent execution, a robust management team, drama-free environment, and low headline risk. Why It’s Important: Despite the impressive surge, analysts foresee additional upside for the stock. The average 12-month analysts’ price target is $662.39, indicating approximately 25% potential upside from the current levels, according to TipRanks. Nvidia’s guidance for the fourth quarter predicts revenue of $20 billion, plus or minus 2%. If the company achieves this target, it is poised to report year-over-year revenue growth of over 230%. Notably, this positive outlook comes despite the U.S. ban on exporting certain high-performance chips to China, a crucial market for Nvidia. The Santa Clara, California-based chipmaker has found success with its AI accelerator chipsets, experiencing strong demand amid the popularity of generative AI software and applications. Read Next: Best Artificial Intelligence Stocks Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}