{
    "title": "NVIDIA and Jeff Bezos investing in Perplexity AI",
    "date": "1/24/2024",
    "url": "https://www.geeky-gadgets.com/nvidia-and-jeff-bezos-investing-in-perplexity-ai/",
    "text": "Geeky Gadgets The Latest Technology News 1:59 pm January 24, 2024 By Julian Horsey  In a bold move that’s catching the attention of the tech world, NVIDIA and Jeff Bezos have placed their bets on an AI startup named Perplexity. This company is shaking up the way we look for information on the internet. With a valuation now reaching $500 million, Perplexity has created a tool that can talk to users and give them straight answers, backed up by sources. This could be a big deal for how we use technology in our daily lives. The person at the center of Perplexity’s success is Aran Khanna, a co-founder with a history of working with big names like Google and OpenAI. The startup is growing fast, with more and more people using it, showing that people are really into this new way of finding information. Watch this video on YouTube. Perplexity is all about making things easier for the user, and you can see this in its partnership with the creators of the Rabbit R1 mobile device. This gadget is built to use Perplexity’s AI to give quick answers to questions just by talking to it. There’s no need to sign up for anything, and it keeps you in the know without any hassle. Powered by the most powerful AI models like GPT-4 and Claude 2, Perplexity Copilot offers the ability to access powerful artificial intelligence and cutting-edge large language models. Unlike basic search engines that shoot back quick answers, Perplexity Copilot chats with you. It asks. It listens. It refines its search based on what you really want. The result? Spot-on answers, virtually every time. Watch this video on YouTube. People are really excited about the Rabbit R1. It’s already sold out of pre-orders, and everyone’s waiting for it to come out around Easter. Even big names in tech, like Microsoft’s CEO Satya Nadella, are saying that AI is going to change the way we interact with computers and the gadgets we use. Start by asking a question you know will save you time and effort. That’s where Copilot shines. Forget about diving into an endless list of links. Copilot does the legwork by grasping the essence of your question To fine-tune your search, Copilot engages you with clarifying questions. This ensures you get what you’re actually after. Once it gets what you’re asking, Copilot scours a vast array of sources to ensure relevance and quality. What you get is a succinct answer. No fluff, all substance. Want to know more? Every source is just a click or tap away for deeper exploration. Students and academics, meet your ultimate research assistant. Imagine you’re knee-deep in literature reviews. Don’t just settle for endless scrolling. Copilot not only digs through academic databases but also asks what specifically you’re looking for. The result? A tailored list of sources and even summarized papers. Say hello to more time and smarter research. Be the unsung hero of your workplace. Lawyers, why drown in legal documents when Copilot can pinpoint case laws? Marketers, imagine having trend analyses summarized and served on a platter. Developers, think of debugging in minutes, not hours. Copilot delivers the data you need to make informed, impactful business decisions. News can be noisy. Copilot cuts through the clutter. Perplexity consolidates news from multiple angles, giving you a balanced view of current events. Stay informed, not overwhelmed. The money that NVIDIA and Jeff Bezos have put into Perplexity shows that they believe AI is going to be a big part of our future, making it easier and more natural for us to get to the information we need. With the Rabbit R1, Perplexity isn’t just putting out a new piece of tech; they’re leading us into a new chapter of how we talk to our machines. Other investors in Perplexity AI include : NEA, Elad Gil, Nat Friedman, Paul Buchheit, Yann LeCun, Databricks, Factorial Funds, Andrej Karpathy, Amjad Masad, Bob Muglia, Pieter Abbeel, Fraser Kelton, Kurt Keutzer, Soleio Cuervo, Andrew Krioukov, Abhay Parasnis, Max Kleiman-Weiner, Nal Kalchbrenner, Adrien Treuille, Clem Delangue, Zak Stone, Ashish Vaswani and David Ha.  Latest Geeky Gadgets Deals\n\n\nDisclosure: Some of our articles include affiliate links. If you buy something through one of these links, Geeky Gadgets may earn an affiliate commission. Learn about our  Disclosure Policy.  "
}