{
    "title": "Selling LEAPS as a Buy Limit in Nvidia (NVDA)",
    "date": "1/26/2024",
    "url": "https://www.cabotwealth.com/daily/options-trading/selling-leaps-as-a-buy-limit",
    "text": "If you’re interested in LEAPS investing and options trading, you may have already read our post about using LEAPS calls as a substitute for buying a stock. That article highlighted several of the benefits of investing in LEAPS for conservative investors, including position scaling and loss limiting, but one conservative strategy it didn’t touch on was selling LEAPS as an alternative to setting a long-term buy limit on a stock or ETF you’re interested in buying. On first impression, it may seem like introducing options and LEAPS trading into a conservative investment strategy would increase the risk, but that’s not actually the case. While selling LEAPS does add a little complexity to the trade, the right trade can actually be less risky than simply buying a stock. [text_ad] To better understand how a conservative investor can use selling LEAPs to potentially enter into a stock position, let’s break down several scenarios using Nvidia (NVDA), an aggressive growth stock that rose 239% in 2023 alone. As a refresher, keep in mind that a LEAPS contract represents 100 shares, and will generally require that you maintain the purchase price of those shares in cash (unless you’re selling naked puts, which is a complicated high-risk strategy that’s not appropriate for conservative investors). As of this writing, buying 100 shares of NVDA would cost you roughly $61,000. If you purchase the shares you have unlimited potential gains, and your maximum loss is $61,000 (unlimited gains are merely hypothetical as a stock can only trade so high). What if you wanted to change the dynamic of the trade and potentially reduce your purchase price in exchange for limiting your potential gains? Selling LEAPS can help you do that, and the best way to implement that trade depends on your goals and expectations for NVDA. We’ll use three strike prices at round numbers as they tend to attract higher volume, which translates to better liquidity and narrower differences between the bid and ask (the spread). Out-of-the-money puts – First, let’s look at out-of-the-money contracts. If you’re selling LEAPS, out-of-the-money puts mean that the contract strike price is below the current market value. For our example, we’ll look at a 500 strike price. The 500 strike with a January 2025 expiration is trading for roughly 40. Selling that contract would net you $4,000 in premium and tie up $50,000 (the strike price x 100 shares). Why make that trade? If you believe NVDA is overvalued but would be interested in buying it at 500, selling LEAPS allows you to imitate a long-term buy limit order. Plus, the premium you receive reduces your effective buy price to 460 (500 strike less 40 premium received). If the shares trade below the strike at expiration, your contract will be executed at $50,000 regardless of where the shares are. This trade is a losing proposition if the shares close below your effective buy price of 460 but it’s profitable at any price above that, and the premium represents a roughly 8% return if the contract expires worthless. At-the-money puts – Selling LEAPS at the money means using a strike price that is near the current share price—we’ll use 600 for our example. The 600 strike with the same expiration is currently trading at about 80. Selling that contract would net you $8,000 in premium and tie up $60,000. Why make that trade? If you believe NVDA is fairly valued but believe it could trade slightly lower at expiration and want to reduce your purchase price. In the event NVDA is trading below 600 at expiration, this contract would be exercised, and you would own NVDA at 520 per share (600 strike less 80 premium received), which is your breakeven price for determining profit or loss. In the event that NVDA trades above the 600 strike price, the contract would expire worthless and you will have generated roughly 13% in premium. In-the-money puts – Selling LEAPS in the money means using a strike price above the current share price, which could be exercised at any time. The 650 strike (again, round numbers tend to equal greater liquidity) put with the January 2025 expiration is currently trading at 106. Why make that trade? If you believe NVDA is currently undervalued and are comfortable buying it up to a net price of 544 (650 strike less 106 premium). That net price is your breakeven if the contract is exercised, which is higher than the other scenarios but still a discount to the current share price. Should NVDA trade higher and close above 650 you will have generated a return of 16%, which is more than you would have made buying the stock at 610 and watching it move to 650. Selling LEAPS puts requires that you be overall bullish on the underlying stock and have a specific fair value in mind. Your worst case for all of these scenarios would be NVDA becoming worthless, which is no different than the worst case for simply buying the stock. But, by selling LEAPS, you’re generating returns that actually reduce your overall position risk because of the premium received. Have you used selling LEAPS to enter into a new stock position? [author_ad] *This post is periodically updated to reflect market conditions.  Get My Free Report As Seen On    Choose Your Free Reports You have access to our expertly curated collection of free investing reports, including 5 Best Stocks to Buy this Month, How to Find Undervalued Stocks, How Options Work, and more.  Get My Reports Capitalizing on the Bull Market: 4 Experts & Their Top Picks for April 2024    FREE WEBINAR: Tuesday, March 26, 2024 at 12:00 PM ET with seasoned Cabot analysts Mike Cintolo, Tyler Laundon, Tom Hutchinson, and Carl Delfeld          Register Now Copyright © 2024 Cabot Heritage Corporation, All Rights Reserved | Privacy Policy | Terms of Use & Conditions of Sale "
}