{
    "title": "Top Stock Reports for NVIDIA, Boeing & Sony",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/news/top-stock-reports-nvidia-boeing-210800369.html",
    "text": "Friday, January 12, 2024 The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corp. (NVDA), The Boeing Co. (BA) and Sony Group Corp. (SONY). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>NVIDIA’s shares have outperformed the Zacks Semiconductor - General industry over the past six months (+19.3% vs. +16.9%). The company’s computer & networking revenues are gaining from the strong growth of artificial intelligence (AI), high-performance computing and accelerated computing.The data center end-market business is likely to benefit from the growing demand for generative AI and large language models using graphic processing units (GPUs) based on NVIDIA Hopper and Ampere architectures. A surge in hyperscale demand and a solid uptake of AI-based smart cockpit infotainment solutions are acting as tailwinds.Collaborations with Mercedes-Benz and Audi are likely to advance its presence in autonomous vehicles and other automotive electronics space. However, its near-term prospects are likely to be hurt by softening IT spending amid macroeconomic headwinds.(You can read the full research report on NVIDIA here >>>)Shares of Boeing have outperformed the Zacks Aerospace - Defense industry over the past year (+4% vs. -6.8%). The company remains the largest aircraft manufacturer in the United States in terms of revenues, orders and deliveries. During the third quarter, the jet giant booked 398 net commercial airplane orders.A strengthening U.S. defense budget should also boost Boeing’s Defense, Space & Security segment growth. Boeing has ample liquidity to meet its debt obligations in the near term.However, Boeing expects supply-chain disruptions to continue to harm its operational results, at least in the near term. Its dispute with Embraer over termination of the earlier joint venture might cause it to incur some loss in the future. Rising jet fuel price also poses a threat to the stock’s future growth.(You can read the full research report on Boeing here >>>)Sony’s shares have outperformed the Zacks Audio Video Production industry over the past year (+13.7% vs. +12.7%). The company’s performance is benefiting from continued strength in the Games & Network (G&NS) segment. The company continues to expect to sell more than 25 million units of its PlayStation 5 in the current year.SONY sold 4.9 million units of PS5 in Q2, up 25% year over year. Strength in Music, and Pictures segments are other tailwinds. The Music segment benefits from higher recorded music and music publishing sales from paid subscription streaming services. Frequent product launches and strategic collaborations bode well.The company also raised overall guidance for fiscal 2023 revenues It now expects sales of ¥12,400 billion compared with the earlier guidance of ¥12,200 billion. However, SONY lowered guidance for Pictures and Financial Services segments. Stiff competition and weak global macroeconomic conditions are concerning.(You can read the full research report on Sony here >>>)Other noteworthy reports we are featuring today include The Charles Schwab Corp. (SCHW), The Cigna Group (CI) and Synopsys, Inc. (SNPS).Mark VickerySenior Editor Note: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>> Today's Must Read NVIDIA (NVDA) Rides on Strong Adoption of GPUs, Partnerships Amid 787 Program Issue, Rising Demand Aids Boeing (BA) SONY Benefits From Improving Music & G&NS Segment Sales Featured Reports Higher Rates, Buyouts Aid Schwab (SCHW), Rising Costs A WoePer the Zacks analyst, higher interest rates, strategic acquisitions and offering advisory solution products are likely to keep aiding Schwab. Yet, higher costs and subdued trading revenues are woes. Cigna (CI) Benefits from Growing Membership, High Costs HurtPer the Zacks analyst, Cigna gains from improving membership and solid performances of Evernorth Health Services and Cigna Healthcare businesses. However, rising costs are a concern. Synopsys (SNPS) Banks on Strong Product Menu, Contract WinsPer the Zacks analyst, Synopsys' focus on strengthening its product portfolio is helping it cater to the growing demand in the EDA market. Deal wins at leading semiconductor companies is a tailwind. Workday (WDAY) Rides on Portfolio Strength, Solid DemandPer the Zacks analyst, the growing adoption of Workday's AI native human capital and financial management solutions in the retail and hospitality industry will likely boost the top-line growth. Strategic Acquisitions Aid Centene (CNC), High Costs HurtPer the Zacks analyst, strategic buyouts are expanding Centene's markets and membership. However, elevated expenses remain a concern. MAP 2025 Plans Aid RPM International (RPM), High Costs AilPer the Zacks analyst, RPM International is aiding from efficient execution of MAP 2025 initiatives and solid demand for infrastructure and reshoring projects. Yet, high costs are hurting prospects. United Therapeutics (UTHR) Dependence on PAH Drugs A ConcernUnited Therapeutics is a leader in treating pulmonary arterial hypertension (PAH) and markets four drugs. However, the company's overdependence on PAH concerns the Zacks Analyst. New Upgrades Booz Allen (BAH) Benefits From Differentiated Business ModelsPer the Zacks analyst, Booz Allen Hamilton has developed its solutions business in a way that allows it to create differentiated business models and sales channels, and increase client acquisition. Strategic Acquisitions & Organic Growth Aids Fraklin (BEN)Per the Zacks analyst, Franklin's strategic acquisitions, solid AUM balance and a strong distribution platform will likely support its top line. Decent liquidity aids sustainable capital distributions Business Growth via Acquisitions Continue to Aid DaVita (DVA)The Zacks analyst is upbeat about DaVita's business strategy, which includes growth via acquisitions of dialysis centers and other businesses. A patient-centric care model also raises optimism. New Downgrades Huge Debt Load, Rising Expenses Likely to Hurt BP's MarginsPer the Zacks analyst, BP's debt-laden balance sheet can lead to volatile earnings, limiting its financial flexibility. The company's rising exploration expenses are also concerning. Weak Market Condition in Europe Ail Commercial Metals (CMC)Per the Zacks Analyst, Commercial Metals' results are impacted by the sluggish demand in Europe. Lower margins on steel products are other woes. Macro Woes, Dull North America Results Ail Envista (NVST)The Zacks analyst is worried about Envista facing a weaker demand for its larger imaging equipments due to the ongoing macro issues. Disappointing North American implant business is also a concern. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report The Boeing Company (BA) : Free Stock Analysis Report The Charles Schwab Corporation (SCHW) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Cigna Group (CI) : Free Stock Analysis Report Synopsys, Inc. (SNPS) : Free Stock Analysis Report Sony Corporation (SONY) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}