{
    "title": "Nvidia Will Lead 2024 Double-Digit Semiconductor Stock Rally, Analysts Say \nNvidia, Western Digital, ASML,",
    "date": "1/23/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36743662/nvidia-will-lead-2024-double-digit-semiconductor-stock-rally-analysts-say",
    "text": "A Cantor Fitzgerald initiating coverage report on the semiconductors and semiconductor equipment industry highlighted their top picks for 2024. On average, Cantor sees 14% upside in 2024 for the 18 stocks it included under its coverage. Their top stock picks, as highlighted in the report, were NVIDIA Corp NVDA, Western Digital Corp WDC, ASML Holding NV ASML, NXP Semiconductors NV NXPI and GlobalFoundries Inc GFS for 2024. Per the report, these stocks are expected to deliver upside ranging from 21% to 36% in 2024. Other semiconductor companies with at least 15% projected upside include Micron Technology Inc MU, Advanced Micro Devices Inc AMD and Marvell Technology Inc MRVL. While most semiconductor stocks appear to have good times ahead for them, three names fell in the Neutral rating category – Qualcomm Inc QCOM, Teradyne Inc TER and Intel Corp INTC. Cantor expects these to be relative underperformers. Also Read: Nvidia, AMD To Triumph Over Q4 Market Weakness With Cutting-Edge AI, Says Analyst: What To Expect From The Chipmakers The semiconductor industry is experiencing a cyclical recovery, with the PHLX Semiconductor Sector Index SOX, hitting its bottom in October 2022 and rising 95% since then. The trajectory was seen replicated by the iShares Semiconductor ETF SOXX. Nevertheless, the industry’s core fundamentals hit their lowest point in the second quarter of 2023, signaling the start of a major upward shift. Notably, this recovery differs from previous cycles, with unique factors such as varying lead times, inventory builds, and supply/demand dynamics contributing to increased volatility across different end markets. The current cycle sees AI, PC/Smartphones, Data Center/Networking as potential gainers from here, while Industrials and Auto may just see a downcycle phase, the analysts note. Cantor analyst C.J. Muse predicts an 18% growth in semiconductor revenues for 2024, noting that certain risks could drive this figure above 20%. Key areas of interest could include AI (both Compute & Networking) and Memory (both DRAM and NAND), with selectivity in System-on-Chip (SPE) companies acting as “arms dealers” to these trends. The market anticipates another strong year for semiconductor stocks in 2024, with investors eyeing exit strategies in late 2024 or early 2025. Now Read: Nvidia, AMD Shares Offer Over 30% Upside Potential, Analyst Says Ahead Of Earnings: What’s Driving The Chip Optimism? Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}