{
    "title": null,
    "date": "1/29/2024",
    "url": "https://www.techcircle.in/2024/01/29/nvidia-seems-set-to-cross-500-mn-revenue-mark-in-india-this-year/",
    "text": "Nvidia has been one of the hottest stocks in the tech world thanks to the rise of generative artificial intelligence (Gen AI) as a field and the world going gaga over potential having seen the success and multiple use cases of ChatGPT. Jensen Huang-led chipmaker Nvidia has been on a tear through much of 2023 and in the first four weeks of 2024 has scaled new heights. \r\n \r\nNvidia with a market cap of over $1.5 trillion is now the fifth most valued tech company in the world as investors see it as a proxy to bet on the Gen AI bandwagon. The chipmaker that had reported flat revenue at around $27 billion for the year ended January 2023 is on course for around 50-60% jump in the current year. This would be in sync with its performance in the recent past where it grew its business sharply in 2021 before seeing this flat-lined, a repeat of 2019 when it actually saw revenues dip. \r\n \r\nThe company’s Indian operations, however, has been on a more secular growth track. Nvidia’s Indian operations has more than tripled its revenues since FY18 and is likely to cross the $500 million mark in the current fiscal. Also read: Nvidia expands into custom chip design for AI and beyond: Report\r\n \r\nThe company declined to comment on this article as it doesn’t share country specific data, but information pieced by TechCircle from VCCEdge, a data research platform, shows how Nvidia has grown in tandem with the global parent and indeed has marginally surpassed it in terms of growth in the last 3-4 financial years. \r\n \n\r\n \r\nNvidia India business is led by Vishal Dhupar, who has been serving as its managing director in South Asia since 2010. That said, Nvidia's association with India dates back almost two decades when it first set up its operations in Bangalore. \r\n \r\nThe company currently, operates four engineering centres in India, located in Gurugram, Hyderabad, Pune, and Bengaluru. These centres employ a total of 4,000 engineers, making it the company's second-largest talent pool after the United States. Additionally, Nvidia's developer program in India boasts more than 320,000 developers, and the company estimates that there are approximately 60,000 experienced CUDA (Compute Unified Device Architecture) developers in the country. The popularity of Nvidia's CUDA parallel programming platform is evident from its monthly downloads of around 40,000 times in India. \r\n \r\nIndia also boasts of the second-largest talent pool globally in the fields of AI, machine learning (ML), and big data analytics, second only to China.\r\n \r\nDuring a news conference in Bengaluru on 8 September 2023, Jensen Huang, Nvidia's CEO, acknowledged India's potential, stating, “You have the data, you have the talent.” \r\nNotably, Huang's visit to India in September last year included meetings with the country's premier, researchers, and tech leaders. He also emphasized during the news conference that India is poised to become one of the largest AI markets in the world. \r\n \r\nFurthermore, Huang engaged with researchers from the Indian Institute of Science and various campuses of the Indian Institute of Technology to discuss the potential of diverse large language models (LLMs), quantum computing, and AI in addressing language barriers, improving agricultural yields, bridging gaps in healthcare services, and transforming digital economies. These discussions aimed to tackle some of the significant scientific challenges of our time. \r\n \r\nIn recent months, Huang also made significant announcements, including partnerships with major Indian companies such as Tata, Reliance and Infosys. Under these partnerships, Nvidia will deliver AI computing infrastructure and platforms to these companies for developing AI solutions, which ranges from creating LLMs in local Indian languages to building GPU cloud infrastructures and upskilling/reskilling over 300,000 employees on a large scale for the AI revolution that’s on the horizon. \r\n \r\nFor example, Nvidia and Reliance Industries are collaborating to create India's foundational LLM for generative AI applications, using diverse languages. It aims to surpass India's fastest supercomputer with Nvidia's GH200 Grace Hopper Superchip and DGX Cloud. Reliance Jio Infocomm will develop AI applications for its 450 million users, while providing energy-efficient AI resources for scientists and startups. The project will also include 2,000 MW data centres. Meanwhile, Infosys collaborated with Nvidia, leveraging its infrastructure and expertise to develop AI models and applications. \r\n \r\nHuang further believes that Nvidia’s growth trajectory is a testament to its strategic positioning in the AI chip market. Huang said at the company’s Q42023 earning call: “We are set to help customers take advantage of breakthroughs in generative AI and LLMs. Our new AI supercomputer, with H100 and its Transformer Engine and Quantum-2 networking fabric, is in full production”. \r\n \r\nNvidia’s high-pitched growth in the country last year is in sync with peers in the semiconductor business with Intel and AMD recording 25% and 54% growth, respectively in FY2023. "
}