{
    "title": "Nvidia kicks off 2024 by extending its eye-popping rally, with the \nchipmaker's valuation up $130 billion already",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/nvidia-kicks-off-2024-extending-210039129.html",
    "text": "Nvidia's stock price is up 10% this year, extending its rally from 2023. Its total market capitalization has risen by $128 billion so far in 2024, according to data from Refinitiv. The AI investing craze has fueled the chipmaker's stellar growth. Nvidia's 2024 is off to a stellar start. Shares in the trillion-dollar chipmaker have jumped 10% over the first nine trading days of the year, extending the AI-fueled rally that lifted its stock price 240% in 2023. That surge has boosted the Santa Clara, CA-based powerhouse's total market capitalization by $128 billion to nearly $1.4 trillion, according to data from Refinitiv, making it the US's fifth most-valuable company – behind only Microsoft, Apple, Google owner Alphabet, and Amazon. Nvidia has beaten both its Big Tech rivals and the benchmark S&P 500 over the early days of the year – and thanks to the AI investing craze, analysts don't expect its strong recent run to end anytime soon. This is Nvidia's strongest-ever start to a year, in terms of market capitalization added – and once again, it's comfortably outperforming the other \"Magnificent Seven\" mega-cap stocks. It's been a mixed start to 2024 for the rest of the blue-chip group. Microsoft and Facebook parent Meta Platforms have eked out early gains – but Apple shares have tumbled 3% with investors zeroing in on slowing iPhone sales, and Tesla has suffered a 12% wipeout.  Meanwhile, the benchmark S&P 500 and the tech-heavy Nasdaq 100 are trading flat so far in 2024 – with both indices stalling after racking up gains of 24% and 54% respectively last year. There'll be no prizes handed out for guessing what's driven Nvidia's early-year surge. For many traders, the semiconductor stock has become synonymous with the AI investing craze – with its dominance of the market for graphics processing units giving its earnings a massive boost and helping it hit a 12-figure valuation for the first time last year. At the CES trade show in Las Vegas last week, Nvidia unveiled three new desktop graphics chips that it believes will be capable of powering AI personal computers, signaling another potential route to AI monetization and sparking a three-day surge where its shares climbed 11%. \"Nvidia moving beyond with data centers into the AI PC space is just proof of how big of a theme AI is,\" Kathleen Brooks, research director for the online brokerage firm XTB, told Business Insider. \"That's where the money really starts rolling in.\" \"You've only got to look at Microsoft and Apple – monetizing PCs can send companies stratospheric,\" she added. Wall Street is also backing Nvidia shares to carry on surging this year. Analysts' consensus forecast is that the mega-cap stock will trade at $662 in 12 months' time, per data from TipRanks – implying a 21% jump from the level it traded at as of Friday's closing bell. Even though those sorts of gains wouldn't match last year's eye-popping returns, they'd still add hundreds of billions of dollars to Nvidia's market capitalization – and underline its status as the poster boy for the AI investing craze. Read the original article on Business Insider "
}