{
    "title": "Super Micro Computer Is the Best-Returning AI Stock Over the Past Year",
    "date": "1/30/2024",
    "url": "https://markets.businessinsider.com/news/stocks/super-micro-computer-stock-outperforms-nvidia-artificial-intelligence-ai-stocks-2024-1",
    "text": "       Super Micro Computer is officially one of the hottest artificial intelligence stocks on Wall Street. Over the past year, shares of California-based Super Micro Computer have soared by 585%, more than double Nvidia's stock price performance of 210% over the same period. Year-to-date, Super Micro Computer is up 81%, more than triple Nvidia's gain of 27% over the same time period. The surge in Super Micro Computer's stock has catapulted its market valuation from just under $5 billion at the start of 2023 to $27.5 billion today. Over the same time period, Nvidia has gained more than $1 trillion in market valuation, to put the size of both companies in perspective. Super Micro Computer sells high-performance servers that are AI-enabled to data centers and enterprises, and its business has taken off over the past year as generative AI technologies like ChatGPT and Midjourney went mainstream. On Monday, Super Micro Computer announced second-quarter earnings results that blew away Wall Street. Super Micro Computer said its second-quarter revenue doubled year-over-year to $3.7 billion, and it raised its full-year revenue guidance to at least $14.3 billion, well ahead of analyst estimates for $11.5 billion in revenue. \"While we continue to win new partners, our current end customers continue to demand more of Supermicro's optimized AI computer platforms and rack-scale Total IT Solutions,\" Super Micro Computer CEO Charles Liang said in the company's earnings release. The results surprised Wall Street, spurring Wedbush analyst Matt Bryson to more than double his price target on the stock to $530 from $250. Meanwhile, Susquehanna analyst Mehdi Hosseini said in a note that Super Micro Computer's results suggest that AI is \"still in the early innings of adoption.\" Bryson said that the recent results from Super Micro Computer ultimately bode well for Nvidia. \"SMCI's outlook and commentary suggest: that NVDA sales remained strong through CQ4; and that NVDA should again provide robust guidance,\" Bryson said. Read next Indices Commodities Currencies Stocks Jump to "
}