{
    "title": null,
    "date": "1/14/2024",
    "url": "https://www.fool.com/investing/2024/01/14/forget-ai-nvidia-big-catalyst-nintendo-switch/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia's (NVDA 3.12%) stock quadrupled over the past three years as the rapid expansion of the artificial intelligence (AI) market lit a fire under its data center business. Its high-end GPUs are used to process complex AI tasks, and most of the world's leading AI companies -- including ChatGPT's creator OpenAI -- currently use its chips. But as the AI hype winds down, many investors are likely wondering if Nvidia can maintain its momentum. The AI market should continue to expand, but investors shouldn't ignore another potential catalyst for Nvidia's stock in 2024: Nintendo's (NTDOY) rumored launch of its next Switch console. Image source: Getty Images. Nintendo has sold 132.5 million Switch consoles (including the original, Lite, and OLED versions) since its launch in 2017, making it the best-selling gaming console in the world. By comparison, Sony has sold an estimated 117.2 million PS4s since 2013 and 15.8 million PS5 since 2020, while Microsoft has sold 58 million Xbox Ones since 2013 and 25.4 million Xbox Series S and X consoles since 2020. The Nintendo Switch is less powerful than Sony and Microsoft's consoles, but it gained a loyal following with its hybrid form factor (it can be used both as a handheld and a docked system) and its large library of exclusive first-party games. The Nintendo Switch runs on Nvidia's Tegra X1 system on a chip (SoC), which the chipmaker previously installed in its own Shield tablet and Android TV devices. The Arm-based Tegra isn't a graphical powerhouse like the custom Advanced Micro Devices APUs that power Sony and Microsoft's latest consoles, but it gives the Switch the mobility and power efficiency of a high-end smartphone or gaming tablet. Nvidia reported its Tegra chip sales separately until fiscal 2020 (which ended in January 2020). During that year, it generated $1.45 billion in revenue, or 13% of its top line, from its Tegra chips (which include its gaming SoCs, automotive chips, and embedded AI chips) -- but that represented a 6% drop from fiscal 2019. It mainly attributed that decline to its slower sales of gaming SoCs, which partly offset its rising sales of automotive chips. Starting in fiscal 2021, Nvidia stopped disclosing its Tegra sales and bundled them into its newly created \"graphics\" segment -- which also houses its GeForce gaming GPUs, Quadro workstation GPUs, automotive chips, and cloud-based services. That reorganization preceded Nintendo's declining shipments of Switch consoles -- which declined 20% in fiscal 2022 (ended in March 2022) and dropped another 22% in fiscal 2023. Nintendo's Switch sales declined for three reasons. First, it faced tough comparisons to the pandemic in 2020, which brought new players to the console with hit games like Animal Crossing: New Horizons. Second, the Switch had largely saturated its core market and was showing its age. That's why its OLED upgrade in 2021 disappointed a lot of gamers and investors who had expected a brand new console. Lastly, the persistent supply chain constraints exacerbated all that pressure. However, a series of recent rumors suggested Nintendo would finally launch its long-awaited \"Switch 2\" this year. Most of these reports claim the console will be powered by a next-gen Nvidia Tegra SoC, which adds support for 4K gaming along with the DLSS (deep learning super sampling) features that are currently exclusive to its top-tier RTX gaming GPUs for PCs. We should take those rumors with a grain of salt, but there's likely a lot of pent-up demand for a new Nintendo console. Therefore, the arrival of the Switch 2 could significantly boost Nvidia's Tegra sales this year and coincide with the broader recovery of the PC market -- which is finally stabilizing after a slowdown in 2022 and 2023. If that happens, Nvidia's gaming sales, which accounted for 16% of its top line in its latest quarter, could rise and offset a potential slowdown in its data center sales, which brought in 80% of its revenue but still relies heavily on the expansion of the red-hot AI market. Nvidia has never publicly disclosed the price tag of its Tegra chips for Nintendo, but the general consensus is around $30 per device for the initial batch of chips. So assuming the next Tegra chip costs roughly the same and Nintendo sells another 130 million Switch 2 consoles, it could potentially translate to $3 billion to $4 billion in long-term sales for Nvidia. That's all speculation for now, but it's still a meaningful figure for a chipmaker expected to generate $58.9 billion in sales this fiscal year. The Tegra certainly won't generate as much revenue as its data center or gaming GPUs, but I believe the launch of the Switch 2 might just give the bulls a fresh reason to buy Nvidia's high-flying stock this year. Leo Sun has positions in Nintendo. The Motley Fool has positions in and recommends Advanced Micro Devices, Microsoft, and Nvidia. The Motley Fool recommends Nintendo. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}