{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.investors.com/research/nvda-stock-2-other-leaders-to-watch-in-bullish-ibd-screen/",
    "text": "BREAKING: Futures Fall Slightly Finding winning growth stocks to buy can be a challenge, but the Relative Strength Blue Dot stock screen in IBD MarketSmith quickly identifies emerging leaders. It's no surprise that NVDA stock appeared on the list of 70 names, but two others are worth highlighting. The stock screen is part of the MarketSmith reports, and lists all stocks that had a blue dot on their chart at the time of the screening. The dot marks stocks whose relative strength line is at new highs while the stock is near a buy point or while forming a base. That's a bullish combination. (The RS line compares a stock's price performance with that of the S&P 500 on daily and weekly charts.) Nvidia (NVDA) continues to outperform the S&P 500 by a long shot. The Magnificent Seven stock gained over 230% over the past year, while the S&P 500 has gained around 19%. The IBD 50 stock is extended from a flat base with a 505.48 buy point. NVDA stock broke out of the base on Jan. 8 in heavy volume, and climbed to yet another all-time high on Tuesday. The AI-chip maker's fiscal 2024 earnings are expected to grow a whopping 241% in the fiscal year ending this month, and 69% in the next fiscal year, per MarketSmith. Nvidia continues to lead in the specialty chip and AI arena. Outside of NVDA stock, Royal Caribbean (RCL) is extended from the 5% buy zone of a cup base with a 112.95 buy point. Shares climbed from the bottom of the cup after the cruise line operator reported better-than-expected Q3 earnings and sales on Oct. 26, and raised its full-year profit guidance. The stock has pulled back but found support at its 10-week moving average. That sets up a buy zone from about 119 to 130. Royal Caribbean is expected to post full-2023 earnings per share of $6.61 after three years of losses. Its 2024 EPS is expected to soar to $9.16. RCL gained around 93% over the last 52 weeks and far outpaced the S&P 500. Domino's Pizza (DPZ) is in the buy zone reaching to 436.60 from a flat-base buy point of 415.81. The pizza restaurant jumped 3.6% on Tuesday, after a Gordon Haskett analyst upgraded DPZ to a buy rating from hold. Domino's stock has had numerous analysts' price target hikes in the last month or so. The company beat its third-quarter earnings estimates but missed sales expectations on Oct. 12. Quarterly EPS grew 50% as sales dropped 4% vs. a year earlier. Analysts expect 16% EPS growth for 2023 and 9% for 2024, according to MarketSmith. NVDA stock, RCL and DPZ are top stocks to buy and watch. Follow Kimberley Koenig for more stock market news on X/Twitter @IBD_KKoenig. YOU MAY ALSO LIKE: Get Free IBD Newsletters: Market Prep | Tech Report | How To Invest What Is CAN SLIM? If You Want To Find Winning Stocks, Better Know It IBD Live: Learn And Analyze Growth Stocks With The Pros Looking For The Next Big Stock Market Winners? Start With These 3 Steps Want More IBD Insights? Subscribe To Our Investing Podcast 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500 stock Super Micro has more than tripled. Tesla remains the... 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}