{
    "title": null,
    "date": "1/4/2024",
    "url": "https://kr-asia.com/singapore-joins-china-and-the-us-as-a-key-ai-player-boosting-nvidias-global-revenue",
    "text": "Written by KrASIA Connection Published on 4 Jan 2024  9 mins read In a surprising revelation, documents submitted by Nvidia to the US Securities and Exchange Commission (SEC) on November 21, 2023, unveiled that Singapore accounted for around 15% of Nvidia’s revenue in the third quarter of the 2024 fiscal year, translating to about USD 2.7 billion. This positions Singapore as the fourth largest market for Nvidia globally, trailing behind the US and China (including Taiwan and Hong Kong). Notably, this marks the first time that Nvidia has explicitly disclosed Singapore as a separate consumer market in its financial reports. Previously, revenue data for the US, mainland China, and Taiwan were the main highlights, with these three markets typically representing 70–85% of the market share, while others, including Singapore, were grouped under “Others.” Nvidia CEO Jensen Huang’s recent tour of four Asian countries, including Singapore, underscored the city-state’s strategic importance in the Southeast Asian market. During the visit, Huang announced collaborative efforts with Singapore in the local artificial intelligence large model domain and future infrastructure investments, marking his personal return to Singapore after 25 years. Despite its small land area, Singapore has been a prolific consumer of chips. In the latest quarter, Singapore spent USD 600 per capita on Nvidia chips, while the US spent only USD 60 per capita. China spent about USD 3 per capita. What led to Singapore’s sudden rise as Nvidia’s fourth-largest global market? In Q3 2024, Nvidia’s total revenue was USD 18.12 billion, with its top four markets being the US, Taiwan, mainland China, and Singapore, contributing USD 6.3 billion, USD 4.3 billion, USD 4.03 billion, and USD 2.7 billion respectively. Singapore’s demand for Nvidia’s computing power surged in the previous quarter. In the third quarter of the 2022 fiscal year, Singapore contributed only USD 536 million to Nvidia’s revenue, accounting for 9.04%. However, in the third quarter of 2023, Singapore’s contribution rose to 14.91%. During the same period, Nvidia’s overall revenue increased by 200%, and revenue from mainland China increased by 250%, while Singapore’s revenue skyrocketed by 400%, making Singapore Nvidia’s fourth-largest market. Nvidia refrains from directly disclosing customer names. Instead, the company notes in its financial reports that end customers typically purchase from Nvidia’s customers, which include original equipment manufacturers, system builders, system integrators, retailers and distributors, automotive manufacturers, and first-tier automotive suppliers. Anonymized information reflected that, in the third quarter of 2023 year, sales to a customer accounted for 12% of Nvidia’s total revenue. In the first nine months of that year,, sales to another unknown customer accounted for 11% of the company’s total revenue. Both customers serve the computing and networking sector. The computing and networking sector is Nvidia’s largest sector. In Q3 2023, Nvidia’s data center revenue reached USD 14.5 billion, representing a year-on-year increase of 279%. The H100 is currently Nvidia’s most powerful chip on the market (with an even more powerful H200 expected to launch in Q2 2024), and it serves as an indispensable “AI fuel” for data center construction. According to Omdia Research, Meta and Microsoft emerged as the top buyers of H100 chips in the third quarter, purchasing 150,000 chips each, followed by other tech giants such as Google, Amazon, Oracle, Tencent, CoreWeave, Baidu, Alibaba, Lambda Labs, ByteDance, and Tesla. Although it is not possible to directly associate the names of these tech giants with the Singapore market, almost all of the cloud providers in this list operate data centers in Singapore. “What’s a tiny city state doing with all those chips? Building data centers, of course,” said Sang Shin, former executive at Temasek and GIC, on LinkedIn. He previously served as the digital innovation director at Temasek and the head of digital strategy and architecture at GIC. Currently, he is the founder of AI startup Fofty (stylized as “FoFty”). Despite its small land area, Singapore is asserting itself as a major player in the data center domain. According to a report by Cushman and Wakefield, Singapore ranks third globally and first in the Asia Pacific in the data center market. Tied for first place are Northern Virginia and Portland in the US, with Hong Kong securing the fourth spot. With robust infrastructure, excellent international and regional connectivity, low risk of natural disasters, and widespread adoption of digital technology, Singapore has become the data center hub of the Asia Pacific, hosting 60% of the region’s data centers. Multiple major tech companies from the US and China, such as Google, Amazon, Microsoft, Alibaba, Tencent, and ByteDance, have opted to establish data centers in Singapore. According to the Singapore Economic Development Board (EDB), numerous Fortune 500 companies have regional bases in Singapore. However, data centers are energy-intensive. Singapore currently operates more than 70 operational data centers with a total capacity of over 378 megawatts, constituting over 7% of the nation’s total electricity consumption. To fulfill environmental obligations outlined in the 2015 Paris Agreement and address challenges in reducing carbon emissions, Singapore authorities imposed a temporary halt on new data center construction in 2019. The focus shifted toward developing green energy sources like solar and hydrogen and exploring the application of green energy and liquid cooling technologies for sustainable data centers. After a three-year hiatus, Singapore lifted the freeze in January 2022, signaling a renewed focus on data center growth. In July 2022, the Singapore EDB and the Infocomm Media Development Authority (IMDA) announced a pilot program allowing the construction of new data center projects that meet specific requirements. The emergence of ChatGPT at the end of 2022 injected new vitality into Singapore’s recovering data center market. GPU-accelerated computing data centers have become an indispensable engine for developing the generative AI industry. The biggest beneficiary is undoubtedly Nvidia. “We are in the first year of a ten-year period of intelligent data center transformation,” Huang said. In July 2023, Singapore authorities allocated about 80 megawatts of new capacity to four data center operators, marking the first capacity allocation after the easing of the data center ban. The four operators were US data center operator Equinix, Microsoft, China’s data center operator Global Data Solutions (GDS), and a joint venture between Australian data center operator AirTrunk and ByteDance. Singapore aims to continue its role as a leader in the Asia Pacific and global markets amidst the current generative AI wave. Lianhe Zaobao reported in December that, with the current technological boom led by AI advancements, computing power will become an upstream resource in the global economy. If Singapore can seize this opportunity and become a key computing power center both regionally and globally, it will occupy a crucial position in the high-tech industry chain. In addition to data center construction, Singapore is actively investing in AI. Heng Swee Keat, deputy prime minister of Singapore, announced the updated National AI Strategy 2.0 (NAIS 2.0) on December 4, 2023. Over the next three to five years, Singapore plans to double its local AI workforce to over 15,000 individuals and establish an iconic site to foster the country’s AI community. Huang’s recent visits to Japan, Singapore, Malaysia, and Vietnam underscore Nvidia’s commitment to deepening AI collaboration. Currently, the company is working with IMDA to develop a large language model known as SEA-LION. Set to be operable in 11 languages, the model will be used to develop AI applications for local researchers, startups, and the AI industry. Nvidia already has a supercomputer in Singapore, though Huang expressed the desire to do more in Singapore, including building an even larger supercomputer and “potentially investing in a significant iconic site for AI.” RELATED ARTICLENewsNvidia Leads the AI Infrastructure Boom as Market Capitalization Hits USD 1 TrillionWritten by KrASIA Writers Written by KrASIA Writers In Singapore, Huang also discussed the demand for AI chips and systems. He said that the first wave of the global internet and cloud service providers initiated the demand, and Nvidia sees the next wave rising rapidly. The core demand comes from countries building sovereign AI infrastructure, followed by industries, companies, and departments building “AI factories.” An evident trend is that the demand for both data centers and AI has driven a large deployment of GPUs in Singapore. As Singapore races ahead, the lingering question is whether it will consume all of Nvidia’s chips? The answer, it turns out, is not a straightforward yes. The development of data centers in Singapore faces stringent carbon emission benchmarks set by local authorities. Proposals for data center construction must invest in hydrogen or solar energy panels, maintain a power usage effectiveness (PUE) value of 1.3 or below, obtain the “Platinum” certification of the Singapore BCA-IMDA Green Mark, and incorporate “cutting-edge technology and sustainable best practices.” Additionally, proposals should strengthen Singapore’s international connectivity, contribute significantly to its role as a regional hub, and align with broader economic goals. These stringent criteria partly explain why the initial capacity allocation for data center construction went only to four companies. According to a Singapore representative from an unnamed Chinese company, the local demand for data center construction in Singapore isn’t as high as one might think due to carbon emission restrictions. Instead, chips procured in Singapore may likely be distributed to other Southeast Asian countries for data center projects. Southeast Asia is currently experiencing a data center construction boom, and the demand is soaring. The pause in Singapore’s IT production capacity has led to unmet market demand, spilling over to neighboring markets like Malaysia’s Johor, which is witnessing a surge in data center projects. Jakarta, the current capital of Indonesia, also boasts large data centers driven by its strategic geographic location in Southeast Asia and rapidly growing population. Notably, China is excluded from Singapore’s redistribution system due to the US export restrictions on chips. The October 17 regulations from the US Department of Commerce’s Bureau of Industry and Security (BIS) escalated sanctions on Chinese semiconductors, affecting China’s ability to purchase high-performance chips from Nvidia. However, Chinese companies with operations abroad, including those in Singapore, are currently unaffected and can purchase chips from Nvidia through regular channels. Nevertheless, the demand from overseas operations pales in comparison to the vast market in mainland China. Nvidia remains reluctant to relinquish its foothold in the Chinese market. Apart from China being Nvidia’s third largest market, contributing 22% of its revenue in the previous quarter, the ban might inadvertently prompt Chinese chip companies to grow rapidly, becoming formidable competitors to Nvidia. Despite facing challenges from Nvidia’s dominance, Chinese AI companies are not disheartened but are gradually producing domestic alternatives. At the Huawei Connect conference in September last year, Huawei unveiled its Ascend AI computing cluster, capable of supporting large model training with over a trillion parameters. Huawei’s strategic partner, iFlytek, claimed that Huawei’s Ascend 910B could compete with Nvidia’s A100. Sources revealed that Huawei’s deployment of the Ascend 910B chip in various centers is underway, promising superior performance compared to the Ascend 910A. This development signals growing competition between Nvidia and Chinese alternatives. During an interview in Singapore, Huang acknowledged that Huawei, Intel, and the growing number of semiconductor startups pose a serious challenge to Nvidia’s dominance in the race to produce the best AI chips in the market. Apart from Huawei, several domestic chip startups are maturing, gradually introducing their AI chips to the market. At the AI Computing Conference (AICC) held in November 2023, a wall showcased numerous types of chips developed by various companies. While there remains a noticeable gap between Chinese chips and Nvidia, the difference extends beyond the products themselves to include the ecosystem. Domestic manufacturers may face challenges adapting their own chips to fit the demands of local algorithms, posing a significant engineering hurdle that might take two to three months to overcome. For AI companies dealing with rapidly evolving large models, this becomes an impractical time cost. However, the unavailability of Nvidia chips could force algorithm companies and domestic chip manufacturers into collaboration, fostering problem-solving, and product iteration, potentially accelerating the ecosystem’s development. If large models are the catalyst that will usher in the next industrial revolution, then the challenges and opportunities for domestic chip and model developers in the absence of Nvidia chips paint a complex landscape in the world of AI and data centers. This article was adapted based on a feature originally written by Zhao Jian and published on Jazzyear (WeChat ID: jazzyear). KrASIA is authorized to translate, adapt, and publish its contents. Auto loading next article... Subscribe to our weekly newsletters  KrASIA A digital media company reporting on the most promising technology-driven trends and businesses in the Asia Pacific. "
}