{
    "title": "NVIDIA Corp Takes a Hit in Louis Moore Bacon's Latest Portfolio Adjustments",
    "date": "2/14/2024",
    "url": "https://finance.yahoo.com/news/nvidia-corp-takes-hit-louis-210113533.html",
    "text": "Louis Moore Bacon (Trades, Portfolio), a renowned American hedge fund manager, has revealed his investment decisions for the fourth quarter of 2023 through the latest 13F filing. Bacon, celebrated as one of the top traders of the 20th century, founded Moore Capital Management in 1989 and has since been known for his bold, global macro-based investment approach. Despite closing his hedge fund to outside investors in 2019, Bacon continues to manage a significant multi-asset alternatives platform, focusing on his personal investment account. Warning! GuruFocus has detected 4 Warning Sign with META. Louis Moore Bacon (Trades, Portfolio)'s portfolio saw the addition of 120 stocks in the recent quarter. Noteworthy new positions include: Invesco S&P 500 Equal Weight ETF (RSP), with 1,563,222 shares, making up 4.49% of the portfolio and valued at $246.68 million. SPDR S&P Regional Banking ETF (KRE), comprising 2,064,974 shares, which is about 1.97% of the portfolio, with a total value of $108.27 million. iShares MSCI Emerging Markets ETF (EEM), with 2,500,000 shares, accounting for 1.83% of the portfolio and a total value of $100.53 million. Bacon also ramped up his stakes in 56 stocks, with significant increases in: Amazon.com Inc (NASDAQ:AMZN), adding 1,564,677 shares, bringing the total to 1,716,499 shares. This represents a 1,030.6% increase in share count, impacting the current portfolio by 4.33%, and valued at $260.80 million. SPDR Biotech ETF (XBI), with an additional 1,740,000 shares, bringing the total to 1,790,000 shares. This marks a 3,480% increase in share count, with a total value of $159.83 million. The fourth quarter also saw Bacon exit 144 holdings, including: Alphabet Inc (NASDAQ:GOOGL), where all 1,892,079 shares were sold, impacting the portfolio by -5.05%. Fisker Inc (NYSE:FSR), with the complete sale of 10,568,185 shares, affecting the portfolio by -1.38%. Reductions were made in 62 stocks, with the most significant being: NVIDIA Corp (NASDAQ:NVDA), reduced by 873,026 shares, a -98.81% decrease, impacting the portfolio by -7.75%. The stock traded at an average price of $463.42 during the quarter and has seen a return of 47.29% over the past three months and 47.68% year-to-date. Microsoft Corp (NASDAQ:MSFT), reduced by 196,563 shares, a -56.71% reduction, impacting the portfolio by -1.26%. The stock's average trading price was $355.93 during the quarter, with returns of 10.70% over the past three months and 8.78% year-to-date. As of the fourth quarter of 2023, Louis Moore Bacon (Trades, Portfolio)'s portfolio contained 409 stocks. The top holdings included 6.84% in Meta Platforms Inc (NASDAQ:META), 4.75% in Amazon.com Inc (NASDAQ:AMZN), 4.49% in Invesco S&P 500 Equal Weight ETF (RSP), 2.91% in SPDR Biotech ETF (XBI), and 2.26% in Ally Financial Inc (NYSE:ALLY). The investments are predominantly concentrated across all 11 industries, with significant allocations in Financial Services, Technology, Communication Services, Consumer Cyclical, Industrials, Healthcare, Real Estate, Basic Materials, Energy, Consumer Defensive, and Utilities. This article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein. This article first appeared on GuruFocus. Related Quotes "
}