{
    "title": "Nvidia hits record high as Goldman Sachs boosts PT on AI prospects",
    "date": "2/6/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/nvidia-hits-record-high-goldman-sachs-boosts-pt-ai-prospects",
    "text": "Hello, your email is unverified. Please confirm  for access to all your SPH accounts. Create a free account with Business Times  for seamless access across SPH Media products. Welcome,  Create a free account with Business Times  for seamless access across SPH Media products. Welcome,   \"Nvidia hits record high as Goldman Sachs boosts PT on AI prospects \" Already have an account? Log in The Business Times Personal Edition at$9.90/month*\nSUBSCRIBE NOW\nFind out more about subscription packages here. Find out more about subscription packages here. The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. Subscribe to The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. NVIDIA’S shares scaled a new peak on Monday (Feb 5) after Goldman Sachs raised its price target for the high-flying chipmaker’s stock in anticipation of a major boost to its earnings from the artificial intelligence (AI) boom. The stock rose about 4 per cent to US$689.21 and looked set to add about US$70 billion to the company’s market capitalisation. Nvidia was valued at US$1.63 trillion as of Friday’s close. Nvidia has emerged as a poster child of the AI frenzy and saw a record monthly jump in its market value in January. The searing growth in the stock price – already up about 39 per cent so far this year – has made it more expensive to own relative to its peers. Nvidia’s shares trade at 31.4 times the company’s forward earnings estimate, compared with the industry average of 22.9. Still, Goldman Sachs analyst Toshiya Hari sees more room for growth. “We believe Nvidia will remain as the industry gold standard for the foreseeable future, given its robust hardware and software offerings and, importantly, the pace at which it continues to innovate,” Hari said. The hottest news on all things startup and tech to kickstart your week. Goldman Sachs analysts raised their price target for Nvidia to US$800, the third highest among US analysts covering the stock and indicating a 21 per cent upside from current levels, according to LSEG data. Its previous price target was US$625. The bank also lifted its full-year 2025/2026 earnings estimates for Nvidia by 22 per cent on an average, citing signs of robust AI server demand and improving graphics processing unit (GPU) supply. Hari pointed to signs of AI monetisation from companies including Microsoft and Meta Platforms as well as positive earnings outlook from AI server maker Super Micro Computer. While Nvidia has unlocked billions in revenue on the back of the AI frenzy, other chipmakers that are not so deeply involved in making chips for AI, such as Intel, have seen their shares lag. Nvidia is set to report results on Feb 21, with analysts expecting fourth-quarter earnings per share of US$4.51 and revenue of US$20.19 billion, according to LSEG data. REUTERS BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to t.me/BizTimes Now that you have experienced myBT with just a few keywords, subscribe to BT Premium to get full-access. You have reached your limit of 30 keywords.\nTo follow new keywords, edit your myBT settings. Get the latest coverage and full access to all BT premium content. Browse corporate subscription here  SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}