{
    "title": "Is There A Bubble In AI Stocks?",
    "date": "2/3/2024",
    "url": "https://www.forbes.com/sites/mikeosullivan/2024/02/03/is-there-a-bubble-in-ai-stocks/",
    "text": "UKRAINE - 2021/03/04: In this photo illustration, NVIDIA Corporation stock market information seen ... [+] displayed on a smartphone with the NVIDIA Corporation logo on the background. (Photo Illustration by Igor Golovniov/SOPA Images/LightRocket via Getty Images) I have seen and heard many things that have made me cynical about the investment industry, but nothing pricks my ears when I hear ‘valuation’ deployed as an entreaty for retail investors to buy expensive assets (one of the best I heard is a former colleague who declared that a company was expensive on the basis of a price to earnings ratio (P/E) but cheap on the basis of the earnings yield (E/P)…they are the same thing!). On that basis my credulity was recently stretched when I heard an analyst at Morgan Stanley\nMS\n, the large investment bank, declare that technology stocks are ‘attractively valued’ based on the ‘price to innovation’ ratio. Price to innovation is the ratio of the price of a company to its earnings plus what it spends on research and development – as such it is designed to make companies with scant earnings and large, risky investment budgets, look attractive. As a rule of thumb, when the financial community start to invent new valuation measures, it is time to worry. In the early 2000’s analysts introduced valuation ratios such as ‘price to clicks’ for internet stocks, so as to try to give a veneer of respectability to bubble level valuations. Of course, it all ended badly. The introduction of the idea of a ‘price to innovation’ ratio to the market narrative should spark fears of a stock market bubble, notably in artificial intelligence (AI) driven stocks. Bubbles are hard to define, but to follow a famous legal opinion on pornography, ‘you know it when you see it’. The ingredients of a bubble are usually based on an innovation (railways, the internet) doused with cheap money, and together they produce significant outperformance of a select group of assets that results in historically extreme valuation levels. There is most likely the nucleus of a bubble in a group of mega-sized technology stocks, known increasingly as the Magnificent Seven, chief of which is the chip design firm Nvidia. To use a very simple valuation metric – the ratio of price to revenue, the European equity market trades on a price to revenue multiple of 1.3 times, the American market is 2.5 times (the large tech stocks drive this higher), Microsoft\nMSFT\n trades at a ratio of 13 times revenue and Nvidia at 33 times (for comparison UBS is on a ratio of 1.7 times and Siemens 1.3). There is a similar valuation bubble in private markets where venture investors pay very high multiples for AI focused start-ups. The underlying rationale is that the potential sales growth of these large tech firms is so promising, that they desire a higher valuation multiple. The past week has seen many of them report earnings, and whilst most of these tech firms have delivered healthy earnings, revenue growth is not impressive, suggesting an abundance of optimism regarding the future impact of AI. In that context, if AI is going to be the organizing logic of the next bubble (in the past fifty years we have seen asset bubbles in gold, Japan, Asia, the internet, housing, China…to name the main ones) it will need the boost, or the ‘petit coup de whiskey’ (as New York Fed chair Benjamin Strong put it in 1927…guess what happened next). In general, since the global financial crisis monetary conditions have been very easy, provoking inflation in assets as opposed to consumer inflation. That trend has changed recently as a burst of inflation begot a sharp rise in rates. Despite this, credit markets have been very well behaved (another bubble?). With inflation falling, expectations are growing that central banks might prune interest rates back, which might add further fuel to the AI bubble hypothesis. In the days before quantitative easing there was a decent debate as to whether central banks aided and abetted the creation of asset bubbles. At the time, the orthodoxy was that bubbles were hard to identify and even if they could be identified, it was difficult for central banks to deflate them. The difference today is that few if any central bankers worry about this risk, and instead speak of the ‘wealth effect’ from asset prices. The reasons for them to be more vigilant here are that asset bubbles usually destroy wealth, invariably transfer it from poorer to richer investors (the rich buy early and the poorer investors buy late it goes), they distort investment across economies and when they collapse, their aftermath can be costly (witness Japan’s lost decade(s)). Bubbles do often leave behind useful infrastructure – railways in the late 19th century, and the internet/telecoms infrastructure of the 2000’s, but at a high price. In my view we are not yet in an AI bubble proper. So far, it is located in a small number of companies, who very unusually make up a huge proportion of the stock market. Calculations by BCA Research show that the top ten largest companies in the USA make up 75% of the stock market, something that has occurred only in 2000 and 1929. For the AI bubble to grow and become a mania (Charles Kindleberger’s Manias, Panics and Crashes is still the best analysis of bubbles) companies in sectors that will be impacted positively by AI (such as healthcare and life sciences, financial data centric firms) will need to be captured by the AI narrative and see their share prices rise accordingly. In the same sense, AI mania will need to spill out to countries in Europe, Japan and maybe China. Watch out for other indicators. When taxi drivers start to speak of error correction in quantum computing then we will most surely be in an AI bubble.  "
}