{
    "title": null,
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/news/nvidias-rtx-4090-graphics-card-223712701.html",
    "text": "Nvidia Corp (NASDAQ:NVDA), a leading player in the semiconductor industry, finds itself at the center of a supply crisis exacerbated by heightened demand for its RTX 4090 graphics cards. The shortage of these cards, particularly pronounced in regions like Southeast Asia and Taiwan, underscores the challenges facing consumers and manufacturers alike. This surge in demand comes amidst the backdrop of tightened export controls on advanced chips to China by the U.S. government, further complicating supply chain dynamics, Nikkei Asia reports Also Read: Nvidia’s Key Market China Wants To Beat US Embargo, Boosts Chipmaking Machinery Imports by 14% Consequently, retailers report steep price hikes of up to 60% since the chip’s launch in 2022, as buyers scramble to secure available inventory for resale in lucrative markets like China and Hong Kong. This frenzy surrounding the RTX 4090, coupled with the sustained demand for Nvidia’s H100 chips used in AI training, exacerbates the semiconductor shortage, impacting gaming enthusiasts and industries reliant on advanced computing technology. Last October, purchasing agents emptied shelves in a frenzy at Taiwan’s Guanghua Digital Plaza, particularly for Nvidia’s sought-after RTX 4090 graphics cards. These agents, flush with cash, aimed to exploit a lucrative price gap by reselling the cards in markets restricted by the U.S. The RTX 4090, initially designed for rendering high-quality images in video games and capable of AI model training, found a booming market in Hong Kong and China despite the U.S. sanctions kicking in. Previous reports highlighted how U.S. sanctions led to the emergence of a captive underground market for AI chips in China. Meanwhile, Nvidia has begun accepting pre-orders for its latest AI chip, the H20, explicitly designed for the Chinese market to directly challenge Huawei Technologies Co’s similar offerings in terms of price. Meanwhile, industry experts echo concerns regarding the broader semiconductor industry. Foxconn Chairman Young Liu and Wistron Chairman Simon Lin caution about the uncertainties looming over consumer electronics amid geopolitical tensions and trade disputes. They emphasize the importance of adapting to geopolitical shifts and diversifying supply chains to mitigate risks. Furthermore, Towa’s CEO, Hirokazu Okada, highlights the robust demand for artificial intelligence chips, reflecting the growing reliance on AI technology across various sectors. Acer Chairman Jason Chen’s remarks on expanding manufacturing efforts in India align with the broader trend of tech companies seeking to capitalize on emerging markets and navigate evolving regulatory landscapes. Price Action: NVDA shares traded lower by 0.15% at $699.92 on the last check Thursday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Wikimedia Commons \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? NVIDIA (NVDA): Free Stock Analysis Report This article Nvidia's RTX 4090 Graphics Card Frenzy: Supply Crisis Hits Hard Amid Global Demand Surge and US Sanctions originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}