{
    "title": "Nano-X Imaging stock jumps on Nvidia's strategic investments",
    "date": "2/15/2024",
    "url": "https://invezz.com/news/2024/02/15/nano-x-imaging-stock-jumps-on-nvidias-strategic-investments/",
    "text": "Follow Invezz on Telegram, Twitter, and Google News for instant updates > As the artificial intelligence (AI) industry continues to evolve, Nvidia (NASDAQ: NVDA) has positioned itself as a key player, recording solid performances and climbing the ranks in terms of company size. Following the news of Nvidia’s ownership, NNOX share price surged in pre-market trading, experiencing an increase of more than 80% at one point in the after-hours trading.   Despite a relatively modest holding of 59,632 shares valued at $379,856, Nvidia’s ownership has had a significant impact on NNOX stock. Analysts from TradingView have also expressed bullish sentiment towards NNOX, awarding it a ‘strong buy’ rating with a price target of $18.30, indicating a significant upside potential. With its recent disclosure of investments in its inaugural 13F filing with the SEC, Nvidia’s strategic moves have caught the attention of investors and analysts alike.  Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. Among its investments, Nvidia unveiled a position in Nano-X Imaging Ltd (NASDAQ: NNOX), a company focused on pioneering medical imaging technology and solutions to advance diagnostic medicine. Are you looking for fast-news, hot-tips and market analysis? \n\n  \n    Sign-up for the Invezz newsletter, today. In addition to Nano-X Imaging Ltd, Nvidia disclosed significant holdings in several other noteworthy companies. These include ARM Holdings (NASDAQ: ARM), Recursion Pharmaceuticals (NASDAQ: RXRX), SoundHound AI (NASDAQ: SOUN), and Tusimple Holdings Inc (OTCMKTS: TSPH). The news of Nvidia’s ownership has brought prosperity to these stocks, as they are currently experiencing gains in the market.  Copy expert traders easily with Plus500. Invest in stocks like Tesla & Apple. Instantly trade ETFs like FTSE 100 & S&P 500. Sign-up in minutes. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.  Should you buy Bitcoin before the halving? Should you buy Bitcoin before the halving?  Use Invezz APP Get a better user experience Allow notifications? Allow us to send you updates You must agree to the privacy policy. "
}