{
    "title": "Want to buy Nvidia stock from India? Here are top 5 passive mutual funds \nhaving exposure to Nvidia!",
    "date": "2/25/2024",
    "url": "https://www.dsij.in/dsijarticledetail/want-to-buy-nvidia-stock-from-india-here-are-top-5-passive-mutual-funds-having-exposure-to-nvidia-36741-1",
    "text": "SENSEX SENSEX  In a monumental stride for the tech industry, Nvidia, the California-based chip giant, has ascended to the prestigious club of USD 2 trillion market capitalization last week, marking a watershed moment in its trajectory. With this feat, Nvidia not only solidifies its position as a trailblazer in the chipmaking realm but also etches its name in the annals of financial history alongside titans like Apple and Microsoft, as one of the select few US companies to breach this remarkable threshold. This meteoric rise to glory can be attributed to Nvidia's unwavering dominance in the burgeoning AI chip market, where its cutting-edge technologies continue to redefine the boundaries of possibility. The company's market cap soared from USD 1 trillion less than a year ago to a staggering USD 2 trillion, leaving behemoths like Amazon and Alphabet trailing in its wake. Such exponential growth is a testament to Nvidia's visionary leadership and relentless pursuit of innovation. For investors seeking to partake in the juggernaut that is Nvidia, the options abound. Here's a curated selection of five top passive mutual funds poised to ride the Nvidia wave: Fund Name Nav in Rs Value in (Mn) % of Total Holdings Qty 1-yr highest holding in % 1-yr lowest holding in % Motilal Oswal Nasdaq 100 ETF (MOFN100) 145.66 3256.7 4.59 65.76k 6.94 3.76 Mirae Asset NYSE FANG + ETF- Regular Plan-Growth 82.5 2256.7 12.1 44.15k 12.23 9.64 Motilal Oswal S&P 500 Index Fund - Direct Plan Growth 19.35 1126.2 3.71 22.05k 3.71 1.96 ICICI Prudential Nasdaq 100 Index Fund- Direct Plan - Growth 12.98 480.3 4.59 9.40k 6.94 3.76 Mirae Asset S&P 500 Top 50 ETF - Regular Plan- Growth 38.38 410.8 6.55 8.04k 6.55 3.33                     With Nvidia's trajectory poised for further stratospheric ascents, these passive funds offer investors a gateway to capitalize on the unparalleled growth potential of this AI juggernaut. As the talk of the town and the darling of the stock market, Nvidia beckons investors to seize the opportunity and claim their stake in the future of technology. Disclaimer: The article is for informational purposes only and not investment advice. Mkt Commentary22-Mar, 2024 Swing Trading25-Mar, 2024 Mutual Fund25-Mar, 2024 Dissenting vote raises questions about swap ratio fairness for ICICI shareholders. IPO Analysis24-Mar, 2024 Interviews23-Mar, 2024 MF25-Mar, 2024 General18-Mar, 2024 General18-Mar, 2024 Understanding how established companies raise additional capital to fuel their expansion. Phone Number: (+91)-20-66663802 / 03 Email address: enquiry@dsij.in service@dsij.in To request a call back: Give a Missed Call   020-66663888 Dalal Street Investment Journal Flash News Investment Large Rhino Mid Bridge Vriddhi Growth Tiny Treasure Upstream Pick Value Pick Multibagger Pick Micro Marvel Penny Pick Pop Stock Pop BTST Pop Options Pop Scalper Pop Futures Swing Trading TAS Pop Tactical Options Model Portfolio Portfolio Advisory Service First Step Stock Market Book Derivatives Book Top Gainers Top Losers 52 Week High 52 Week Low Advance/Declines FII/DII Quarterly Results Broker Reports Guru Investors Multi Cap Power Combo Value Growth Ultimate Combo Multiplier High Risk Combo Positional Calls Combo Balanced Risk Combo Service Magazine Online + FNI Combo Small Companies Combo About Us Careers Contact Us Stock Simulation DSIJ Magazine Archive Investor Awareness Programs (IAP) Testimonials DSIJ Apps Advertise With Us Offers Tribute to Founder SEBI Registered Research Analyst Details:\nRegistered Name: DSIJ PRIVATE LIMITED\nType of registration: Non-Individual\nRegistration No.: INH000006396\nValidity: Oct 05, 2018 - Perpetual\nView Registration Certificate SEBI Registered Investment Adviser Details:\nRegistered Name: DSIJ PRIVATE LIMITED\nType of registration: Non-Individual\nRegistration No.: INA000001142\nValidity: Aug 19, 2019 - Perpetual\nView Registration Certificate Registered Address:\n419-A, 4th floor, Arun Chambers,\nTardeo, Next to AC Market, Mumbai - 400 034.\nTel: +91 022-43476012/13/14/15 | Email: service@dsij.in\nCIN No.: U22120MH2003PTC139276\nGST No.: 27AACCR4303G1ZP\nBASL Membership ID: 1346 Principal Officer: Mr. Shashikant Singh,\nEmail: principalofficer@dsij.in\nTel: (+91)-20-66663800 Compliance Officer: Mr. Rajesh Padode\nEmail: complianceofficer@dsij.in\nTel: (+91)-20-66663800 Grievance Officer: Mr. Rajesh Padode\nEmail: service@dsij.in\nTel: (+91)-20-66663800 Corresponding SEBI regional/local office address- SEBI Bhavan BKC, Plot No.C4-A, 'G' Block, Bandra-Kurla Complex, Bandra (East), Mumbai - 400051, Maharashtra.\nTel: +91-22-26449000 / 40459000 | Fax : +91-22-26449019-22 / 40459019-22 | E-mail : sebi@sebi.gov.in | Toll Free Investor Helpline: 1800 22 7575 | SEBI SCORES | SMARTODR Disclaimer: \"Registration granted by SEBI, membership of BASL and certification from NISM in no way guarantee performance of the intermediary or provide any assurance of returns to investors\" Investment in securities market is subject to market risks. Read all the related documents carefully before investing. Any act of copying, reproducing, or distributing the content whether wholly or in part, for any purpose without the permission of DSIJ is strictly prohibited and shall be deemed to be copyright infringement. "
}