{
    "title": "How Soon Will Nvidia Stock Hit $1,000?",
    "date": "2/7/2024",
    "url": "https://www.fool.com/investing/2024/02/07/how-soon-will-nvidia-stock-hit-1000/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 3.12%) has taken off big time in the past year, as shares of the semiconductor bellwether have tripled during this period thanks to the huge demand for its artificial intelligence (AI) chips. Shares of the company are now trading at around $680, which is higher than the stock's median price target of $650 for the next 12 months, as per 53 analysts covering Nvidia. However, it is also worth noting that Nvidia has a Street-high price target of $1,100, which points toward a 61% upside from current levels within the next year. But can Nvidia get close to that mark and hit a stock price of $1,000, which would be a gain of only 47%? And if it can, then how fast? Let's find out. Major technology companies have been lining up to buy Nvidia's graphics processing units (GPUs) to train large language models (LLMs). The company's flagship H100 data center GPU is being scooped up by multiple customers ranging from Meta Platforms to Amazon to Microsoft to Alphabet, creating a shortage of these chips that may take between 36 weeks and 52 weeks to deliver. These tech giants are looking to ramp up their spending on AI hardware, as their latest earnings calls and reports indicate. Meta Platforms, for instance, increased its 2024 capital expenditure forecast by $2 billion to a range of $30 billion to $37 billion. Management pointed out on the latest earnings conference call that the increased investment \"will be driven by investments in servers, including both AI and non-AI hardware.\" Meta's 2023 capital expenditure stood at $28 billion. And, there is a good chance that a nice chunk of the increased capex will be directed toward Nvidia's H100 processors, as per CEO Mark Zuckerberg's recent statement. Similarly, Microsoft management also remarked on the latest earnings call that it expects \"capital expenditures to increase materially on a sequential basis, driven by investments in our cloud and AI infrastructure.\" Meanwhile, Amazon management also remarked that it sees capital expenditure levels increasing in 2024, \"driven by increased infrastructure capex, support growth of our AWS business, including additional investments in generative AI and large language models.\" However, these tech giants aren't the only ones after Nvidia's AI chips. Nvidia CEO Jensen Huang remarked in an interview with Bloomberg Television that many countries, such as Japan, Canada, France, and India, are looking to invest in AI infrastructure. Meanwhile, the company is also looking for ways to supply its chips in China and remain on the right side of the U.S. government's restrictions at the same time. The company is reportedly taking preorders for the H20 AI processor and other chips, which have been specially designed for the Chinese market. In all, there are indications that the demand for Nvidia's AI processors could continue to improve in 2024. Not surprisingly, Nvidia has been looking to significantly improve the supply of its flagship processor in 2024, as a result of which it could generate $50 billion in revenue from the sales of this chip this year. That's why it is not surprising to see analysts anticipating a solid jump in Nvidia's revenue in fiscal 2025 (which has just begun). Analysts are expecting Nvidia's revenue to increase 58% in fiscal 2025 to $93.4 billion. Meanwhile, its earnings are anticipated to jump from $12.30 per share in the previous fiscal year to $20.80 in the current one. The company is expected to sustain its healthy growth in fiscal 2026 as well.  NVDA Revenue Estimates for 2 Fiscal Years Ahead data by YCharts Nvidia is currently trading at 37 times sales and 90 times trailing earnings. However, if we assume that it trades at a discounted 25 times sales at the end of fiscal 2026 thanks to its solid top-line growth and achieves $109 billion in revenue, its market cap could increase to $2.72 trillion. That would be a 67% jump from current levels. So, based on Nvidia's current stock price of around $660 and the potential upside that it could deliver on the back of its impressive growth, its shares could be worth $1,000 apiece in the next couple of years. That's why investors should consider buying this AI stock right now, especially considering the cheap forward multiples it is trading at. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}