{
    "title": null,
    "date": "1/9/2024",
    "url": "https://www.republicworld.com/tech/nvidia-shares-reach-all-time-high-after-ai-component-announcements/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated January 9th, 2024 at 14:44 IST Monday's trading activity underscored this momentum, with transactions exceeding $32 billion, positioning Nvidia as the most actively traded company. Nvidia shares surge: AI Nvidia (NVDA.O), the world's most valuable chipmaker, witnessed its shares reach an all-time high on January 8, following the introduction of new desktop graphics processors designed to harness artificial intelligence capabilities. The company's stock surged by 6.4 per cent, concluding the day at $522.53, marking a historic milestone in its trading history. Nvidia's announcement of the GeForce RTX 40 SUPER Series targeted primarily towards gaming enthusiasts coincided with its broader unveiling of additional components and software centered around artificial intelligence, ahead of the Consumer Electronics Show in Las Vegas. Recognised as a frontrunner in supplying processors for AI computing applications, Nvidia experienced a remarkable stock performance in 2023, with its value more than tripling over the year. Monday's trading activity underscored this momentum, with transactions exceeding $32 billion, positioning Nvidia as the most actively traded company on Wall Street, according to LSEG data. Consequently, Nvidia's market capitalisation now approaches $1.3 trillion, bolstering the PHLX semiconductor index (.SOX) by 3.3 per cent amid the broader market trends. (With Reuters inputs) Published January 9th, 2024 at 14:44 IST Send us your views, we’ll publish them. This section is moderated. Viral: 5-ft Alligator Discovered Inside The Stomach Of An 18-Foot Python A Terrorist is a Terrorist in Any Language: EAM Jaishankar in Singapore RSP Chief Mahadev Jankar Pledges Support to BJP-Led Mahayuti AP Assembly Polls: Pawan Kalyan's Janasena Announces 11 More Candidates BJP Declares Six More Candidates; All Names Out for LS Seats in Gujarat BJP Fields State Chief Surendran Against Rahul Gandhi in Wayanad BJP Fields Sandeshkhali Victim Rekha Patra Against Shahjahan's Aide Delhi Crime: 4-Year-Old Girl Raped, Police Releases Statement BJP Drops Varun Gandhi in 5th List: Know Who Will Contest from Pilibhit Drew Barrymore Admits Feeling 'Shame' Around Her Divorce © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}