{
    "title": null,
    "date": "1/4/2024",
    "url": "https://www.benzinga.com/government/24/01/36485998/whats-going-on-with-nvidia-stock-thursday",
    "text": "Nvidia Corp NVDA stock is trading higher Thursday as it focuses on unlocking value from its key markets, including the U.S., China, and more, with the market expecting the Federal Reserve's inflation-fighting measures to end. The chip designer will likely unveil a series of new graphics cards at the upcoming CES event in Las Vegas, generating buzz with a new social media profile photo hinting at the launches. While details of the new card remain undisclosed, rumors suggest introducing three new models: the GeForce RTX 4070 Super, RTX 4070 Ti Super, and RTX 4080 Super. These releases are in addition to the speculated GeForce RTX 4090 Ti, Forbes reports. The RTX 4070 Ti Super will likely receive a significant memory upgrade to 16GB GDDR6X, aligning it with Advanced Micro Devices, Inc's AMD Radeon RX 7000-series cards, which feature a minimum of 16GB. It needs to be clarified how these new introductions will affect the existing market offerings. However, the RTX 4080 Super and RTX 4070 Ti Super will likely replace the RTX 4080 and RTX 4070 Ti, respectively, while the RTX 4070 and RTX 4070 Super will coexist now. MSI's recent leak seems to confirm these three new GeForce RTX Super cards, with the RTX 4070 Ti Super slated to receive a memory upgrade to 16GB, Forbes said. The expected announcement dates for these new models are January 8 for the RTX 4070 Super, January 17 for the RTX 4070 Super, January 24 for the RTX 4070 Ti Super, and January 31 for the RTX 4080 Super. Alongside Nvidia, Intel Corp INTC and AMD will likely make significant announcements at CES, capturing the interest of PC and laptop gamers and enthusiasts. Nvidia is also preparing for the mass production of its AI chips, including the H20 model, targeting the Chinese market in the second quarter of 2024. Nvidia selected Taiwanese electronics company Wistron as the primary supplier for the graphics processing unit (GPU) substrates needed for these chips, TechNode reports. This move is significant in the context of the U.S. government's ban on exporting high-performance AI chips. Despite these restrictions, Nvidia has tailored its latest AI chips based on Nvidia's H100 model. Nvidia commands a 90% share in China's AI chip market, valued at $7 billion. Nvidia will likely play a pivotal role in advancing India's AI capabilities, as the Hiranandani Group's Yotta Data Services aims to build India's largest supercomputer, Shakti Cloud. This endeavor could place Shakti Cloud among the world's top ten supercomputers. To achieve this, Yotta is procuring 16,000 Nvidia H100 Tensor GPUs, a significant move given Nvidia's dominant market share and the current global shortage of these GPUs, Business Today reports. This breakthrough came after a meeting between Indian Prime Minister Narendra Modi and Nvidia's CEO Jensen Huang. They discussed bridging India's AI gap and supporting local providers with technology and expertise. Yotta's initial plan involves installing the Nvidia GPUs in its Mumbai data center, followed by Greater Noida and Gift City expansions. The project requires advanced data center engineering, including liquid and immersion cooling systems, to handle the GPUs' power needs. Yotta will start with 4,096 GPUs in February 2024, which will increase to 16,384 by June 2024 and potentially 32,768 by the end of 2025. Price Actions: NVDA shares traded higher by 0.99% at $480.40 on the last check Thursday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}