{
    "title": "Dow Jones Slides 225 Points On Hot Inflation Report; Nvidia Reverses From \nRecord Highs",
    "date": "1/11/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-cpi-inflation-report-nvidia-stock-set-to-hit-record-high/",
    "text": "BREAKING: Futures Fall Slightly The Dow Jones Industrial Average dropped 225 points Thursday, as Wall Street digested a hotter-than-expected inflation report from the Labor Department. Among individual stocks, Nvidia stock reversed lower after hitting another record high, while crypto stock Coinbase (COIN) briefly jumped on SEC approval for bitcoin ETFs. After the opening bell, the Dow Jones Industrial Average fell 0.6%, while the S&P 500 lost 0.55%. The tech-heavy Nasdaq composite moved down 0.6% in morning action. Among U.S. exchange traded funds, the Nasdaq 100 tracker Invesco QQQ Trust (QQQ) was down 0.6%, while the SPDR S&P 500 ETF (SPY) fell 0.55%. The 10-year Treasury yield ticked higher to 4.04% Thursday after the Consumer Price Index inflation report. On Wednesday, the Treasury yield closed at 4.03%, holding above 4% for the fourth straight session. Also, oil prices recovered from Wednesday's losses, as West Texas Intermediate futures moved up 1.9% Thursday morning. WTI futures traded near $72.70 a barrel. Nvidia (NVDA) turned down 0.4% Thursday morning, after hitting another record high. The Magnificent Seven stock is extended past a flat base's 505.48 buy point. Nvidia is also an IBD Leaderboard stock. Finally, Coinbase gave up a big gain to move down 2.2% after the Securities and Exchange Commission approved a slew of spot bitcoin exchange traded funds following months of anticipation. The news comes just hours after the Chicago Board Options Exchange approved all six of its bitcoin ETF applications and announced trading will start Thursday. The Bureau of Labor Statistics' CPI inflation report showed consumer prices rising 0.3% for December, with an annual increase of 3.4%. Wall Street expected a 0.2% monthly increase, with a 3.2% annual rise. Core prices in December rose 0.3%, with a 3.9% annual increase, both hotter than estimates. Also from the Labor Department, initial unemployment claims held steady at 202,000 vs. 202,000 in the previous week. They were expected to rise to 209,000. Ahead of Friday's earnings kickoff, KB Home (KBH) was an earnings mover Thursday morning. KBH stock tumbled 2% in morning action. Shares finished Wednesday squarely above a 54.84 cup-with-handle-entry. Stock Market Forecast 2024: A Soft Landing May Not Bring The Gains You Expect On Wednesday, the Dow Jones Industrial Average moved up 0.5%, and the S&P 500 rallied 0.6%. The tech-heavy Nasdaq composite climbed nearly 0.8%. Wednesday's Big Picture column commented, \"Perhaps it's no surprise that the Nasdaq composite is leading the way with its 0.8% advance to 14,969. At one point, the tech-enriched index floated up to a session high of 14,998, just a few points below 15,000, a psychological level.\" Now is an important time to read IBD's The Big Picture column amid the continuing stock market rally. Be sure to read how to adjust to changing market conditions, with IBD's new exposure levels. Learn How To Time The Stock Market With IBD's ETF Market Strategy Magnificent Seven players Alphabet (GOOGL) and Amazon (AMZN), along with Netflix (NFLX) and Novo Nordisk (NVO) — plus Dow Jones components Amgen (AMGN), Caterpillar (CAT) and Merck (MRK) — are among the best stocks to buy and watch in the current market rally. Amgen and Novo Nordisk featured in this Stocks Near A Buy Zone column. Get Real-time Buy And Sell Alerts On Stock Market Leaders With IBD Leaderboard Biotech leader Amgen slipped 0.9% Wednesday, holding out of the 5% buy range past a 288.46 official buy point in a flat base. The 5% buy area went up to 302.88. AMGN stock dropped 1.4% early Thursday. Heavy machinery giant Caterpillar ended Wednesday just below its 293.88 buy trigger, amid a 0.4% gain. CAT stock was down 1% Thursday morning. Drug maker Merck is trying to break out past a cup base's 119.65 buy point, amid a 10-day win streak, according to IBD MarketSmith pattern recognition. MRK stock dropped 0.5% Thursday. 4 Top Growth Stocks To Watch In The Stock Market Rally Alphabet rallied 0.9% Wednesday, hitting a new high and moving further above a 139.42 buy point in a cup with handle, according to IBD MarketSmith. GOOGL stock rose 0.3% early Thursday. IBD Leaderboard stock Amazon ended out of buy range beyond a cup base's 145.86 buy point, with a 1.6% rally Wednesday. AMZN stock rose 0.5% Thursday morning. IBD SwingTrader stock Netflix slipped 0.9% Wednesday, closing further below a 482.70 buy point in a cup with handle. NFLX stock gained 2.1% Thursday. Weight-loss drug maker Novo Nordisk ended Wednesday up 1.6%, further above a 105.69 flat-base buy point following a strong breakout on Jan. 4. NVO stock moved down 1.4% early Thursday. IBD's latest newsletter MarketDiem gives you actionable ideas for stocks, options and crypto right in your inbox These are four best stocks to watch in today's stock market, including a Dow Jones leader. Join IBD experts as they analyze leading stocks in the current stock market rally on IBD Live Magnificent Seven stock Tesla (TSLA) skidded 3% Thursday morning. Tesla stock declined another 0.4% Wednesday, closing further below its 50-day line after sharp losses in recent weeks. The EV giant has a big double-bottom pattern with conventional buy point of 278.98. Meanwhile, an early buy trigger is at 265.13. Among Dow Jones stocks in the Magnificent Seven, Apple (AAPL) and Microsoft (MSFT) traded mixed after Thursday's stock market open. Apple rose 0.6% Wednesday, remaining below a 192.93 buy point and the 50-day line. AAPL fell 1.2% Thursday morning. Microsoft stock rallied 1.9% Wednesday, just shy of a flat base's 384.30 buy point. MSFT was Wednesday's IBD Stock Of The Day. And the software giant was up 0.3% Thursday morning, trying to break out past the latest buy point. Be sure to follow Scott Lehtonen on X, formerly known as Twitter, at @IBD_SLehtonen for more on growth stocks and the Dow Jones Industrial Average. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Nvidia, Tesla, Meta Reveal Rules For Santa Claus Rally And Beyond Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/25/2024\nThe dovish Fed and the Nvidia-led AI boom continue to be the big stock market catalysts. Uber and Eli Llly... 3/25/2024\nThe dovish Fed and the Nvidia-led AI boom continue to... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}