{
    "title": "Nvidia Is Still Misunderstood By A Lot Of Investors (NASDAQ:NVDA)",
    "date": "1/8/2024",
    "url": "https://seekingalpha.com/article/4661688-nvidia-is-still-misunderstood-by-a-lot-of-investors",
    "text": "  Justin Sullivan    Nvidia Corporation's (NASDAQ:NVDA) rapid rise in 2023 has led some investors to the mistaken assumption that the company is vastly overvalued. I think if we take into account the quality of the company, its high barriers to entry, as well as its competitive advantages, which will translate into strong earnings growth this year, the notion of overvaluation is wrong. So I want to clear up some misconceptions as I see them and argue that Nvidia is attractively valued from a long-term perspective.   There were times in 2022 when Nvidia traded at extremely high multiples, but in hindsight they were justified. Nvidia's high earnings growth rates over the past year have caused the multiple to come down even as the stock has soared. And with a forward P/E in the thirties and a forward EV/EBITDA also in the thirties, Nvidia is definitely not overvalued in terms of growth opportunities and valuation. I feel like a lot of people think that Nvidia is overvalued just because the stock has gone up so much. But that run-up is based on an incredible competitive advantage and strong metrics. If people were to argue that Nvidia is a stock in a cyclical industry and so they think the cycle has peaked and therefore they think earnings are going to go down, I could understand their argument. Although, in my opinion, the end of the cycle is not yet in sight. Companies like Dell (DELL), Lenovo (OTCPK:LNVGY), and Hewlett Packard Enterprise Company (HPE) are still waiting for their H100 shipments, with wait times ranging from 36 to 52 weeks. The demand for Nvidia's product is still greater than what they can deliver in a timely manner. Therefore, I do not believe that Nvidia's earnings will decline significantly over the next few years. In addition, Nvidia's management really knows how to anticipate and position itself for the next trends. They benefited from the blockchain/crypto hype, now the LLM/generative AI hype, and have also positioned themselves to benefit from full self-driving (\"FSD\") cars, fraud detection, and the Metaverse. These are all things that could be big revenue drivers in the future. Nvidia DRIVE and their AI cockpit solutions could be very valuable when there is a breakthrough in the space, and it becomes mass market, and when the Metaverse becomes a thing, who produces the best GPU that will be able to get the most realistic graphics? Nvidia and with some distance Advanced Micro Devices (AMD). And Nvidia is also in the robotics market with NVIDIA Isaac, working with Foxconn (OTCPK:FXCOF). Another incredibly exciting market of the future.  Author  And if we want to see what is currently priced in, we can do a reverse discounted cash flow (\"DCF\") analysis using the following assumptions: Then we obtain the result that the stock's current price implies an EPS growth rate of 19% over the next 10 years. Nvidia's 3Y CAGR: 70.49%, 5Y CAGR: 32.33%, and 10Y CAGR: 44.34% are all well above that. Again, this suggests that the stock is not overvalued, perhaps quite the opposite. Intel's CEO Patrick Gelsinger reportedly said that Nvidia \"got extraordinarily lucky\" and that Intel did not continue the Larrabee project and that Nvidia benefited from that. But again, this is an excellent example of Nvidia seeing trends before most others. A huge competitive advantage. A testament to the quality of Nvidia's management. If we look at the GPU market, Nvidia and AMD are the two behemoths and Intel is relatively far behind. Nvidia is trying to lock customers into its ecosystem, whereas AMD's approach is to make its products available to as many customers as possible. Thanks to innovations like Raytracing, Upscaling DLSS and G-Sync, Nvidia is able to dominate the benchmarks and justify the kind of premium price you have to pay for their products. And Nvidia's CUDA in particular is the biggest competitive advantage right now because Nvidia is way ahead on the software side. But, and we will talk about this in the risk section, that moat is at risk of being attacked. When it comes to maximum performance, the GeForce RTX 4090 is currently unmatched. AMD's Radeon RX 7900XTX is in second place, but relatively far behind. AMD's strengths are more in the price/performance category, as the RX 7800 XT could be the best mid-range GPU, and perhaps another advantage that could be important in the future is that AMD is generally more energy efficient with its offerings. And far behind the two in this market is Intel with the ARC A770. And the RTX 5090, which may see a switch to MCM design, could be 2.5 times faster than the 4090. So the Blackwell generation, expected in late 2024 or early 2025, could therefore cause quite a stir. 5 Blackwell chips combined with GDDR7 memory and TSMC's 3nm chip definitely sounds interesting. But as CEO Jensen Huang said, Nvidia is much more than a GPU company, because Nvidia is more about solving complex problems in less time, and they just never changed the name of the market that Nvidia and the others participate in. There is a lot of talk about how sales in China will drop because of the tensions between China and the United States. But just like AMD did with the RX7900 GRE - Golden Rabbit Edition - with 16 instead of 20 GB of memory, Nvidia will do the same. Releasing a slightly weaker GPU that is still very powerful. For example, the GeForce RTX 4090D will be a GPU designed specifically for the Chinese market. Therefore, it is likely that special versions for China that are slightly less powerful will become the standard. But they will still sell because they are still much more powerful than non-AMD or Nvidia products. This is a quick one for Nvidia, $18.3 billion in cash & ST Investments and only $9.8 billion in debt. So the debt is easily covered, and the balance sheet is rock solid. In addition, they have $14 billion in TTM free cash flow (\"FCF\") versus only $3,293 million in stock-based compensation, or SBC, and, therefore, have an SBC adjusted FCF of approximately $10.7 billion. And as we will see in the next chapter, Nvidia is an expert in the efficient use of capital.   Nvidia's lowest ROIC in the last 5 years was just over 12% and the average is closer to 22%+. And in my calculation, the WACC is about 9% through the cost of debt of 5% and the cost of equity of 9.3%. As a result, Nvidia currently has a 52% -9% = 43% ROIC - WACC spread. An incredibly strong spread for a company that is growing so rapidly, generating positive FCF, and is not overleveraged.   Moreover, Nvidia does not have an SBC problem, as its outstanding shares have actually declined over the past three years. And FCF is likely to be used for more share buybacks in the coming years as management compensation is aligned with shareholder interests.  Proxy Statement NVIDIA  The performance targets are based on non-GAAP operating income and total shareholder return. And in my view, these are two goals that benefit shareholders. Although I would have preferred to see GAAP rather than non-GAAP operating income because I prefer unadjusted numbers as a measure. I mean, the biggest risk is probably that the cycle is coming to an end and that revenues will be significantly lower in 2025. However, the data center industry shows no signs of slowing down. Microsoft (MSFT), Meta Platforms (META) and Amazon (AMZN) all have plans to build new data centers and have ordered H100 chips and will most likely order the new H200 chips when they are released. However, because Nvidia is in a highly profitable industry, more and more competitors will try to get a piece of the market. And historically that leads to lower margins. AMD's Mi300x has already had some success in benchmarks, but will most likely be beaten again by the H200. And right now, it looks like several companies are designing chips specifically for their needs, which could potentially cause Nvidia to lose market share. But Nvidia is also evolving. DGX Cloud, which is essentially AI in a browser, is making it easier for many customers to get started. And at CES2024, Nvidia might talk about the ARM CPUs they might release in 2025. The Nintendo Switch, for example, is also powered by a version of Nvidia's Tegra chip. And of course, new approaches to computing can be a risk. For example, Cyxtera's CTO predicts that quantum computing will be used in data centers by 2024. And Microsoft has its analog iterative machines, which they call the future of computing. But in the near future, the battle against CUDA by AMD, Intel, and others will be important. These companies are trying to break Nvidia's software moat by creating a more open environment. If they succeed in this attempt, Nvidia's position would deteriorate significantly. I strongly believe that Nvidia has several years of phenomenal growth ahead of it because its GPUs are very important to its customers if they want to stay relevant. And if these chips were not so incredibly important, there would be no trade restrictions. That is why I believe that Nvidia and AMD will be larger and more important companies in five years than they are today. Both have a vision and a strong position to capture the trends of the future, although Nvidia is probably better positioned at the moment. And I fully expect them to have some surprises for us that they are developing in their labs right now. Of course, Nvidia may see a bit of a slowdown this year after its meteoric rise, but the company is very, very well positioned for the long term, and the stock should follow the company's continued success. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of META either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}