{
    "title": "Nvidia rides AI wave to ramp up venture investments",
    "date": "1/30/2024",
    "url": "https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/nvidia-rides-ai-wave-to-ramp-up-venture-investments-80161338",
    "text": " Nvidia rides AI wave to ramp up venture investments MediaTalk | Season 2  Ep.5 Big Dance, Big Business: Breaking Down March Madness Banking Essentials Newsletter: 20th March Edition An Energy Company Assesses Datacenter Demand for Renewable Energy Key Takeaways Conquering Risks in the Banking Sector In a time when most corporate venture investors are in retreat, NVIDIA Corp. is on the offensive, using its growing cash pile and stellar stock performance to invest in a wide range of startups and companies. In corporate venturing, the venture arms of larger companies leverage their parent's resources and expertise, while independent venture capital firms draw funds from external investors. Nvidia nearly quadrupled its venture investments in 2023 and participated in 38 rounds of funding. The company has announced three startup investments to date in 2024.  Nvidia's increase in venture investments stands in direct contrast to other tech companies that have historically been among the most active corporate investors. Alphabet Inc.'s venture activity in 2023 halved from the peak it hit in 2021. SoftBank Group Corp. and Tencent Holdings Ltd. made just a tiny fraction of the investments they made in 2021. Other companies such as Meta Platforms Inc. and Twilio Inc. halted their venture investing activity altogether in 2023. As a result of these developments, Nvidia became the fourth-largest corporate venture investor in 2023, behind Microsoft Corp., Softbank and Alphabet.  Nvidia's investment activity was fueled both by the company's revenue growth and the rapid ascent of its stock price. CEO Jensen Huang had bet the company's future on artificial intelligence early, and it paid off in a major way in 2023. As Nvidia's chips became indispensable for AI workloads, demand skyrocketed following OpenAI LLC's release of the popular ChatGPT AI software. Nvidia revenues nearly tripled in just two quarters, its stock gained more than 200%, and the company joined the rarefied club of companies worth over $1 trillion. This success means Nvidia's cash pile has been growing quickly, and avenues to make good use of capital, aside from returning it to shareholders, are few. After regulators effectively scuttled Nvidia's proposed acquisition of Arm Holdings PLC in 2022, big M&A remains out of the question. In a conference call in late November 2023, CFO Collette Kress acknowledged that the M&A environment had changed since Nvidia acquired Mellanox Technologies Ltd. for $6.9 billion in 2019 and that the company was looking for \"smaller companies, teams that are bringing a unique add to our company.\" The lack of large M&A opportunities meant more cash could be directed to venture investing. Its third-quarter results show that Nvidia invested $872 million in cash in \"non-affiliates\" in the first nine months of 2023, up from $83 million during the same period a year earlier. Meanwhile, the value of Nvidia's privately held equities rose from $288 million at the start of 2023 to more than $1 billion that October. The total value of rounds it participated in is more than $5 billion, according to Capital IQ Pro. Nvidia declined to comment for this article. The company is set to report its fourth-quarter 2023 results Feb. 21. In a blog post about its investments, Nvidia spokesperson Liz Archibald said Nvidia is seeking \"strategic partnerships\" that can \"stimulate joint innovation, enhance [the company's] platform and expand the ecosystem.\" Nvidia's venture activity is focused chiefly on emerging technologies, especially artificial intelligence and its applications. It makes direct investments through its corporate development arm, led by Vishal Bhagwati, who previously was CFO at Hewlett Packard Enterprise Co.'s AI and high-performance computing business. Nvidia also invests via its venture arm NVentures LLC, led by former Softbank investment professional Sid Siddeek, and startup incubator Nvidia Inception. In 2023, Nvidia invested in about 11 AI infrastructure providers, including data analytics company Databricks Inc., GPU cloud provider CoreWeave Inc. and large-language model provider Mistral AI SAS. It also invested in generative AI companies like video generator Twelve Labs Inc., chatbot creator Cohere Inc. and robotic process automation startup Adept AI Labs Inc. Nvidia's investments are not limited to the IT space and also include startups that apply AI in healthcare. It invested in eight drug-discovery startups, including Generate Biomedicines Inc. and Genesis Therapeutics Inc., both of which are using AI to discover new drugs.  "
}