{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.fool.com/investing/2024/02/11/1-remarkable-ai-growth-stock-to-buy-hand-over-fist/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More \"You only need a few good stocks in your lifetime. I mean how many times do you need a stock to go up tenfold to make a lot of money? Not a lot.\"-Peter Lynch Investing is hard; losing stocks are easier to find than winning ones. However, as the great Peter Lynch points out, one or two great stocks can carry many other mediocre ones in an individual portfolio. Today, I want to examine a stock that has already made many investors rich -- and remains a solid investment today: Nvidia (NVDA 3.12%). Image source: Getty Images. Let's start with the obvious: Nvidia's stock is on fire. Shares are up 38% year to date, and we're only six weeks into the new year. The reason? Artificial intelligence (AI), of course. As the designer of the world's premier AI chips, graphics processing units (GPUs), Nvidia has seen demand for its products skyrocket over the last two years. Indeed, the demand for AI chips is growing so fast that the International Energy Agency (IEA) estimates that overall energy consumption by data centers may double by 2026. And bear in mind data centers already consume a staggering amount of power. The IEA estimates that in 2022, data centers used roughly 460 terawatt-hours of electricity. That's approximately 1% of global electricity demand, or enough to power 32 million homes for a year. In other words, AI infrastructure is already massive, and it's growing even larger. That's great news for Nvidia, whose cutting-edge AI chips are prized by AI developers for their power, speed, and efficiency. Now, let's talk revenue. Nvidia's sales have been climbing steadily as companies like Meta Platforms have ordered hundreds of thousands of AI chips. Indeed, Nvidia's revenue over the last 12 months has jumped to $45 billion, up from $26 billion a year ago. However, the company's estimated sales figures are where the eye-popping math appears.  NVDA Revenue (TTM) data by YCharts As you can see, sales estimates for Nvidia's next fiscal year continue to climb. The consensus estimate (yellow line above) is roughly $110 billion, more than double the company's revenue over the last 12 months. What's more, the revenue estimates continue to rise. As a result, analysts have been racing to revise their price target for the stock. The highest price target for Nvidia belongs to Rosenblatt Securities' Hans Mosesmann, who, in August 2023, noted the stock could go to $1,100. At the time, that represented 120% upside; today, it's merely 59%. First things first: For investors who already own Nvidia, congratulations! There's no better feeling than holding a big winner in your portfolio. Now, fight the urge to sell. One of The Motley Fool's core investment principles is to let winners run, difficult as it might be to stomach. Granted, Nvidia's stock could turn lower, perhaps much lower. But the reason for letting winners run is that it allows time to smooth out those big peaks and valleys. Over time, that results in substantial returns for those with the patience to wait it out. For those who don't own Nvidia, now may be the time to consider it. Sure, shares have already soared over the last 15 months. But just because a stock is already up big doesn't mean it can't move higher. The AI revolution is in full swing, and the company's sales estimates continue to increase as ever more companies turn to AI to solve problems and deliver efficiencies. To close, let's revisit Lynch's advice that one or two good stocks are enough for a lifetime of investing success. For many investors, Nvidia is already one of those names. For others, it may become one.  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jake Lerch has positions in Nvidia. The Motley Fool has positions in and recommends Meta Platforms and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}