{
    "title": "US STOCKS-Nasdaq nears all-time high; Nvidia beats Amazon's market value",
    "date": "2/12/2024",
    "url": "https://www.devdiscourse.com/article/headlines/2816766-us-stocks-nasdaq-nears-all-time-high-nvidia-beats-amazons-market-value",
    "text": "U.S. stocks climbed on Monday, with the tech-laden Nasdaq inching close to its all-time high as investors geared up for two crucial inflation reports during the week, while Nvidia overtook Amazon in value for the first time in two decades. Nasdaq rose past its highest closing level hit in November 2021, bringing it within a percentage from its all-time intra-day high of 16,212.229. Over the past four months, megacaps with greater exposure to artificial intelligence have spearheaded a bull market on Wall Street, also riding on hopes of imminent rate cuts and an upbeat outlook from businesses. The benchmark S&P 500 crossed the psychological 5,000-point level on Friday and is trading at record high levels along with the blue-chip Dow. Leading the charge, Nvidia crossed above Amazon.com in market capitalization, as the euphoria around AI catapulted the chipmaker to the fourth-most valuable U.S. company. Nvidia was up 2.6%, while Amazon dipped 0.4%. \"A lot of people earlier in the year may have thought we were set for a bit of pullback in the semiconductor sector and it didn't happen, so it's certainly people saying, I don't want to miss the performance like I did last year,\" said Joe Saluzzi, co-manager of trading at Themis Trading. Traders await January's Consumer Price Index (CPI) and Producer Price Index (PPI) this week to determine the timeline for monetary policy easing this year. Other data through the week also include industrial production, retail sales and preliminary University of Michigan consumer sentiment. \"An inflation number that's really hot might get some investors a bit nervous, but other than that the Fed is going to be in the same mode,\" Saluzzi added. With growing data reflecting a robust economy, central bankers have effectively pushed back against traders' bets for early rate cuts. The odds for at least a 25-basis-point rate reduction in May have dropped to 55.8%, from over 95% at the start of 2024, as per the CME FedWatch Tool. Remarks from Federal Reserve officials including Richmond President Thomas Barkin and Minneapolis chief Neel Kashkari, scheduled through the day, will be scrutinized for any hints on the timing for rate cuts. At 11:57 a.m. ET, the Dow Jones Industrial Average was up 202.88 points, or 0.52%, at 38,874.57, the S&P 500 was up 19.56 points, or 0.39%, at 5,046.17, and the Nasdaq Composite was up 74.54 points, or 0.47%, at 16,065.20. The small caps Russell 2000 index also surged 1.8%. Among other movers, Diamondback Energy jumped 10.2%, helping energy to top the 11 S&P 500 sectors with a 1.0% gain, after announcing a $26-billion deal to buy the largest privately held oil and gas producer in the Permian basin, Endeavor Energy Partners. Joby Aviation gained 8.2% as the electric-powered aircraft maker signed an agreement to launch air taxi services in the Emirate by early 2026. Advancing issues outnumbered decliners by a 4.00-to-1 ratio on the NYSE and by a 2.45-to-1 ratio on the Nasdaq. The S&P index recorded 45 new 52-week highs and no new lows, while the Nasdaq recorded 149 new highs and 29 new lows. (This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.) Email: info@devdiscourse.com Phone: +91-720-6444012, +91-7027739813, 14, 15 © Copyright 2024 "
}