{
    "title": "\"Magnificent Seven\" Stock Shake-Up -- 3 Business Stats You Need to See \nRight Now",
    "date": "2/19/2024",
    "url": "https://www.fool.com/investing/2024/02/19/magnificent-7-stock-shake-up-3-business-stats-you/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Some of the fastest-growing, most profitable, and most powerful businesses in history have been born the last few decades. Over the last year, this collection of companies has become known as the \"Magnificent Seven.\" The rise of these top investments is thanks to the relentless advance of information technology, computing power, and the internet -- collectively built atop the practical application of semiconductors. But there's been a big shake-up in the ordering of the Magnificent Seven stocks in recent weeks. Here's what investors need to know. In mid-February 2024, Nvidia (NVDA 3.12%) -- by far the smallest of the Magnificent Seven companies as measured by revenue and total employees -- surpassed Google-parent Alphabet and Amazon in total market capitalization value. Times are changing, and investors are loading up on what is increasingly viewed as the emergent leader in the new artificial intelligence (read: accelerated computing) economy. Company Year Founded Market Cap Trailing-12-Month Revenue ~Total Employees Microsoft 1975 $3.02 trillion $228 billion 221,000 Apple 1976 $2.84 trillion $386 billion 161,000 Nvidia 1993 $1.80 trillion $44.9 billion 26,000 Alphabet 1998 $1.78 trillion $307 billion 183,000 Amazon 1994 $1.76 trillion $575 billion 1.5 million Meta Platforms 2004 $1.23 trillion $135 billion 67,000 Tesla 2003 $639 billion $96.8 billion 140,000 Data source: YCharts and company financial filings, as of Feb. 16, 2024. If you believe in compounding growth, it makes sense Microsoft and Apple are the largest companies by market capitalization. They've been around the longest and have thus had the most time to build their empires. Nvidia hitting the No. 3 spot in market cap is notable, and not just because of its comparatively diminutive size. After Microsoft and Apple, Nvidia is the oldest business of the companies on this list of magnificent long-term investments. But there are some other elements to Nvidia's business worth pointing out. The other six businesses have catapulted to stardom with very consumer-oriented business models: Microsoft and Apple are pioneers of the PC era, and Apple ushered in the mobile device explosion. Google still makes most its money from internet search, while Amazon e-commerce is ubiquitous in North America (although its cloud computing infrastructure unit AWS still pays most of the bills). And Tesla has successfully gotten the ball rolling on the electric vehicle and software-defined car market. Nvidia's explosion onto the scene is thanks to AI infrastructure, a decidedly far more nebulous business to the average person. Of course, Nvidia is a consumer-facing company too, and if you're into PC video games, you've probably been very aware of Nvidia's existence since at least the early 2000s. But video games are the minority revenue generator these days. Nvidia CEO Jensen Huang decided to go all in on developing semiconductors and accelerated computing infrastructure a number of years ago, propelling the data center segment to dizzying heights in the last year. Image source: Nvidia. No matter how you slice it, though, Nvidia's rise to the third-largest Magnificent Seven stock as measured by market cap is astonishing. Paired with the two other stats in the aforementioned chart -- revenue and total employee count -- investors are clearly betting that Nvidia's actual business is going to get a lot bigger over the next few years. Let's emphasize the word betting. Nvidia's foundational work around next-gen computing infrastructure has been going on for years, but it was only somewhat recently recognized by the investor community at large. Many are scrambling for a cut and minimizing the fact that Nvidia has highly cyclical revenue, as do most research and development-driven semiconductor businesses.  Data by YCharts. The point is, Nvidia stock's latest surge shouldn't be expected to continue going up and to the right forever. It's a safe assumption to make that at some unknown point in the future, there will be a cooldown in AI infrastructure spending. When that happens, expect Nvidia stock to notch a significant sell-off, just like it has in the past.  Data by YCharts. As a longtime happy shareholder of Nvidia, it's exciting to see the company's rapid progress. But be wary of all the hype as the company's status as a leader among the Magnificent Seven heats up. In fact, as wonderful as all these businesses are as top investments, they all go through cycles of growth and periods of more lackluster performance (like Tesla, which hasn't been so \"magnificent\" lately). A healthy dose of caution will serve long-term investors well at this juncture. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Nick Rossolillo and his clients have positions in Alphabet, Amazon, Apple, Meta Platforms, Nvidia, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}