{
    "title": "How the Zacks Rank Got it Right on NVIDIA",
    "date": "2/28/2024",
    "url": "https://www.zacks.com/stock/news/2233534/how-the-zacks-rank-got-it-right-on-nvidia",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Shutterstock Tracey Ryniec\nFebruary 28, 2024 MSFT Quick QuoteMSFT NVDA Quick QuoteNVDA SMCI Quick QuoteSMCI GOOGL Quick QuoteGOOGL VRT Quick QuoteVRT Better trading starts here. You follow Market Edge - edit You follow Tracey Ryniec - edit Tracey Ryniec Market Edge   Welcome to Episode #392 of the Zacks Market Edge Podcast. Every week, host and Zacks stock strategist, Tracey Ryniec, will be joined by guests to discuss the hottest investing topics in stocks, bonds, and ETFs and how it impacts your life. This week, Tracey is going solo to discuss how the Zacks Rank stock ranking system got it right on NVIDIA and the other hot AI and datacenter stocks over the last year. The Rank was signaling something was going on in the datacenter and chip industries as the Rank moved to the highest level, the Strong Buy, last year and has mostly stayed at that level. Currently, NVIDIA, Super Micro Computer and Vertiv, all three involved in AI and datacenters, remain Zacks #1 Rank (Strong Buy) stocks after their recent earnings reports. Were you noticing the Rank on these stocks? It was signaling something “good” was going on at these companies. What is the Zacks Rank? The Zacks Rank is Zacks stock ranking system which ranks stocks into 5 categories with Strong Buys being the top category, and Strong Sells the bottom category. However, most stocks will be ranked in the middle, as Holds. Zacks ranks over 4400 stocks. The top ranked stocks are rare. There are currently just 244 Zacks #1 (Strong Buy) stocks. The Zacks Rank is based on analyst earnings estimate revisions and can change daily. It is just a 1 to 3-month recommendation. How to Get a Strong Buy Rank In order to get the #1 Strong Buy rank, the analysts have to be in agreement and raising earnings estimates. When a company reports earnings, beats, and then raises guidance, that’s the perfect conditions for the company to achieve the top rank. After a beat and raise, the analysts usually end up revising their own estimates higher. Many AI and datacenter companies have been beating, and raising, for several quarters. The Zacks Rank has been signaling for months that something “good” was going on. How the Zacks Rank Got it Right on NVIDIA and other Datacenter Stocks 1.      NVIDIA Corp. (NVDA Quick QuoteNVDA  -  Free Report) NVIDIA first became a Zacks Rank #1 (Strong Buy) in the second quarter of 2023, after it reported earnings and beat and raised. NVIDIA actually fell to a #2 (Buy) late in 2023 but it jumped back up to a #1 (Strong Buy) again in 2024 after the recent earnings beat and raise. Shares of NVIDIA are up 73% since May 30, 2023, which is a few days after earnings to the present. NVIDIA analysts are still raising estimates. Fourteen earnings estimates are higher for fiscal 2025 in the last week and none have been cut. Should investors still trust the signal the Zacks Rank is sending about NVIDIA? 2.      Super Micro Computer, Inc. (SMCI Quick QuoteSMCI  -  Free Report) Super Micro Computer was a Zacks Rank #1 (Strong Buy) as early as the fourth quarter of 2021. It also fell to a #2 (Buy) during that period before busting out to #1 (Strong Buy) rank again in the third quarter of 2023, after earnings. Zacks only has 3 analyst estimates on Super Micro Computer for the full year, as it’s not as highly followed on the Street as NVIDIA. But those analysts are still bullish. 2 estimates have been revised higher on Super Micro Computer in the last month for both Fiscal 2024 and Fiscal 2025. Should investors still trust the signal the Zacks Rank is sending about Super Micro Computer? 3.      Vertiv Holdings Co. (VRT Quick QuoteVRT  -  Free Report) Vertiv, like NVIDIA, has been beating and raising every quarter for the last year. Vertiv became a Zacks Rank #1 (Strong Buy) at the same time as NVIDIA, in the second quarter of 2023. It has briefly fallen to a #2 (Buy) stock but has now reclaimed the Strong Buy rank. Analysts are bullish on Vertiv as well. 2 earnings estimates have been revised higher in the last week for both 2024 and 2025. Even though it’s a large cap company, Zacks has just 3 estimates on the company for both years. It is not heavily covered on the Street. Should investors still trust the signal the Zacks Rank is sending about Vertiv? What’s Does the Zacks Rank Signal About Mega Cap AI? 4.      Alphabet Inc. (GOOGL Quick QuoteGOOGL  -  Free Report) Alphabet has not been a Zacks Rank #1 (Strong Buy) since the fourth quarter of 2021. It was briefly a #2 (Buy) in the third quarter of 2023 and the first quarter of 2024. Alphabet is currently a Zacks #3 (Hold), which is where most stocks end up. The analysts are mixed on Alphabet for 2024. 10 estimates were raised for the full year in the last 30 days, but 7 were also cut during that time. Is the stock reflecting the uncertainty in Alphabet’s earnings outlook? 5.      Microsoft Corp. (MSFT Quick QuoteMSFT  -  Free Report) Microsoft hasn’t been a Zacks Rank #1 (Strong Buy) since the first quarter of 2020. It has, however, recently been a Zacks #2 Rank (Buy) stock. It was a Buy stock in the fourth quarter of 2023 and again in the first quarter of 2024. It remains a #2 (Buy) stock. Analysts are bullish on Microsoft for fiscal 2024 and fiscal 2025. 17 earnings estimates are higher for fiscal 2024 and fiscal 2025 in the last 30 days, with no analyst estimate cuts. With all that bullishness, why isn’t Microsoft a #1 (Strong Buy) instead of a #2? What Else do you Need to Know About Using the Zacks Rank? Tune into this week’s podcast to find out. [In full disclosure, Tracey owns shares of VRT, MSFT and GOOGL in her own personal portfolio. SMCI is in Zacks Insider Trader portfolio and VRT is in Zacks Value Investor portfolio.]  Microsoft Corporation (MSFT) - free report >> NVIDIA Corporation (NVDA) - free report >> Super Micro Computer, Inc. (SMCI) - free report >> Alphabet Inc. (GOOGL) - free report >> Vertiv Holdings Co. (VRT) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy   |   No cost, no obligation to buy anything ever. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.18%  per year. These returns cover a period from January 1, 1988 through January 1, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}