{
    "title": "Forbes Daily: Nvidia Now Fourth Most Valuable Public Company In World",
    "date": "2/13/2024",
    "url": "https://www.forbes.com/sites/forbesdaily/2024/02/13/forbes-daily-nvidia-passes-tech-giants-amazon-and-alphabet/",
    "text": "Good morning, Like other artists, Usher wasn’t paid for his Super Bowl halftime show, but data released Monday from Spotify showed the boost he got from his performance that had everyone who grew up in the early 2000s dancing. Overall, there was a 550% increase in streams of Usher’s music following the show, with songs “Caught Up,” “U Don’t Have To Call,” “Love In This Club” (feat. Young Jeezy) and “Bad Girl” gaining more than 1,000% increases in Spotify streams between 6 p.m. and midnight PT on Sunday evening. Halftime shows typically bolster an artist’s sales too, and Usher dropped a new album just two days before taking the stage. Still, he faces competition on the charts from other artists with new music, like Beyoncé, who released two new songs after teasing new music during a Verizon commercial. President Joe Biden and His Majesty King Abdullah II of Jordan deliver remarks following a meeting at the White House on February 12, 2024 in Washington, D.C. (Photo by Ricky Carioti/The Washington Post via Getty Images) President Joe Biden pushed for a hostage release deal and a six-week pause in fighting in the war between Israel and Gaza-based militant group Hamas, as a potential ground offensive in the Gaza Strip city of Rafah draws scrutiny from the Biden administration. The president said the pause in fighting would bring “an immediate and sustained period of calm to Gaza,” adding that “key elements of the deal are on the table,” though there are still “gaps that remain.” MORE: Senators passed a $95 billion bill early Tuesday providing aid to Ukraine and Israel along with humanitarian aid to Gaza, in a bipartisan 70-29 vote despite objections from Republican senators who fought the U.S. sending more aid to Ukraine. Hedge fund billionaire Carl Icahn reported a near 10% stake in JetBlue on Monday and said the airline’s stock was undervalued, according to a filing, rocketing the company’s stock up as high as 19% in after-hours trading. The filing by Icahn's team noted that the activist investor intends to talk to JetBlue's management about a position on the company's board. The ninth annual Fintech 50 list features firms that continue to innovate, grow and adapt. The past year has been painful for the financial technology industry: Publicly traded fintech stocks are languishing 50% below their late 2021 peak, even as the S&P 500 has surged to new highs, and venture capital funding for fintech startups fell more than 70% from 2021 to 2023, according to CB Insights. But our 2024 Fintech 50 list is packed with extraordinary entrepreneurs who have adapted and flourished in this environment. MORE: Thirteen fintech startups made their debut on the list this year, and in a difficult market, they have to be scrappier to survive—or impressive enough in hard times to win a substantial venture investment. Three categories that primarily serve other businesses—Payments, Wall Street and Enterprise and Business to Business Banking—made a strong showing at a time when startups no longer have seemingly unlimited VC funds to lavish on big consumer marketing campaigns. Bitcoin reached the $50,000 mark for the first time since the bullish days of 2021, after gaining 13% in a five-day period. It represents a strong recovery from a large sell-off in mid-January when it succumbed to a familiar pattern of “buying the rumor and selling the news” after the long-awaited spot bitcoin exchange-traded funds opened up. Autry Stephens refused to sell Endeavor Energy Resources for many years, and his doggedness in not just building the oil company from scratch, but hanging on to it through the highs and lows, earned him the No. 45 spot on last year’s Forbes 400 list, with an estimated fortune of $14.8 billion. Now he’s finally selling Endeavor in a $26 billion transaction to Diamondback Energy, a deal that moves the North American oil industry farther down the path of consolidation. With a market cap of $1.83 trillion, Nvidia is now worth more than fellow tech giants Amazon and Google parent Alphabet. The chipmaker is now the fourth most-valuable public company in the world, as its stock has more than quadrupled over the last 15 months. The symbolic passing of the torch caps Nvidia’s remarkable journey as Wall Street flooded into the stock amid the AI boom. Google on Monday announced it would help train people in Europe with skills in artificial intelligence, the latest tech giant to invest in preparing workers and economies for the disruption brought on by technologies they are racing to develop. In order for AI to benefit everyone, it “must be built by—and accessible to—everyone,” said Matt Brittin, president of Google Europe, Middle East and Africa, in a blog post announcing the initiative. United States Supreme Court Associate Justice Samuel Alito poses for an official portrait at the East Conference Room of the Supreme Court building on October 7, 2022 in Washington, DC. (Photo by Alex Wong/Getty Images) Samuel Alito is the second-richest of the nine justices on the Supreme Court, with a net worth Forbes estimates at $10 million, behind only Chief Justice John Roberts, who is worth $25 million. Despite a public sector career, Alito benefitted from inheritance, and today, he owns two homes and sits on an investment portfolio with holdings in more than two dozen publicly traded companies, including Boeing, ConocoPhillips, Anheuser-Busch and Raytheon. Meanwhile, Justice Elena Kagan is among the poorer members of the Supreme Court, with an estimated $4 million fortune, which she slowly and steadily accumulated while working at the heights of academia and government. Unlike several of her colleagues, Kagan hasn’t inked any million-dollar book deals, nor has she enjoyed high-paying stints in private practice, married rich or accepted hundreds of thousands of dollars in gifts from wealthy friends. Bill Gates-backed startup Koloma, which extracts naturally occurring hydrogen from underground deposits, just raised $245.7 million from investors like Amazon’s Climate Pledge Fund and United Airlines Sustainable Flight Fund, bringing its total funding to more than $300 million. The financing round positions Koloma to stay ahead of competitors in the developing field of geologic hydrogen, an extraction method for the energy that advocates believe will be cheaper than the alternatives. Over the weekend, boxer Floyd Mayweather Jr. posted on Instagram that he paid over $1 million for a suite at the Super Bowl, and then followed it up with a photo of a check made payable to the U.S. Treasury for about $18 million for taxes. Some questioned whether you can write a check to the IRS that large: The answer is yes. The largest check you can write to the federal government is $99,999,999, but the feds don’t have the same limits on credit card payments. CODY PICKENS FOR FORBES TOPLINE Since 2017, fintech startups Coalition and its closest competi­tor, At-Bay, founded by security and spy-agency veterans, have been reinventing the way cyber insurance is underwritten and managed, particularly for small and midsize clients. Old-line insurers seemed hopelessly out of touch, sending prospective customers forms asking such basic questions as whether they had antivirus software installed. The newcomers, by contrast, scanned potential customers’ systems as a hacker might. Sometimes they required specific security upgrades before agreeing to insure them. Other times, they simply turned them down. That combination of screening, vigilance and jawboning has allowed the two fintechs to charge lower premiums, winning the favor of insurance brokers and a foothold in the market. It has helped, of course, that cyber was a newish niche when they entered the market, and that both cyber­attacks and demand for insurance against them exploded during the pandemic. Total cyber insurance premiums in the U.S. shot from less than $1 billion in 2012 to an estimated $11 billion in 2023, according to San Francisco-based analytics firm CyberCube. Coalition CEO and cofounder Joshua Motta offers this chilling example: In 2020, using a single employee’s login, a hacker was able to move laterally within a Kansas distillery’s computer systems and shut the whole operation down. “The gaskets that sealed the different equipment where fluid was being transpor­ted dried up and cracked,” causing property damage, Motta says. Coalition and its reinsurers ultimately paid about $2 million on the company’s claim, including nearly $1 million in lost revenue, $600,000 in ransom to get back online and fees for attorneys and digital forensics experts. While neither startup is yet profitable, their growth stands out in the struggling fintech sector, earning them spots on Forbes’ 2024 Fintech 50 honor roll. WHY IT MATTERS Coalition retains just 10% of the risk and At-Bay keeps 20%. The rest of the risk and a big chunk of the premiums get passed on to large carriers and reinsurers such as Swiss Re and Munich Re. Net revenue last year was nearly $300 million at Coalition and more than $110 million at At-Bay. Despite not making a profit, both companies still have money in the bank, but should they need to raise more capital soon, they’d likely have to take a valuation cut given the state of the industry. Coalition last raised funds at a $5 billion valuation in 2022, making Motta’s 20%-plus ownership stake worth a bit less than $1 billion, by our estimate. MORE Eight CEOs Making Their Debut On The Fintech 50 A proposed deal to build a new sports stadium for Washington, D.C.’s NBA and NHL teams—in Virginia—could be “dead” in Virginia’s state senate before it even comes up for debate: $2 billion: Estimated cost of the new stadium that would become home to the Washington Wizards and the Washington Capitals $1.35 billion: How much Virgina taxpayers could reportedly end up paying for the stadium, making it the largest arena subsidy ever ‘Not ready for prime time’: What Virginia state Sen. L. Louise Lucas, who removed the bill from a senate committee docket, said of the deal on social media Momentum around adopting a four-day work week has been growing, as proponents cite benefits to well-being, productivity and morale. The main model for a four-day work week is 100:80:100, where employees are paid 100% of their salaries, work 80% of the previous hours but need to meet the same expectations for 100% performance. Critics of the shorter work week equate the amount of time spent working to working hard, when in fact, productivity is driven by finding ways to get the job done more efficiently. Celebrations were held Saturday around the world to mark the start of the Lunar New Year, as billions are expected to travel worldwide to participate in festivities, which culminate with the Lantern Festival on February 24. According to the Chinese zodiac system, 2024 is the year of which animal? A. Tiger B. Rabbit C. Ox D. Dragon Check your answer. Find out about the biggest news from Forbes as it happens, you can sign up to get email alerts here.  "
}