{
    "title": null,
    "date": "2/8/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37007350/red-hot-nvidia-rally-to-pause-whats-going-on-with-the-stock",
    "text": "Nvidia Corp. NVDA shares, which closed above the $700 mark for the first time on Wednesday, were seen slipping in Thursday’s premarket session. Nvidia’s dream run that began in earnest in early 2023 has continued in the new year. It closed 2023 as the best-performing S&P 500 stock, thanks to a 239% jump for the year. The upward momentum continued unabated, and it has maintained the same credentials so far this year. Year-to-date, the stock has soared nearly 42%. The gains ordinarily may stir valuation concerns. Not so for Nvidia, which is the core of the AI revolution that is just getting started. Deepwater Asset Management’s Gene Munster sees the AI bubble resulting from the rerating of stocks of AI-levered companies to last over two to three years. “I still believe we're at the start of 3-5 year tech run that will end with an AI bubble, ” he said in a post on X. Nvidia’s powerful AI accelerator chipsets are used for training and inference in data centers, and they have had a near monopoly position. Strong uptake of the Santa Clara, California-based chips has boosted its fundamentals. The company is scheduled to report its fourth-quarter results on Feb. 21, and in the run-up to the results, analysts have been proactive in raising their expectations for the company and the stock. Nvidia is currently the sixth most-valued company, and at the close of trading on Wednesday, it had a market capitalization of $1.731 trillion. In premarket trading, the stock slid 0.43% to $698, according to Benzinga Pro data. See Also: How To Buy Nvidia (NVDA) Stock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}