{
    "title": "Nvidia: Can the chip giant double its revenue three years in a row?",
    "date": "2/18/2024",
    "url": "https://www.afr.com/technology/chip-giant-nvidia-s-mission-impossible-20240218-p5f5uw",
    "text": "Never in the history of big tech has a large player doubled its revenue three years in a row. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login When Nvidia Corporation, the world’s most valuable semiconductor company, reports its quarterly results this week, investors and analysts will be contemplating one critical question: Can it double its revenue three years in a row? Never in the relatively short but extraordinary history of global software and hardware has a large-scale tech company achieved this feat. Nvidia’s revenue growth is almost as predictable as co-founder Jensen Huang’s dark jeans, black shirt and black leather jacket. Bloomberg All the magnificent seven tech stocks – Alphabet, Amazon, Apple, Meta, Microsoft, Nvidia and Tesla – were able to double their revenue in their start-up years. But since scaling the heights of multi-billion dollar annual revenues, none of them has doubled their revenue in one year, let alone two. Tesla came close between 2017 and 2018 and again between 2020 and 2021 with revenue growth of 70 per cent and 80 per cent respectively. But even Elon Musk’s wild ride on the electric vehicle roller coaster could not result in Tesla matching the performance of Nvidia, which has become the essential linchpin for artificial intelligence. The world’s data centres are filling up with Nvidia’s graphic processing units (GPUs) and its proprietary CUDA software, as cloud computing spreads and AI suppliers keep expanding the training of their large language models (LLM). GPUs are perfect for AI applications such as Open AI’s ChatGPT because they are designed to run multiple iterations of the same calculation at once. There are long waiting lists for Nvidia’s GPUs, which are manufactured by Taiwan Semiconductor Manufacturing Company. The waiting lists will grow longer as tech spending on AI increases substantially. Wednesday’s earnings call for Nvidia is expected to reveal annual revenue growth of more than 100 per cent to $US58 billion ($89 billion) for the year to January 31. That figure is more than double Nvidia’s $US26.9 billion revenue in 2023. The question is: Will the company’s co-founder and chief executive Jensen Huang guide the market to believe Nvidia can repeat this remarkable revenue growth in the year to January 2025? There are some analysts in the pool of 48 who cover the stock who are forecasting revenue in the year to January 2025 well in excess of $US100 billion, although consensus says it will come in at about $US90 billion, according to data compiled by S&P Global Market Intelligence. That latter figure, which would represent revenue growth of 52 per cent, is probably not fast enough to maintain Nvidia’s heady valuation. Mind you, there are those who have enormous confidence in Nvidia going gangbusters this year. One analyst has a price target of $US1200 on the stock, which closed on Friday at $US726.13. This month the company became the third most valuable in the world, after nudging past Amazon. The top five most valuable companies are now Microsoft ($US3 trillion), Apple ($US2.8 trillion), Nvidia ($US1.79 trillion), Amazon ($US1.76 trillion) and Alphabet ($US1.75 trillion). Nvidia now trades at 19 times next year’s revenue and with a price earnings multiple of 35. Its gross profit margin is 70 per cent. One high-profile sceptic of the stock is Cathie Wood from ARK Investment Management, who told a Wall Street Journal podcast that “expectation levels just get so high that they cannot be met”. She also highlighted increased competition from big tech companies including Meta, Tesla, Alphabet and Amazon, which are developing their own AI products. “They’re all working on their own AI chips,” she told the podcast. “They’re more specialised, more special-purpose, whereas NVIDIA’s are more generalised.” Morgan Stanley analyst Joseph Moore says the competition is unlikely to disturb Nvidia’s dominant position. “The shortage of Nvidia chips, and the stressful allocation process which that shortage creates, has cloud service providers looking for alternatives, and we see very strong builds of both merchant solutions (such as AMD’s MI300 chip and Intel’s Gaudi 2) as well as custom silicon from cloud service providers,” he says. “Within (LLM) training, though, we still see Nvidia as being in a very strong position. Customers of cloud service providers are very reluctant to be locked into a custom solution, as most of them are using multiple cloud providers. “The fast pace of Nvidia technology is also a very high bar for the competition to surpass.” Nvidia’s H100 chip is the fastest available in the market, and it will launch an even faster chip called the B100 in the second half of this year. Not only will the B100 be faster, it is also expected to be significantly more expensive than the H100. One competitor to Nvidia that will be taken seriously is Softbank Group, which is poised to invest $US100 billion in a new chip venture, according to Bloomberg. Softbank founder Masayoshi Son, whose personal wealth has been bolstered by the listing on Nasdaq of the London-based chipmaker Arm Holdings, is feeling expansive again after several years of being hit by poorly performing investments. Softbank owns 90 per cent of Arm. Arm’s share price soared 90 per cent in three days last week and is now worth triple the $US51 a share listing price when it listed on Nasdaq in September. Alex Pollak, chief investment officer at fund manager Loftus Peak, says competitors will find it difficult to catch up with Nvidia’s technology leadership. He says that for AI chip demand to be satisfied it has to come through TSMC or Samsung because they have the only manufacturing capacity for mass-producing 3 nanometre chips. “They (Softbank) can say whatever they want about how they’re going to build their manufacturing capacity, but building foundries from this position will take about four years,” he says. Pollak, who runs the Loftus Peak Global Disruption Fund, which owns shares in Nvidia, says AI is being adopted by just about every industry and this is fuelling demand for Nvidia chips. “You know, it (Nvidia) has doubled, but whether it gets to $US100 billion or not I don’t know,” he says. “But even if it got to $US80 billion, that would be a fourfold increase on what it was just two years ago. “I’m not prepared to say they can’t do it. We’ve got a decent position. And we’re inclined to hold it.” For Nvidia to double its revenue this year to $US116 billion is the equivalent of mission impossible. But the revenue run rate likely to be released on Wednesday will point to the possibility of that mission being accomplished. Disclosure: The author’s self-managed super fund owns units in the Loftus Peak managed Global Disruption Fund. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}