{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.dcourier.com/news/2024/feb/27/analyst-who-forecast-nvidia-stock-could-exceed-750/",
    "text": "  Artificial-intelligence spending has caused Nvidia's share price to surge as investors model for ever-growing demand for its semiconductor chips. Nvidia's position as the leading provider of chips specially designed to train and run AI applications has resulted in eye-popping sales and profit growth. As a result, Nvidia's stock has risen by 243% in the past year and 60% year-to-date. The run higher in Nvidia's stock has surprised many, leaving them wondering what could happen next. However, it didn't shock everyone. In March 2023 Real Money Pro's Bruce Kamich forecast that Nvidia \"investors should look for additional gains.\" And on Feb. 7 he also laid out a pathway for the shares to eclipse $750, before Nvidia shares rocketed 16% on Feb. 22 on the company's report of blockbuster earnings. Now that Nvidia is flirting with $800 a share, Kamich has updated his analysis, including a new price target. Wu Jun&solVCG via Getty Images Artificial intelligence isn't a new concept. The mathematician and computer scientist Alan Turing investigated designing AI computers in the 1950s, and the first AI program was created by Rand Corp. in 1956. Over the years, many science-fiction books and movies have examined the possibility that machines could someday think for themselves. Although the notion of AI isn't new, AI has only recently gone mainstream. The release of OpenAI's ChatGPT, a large-language AI model, in December 2022 unlocked the promise of AI, demonstrating how it could be used to search, parse and create content quickly and simply. Related: Nvidia crushes earnings, stock soars. Time to buy AMD? Following ChatGPT's success (it was the fastest application to reach 1 million users), we've witnessed a tidal wave of interest in AI research and development. Financial services companies like JP Morgan are using it to hedge risks, health-care companies are evaluating its use to design better medicines, and retailers are exploring whether it can reduce theft. The military is even evaluating its potential on the battlefield. Seemingly, companies in every industry are knee-deep in training AI models, a complex, time-consuming process that requires significantly more computing power than existing infrastructure can handle efficiently. As a result cloud service providers like the hyperscalers Amazon, Microsoft and Google parent Alphabet are plowing big money into servers packed with more powerful parts, including Nvidia's graphics-processing units or GPUs. Nvidia's GPU systems aren't the small, lightweight chips most people imagine. Instead, they're highly sophisticated systems that weigh over 70 pounds, include thousands of technology parts, and cost tens of thousands of dollars apiece. The combination of demand and a high price tag has been a boon to Nvidia's top and bottom lines. In the fourth quarter, Nvidia's revenue increased by a staggering 265% to $22.1 billion, its third consecutive quarter of triple-digit growth. Leveraging that sales growth against fixed costs has meant profit grew an even more impressive 486% to $5.16 per share. Nvidia's CEO, Jensen Huang, expects the company to continue to benefit from AI demand growth. During the company's recent earnings conference call, Huang said he expected the shift to accelerated computing and development of generative AI models to cause a major new upgrade cycle for network infrastructure. That effort would replace central processing units, or CPUs, with GPUs better able to process AI workloads. More AI Stocks: \"We believe these two trends [accelerated computing and generative AI] will drive a doubling of the world's data-center infrastructure installed base in the next five years,\" said Huang. Huang says this transformation will create a market valued in the \"hundreds of billions of dollars\" yearly. Those tailwinds suggest Nvidia's good times are likely to continue, but the company isn't without headwinds. Specifically, the growing risk that foreign governments will use Western technology to develop new AI applications that could one day be used against America has led to stringent restrictions on Nvidia selling its most advanced chips in China. The restrictions, which went in place last fall, have weighed down Nvidia's results because China has historically represented 20% of its data-center sales. The company is developing a less powerful chip that meets the government's performance limits, but that chip won't be readily available until the second quarter. Nvidia also faces a challenge in the form of new competition from rival Advanced Micro Devices. AMD CEO Lisa Su is selling its first GPU specially designed for AI, the MI300X, this year, and she says demand for it is solid. \"Customer response to MI300 has been overwhelmingly positive. And we are aggressively ramping production to support the dozens of cloud, enterprise, and supercomputing customers deploying Instinct accelerators,\" said Su. Previously, Su aimed for $2 billion in data center GPU revenue this year. Now, she says sales will exceed $3.5 billion this year. To fend off AMD  (AMD) , Huang's team at Nvidia is developing new AI chips. Its H200 is already shipping, with reported performance doubling from the H100. It's also working on a new Blackwell GPU architecture, including the B100 chip, which could be released later this year. The market may be big enough for Nvidia and AMD to succeed. Su predicts the AI-GPU market will expand by an average of 73% annually to $400 billion through 2027. However, investors are right to wonder whether Nvidia shares are priced to perfection following their recent rally. When Kamich calculated a price target of $757 in early February, he expressed concern about the shares' meteoric rise. Nvidia has overcome skepticism, surging above Kamich's target, causing him to update his analysis. A technical analyst, Kamich, has professionally evaluated price and volume trends for insight for 50 years. His new analysis of Nvidia suggests some ongoing concern that Nvidia stock is overextended. However, his updated stock-price target suggests the shares still might have room to climb. \"Prices are extended above both the rising 50-day moving average line and the rising 200-day line,\" said Kamich. \"The slow stochastic indicator [an overbought/oversold indicator] is turning lower from a very overbought reading.\" The risk that Nvidia may give back some recent gains exists, but using a daily point-and-figure chart, Kamich calculated an upside price target in the \"$1,134 area.\" That target is intriguing, but Kamich notes that the weekly P&F chart target of $724 has already been achieved. Also, investors should remember that P&F targets aren't guaranteed or suggest the time it may take to achieve a target. Overall, Nvidia is riding a big secular trend toward AI development, and Huang says first-quarter revenue will more than triple to $24 billion from $7.2 billion in Q1 2023. Nevertheless, investors may want to closely monitor how Nvidia trades. Given its rapid runup, it certainly wouldn't be surprising if the shares took a breather at some point. Related: Veteran fund manager picks favorite stocks for 2024                                  Click Below to: Contents of this site are © Copyright 2024 Prescott Newspapers, Inc. and Western News&Info®, Inc. All rights reserved. |  Terms of Service | Privacy Policy "
}