{
    "title": "Nvidia Stock Spikes To Record High After Goldman Sachs Endorsement",
    "date": "2/5/2024",
    "url": "https://www.investors.com/news/technology/nvidia-stock-spikes-to-record-high-after-goldman-sachs-report/",
    "text": "BREAKING: Futures Fall Slightly Nvidia (NVDA) stock jumped to an all-time high on Monday after investment bank Goldman Sachs hiked its price target on the maker of chips for artificial intelligence. Analyst Toshiya Hari raised his 12-month price target on Nvidia stock to 800 from 625. He also reiterated his buy rating and kept Nvidia on the firm's \"conviction list\" of top stock picks. On the stock market today, Nvidia stock rose 4.8% to close at 693.32. Earlier in the session, it notched a record high 694.97. In a client note, Hari said Nvidia will benefit from \"robust AI server demand and improving GPU (graphics processing unit) supply.\" He also raised his Nvidia earnings estimates for fiscal 2025 and 2026. Nvidia's fiscal 2024 ended on Jan. 28. \"We no longer assume a drop-off in data center revenue in second-half calendar year 2024 and instead model consistent growth through first-half calendar 2025, driven by continued spending on Gen AI infrastructure by the large cloud service providers, a broadening customer profile, and multiple new product cycles,\" he said. Recent reports from Meta Platforms (META), Microsoft (MSFT) and Super Micro Computer (SMCI) back his bullish stance on Nvidia, Hari said. Hyperscale cloud service providers like Meta continue to invest heavily in AI-powered data centers, he said. Plus, Meta and Microsoft are showing early evidence of AI monetization for their services, Hari said. Meanwhile, Nvidia is likely to outperform rival Advanced Micro Devices (AMD) in the AI chip market, he said. \"From a competitive standpoint, although AMD is making good progress with its MI300 platform, we believe Nvidia will remain as the industry gold standard for the foreseeable future given its robust hardware and software offerings and, importantly, the pace at which it continues to innovate.\" The next potential catalyst for Nvidia stock will be the company's fiscal fourth quarter report, due on Feb. 21. Nvidia stock is on five IBD stock lists: IBD 50, Leaderboard, Big Cap 20, Sector Leaders and Tech Leaders. On Jan. 8, Nvidia stock broke out of a flat base at a buy point of 505.48, according to IBD MarketSmith charts. Although Nvidia has risen beyond the 20%-to-25% profit-taking level from its breakout, it also is subject to the eight-week hold rule. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: Chipmaker Onsemi Beats Q4 Views But Gives Soft Outlook Microchip Joins Other Chipmakers Cutting March-Quarter Forecasts Apple Forecasts Weak March-Quarter Sales, Launches Vision Pro Find Winning Stocks With MarketSmith Pattern Recognition & Custom Screens See Stocks On The List Of Leaders Near A Buy Point 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500 stock Super Micro has more than tripled. Tesla remains the... 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}