{
    "title": "An Apple tease, Microsoft's cloud soars, Nvidia's big threat, and Taylor \nSwift deepfakes: The week in AI news",
    "date": "2/3/2024",
    "url": "https://qz.com/ai-news-apple-microsoft-nvidia-meta-openai-taylor-swift-1851221482",
    "text": "It was another busy week in artificial intelligence news, from word of a coming Apple announcement to Taylor Swift AI deepfakes taking over the internet. Check out the slideshow above to see what you might have missed. 2 / 9 We are one step closer to knowing what Apple is developing on the generative AI front. Read More 3 / 9 Tech layoffs are happening—and Microsoft is no exception. But Microsoft’s bottom line is thriving. In the last three months ending Jan. 30, the company recorded revenue of $62.0 billion, up 18% from the same period last year. The tech giant’s cloud business, which includes its Azure division, posted revenue of $25.9 billion, up 20%. Read More 4 / 9 Nvidia—which roughly translates to “envy” in Latin—has been having its AI moment. The chip maker’s stock is up almost 30% year-to-date, closing at $624.65 on Monday, Jan. 29. Read More 5 / 9 Mark Zuckerberg is on a mission to make the metaverse happen. In the last three months ending Dec. 31, Meta’s Reality Labs division hit $1 billion for the first time — while also recording $4.65 billion in losses. To be sure, the VR headsets still make up a slither of Meta’s overall revenue, which continues to be driven by the company’s ad business. Read More 6 / 9 More automakers want you to talk to your car. Read More 7 / 9 OpenAI’s most advanced AI model, GPT-4, doesn’t pose a risk of helping people create biological threats, according to early research from the company. But that doesn’t mean we’re in the clear. Read More 8 / 9 Last week, explicit AI-generated photos of Taylor Swift flooded X, marking the latest high-profile deepfakes and highlighting the challenge of stopping them. Read More 9 / 9 "
}