{
    "title": "Intel Makes Sense As A Hedge To TSMC, AMD, And Nvidia (Upgrade) \n(NASDAQ:INTC)",
    "date": "1/30/2024",
    "url": "https://seekingalpha.com/article/4666034-intel-makes-sense-as-a-hedge-to-tsmc-amd-and-nvidia-rating-upgrade",
    "text": "JHVEPhoto/iStock Editorial via Getty Images JHVEPhoto/iStock Editorial via Getty Images Intel Corporation (NASDAQ:INTC) has been on the road to turning around its foundry business for a couple of years now, and developments over the last few months suggest that Intel Foundry Services (IFS) may start to catch up technologically with Taiwan Semiconductor Manufacturing Company Limited (TSM) aka TSMC over the next two or three years. This possibility was further highlighted by positive news about Intel's foundry turnaround during the Q4 earnings report. Although Q4 results and next quarter's guidance were both disappointing, and Intel shares have dropped about 12%, the updates about Foundry Services were generally positive and the long-term outlook for Intel seems to be improving. Although nothing is certain, it seems realistically possible that Intel Foundry Services could realistically make progress toward taking market share away from TSMC, which is the current leader in process technology with its N3 node, and which manufactures chips for most major fabless chipmakers, including Intel and its main competitors in CPUs and GPUs, Advanced Micro Devices (AMD) and Nvidia (NVDA). If Intel succeeds in its foundry turnaround, then it could compete more effectively against TSMC as a foundry, and AMD and Nvidia as a chip designer. In this case, these peers would likely see valuation headwinds and Intel would likely see a significant upward revaluation. Hence, there is a compelling case to buy Intel for investors who have positions in TSMC, AMD, and Nvidia, as a way of hedging downside risk associated with these positions if Intel regains competitiveness in process technology. In light of these considerations, I am revising my rating for Intel from a hold to a buy. Readers can see my previous rating in the article \"Intel Q2 2023 Earnings: Key Updates About The Impact Of AI.\" I explain the rationale for the more positive outlook below. Over the last few months, we've heard some conflicting things Intel's progress on the foundry front. On the one hand, Intel CEO Pat Gelsinger sounds increasingly upbeat about Intel's chances of overtaking TSMC with the 18A node. Per Gelsinger: We announced two major innovations with 18A: a new transistor and backside power. I think everybody's looking at the transistor of TSMC's N2 versus our 18A. It's not clear that one is dramatically better than the other. We'll see who's best. But the backside power delivery, everybody says Intel, score. You are years ahead of the competition. That's powerful. That's meaningful. It gives better area efficiency for silicon, which means lower cost. It gives better power delivery, which means higher performance. So, I have a good transistor. I have great power delivery. I think I'm a little bit ahead of N2… On the most recent earnings call, Gelsinger provided further positive commentary regarding IFS: Arrow Lake, our lead Intel 20A vehicle will launch this year. Intel 18A is expected to achieve manufacturing readiness in second half '24, completing our five nodes in four year journey and bringing us back to process leadership. I am pleased to say that Clearwater Forest, our first Intel 18A part for servers has already gone into fab and Panther Lake for clients will be heading into fab shortly. Intel also reported on the earnings call that it now has 4 customers for 18A, up from 3 the previous quarter, with the latest customer representing \"a key design win with a significant high-performance computing customer.\" Intel further claimed \"three additional advanced packaging design wins, bringing the total to five in 2023, with the majority of revenue starting in 2025.\" Intel now boasts that the \"lifetime deal value for IFS is now over $10 billion, more than doubling from the $4 billion we provided in our last update.\" There is still uncertainty about who exactly Intel's foundry customers for its upcoming nodes are, but these new wins, especially the one with the high-performance computing customer, could potentially be quite significant (as could some earlier wins). Although uncertainty remains, it does seem that Intel is making some real progress on the foundry front. These updates are particularly encouraging for Intel given that TSMC's N2 node is scheduled to launch a few quarters after Intel's 18A node. However, it is worth noting that Intel's rosy outlook has been disputed by TSMC CEO C. C. Wei, who contends that Intel's upcoming process technologies will face a tough contest even against the N3P node. On the Q3 earnings call, he stated: Our internal assessment shows that our N3P… technology demonstrated comparable PPA [power, performance, area] to 18A… but with an earlier time to market, better technology maturity, and much better cost…. Our 2-nanometer technology without backside power is more advanced than both N3P and 18A, and will be [the] semiconductor industry's most advanced technology when it is introduced in 2025. Wei's comments suggest that even if Intel executes on its roadmap on time, it would still have trouble keeping pace with TSMC. Although it is hard to say whose prediction will turn out to be more accurate, I do think that there is genuine uncertainty around IFS (Intel Foundry Services) potentially catching up with TSMC, and perhaps even surpassing it. Aside from Gelsinger's comments (which should obviously be taken with a grain of salt), there are several reasons why I now find it credible that Intel could pose a challenge to TSMC's technology lead and dominant market share over the next few years: In light of these considerations, I now think that there is a reasonable probability that IFS could achieve competitiveness with TSMC in the foundry business over the coming years. While skepticism about Intel's future is still certainly warranted given Intel's shaky execution over the past few years, it does seem somewhat credible that Intel is making some real technological progress. If so, it could have a real shot at achieving technological parity - or perhaps even superiority - against TSMC in the foundry business. If IFS mounts a successful turnaround, Intel could also become a significant threat to AMD and Nvidia in the CPU and GPU markets. Intel's position as both a chip designer and foundry has been a double-edged sword. Historically, Intel's leading position as a foundry significantly benefited its design arm and resulted in unbeatable chips and a monopoly. However, when Intel's foundry lost its technological edge to TSMC, this adversely impacted Intel's chip design team as well. Intel's designs have been hamstrung by the company's foundry missteps, since Intel cannot afford the underutilization hit that would result from outsourcing all its production elsewhere. And although Intel has outsourced some manufacturing to TSMC, it must continue to rely on its design team to be IFS's largest customer to avoid severe underutilization. But if IFS regain competitiveness in process technology, this could alleviate the difficulties faced by the design team in the CPU and GPU markets by enabling them to produce more performant chips on more advanced process technologies. If Intel's CPUs become more performant, this could help reduce - and potentially halt or reverse - Intel's market share losses to AMD in data center CPUs. Intel's foray into GPUs against Nvidia and AMD could also meet with more success the better the process technology and the more performant the chips. Hence, with an IFS turnaround, Intel could take market share from AMD and Nvidia and potentially put pricing pressure on them as well. If IFS has a realistic chance of catching up with TSMC, then Intel also poses a realistic threat to Nvidia and AMD (and not just TSMC). And even if Intel doesn't manage to halt their growth, Intel's resurgence could potentially act as a headwind to Nvidia and AMD's growth in coming years. Given the potential threat it poses to its peers, Intel is starting to make sense as a buy for investors who hold long positions in TSMC, AMD, and Nvidia (as a way of hedging against the threat from Intel). Intel's competitors could see a significant decline in valuation if Intel mounts a successful comeback, and Intel could see significant upside. TSMC should be the most directly threatened by IFS. TSMC has been enjoying healthy profits and growth for several years now, thanks to its lead in process technology. If IFS becomes a viable alternative to TSMC, this could impact TSMC's growth (as industry-wide secular growth trends are offset by market share losses), and profitability (if TSMC needs to start offering better prices to retain customers). AMD is next in line in terms of being threatened by Intel, since they already compete in the CPU market. Although AMD continues to gain market share against Intel in data center CPUs, if IFS achieves competitiveness these share gains could pause - and potentially be reversed. AMD trades at around 50x forward earnings (non-GAAP), so if growth slows down in the CPU business, AMD's profitability and valuation multiples could decline significantly. AMD and Nvidia are both also potentially threatened in their GPU businesses. Again, if IFS regains parity then Nvidia and AMD could potentially lose market share to Intel in the all-important AI accelerator market. High expectations around Nvidia and AMD's success in this market have seen their valuations soar over the last year. Headwinds due to competition from Intel could see sentiment become less bullish. Like AMD, Nvidia also trades at a high multiple of around 30x forward earnings (non-GAAP), so hiccups in growth could lead to a decline in valuation for both companies. In these scenarios, Intel makes sense as a hedge because it would likely see very good returns if the IFS turnaround is successful. Intel currently has a smaller market capitalization ($180 billion) than each of its peers-TSMC sits at $530 billion, AMD at $280 billion, and Nvidia at $1.5 trillion. As such, there is clearly a lot of profit - and in turn market capitalization - up for grabs if Intel can turn around its foundry business and compete more effectively against the others. If IFS is able to compete against TSMC, then just the foundry business could conceivably be worth $200 billion or more even if Intel is still in the number two spot behind TSMC (which is Intel's goal for the next few years). And if IFS eventually takes a lead in process technology against TSMC, then it could potentially be worth a few hundred billion dollars. Here, it is also worth noting that IFS may command higher valuation multiples than TSMC due to the absence of geopolitical tensions. If Intel can eventually compete effectively with AMD and Nvidia as well, then we could see the valuation of Intel's design segment grow significantly too - especially as secular tailwinds grow the CPU and GPU markets in coming years. And so it makes sense that if IFS can compete successfully then Intel could see a much higher overall valuation than it currently enjoys. It is also possible that Intel's valuation multiples may expand further if the company returns to healthy growth. Intel shares are down significantly since its recent earnings report, based on ongoing issues with current competitiveness. But if one sees Intel as a long term hedge, then the current slump in stock price may present a good buying opportunity since there doesn't seem to have been any negative change in the IFS turnaround - if anything, Intel's latest updates are quite bullish. Intel's long term positioning remains intact. Therefore, I think that a long position in Intel is worth considering as a hedge to mitigate downside risk for investors who hold long positions in TSMC, AMD, and Nvidia. That being said, it should be noted that despite positive signals, the IFS turnaround story remains a risky proposition. The main risks as I see them are as follows: Although Intel's turnaround remains mired in uncertainty, it does seem to me that Intel has a realistic chance of becoming more competitive over the next few years. Although Intel is struggling at the moment, it could realistically threaten the growth and valuations of TSMC, AMD, and Nvidia if its turnaround strategy succeeds. And so, on balance Intel is worth considering for investors who have long positions in Intel's competitors, as a way of managing the potential downside risk should Intel's turnaround succeed. Consequently, I am upgrading Intel to a buy. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AMD, INTC, NVDA, TSM either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}