{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1038636/untouchable-nvidia-hits-yet-another-all-time-high-1038636.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Advertising Cookies collect information about your browsing habits such as the pages you visit and links you follow. These audience insights are used to make our website more relevant. Performance Cookies collect anonymous information designed to help us improve the site and respond to the needs of our audiences. We use this information to make our site faster, more relevant and improve the navigation for all users. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence William kickstarted his career as a researcher and reporter for a global legal publication, covering everything from public law to M&A. Before moving to Proactive Investors, he worked as a reporter for a major fintech company with a focus on cryptocurrency and blockchain technology.\r\n\r\nHarking from Queensland, Australia, William obtained first-class honours in journalism and media from Birkbeck University before going on to complete an MA in creative and critical writing. Other jobs have... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 11:45 17 Jan 2024 GMT Nvidia Corporation (NASDAQ:NVDA) stock hit another all-time high on Tuesday, in a sign that the bubble may not be over yet for the semiconductor megacap. Shares reached $563.89 at NASDAQ’s closing bell, bringing Nvidia’s market capitalisation to an eye-watering $1.39 trillion. Nvidia’s market valuation has tripled in the past 12 months thanks to an artificial intelligence (AI) premium. The company’s top-spec microchips became synonymous with the AI revolution after OpenAI used thousands of Nvidia H100 units to train the landmark ChatGPT generative AI model. Nvidia’s technology saw a massive surge in demand as a consequence, with large-scale data centres putting in substantial orders for the company’s graphics processing units (GPUs). On top of that, Nvidia remains the leader in GPUs in the computer games industry, while adjacent software and networking products have reinforced group-wide revenues. Last week, Nvidia impressed crowds at the Las Vegas Consumer Electronics Show with its new range hardware offerings, including three models of its GeForce RTX (NYSE:RTX) 40 Super Series desktop GPUs. The top-of-the-line GeForce RTX (NYSE:RTX) 4080 Super is capable of generating AI images 1.7 times faster and video 1.5 times faster than the equivalent model from the previous generation of Nvidia technology. The new chips are also optimised for a superior gaming experience, with the ability to power games with ray tracing at 4K resolution. Though Nvidia shares are commanding a bumper premium of more than 74 times price to earnings, its revenues have soared accordingly. Revenues of $18.12 billion in the last quarter represented a 206% year-on-year increase, while earnings per diluted share for the quarter came to $3.71, up more than 12 times from a year ago. “NVIDIA GPUs, CPUs, networking, AI foundry services and NVIDIA AI Enterprise software are all growth engines in full throttle. The era of generative AI is taking off,” Nvidia CEO Jensen Huang told investors. Nvidia shares are expected to open another 44 basis points higher when US markets open on Wednesday. Sign up to receive alerts and news direct to your inbox Oriole Resources PLC (AIM:ORR) CEO Tim Livesey joins Proactive's Stephen Gunnion with and update on the companhy's Bibemi orogenic gold project in Cameroon.\r\n\r\nThe company is working in partnership with BCM International to expand and extend the mineral resource at the Bibemi site. Recent... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}