{
    "title": "Missed Out on Nvidia? 2 Incredibly Cheap Artificial Intelligence (AI) \nStocks to Buy Before They Jump 47% to 95%",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/missed-nvidia-2-incredibly-cheap-135600516.html",
    "text": "Artificial intelligence (AI) hype has supercharged Nvidia stock in the past year; the company's chips have witnessed massive demand thanks to their ability to train large and complex AI models. The robust demand for Nvidia's chips explains why the company's revenue is set to more than double in its current fiscal year, which will end this month. The market has handsomely rewarded Nvidia for its eye-popping growth, with its shares rising 222% in the past year. The good part is that Nvidia seems capable of sustaining its impressive rally thanks to the growing demand for AI chips deployed in servers and other applications. This explains why KeyBanc Capital Markets analyst John Vinh recently raised his Nvidia price target to $740 from $650. The upgraded price target points toward a 30% upside from current levels. However, Nvidia wasn't the only chip stock to receive a price target bump from KeyBanc. The firm expects two more chipmakers, Advanced Micro Devices (NASDAQ: AMD) and Micron Technology (NASDAQ: MU) to benefit from AI adoption. Let's look at the reasons why KeyBanc has upgraded these semiconductor stocks, which look like no-brainer buys right now. Vinh has increased his price target on AMD from $170 to $195, which points toward 19% gains from current levels. The analyst pointed out that recent supply chain checks found that the demand for AMD's server processors and the newly launched AI-focused accelerators was strong. According to Vinh, AMD's MI300 family of AI accelerators could generate $8 billion in revenue in 2024, a significant jump from the earlier estimate of $3 billion to $4 billion. It is not hard to see why KeyBanc has substantially raised its estimate for AMD's AI chip sales this year. The chipmaker has been aggressively looking to bolster its supply chain so that it can make a dent in the AI chip market. AMD's foundry partner, Taiwan Semiconductor Manufacturing, popularly known as TSMC, is predicted to increase its packaging capacity of advanced chips by 20% in 2024 to 35,000 wafers per month. That would be way higher than the earlier estimates, which put TSMC's monthly advanced chip packaging capacity for 2024 in a range of 14,000 to 16,000 wafers. As a result, AMD should be able to ship a much larger number of AI chips in 2024 considering that it is among TSMC's top customers. Assuming AMD does manage to achieve $8 billion in revenue from AI chip sales, it would easily outpace its current expectation of generating just $2 billion in sales from this market. This could eventually help AMD deliver stronger-than-expected growth in 2024. Analysts are currently anticipating AMD's revenue to increase almost 18% this year to $26.7 billion, followed by a 16% increase in 2025. However, as the above chart shows, analysts have substantially raised their revenue growth expectations for AMD. The latest supply chain checks carried out by KeyBanc suggest that those estimates could move higher as the year progresses and AMD gets more revenue from selling AI chips. For instance, if AMD can indeed get $8 billion in revenue from AI chip sales in 2024 as compared to its original estimate of $2 billion, that additional $6 billion in revenue could help it achieve nearly $33 billion in revenue this year. Based on AMD's current price-to-sales ratio of 11.7, a $33 billion top line could send its market capitalization to $386 billion in a year. That would be a 47% jump from current levels, though don't be surprised to see AMD stock delivering a bigger upside as the market could reward it with a higher sales multiple. Nvidia, for example, has a price-to-sales ratio of over 31. AMD, therefore, is significantly cheaper right now. But that may not be the case for long considering the improving prospects of its AI business. KeyBanc increased its price target on Micron Technology stock to $115 from $100, which would be an impressive 35% jump from the current price. The reason behind this price target upgrade is the lucrative opportunity for Micron in the high-bandwidth memory (HBM) chip market. The demand for HBM is increasing rapidly as it is deployed in AI servers, which are being rolled out rapidly to train large language models (LLMs). According to Foxconn, the AI server market could grow fivefold by 2027, which should positively impact HBM demand as well. Market research firm Gartner predicts that HBM demand could increase eightfold over the next four years because of its ability to provide high data bandwidth, a larger capacity, and reduce power consumption at the same time -- three factors that play a critical role in training LLMs. KeyBanc's supply chain checks have revealed that Micron is all set to ride the HBM wave with some help from Nvidia. The memory specialist is expected to command 70% HBM share in Nvidia's upcoming B100 data center graphics processing units (GPUs). Nvidia's B100 GPU is expected to be manufactured using a more advanced 3 nanometer (nm) process as compared to the 5nm process on which the H100 is based. The new Nvidia chip is expected to be significantly more powerful. A smaller process node means that chips made on it should ideally carry more computing power and reduce power consumption. So, it won't be surprising to see this AI chip witness solid customer demand, and that could eventually help Micron ship more units of its HBM. Moreover, Micron confirmed on its December earnings conference call that its HBM was in the final stages of qualification for multiple Nvidia AI chips. All this explains why the company's top-line growth is set to take off from the current fiscal year, jumping to $22.6 billion from just $15.5 billion in fiscal 2023. Also, as the chart above indicates, Micron's revenue estimates have been raised of late, and the trend could continue as AI-driven adoption of memory increases. With Micron stock currently trading at 5.7 times sales, which is in line with its five-year average sales multiple, investors are getting a good deal on the stock considering the potential growth it is anticipated to deliver. Assuming a similar multiple after two years and $32 billion in revenue, as the chart above indicates, Micron's market cap could hit $182 billion. That would be 95% higher than its current market cap. Investors, therefore, should not miss the opportunity to buy Micron while it trades at a significantly cheaper valuation than Nvidia as it could deliver tremendous upside thanks to AI. Should you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Advanced Micro Devices wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 16, 2024  Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Gartner. The Motley Fool has a disclosure policy. Missed Out on Nvidia? 2 Incredibly Cheap Artificial Intelligence (AI) Stocks to Buy Before They Jump 47% to 95% was originally published by The Motley Fool Related Quotes "
}