{
    "title": "Nvidia: Worth Holding This Stock (NASDAQ:NVDA)",
    "date": "1/5/2024",
    "url": "https://seekingalpha.com/article/4661383-nvidia-worth-holding-this-stock",
    "text": "Justin Sullivan  Justin Sullivan Nvidia Corporation (NASDAQ:NVDA) is undoubtedly valued unappealingly. However, the financials, growth and operations of the company are compelling. Amid concerns of a slowdown in artificial intelligence (\"AI\") growth, I wanted to have a look to see if this was a company worth holding onto or if the elite valuation is too much. Nvidia stock rose 238% in 2023, and the success can be predominantly attributed to its graphics processing units (GPUs), used in multiple industries, including gaming, automotive, healthcare, and AI. To highlight some of the massive success contributing to strong stock returns in 2023, Q3 fiscal 2023 saw revenue jump 206%, powered by a 279% YoY growth in the Data Center division and an 81% YoY growth in the Gaming division. Moving to Q3 2024, the firm's Data Center revenue increased 279% compared to the year before. Contributing significantly to this was the announcement of NVIDIA HGX H200, including a new NVIDIA H200 Tensor Core GPU, a new AI foundry service introduced, and powerful partnerships with Microsoft (MSFT) Azure, Google (GOOG) Cloud Platform, and Oracle (ORCL) Cloud Infrastructure. Nvidia's Gaming revenue increased 81% compared to Q3 fiscal 2023, and the firm released TensorRT-LLM for Windows, speeding up on-device large language model inference, added numerous additions to its GeForce Now cloud gaming platform, and introduced DLSS 3.5 Ray Reconstruction for ray-traced games and apps. The company's Professional Visualization division grew 108% YoY, and the Automotive division had a 4% revenue increase. The firm has been collaborating with other organizations like Mercedes-Benz (OTCPK:MBGAF) and Foxconn (OTCPK:FXCOF) on technological innovations. The firm's revenue has been growing well historically but has recently seen the most improvement, rising 283% since 2019 when accounting for the TTM revenue results: Seeking Alpha Seeking Alpha The company's net income has followed a similar growth story and, in the last year, just like its revenue, has seen the highest growth: Seeking AlphaAuthor, Using Seeking Alpha Seeking Alpha Author, Using Seeking Alpha In addition, I'm looking at a stable balance sheet, with a significant 61.43% of assets being equity, and which has been even stronger historically: GuruFocus GuruFocus The company is extremely well positioned at the moment with massive top and bottom line growth, so I wanted to look at the firm in relation to peers to gauge where it stands on various metrics, in this instance, net income margin. Nvidia has recently overtaken Taiwan Semiconductor (TSM) aka TSMC on its net margin percentage, an incredible feat for the company and boding well for Nvidia investors: Author, Using Seeking Alpha Author, Using Seeking Alpha Comparing the company to the same peers on P/E GAAP metrics presents a different story and a significantly less favorable one for Nvidia shareholders: Author, Using Seeking Alpha Author, Using Seeking Alpha Discarding anomalous Advanced Micro Devices (AMD) P/E ratio of 1,143, Nvidia has the highest valuation. Arguably so due to its phenomenal growth, but I'm not so sure. When comparing the firm to peers on revenue growth rates and margins, the company seems unfairly overvalued. I think TSMC is the more prudent investment, far less overvalued, with exceptionally strong financials. On my further analysis, the concern around Taiwan seems connected so significantly to the whole supply chain that the geopolitical risk associated with TSMC can be applied to all technology stocks and the global economy in general. Author, Using Seeking Alpha Author, Using Seeking Alpha U.S.-China trade tensions and restrictions on chip exports could affect Nvidia's revenue stream, primarily due to the large portion of Data Center revenue coming from China. Competition is on the rise, with most major technology firms involved in AI, and Google, Microsoft, Intel (INTC), and AMD developing native processors. AMD also has a growing presence, recently launching data center GPUs for AI. The firm's dependency on the AI market also makes it a less stable investment when compared to firms like Microsoft, which has developed a more diversified and still growing network of revenue streams at a reasonable stock price. The AI industry witnessed a record number of lawsuits last year. Particularly, artists and writers were arguing that AI used intellectual property without seeking consent. These legal challenges could affect AI revenue growth and significantly affect margins for firms battling in legal disputes of proper use of new technologies. China has also quickly established regulations for artificial intelligence, a significant factor to consider when analyzing how global governance of the systems will play out, affecting core revenue streams like Nvidia's data centers in China and Chinese consumers reliant on Nvidia's AI products. There is also concern over AI's impact on the environment, with recent research showing the large energy consumption of AI models. The carbon footprint related to the technologies may cause a slowdown in investment and increase regulatory scrutiny in the medium term. However, as we are so early on in the incorporation of AI into the marketplace, the high growth period has arguably only just begun. In addition, speculative discussions on existential risk around AI have caused further scrutiny of unhinged growth. Nvidia Corporation is a stock that has grown in an outsized manner relative to peers, particularly in the last year. However, the risks are obvious and need to be accounted for. Too heavy an investment in Nvidia right now could lead to poor returns, in my opinion. I do not think Nvidia Corporation is investable at the moment due to its incredibly high valuation, but as I am already a shareholder, holding onto the stock is a no-brainer. Any short-to-medium-term volatility should be offset by long-term market saturation and returns. Therefore, my analyst rating for Nvidia at present is a Hold. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of NVDA, GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}