{
    "title": null,
    "date": "2/8/2024",
    "url": "https://www.wionews.com/business-economy/wion-business-wrap-uaes-investment-in-india-nvidias-valuation-surge-and-more-688216",
    "text": "WION's Business Desk brings you this daily round up of global stories from the world of business and economy. WION's Business Desk brings you this daily round up of global stories from the world of business and economy. RBI keeps interest rates steady at 6.5pc, revises GDP growth outlook for 2023-24 The Reserve Bank of India (RBI) has opted to maintain the status quo on interest rates, keeping the repo rates unchanged at 6.5 per cent. This decision marks a continuation of the RBI's approach over the past year, where the repo rate has remained at 6.5 per cent since the last increase in February 2023. Read more Nvidia's soaring value nears Amazon amid AI frenzy: Report Nvidia, the AI chipmaker, is on the verge of surpassing Amazon in market value, fuelled by Wall Street's fervour for artificial intelligence. Read more China faces its biggest deflation threat since 2009 as consumer prices plummet China encountered its deepest deflationary threat since 2009 as consumer prices witnessed a severe decline in January, highlighting the persistent challenges for the world's second-largest economy in its struggle for recovery. Read more Mexico surpasses China as top source of US imports amid global economic shifts In a significant economic shift, Mexico has emerged as the leading source of goods imported to the United States, overtaking China for the first time in more than two decades. Read more Uncertainty looms over US treasury market as Fed signals caution In a twist for the fixed-income market, uncertainty is making a comeback after the Federal Reserve's recent statements and robust economic data threw a curveball into expectations. Read more UAE's ADIA unveils ambitious $4-5bn investment plan in India via Gujarat's finance hub The Abu Dhabi Investment Authority (ADIA), the largest sovereign wealth fund in the UAE, is preparing to launch a substantial $4-5 billion fund aimed at investing in India through the tax-neutral finance hub in Gujarat, known as Gujarat International Finance Tec-City (GIFT City). Read more Snap faces investor backlash as ad revenue stumbles against tech giants Meta, Alphabet In a staggering downturn, Snap, the parent company of Snapchat, witnessed a sharp decline of over 32 per cent in its shares on Wednesday, following disappointing fourth-quarter revenue results that fell short of Wall Street expectations. Read more German property market faces bleak outlook as TAG Immobilen warns of 30pc price decline In a stark warning, TAG Immobilen, one of Germany's largest landlords, has forecasted that home prices in the country could plunge as much as 30 per cent below their 2022 peak, portraying a more pessimistic outlook than its counterparts. Read more "
}