{
    "title": null,
    "date": "2/23/2024",
    "url": "https://m.koreatimes.co.kr/pages/article.asp?newsIdx=369391",
    "text": "Copyright@KoreaTimes.co.kr All rights reserved ⓕ font-size Copyright@KoreaTimes.co.kr All rights reserved Dealers work in the trading floor of Hana Bank in Seoul, Friday. Yonhap Korean stocks finished slightly higher Friday as foreign investors bet on local tech shares following AI chip giant Nvidia's strong earnings results. The Korean won lost against the U.S. dollar. The benchmark Korea Composite Stock Price Index gained 3.43 points, or 0.13 percent, to close at 2,667.7, extending its winning streak to two straight sessions. Trade volume was moderate at 409.4 million shares worth 10.1 trillion won ($7.59 billion), with decliners beating gainers 514 to 341. Foreigners purchased a net 148.8 billion won worth of local shares to back up the positive mode, making up for a net sale of 56.1 billion won and 110.2 billion won by institutions and individuals, respectively. Lee Jae-won, an analyst from Shinhan Securities Co., said foreigners focused on Korean semiconductor shares like SK hynix following an overnight U.S. stock rally led by Nvidia. Investors are also paying keen attention to the government's \"value-up\" programs to boost the undervalued shares slated for Monday, he added. Major shares traded in mixed territory. Chipmaker SK hynix was one of the biggest winners, jumping 3.13 percent to a record 161,400 won as it is a key supplier for the U.S. AI chip company Nvidia. Samsung Electronics, the world's No. 1 memory chipmaker, retreated 0.27 percent to 72,900 won. Financial shares were strong, as Hana Financial Group advanced 3.33 percent to 58,900 won and Samsung Fire & Marine Insurance added 2.49 percent to 308,500 won. Major gamemaker NCSoft rose 0.49 percent to 205,000 won, and leading retailer Shinsegae increased 1.09 percent to 185,300 won. Top carmaker Hyundai Motor rose 0.21 percent to 244,000 won, but its sister Kia retreated 0.75 percent to 118,400 won. Leading battery manufacturer LG Energy Solution dropped 1.59 percent to 402,000 won, and top bio firm Samsung Biologics lost 0.73 percent to 814,000 won. The local currency closed at 1,331 won against the greenback, down 2.3 won from the previous session's close. Bond prices, which move inversely to yields, closed lower. The yield on three-year Treasurys rose 3.2 basis points to 3.374 percent, and the return on the benchmark five-year government bonds added 3.9 basis points to 3.430 percent. (Yonhap)  Copyright@KoreaTimes.co.kr All rights reserved "
}