{
    "title": "Nvidia's Future Has More Than Meets the Eye in AI Growth: Morgan Stanley - \nNVIDIA (NASDAQ:NVDA)",
    "date": "2/7/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/36989464/nvidias-future-has-more-than-meets-the-eye-in-ai-growth-morgan-stanley",
    "text": "Morgan Stanley analyst Joseph Moore reiterated an Overweight rating on Nvidia Corp NVDA and increased his price target to $750 from $603. The stock of Nvidia has experienced significant growth from late 2023, demonstrating robust near-term results, the analyst stated. Despite initial concerns about over-earning and order reductions from critical customers, Nvidia’s valuation, entering the year at below 25 times next twelve months (NTM) earnings per share (EPS), has seen few parallels in recent years, Moore noted. Also Read: Nvidia vs. Huawei: The Battle for AI Supremacy Heats Up as Chip Constraints Redirect Focus The apprehensions and the performance of secondary AI entities like Advanced Micro Devices, Inc AMD and Super Micro Computer, Inc SMCI catalyzed a strong January for Nvidia. However, according to the analyst, such a setup is unlikely to recur soon due to potential sustainability concerns after the earnings announcement. In the short term, despite some negative interpretations, numerous indicators suggest exceptional results for Nvidia in the coming quarters, Moore said. The demand for GPU cloud instances remains high, with developers facing long waitlists for model training. This demand extends beyond cloud services to significant investments from governments, enterprise software developers, and consumer internet companies, Moore said. The analyst added that supply chain indicators also predict a considerable exceedance over consensus estimates despite some variability in components for Nvidia cards and systems. Customer delays are attributed more to infrastructural bottlenecks rather than a decline in demand, indicating strong ongoing demand but challenges in rapid ecosystem expansion. Quality issues with a power management chip at one customer will likely be short-term, with shifts in demand expected from H100 to the more advanced B100 product line, as per Moore. Competitively, despite the exploration of alternatives by cloud service providers due to Nvidia chip shortages, Nvidia’s position in training remains dominant. He noted that the inference market might see more competition, but Nvidia will likely continue growing significantly into CY24 and CY25. Moore said the company is raising its estimates for CY24, reflecting confidence in continued strong performance and addressing any potential market consolidation or shifting customer preferences towards Nvidia’s offerings. Moore projects FY24 revenue and EPS of $59.85 billion (versus $54.99 billion) and $11.59 (versus $11.46). Price Action: NVDA shares traded higher by 1.78% at $694.40 on the last check Wednesday. Also Read: TSMC and Samsung Double Down on Home Turf for Advanced Chip Production Amid Global Expansion Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}