{
    "title": "Nvidia smashes records as company's value rises by £232bn in a month - but \nbad news for Tesla",
    "date": "2/2/2024",
    "url": "https://ca.news.yahoo.com/nvidia-smashes-records-companys-value-115900663.html",
    "text": "Nvidia's market value surged by £232.6bn in January - the biggest monthly increase in history. The world's largest chipmaker has become a darling of the stock market because its processors are widely used for artificial intelligence. Nvidia's stock has risen by 31% since the year began, and 190% over the past 12 months - breaching all-time highs on a regular basis. Last month's unprecedented surge leaves Nvidia with a market cap of £1.22trn as investor enthusiasm surrounding AI shows no sign of diminishing. It's now the sixth most valuable company on the planet - comfortably ahead of Facebook owner Meta, and creeping up on Amazon. Microsoft - which has now overtaken Apple as the company with the biggest market cap - also saw its valuation appreciate by £125bn in January. The company surpassed expectations on revenue and earnings per share when it released its latest results earlier this week - buoyed by strong demand for its cloud services. Read more on Sky News:Shares in Meta surge on dividend announcementWhy iPhone sales have slumped in ChinaGuinness owner Diageo hunts for new chairman Other businesses saw sharp retracements in their valuations. Tesla's market cap shrank by £151.6bn - 24% - after Elon Musk warned growth in 2024 will be \"notably lower\" than previous years. This is against a backdrop of aggressive price cutting that has eaten into the electric vehicle manufacturer's profit margins. Saudi Arabian Oil Co has also shed 7.3% of its valuation, the equivalent of £121.5bn. Toronto police say a child was taken to hospital with serious, life-altering injuries after being bitten and dragged by a dog at a waterfront playground on Saturday.Officers were called to Little Norway Park, near Lake Shore Boulevard West and Bathurst Street, at about 10:15 a.m.A news release issued Saturday said a woman was inside the playground area with a dog that was off-leash when a father approached the same area with his child.The dog allegedly \"charged toward\" the child through an open The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news.  The far-right lawmaker’s pic goes under the microscope on social media. MOSCOW (AP) — Four men accused of staging the Russia concert hall attack that killed more than 130 people appeared before a Moscow court Sunday showing signs of severe beatings as they faced formal terrorism charges. One appeared to be barely conscious during the hearing. A court statement said two of the suspects accepted their guilt in the assault after being charged in the preliminary hearing, though the men’s condition raised questions about whether they were speaking freely. There had been Prince Harry and Meghan Markle were not informed about the Princess of Wales cancer diagnosis before the news was made public, according to a new report in The Sunday Times  The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach Italy’s one-euro-home sales have attracted interest in recent few years, but towns like Patrica, located south of Rome, have struggled to offload their empty homes. Affected Stellantis employees were “expected to work from home unless otherwise instructed by your manager.\"  ABC News’ Jonathan Karl took the Florida Republican on a “quick trip down memory lane” with his past comments about the former president. Following the royal mum-of-three’s announcement she is battling cancer, Prince Harry is said to be “devastated” at the news. The former runway model divorced Brady in 2022, spurring speculation.  Cheney slammed McDaniel's explanation for why she didn't \"speak out earlier\" against Donald Trump's call to free Jan. 6 \"hostages.\" Snopes looked for the facts about a young girl who had purportedly once been abandoned in a vacant house in the Russian city of Yaroslavl. The Daily Beast/Getty Images/BBCA controversial British royal commentator is under fire for a “disgusting” tweet ahead of Kate Middleton’s Friday announcement that she has cancer and is undergoing chemotherapy.An hour before the Princess of Wales released the video announcement of her diagnosis, Omid Scobie posted a photo on X, formally known as Twitter, of his alarm clock being set to 6 p.m. GMT. Scobie told The Daily Beast that hearing “there would be an announcement of some kind from the Pala  For days, Donald Trump’s fury over the requirement to secure hundreds of millions of dollars in bond money by Monday has been bubbling behind the scenes and through a steady stream of social media posts. We've long become accustomed to JD hitting tape-measure drives, which is what made this swing so startling. Commentary as expressed by readers of The Fresno Bee.  A 70-year-old woman said starting a simple workout routine transformed her health, helping her balance blood sugar and heal chronic pain. Ukraine's withdrawal under heavy fire in the battle of Avdiivka should be a wake-up call for the US Army, an officer argued. The Australian actor's memoir is set to be released in April. She has claimed it will feature a chapter on a so-far unnamed fellow star's behavior. "
}