{
    "title": "Nvidia is expected to be the best performer in the S&P 500 through 2025, by \nthis measure",
    "date": "2/15/2024",
    "url": "https://www.marketwatch.com/story/nvidia-is-expected-to-be-the-best-performer-in-the-s-p-500-through-2025-by-this-measure-ab6d6b4e",
    "text": "Investors have gotten used to incredible year-over-year comparisons during the past several quarters for Nvidia Corp., which continues to lead the market for graphics-processing units being deployed by data centers to support their corporate clients’ build-out of artificial-intelligence technology. Nvidia \n        NVDA\n       is scheduled to announce results for the fourth quarter of its fiscal 2024 next Wednesday at 5 p.m. Eastern time. The consensus among analysts polled by FactSet is for the company to report quarterly sales of $20.28 billion, up from $6.05 billion a year earlier. A year-over-year comparison of the company’s sales results doesn’t tell the full story. Nvidia’s sales increased rapidly during each of the past three quarters as GPU sales for AI deployment — essentially a new market last year — took off. The quarterly sales number of $20.28 billion expected next week would be a 12% sequential increase from the $18.12 billion during the company’s third quarter of its fiscal 2024, which ended Oct. 29. Nvidia’s soaring sales and profits have set the stage for its shares to more than triple in value over the past year. So an important question for investors now is how long the company can maintain a high pace of growth for sales. To help answer that question, we screened consensus sales estimates among analysts polled by FactSet for the S&P 500 \n        .\n       We used FactSet’s adjusted calendar-year numbers for the estimates, with 2023 as a baseline. So the 2023 numbers are actual for companies whose fiscal years match the calendar and that have already reported their fourth-quarter results. For other companies — about 20% of the S&P 500 — with fiscal years that don’t match the calendar, the 2023 numbers are estimates based mainly on results reported last year. Based on the consensus estimates through calendar 2025, these 20 companies in the S&P 500 are expected to show the highest compound annual growth rates for sales. The sales estimates are in millions. Click on the tickers for more about each company, fund or index. Click here for Tomi Kilgore’s detailed guide to the wealth of information available for free on the MarketWatch quote page. We have included price-to-earnings and price-to-sales figures, based on Feb. 14 closing prices and consensus estimates for calendar 2025. In comparison, the S&P 500 trades for 18.2 times the weighted aggregate consensus estimate for 2025 and 2.5 times the weighted sales estimate for that year. The S&P 500’s expected two-year sales CAGR through 2025, based on the weighted consensus estimates, is 5.3%. So Nividia’s price ratios based on the 2025 estimates are high, but you pay a premium for rapid sales growth. And its price-to-sales ratio is high relative to the price-to-earnings ratio because the company’s marginal profit is so high for the GPUs. Let’s end with a summary of analysts’ opinions of these stocks. Keep in mind that most analysts working for brokerage firms set 12-month price targets, which may be considered a relatively short period for long-term growth investors. An overwhelming percentage of analysts rate Nvidia a buy or the equivalent, but the stock has gotten ahead of the consensus 12-month price target. Maybe even the analysts believe that setting one-year price targets isn’t very helpful for long-term investors. Don’t miss: Want your stock picks to beat index funds? Look at companies with one key metric. Many seniors, worried about  market declines and uncertain healthcare costs, spend far less than they could, advisors say. Philip van Doorn writes the Deep Dive investing column for MarketWatch. Follow him on Twitter @PhilipvanDoorn. Philip van Doorn writes the Deep Dive investing column for MarketWatch. Follow him on Twitter @PhilipvanDoorn. Visit a quote page and your recently viewed tickers will be displayed here. "
}