{
    "title": "As Nvidia’s stock price soars above $788, market sage Rob Arnott has a \nwarning for investors: ‘Disruptors are often disrupted’",
    "date": "2/24/2024",
    "url": "https://fortune.com/2024/02/24/nvidia-stock-target-price-chart-forecast/",
    "text": "For the worlds of finance and tech, Nvidia is now widely viewed an historic pioneer whose time has come, a colossus bound to dominate the artificial intelligence revolution en route to lifting the productivity and profitability of businesses worldwide to new heights. That’s the message underscored by the astounding liftoff that on February 22, following its big-time earnings beat, boosted its market cap in a single day by 16% or $270 billion, and by mid-morning on February 23, added another 2% to hike its valuation to over $2 trillion. Amidst the widespread drumbeat of praise, skeptical voices are few. But we’ve heard many times before that the first mover in a change-the-world thrust forward will maintain its top position far into the future, only to witness the shooting stars get smothered by disruptors lured by the leader’s rich profitability, and the industry’s immense promise. So to get a perspective on the likelihood that Nvidia likely faces that fate, I asked two veterans who’ve seen super-hot innovators rise and fall to provide their take to Fortune. I put the question first to an expert who spans the worlds of academic finance and capital markets. Rob Arnott is founder and chairman of Research Affiliates, a firm that oversees investment strategies for $139 billion in mutual funds and ETFs. Arnott, alongside RA’s CEO Chris Brightman, personally manages Pimco’s $13 billion All Asset Fund. He’s the father of “fundamental indexing,” an approach that weights companies in a portfolio by sales, net worth and other metrics measuring their size in the economy rather than by market cap, so that investors aren’t trapped into putting more and more of their savings into the most expensive stocks. Arnott, who also served as editor-in-chief of the Financial Analysts Journal, oversees a group of PhDs at RA who conduct groundbreaking research, and consults regularly with the top minds at universities and business schools on ideas to refine RA’s playbook. In an email to Fortune, Arnott notes that the notion underpinning Nvidia’s rise, that a single or even a couple of trailblazers that initially rule a new technology will maintain overwhelming leadership and deserve epic valuations, is another in a long series of “big market delusions.” He says that today’s situation mirrors the early days in everything from hand-held devices to personal computers to eCommerce to laying pipes for The Internet. The AI frenzy, he declares, recalls such crazes as “the dot.com bubble in 1999 and EVs in 2021.” For Arnott, when apparent breakthroughs first appeared and attracted strong investor backing you could usually count on three things: “First, an exciting new industry is taking shape. Second, it will show impressive growth in the years ahead and probably change the world. Third, at the start, there’s a handful of companies dominating this exciting new landscape.” So in most cases, the promise eventually paid off. But that doesn’t mean those who led the way greatly profited over the years ahead. “It was usually not true that first, the new technology brought on change nearly as rapid as the markets predicted,” he says. “And second, it was often not true that these will be the dominant players 5 or 10 or even 20 years in the future.” Most of all, he adds, it’s wrong to think that “We can pay any price because these companies can achieve stupendous profits in due course. That’s usually not true.” Arnott describes the herd mentality that’s so swelled Nvidia’s stock price as “the classic nature of bubbles. Disruptors change the world in wonderful ways, but they cannot succeed unless their customers are succeeding even more than they are, and disruptors are often themselves disrupted.” He points to Palm, dominant in handheld technology in 2000 losing out to BlackBerry in 2003, then BlackBerry losing to Apple’s iPhone in 2008. Arnott’s point is that competition eventually drives down a new industry’s initially sterling profitability. The chief beneficiaries are the customers that bank big productivity gains from advances in software or online advertising algorithms, and the sectors’ enduring champs are the players that keep innovating so that their products help customers work faster, better and cheaper. Read more: As Nvidia surge echoes Tesla rally of 2020, investors wonder if AI will see slowdown like the one hitting EVs: ‘Logic takes a backseat’ Arnott agrees that fast-growers such as Nvidia deserve “premium valuations.” But he argues that Nvidia’s market cap is far, far too high versus the dollars it now generates in earnings. In his view, the risk Nvidia will follow so many others that have fallen from glory is much too great to justify its current PE (now at nearly 70). “Nvidia’s priced for perfection,” he says. “Its valuation leaves no room for shocks. Never short-sell bubble stocks when they’re on a roll. But you don’t have to own them, either.” Jack Ciesielski, former author of the Analyst’s Accounting Observer, has long been one of the most astute commentators on trends in the financial markets. And he agrees with Arnott that the same forces that hammered the early winners in other great leaps forward could well stymie Nvidia. “Remember what happened in word processing and early PCs,” he says. “First, you had the likes of WordPerfect, Ami Pro and Lotus, along with Commodore, Radio Shack and Eagle. But they lost, and the prizes went to Apple and Microsoft. It was the same in the early days of The Internet. The companies that laid the cable such as UUNET and Lucent got big valuations, and are no longer with us. But those that thrived turned out to be the Amazons, Googles and companies that used the pipes.” Ciesielski observes that, “It’s not the first movers who usually win, it’s the second movers” who follow on with better strategies for winning customers and hatching the best new products. Plus, Nvidia is far from alone right now in minting AI software. Today, AMD and Intel are rolling out their own AI chips. As Arnott and Ciesielski both note, Nvidia’s created a rage that all the software giants want ardently to join. Its takeoff is luring a herd of competitors set on winning their places as the princes or kings of AI. By attracting an onslaught, Nvidia’s sorcerous success may be planting the seeds of its decline. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}