{
    "title": "The Bull Case for NVDA Stock: How Nvidia Could Be Worth $1,600 by 2027",
    "date": "2/13/2024",
    "url": "https://finance.yahoo.com/news/bull-case-nvda-stock-nvidia-201349367.html",
    "text": "From a quantitative standpoint, shares of Nvidia (NASDAQ:NVDA) are a strong sell. The company scores an F in the MarketMasterAI stock-picking system, and my most recent February algorithm update only gives NVDA stock 3.5% upside over the next six months. Companies historically sell off after enormous run-ups, and Nvidia’s 400% rise since 2021 lands it squarely in that camp. Super-normal profits, after all, tend to attract unwanted competition. But Nvidia is not a normal company. The company has a commanding first-mover advantage in AI accelerator chips, a product that’s seen insatiable demand from cloud computing providers. The Silicon Valley-based firm has been lucky; Nvidia’s decision to remain a fabless producer (i.e. outsourcing production to others) only worked because its primary partner Taiwan Semiconductor Manufacturing Company (NYSE:TSM) proved to be so capable. And Nvidia’s management had the uncommon foresight to keep its GPU software proprietary, essentially locking in developers. Together, that’s created a computing behemoth that even the best quantitative algorithms cannot fully comprehend. A bull case for a $1,600 price target for Nvidia is emerging. And here’s why it can realistically happen. InvestorPlace - Stock Market News, Stock Advice & Trading Tips In the mid-2000s, Nvidia began developing CUDA, a software platform designed to run multiple processors in parallel. The goal was to create a solution for general computing on graphic processing units (GPUs) — essentially a way for ordinary programs to interact with these new chips. These efforts were wildly successful. Since then, CUDA has become the standard software for everything from computer games to AI training. The ecosystem includes entire libraries, optimizing tools, a compiler, and a runtime library to deploy applications. MarketMasterAI uses these tools to run on Nvidia’s GPUs. Meanwhile, the business side of CUDA has been even more notable. The system remains a closed-source platform, creating a lock-in effect to Nvidia’s GPUs. Any code optimized for Nvidia’s products must be rewritten to run on other systems. That’s created a formidable barrier to entry. Data centers running on Nvidia’s GPUs have high switching costs to move systems. Even if Advanced Micro Devices (NASDAQ:AMD) or Intel (NASDAQ:INTC) develops a strong competitor to Nvidia’s H100, the costs of moving to AMD’s ROCm platform will dissuade many from making the switch. In other words, Nvidia’s GPUs will remain the gold standard for AI model training for the foreseeable future. These facts are virtually impossible for quantitative systems to detect. All an algorithm sees is a company whose growth is expected to slow in the coming years; Wall Street expects Nvidia’s net profit growth to slow to 70% in 2025 and then decline to 17.5% in 2026. But the economics are clear: Nvidia’s fabless business model and high lock-in effects create immense profits from a tiny capital base. Analysts estimate the chipmaker’s returns on capital invested (ROIC) will expand from 100% today to 185% by 2026, helping Nvidia generate $66 billion of annual free cash flow. Even if Nvidia’s ROIC falls a third by 2046, a 3-stage discounted cash flow (DCF) model still values Nvidia at $1,600 a share, 140% upside. As analysts at Morningstar note, “Nvidia dominates AI today and the sky is the limit for the company’s profitability if it can maintain this lead over the next decade.” However, Nvidia’s $1,600 price target comes with significant risks. Competition. The greatest concern is that one (or more) competitor releases a solid alternative to Nvidia and its CUDA software. We’re already seeing some strong contenders. In December, AMD launched the MI300, a 3D chip that supposedly runs 20%-40% faster than Nvidia’s flagship H100s. Intel could soon launch rival systems of its own. Growth. Nvidia has faced unexpectedly stiff challengers in autonomous driving from Qualcomm (NASDAQ:QCOM) and others. Automakers have also been wary of locking themselves into a single computing standard. That means most of Nvidia’s growth will come from AI training — leaving all its eggs in a single basket. Cyclical Demand. Data centers and gaming are historically boom-bust industries, with years of super-normal growth punctuated by sudden slowdowns. Though Nvidia’s asset-light model protects the company from financial issues, the sudden evaporation of demand will set the firm’s profits back several years. Together, that means Nvidia’s free cash flow could decline from 2027 onwards. Companies like Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL), Microsoft (NASDAQ:MSFT) and Amazon (NASDAQ:AMZN) plan to launch in-house GPUs in the coming years, and merely the threat of these new entrants could force Nvidia to reduce prices and accept lower margins. Re-running a 3-stage DCF model with more conservative assumptions reduces its fair value to $320. (This assumes ROIC drops to 28% and growth to 3.3% by 2047). Nvidia’s $1,600 price target also assumes that the company will be able to achieve 21% average growth through 2046 and maintain high returns on capital. This will become increasingly difficult as cloud computing demand shifts from building new AI capacity to replacing existing servers. We’re already seeing the limits to Nvidia’s growth. In 2023, the firm returned $9.6 billion of its cash to investors after finding nowhere else to invest it. And only time will tell whether this is the start of a more worrying trend. The problem with valuing a company like Nvidia is that most of its cash flows are far into the future. Only 8% of Nvidia’s current market capitalization is explained by cash flow over the next three years, while the next 20 years explain 33% of Nvidia’s value. The remaining 63% of Nvdia’s value sits beyond 2046. By comparison, cash-generating Qualcomm will justify almost 20% of its value in the next 3 years. That means tiny changes in today’s assumptions will have outsized impacts on Nvidia’s justified value. Increasing growth rates by just 1% annually from 2027 onwards raises Nvidia’s fair value by 14.5%, all else equal. Shrinking growth by 1% cuts 12.2% from its market capitalization… more than the entire market capitalization of Intel. That makes an investment in Nvidia riskier than people might expect… which is why MarketMasterAI could be right about the company’s chances over the next six months. Nevertheless, Nvidia has surprised investors before. The company remains the only notable player in AI training. And if its competitors fail to launch compelling alternatives, investors can expect Nvidia to keep rising from here. After all, the sky’s the limit when it comes to AI. On the date of publication, Thomas Yeung held a LONG position in GOOG and GOOGL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Tom Yeung is a market analyst and portfolio manager of the Omnia Portfolio, the highest-tier subscription at InvestorPlace. He is the former editor of Tom Yeung’s Profit & Protection, a free e-letter about investing to profit in good times and protecting gains during the bad. The #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The post The Bull Case for NVDA Stock: How Nvidia Could Be Worth $1,600 by 2027 appeared first on InvestorPlace. Related Quotes "
}