{
    "title": "Is Super Micro Computer a Better AI Stock than Nvidia?",
    "date": "3/1/2024",
    "url": "https://www.fool.com/investing/2024/03/01/is-super-micro-computer-a-better-ai-stock-than-nvi/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Since the calendar flipped to 2024, there have been few stocks better than Super Micro Computer (SMCI 0.12%). The stock nearly tripled over two months, and its performance since the start of 2023 has also been impressive, rising around 900% in total. In that time, few companies come close to matching the performance of Super Micro Computer (often called Supermicro), including artificial intelligence (AI) powerhouse Nvidia (NVDA 3.12%). But does that make Supermicro a better AI stock than Nvidia? Using the term \"better\" when comparing stocks is too broad to be analytically useful. It can mean comparing past performance, future prospects, or the underlying business. I'll look at all three factors to determine if Supermicro is better than Nvidia. Even though Nvidia is a strong performer, Supermicro's stock rise since 2023 blows Nvidia out of the water. So if we're talking about past performance, Supermicro takes the cake. Knowing this tidbit of information doesn't do you much good unless you have a time machine, though. Instead, I'll focus on the underlying business and potential future stock performance. Supermicro and Nvidia are closely tied. Both companies benefited from the rise of AI through their primary product lines. While Nvidia makes top-notch graphics processing units (GPUs) that are used to power AI workloads, Supermicro makes the servers that these GPUs go into to be efficiently used. While some of the larger tech firms have staff to help design the computing architecture, many do not. So smaller companies use Supermicro's highly customizable servers to meet their computing needs. This makes me prefer Nvidia, as it controls the more desirable product. With Nvidia's GPUs in a class of their own in terms of AI computing power, customers have few choices to turn to if they want something different. Supermicro has competitors like Hewlett-Packard and IBM, so Nvidia's path to success is a little clearer. Additionally, this allows Nvidia to have more control over its pricing, which plays out in its margin profile.  SMCI Gross Profit Margin (Quarterly) data by YCharts With Nvidia's gross profit and net income margin much higher than Supermicro's, it can absorb pricing changes without fully losing profitability. This alone makes me prefer Nvidia to Supermicro. But what about future prospects? Regarding valuation, Nvidia is cheaper than Supermicro despite its better business position.  SMCI PE Ratio (Forward) data by YCharts One area in which Supermicro will pass Nvidia is its revenue growth rate. Although Nvidia expects an impressive 234% growth rate in Q1 FY 2025, this will soon slow. After Q1, Nvidia starts to overlap quarters where GPU demand was incredibly high, so its growth rate will slow even though the company is still doing well. However, Supermicro's growth is just starting to reach these levels, as its growth projections for Q3 FY 2024 (ending March 31) are anywhere from 188% to 219%. But even though Supermicro's growth rate is starting to accelerate, it doesn't mean it's a cheap stock -- especially when we utilize its forward price-to-earnings (P/E) ratio, which considers analyst growth projections. So while Supermicro will continue to put up flashy numbers, I think Nvidia is the better buy here. With the stock being cheaper and having a stronger underlying business model, it's still the king of AI investments. That's not to say Supermicro is a bad company; it's that the stock has gotten too expensive for what it is. Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool recommends International Business Machines and Super Micro Computer. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}