{
    "title": null,
    "date": "1/10/2024",
    "url": "https://theprint.in/economy/nvidia-partnering-with-india-inc-to-set-up-ai-data-centres-in-india/1918047/",
    "text": "Ahmedabad (Gujarat) [India], January 10 (ANI): US chipmaker and technology company Nvidia is partnering with India’s leading business groups to set up state-of-the-art AI data centre facilities here in India, said the multinational company’s Senior Vice President, Enterprise Business, Shankar Trivedi.\n\n\n\n“I’m delighted to tell you that we are partnering with all of India’s leading business groups… to set up state-of-the-art AI data centre facilities and provision them here in India,” said Trivedi, speaking at the 10th edition of the Vibrant Gujarat Global Summit on Wednesday.\n\n\r\n\t\t\t\t\tShow Full Article Ahmedabad (Gujarat) [India], January 10 (ANI): US chipmaker and technology company Nvidia is partnering with India’s leading business groups to set up state-of-the-art AI data centre facilities here in India, said the multinational company’s Senior Vice President, Enterprise Business, Shankar Trivedi.  “I’m delighted to tell you that we are partnering with all of India’s leading business groups… to set up state-of-the-art AI data centre facilities and provision them here in India,” said Trivedi, speaking at the 10th edition of the Vibrant Gujarat Global Summit on Wednesday.\n\n\r\n\t\t\t\t\tShow Full Article “I’m delighted to tell you that we are partnering with all of India’s leading business groups… to set up state-of-the-art AI data centre facilities and provision them here in India,” said Trivedi, speaking at the 10th edition of the Vibrant Gujarat Global Summit on Wednesday.  He outlined three specific things that NVIDIA has actioned over the last few months — skill development, partnering with India Inc, and ‘Make in India’.\n\n“We are very strong supporters of Make in India, Make in India for India and Make in India for the world,” he said.\n\n“We are now most willing, keen and eager to partner with universities and technical institutions here in Gujarat and elsewhere in India to deliver this compelling content to the thousands of developers in India. India has scale. India has talent, India has amazing data, India has a unique culture.”\n\nRegarding production here in India, he asserted, “Our partners… are actually already making state-of-the-art AI hardware for consumption here in India and elsewhere in the world. And we are working strongly with partners both in the upstream semiconductor and ecosystems.”\n\nSpeaking of generative AI, he said the technology is going to change “the way we work, the way we do business, the way we govern, and the way we live.”\n\n“Just like the internet started 30 years ago and the mobile revolution starting 25 years ago, the generative AI revolution will also do the same,” he added.\n\nIndia hopes to become a major global hub in semiconductor manufacturing over the next decade.\n\nThe semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.\n\nVarious states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. He outlined three specific things that NVIDIA has actioned over the last few months — skill development, partnering with India Inc, and ‘Make in India’.  “We are very strong supporters of Make in India, Make in India for India and Make in India for the world,” he said.\n\n“We are now most willing, keen and eager to partner with universities and technical institutions here in Gujarat and elsewhere in India to deliver this compelling content to the thousands of developers in India. India has scale. India has talent, India has amazing data, India has a unique culture.”\n\nRegarding production here in India, he asserted, “Our partners… are actually already making state-of-the-art AI hardware for consumption here in India and elsewhere in the world. And we are working strongly with partners both in the upstream semiconductor and ecosystems.”\n\nSpeaking of generative AI, he said the technology is going to change “the way we work, the way we do business, the way we govern, and the way we live.”\n\n“Just like the internet started 30 years ago and the mobile revolution starting 25 years ago, the generative AI revolution will also do the same,” he added.\n\nIndia hopes to become a major global hub in semiconductor manufacturing over the next decade.\n\nThe semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.\n\nVarious states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. “We are very strong supporters of Make in India, Make in India for India and Make in India for the world,” he said.  “We are now most willing, keen and eager to partner with universities and technical institutions here in Gujarat and elsewhere in India to deliver this compelling content to the thousands of developers in India. India has scale. India has talent, India has amazing data, India has a unique culture.”\n\nRegarding production here in India, he asserted, “Our partners… are actually already making state-of-the-art AI hardware for consumption here in India and elsewhere in the world. And we are working strongly with partners both in the upstream semiconductor and ecosystems.”\n\nSpeaking of generative AI, he said the technology is going to change “the way we work, the way we do business, the way we govern, and the way we live.”\n\n“Just like the internet started 30 years ago and the mobile revolution starting 25 years ago, the generative AI revolution will also do the same,” he added.\n\nIndia hopes to become a major global hub in semiconductor manufacturing over the next decade.\n\nThe semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.\n\nVarious states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. “We are now most willing, keen and eager to partner with universities and technical institutions here in Gujarat and elsewhere in India to deliver this compelling content to the thousands of developers in India. India has scale. India has talent, India has amazing data, India has a unique culture.”  Regarding production here in India, he asserted, “Our partners… are actually already making state-of-the-art AI hardware for consumption here in India and elsewhere in the world. And we are working strongly with partners both in the upstream semiconductor and ecosystems.”\n\nSpeaking of generative AI, he said the technology is going to change “the way we work, the way we do business, the way we govern, and the way we live.”\n\n“Just like the internet started 30 years ago and the mobile revolution starting 25 years ago, the generative AI revolution will also do the same,” he added.\n\nIndia hopes to become a major global hub in semiconductor manufacturing over the next decade.\n\nThe semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.\n\nVarious states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. Regarding production here in India, he asserted, “Our partners… are actually already making state-of-the-art AI hardware for consumption here in India and elsewhere in the world. And we are working strongly with partners both in the upstream semiconductor and ecosystems.”  Speaking of generative AI, he said the technology is going to change “the way we work, the way we do business, the way we govern, and the way we live.”\n\n“Just like the internet started 30 years ago and the mobile revolution starting 25 years ago, the generative AI revolution will also do the same,” he added.\n\nIndia hopes to become a major global hub in semiconductor manufacturing over the next decade.\n\nThe semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.\n\nVarious states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. Speaking of generative AI, he said the technology is going to change “the way we work, the way we do business, the way we govern, and the way we live.”  “Just like the internet started 30 years ago and the mobile revolution starting 25 years ago, the generative AI revolution will also do the same,” he added.\n\nIndia hopes to become a major global hub in semiconductor manufacturing over the next decade.\n\nThe semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.\n\nVarious states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. “Just like the internet started 30 years ago and the mobile revolution starting 25 years ago, the generative AI revolution will also do the same,” he added.  India hopes to become a major global hub in semiconductor manufacturing over the next decade.\n\nThe semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.\n\nVarious states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. India hopes to become a major global hub in semiconductor manufacturing over the next decade.  The semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.\n\nVarious states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. The semiconductor industry in India is still in a nascent stage, and the central government has been aggressively looking at collaboration with global and domestic players to make further inroads in this crucial sector.  Various states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)\n\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. Various states in India are coming up with their dedicated semiconductor policies to attract both global and domestic businesses. (ANI)  This report is auto-generated from ANI news service. ThePrint holds no responsibility for its content. This report is auto-generated from ANI news service. ThePrint holds no responsibility for its content.   Subscribe to our channels on YouTube, Telegram & WhatsApp Support Our Journalism India needs fair, non-hyphenated and questioning journalism, packed with on-ground reporting. ThePrint – with exceptional reporters, columnists and editors – is doing just that. Sustaining this needs support from wonderful readers like you. Whether you live in India or overseas, you can take a paid subscription by clicking here. Support Our Journalism Save my name, email, and website in this browser for the next time I comment.  Δ Required fields are marked *  Name * Email *  Δ Copyright © 2024 Printline Media Pvt. Ltd. All rights reserved. "
}