{
    "title": null,
    "date": "1/9/2024",
    "url": "https://www.fool.com/investing/2024/01/09/is-it-too-late-to-buy-nvidia-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The stock market has gotten off to a shaky start in 2024 as investors seem to be focused on booking profits following last year's tremendous surge. Wall Street is probably awaiting concrete signs from the Federal Reserve about when interest rates could start falling, which may be the reason why investors have kept a check on their bullishness in the new year so far. The tech-heavy Nasdaq-100 Technology Sector index is down almost 5% in 2024 already. The negative start has also weighed on Nvidia (NVDA 3.12%), a stock that set the market on fire last year as it more than tripled thanks to its artificial intelligence (AI) chops. Savvy investors may be wondering if any potential pullback could pose a buying opportunity, but it is worth noting that shares of Nvidia are still up 230% in the past year despite a shaky start to 2024. So, should investors wait for Nvidia stock to decline further before initiating a long position? Or should they buy it right away, considering that its AI-powered growth could help the stock regain its mojo? Let's find out. Nvidia stock may seem expensive at first, given that it trades at 26 times sales and 63 times trailing earnings. But a more appealing picture emerges when we put the valuation in the context of the company's growth. Nvidia's fiscal 2023, which ended in January 2023, was a tepid one as the company finished the year with a flat top line at $27 billion. Its adjusted earnings fell 25% year over year during the quarter to $3.34 per share. By comparison, Nvidia is expected to finish the current fiscal year with $59 billion in revenue. It has generated $39 billion of top-line sales in the first nine months of fiscal 2024 and has guided for $20 billion in fiscal fourth-quarter revenue. That would be a 118% year-over-year increase in Nvidia's top line. At the same time, analysts are expecting the company's earnings to jump to a whopping $12.30 per share in fiscal 2024, a 268% increase over the previous year. Given the impressive growth that Nvidia is anticipated to clock, its forward-looking multiples are significantly cheaper than the trailing ones.  NVDA PS Ratio (Forward 1y) data by YCharts It is also worth noting that the company's price/earnings-to-growth ratio (PEG ratio), which is a forward-looking metric that considers a company's potential growth, is now at mouthwatering levels.  NVDA PEG Ratio data by YCharts The PEG ratio is calculated by dividing a company's price-to-earnings ratio by its expected growth. A reading of 1 means that a stock is fairly valued, while a reading below that suggests that the stock is undervalued. Nvidia's PEG ratio, as evident in the chart above, indicates that the stock is deeply undervalued, considering the growth it is anticipated to deliver. That's why growth investors are getting a solid deal on Nvidia stock right now, and they may not want to miss this opportunity, considering how fast the market for AI-focused graphics processing units (GPUs) is anticipated to grow in 2024 and beyond. UBS analysts are expecting the AI market to generate a whopping $420 billion in annual revenue in 2027, up significantly from the prior forecast of $300 billion. That translates into a massive compound annual growth rate (CAGR) of 72% until 2027. UBS expects the market for GPUs and AI chips to clock an outstanding annual growth rate of 60% during the forecast period, growing from $16 billion in 2022 to a whopping $165 billion in 2027. This is a big reason to buy Nvidia stock straightaway, considering its massive share of the AI chip market, which reportedly stands at more than 80%. Not surprisingly, Nvidia seems to be in a solid position to maintain its solid growth momentum. As time goes by, analysts keep boosting their financial targets for Nvidia:  NVDA Revenue Estimates for Next Fiscal Year data by YCharts Meanwhile, another Wall Street analyst believes that AI could supercharge Nvidia's business in an unprecedented manner. Analyst Vijay Rakesh of Japanese investment bank Mizuho predicts that Nvidia's AI-related top line could jump to a whopping $300 billion in 2027. While that seems like a steep target, it won't be surprising to see Nvidia getting close to that mark. Investors should note that the company's three-year revenue CAGR from fiscal 2023 (when it reported annual revenue of $27 billion) to fiscal 2026 (when it is expected to report $109 billion in revenue) stands at an impressive 59%. A growth rate of even 30% in fiscal years 2027 and 2028 (which will coincide with 11 months of calendar year 2027) would send Nvidia's revenue to $184 billion in fiscal 2028 (using fiscal 2026 revenue of $109 billion as the base). Nvidia has a five-year average sales multiple of 20. Assuming it trades at a discounted 15 times earnings after five years and hits $184 billion in revenue, the company's market cap could jump to $2.76 trillion. That would be a 128% gain from current levels, which is why Nvidia remains a solid bet for investors looking to buy an AI stock right now. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}