{
    "title": "Nvidia adds record $277 billion in stock market value",
    "date": "2/26/2024",
    "url": "https://www.business-reporter.co.uk/news/nvidia-adds-record-277-billion-in-stock-market-value-9994",
    "text": "By Noel Randewich and Medha Singh  (Reuters) - Nvidia added $277 billion in stock market value on Thursday, Wall Street’s largest one-day gain in history after the heavyweight chipmaker’s quarterly report beat expectations and reignited a rally fueled by optimism about artificial intelligence.  The company’s stock soared 16.4% to close at $785.38, a record-high close, lifting its market capitalization to $1.96 trillion after its January-quarter report late on Wednesday showed demand for its specialized chips used in AI computing continued to outpace analysts’ already-high expectations.  The Santa Clara, California-based company’s results fed new fuel to a global rally in technology stocks linked to AI, propelling the S&P 500, Europe’s STOXX 600 and Japan’s Nikkei share average to record highs.  Traders exchanged $65 billion worth of Nvidia’s shares on Thursday, accounting for almost a fifth all trading in S&P 500 stocks.  Nvidia’s one-day increase in stock market value was the largest in Wall Street’s history, easily beating a record $196 billion gain by Meta Platforms on Feb. 2 after the Facebook parent declared its first dividend and posted robust results.  The rise in Nvidia’s market value on Thursday eclipsed the entire value of Coca-Cola, at $265 billion. Its gain made Nvidia the U.S. stock market’s third-most valuable company, pulling ahead of Amazon.com and Alphabet after jockeying with the two tech powerhouses in recent weeks.  Microsoft and Apple, valued at $3.06 trillion and $2.85 trillion, respectively, are Wall Street’s two most valuable companies.  Nvidia’s stock has now climbed 58% in 2024, accounting for more than a quarter of the S&P 500’s increase year-to-date. That makes Nvidia’s outlook crucial not just for direct shareholders, but for owners of index funds widely held in retirement savings accounts.  \"The people who made the most money in the gold rush of the mid-1800s were the ones providing the tools to get the job done, not those hunting for the precious metal,\" said Russ Mould, investment director at AJ Bell.  \"Nvidia is effectively playing the same role today in this tech revolution.\"  Soaring demand for Nvidia’s chips used by companies rushing to upgrade their AI offerings helped the Silicon Valley firm forecast a whopping 233% growth in current-quarter revenue, above market expectations of a 208% rise.  Other chipmakers exposed to AI also rallied, with Advanced Micro Devices jumping about 11% and Broadcom adding 6.3%. The Philadelphia chip index rallied 4.97% to a record high in its biggest one-day gain since May 2023.  The S&P 500 surged 2.11% to a record high, and the Nasdaq jumped nearly 3%, leaving it just short of its first record-high close since November 2021.  Super Micro Computer, which sells AI-related server equipment, jumped over 30%, bringing its gain this year to over 240%.  Nvidia, which controls about 80% of the high-end AI chip market, reported fourth-quarter revenue jump of more than threefold from a year ago to $22.10 billion.  Some analysts, however, worried that U.S. curbs on chips sales to China may be hurting its revenue growth.  Sales in China amounted to about 9% of Nvidia’s fourth-quarter sales, down from 22% in the prior quarter.  Rapid increases in analysts’ financial estimates mean Nvidia’s forward earnings valuation has fallen, even after its stock more than tripled last year. Ahead of Nvidia’s report, it was valued at about 30 times expected earnings, down from 49 times a year before, according to LSEG data.  Still, many investors worry about the rapid pace of Nvidia’s gains.  \"We’ve gotten well ahead of expectations and baked in a lot for the next three years,\" said Paul Nolte, senior wealth adviser and market strategist at Murphy & Sylvest.  At least 17 brokerages raised their price targets after results. Among the most bullish, Rosenblatt Securities raised its price target to $1,400 from $1,100, implying a $3.5 trillion stock market value.  UBS cut its price target to $800 from $850, reflecting \"some potential slowing in revenue growth.\"  Short sellers betting Nvidia’s stock would fall rushed to close those trades on Thursday, said Ihor Dusaniwsky, managing director of predictive analytics at S3 Partners.  Short sellers had lost over $2 billion on paper, taking their declines to more than $6.8 billion so far this year, Dusaniwsky said.  (Reporting by Noel Randewich in Oakland, California, and Medha Singh and Amruta Khandekar in BengaluruEditing by Arun Koyyur and Matthew Lewis) © 2023, Lyonsdown Limited. Business Reporter® is a registered trademark of Lyonsdown Ltd. VAT registration number: 830519543 Join the Business Reporter community today and get access to all our newsletters, and our full library of talk show episodes Join the Business Reporter community today and get access to all our newsletters, and our full library of talk show episodes "
}