{
    "title": "Institutional investors have a lot riding on NVIDIA Corporation \n(NASDAQ:NVDA) with 67% ownership",
    "date": "2/5/2024",
    "url": "https://ca.finance.yahoo.com/news/institutional-investors-lot-riding-nvidia-120013447.html",
    "text": "Shares of AMD and Intel fall in pre-market trading after reports China will phase out their chips and servers Institutions' substantial holdings in NVIDIA implies that they have significant influence over the company's share price 44% of the business is held by the top 25 shareholders Insiders have been selling lately A look at the shareholders of NVIDIA Corporation (NASDAQ:NVDA) can tell us which group is most powerful. With 67% stake, institutions possess the maximum shares in the company. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn). And as as result, institutional investors reaped the most rewards after the company's stock price gained 5.9% last week. The gains from last week would have further boosted the one-year return to shareholders which currently stand at 214%. In the chart below, we zoom in on the different ownership groups of NVIDIA. Check out our latest analysis for NVIDIA Institutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing. As you can see, institutional investors have a fair amount of stake in NVIDIA. This implies the analysts working for those institutions have looked at the stock and they like it. But just like anyone else, they could be wrong. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at NVIDIA's earnings history below. Of course, the future is what really matters. Institutional investors own over 50% of the company, so together than can probably strongly influence board decisions. NVIDIA is not owned by hedge funds. The Vanguard Group, Inc. is currently the company's largest shareholder with 8.2% of shares outstanding. BlackRock, Inc. is the second largest shareholder owning 7.3% of common stock, and FMR LLC holds about 5.0% of the company stock. In addition, we found that Jen-Hsun Huang, the CEO has 3.5% of the shares allocated to their name. Our studies suggest that the top 25 shareholders collectively control less than half of the company's shares, meaning that the company's shares are widely disseminated and there is no dominant shareholder. Researching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments. Quite a few analysts cover the stock, so you could look into forecast growth quite easily. The definition of company insiders can be subjective and does vary between jurisdictions. Our data reflects individual insiders, capturing board members at the very least. Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO. Insider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances. We can report that insiders do own shares in NVIDIA Corporation. Insiders own US$65b worth of shares (at current prices). It is good to see this level of investment. You can check here to see if those insiders have been buying recently. The general public, who are usually individual investors, hold a 29% stake in NVIDIA. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders. It's always worth thinking about the different groups who own shares in a company. But to understand NVIDIA better, we need to consider many other factors. For instance, we've identified   1 warning sign for NVIDIA  that you should be aware of. But ultimately  it is the future, not the past, that will determine how well the owners of this business will do. Therefore we think it advisable to take a look at this free report showing whether analysts are predicting a brighter future. NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Toronto police say a child was taken to hospital with serious, life-altering injuries after being bitten and dragged by a dog at a waterfront playground on Saturday.Officers were called to Little Norway Park, near Lake Shore Boulevard West and Bathurst Street, at about 10:15 a.m.A news release issued Saturday said a woman was inside the playground area with a dog that was off-leash when a father approached the same area with his child.The dog allegedly \"charged toward\" the child through an open The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news.  The far-right lawmaker’s pic goes under the microscope on social media. MOSCOW (AP) — Four men accused of staging the Russia concert hall attack that killed more than 130 people appeared before a Moscow court Sunday showing signs of severe beatings as they faced formal terrorism charges. One appeared to be barely conscious during the hearing. A court statement said two of the suspects accepted their guilt in the assault after being charged in the preliminary hearing, though the men’s condition raised questions about whether they were speaking freely. There had been Prince Harry and Meghan Markle were not informed about the Princess of Wales cancer diagnosis before the news was made public, according to a new report in The Sunday Times  The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach Italy’s one-euro-home sales have attracted interest in recent few years, but towns like Patrica, located south of Rome, have struggled to offload their empty homes. Affected Stellantis employees were “expected to work from home unless otherwise instructed by your manager.\" For the first time, HKTB’s annual platform aims to entice visitors to a huge range of waterfront art fairs, exhibitions and events hosted both in... ABC News’ Jonathan Karl took the Florida Republican on a “quick trip down memory lane” with his past comments about the former president. The former runway model divorced Brady in 2022, spurring speculation. Cheney slammed McDaniel's explanation for why she didn't \"speak out earlier\" against Donald Trump's call to free Jan. 6 \"hostages.\"  Snopes looked for the facts about a young girl who had purportedly once been abandoned in a vacant house in the Russian city of Yaroslavl. The Daily Beast/Getty Images/BBCA controversial British royal commentator is under fire for a “disgusting” tweet ahead of Kate Middleton’s Friday announcement that she has cancer and is undergoing chemotherapy.An hour before the Princess of Wales released the video announcement of her diagnosis, Omid Scobie posted a photo on X, formally known as Twitter, of his alarm clock being set to 6 p.m. GMT. Scobie told The Daily Beast that hearing “there would be an announcement of some kind from the Pala For days, Donald Trump’s fury over the requirement to secure hundreds of millions of dollars in bond money by Monday has been bubbling behind the scenes and through a steady stream of social media posts.  We've long become accustomed to JD hitting tape-measure drives, which is what made this swing so startling. Commentary as expressed by readers of The Fresno Bee. A 70-year-old woman said starting a simple workout routine transformed her health, helping her balance blood sugar and heal chronic pain. Trade 24 hours a day on the world's most popular platform. Ukraine's withdrawal under heavy fire in the battle of Avdiivka should be a wake-up call for the US Army, an officer argued. The Australian actor's memoir is set to be released in April. She has claimed it will feature a chapter on a so-far unnamed fellow star's behavior. Neal Katyal also predicted what will occur on Monday as Trump reaches the deadline to post nearly half a billion dollars in bond. "
}