{
    "title": "Where Will Nvidia Stock Be in 10 Years?",
    "date": "2/15/2024",
    "url": "https://www.fool.com/investing/2024/02/15/where-will-nvidia-stock-be-in-10-years/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Predicting where any company will be 10 years in the future isn't an easy task. A decade ago, there were no companies with $1 trillion market caps -- the largest came in at around $500 billion. Now, there are six companies with 13-digit valuations in the U.S. Predicting a company's future becomes even more difficult when it's involved with an explosive trend such as artificial intelligence (AI). While there may be a risk of a bubble forming, significant business results disprove that view. Nvidia (NVDA 3.12%) is at the forefront of this discussion, as its products are critical in this area. However, the company saw a dramatic rise in its stock price, and there's now a lot of optimism baked into it. So where will Nvidia be in a decade? Nvidia's GPUs (graphics processing units) are the best-in-class hardware for supporting AI workloads. GPUs were originally made to provide the fast processing required by video game graphics, but their ability to efficiently handle intense calculations made them popular for running other workloads like drug discovery, engineering simulations, cryptocurrency mining, and now, AI model creation. Interest in AI grew rapidly in the past year and a half as businesses and consumers became intrigued by generative AI, and rising demand meant a need for supercomputers and server installations capable of processing these workloads. Fortunately for companies like Nvidia, these supercomputers must feature thousands of GPUs. Given that Nvidia's flagship H100 GPUs are rumored to cost around $30,000 apiece, that market is a significant revenue stream for it. This new demand caused Nvidia's revenue to skyrocket over the past few quarters.  NVDA Revenue (Quarterly) data by YCharts However, the growth is far from over. For the fourth quarter of its fiscal 2024 (which ended in late January), management guided for revenues of about $20 billion. When Nvidia reports its Q4 results on Feb. 21, all eyes will be on its next revenue guidance as investors seek assurance that it can continue growing at these incredible rates. That's because there are a lot of expectations baked into the stock price. Much of Nvidia's rise is based on its anticipated future growth. The company's trailing price-to-earnings (P/E) ratio is an absurdly high 95. However, when its forward earnings ratio (based on analysts' growth estimates) of 35 is considered, the stock doesn't look nearly as expensive.  NVDA PE Ratio data by YCharts That's not to say 35 times earnings is necessarily cheap, but when one considers, for example, that tech giant Microsoft trades for 36 times forward earnings, Nvidia's valuation doesn't seem so bad. But the elephant in the room is that Nvidia is a hardware company. Unlike software, which is largely sold as a service and a regular subscription, hardware is usually a one-time purchase to be used until it's necessary to replace or upgrade. With the recent rush to build out AI computing infrastructure, there's been a significant diversion from the expected growth path of the GPU market. Late last year, Precedence Research (a market research firm) estimated the GPU market would have around $56 billion in revenue during 2023. If Nvidia hits its guidance for Q4, it will have produced revenues greater than that in just three quarters. Does that mean Precedence was wrong? Not necessarily. The market could be pulling forward some of the revenue predicted for future years. But another thing Precedence predicts is that there will be revenue of $773 billion in GPU sales by 2032. That's drastically higher than current sales and shows a massive market for GPUs that hasn't been tapped yet. So, what will happen to Nvidia over the next decade? I'd predict a few things: Now, I don't know when the first prediction will happen. Still, with many experts predicting GPU usage will only increase thanks to the rise of cloud computing and other data-driven approaches, it makes sense to buy shares of Nvidia, even if they are expensive. While Nvidia's stock will likely nosedive at some point, over the long term, the growth is there for it to be a market-crushing stock. You'll have to hold onto it through those difficult times. Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}