{
    "title": null,
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/nvidia-stock-12-upside-according-110500588.html",
    "text": "Nvidia's (NASDAQ: NVDA) blockbuster earnings report last week is fueling more bullishness on Wall Street. HSBC analyst Frank Lee raised their price target on Nvidia to $880, representing 11.6% upside from the stock's latest closing price as of this writing. The stock is already up 238% over the last 12 months, but that performance comes on top of a decade's worth of market-thumping returns. The company's growth story continues to get better as the demand for artificial intelligence (AI) chips is lighting a fire underneath Nvidia's data center business. Nvidia's revenue for its fiscal 2024 fourth quarter climbed 265% year over year. CEO Jensen Huang said, \"Demand is surging worldwide across companies, industries, and nations.\" The data center segment, specifically, raked in $18.4 billion during the quarter to make up 83% of total revenue. However, Nvidia's growth is starting to decelerate, which could limit the stock's gains this year. The $22.1 billion top line for fiscal Q4 was up 22% from the previous quarter, compared to sequential growth of 34% in fiscal Q3. As the year progresses, Nvidia's growth may slow further as year-over-year comparisons become more challenging against last year's triple-digit growth rates. However, analyst Frank Lee still likes Nvidia's growth opportunity. This partly stems from Nvidia's focus on emerging markets, where management expects another wave of demand to come from governments around the world as nations invest in their sovereign AI infrastructure. Nvidia grew earnings per share by 54% annually over the last five years, and the consensus estimate projects earnings will grow 36% annually over the next five years. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 HSBC Holdings is an advertising partner of The Ascent, a Motley Fool company. John Ballard has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia. The Motley Fool recommends HSBC Holdings. The Motley Fool has a disclosure policy. Nvidia Stock Has 12% Upside, According to 1 Wall Street Analyst was originally published by The Motley Fool Related Quotes "
}