{
    "title": "Did Qualcomm Just Pull a Fast One on Nvidia and Intel's Mobileye?",
    "date": "2/10/2024",
    "url": "https://www.fool.com/investing/2024/02/10/did-qualcomm-just-pull-fast-one-nvidia-intel/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Qualcomm's (QCOM -0.44%) recent financials offer further proof that the smartphone and other consumer electronics markets are finally making a comeback after getting through a tough 2022 marred by excess inventory. That comeback comes just as the industrial chip market (which includes chips for electric vehicles (EVs)) is now entering a similar period of decline. After several years of chip shortages, there are now too many industrial chips in inventory in the global supply chain. Thankfully, Qualcomm's small automotive segment is bucking the trend, completely passing up the pedestrian-looking results from leading automotive chip designers Nvidia (NVDA 3.12%) and Mobileye (MBLY 0.54%) (which is still majority-owned by Intel (INTC 0.35%)). Is it time to get excited about Qualcomm's auto chip business? For starters, let's first acknowledge that some 80% of Qualcomm's revenue still comes from the smartphone market. Thus, the company will still be highly reliant on a stabilization in smartphone sales in 2024. So far, so stable. Based on overall guidance for the first few months of the calendar year, Qualcomm is expecting as much as a 5% rise in sales this year. Clearly, there's still more work to be done to get the consumer electronics market (which also includes the rallying PC and laptop space) back in tip-top shape. But then there's Qualcomm's automotive segment, which blew away expectations with a 31% year-over-year revenue increase to $531 million in the last quarter (Q1 fiscal 2024, which ended Dec. 24, 2023). It's an impressive showing for Qualcomm, especially considering its peers in advanced driver-assist systems (ADAS) and other auto tech suppliers have been reporting. Company Q3 2023* Change (YOY) Q4 2023* Change (YOY) Q1 2024 Outlook* Implied Change (YOY) Qualcomm** $535 million 15% $598 million 31% Down slightly from Q4 20%-plus Mobileye** $530 million 18% $637 million 13% $229 million (Approx. 50%) Nvidia** $261 million 4% n/a n/a n/a n/a Data sources: Qualcomm, Mobileye, and Nvidia. *Data is for the calendar year quarter. **Nvidia's latest quarter ended Oct. 29, 2023, Qualcomm ended Dec. 24, 2023, and Mobileye's latest quarter ended Dec. 30, 2023. Nvidia's calendar Q4 and Q1 have not yet been reported. What is Qualcomm doing differently that's helping it out-drive its competitors? There's one key factor: Qualcomm isn't just an ADAS and self-driving car chip company. Qualcomm's automotive segment also includes digital cockpit and infotainment chips, vehicle mobile connectivity, and other solutions that an automaker can pick and choose from depending on their model and trim level. Conversely, Mobileye is focused on just ADAS and self-driving car applications. Nvidia's automotive segment is similarly aligned, while its data center solutions for automakers like software and self-driving AI algorithm development are reported under its booming \"Data Center\" segment. Qualcomm's auto revenue currently sits at just 6% of total revenue, but that figure is quickly rising. Back in late 2022, Qualcomm outlined plans to get auto chips up to at least $4 billion by fiscal year 2026 (mostly calendar year 2025), a nearly 70% increase from the annualized auto revenue run-rate just reported last quarter. That's impressive considering the slump the auto industry is now entering, and another reason why I'm bullish on Qualcomm in 2024. Nicholas Rossolillo and his clients have positions in Nvidia and Qualcomm. The Motley Fool has positions in and recommends Nvidia and Qualcomm. The Motley Fool recommends Intel and Mobileye Global and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}