{
    "title": "Why AMD Stock Could Soar Higher in 2024",
    "date": "2/3/2024",
    "url": "https://finance.yahoo.com/news/why-amd-stock-could-soar-154000156.html",
    "text": "Chipmakers have attracted countless investors over the last year as a boom in artificial intelligence (AI) has sent demand for graphics processing units (GPUs) skyrocketing. Nvidia has stolen much of the spotlight, with its shares up 200% year over year. However, chip companies at earlier stages in their ventures into AI could have more room to run. This is part of why Advanced Micro Devices (NASDAQ: AMD) is an attractive investment option in the space. In 2023, Nvidia became the first chipmaker to exceed a market cap of $1 trillion. AMD still has a long way to go before coming anywhere close to that figure, with its market cap at $286 billion. However, that could mean it has far more growth potential over the long term. AMD is on a promising growth trajectory as it gears up to challenge Nvidia with a new AI GPU and benefits from an improving PC market. The company's shares are up 123% year over year but are nowhere near hitting their ceiling. Here's why AMD's stock could soar higher in 2024. According to Grand View Research, the AI market reached nearly $200 billion last year and is projected to expand at a compound annual growth rate of 37% through 2030. That trajectory would see the industry surpass $1 trillion before the end of the decade. As a result, it's not surprising that tech companies like AMD are investing heavily in the budding sector. AMD unveiled the next installment in its line of MI300 chips last December, debuting its most powerful GPU ever: the MI300X. The new chip is designed to compete with Nvidia's H100 AI GPU. In fact, AMD is promising that the MI300X is on par with Nvidia's offerings for training. AMD also claims that it beats the H100 for inference by 10% to 20%. However, the AI market's rapid growth rate suggests AMD won't need to dethrone Nvidia to still see major gains from the industry. Nvidia could retain a leading market share in AI GPUs while AMD carves out a lucrative role in the sector. And its MI300X is already attracting some of tech's most prominent players. Last November, Microsoft announced Azure would become the first cloud platform to implement AMD's new GPU to optimize its AI capabilities. Microsoft has a close partnership with OpenAI, making the company a powerful ally for AMD. Alongside an agreement with Meta Platforms -- which will see it utilize the new chips as well -- AMD's future in AI looks bright. In addition to AI, AMD is benefiting from a gradually improving PC market. Data from Gartner shows global PC shipments increased 0.3% in the fourth quarter of 2023, rising for the first time in over a year. Macroeconomic headwinds are subsiding, with the PC market expected to continue improving throughout 2024. The improvements are already reflected in AMD's earnings. In its Q3 2023, revenue in its client segment rose 42% year over year to $1.4 billion. Alongside potential in AI, AMD could be in for a stellar growth year in 2024. Earnings-per-share (EPS) estimates align with the company's potential, with its stock projected to soar in its next fiscal year. This chart shows AMD's earnings could hit just over $5 per share by the end of its next fiscal year. Multiplying that figure by the chipmaker's forward price-to-earnings (P/E) ratio of 45 yields a stock price of $239. If projections are correct, AMD's shares would rise 35% by the end of fiscal 2024, outperforming the S&P 500's increase of 20% over the last 12 months. AMD is on a promising growth trajectory, making its stock a no-brainer in the new year. Should you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Advanced Micro Devices wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 22, 2024  Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Gartner. The Motley Fool has a disclosure policy. Why AMD Stock Could Soar Higher in 2024 was originally published by The Motley Fool Related Quotes "
}