{
    "title": null,
    "date": "1/29/2024",
    "url": "https://qz.com/semiconductor-ai-chips-venture-capital-funding-nvidia-s-1851205542",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters When it comes to venture capital for computer chips, the gap between the US and China has never been wider. In 2023, the US’s share of global semiconductor startup funding was just 11%, versus  75% for China, according to a recent report from PitchBook, a market research firm. PitchBook defines semiconductor startups as companies working on chip design and manufacturing as well as production and equipment. In the wake of tighter US export controls on AI chips from manufacturers like Nvidia and AMD, China has made building its semiconductor industry a priority. It’s reportedly launching a new state-backed investment vehicle, called the Big Fund, that aims to raise about $40 billion for chip manufacturing. China’s president, Xi Jinping, has long stressed the country’s need to achieve economic self-sufficiency, especially in tech. Notable Chinese chip startups include SJSemi, which has raised $1 billion to date, and Biren Technology, which has $921 million in funding, including a $280 million government investment, according to PitchBook. “It’s not very different from the US using VC to create titans like Intel and Fairchild Semiconductor in the ’50s and ’60s,” PitchBook analyst Ali Javaheri wrote in the report. Despite the 2022 passing of the CHIPS Act—which aims to reduce reliance on China by providing more than $50 billion in subsidies for domestic semiconductor manufacturing and research—America’s share of global chip VC funding fell slightly last year. Most of the US government subsidies are supposed to go toward opening or expanding US chip factories. It’s clear that making chips requires a lot of money: OpenAI CEO Sam Altman is seeking to raise billions to build his own AI semiconductor factory, which suggests that there aren’t enough chips to go around. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}