{
    "title": "Combined, Nvidia and These 4 Chip Stocks Are Worth More Than Apple or \nMicrosoft. Here's My Favorite to Buy Now.",
    "date": "1/26/2024",
    "url": "https://www.fool.com/investing/2024/01/26/nvidia-chip-stocks-apple-microsoft-buy-stocks/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia has been a massive growth story, but the whole semiconductor industry exploded in value. Semiconductor stocks are surging, driven by artificial intelligence (AI) optimism despite sluggish demand across the smartphone, automotive, and personal computer industries. Nvidia surged to become the fifth-most-valuable U.S.-based company by market cap, behind only Microsoft, Apple, Alphabet, and Amazon. Microsoft and Apple both achieved a $3 trillion market cap at this writing. The five most valuable chip stocks -- Nvidia, Taiwan Semiconductor Manufacturing (TSM 0.78%), Broadcom, Intel, and Advanced Micro Devices -- have a combined market cap of $3.11 trillion. The chip industry now has a massive share of the tech sector and the overall stock market. But valuations have expanded, and investors may be less inclined to pay up for these stocks until fundamentals catch up. Fortunately, there is one chip stock that looks like a good overall value. Here's why Taiwan Semi is my favorite semiconductor stock to buy now. Image source: Getty Images. Taiwan Semi is a pure-play chip foundry whose clients are the largest fabless chip makers in the world, like Nvidia. Just as Apple outsources the manufacturing of the iPhone, Nvidia, Broadcom, AMD, Qualcomm, and others do the same thing with its chips. Manufacturing in the highly specialized chip industry isn't like a bottling plant, refinery, or even an automobile plant. There's the constant need to manufacture chips with smaller processors, adding complexity and precision to a constantly evolving industry. Taiwan Semi began producing 3-nanometer chips in late 2022, and will start producing 2-nanometer chips in 2025. Just that small reduction in size requires new investment in complex equipment. To win business and sustain existing clients, Taiwan Semi has to maintain its competency, forecast future demand, deliver orders on time, and manage its spending. It's a tall order, but the company has proven to be one of the most trusted players in the business, which is why it is the largest pure-play chip foundry in the world. The simplest reason to choose Taiwan Semi over a company like Nvidia is that Taiwan Semi benefits from growth across multiple players and industries. In 2022, the company produced 12,698 products using 288 different process technologies. Looking at 2023 as a whole, high-performance computing (AI, data centers, and more) made up 43% of revenue, smartphone revenue came in at 38%, Internet of Things was 8%, automotive was 6%, and 5% was \"other.\" Yet revenue as a whole was lower in 2023 than in 2022, which illustrates the downturn the industry is seeing and why so much of the AI-driven revenue has yet to materialize. To grasp the impact of smaller, more powerful chips, consider that the new 3-nanometer chips made 15% of Q4 2023 revenue and 5 nanometer made 35%. Meanwhile, in Q2 2023, 3 nanometer had yet to enter mass production. So, for 2023 as a whole, 3 nanometer made up just 6% of revenue, and 5 nanometer made up 33%. In 2022, 5 nanometer made up just 26%. The rapid pace of innovation pressures Taiwan Semi to stay ahead of the curve and ensure it is prepared to deliver what its customers need faster than the competition. And that requires a ton of capital expenditures and research and development expenses. The following chart shows the capital-intensive business model for Taiwan Semi.  TSM Capital Expenditures (TTM) data by YCharts For Taiwan Semi, it's a straight shot up regarding capital expenditures (capex), operating expenses, and research and development. Capex understandably tailed off in recent quarters with the advent of 3-nanometer chips. One of Taiwan Semi's business model challenges is the lag factor between investments and when they pay off. Preparing for 5-nanometer chips required build out years before Taiwan Semi reaped the reward. The same happened for 3 nanometer, and will happen for 2 nanometer. For that reason, it is imperative that Taiwan Semi keeps cash on hand and manages its costs so it can frontload the expenses. The timing could work against the company. If it ramps production of a new technology in the midst of an industry-wide downturn, it can delay expected revenue even more. Taiwan Semi's big advantage is that it generates incredibly high margins and growing revenue and earnings despite its high costs.  TSM Revenue (TTM) data by YCharts This shows that the business model, although capital-intensive and cyclical, is still incredibly profitable. Taiwan Semi's customers will happily pay for its services because those customers (like Nvidia) tend to be high margin and prefer to keep their operations lean without the headache of manufacturing overhead. Taiwan Semi's greatest risks are falling behind the next industry-wide evolution, mismanaging expenses, entering a downturn after a major manufacturing expansion, and the geopolitical risk of being a Taiwanese company. Most (but not all) of its fabs are located in Taiwan. To combat that risk, the company is building a new fab in Arizona. It's no secret that its largest customers are U.S.-based companies, so it makes sense for Taiwan Semi to ease some of the geopolitical risk by building fabs within the U.S. border. Still, any time U.S.-China tensions run high, there's a risk that Taiwan Semi becomes caught in the crossfire, which can pose an added and unique risk to investing in the stock. Taiwan Semi is innovative, efficient, and has an incredible track record of delivering results. The company is achieving high margins and growing its top and bottom line despite high expenses and industry challenges. Unlike other players in the industry, Taiwan Semi is not an expensive stock, trading at a 22 price-to-earnings ratio. It also pays a growing dividend, which yields 1.7%. If you're going to invest in the semiconductor industry, you have to have a high risk tolerance and patience to endure the ebbs and flows of the broader industry. And with Taiwan Semi in particular, you'll also want to gear up for the possibility of a geopolitical-induced sell-off, or a quarter that looks bad because of high expenses and delayed revenue. Overall, there's more to like about Taiwan Semi than not to like. It's the most value-orientated play in the industry, and has what it takes to be a foundational chip stock for decades to come. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Microsoft, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}