{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.cnbc.com/2024/01/18/nvidia-and-amd-shares-hit-record-highs-on-ai-chip-surge-.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article AMD and Nvidia hit all-time highs on Thursday as investors continue to clamor for shares of the companies building chips that power artificial intelligence. AMD shares rose over 1% during trading on Thursday to reach its highest-ever closing price, $162.67, while Nvidia, rose just under 2% to $571.07. Both companies have notched double-digit percentage gains to start the year after an explosive 2023 in which AMD shares popped 127.6% and Nvidia stock rocketed 238.8%. The record valuations reflect continued investor interest and hunger for companies that design and sell graphics processors for artificial intelligence. GPUs were originally designed to play computer games,. But they're also essential for training and deploying intricate AI models like OpenAI's GPT, leading to a massive surge in sales for the chips. Nvidia has been the primary GPU supplier to AI companies for the past two years and was the best-performing stock in the S&P 500 last year. Investors are increasingly bullish on AMD, the second-largest standalone GPU maker. the company announced last year a new chip that could compete with Nvidia's H100, which is currently the standard for AI applications. Analysts also see AMD improving its AI software, eliminating one major reason why Nvidia chips were preferred over AMD's. On Thursday, Taiwan Semiconductor Manufacturing Company, which manufactures Nvidia and AMD chips, reported better-than-expected sales. CEO C.C. Wei said that there was strong demand for AI chips, which use the most advanced manufacturing techniques. TSMC management believes manufacturing AI chips could represent a \"high-teens\" percentage of its revenue in five years, which has positive implications for both Nvidia and AMD, Goldman Sachs analysts led by Toshiya Hari wrote in a note on Thursday. Separately, Meta CEO Mark Zuckerberg, one of the largest buyers of GPUs, announced plans on Thursday to buy billions of dollars worth of Nvidia and other GPUs this year. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}