{
    "title": null,
    "date": "1/10/2024",
    "url": "https://www.fool.com/investing/2024/01/10/its-2024-upgrade-retirement-goals-ai-stocks/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The tech-centric Nasdaq Composite rebounded 43% in 2023. Leaders in artificial intelligence (AI) technology played a key role in the market's rally last year, which is a positive signal of where these stocks are headed over the long term. If you need more growth for your portfolio, focusing on profitable AI companies that lead their industry would be a great place to start. We'll look at three \"Magnificent Seven\" stocks that trade at fair valuations relative to their growth and could deliver market-beating returns. Nvidia (NVDA 3.12%) stock skyrocketed in 2023, rising 238%. Booming demand for chips that can handle the massive data workloads needed for AI training has lit a fire under the business. The company just unveiled its H200 graphics processing unit (GPU) for data centers which is even more powerful than the previous H100. It could set the stage for another year of strong growth. Training generative AI and large language models requires lots of memory bandwidth on the chip. This is what the H200 promises to deliver, which could steal some thunder from Advanced Micro Devices' memory-heavy MI300 GPUs. Amazon Web Services, Alphabet's Google Cloud (GOOG 2.04%) (GOOGL 2.15%), and Microsoft Azure are already on board as the first customers to use the H200 in 2024. Nvidia has been the leading GPU specialist for many years, and that's not likely to change. Over the last four quarters, it generated a staggering $19 billion in profit on $45 billion of revenue. It spends close to 20% of its annual revenue on research and development, which fuels its GPU innovation. Analysts forecast Nvidia will earn $24 per share annually in the next two years. That could support a stock price of $1,560 if the shares are still trading at the current price-to-earnings ratio of 65. Nvidia is a profitable business that can deliver plenty of upside from these highs. After more than doubling in the first half of 2023, Tesla (TSLA -1.15%) shares cooled off in the second half of the year. While Wall Street is worried about near-term auto demand, the company is building incredible capabilities in software that the market is overlooking. Tesla is navigating one of the worst auto markets in over a decade. Rising interest rates are hurting demand for electric vehicles, and this can be seen in its recent numbers. Automotive revenue grew just 5% year over year in the third quarter. Still, Tesla is moving in a positive direction over the long term. It is a very profitable business, with $11 billion in net profit over the last four quarters on $95 billion of revenue. Its robust profitability for an automaker is funding advancements in valuable areas like AI software, which gives Tesla a lot of options for long-term growth. With more self-driving vehicles on the road collecting enormous amounts of data, Tesla is making rapid progress toward making its software better. It monetizes its full self-driving software through an extra fee when a customer orders a vehicle, but the broader capabilities Tesla is gaining in this area are a competitive advantage that could present new moneymaking opportunities over time. Down the road, it could lead to new lucrative licensing deals with other car companies, in addition to robotics that could expand Tesla's addressable market. Analysts expect Tesla to report $145 billion in revenue next year as the auto market recovers. If the stock is still trading at its current price-to-sales ratio of 8.6, Tesla's stock would rise 65% over the next two years, which should be enough to outperform the market. Google parent Alphabet was another Magnificent Seven stock that outperformed the market in 2023, climbing 58%. But it's still reasonably priced for new investors hoping to jump on board. The main growth engine for Alphabet is its dominant lead in the digital advertising market. With billions of people using Gmail, YouTube, and other services, Google brings in nearly $60 billion in advertising revenue every quarter, which churns out robust streams of free cash flow that it can reinvest in key technology that makes these services even more valuable for users. AI is crucial to everything Alphabet does. In 2023, the company announced Google DeepMind, a team dedicated to developing AI systems for future products and services. In search, generative AI will expand the types of questions users can ask Google, and therefore lead to more relevant search results for users, driving revenue growth in advertising. Alphabet experienced a slowdown in growth due to a weak advertising market in 2022, but it recovered in 2023, with search revenue up 11% year over year in the third quarter. The outlook is improving for Google's largest business. Indeed, Wall Street analysts are upgrading their revenue estimates for 2024 and 2025, but the stock continues to trade at a below-average valuation of 20 times this year's earnings estimate. Using the 2025 earnings-per-share estimate of $7.79 and applying a P/E of 25 (the S&P 500 average), the stock would hit $194 within the next two years. That would give investors a 46% return from today's share price. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Ballard has positions in Advanced Micro Devices, Nvidia, and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}