{
    "title": "Why Nvidia Surged Even Higher This Week",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/news/why-nvidia-surged-even-higher-180718275.html",
    "text": "It's been a bullish week for the tech-heavy Nasdaq Composite index. As of midday Friday, the index has leapt by almost 3% since last week's close. But the stock of tech giant Nvidia (NASDAQ: NVDA) has blown away those results. The advanced semiconductor chipmaker's shares have surged by 11.3%, according to data provided by S&P Global Market Intelligence. That follows a banner year in 2023 that saw the stock more than triple. But much of those gains came in the first half of 2023 after the markets realized just how much revenue was growing from Nvidia's leading artificial intelligence (AI) chips. But the move to start 2024 has the stock breaking out of a more than six-month trading range. This week's gains come after the company made a splash at both the J.P. Morgan Healthcare Conference and the CES (formerly known as the Consumer Electronics Show) in Las Vegas. Most investors know that Nvidia stock soared when revenue from AI applications exploded early last year. But with no real additional catalysts, the stock has traded in a relatively steady range for the last half of 2023. But it started to break out of that range in 2024, and has accelerated gains this week. That was triggered as investors start to see additional uses for its AI chips. At the J.P. Morgan conference, Nvidia healthcare Vice President Kimberly Powell emphasized how computer aided drug discovery will accelerate progress similar to how computer aided design (CAD) did for chip design. She added that the company's BioNeMo AI platform for drug discovery has already been deployed by an Amgen subsidiary for its genomics foundation molecular models. That, along with new gaming, generative AI, and robotics innovations revealed at the CES has investors thinking the next wave of revenue-generating catalysts are imminent. Nvidia also said this week that it is planning to address new U.S. government regulations on advanced chips going to China by planning a new series of AI chips with more limited capabilities that will comply. That's one more headwind being addressed that could have impacted revenue growth. But all the news this week points to further jumps in sales, and investors are jumping into Nvidia stock before the company reveals more details in its next financial update on Feb. 21. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Howard Smith has positions in Nvidia. The Motley Fool has positions in and recommends JPMorgan Chase and Nvidia. The Motley Fool recommends Amgen. The Motley Fool has a disclosure policy. Why Nvidia Surged Even Higher This Week was originally published by The Motley Fool Related Quotes "
}