{
    "title": "ServiceNow And Nvidia’s AI Power: A Stock Surge Beckons",
    "date": "1/16/2024",
    "url": "https://www.forbes.com/sites/jonmarkman/2024/01/16/servicenow--nvidias-ai-power-a-stock-surge-beckons/",
    "text": "In this photo illustration of the TradingView stock market chart of ServiceNow Inc.  seen displayed ... [+] on a smartphone with the ServiceNow Inc. logo in the background. (Photo Illustration by Igor Golovniov/SOPA Images/LightRocket via Getty Images)  The artificial intelligence revolution is coming, complete with a big productivity payoff. Investors should get ready. News broke last week on Reddit, a perfect venue, that Duolingo\nDUOL\n (DOUL) is offboarding a large percentage of its contractors. The company operates a mobile application platform for music, math and language learning certification. Investors should buy ServiceNow\nNOW\n (NOW). Let me explain. We all knew this day was coming. Social scientists have predicted for years that the robots would come to take our jobs. The robots are here, yet they are not what most people expected. It is more complicated. The robots are algorithms, software. And the displaced workers are not welders and mechanics. They are software writers, information technology workers, and translators, in the case of Duolingo. Executives at Pittsburgh, Penn.-based company claim they can use AI to perform most of the tasks now being performed by language contractors. Given this, far fewer humans are required, leading to the headcount reductions. Those cuts could amount to 10% of the workforce, according to a report in Bloomberg. The magnitude of the cuts fly in the face of claims made in 2023 when Duolingo introduced its Max premium subscription service. That product uses GPT-4, the large language model from OpenAI to create custom language exercises. The benefit was supposed to make the platform more accessible. In a blog post last September, executives noted that AI wasn’t being used to replace humans, rather the goal was to produce better outcomes. Duolingo promised to democratize education. The AI-software would allow teachers to get certified in language proficiency where no testing facilities existed, or give students access to quality education in places where qualified instructors and schools were in short supply. It now seems Duolingo is prioritizing cutting headcount. Investors should not be alarmed about this trend, though. ServiceNow makes an operating system software for entire enterprises. Its Now platform digitizes every aspect of a corporation. Everything moves within the platform, from human resources, and marketing, to productivity software suites. Better still, all of the silos are broken down. Workday\nWDAY\n (WDAY, Salesforce\nCRM\n (CRM) and Microsoft (MSFT) software tools work together effortlessly. The Now platform is in use at 7,700 corporations worldwide. This includes 85% of the Fortune 500. And the renewal rate is 99%, so customers clearly like the product. These factors alone make shares attractive. AI is about to supercharge the business. Executives announced in May 2023 that ServiceNow will partner with Nvidia (NVDA) to build enterprise workflow automation tools using AI. Workflow automation is the holy grail of enterprise software because it increases productivity by systematically removing processes. Every operation eliminated increases profitability. The software pays for itself. Nvidia builds the world’s best AI hardware. And its CUDA software platform is beloved by academics and developers alike for its standardization. Using Nvidia tools, ServiceNow is developing custom LLMs to work specifically with the Now platform. New uses cases for generative AI will be deployed across IT departments, customer service teams, employees and developers. To simplify the user experience, enterprises will be able to customize chatbots with proprietary data to create a customizable central chatbot that will remain on topic while resolving requests, according to a Nvidia blog. The similarity to the Duolingo GPT-4 experience is no accident. Nvidia is foundational to the LLMs developed by OpenAI. These same tools make ChatGPT think. Investors should embrace these AI algorithms. They are about to become widespread across thousands of enterprises, thanks to ServiceNow. It is a big opportunity that is still not being reflected in the share price. At a share price of $697, ServiceNow shares have pulled back from the record high at $720.60. Shares trade at 54 times forward earnings and 16.7 times sales. The stock is not cheap, however, the growth from its AI initiatives are also not being factored into current valuations. Shares could reach $780 within the next 12 months, a gain of 8.6% from current levels. Buy declines toward the $660 level. Want to read more about lesser-known tech companies making millions for investors? Sign up for our FREE weekly newsletter here. We call it Foresight Friday because your future self will have loved your current foresight for signing up... Seriously... Members invested in Nvidia in 2014. Do not delay, sign up today!  "
}