{
    "title": "11 Companies Including Nvidia Are Growing Like A House Of Fire",
    "date": "1/19/2024",
    "url": "https://www.investors.com/etfs-and-funds/sectors/sp500-companies-including-nvidia-are-growing-like-a-house-of-fire/",
    "text": "BREAKING: Futures Fall Slightly The fact that Nvidia's business is on fire is no surprise — the AI stock was one of last year's best. But it's not alone in growing like crazy. Eleven companies in the S&P 500 — including Nvidia (NVDA), Las Vegas Sands (LVS) and Wynn Resorts (WYNN) — are expected to post revenue growth of 3o% or more when they report their fourth-quarter results, says an Investor's Business Daily analysis of data from S&P Global Market Intelligence and Marketsmith. Such growth is an utter standout. These firms' forecast quarterly growth is orders of magnitude higher than the 3.1% revenue growth expected from the S&P 500, says Nicholas Colas, co-founder of DataTrek Research citing data from FactSet. \"We know most S&P 500 companies will beat analysts' estimates when they report (fourth quarter) results, but it will be top-line growth that determines the quality of those beats,\" Colas said. Nvidia isn't alone in growing revenue rapidly, but it is the fastest. Analysts think the maker of high-powered computer chips used in AI will post fourth-quarter revenue of $20.2 billion. If that's right it would mark a 234% jump from the same year-ago period. No other S&P 500 company's fourth-quarter top-line growth is likely to come anywhere near that. The average S&P 500 company's forecast revenue growth is just 3.3%. Such off-the-hook growth explains investors' enthusiasm for NVDA stock. Shares of Nvidia jumped 15% this year already after soaring 239% in 2023. Nvidia is due to report results on Feb. 15. Following Nvidia in terms of revenue growth are large casino operators like Las Vegas Sands and Wynn Resorts. Both are benefiting from people's desire to travel and gamble after being quarantined for so long after the pandemic. Analysts think Las Vegas Sands will post $2.9 billion in revenue in the fourth quarter. If that's right it would be nearly 159% higher than the same year-ago period. The company is due to report on Jan. 24. And then there's rival Wynn. It's expected to put up 71.9% higher fourth-quarter revenue of $1.7 billion. It's set to report on Feb. 2. Investors are gradually shifting their chips into the casino stocks already. Shares of Las Vegas Sands and Wynn Resorts are up 0.9% and 3.1%, respectively, this year. The S&P 500 in contrast is up just 0.3%. So, yes, Nvidia's growth is amazing. But it's not the only standout. Based on estimates for fourth-quarter 2023 revenue YOU MAY ALSO LIKE: Two Of The World's Richest Men Loaded Up On The Exact Same Stock 8 Hot Big Stocks Aren't In The S&P 500 — But You'll Wish They Were Learn How To Time The Market With IBD's ETF Market Strategy Find Today's Best Growth Stocks To Watch With IBD 50 Join IBD Live Each Morning For Stock Tips Before The Open 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500 stock Super Micro has more than tripled. Tesla remains the... 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}