{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.gamesradar.com/nvidia-geforce-rtx-4070-super-stock/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Super stock is now live It’s D-Day for the Nvidia GeForce RTX 4070 Super, and the revamped graphics card is now available at various retailers. First unveiled at CES 2024, the mid-range contender is the first of three souped-up cards slated to arrive on the scene this month, but you’ll need to be quick on your feet if you want to grab the Founder’s Edition GPU. In many ways, the Nvidia GeForce RTX 4070 Super is arguably the best graphics card contender that should have arrived back in 2023. Instead, its dialled back sibling, the original GeForce RTX 4070, showed up with 20% fewer cores, meaning it wasn’t quite an RTX 3090 replacement. Now that the new beefier card is available and armed with 7,168 CUDA cores, more gaming PC owners may finally take the plunge and upgrade their rigs, resulting in a high demand scenario that may catch laid back players off guard. At the moment, the Nvidia GeForce RTX 4070 Super Founder’s Edition is still available direct from the GPU giant. However, upon adding one to my basket, I was placed in a queue of over 600 people, which suggests the card is already pretty sought after. It’s worth noting that custom variants, including stock cards priced at $599, are readily available at Newegg, so we’re not talking about a complete wipe out like a few years ago. Still, the FE model isn’t grab and go right now, and Nvidia caveats that “being in the queue does not guarantee a purchase” when it comes to its own RTX 4070.  Nvidia\nThe $599 RTX 4070 Super Founder's Edition is still available direct from Nvidia, but you will need to wait in a queue to get one. Waiting times seem to top out at five minutes, but that could change depending on how demand pans out. Newegg\nThere's a variety of RTX 4070 Super models ready to ship at Newegg right now starting at $599, ranging from the stock Zotac Twin Edge model to a rather pricey Asus TUF  overclocked card. Best Buy\nRTX 4070 Super stock hasn't quite landed at the big box store, but we suspect it'll become available to buy soon. Nvidia\nUnlike the US, the UK Nvidia store is fresh out of RTX 4070 Super cards right now, but checking back for stock is worthwhile. Currys\nA small selection of RTX 4070 Super models are currently available at Currys, including a £599 custom card by Gigabyte. Overclockers UK\nYou'll find a hearty selection of custom RTX 4070 Super cards at Overclcokers UK right now, but the £599 models are apparently selling fast.  At the moment, the GeForce RTX 4070 Super is one of the best value mid-range Nvidia GPUs, especially since its lower spec sibling still costs $549. For an extra $50, you’re getting a graphics card that feels more like a suitable replacement for an RTX 3090, and it’s going to run rings around older flagship RTX cards. That said, it’s worth noting that it’s still armed with the same 12GB GDDR6X VRAM, and that could be an issue if you’re looking to enjoy the new release well into the future. Typically, more memory is required when games offer up higher resolution textures, with 16GB proving to be somewhat of a sweet spot in some scenarios. Of course, if you’re looking for a true 4K experience, you’re going to want to opt for something like the RTX 4080 Super instead anyway, as Nvidia’s mid-range selection really relies on AI trickery like DLSS 3.5 to pull off any sort of UHD action. Looking for a system with a GPU already inside? Check out the best gaming PC options for ready to go rigs. Alternatively, take a peek at the best gaming handheld and get your hands on a portable powerhouse. Weekly digests, tales from the communities you love, and more I’ve been messing around with PCs, video game consoles, and tech since before I could speak. Don’t get me wrong, I kickstarted my relationship with technology by jamming a Hot Wheels double-decker bus into my parent’s VCR, but we all have to start somewhere. I even somehow managed to become a walking, talking buyer’s guide at my teenage supermarket job, which helped me accept my career fate. So, rather than try to realise my musician dreams, or see out my University degree, I started running my own retro pop culture site and writing about video games and tech for the likes of TechRadar, The Daily Star, and the BBC before eventually ending up with a job covering graphics card shenanigans at PCGamesN. Now, I’m your friendly neighbourhood Hardware Editor at GamesRadar, and it’s my job to make sure you can kick butt in all your favourite games using the best gaming hardware, whether you’re a sucker for handhelds like the Steam Deck and Nintendo Switch or a hardcore gaming PC enthusiast. Upgrading your SSD? Dragons Dogma 2 is free with these select Crucial drives Preview: The new Riffmaster Guitar controller is great, but lacks that classic Guitar Hero feel Final Fantasy 14's Yoshi-P adds fuel to the Final Fantasy 9 remake rumors, teases that the reason for all the Dawntrail references is \"a secret\" By Dustin Bailey22 March 2024 By Lauren Milici22 March 2024 By Lauren Milici22 March 2024 By Jordan Gerblick22 March 2024 By Benjamin Abbott22 March 2024 By Jordan Gerblick22 March 2024 By Dustin Bailey22 March 2024 By Kim Taylor-Foster, Amy West22 March 2024 By Amy West22 March 2024 By Emily Garbutt22 March 2024 By Catherine Lewis22 March 2024 GamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}