{
    "title": "The Zacks Analyst Blog Highlights NVIDIA, Coinbase Global, Block, \nInteractive Brokers Group and CME Group",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-144700710.html",
    "text": "Chicago, IL – January 5, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NVIDIA Corp. NVDA, Coinbase Global Inc. COIN, Block Inc. SQ, Interactive Brokers Group Inc. IBKR and CME Group Inc.'s CME. Here are highlights from Thursday’s Analyst Blog: The cryptocurrency market witnessed an impressive turnaround in 2023 after a highly disappointing 2022. Bitcoin (BTC), the largest cryptocurrency worldwide, soared 157% last year. Other major cryptocurrencies such as Ethereum (ETH), Cardano (ADA), Dogecoin (DOGE) and BNB (BNB) also saw massive price hikes. The space is likely to remain buoyant in 2024. U.S. stock markets have soared amid a clear indication from the Fed's December FOMC meeting that the current interest rate hike cycle, which elevated the Fed fund rate to a 22-year high of 5.25-5.50% from 0-0.25% in March 2022, has finally ended. Moreover, the December FOMC meeting dot-plot showed that on average, Fed officials are expecting at least three rate cuts of 25 basis points each in 2024. A lower interest rate regime will be very helpful for high-growth sectors like technology and cryptocurrency. Meanwhile, the largest thrust for the crypto space has come from institutional investors. Speculation that the Securities and Exchange Commission is set to approve a Bitcoin exchange-traded fund has also raised investors' optimism. The agency is expected to respond to the application filed by ARK Investments and 21Shares by Jan 10, while financial major BlackRock Inc.'s proposal is expected to be addressed by Mar 15. Moreover, the next Bitcoin Halving will occur in the first half of 2024. When a halving occurs, the reward for mining new blocks is halved, making it more challenging for miners to earn net Bitcoins. Historically, this event has led to increased scarcity and has driven up the value of Bitcoin due to reduced supply. We have narrowed our search to five crypto-centric stocks with strong potential for 2024. NVIDIA Corp. is a semiconductor industry giant and one of the biggest success stories of 2023. As a leading designer of graphic processing units (GPUs), the NVDA stock usually soars on a booming crypto market. This is because GPUs are pivotal to data centers, artificial intelligence, and the creation of crypto assets. NVIDIA's expected earnings growth rate for next year is 62% (ending January 2025). The Zacks Consensus Estimate for its next-year earnings has improved 1% over the past 30 days. NVDA currently carries a Zacks Rank #2 (Buy). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here. Coinbase Global Inc. provides financial infrastructure and technology for the crypto economy in the United States and internationally. COIN offers the primary financial account in the crypto space for consumers, a marketplace with a pool of liquidity for transacting in crypto assets for institutions; and technology and services that enable developers to build crypto-based applications and securely accept crypto assets as payment. Coinbase Global has an expected earnings growth rate of 30.4% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 5.7% over the past 30 days. COIN currently carries a Zacks Rank #2. Block Inc. is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ's decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors. Block has an expected earnings growth rate of 53.2% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 3.5% over the past 60 days. SQ currently carries a Zacks Rank #3 (Hold). Interactive Brokers Group Inc.is a global automated electronic broker. IBKR executes, processes and trades in cryptocurrencies. IBKR's commodities futures trading desk also offers customers a chance to trade cryptocurrency futures. Interactive Brokers Group has an expected earnings growth rate of 5.2% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 2.7% over the past 90 days. IBKR currently carries a Zacks Rank #3. CME Group Inc.'s options give the buyer of the call/put the right to buy/sell cryptocurrency futures contracts at a specific price at some future date. CME offers bitcoin and ether options based on the exchange's cash-settled standard and micro BTC and ETH futures contracts. CME Group has an expected earnings growth rate of 3.4% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.5% over the past 30 days. CME currently carries a Zacks Rank #3. Why Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report CME Group Inc. (CME) : Free Stock Analysis Report Interactive Brokers Group, Inc. (IBKR) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Block, Inc. (SQ) : Free Stock Analysis Report Coinbase Global, Inc. (COIN) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}