{
    "title": "Nvidia is expected to be the best performer in the S&P 500 through 2025, by \nthis measure",
    "date": "2/17/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240217231/nvidia-is-expected-to-be-the-best-performer-in-the-sp-500-through-2025-by-this-measure",
    "text": "By Philip van Doorn Next Wednesday's earnings report could be another catalyst as Nvidia continues to dominate the AI hardware build-out Investors have gotten used to incredible year-over-year comparisons during the past several quarters for Nvidia Corp., which continues to lead the market for graphics-processing units being deployed by data centers to support their corporate clients' build-out of artificial-intelligence technology. Nvidia (NVDA) is scheduled to announce results for the fourth quarter of its fiscal 2024 next Wednesday at 5 p.m. Eastern time. The consensus among analysts polled by FactSet is for the company to report quarterly sales of $20.28 billion, up from $6.05 billion a year earlier. A year-over-year comparison of the company's sales results doesn't tell the full story. Nvidia's sales increased rapidly during each of the past three quarters as GPU sales for AI deployment - essentially a new market last year - took off. The quarterly sales number of $20.28 billion expected next week would be a 12% sequential increase from the $18.12 billion during the company's third quarter of its fiscal 2024, which ended Oct. 29. Nvidia's soaring sales and profits have set the stage for its shares to more than triple in value over the past year. So an important question for investors now is how long the company can maintain a high pace of growth for sales. To help answer that question, we screened consensus sales estimates among analysts polled by FactSet for the S&P 500 SPX. We used FactSet's adjusted calendar-year numbers for the estimates, with 2023 as a baseline. So the 2023 numbers are actual for companies whose fiscal years match the calendar and that have already reported their fourth-quarter results. For other companies - about 20% of the S&P 500 - with fiscal years that don't match the calendar, the 2023 numbers are estimates based mainly on results reported last year. Based on the consensus estimates through calendar 2025, these 20 companies in the S&P 500 are expected to show the highest compound annual growth rates for sales. The sales estimates are in millions. Click on the tickers for more about each company, fund or index. Click here for Tomi Kilgore's detailed guide to the wealth of information available for free on the MarketWatch quote page. We have included price-to-earnings and price-to-sales figures, based on Feb. 14 closing prices and consensus estimates for calendar 2025. In comparison, the S&P 500 trades for 18.2 times the weighted aggregate consensus estimate for 2025 and 2.5 times the weighted sales estimate for that year. The S&P 500's expected two-year sales CAGR through 2025, based on the weighted consensus estimates, is 5.3%. So Nividia's price ratios based on the 2025 estimates are high, but you pay a premium for rapid sales growth. And its price-to-sales ratio is high relative to the price-to-earnings ratio because the company's marginal profit is so high for the GPUs. Let's end with a summary of analysts' opinions of these stocks. Keep in mind that most analysts working for brokerage firms set 12-month price targets, which may be considered a relatively short period for long-term growth investors. (MORE TO FOLLOW) Dow Jones Newswires 02-17-24 0715ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}