{
    "title": "Super Micro Computer: This Tech Stock Has Already Doubled In 2024 \n(NASDAQ:SMCI)",
    "date": "2/13/2024",
    "url": "https://seekingalpha.com/article/4669757-super-micro-computer-this-tech-stock-has-already-doubled-in-2024",
    "text": "SOPA Images/LightRocket via Getty Images SOPA Images/LightRocket via Getty Images NVIDIA Corporation (NVDA) has enjoyed the limelight in the market for over a year, but another stock has arguably outshone Nvidia in recent months - Super Micro Computer, Inc. (NASDAQ:SMCI). Since the beginning of 2024, SMCI shares have surged by over 100%, soaring from around $320 per share to $740 per share. This remarkable ascent, even amidst the current AI fervor, is quite substantial. In comparison, Nvidia's stock is only up about 50% since the start of the new trading year. Prior to the COVID-19 pandemic, 50% would have been a great return over a year's time, much less a month's time. Amazingly, SMCI has outperformed NVDA over the long term as well - the 5-year return in SMCI is roughly 3,600%, whereas the 5-year return in Nvidia is closer to 1,700%. Given these impressive returns, it's no surprise to find that Super Micro Computer, often stylized as simply \"Supermicro\" is a significant player in the AI niche, and arguably a leader ahead of its competitors. However, Supermicro operates in a distinct segment of the semiconductor industry. SMCI primarily functions as an infrastructure company specializing in data center hardware and software. It provides the physical and digital framework that supports and empowers microchips, which in turn offer the computational and processing capabilities essential for managing, securing, and optimizing data and services within the broader data center ecosystem. Data centers are currently in the spotlight due to the perception that recent AI advancements are particularly conducive to enhancing data center capabilities. Consequently, products and services from companies like Nvidia and Supermicro are experiencing exceptionally high demand. For Supermicro, this encompasses the company's data center-focused computers, servers, and associated software. Naturally, the chips forming the backbone of data centers are also undergoing upgrades, primarily with Nvidia's HGX H100s. The impending upgrades to the world's data centers are considered such a significant undertaking that Nvidia's CEO, Jensen Huang, recently likened it to a modern-day industrial revolution. Judging by the remarkable performance of many stocks linked to the AI niche, this comparison appears fitting. In the broader semiconductor industry, this means that chip designers, manufacturers, data center software/hardware providers, and data center property owners are poised to reap benefits in the forthcoming months and years. Bloomberg Bloomberg Much like Nvidia, Supermicro is known as a top innovator in its field and is constantly pushing the envelope to improve its products and services. That approach probably helps explain why its infrastructure solutions are especially well-suited to cradle and enable the most advanced AI chips, such as those produced by Nvidia. SMCI-built servers power the cloud, telecom networks, and edge/accelerated computing platforms. Supermicro actually partners closely with some of the world's most advanced tech companies such as Nvidia, Advanced Micro Devices, Inc. (AMD) and Intel Corporation (INTC)-to ensure that SMCI hardware and software work efficiently with the most advanced offerings from these companies. After an incredible run in the company's shares during the last several months, Supermicro needed to back up that performance with a blockbuster quarterly earnings report, and on Jan. 29 it did just that. In its most recent earnings quarter, Supermicro said it generated around $3.70 billion in revenues, which was 77% higher than the previous quarter, and more than 100% higher than the same quarter one year ago. In the investment world, growth is the stuff that dreams are made of, and Supermicro surpassed the market's already lofty expectations. For the most recent quarter, SMCI posted adjusted earnings per share (EPS) of $5.59 versus the market's expectation of roughly $4.93/share. On top of that, the company raised its full-year revenue guidance to around $14-$15 billion, which was significantly higher than its previous guidance of $10-$11 billion. It's important to note that somewhere around 50% of SMCI's revenues are levered to the emerging AI niche. And that helps explain why shares of SMCI have been on such a strong run amidst the current AI craze. That's all well and good, but elevated levels of demand also require the production capacity to meet that demand. And the fact that Supermicro is poised to expand its production capacity significantly is likely another reason the shares have spiked in early 2024. Yahoo!Finance Yahoo!Finance In the previous year, SMCI had the capability to manufacture 4,000 server racks per month. However, this capacity is anticipated to increase to 5,000 per month in the near future. What's even more remarkable is the indication from the company's CEO during the latest earnings call that a new production facility, slated to come online at some point in 2024, could potentially double the company's production capacity. This projection was framed in terms of potential revenues, suggesting that the company could achieve $30 billion in annual revenue from sales, compared to the $14-$15 billion in annual revenue forecast for the current fiscal year, ending on June 30, 2024. Putting calendar dates aside, investors and traders are particularly enthusiastic about Supermicro's future prospects because the company theoretically will be equipped to meet a surge in demand, should one arise. In addition to its existing production facilities in California, the Netherlands, and Taiwan, Supermicro is currently constructing a new manufacturing facility in Malaysia, where the bulk of the anticipated new production capacity is expected to originate. SMCI currently holds about 7% of the market share in the global server market, and it appears that some investors and traders believe SMCI is now poised to grow its market share in 2024 and beyond. A couple of the other large players in the server industry include Dell Technologies Inc. (DELL) and Hewlett Packard Enterprise Company (HPE), which account for roughly 17.2% and 16.8% of the server market, respectively. Considering SMCI's unique market positioning in the AI niche, the aforementioned information suggests that SMCI may have entered its own \"Goldilocks\" period. The company's products and services are in extremely high demand, and it is poised to expand its production capacity significantly. Following a robust quarterly earnings performance, it's indisputable that Supermicro should command a higher valuation than it did several months ago. However, determining a fair valuation for Supermicro at this juncture presents challenges, primarily contingent upon whether the company can sustain its exceptionally high growth rates. Super Micro recently achieved a staggering quarter-over-quarter revenue increase of over 77%, a truly remarkable feat. Nevertheless, this rapid growth trajectory is unlikely to endure. Presently, Supermicro has indicated that it anticipates its revenues to grow by approximately 11-12% in the current quarter, signaling a more modest pace. Consequently, accurately predicting the actual revenue figures for this quarter becomes challenging. There exists the possibility that this quarter's revenues could surpass the company's own guidance, as observed in the previous quarter. Consequently, assessing the company's shares through a traditional discounted cash flow analysis becomes challenging, particularly with a high level of confidence. Predicting the associated revenue and earnings growth rate for the company over both the near and long term proves to be an arduous task. Alternatively, one may scrutinize Supermicro's current price-to-earnings ratio (P/E) to gauge the company's current valuation relative to its peers. At the end of the day, most investors are most interested in a given company's ability to generate profits, and the P/E ratio provides important insight into a company's stock price relative to its earnings. Generally speaking, companies with higher gross margins generally possess better pricing power and/or superior product differentiation, which allows them to generate more profits from each unit of sales. Companies with higher gross margins therefore often trade at higher P/E multiples because investors are willing to pay a premium for the higher profitability and growth potential associated with these companies. As a result, these companies often command higher valuations in the stock market. One important point about Supermicro is that the company's gross margins are on the lower end of the spectrum in the tech industry. And that's because SMCI operates in a segment that's generally less profitable than other subsectors. As a result, SMCI produces gross margins in the range of 15-16%, whereas a company like Nvidia boasts gross margins of greater than 60%. For this reason, Supermicro shouldn't arguably trade with a sky-high earnings multiple. And from this perspective, one could argue that shares of Supermicro Computer are overextended at this time. At present, the GAAP Price/Earnings (P/E) for SMCI is roughly 58. In comparison, the P/E for Dell - one of Supermicro's key competitors - is closer to 23, while the P/E for HPE is closer to 10. In this sector, the median P/E is closer to 28. Just for context, Nvidia's P/E is closer to 95. In this sector, the median P/E is closer to 28. Just for context, Nvidia's P/E is closer to 90. The only way that Supermicro can rationalize such a high P/E is if the company continues to obliterate its quarterly revenue and earnings expectations/guidance. And in the uber-competitive tech industry, it's unlikely that Supermicro's peers are going to sit idle on the sidelines and watch SMCI dominate the industry. It doesn't help that overall valuations in the Nasdaq 100 are also trending back toward recent highs, as illustrated below. Bloomberg Bloomberg On top of the above, the U.S. could easily enter a period of economic contraction at some point in 2024, which would almost certainly compress Supermicro's sales potential. For the aforementioned reasons, investors and traders may want to tread cautiously with SMCI shares at this time. If the stock pulls back to a more reasonable P/E level, that may represent an opportunity to enter a position in Supermicro at more attractive levels. It's never easy to discount the upside potential of a stock like SMCI, which has clearly benefited from an influx of momo-oriented investors and traders. But for the time being, Supermicro shares should be viewed as especially risky, considering the jaw-dropping run in the company's shares over the last 52 weeks, and its current P/E multiple, which is elevated as compared to its peers. This is especially true for a company that operates in a lower-margin business segment, and for a stock that's exhibited extreme price volatility in recent weeks. Andrew Prochnow has more than 15 years of experience trading the global financial markets, including 10 years as a professional options trader. Andrew is a frequent contributor to Luckbox magazine. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. Business relationship disclosure:  This article was written for Luckbox magazine by a contributor. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}