{
    "title": "Nvidia CEO Jensen Huang Predicts Increased Global Demand For AI \nInfrastructure As Countries Pursue Indepe",
    "date": "2/2/2024",
    "url": "https://www.benzinga.com/news/24/02/36905780/nvidia-ceo-jensen-huang-predicts-increased-global-demand-for-ai-infrastructure-as-countries-pursue-i",
    "text": "In a recent interview, NVIDIA Corp NVDA CEO Jensen Huang predicted that the global demand for AI infrastructure will soar as nations prioritize building and controlling their AI systems. What Happened: Huang highlighted the growing emphasis on “sovereign AI capabilities” in countries like India, Japan, France, and Canada. He stated that these nations are recognizing the need to develop and manage their AI infrastructure domestically, Bloomberg reported on Friday. He pointed out that Canada, for instance, is now facing an increased demand for supercomputers, essential for leveraging the AI advancements made by its academic institutions. Huang, who co-founded Nvidia, has been advocating for a national approach to the AI boom, emphasizing the importance of keeping data and its derived intelligence within a country’s borders. This approach, he believes, will drive the expansion of data centers, thereby increasing the demand for Nvidia’s products and expertise. \"The vast majority of the computing market has been in the US, and to a much smaller degree, China,\" Huang said. \"For the very first time, because of generative AI computer technology, it's going to impact literally every single country. So some of the markets will be quite large and global.\" See Also: Apple Vision Pro Hits Stores Friday: iPhone-Like Frenzy Missing For AR Headset, But Analysts Expect 500K-600K Sales This Year He also highlighted the potential for new markets, such as corporations and government agencies, to build their AI infrastructure, thus expanding Nvidia’s customer base. Why It Matters: Nvidia’s position as a key player in the AI chip industry has been a topic of interest in recent months. The company has been facing growing competition from major tech companies like Amazon.com Inc AMZN, Alphabet Inc  GOOG GOOGL, Meta Platforms Inc META, and Microsoft Corp MSFT, which are developing their own AI chips to reduce dependency on Nvidia’s GPUs and control costs. Despite this, analysts have projected a $1 trillion opportunity in AI for Nvidia, as these tech giants continue to invest in their AI technologies to strengthen their positions. The AI chip market has seen significant activity, with Nvidia and Intel Corp INTC leading the charge. Nvidia’s shift to designing lower-powered AI chips in response to U.S. regulations showcases the adaptive nature of this sector. Despite challenges in the Chinese market, Nvidia’s role in the generative AI surge, especially following OpenAI‘s ChatGPT launch, has marked it as a key player in AI advancements. Read Next: ‘History Will Repeat Itself:’ Munster Warns Meta Welcoming Headset War With Apple Echoes BlackBerry’s Greeting To Cupertino’s 2007 Smartphone Debut Photo courtesy: Nvidia Corp on Flickr Engineered by\n        Benzinga Neuro, Edited by\n        \n\n              Kaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the\n        extensive Benzinga Ecosystem, including native data, APIs, and more to\n        create comprehensive and timely stories for you.\n        Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}