{
    "title": "Explained | What drove Nvidia’s march to $2 trillion m-cap, and what’s next \nfor this AI play?",
    "date": "2/24/2024",
    "url": "https://www.moneycontrol.com/news/business/markets/explained-what-drove-nvidias-march-to-2-trillion-m-cap-and-whats-next-for-this-ai-play-12342001.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now On Friday, February 23, Nvidia rose to become the first semiconductor firm to hit $2 trillion in market capitalisation, making it the fourth most valuable company in the world behind Microsoft, Apple, and Saudi Aramco (Saudi Arabian Oil Company). This growth has come on the back of another quarter of bumper earnings, putting Wall Street and global markets in a frenzy and pushing up other tech stocks as well. Also read: Good luck catching up to Nvidia Nvidia's stock and market cap have ballooned over fivefold since January 2023, when ‘Generative AI’ suddenly came to the fore in the public eye, entering the popular discourse. In an earnings call post the fourth quarter (Q4) results, Chief Executive Officer (CEO) Jensen Huang, who started Nvidia in 1993, said that the demand for its newest products will continue to outstrip supply for the rest of the year as ‘Generative AI’ has kicked off a whole new investment cycle. While markets across the globe settled after a bumper rise on Thursday, the question now remains whether Nvidia can continue its upward trend. What does Nvidia do? US-based Nvidia Corp provides hardware and software. The company is known for high-end graphics processing units (GPUs) -- used for rendering high-quality graphics -- mostly used in high-performance gaming and the display of HD movies. Over the years, Nvidia has made headway into the fields of artificial intelligence (AI) and machine learning (ML) with solutions in generative AI, cybersecurity, data analytics, and AI learning. Its GPUs are used by data centres for deep learning, such as Tesla and the Quadro series. One of Nvidia’s biggest clients is Elon Musk’s Tesla (which Nvidia beat with the latest growth in market cap) and other autonomous driving players who use Nvidia’s hardware and software solutions for real-time processing of data from sensors. Why the sudden rise in Nvidia stock? In its recent Q4 earnings, Nvidia reported a 265 percent year-on-year (YoY) and 22 percent sequential rise in revenue to $22.1 billion for the quarter and around $60.9 billion for the fiscal year 2024, up 126 percent from the previous year. The biggest gains in the quarter were seen in data centre revenue, which grew more than 3x to $47.5 billion. For Q4, the revenue grew to $18.4 billion, up by around 27 percent on a quarter-on-quarter (QoQ) basis and up 409 percent YoY. According to the company, this was driven by demand for the 'NVIDIA Hopper GPU computing platform along with InfiniBand end-to-end networking'. In the Q4 earnings call, Colette Kress, NVIDIA's chief financial officer (CFO), said that the demand for Hopper remains very strong and they expect their \"next-generation products to be supply-constrained as demand far exceeds supply\". Currently, around 80 vehicle manufacturers \"across global OEMs, new energy vehicles, trucking, robotaxis, and Tier 1 suppliers are using Nvidia’s AI infrastructure to train LLMs and other AI models for automated driving and AI cockpit applications,\" the company said in its call. Revenue from the automotive segment grew 8 percent sequentially to $281 million but was down 4 percent on a YoY basis. Can Nvidia sustain growth? The global market for AI is expected to continue to grow. A PwC report estimates that by 2030, AI could contribute around $15.7 trillion to the global economy and boost the GDP of global economies by 26 percent. Nvidia expects to see revenue of around $24 billion in the current quarter, with sequential growth in data centres. According to Vikas Gupta, Chief Investment Strategist at Omniscience Capital, an India-based global investment management firm focused on global equity investments, NVIDIA has turned out to be the only serious alternative in the market for high-intensity AI, creating a monopoly. \"The competition for the AI workload on the cloud between Azure from Microsoft, AWS from Amazon, and Google Cloud resulted in huge demand for NVIDIA GPUs.\" This created a huge 50+ percent growth rate for NVIDIA revenues, and earnings shot through the roof.\" Gupta expects the outlook to remain at such extremes for the next three to five years. Will Nvidia face market competition? Gupta says that while the outlook continues to be positive, other peers who are currently customers of NVIDIA are also growing their technologies. For example, Google continues to work on TPU tensor processing units; Amazon works on Trainium and Inferential chips; and players like Microsoft, Apple, etc. are also working on their own proprietary AI chips. \"Eventually, the NVIDIA chips will be under threat from the main customers of NVIDIA itself,\" he adds. Reuters reported this week that, for the first time, Nvidia has publicly identified Huawei as a top competitor in several categories, such as AI chips, in a regulatory filing with the US SEC. According to the report, “China's Huawei competes in supplying chips designed for artificial intelligence, such as graphics processing units, central processing units, and networking chips.” What does this mean for Indian investors? Also read: How to buy Nvidia and other US shares from India Over the last couple of years, Nvidia has become a popular investment for investors from around the world, including India. Over the last five years, Nvidia's stock has gained nearly 20 times. Investors in India interested in investing in the stock can look at Fund of Funds (FoFs) and exchange-traded funds (ETFs) with exposure to the stock. Those who want to buy it directly can do so on platforms such as Groww, Angel One, and others. Investors can also choose to open accounts with international brokerages such as Interactive Brokers. In a report, Fisdom Research highlighted that over 15 Indian mutual funds have invested in the stock, with an exposure of around Rs 1,700 crore. The fund houses with the largest exposure to the stock are Motilal Oswal (Rs 439 crore), Mirae Asset MF (Rs 280 crore), Franklin MF (Rs 201 crore), and Axis MF (Rs 169 crore). According to CNBC-TV18, mutual fund houses like Axis, ICICI, Mirae, and Motilal hold around 1.7 lakh shares in Nvidia. Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before making any investment decisions. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}