{
    "title": "Poking Holes In The Nvidia Bear Case: Q4 Pre-Earnings Report (NASDAQ:NVDA)",
    "date": "2/16/2024",
    "url": "https://seekingalpha.com/article/4671015-poking-holes-in-the-nvidia-bear-case-q4-pre-earnings-report",
    "text": " FotografieLink  Russ Hanneman(Investor): Why would you go after revenue? Richard (Founder): Because... To make money. Russ (Investor): No. If you show revenue, people will ask \"How much?\" And it will never be enough. The company that was the 100xer, the 1,000xer, becomes the 2x dog. But if you have no revenue, you can say you're pre-revenue. You're a potential pure play. It's not about how much you earn, it's about what you're worth. And who's worth the most? Companies that lose money. Pinterest, Snapchat... No revenue. Amazon has lost money every quarter for the last 20 years and that Bezos is the king. The king. There's no revenue. No one wants to see revenue. Go. Richard (Founder): Oh, uh... I just thought that mainly the goal of companies is to make money. Russ Hanneman (Investor): Yeah, no, no, no. That's not how it works. I don't want to make a little bit of money every day. I want to make a ton of money all at once. ROI. ROI. You know what that stands for? Uh, return on inv... Return on investment! No. Radio on Internet. -HBO's Silicon Valley (expletives deleted). There have been a lot of busted narratives from bears foretelling doom, citing all the sins in the book: excessive valuation, looming geopolitical catastrophe, a Fed policy error, or even debt levels of the U.S. government. One of the narratives of the \"market fundamentalists\" and self-identified intrinsic value-oriented investors that is still quite prevalent is that AI is a massive bubble that will collapse. For instance, one chart shows Nvidia Corporation (NASDAQ:NVDA) compared to Cisco Systems (CSCO) in the early 2000s, and the overlay makes it look like impending doom is near.  Financial Times  I'll show why this chart is misleading, though. There are specific hair-raising facts, to be sure. For instance, the combined market cap of Microsoft (MSFT) and Nvidia is now at $4.8 trillion, which is larger than the GDP of the great nation of Japan. But this is largely just a reflection of general U.S. equity strength relative to the RoW. Furthermore, these companies sell their products globally. However, the economic potential of AI is still inherently different from the economic and technological revolution caused by the Internet. The mechanism for the Internet crash around the turn of the millennium was valuations getting ahead of earnings.  Schwab  However, the young AI revolution primarily essentially saw the opposite problem for its most fortuitous beneficiaries like Nvidia, so far. Earnings have gotten ahead of valuations in this stock market darling's case. Wall Street analysts are having trouble getting their earnings estimates to keep up with the pace of realized growth. This is the opposite problem that faced analysts in the web boom. Nvidia is the poster child for this, well, the pessimism of Wall Street analysts. It has had three hat trick-earning reports in a row, and I suspect it will unveil success next week. Rumors about GPU output increases and partnerships with Intel (INTC) could significantly increase revenue as demand increases. Many commentators, even the most bullish, like Dan Ives, begrudgingly admit that a bubble is in its early days. He insists it's 1995, meaning there are many gains to be had between now and the inevitable crash. Work from my former colleague at Fundstrat, Matt Cerminaro, supports this assertion. Matt has taken a more nuanced approach to comparing Nvidia and Cisco that sheds more light on the likely path of Nvidia than many bearish commentators circulating the more sophomoric chart above.  FactSet, @mattcerminaro  There is no stock drawing the ire of the bears more right now than Nvidia, and as I've discussed in a previous article, I believe much of the valuation scolding the stock receives is largely first-order thought that misses the advantages of the business. Considering that Polaroid once traded at 91 times earnings, Nvidia's valuation seems less profligate given that it has forced all of Wall Street to dramatically increase its estimates because of three blockbuster earnings reports in a row. In other words, Nvidia's rally is essentially an earnings and revenue growth-fueled surge when one considers what has driven the stock higher. It keeps clearing sky-high expectations. And Nvidia is not the only one that is priced fairly for growth; despite the scolding from spreadsheet jockeys, the Magnificent Seven is priced pretty reasonably for the growth you're getting, in my estimation. It is much more fairly priced than most of the market. This means that upside likely remains in the market's leaders, including Nvidia, if no other risks derail the rally.  MacroVisor.com  While this narrative certainly answers the concerns of AI bears and the market's spreadsheet jockeys, I don't think the hypothetical path of the AI boom that appears to have begun its stride will be anything like how the Internet affected commerce. Indeed, I suspect the way that artificial intelligence affects companies and commerce will be, in some ways, the approximate inverse of how the Internet did. Rather than taking revenue away from leading companies, it will likely be turning more of it into earnings than many analyst estimates currently forecast. If true, the consequences of this assertion would likely mean that almost everyone underestimates how high the stock market can go in the coming years. This is particularly true of Nvidia. The growth case is intact, and the firm's commercial moat is formidable in an area where capital intensity is beginning to exceed the reach of nearly all private entities. These advantages are considerable and not easily eroded by capable and well-funded competition. Furthermore, a virtuous cycle occurs in Silicon Valley when a stock moves parabolically, as Nvidia has recently. The talent follows the big stock moves. There is a lot of valuation risk with Nvidia, to be sure. However, I want to show you something to put this valuation risk in context. This is the valuation scorecard from my last pre-earnings report on Nvidia in November. As you can see below, it sent dire warnings about valuation before the last earnings report. And many bears were saying the same thing they are saying now.  ValueInvesting.IO  As you can see, the firm was shown to be dramatically overvalued based on intrinsic cashflows before the last report. But now let me show you something else. It is the price performance of the stock since that last earnings report. As you can see, despite the stock being shown to be overvalued by both intrinsic and relative valuation metrics in the last report, it has delivered a white-hot amount of upside.  Seeking Alpha  This should be a cautionary tale for those who dismiss Nvidia merely because of a valuation assessment on intrinsic and relative valuation. This company has repeatedly delivered, and I suspect if it shows fireworks again (Q4 earnings are expected on February 21st), this time, the market will give it a pretty good rally in the wake of what I expect to be a significant beat. The current valuation scorecard on the intrinsic side is virtually the same as before the last earnings report. This doesn't mean valuation should be dismissed, but it does mean that if the firm can maintain the positive momentum on breadth and scale of earnings beats, it should be able to overcome the valuation hurdle again.  ValueInvesting.IO  Nvidia has complicated supply lines that depend on other companies to produce its flagship products. For example, the firm pioneered the \"fabless\" model in the semiconductor industry, making it dependent on other firms that own fabs, namely Taiwan Semiconductor Corporation (TSM). Supply chain issues during the pandemic made this vulnerability more apparent. So, if anything terrible happens to TSM that interrupts production - from power outages on the island, which it is vulnerable to, and even military action associated with Chinese efforts to \"re-unify\" the island with the mainland - Nvidia would be directly hit. Given its high valuation, the effect on the price would likely be severely adverse. The firm's CUDA network is also a critical competitive advantage; if competitors erode this, it could remove the extraordinary premium and relative demand for its flagship GPU chips. Sarcastically, the opening quote beautifully illustrates some underlying incentives investors faced when trying to bring Internet companies to maturity and eventually to public markets. The Internet revolution was long on hope and brave new capabilities that weren't previously imaginable. Nvidia is also increasingly investing in AI, bolstering and diversifying its dominant competitive position. The firm has been investing in new AI companies, which should help solidify its competitive advantage.  Goldman Sachs 2024 Investment Outlook  Of course, many see such a parabolic rise in Nvidia's stock price as a reason to be pessimistic about the stock's future, but the effect this rise has on talent is evident if you've spent time in Silicon Valley. It makes them want to go there. Furthermore, when you consider the Benjamin Graham quote that in the short term, the market is a voting machine, the parabolic rise in price makes more sense considering three blow-out earnings reports in a row against what could be described as some of the highest expectations I've seen in markets in my career. Furthermore, a vital point of the bears has been the high market cap concentration of the Magnificent Seven compared to the rest of the market. Indeed, this has risen to high levels, as you can see above. But the stocks contribute a high proportion of this in actual earnings, 23% of earnings compared with 29% of market cap. Factset, Author Artificial intelligence is commercially potent but in a much different way. Firstly, rather than being the domain of new companies with little revenue, the largest and most competent technology firms are blazing a path forward in monetizing the exciting technology. These are not startups delivering commercial benefits to small businesses; these are some of the most valuable and talent-rich companies on Earth. But it is also who they are selling their AI wares to. Rather than supplanting and destroying the revenue of existing S&P 500 (SP500) components of more mature industries, they will be turning a more significant proportion of the considerable revenues of these firms into earnings than was previously considered possible. But more important than who is selling the new tools of the AI revolution is which firms will be purchasing these tools and which of them will be profiting from them. Technology has become the heavy weight of the stock market in many ways. The firms enjoy higher premiums, but perhaps more than any firms in history, they follow through on them. Nvidia still can beat Wall Street expectations. This isn't a bubble based on hope; it's a rally based on shattering earnings expectations for several consecutive reports. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of NVDA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}