{
    "title": "Nvidia market cap rises on money market fund flows",
    "date": "2/9/2024",
    "url": "https://finance.yahoo.com/video/nvidia-market-cap-rises-money-152033440.html",
    "text": "Tracked by Bank of America, Nvidia (NVDA) has seen its market cap increase by $600 billion over the past two months as investors continue to favor the chipmaker. Yahoo Finance Head of News Myles Udland comments on the tech themes seen across money market fund flows. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. BRAD SMITH: Bank of America's weekly roundup of fund flows showing investors are sticking with what's worked, pouring more money into market leader NVIDIA. Yahoo Finance's head of news Myles Udland is here. Why are they doing it, Myles? MYLES UDLAND: Well, the ground breaking and [? feud ?] in trade. No, I think what's been interesting watching fund flows and kind of the other conversation that we've been having in the newsroom and on this show is how much the early going of 2024 resembles what happened in 2023. Now, the stat from this week's note from Mike Hartnett, the team over at Bank of America, that's interesting. NVIDIA right now, its market cap is double that of Tesla. Two parts of that story, of course. There's the NVIDIA rally that we've seen, the continuation, the mega-cap trade all around AI. Also, the decline of Tesla now. I think they're down about 25% so far this year, give or take, depending on the day. So you have that dynamic within the Magnificent Seven. I don't know how much time you guys have spent on the Magnificent Six. Are we doing that yet? The Splendid Six-- SEANA SMITH: The Magnificent Six. Yeah. BRAD SMITH: Five even, we heard. MYLES UDLAND: Because it was about this time last year that Hartnett and his group started socializing this idea of there being a Magnificent Seven because we were still in the FAANG market. And it had become like the MANGA because Facebook changed its name. We were trying to figure out how it was going to work. And now it feels like we're at a new shtick, like inflection point, right? We need a new shtick, let's say, to get us through 2024. But the fundamentals of the market, as we see in this report where money's into market funds, money's out of the stock market, people still scared of stocks overall, and money going into NVIDIA. It's just in a way, the calendar turned, but nothing really changed. SEANA SMITH: And going off of that just in terms of the other flows that we have seen in the market, yes, people are optimistic in terms of maybe at least a handful of names. But there is still certainly a lot of reasons to be skeptical. The flows that we saw out of some of the regional plays, obviously, was one of the sticking points here, one of the things that stuck out within this report, and then also just the interest that continues to happen into these money market funds. MYLES UDLAND: Yeah, I mean, I'm hoping-- I'm hoping we all see it in our lives. I hope we all have high-yield savings accounts. And we're seeing that those rates still are depending on where you're at 4.4% 4.7% ish. And I've spent all of last year mentally preparing for that to go under 4% and here we are still enjoying the spoils of the Fed keeping rates elevated. But look at that at an institutional level, I think the NYCB stuff, maybe let's keep it over here. It's not as much of a deposit-taking institution. I'm not sure how much that influences it beyond the fact that you can still get now significantly above 100 basis points north of inflation at least by having your money in a money market fund, some kind of other savings vehicle if you're an institution or a portfolio manager. And that dynamic continues to push out this whole, oh, all the dry powder is going to come rushing into stocks. And certainly, the stock market is going up, but this idea of where can people put their money, well, you've got plenty of options right now. SEANA SMITH: Well, I'm going to give you an assignment. You've got to think of something a little bit more creative than Magnificent Six. MYLES UDLAND: Yeah, right. But you know, like-- SEANA SMITH: Sexy Six. MYLES UDLAND: --the rhyme-- SEANA SMITH: Sexy Six? That was what I was going to say too. MYLES UDLAND: Sexy Six. SEANA SMITH: You're just going to stop it. MYLES UDLAND: Well, no, that would get us through. I mean you know-- SEANA SMITH: It will get us through. MYLES UDLAND: --there's nothing wrong about-- BRAD SMITH: Sex sells. MYLES UDLAND: --saying that word. I know it's a family program, but it doesn't exactly violate those rules. SEANA SMITH: That's true. MYLES UDLAND: We'll go through all of our Ss. SEANA SMITH: We will. We will. MYLES UDLAND: Take out the thesaurus and just think what do you got for the S. BRAD SMITH: Suave. SEANA SMITH: Yeah, that's our assignment for you. MYLES UDLAND: We'll check back up. I do like to come in on Mondays. I'm not saying I'll be on the show, but I'll be in the newsroom. So on Monday-- SEANA SMITH: You're going to share your ideas. MYLES UDLAND: --we can circle back and we'll-- no, this is for you guys because who do I know? BRAD SMITH: I'm going to workshop it over the Super Bowl. SEANA SMITH: We'll all workshop it. MYLES UDLAND: I'm the guy-- I'm the guy yesterday-- I'm the guy yesterday who was like, I don't know, we can pass on Arm. So like don't listen to me. BRAD SMITH: Super Six, just like that. SEANA SMITH: Super Six. There we go. That's better. BRAD SMITH: It's done. It's done. MYLES UDLAND: Spirit of the weekend. SEANA SMITH: Better than just reworking that Magnificent Seven into Magnificent Six. MYLES UDLAND: Yep. SEANA SMITH: All right, Myles, thank you. This was fun. MYLES UDLAND: I'm done. You guys got an hour. SEANA SMITH: You got to come back. Maybe Monday. We'll see. MYLES UDLAND: Enjoy. Related Quotes "
}