{
    "title": "Stock Market: A violent correction looms over Nvidia's stock price!",
    "date": "2/28/2024",
    "url": "https://www.cointribune.com/en/stock-market-a-violent-correction-looms-over-nvidias-stock-price/",
    "text": "Home » News » Finance News The stock market surge of Nvidia, although spectacular, is stirring concerns. The graphics chip maker has surpassed giants such as Amazon or Alphabet and now ranks third among the valuations of American tech companies. Some economists, including Jeremy Siegel, see this as a harbinger of a sharp market downturn. The stock market journey of Nvidia is almost like a fairy tale. In just two years, the stock has increased by more than 5 times. The company owes this striking success to its technological leadership in two explosive areas: graphics chips and artificial intelligence. Thanks to the global semiconductor shortage, Nvidia has established itself as an essential player in these burgeoning markets. Its latest quarterly results attest to this rampant growth, with sales up by 61% and net profits more than doubled. This has excited investors, who are flocking en masse to this promising tech stock. With a market capitalization approaching $2 trillion, Nvidia now weighs more on the stock market than giants like Facebook, Tesla, or Berkshire Hathaway. However, this swift stock market ascent casts doubt. In a recent commentary, renowned economist Jeremy Siegel sounded the alarm: despite robust fundamentals, Nvidia could be the next victim of a severe speculative backlash. While acknowledging Nvidia’s “special” nature and the company’s long-term growth potential, the economist warns against the risk of a sharp correction. “It’s impossible to say when the speculative frenzy will end. And when extreme valuations normalize, the decline could be abrupt and violent,” he cautions. For Jeremy Siegel, “the early warning signs of a financial bubble are already there.” Indeed, Nvidia’s valuation seems disconnected from its actual economic performance. The chipmaker alone has a stock market value close to that of all the major French companies in the CAC 40! Nevertheless, Siegel believes that a stock market crash is not imminent. “Nvidia’s earnings growth remains strong, which partly justifies the current valuation levels, even though they seem dizzying,” he moderates. It is difficult, however, to predict whether the speculative frenzy surrounding Nvidia will continue or if the stock will quickly fall back, just like many tech stocks did during the burst of the Internet bubble in 2000. This is definitely a situation to monitor closely… Maximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits. Passionné par le Bitcoin, j'aime explorer les méandres de la blockchain et des cryptos et je partage mes découvertes avec la communauté. Mon rêve est de vivre dans un monde où la vie privée et la liberté financière sont garanties pour tous, et je crois fermement que Bitcoin est l'outil qui peut rendre cela possible. The views, thoughts, and opinions expressed in this article belong solely to the author, and should not be taken as investment advice. Do your own research before taking any investment decisions. Receive the latest and best crypto news directly to your inbox in daily, weekly, or special format, to stay updated at your own pace Receive the latest and best crypto news directly to your inbox in daily, weekly, or special format, to stay updated at your own pace "
}