{
    "title": "ServiceNow and NVIDIA Expand Partnership With Introduction of \nTelco-Specific GenAI Solutions to Elevate Service ...",
    "date": "2/25/2024",
    "url": "https://nvidianews.nvidia.com/news/servicenow-nvidia-telco-specific-genai-solutions",
    "text": "Mobile World Congress–ServiceNow (NYSE: NOW), the leading digital workflow company making the world work better for everyone, and NVIDIA (NASDAQ: NVDA) today announced that they are broadening their partnership with the introduction of telco-specific generative AI solutions to elevate service experiences. The first solution, Now Assist for Telecommunications Service Management (TSM), is built on the Now Platform and uses NVIDIA AI to boost agent productivity, speed time to resolution, and enhance customer experiences. As telcos look to reduce costs and uncover new business opportunities, they are turning to AI and automation. In a survey from IDC, 73% of global telecommunications service providers identified AI/ML investments to support operations as their top transformation priority.1 “GenAI is a game-changer for telcos looking to boost productivity, improve customer experiences, and drive cost savings with its ability to learn and improve with each use,” said Rohit Batra, general manager and vice president for telecom, media, and tech at ServiceNow. “Together, ServiceNow and NVIDIA will help telcos realize unprecedented business value and impact, fast. This is just the beginning of a large-scale transformation for the industry, and we’re excited to be at the forefront.” “The telco industry is rapidly evolving as AI makes its mark on enterprises everywhere,” said Chris Penrose, global head of business development for telco at NVIDIA. “Our partnership with ServiceNow will help telcos leverage GenAI to tackle their unique challenges and build better, stronger, more efficient experiences.” Many features within Now Assist are powered by ServiceNow fine-tuned large language models, as well as served using NVIDIA Triton Inference Server™ and customized with NVIDIA NeMo™, both included with NVIDIA AI Enterprise software platform for the  development and deployment of production-grade AI applications, including generative AI. The industry-first Now Assist for TSM solution will help telcos quickly and safely harness the power of generative AI with cutting-edge innovation for business-critical use cases, including: ServiceNow and NVIDIA plan to build out additional telco-specific GenAI use cases based on the unique needs of customers. Together, the companies are working to solve the industry’s biggest challenges and drive business transformation for telcos globally. Partnering for Responsible and Safe AI The telco use cases are an extension of ServiceNow and NVIDIA’s partnership announced in May 2023. Additional Information\r\nFind out how generative AI can help cloud service providers improve business processes, customer experience, and network management. Availability\r\nNow Assist for TSM is available today. 1 IDC, 2023 Telecommunications Service Provider Transformation Plans and Strategies Survey Highlights, Doc # US49352223, May 2023 About NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling industrial digitalization across markets. NVIDIA is now a full-stack computing infrastructure company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/. About ServiceNow\r\nServiceNow (NYSE: NOW) makes the world work better for everyone. Our cloud‑based platform and solutions help digitize and unify organizations so that they can find smarter, faster, better ways to make work flow. So employees and customers can be more connected, more innovative, and more agile. And we can all create the future we imagine. The world works with ServiceNowTM. For more information, visit: www.servicenow.com. ServiceNow Forward-Looking Statements This press release contains “forward‑looking statements” about the expectations, beliefs, plans, and intentions relating to its partnership with NVIDIA to build telco-specific GenAI solutions. Such statements include statements regarding future product capabilities and offerings and expected benefits to ServiceNow. Forward‑looking statements are subject to known and unknown risks and uncertainties and are based on potentially inaccurate assumptions that could cause actual results to differ materially from those expected or implied by the forward‑looking statements. If any such risks or uncertainties materialize or if any of the assumptions prove incorrect, ServiceNow’s results could differ materially from the results expressed or implied by the forward‑looking statements made. ServiceNow undertakes no obligation, and does not intend, to update the forward‑looking statements. Factors that may cause actual results to differ materially from those in any forward‑looking statements include: (i) delays and unexpected difficulties and expenses in executing the partnership or delivering the product capabilities and offerings, (ii) changes in the regulatory landscape related to AI and (iii) uncertainty as to whether sales will justify the investments in the product capabilities and offerings. Further information on factors that could affect ServiceNow’s financial and other results is included in the filings ServiceNow makes with the Securities and Exchange Commission from time to time. NVIDIA Forward-Looking Statements\r\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features, and availability of NVIDIA’s products and technologies, including NVIDIA AI, NVIDIA NeMo, NVIDIA AI Enterprise software platform, and NVIDIA Triton Inference Server; the benefits and impact of the expanded partnership between ServiceNow and NVIDIA, and the features and availability of its services and offerings; the telco industry rapidly evolving as AI makes its mark on enterprises everywhere are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. © 2024 ServiceNow, Inc. and NVIDIA Corporation. All rights reserved. ServiceNow, the ServiceNow logo, Now, and other ServiceNow marks are trademarks and/or registered trademarks of ServiceNow, Inc., in the United States and/or other countries. NVIDIA, the NVIDIA logo, NVIDIA NeMo, and NVIDIA Triton Inference Server are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and/or other countries. Other company names, product names, and logos may be trademarks of the respective companies with which they are associated. Features, pricing, availability, and specifications are subject to change without notice. Download / File Link About NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling industrial digitalization across markets. NVIDIA is now a full-stack computing infrastructure company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/. About ServiceNow\r\nServiceNow (NYSE: NOW) makes the world work better for everyone. Our cloud‑based platform and solutions help digitize and unify organizations so that they can find smarter, faster, better ways to make work flow. So employees and customers can be more connected, more innovative, and more agile. And we can all create the future we imagine. The world works with ServiceNowTM. For more information, visit: www.servicenow.com. ServiceNow Forward-Looking Statements This press release contains “forward‑looking statements” about the expectations, beliefs, plans, and intentions relating to its partnership with NVIDIA to build telco-specific GenAI solutions. Such statements include statements regarding future product capabilities and offerings and expected benefits to ServiceNow. Forward‑looking statements are subject to known and unknown risks and uncertainties and are based on potentially inaccurate assumptions that could cause actual results to differ materially from those expected or implied by the forward‑looking statements. If any such risks or uncertainties materialize or if any of the assumptions prove incorrect, ServiceNow’s results could differ materially from the results expressed or implied by the forward‑looking statements made. ServiceNow undertakes no obligation, and does not intend, to update the forward‑looking statements. Factors that may cause actual results to differ materially from those in any forward‑looking statements include: (i) delays and unexpected difficulties and expenses in executing the partnership or delivering the product capabilities and offerings, (ii) changes in the regulatory landscape related to AI and (iii) uncertainty as to whether sales will justify the investments in the product capabilities and offerings. Further information on factors that could affect ServiceNow’s financial and other results is included in the filings ServiceNow makes with the Securities and Exchange Commission from time to time. NVIDIA Forward-Looking Statements\r\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features, and availability of NVIDIA’s products and technologies, including NVIDIA AI, NVIDIA NeMo, NVIDIA AI Enterprise software platform, and NVIDIA Triton Inference Server; the benefits and impact of the expanded partnership between ServiceNow and NVIDIA, and the features and availability of its services and offerings; the telco industry rapidly evolving as AI makes its mark on enterprises everywhere are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. © 2024 ServiceNow, Inc. and NVIDIA Corporation. All rights reserved. ServiceNow, the ServiceNow logo, Now, and other ServiceNow marks are trademarks and/or registered trademarks of ServiceNow, Inc., in the United States and/or other countries. NVIDIA, the NVIDIA logo, NVIDIA NeMo, and NVIDIA Triton Inference Server are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and/or other countries. Other company names, product names, and logos may be trademarks of the respective companies with which they are associated. Features, pricing, availability, and specifications are subject to change without notice. Global contacts for media inquiries. Newsroom updates delivered to your inbox. "
}