{
    "title": "TSMC Posts Record Revenue – Apple, NVIDIA To Blame Says Report",
    "date": "2/7/2024",
    "url": "https://wccftech.com/tsmc-posts-record-revenue-apple-nvidia-to-blame-says-report/",
    "text": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy. After an optimistic investor call that saw its management share positive thoughts about the market of artificial intelligence products, the Taiwan Semiconductor Manufacturing Company (TSMC) has started 2024 on a strong note by delivering annual and sequential revenue growth for the month of January. Since TSMC's revenue is dependent on its customers' semiconductor design cycles, and these, in turn, are dependent on product launch timelines, the firm's revenue is seasonal and fluctuates on a monthly basis. TSMC's revenue picks up in the summer as its customers head to their annual product refresh cycles, and the gist of investor sentiment for the firm, as we enter 2024, surrounds the growth in high performance computing revenue on the back of the demand for artificial intelligence processors, graphics units and other semiconductors. The key takeaway for TSMC's expected performance in 2024, according to comments from management during the firm's earnings call for the fourth quarter, revolves around capacity utilization, demand for artificial intelligence products and global macroeconomic conditions. 2023 was a tough year for TSMC, as it built on the industry slowdown that started in 2022. Now, TSMC's January 2024 revenue of NT$215 billion is a new record for the month. It marks a 22% growth over December and a 7.8% growth over January 2023 - a period that saw semiconductor bigwigs such as NVIDIA and AMD hold back their orders as they waited for the market to digest inventory already produced based on forecasts that relied on the boom in semiconductor demand following the outbreak of the coronavirus pandemic. Janaury 2024 also marks an acceleration in annual revenue growth that has slowed down during the past couple of years. In January 2020 - the last normal January before the virus struck - TSMC's January revenue grew by 32.8% annually. Annual revenue growth stood at 22.2% and 35.8% in January 2021 and January 2022; however, January 2023 saw the growth slow down to 16.2% due to a higher base and a broader slowdown in the chip industry. As to the reasons behind this growth, analysts from Taiwan are making some educated guesses. They believe that a demand for TSMC's N5 and N3 product families from firms such as Apple and NVIDIA has helped with revenue growth in January, and it also has the potential to boost the firm's revenue for the first quarter. N3 and N5, which refer to several TSMC chip manufacturing technologies such as 5nm, 4nm and 3nm, are crucial for TSMC's performance this year. The firm is currently shaking things up and upgrading its N5 machines to also make N3 chips. The latter are more technologically advanced, and they feature transistors with smaller feature sizes. Through this, the Taiwanese firm hopes to further spread out the costs of its existing machines over future technologies as well and enable greater cost efficiency and margins. However, during its earnings conference, TSMC's chief financial offier Wendell Huang shared that since the N5 tools will now be adapted to N3 as well, costs will rise in the short term. The bulk of its impact on the income statement will take place in the second half and reduce its gross margin by at least 1%, outlined the executive. The gross margin is the percentage of a firm's revenue left after direct manufacturing costs are accounted for, and higher percentages mean that a company is earning more money per unit of product produced. Higher orders for the advanced N5 and N3 products also mean that TSMC is able to recover its equipment costs earlier. Its latest manufacturing technology is N3, and it entered volume production in 2023 after Apple started to ship its products with the latest processors. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}