{
    "title": "Nvidia expands into custom chip design for AI and beyond: Report",
    "date": "2/12/2024",
    "url": "https://www.techcircle.in/2024/02/12/nvidia-expands-into-custom-chip-design-for-ai-and-beyond-report/",
    "text": "Chipmaker Nvidia is set to launch a new business unit with a focus on designing custom chips for cloud computing firms and other entities, including advanced artificial intelligence (AI) processors, according to a report by Reuters. The move comes as Nvidia aims to tap into the rapidly growing market for specialised AI chips and safeguard its position against rising competition. Currently controlling about 80% of the high-end AI chip market, the Santa Clara-based company has witnessed a significant surge in its stock market value, soaring by 40% this year to $1.73 trillion, following a more than threefold increase in 2023. Also read: Nvidia may cross $500 mn revenue mark in India this year As per the report, Nvidia’s key clients such as OpenAI, Microsoft, Alphabet, and Meta Platforms are increasingly seeking customised chip solutions to enhance performance and efficiency across various domains including Gen AI, Cloud Computing, 5G, and automotive applications. This reflects a broader industry trend towards tailored chip designs, enabling companies to optimise performance and accelerate innovation while cutting costs. Besides AI, the new unit may also venture into designing custom hardware for telecom, cloud, automotive, and gaming sectors. This strategic move mirrors AMD's success in providing custom processors for Xbox and PlayStation consoles. Nvidia's ambitious push into custom hardware signals a response to increasing competition in the AI space, which has driven substantial profit growth for the company. Furthermore, Nvidia is reportedly in discussions with telecom infrastructure builder Ericsson to develop a wireless chip integrating Nvidia's GPU technology. The company also eyes opportunities in the automotive and gaming markets. Last year in September, Nvidia announced partnerships with India's Reliance Industries and Tata Group to boost AI infrastructure and skills development in the country. CEO Jensen Huang disclosed plans to collaborate with Reliance on developing a large language model tailored for India's diverse linguistic landscape, while also offering AI supercomputing services. With Tata Group, Nvidia aims to support the local economy and foster AI innovation. The expansion into custom chip design underscores Nvidia's commitment to staying at the forefront of technological advancement and meeting the evolving needs of its clients and markets worldwide. "
}