{
    "title": "Nvidia’s New AI Chip for China Priced Close to Huawei Alternative",
    "date": "2/1/2024",
    "url": "https://www.asiafinancial.com/nvidias-new-ai-chip-for-china-priced-close-to-huawei-alternative",
    "text": "The new H20 chip, made for China’s AI market, has less power than 2 chips banned late last year, but is still seen as having a key advantage over Huawei’s Ascend 910B  Nvidia has started taking preliminary orders for a new artificial intelligence (AI) chip made specifically for China, and sources say distributors are pricing it close to the price for a rival product from Huawei. The H20 graphics card is the most powerful of three chips that the US company has been developing for the Chinese market after the Biden Administration expanded bans on high-end chip exports, in a bid to hamper China’s ability to develop AI and sophisticated computers used by its military.   The H20 will deliver less computing power than Nvidia’s flagship H100 AI chip and the H800 – the later China-specific card that was also banned in October. Specifications for the H20 also appear to indicate it is less powerful than Huawei’s Ascend 910B in some key areas, according to three sources, who were not authorised to speak to media and declined to be identified. Nvidia has in recent weeks been pricing orders for H20 distributors in China in a range of $12,000 to $15,000 per card, according to two sources. Some distributors have started advertising the chips with a significant markup to the lower end of that range at about 110,000 yuan ($15,320), one of the sources said. By comparison, Huawei’s 910B is being sold for around 120,000 yuan, two of the sources said. Nvidia declined to comment.  One source said distributors are offering H20 servers, which are pre-configured with 8 of the AI chips, for 1.4 million yuan. By comparison, servers that used 8 of the H800 chips were sold at around 2 million yuan when they were launched a year ago. Distributors have told clients they will be able to start delivering the H20 products in small batches in the first quarter of 2024 and in larger quantities from the second quarter, the source added. Before the US curbs, Nvidia dominated China’s AI chip market with more than 90% share. However, it currently faces increasing competition from domestic rivals, chief among them being Huawei. Huawei’s 910B chip is widely considered the most competitive AI offering now available within China and has become more popular amid concern that buyers could be faced with further restricted access to Nvidia’s products resulting from US sanctions.    A post shared by Asia Financial (@asiafinancial)   In terms of specifications, one example of where the H20 appears to lag the 910B in its FP32 performance – a critical metric that measures how quickly a chip can process common tasks and which is rated at less than half of its rival’s capability, one source said. However, the H20 appears to have an advantage over the 910B in terms of interconnect speed, which measures how quickly data can transfer between chips, according to the source. That means the H20 remains competitive with the 910B in applications that require linking a large number of chips together to work as a system, he said. Last month Reuters reported that Nvidia plans to begin mass production of the H20 in the second quarter of this year. It was originally scheduled for launch last November but that plan was delayed, with sources saying at the time that the delay was due to issues that server manufacturers were having in integrating the chip. Nvidia also plans to roll out two other China-specific chips, the L20 and the L2. Reuters was not able to determine the current status of the rollout for those two chips. Neither the H20, the L20 or the L2 are currently listed on Nvidia’s website. Underscoring the importance of the China market to Nvidia, CEO Jensen Huang visited the company’s offices in Shenzhen, Shanghai and Beijing last month for the company’s annual parties before the Lunar New Year holiday, local media reported. China’s state media said recently that Customs statistics showed the country imported 479.5 billion chips in 2023, down 10.8% year-on-year, with a value of $349.4 billion. The latter sum was a 15.4% decline from 2022, which was attributed to the US export ban on high-end artificial intelligence chips.   NOTE: Further detail was added to this report on February 1, 2024.            Jim Pollard is an Australian journalist based in Thailand since 1999. He worked for News Ltd papers in Sydney, Perth, London and Melbourne before travelling through SE Asia in the late 90s. He was a senior editor at The Nation for 17+ years.  Asia Financial is owned by Capital Link International Holdings Ltd,\n902, Wilson House 19-27 Wyndham Street, Central, Hong Kong. www.capitallinkintl.com "
}