{
    "title": "Is Palantir (PLTR) the Next Nvidia (NVDA)?",
    "date": "2/15/2024",
    "url": "https://www.cabotwealth.com/daily/tech-stocks/is-palantir-pltr-the-next-nvidia-nvda",
    "text": "While stocks like Nvidia (NVDA) and Super Micro Computer (SMCI) have garnered much of the attention of traders in late 2023 and early 2024 for their monster stock gains, many traders are now focused on finding the next NVDA, and I think there is a chance that Palantir (PLTR) could fit that bill. Here is why …  PLTR stock exploded higher by approximately 30% following the release of its earnings report last week. The short version of why the stock reacted so well to earnings is that PLTR is in the perfect spot for the potential AI revolution. Or if you want a bit more detailed breakdown on why PLTR stock exploded higher, here is just some of what fellow Cabot Analyst Mike Cintolo wrote in his outstanding Cabot Top Ten Trader: [text_ad] “Palantir has seemed perfectly positioned for the AI boom for about a year now: The company’s history as a provider of advanced software and analytical/security platforms for government entities (especially U.S. and friendly militaries) means it’s been leveraging various forms of AI and machine learning for years, putting it way ahead of others when it comes to developing a platform that can be mass adopted not just by governments, but by big companies looking to dramatically streamline operations.  “In Q4, U.S. commercial revenue surged 70% as the customer count lifted 55% and total contract value inked more than doubled (and rose 42% from the prior quarter!), with new clients (including some huge ones) signing up and existing clients expanding their usage.”  And while the company story and potential are impressive, of much greater interest to me is the wild call buying activity since the earnings report. Here is a small sample of this bullish option activity:  2/7 - Buyer of 10,000 Palantir (PLTR) March 21 Calls, 25,000 March 23 Calls, 22,000 March 25 Calls – Stock at 21  2/8 - Buyer of 50,000 Palantir (PLTR) May 25 Calls for $2.50 – Stock at 23.25  2/9 - Buyer of 5,000 Palantir (PLTR) September 31 and September 32 Calls – Stock at 24.35  I could easily list 200 more call-buying trades if I wanted to in the last week, but I think you get the point … options traders are expecting the stock to move higher.  And in fact, what makes this call buying interesting, outside of the big premiums spent is that this call buying could create a self-fulfilling prophecy of sorts for the stock to move higher. This is what I mean: Back in the day when I was an options market maker on the floor of the Chicago Board of Options Exchange (CBOE), when a broker came into my crowd and bought calls, I would sell him those calls and then immediately buy stock to hedge off that call sale. If I sold 10 calls, I might buy 500 shares to hedge. If I sold 2,000 calls, I might buy 10,000 shares … it really depended on which calls I was selling. This was simple hedging. Now, as we got closer to expiration, if those 2,000 calls I sold were likely to finish in the money I would have to buy more and more stock as it became more and more likely that I would be short stock on expiration via the exercise of those 2,000 calls. So how are we seeing this in PLTR? The call buying in PLTR is off the charts in terms of size. And every time a trader buys 1,000 calls, or 2,000 calls, or any number of calls, the market maker who sold those calls has to buy stock, which pushes the stock higher. As the stock moves higher the likelihood of those calls that were sold finishing in the money increases, and the market maker then has to buy more and more stock. It almost becomes a self-fulfilling prophecy pushing the stock higher. I bring this up to highlight that as we continue to see WILD call buying, the likelihood of PLTR stock moving higher will continue to improve … though as always with any stock, and especially in the highly controversial AI investing world, only time will tell whether PLTR is the next NVDA, or just another overhyped bubble stock. Should be interesting! Jacob’s Cabot Options Trader subscribers recently closed a partial position in PLTR for a 90% gain; for more information about joining them, click here. [author_ad]  Get My Free Report As Seen On    Choose Your Free Reports You have access to our expertly curated collection of free investing reports, including 5 Best Stocks to Buy this Month, How to Find Undervalued Stocks, How Options Work, and more.  Get My Reports Capitalizing on the Bull Market: 4 Experts & Their Top Picks for April 2024    FREE WEBINAR: Tuesday, March 26, 2024 at 12:00 PM ET with seasoned Cabot analysts Mike Cintolo, Tyler Laundon, Tom Hutchinson, and Carl Delfeld          Register Now Copyright © 2024 Cabot Heritage Corporation, All Rights Reserved | Privacy Policy | Terms of Use & Conditions of Sale "
}