{
    "title": null,
    "date": "1/9/2024",
    "url": "https://www.techradar.com/computing/gpu/nvidias-gpu-battle-with-amd-could-get-hit-by-low-stock-for-its-new-rtx-super-graphics-cards",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Nvidia’s new GPUs might be difficult to buy – except for the RTX 4070 Super Nvidia just revealed its new RTX Super graphics card refreshes at CES 2024, but if you were hoping to bag one as they hit the shelves throughout January, that endeavor may not be as straightforward as you’d hope. Mainly because rumor has it that Nvidia’s production levels for these new GPUs may be on the lean side. This is the word from Moore’s Law is Dead (MLID), a YouTube leaker who certainly nailed the speculation behind these incoming refreshes some time back – and got the pricing correct. MLID has previously raised concerns around the potential supply levels for the RTX Super GPUs coming during January, and has now heightened these with fresh chatter on the grapevine from various sources. One of those is apparently one of MLID’s best sources for supply info – a global distributor – who reckons Nvidia will make as many of all three of these graphics cards as would normally be allocated for a single GPU launch. In other words, the production runs underway will only be a third of what would normally be expected – so you might struggle to find stock before it sells out when the graphics cards go on sale. A second source, who works at a major retailer, agrees that this is a ‘light launch’ or that it’s likely to be, noting that the RTX 4070 Super (which is first out the door) might see decent initial supply, but the other two models (RTX 4070 Ti Super, 4080 Super) are likely to be thin on the ground. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. A third source (who works at Nvidia) agrees that the RTX 4070 Super is likely to see the most volume of production, with ‘okay’ availability as a result, and that the other models won’t be so widely available until the existing RTX 4070 Ti and RTX 4080 sell through. The broad expectation, certainly for the RTX 4070 Ti Super and RTX 4080 Super, is that stock might sell out pretty much in a flash, and even the RTX 4070 Super, which will see more units shipped, will only have decent (not good) availability. Furthermore, resupply on these graphics cards down the road from the initial launch may be sluggish, we’re told. Add plentiful seasoning with all this, naturally, but it pretty much mirrors what other sources have previously told Moore’s Law is Dead, and what we’ve been hearing of late elsewhere on the grapevine more broadly about Nvidia’s GeForce production (worrying stuff, in fact). Indeed, this fresh speculation is certainly believable enough in our books especially given one key factor here. Remember that the RTX 4070 Ti and RTX 4080 are being scrapped, phased out to make room for the new 4070 Ti Super and 4080 Super – there’s no way all those GPUs could coexist comfortably in such a small performance bracket, after all. So, it’d make sense that Nvidia is pacing the entrance of the 4070 Ti Super and 4080 Super to allow for card makers and retailers to shift the remaining stock of the vanilla versions. Again, add salt, but it does ring true enough. MLID suggests that we might be waiting until March 2024 (at least) for better supply of these Super refreshes to manifest, and that in particular, there may be a fair bit of RTX 4070 Ti stock to sell. Currently inventory levels may not be such a problem with the RTX 4080, given that it’s had such a poor reception and lack of interest that volumes have likely already been notched down on the assembly lines (we’d guess, anyway). Those angling after one of these RTX Super refreshes – which look compelling new entries to the market at their relatively competitive pricing (certainly for Nvidia) – may face a scramble to secure their purchase, sadly. At least for a couple of months after launch, anyway, though the RTX 4070 Super is likely to be the exception on the inventory front (depending on how popular it turns out to be, of course). MLID dropped a bit of good news on the AMD front in this video, namely that the freshly revealed Radeon RX 7600 XT – the pepped up take on the 7600 which was also revealed at CES 2024, packing 16GB of VRAM – is likely to have robust stock levels at launch. And Team Red is ready with plenty of resupply, assuming the GPU sells well, naturally. (And it’s likely to – this GPU may be a great candidate to rank well on our list of the best cheap graphics cards, considering the RX 7600 is the current top pick). Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). Another driver update, another set of huge performance boosts for free, as Intel Arc GPUs keep getting better The Nvidia RTX 4060, 4060 Ti, and 4070 GPUs could get refreshes soon Microsoft reveals cause of widespread Windows Server issue By Benedict CollinsMarch 22, 2024 By Darren AllanMarch 22, 2024 By Darren AllanMarch 22, 2024 By Carrie MarshallMarch 22, 2024 By Craig HaleMarch 22, 2024 By Lewis MaddisonMarch 22, 2024 By Rhys WoodMarch 22, 2024 By David NieldMarch 22, 2024 By James RogersonMarch 22, 2024 By Craig HaleMarch 22, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}