{
    "title": null,
    "date": "1/29/2024",
    "url": "https://www.marketwatch.com/story/supermicro-is-heading-toward-an-nvidia-like-second-half-but-is-it-sustainable-ea0dd999",
    "text": "Super Micro Computer Inc., riding high on its ability to sell servers loaded with many of Nvidia’s chips, is now seeing growth rates similar to the chip giant, prompting investors to question how long this AI boom can last. The question is even more applicable to Supermicro \n        SMCI,\n        +0.12%\n       than Nvidia because, by definition, the computer and server maker is in a commoditized business. Nvidia \n        NVDA,\n        +3.12%\n       designs its own proprietary graphics processor chips that are in huge demand for AI applications, while servers to run them can be interchangeable parts. But Supermicro Chief Executive Charles Liang told Wall Street analysts on Monday that he believes the stunning growth is just beginning. “Overall, I feel very comfortable that this boom will continue for another many quarters, if not many years,” Liang said on the company’s call with analysts, after the company’s strong quarterly results and monster outlook. In the second quarter, revenue soared 103%. He noted that Supermicro’s fiscal second-quarter revenue of $3.66 billion outpaced the company’s full-year revenue of $3.5 billion in all of fiscal 2021. Supermicro’s guidance for its fiscal third quarter ending in March calls for revenue ranging from $3.7 billion to $4.1 billion, growth of about 204% at the midpoint. For fiscal-year 2024, Supermicro raised its revenue guidance to a range of $14.3 billion to $14.7 billion, up 103% at the midpoint. “The demand is stronger than supply,” Liang told analysts. “So if we have more supply we might be able to ship more.” The company has said in the past that it has tight relationships with most of the semiconductor companies in Silicon Valley, including Nvidia, and that it is able to ship its servers with new chips faster than its rival server makers. Monday, it also said its building-block architecture gives it another advantage. “We’re the fastest to market because of the way that we have architected our products,” said David Weigand, SuperMicro’s chief financial officer. “So what that means is there’s a lot of new technologies that are coming out from many different technology providers. And we expect to…be first to market with those. And that first-to-market advantage helps us, helps to differentiate ourselves as we come out with a complete set of solutions.” Some analysts on the company’s call did voice some concerns about falling gross margins, and Weigand said that on some occasions, Supermicro will try to win new customers and more market share with pricing. “We aregrowing really quickly. And in order to do that, in order to take market share, we will take opportunities by, you know, by being more competitive on pricing,” Weigand said. He also pointed to two existing, unnamed customers that represented a large chunk of Supermicro’s revenue in the quarter: one large data-center customer (believed to be Meta Platforms Inc. \n        META,\n        +0.36%\n      ) represented 26% of revenue, and another represented 11% of revenue. Supermicro executives highlighted their systems’ advantages over the company’s main competitors, without naming Dell Technologies \n        DELL,\n        -1.58%,\n       Hewlett Packard Enterprise \n        HPE,\n        +0.93%,\n        IEIT Systems Co. Ltd. \n        000977,\n        -1.11%\n       and Lenovo. Indeed, Supermicro has gained market share in the past year, according to IDC, leaping over Lenovo to become No. 4 global server vendor in the second quarter of 2023. Read more: Why Supermicro is mopping up the floor with the competition. But as with everything that skyrockets, after so much growth, investors are going to get nervous about when it’ll start to come down. And in the case of computer-server makers, those concerns are entirely justifiable. Just as Sun Microsystems became a favored server vendor during the dot-com boom, Supermicro is clearly gaining a similar status in the AI era. But it also needs to avoid a similar fall.  The fast-food chain Chick-Fil-A backtracked from its decade-old “no antibiotics ever” pledge intended to help prevent human antibiotic resistance linked to the rampant use of the drugs in livestock production. Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. Visit a quote page and your recently viewed tickers will be displayed here. "
}