{
    "title": null,
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/nvidia-stock-tripled-past-still-041824134.html",
    "text": "Nvidia stock will keep going up, Bernstein's Stacy Rasgon told CNBC. The stock is cheaper than other semiconductor firms given its massive earnings. Apart from AI growth, the company will also get a boost from its product roadmap. Nvidia's sky-high valuations may give investors pause, but the chipmaker's stock will continue to soar, Bernstein senior analyst Stacy Rasgon told CNBC on Wednesday. In early January, the semiconductor firm became the S&P 500's fourth most valuable company, breaking out to new record highs. On Wednesday afternoon, the stock was trading around $556 per share. Though some have fretted as to how sustainable such high valuations might be, Rasgon holds a price target of $700 for Nvidia, arguing that the artificial intelligence trend will keep pumping its performance. \"You talk about the stock tripling, look how much the earnings went up — the earnings went up, I don't know, six or seven times or whatever the number is, because of the size of the opportunity, their competitive positioning within that opportunity, their product roadmap and everything else,\" he said. Nvidia's last earnings report showed record revenue of $14.51 billion in the third quarter, marking a 279% gain from the same quarter in the prior year. Given the pace at which earnings are outpacing the rise of its stock, this makes Nvidia's multiples highly attractive, Rasgon added. \"It is actually, if you believe it, one of the cheapest ways to play the AI theme in the space,\" he said. \"AMD is much more expensive than Nvidia, Marvell is much more expensive than Nvidia, even Intel, they're not that different from each other at this point.\" Through 2023, Nvidia stock climbed 223%, with the chipmaker one of seven mega-cap tech firms that powered stellar gains for the S&P 500. It earned a massive boost from developments in AI, given that its semiconductors are often used to create the infrastructure used by the emerging technology. The company is also not slowing down, and Rasgon highlighted the launch of new products that will keep it on top, such as the Grace Hopper super chip and a coming upgrade to its H200 GPU. \"I don't know that the multiple can go down any more than frankly it has,\" he told CNBC in December. Read the original article on Business Insider "
}