{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.videogamer.com/tech/where-to-buy-rtx-4070-super-rtx-4070-ti-super/",
    "text": "Posted in Tech Video Gamer is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Learn more We’re showing you where to buy RTX 4070 Ti Super graphics cards in the US and the UK. You’re in the right place if you’ve been scrambling at different retailers. Below we’re rounding up all the cheapest RTX 4070 Ti Super stock available as it becomes available. Let’s get into it. We’re committed to helping you to get the best RTX 4070 Ti Super prices available online, and arming you with all the information you need to know. We highly recommend checking out our comparison pieces of RTX 4070 Ti vs RTX 4070 Ti Super, alongside against the RX 7600 XT. For a cheaper recently released alternative, we’re also showing you where to buy RTX 4070 Super, too. This latter card was released earlier in the week. What’s more, we’re also showing you where to buy RTX 4070 Super graphics cards, too. It’s been just under a week since the new mid-range option launched in the US and the UK. Below you’ll find the cheapest prices available for this card. Furthermore, you can get clued up on both and their differences with our dedicated RTX 4070 Super and RTX 4070 Ti Super hub so you’re up to speed on the performance and technical details. We’re also pitting the latest models against their predecessors in our dedicated RTX 4070 vs RTX 4070 Super and RTX 4070 Ti vs RTX 4070 Ti Super features as well. The RTX 4070 Ti Super launched today (January 24, 2024) and will carries starting MSRP of $799 as confirmed by Nvidia itself. Whether partner cards will stick closely to this recommended price remains to be seen, but we’re bringing you the cheapest options available in price ascending order. The world’s largest online retailer has some RTX 4070 Ti Super stock available. It’s early days so we’ll be updating you with more listings as they become available. Newegg has some of the cheapest RTX 4070 Ti Super stock available at the early stages of sale. We’ll be bringing you more listings as they come available. Best Buy has gone live with RTX 4070 Ti Super stock, but options are fleeting this early into the sales. We’ll be including more listings as they go live. Over in the UK, the GPU starts at £769 according to Nvidia and we’re bringing you all the retailers with listings available now. Overclockers UK is leading the charge with the biggest variety of RTX 4070 Ti stock available and at the lowest prices seen yet. We’ll be updating you with more options as they come rolling in, but these are the best we’ve found right now. Scan is a leading UK retailer when it comes to graphics card launches and it seems as though it’s no exception with its RTX 4070 Ti Super stock. No prices have been revealed yet, however, we do have listing pages and their respective models available. We expect these to go live in the early afternoon. We’ll be updating you when the world’s largest online retailer goes live with RTX 4070 Ti Stock in the UK. The RTX 4070 Super is available right now in the US. RTX 4070 Super stock starts at $599.99. We’ve listed the cheapest prices we can find below. We’re constantly adding new models as they come in, and we’re expecting availability to be limited on the cheaper end of the spectrum, son don’t delay if you’re after a card for the best price. Newegg has freshly restocked its RTX 4070 Super supply and we’re listing all the available variants at prices ascending (cheapest first) so you can find the right one for you. Stock is rapidly selling out so we recommend acting sooner rather than later. The world’s largest online retailer now has some RTX 4070 Super GPUs available for sale, but it’s a more limited offering than some other US retailers. We’ll be updating you as more become available. Best Buy briefly had RTX 4070 Super graphics cards listed as available, however, now they appear to be “Sold Out” according to the listings. It’s possible that stock could be updated shortly as the website accurately preps its inventory. We’ll keep you posted on the developments. The RTX 4070 Super starts from £579, and we’ve rounded up all the cheapest graphics cards we could find from the likes of Scan, Amazon, and Overclockers UK. Let’s get into it. Overclockers UK is leading the charge with RTX 4070 Super stock in the UK. There are many cards available for purchase and pre order for RRP including representation from Gainsward, Zotac, Inno3D, Palit, MSI, and others. We’d recommend starting here first. Scan has a handful of RTX 4070 Super graphics cards available for purchase at RRP including models by Palit, MSI, ASUS, and Zotac. However, stock appears to be waning. The world’s largest online retailer has had a staggered RTX 4070 Super launch with the cards going live in a very select volume right now. We’ll be updating you as more stock goes live so you don’t miss out. Here’s what we’ve found at RRP so far. The RTX 4070 Super and RTX 4070 Ti Super represent a much-needed redemption arc for the RTX 40 series. While Ada is no doubt incredibly powerful, the pricing has alienated many. By offering increased performance without bumping the rates up, these cards are now more capable and befitting of their respective pricing, more so than back in 2022. The Nvidia RTX 4070 Ti Super starts at $799 / £769 as the recommended price by Nvidia. However, it will be up to the partners to keep these rates consistent with their respective models. No. Nvidia has confirmed that there will not be an RTX 4070 Ti Founders Edition. However, there is an FE model for both the RTX 4070 Super and the RTX 4080 Super. From what we’ve seen of Nvidia’s benchmarks, yes, the RTX 4070 Ti Super appears to be better than the RTX 4070 Super. However, the card is yet to be released so we’ll give you a more updated opinion once our review is live. From a technical perspective, the former is built on a larger AD103 die with 16GB GDDR6X memory, just like the RTX 4080. Image Credit: Nvidia Aleksha McLoughlin is VideoGamer's Hardware and Affiliates Editor and she looks after all hardware and Ecommerce performance for the site as well as manages the hardware team. "
}