{
    "title": "You'll Wish You Had Bought Broadcom Stock at $1000",
    "date": "1/12/2024",
    "url": "https://investorplace.com/2024/01/youll-wish-you-had-bought-broadcom-stock-at-1000/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Stock up on AVGO stock and collect those juicy dividends every three months Advertisement Source: Sasima / Shutterstock.com Go ahead — pick a reason, or two or three, to buy Broadcom (NASDAQ:AVGO) stock. Maybe you’re seeking portfolio exposure to artificial intelligence (AI) hardware. Or, perhaps you’re a passive-income investor or just want to balance growth and value. By taking a share position in Broadcom, you can get all of the above with just one technology stock. Indeed, Broadcom is a company that ought to be mentioned more often in the financial press. Granted, Broadcom isn’t part of the so-called “Magnificent Seven,” but it’s a magnificent idea to start a position in AVGO stock before $1,000 is just a distant memory. While the press is busy talking about the massive gains in Nvidia (NASDAQ:NVDA) stock last year, they’re overlooking a semiconductor-devices stock that also provided stellar returns. Specifically, AVGO stock rode the AI hardware wave in 2023 from $600 to $1,000. Despite this share-price growth, Broadcom isn’t extremely overvalued. Notably, Broadcom’s GAAP-measured trailing-12-month price-to-earnings (P/E) ratio is 32.1x. That’s not too elevated when compared to Nvidia’s trailing P/E ratio of 62.66x and the valuations of some other “Magnificent Seven” companies. It’s not only AVGO stock that’s growing. Broadcom’s financials are also growing, with the company’s fourth-quarter fiscal 2023 net revenue increasing 4% year over year. Plus, for all of fiscal year 2023, Broadcaom’s revenue grew 8% year over year to a company record of $35.8 billion. Broadcom CEO Hock Tan attributed this and other positive quarterly results to “investments in accelerators and network connectivity for AI by hyperscalers.” On top of all that, Broadcom offers a forward annual dividend yield of 1.76%. That’s an added bonus — and by the way, some “Magnificent Seven” companies don’t offer any dividends at all. Like I said earlier, Broadcom doesn’t receive a lot of coverage in the financial media. So, I was glad to see a strategist, Laffer Tengler Investments CEO Nancy Tengler, discussing Broadcom recently. Yet, I was shocked to hear Tengler call Broadcom the “poor man’s Nvidia.” Tengler also acknowledged that Broadcom is a “leader in AI.” Still, I must object to the idea that Broadcom is just a lesser version of Nvidia. Broadcom is a disruptor and innovator in its own right. For instance, Broadcom is collaborating with Caltech, a world-renowned institute of technology and science. Together, Broadcom and Caltech will work to advance research in quantum science. In addition, Broadcom supplies components for the likes of Apple (NASDAQ:AAPL) and Alphabet’s (NASDAQ:GOOG, NASDAQ:GOOGL) Google. So, it’s not really fair to characterize Broadcom as a “poor man’s” version of another company. Broadcom stock will, sooner or later, trade at much more than $1,000. Remember, this is a world-class company that will ride the AI hardware wave higher, just like Nvidia has done. It’s also a nice bonus that Broadcom pays a dividend and isn’t extremely overvalued. In the final analysis, investors should take a close look at AVGO stock and seriously consider a buy-and-hold position today. On the date of publication, David Moadel did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. David Moadel has provided compelling content – and crossed the occasional line – on behalf of Motley Fool, Crush the Street, Market Realist, TalkMarkets, TipRanks, Benzinga, and (of course) InvestorPlace.com. He also serves as the chief analyst and market researcher for Portfolio Wealth Global and hosts the popular financial YouTube channel Looking at the Markets. Technology, Semiconductor   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/youll-wish-you-had-bought-broadcom-stock-at-1000/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}