{
    "title": null,
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/news/seeking-clues-rtx-rtx-q4-184200390.html",
    "text": "Wall Street analysts forecast that RTX (RTX) will report quarterly earnings of $1.25 per share in its upcoming release, pointing to a year-over-year decline of 1.6%. It is anticipated that revenues will amount to $19.75 billion, exhibiting an increase of 9.2% compared to the year-ago quarter. Over the past 30 days, the consensus EPS estimate for the quarter has been adjusted upward by 1.6% to its current level. This demonstrates the covering analysts' collective reassessment of their initial projections during this period. Prior to a company's earnings announcement, it is crucial to consider revisions to earnings estimates. This serves as a significant indicator for predicting potential investor actions regarding the stock. Empirical research has consistently demonstrated a robust correlation between trends in earnings estimate revision and the short-term price performance of a stock. While investors typically use consensus earnings and revenue estimates as a yardstick to evaluate the company's quarterly performance, scrutinizing analysts' projections for some of the company's key metrics can offer a more comprehensive perspective. In light of this perspective, let's dive into the average estimates of certain RTX metrics that are commonly tracked and forecasted by Wall Street analysts. Based on the collective assessment of analysts, 'Net Sales- Pratt & Whitney- Adjusted' should arrive at $6.43 billion. The estimate indicates a change of +13.7% from the prior-year quarter. The consensus among analysts is that 'Operating Profit- Collins Aerospace- Adjusted' will reach $1.08 billion. Compared to the present estimate, the company reported $743 million in the same quarter last year. According to the collective judgment of analysts, 'Operating Profit- Pratt & Whitney- Adjusted' should come in at $350.86 million. Compared to the present estimate, the company reported $321 million in the same quarter last year.View all Key Company Metrics for RTX here>>>RTX shares have witnessed a change of +4.2% in the past month, in contrast to the Zacks S&P 500 composite's +0.6% move. With a Zacks Rank #4 (Sell), RTX is expected underperform the overall market performance in the near term. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report RTX Corporation (RTX) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research "
}