{
    "title": "Nvidia's Jensen Huang swaps biker chic for traditional garb in China",
    "date": "1/23/2024",
    "url": "https://www.businessinsider.com/nvidia-jensen-huang-china-visit-leather-jacket-traditional-floral-dance-2024-1",
    "text": "       As the cofounder and CEO of Nvidia, Jensen Huang is known for building the company into the world's leading AI chipmaker. He's also quite identifiable for his signature biker-esque style. But a recent visit to China saw Huang changing up his wardrobe as he shed his iconic black leather jacket for a vest in a traditional floral print fabric, Chinese state media reported recently. It was his first trip to the country in four years. Nvidia did not immediately respond to a request for comment from Business Insider sent outside regular business hours, but confirmed Huang's visit to Bloomberg and the South China Morning Post. A company rep told SCMP that Huang was in China to celebrate Chinese New Year — which falls in February this year — with local staff. Related stories Nvidia staff posted videos of the celebrations on social media. In one of them, the 60-year-old Huang can be seen wearing a red floral vest while performing a traditional dance that required him to twirl a handkerchief in each hand. Nvidia CEO Jensen Huang visited the company's offices in Shanghai, Beijing, and Shenzhen last week, taking part in year-end festivities. He engaged in the traditional twist Yangge, a popular rural folk dance in northeast China, wearing a traditional flower-patterned vest. pic.twitter.com/rFGhjBgqoY #Nvidia’s co-founder and CEO Jensen Huang recently attended the firm’s annual parties in Chinese mainland while wearing the traditional northeastern big flower jacket and performed the #yangko dance, photos posted by the staff on social media showed. Huang's trip didn’t include… pic.twitter.com/3seH4yO94O Huang visited Nvidia offices in the cities of Beijing, Shanghai, and Shenzhen, according to various reports. It's unclear if he met any industry executives or officials. Huang's trip to China came amid intensifying rivalry between Washington and Beijing over a range of issues, including tech and geopolitics. In October, the Biden administration announced restrictions to limit the export of some AI chips to China. The restrictions thrust Nvidia into a difficult position since China has typically accounted for about one-fifth of the company's revenue. In late December, Nvidia unveiled a slower, less powerful chip that complies with US export controls and can be sold in China. However, some of China's largest cloud companies don't want the lower-performance chips. Read next Jump to "
}