{
    "title": "The Best AI Investment Right Now Is Obvious (Hint: It's Not Nvidia)",
    "date": "1/31/2024",
    "url": "https://www.fool.com/investing/2024/01/31/the-best-ai-investment-now-is-obviously-not-nvidia/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Although many point to Nvidia (NVDA 3.12%) as the best artificial intelligence (AI) investment right now, I'm staying away from it. Because Nvidia is a hardware company, this strength will eventually fade, and investors will be stuck holding a stock valued for a business it no longer has. Instead, a far better alternative to Nvidia is Alphabet (GOOG 2.04%) (GOOGL 2.15%), the parent company of Google. I've got four reasons why Alphabet will be a much better long-term investment today than Nvidia, and why its business is more sustainable. As mentioned above, Nvidia is a hardware company. Nvidia's graphics processing units (GPUs) are the best in class for AI model training. However, once it sells the GPU, that's it. Unless clients come back to build additional supercomputers or upgrade their system down the line, Nvidia's sales are a one-time benefit. Alphabet is a massive Nvidia GPU buyer, but it has set up a subscription model using these products. One of Alphabet's most exciting segments is Google Cloud, its cloud computing division. By filling data centers with powerful Nvidia GPUs, clients who need access to extreme computing power can rent it from Alphabet. This allows these clients to stay asset-light and quickly scale up or down according to their needs. Because the revenue stream from this business is recurring, it's far more sustainable. Additionally, Alphabet has other AI products, like its generative AI model Gemini. This model beats the competition in multiple tests and will create a new revenue stream for Alphabet as it's implemented into various programs. While Nvidia's one-time sales may provide flashy year-over-year growth figures in boom times, they're not as sustainable as Alphabet's subscription-focused approach. Because Nvidia is a pick-and-shovel play, it saw the first wave of AI demand. With companies like Alphabet ordering thousands of GPUs to outfit their data centers, it experienced a sudden demand rush. It's not advisable to invest in a company in the middle of a demand rush, as many lofty expectations are already baked into the stock. While Alphabet has seen increased demand for cloud computing and generative AI, it's in the early stages. This means the rush hasn't happened for Alphabet yet, making me more excited to get into Alphabet's stock before the big move comes along. Another issue with Nvidia's stock is how expensive it has gotten. With Nvidia's price-to-earnings (P/E) ratio sitting at a much higher level than Alphabet's valuation, it has a lot of expectations built in.  GOOGL PE Ratio data by YCharts Alphabet doesn't have nearly the same hype around its stock and trades at about the same level as the broader S&P 500, which has a forward P/E of 20. If Alphabet maintains its status quo, it will still be a market-beating stock. If Nvidia misses expectations, the bottom will fall out of the stock. Finally, Alphabet is far more diversified than Nvidia. If this AI trend turns out to be a bust (I don't think it will be), then a large swath of Nvidia's business will evaporate. This wouldn't be the first time this has happened to Nvidia, as multiple crypto crashes have caused the company's revenue to drop rapidly when demand fell. Although many investors (including myself) are excited about Alphabet's AI prospects, at the end of the day, nearly 80% of its revenue comes from advertising services. Advertising has been around for thousands of years and likely won't fade away anytime soon. So, regardless of how successful AI proliferation is, Alphabet should be fine. To me, Alphabet is a much better investment right now than Nvidia. While Nvidia may see strength throughout the rest of 2024, it will likely eventually experience a drop in demand due to its non-subscription business model. If you like roller coasters, Nvidia may be a better stock, although you may never return to the highs you experience early on. But if you like a steady, market-beating ride, Alphabet is a far better pick. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}