{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.moneycontrol.com/news/business/markets/nvidia-record-gains-trigger-rally-in-semiconductor-related-stocks-in-india-12336171.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Nvidia shares rallied more than 16 percent to close at a life-time high of $785.38 on February 22, adding about $277 billion to its market capitalisation and bringing its total market value near $2 trillion. The addition eclipsed the $197-billion gain made by Facebook-parent Meta at the start of the month, and made Wall Street’s largest single-day gain in history at $1.96 trillion. The Nvidia shares reacted with enthusiasm after the company posted better-than-estimated quarterly earnings. The earnings managed to beat the already high estimates by analysts. The chipmaker's results highlight the fact that the demand for specialised chips used in AI computing is soaring. The sharp and record-making rally in Nvidia shares is seen having a positive impact on semiconductor-related stocks in India such as ASM Technologies and SPEL Semiconductors. ASM Technology ASM Technology shares traded at Rs 874.75 with gains of 3.85 percent on February 23 morning. The stock is up more than 78 percent on a year-to-date basis, while in five years, it has zoomed 1,750 percent. In February alone, ASM Technology rallied 83 percent. The company provides service to reputed semiconductor equipment manufacturers. “ASM Technology saw a lot of buying interest as it came out of 19 years of its consolidation range. A two-year breakout is seen in the stock and hence the demand for shares will be there, basis the chart study,” Darpan Patil, founder of Rupic consultancy, said. SPEL Semiconductor The shares were locked in the 5 percent upper circuit on February 23 morning. The SPEL Semiconductor shares surged 56 percent in February so far. In one year, SPEL Semiconductor shares are up by 195 percent. SPEL Semiconductor has a semiconductor IC assembly and testing facility and is a strategic contract manufacturing partner for several world-leading chipmakers. SPEL Semiconductors offers packaging solutions for Semiconductors used in diverse end-market applications including communication, consumer electronics, computing, industrials and automotive. Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}