{
    "title": "Analyst Shares Outside-The-Box Way To Invest, Make Money On AI Boom - \nNVIDIA (NASDAQ:NVDA)",
    "date": "2/1/2024",
    "url": "https://www.benzinga.com/top-stories/24/02/36896328/analyst-shares-outside-the-box-way-to-invest-make-money-on-ai-boom",
    "text": "The AI story has driven incredible growth in companies such as NVIDIA Corp NVDA and Microsoft Corp MSFT, but analyst Marc Chaikin of Chaikin Analytics shared an outside-the-box way to play the increase in demand for AI. Chaikin told Benzinga’s PreMarket Prep that he liked IT technology stocks, as consulting firms will help companies transition into using more AI in their operations. The Stocks: Chaikin mentioned a few different IT stocks that could see growth from AI. The names include IBM IBM and Accenture plc ACN. “I think the play in AI in addition to chips… are IT service companies. They’re just indicative of who’s going to benefit now … These are two stocks I really like on weakness. The reason is consulting companies are going to get a big chunk of business because of AI.” Chaikin also mentioned Gartner Inc IT, another stock in the IT space. If more companies hire consulting firms to help them implement more AI, chances are these IT names will also see a bump in demand and sales, Chaikin argues. Read Also: Meta Faces Criticism For Copyright Double Standards: Protects Own AI Model, Opposes Same For Others Price Action: The three IT names mentioned on Thursday’s PreMarket Prep have traded higher in the last year, with the overall tech market. But the gains are more subdued than chip names like Nvidia, which is up 200% in the past year. The IT stocks, on the other hand, are up about 30% in the past year, underperforming the Invesco QQQ Trust QQQ in the same time frame. Watch the full interview with Marc Chaikin here.  Photo: Marc Chaikin/ChaikinAnalytics jordanmerrick/Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}