{
    "title": "Nvidia chases US$30 billion custom chip market with new unit: sources",
    "date": "2/10/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/nvidia-chases-us30-billion-custom-chip-market-new-unit-sources",
    "text": "Hello, your email is unverified. Please confirm  for access to all your SPH accounts. Create a free account with Business Times  for seamless access across SPH Media products. Welcome,  Create a free account with Business Times  for seamless access across SPH Media products. Welcome,   \"Nvidia chases US$30 billion custom chip market with new unit: sources\" Already have an account? Log in The Business Times Personal Edition at$9.90/month*\nSUBSCRIBE NOW\nFind out more about subscription packages here. Find out more about subscription packages here. The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. Subscribe to The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. NVIDIA is building a new business unit focused on designing bespoke chips for cloud computing firms and others, including advanced artificial intelligence (AI) processors, according to nine sources familiar with the company’s plans. The dominant global designer and supplier of AI chips aims to capture a portion of an exploding market for custom AI chips and to protect itself from the growing number of companies interested in finding alternatives to its products. The Santa Clara, California-based company currently controls about 80 per cent of the market for high-end AI chips, a position that has sent its market value up 40 per cent so far this year to US$1.73 trillion after it more than tripled in 2023. Its customers, which include ChatGPT creator OpenAI, Microsoft, Alphabet and Meta Platforms , have raced to snap up the dwindling supply of Nvidia chips to compete in the rapidly emerging generative AI sector. Nvidia’s H100 and A100 chips serve as a generalised, all-purpose AI processor for many of those major customers. But the tech companies have started to develop their own internal chips for specific needs. Doing so helps reduce energy consumption, and potentially can shrink the cost and time to design. Nvidia is now attempting to play a role in helping these companies develop custom AI chips that have flowed to rival firms such as Broadcom and Marvell Technology, according to the sources who declined to be identified because they were not authorised to speak publicly. Start and end each day with the latest news stories and analyses delivered straight to your inbox. “If you’re really trying to optimise on things like power, or optimise on cost for your application, you can’t afford to go drop an H100 or A100 in there,” Greg Reichow, general partner at venture capital firm Eclipse Ventures said. “You want to have the exact right mixture of compute and just the kind of compute that you need.” Nvidia does not disclose H100 prices, which are higher than for the prior-generation A100, but each chip can sell from US$16,000 to US$100,000 depending on the volume purchased and other factors. Meta has said it plans to bring its total stock to 350,000 H100s this year. Nvidia officials have met with representatives from Amazon.com, Meta, Microsoft, Google and OpenAI to discuss making custom chips for them, according to two sources familiar with the meetings. Beyond data centre chips, the company has pursued telecom, automotive and video game customers. In 2022, Nvidia said it would let third-party customers integrate some of its proprietary networking technology with their own chips. The company has said nothing about the programme since, and Reuters is reporting its wider ambitions for the first time. A Nvidia spokesperson declined to comment beyond the company’s 2022 announcement. Dina McKinney, a former Advanced Micro Devices and Marvell executive, heads Nvidia’s custom unit and her team’s goal is to make its technology available for customers in cloud, 5G wireless, video games and automotives, according to a LinkedIn profile. Those mentions were scrubbed and her title was changed after Reuters sought comment from Nvidia. Amazon, Google, Microsoft, Meta and OpenAI declined to comment. According to estimates from research firm 650 Group’s Alan Weckel, the data centre custom chip market will grow to as much as US$10 billion this year, and double that in 2025. The broader custom chip market was worth roughly US$30 billion in 2023, which amounts to roughly 5 per cent of annual global chip sales, according to Needham analyst Charles Shi. Currently, custom silicon design for data centres is dominated by Broadcom and Marvell. In a typical arrangement, a design partner such as Nvidia would offer intellectual property and technology, but leave the chip fabrication, packaging and additional steps to Taiwan Semiconductor Manufacturing or another contract chip manufacturer. Nvidia moving into this territory has the potential to eat into Broadcom and Marvell sales. “With Broadcom’s custom silicon business touching US$10 billion, and Marvell’s around US$2 billion, this is a real threat,” said Dylan Patel, founder of the silicon research group SemiAnalysis. “It’s a real big negative – there’s more competition entering the fray.” Nvidia is in talks with telecom infrastructure builder Ericsson for a wireless chip that includes the chip designer’s graphics processing unit (GPU) technology, according to two sources familiar with the talks. 650 Group’s Weckle expects the telecom custom chip market to remain flat at roughly US$4 billion to US$5 billion a year. Ericsson declined to comment. Nvidia also plans to target the automotive and video game markets, according to sources and public social media postings. Weckel expects the custom auto market to grow consistently from its current US$6 billion to US$8 billion range at 20 per cent a year, and the US$7 billion to US$8 billion video game custom chip market could increase with the next-generation consoles from Xbox and Sony. Nintendo’s current Switch handheld console already includes an Nvidia chip, the Tegra X1. A new version of the Switch console expected this year is likely to include a Nvidia custom design, according to one source. Nintendo declined to comment. REUTERS BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to t.me/BizTimes Now that you have experienced myBT with just a few keywords, subscribe to BT Premium to get full-access. You have reached your limit of 30 keywords.\nTo follow new keywords, edit your myBT settings. Get the latest coverage and full access to all BT premium content. Browse corporate subscription here  SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}