{
    "title": "Investors Are Piling Into Nvidia Stock. But Nvidia Is Investing in 5 Other \nAI Stocks.",
    "date": "2/19/2024",
    "url": "https://finance.yahoo.com/news/investors-piling-nvidia-stock-nvidia-140000490.html?fr=sycsrp_catchall",
    "text": "Over any meaningful time span, Nvidia (NASDAQ: NVDA) has been a blockbuster investment. It's up almost 1,800% over the last five years, and it has more than tripled in the past year alone, fueled by investors' excitement for artificial intelligence (AI). There's good reason to believe Nvidia is a top AI stock. Management attributes its surging revenue to AI-related products and services. To illustrate how strong demand is, the company expects to report revenue of $20 billion in its fiscal 2024 fourth quarter. That would be a 231% year-over-year increase -- simply astounding for a company of this size. AI is the top investment trend right now, and Nvidia stock is one of the most popular ways to ride the trend higher. However, for its part, the company is buying shares of five other AI companies. This interesting development made the news on Feb. 14 with Nvidia's first 13F filing with the Securities and Exchange Commission. This form is for institutional investment managers to report their stock holdings. According to its 13F, Nvidia has a stock portfolio worth $230 million, and these are the AI stocks it's been buying. Nvidia's 13F shows it owns only five stocks, but all five have a connection to AI in some capacity. Here's a quick overview of each company, from the largest investment down to the smallest. Arm Holdings (NASDAQ: ARM) licenses its AI semiconductor chip designs to other companies, and this business is in high demand right now. Nvidia tried to acquire Arm back in 2020 but finally called it off in 2022 after pushback from regulators. Now, it will look to benefit as an investor. This is Nvidia's largest stock position, valued at $147 million as of the SEC filing. Next in Nvidia's portfolio is Recursion Pharmaceuticals (NASDAQ: RXRX). This early-stage biotechnology company is using AI models to process genetic data and find new drugs. It's an idea that could be game-changing for the medical field, which is why the stock has also caught the attention of growth investor Cathie Wood. SoundHound AI (NASDAQ: SOUN) offers an AI voice assistant that's similar to what's already offered by major tech companies. However, SoundHound AI believes its AI is more capable of understanding normal language. And based on its growing customer list, there seems to be support for management's claim. Of Nvidia's stocks, investors might want to disregard TuSimple Holdings, considering it's delisting from the Nasdaq. That said, this company has an AI angle as well -- it's working to enable autonomous driving for trucking companies. Finally, Nano-X Imaging (NASDAQ: NNOX) -- or just Nanox -- is Nvidia's smallest stock position. This company hopes to transition the world to a new digital X-ray technology. It intends to use AI to go through these digital images and find patterns that doctors might overlook, leading to better outcomes for patients. When it comes to AI stocks, I personally believe the trend, as a whole, is overhyped. And stock market history is littered with past trends that eventually fizzled out. Therefore, investors need to be discerning. That said, I believe AI can unlock a lot of possibilities when it comes to the medical field. This is why I'm particularly intrigued with Nvidia's investments in Recursion Pharmaceuticals and Nanox. Full disclaimer before I go any further: I am not a medical expert in the slightest. I'm just a regular investor on the outside looking in. Investing great Warren Buffett says to stay inside of your circle of competence. And fellow great Peter Lynch says to invest in what you know. Medical stocks aren't that for me. However, I do know enough to understand datasets are enormous in this field, and processing large amounts of data is where AI really shines. Consider one of Recursion Pharmaceutical's newest partnerships as an example. In the third quarter of 2023, it partnered with Tempus to gain access to 20 additional petabytes (over 20,000,000 gigabytes) of oncology data. It now has a staggering 50 petabytes at its disposal for cancer research. And to process this much information, the company will keep working with Nvidia to make its BioHive-1 supercomputer more powerful. Nanox only has a limited number of medical devices in operation right now. But when it went public in 2020, the company hoped to eventually deploy 15,000 machines, which would make more than 150 monthly digital scans each. Nanox is still a long way from that goal, and it may never get there. But hitting its goals would represent nearly 2.3 million medical images per month. This could quickly become the largest medical-imaging dataset in the world, and the company will need to use AI to make any sort of discovery. Recursion Pharmaceuticals and Nanox are looking to use AI to unlock important medical breakthroughs by using enormous medical datasets. This is why I say these two stocks have enticing upside. That said, both Recursion Pharmaceuticals and Nanox have meager revenue streams and enormous losses, as the chart below shows. Recursion Pharmaceuticals and Nanox are very high-risk stocks, and investing in them should not be taken lightly. Both have an elevated chance of failing, and Nvidia's investment in them shouldn't be viewed as something that guarantees success. It's exciting to think about what could happen if things go right, and AI leads these two companies to major breakthroughs. Investors just need to keep their emotions in check, fully recognizing the risks that come with these stocks. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Jon Quast has positions in Nano-X Imaging. The Motley Fool has positions in and recommends Nvidia. The Motley Fool recommends Nasdaq. The Motley Fool has a disclosure policy. Investors Are Piling Into Nvidia Stock. But Nvidia Is Investing in 5 Other AI Stocks. was originally published by The Motley Fool Related Quotes "
}