{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/NVDA/pressreleases/24385625/the-2-best-ai-stocks-to-invest-in-now/",
    "text": "After dominating the stock market in 2023, artificial intelligence (AI) stocks continue to rule as we approach the final days of February 2024. Shares of chip giant Nvidia (NVDA)are up 17% since Feb. 21 alone, after the company reported another strong quarter. While Nvidia remains the market's favorite AI stock, a few other companies are also at the forefront of the AI game. Even before AI came into the picture, tech giants such as Microsoft (MSFT) and Alphabet (GOOGL) had been working to strengthen their fundamentals with a diverse portfolio. In the last 10 years, Microsoft stock has returned 963%, while Alphabet stock has increased 352%. Now, incorporating AI into their offerings benefits both companies greatly, and has the potential to lead to numerous growth opportunities in the future. Let’s find out more about why these two mega-caps are the best AI stocks to invest in now. Microsoft reported exceptional quarterly results in 2023, driven by its AI-led cloud strength. Its stock gained 56.8% in 2023, compared to the tech-heavy Nasdaq Composite's ($NASX) 44.5% growth. Valued at over $3 trillion, MSFT stock is up 8.2% YTD, on pace with the Nasdaq. Microsoft gained an early mover advantage in AI after it made a massive investment in OpenAI in 2019. Since then, it has included AI in all of its flagship products. The company's cloud computing platform, Azure, is edging closer to giving tough competition to the top player, Amazon’s (AMZN) AWS (Amazon Web Services). Azure now holds a 24% market share, narrowing the gap with AWS’s 31% share. Thanks to AI-driven growth in the cloud, Microsoft recently reported another robust quarter. With 53,000 customers, Azure AI grew 30% year-over-year in the second quarter of fiscal 2024. The Intelligent Cloud segment accounted for 42% of Microsoft's total revenue of $62 billion. While total revenue increased 18%, adjusted earnings increased 26% from the prior-year quarter. Management believes that Azure's new and renewed long-term contracts will increase Productivity and Business Processes segment revenue by 10% to 12% to a range of $19.3 billion to $19.6 billion in fiscal Q3. Similarly, the Intelligent Cloud segment is expected to grow by 18% to 19% in the current quarter. The Personal Computing segment has been recovering, and is expected to grow by 11% to 14% in Q3. Furthermore, management assumes 45% of the remaining performance obligation (RPO) of commercial businesses that increased by 17% during the quarter could be recognized as revenue over the next year. Following its acquisition of Activision Blizzard, Microsoft now has outstanding opportunities in the gaming segment. With an $81 billion cash balance, Microsoft is in a comfortable position to continue its AI expansion. Analysts expect earnings growth of 19.3% in fiscal 2024, accompanied by revenue growth of 15.3%, with fiscal 2025 earnings growth estimated at 13.7% alongside revenue growth of 14.2%. Overall, on Wall Street, Microsoft remains a “strong buy.” Of the 36 analysts covering the stock, 32 rate it a “strong buy,” while three rate it a “moderate buy” and one suggests a “hold.” The average target price for MSFT stock is $438.97, which is 7.8% above current levels. The high estimate of $600 implies a potential upside of 47% in the next 12 months. Alphabet stock fell sharply this month as a result of Gemini AI-related mishaps. The stock is now fractionally lower on a YTD basis, while the Nasdaq is up more than 8%. After a 4% drop in GOOGL's share price on Feb. 26, Wedbush analyst Daniel Ives thinks the market may have overreacted. Speaking about the matter, Ives stated that the Monday sell-off was “way overdone as Google has a massive opportunity on AI with the Street giving no credit. Gemini headwinds but we believe Google is one of the core winners in AI revolution.\" According to Reuters, Alphabet plans to relaunch its Gemini AI tool in a few weeks. I believe this temporary setback is fixable, and Alphabet, with its diverse portfolio and market position, still has excellent opportunities to capitalize on the AI niche. Alphabet has incorporated AI into its products since 2017. However, the company has been raising the stakes after Microsoft's multi-billion dollar OpenAI investment. While Microsoft has a larger share of the cloud computing market, Google Search dominates the search engine market. Microsoft search engine Bing has yet to catch up to Search's dominance in the field, which has been called into question on numerous occasions. Google Search maintains its stronghold with a 91.5% market share. In the fourth quarter of 2023, Google Search's revenue increased by 12.6% to $42.0 billion. For the full year, Search generated $175 billion in revenue, an 8% increase over 2022. Furthermore, Google Cloud holds the third position in the market, trailing Amazon and Microsoft. It generated $33 billion in revenue for the full year, representing a 26% increase year-over-year. AI-powered Search and Cloud services are both significant growth drivers for the company. Alphabet, with its vast resources, extensive industry experience, and strong balance sheet, is well-positioned to take the lead in the AI game. Alphabet's cash balance stood at $110.9 billion, with long-term debt totaling $13.2 billion at the end of the quarter. The company also generated $69.5 billion in free cash flow during the quarter. Analysts expect Alphabet to report fiscal 2024 earnings growth of 16.6% and revenue growth of 11.4%, on average, with fiscal 2025 earnings growth projected at 15.5% with revenue growth at 10.5%. Overall, Wall Street rates GOOGL stock a “strong buy.” Out of the 44 analysts covering GOOGL, 35 have a “strong buy” recommendation, three suggest a “moderate buy,” and six call it a “hold.” Based on analysts' average price target of $160.97, Wall Street sees a potential upside of about 16% in the next 12 months. The high estimate of $180 implies a share price jump of 29.5% from current levels. While the competition between the two is heating up, with each aggressively pushing its AI agenda, Microsoft and Alphabet remain the industry's dominant players. In terms of valuation, Microsoft trades at 34 times forward earnings, slightly on the higher side, while Alphabet trades at 20 times forward earnings. However, both companies' long-term AI opportunities present a compelling high-risk/high-reward case, making them appealing investments right now. Their legacy portfolios - now powered by AI - industry experience, and capable leadership teams have all contributed to this explosive growth, and will probably continue to do so for years to come. I believe both could easily surpass their high target prices this year and surge even higher. Undoubtedly, Microsoft and Alphabet remain the best AI stocks to buy and hold for the long term. Provided Content: Content provided by Barchart. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Nvidia Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}