{
    "title": "Here's Why I Might Change My Mind and Buy Nvidia Stock",
    "date": "2/18/2024",
    "url": "https://finance.yahoo.com/news/heres-why-might-change-mind-121500014.html",
    "text": "Over the past year, there have been few better stocks to own than Nvidia (NASDAQ: NVDA), as it's up 400% since the start of 2023. And year to date, it's already up nearly 50%. Unfortunately, I missed those gains after selling my shares last July. However, it's never too late to admit you're wrong and consider buying back in. But at its current stock price, many people might question this decision. So, why am I considering buying now? Read on to find out. Nvidia's primary products are GPUs (graphics processing units). This piece of computing hardware is tailor-made to handle complex computing tasks. Originally designed to process gaming graphics, its uses have been expanded to tasks like drug discovery, engineering simulations, mining cryptocurrency, and training AI models. Artificial intelligence has been the latest demand driver for Nvidia, and its results are spectacular. In the third quarter of fiscal 2024 (ended Oct. 30), revenue rose an incredible 206% year over year to $18.1 billion. But the company isn't done as management expects fourth-quarter revenue to more than triple year over year to about $20 billion. Growth of this magnitude at a company as large as Nvidia is almost unparalleled, making the stock such an incredible story. Recently, Nvidia surpassed Amazon and Alphabet as the third-largest U.S. company by market cap. After missing out on much of the stock's meteoric rise, I believe now is the time to correct that mistake. Looking back on last year, I realize I misjudged the market opportunity for Nvidia's products. I figured that once the initial onslaught of AI-driven GPU demand was over, revenue would fall off a cliff. This is exactly what happened in 2019 and 2022 when the cryptocurrency market crashed and demand for GPUs dropped. I still believe this drop will happen, but it won't occur nearly as quickly as I expected. The demand for Nvidia's GPUs is unbelievable. Take Tesla, for example. After they spent $300 million on its Dojo computer filled with 10,000 H100 GPUs, I figured that would be the only one they'd build. But Tesla announced it would spend another $500 million on a second Dojo computer powered by Nvidia GPUs at its Buffalo, NY, plant. CEO Elon Musk also mentioned on the company's Q4 conference call that they have plans for additional Dojo computers beyond that. Clearly, the demand is greater than I anticipated, and I want to get back in on that, especially since it will be a multiyear trend. Precedence Research estimates the global GPU market will reach about $773 billion in 2032, up from $42 billion in 2022. With Nvidia's trailing-12-month revenue total of $45 billion, it has a significant foothold in this growing market. But is now really the best time? It isn't as I should've done this months ago, but it's never too late to flip your stance on a generational company. Many investors overlooked Amazon or Netflix in the early years but still made a lot of money off those stocks despite being late to the party. Nvidia is likely to offer a similar opportunity today, assuming you can stomach the stock's price tag, which trades for nearly 100 times earnings. But when looking forward with analysts' earnings projections over the next 12 months, the valuation is much more palatable. Microsoft trades at a comparable 35 times forward earnings estimates. While my position in Nvidia will likely be fairly small to start, it will be enough skin in the game to monitor the company and ensure I'm capturing the gains of what's looking to be one of the most important companies this decade. While I've missed the first big move, there's room for much more upside if the AI market is as massive as some predict. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Keithen Drury has positions in Alphabet, Amazon, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, Netflix, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Here's Why I Might Change My Mind and Buy Nvidia Stock was originally published by The Motley Fool Related Quotes "
}