{
    "title": null,
    "date": "2/8/2024",
    "url": "https://www.marketscreener.com/quote/stock/NVIDIA-CORPORATION-57355629/news/Arm-shares-soar-as-AI-fueled-boom-brightens-growth-prospects-45912386/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) Feb 8 (Reuters) - Arm Holdings surged more than\n25% on Thursday driven by strong forecasts as customers aim to\ndesign new chips for artificial intelligence work that could\nbump up royalties for the British tech firm. The company, which sells blueprints and other intellectual\nproperty for creating computing chips that power most of the\nworld's mobile phones including Apple, has been a key\nbeneficiary of rising demand for AI-powered devices. The strong showing set Arm on course to add nearly $20\nbillion in market value, based on its premarket share price of\n$96.35. It would be Arm's best day since its listing in\nSeptember, if gains hold. Arm executives said on Wednesday customers were flocking\nto Arm-based central processors to complement Nvidia's\nchips for AI work in data centers, and it was working on new\nlaptops and smartphones that can handle chatbots and other AI\nfeatures. Its model of creating and licensing semiconductor designs\nrather than manufacturing chips meant Arm was able to grow fast\nwithout employing a lot of capital, Russ Mould, investment\ndirector at AJ Bell, said. \"These attributes still exist and are now being supercharged\nby AI ... that is reflected in the substantially higher royalty\nand licensing revenue being reported by the company,\" Mould\nadded. The midpoints of Arm's fourth-quarter sales and adjusted\nprofit forecasts range of $875 million and 30 cents per share,\nrespectively, beat LSEG estimates. \"Arm is riding on the coattails of demand for Nvidia's\ntechnology, particularly its datacentre systems,\" said Susannah\nStreeter, head of money and markets at Hargreaves Lansdown. SoftBank Group-controlled Arm trades at 56.46 times its\n12-month forward earnings estimates, versus investor darling\nNvidia's 32.66 and Advanced Micro Devices' 43.61. Only 9.5% of Arm's outstanding shares were publicly traded.\nLow-float stocks are susceptible to sharp moves.\n(Reporting by Samrhitha Arunasalam in Bengaluru; Additional\nreporting by Medha Singh; Editing by Shounak Dasgupta)  0 selected NVIDIA: What's in store for AI Woodstock? March 18, 2024 at 10:44 am EDT Nvidia launches an AI woodstock  Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}