{
    "title": "Hunt for 'next Nvidia' draws options traders to Arm's soaring stock",
    "date": "2/13/2024",
    "url": "https://www.channelnewsasia.com/business/hunt-next-nvidia-draws-options-traders-arms-soaring-stock-4118951",
    "text": "Business Business The Arm Ltd logo and a U.S. flag are seen in this illustration taken March 6, 2023. REUTERS/Dado Ruvic/Illustration This audio is AI-generated. NEW YORK :     The craze for artificial intelligence stocks sent options traders piling into bets on Arm Holdings on Monday, with many positioning for more gains in the shares after they almost doubled in price in less than a week. Arm Holdings' shares are up 80 per cent since Wednesday, after the company forecast better-than-expected quarterly results powered by demand for its technology to design chips for artificial intelligence features. The jump in the stock price has ignited trading in the chip designer's options, with volume soaring to about 490,000 contracts a day over the last three sessions. That is more than 10 times the options' average daily trading volume in the month prior to the earnings report, according to Trade Alert data. The exploding options volume pointed to investors hunting for the 'next NVIDIA,' said Chris Murphy, co-head of derivative strategy at Susquehanna Financial Group, noting that the surge in bullish options activity was likely helping boost the stock. Chip heavyweight Nvidia, at the center of the  artificial intelligence frenzy, has risen about 220 per cent over the last year, making it the best performing S&P 500 stock for that period. On Monday, 600,000 Arm contracts changed hands by 2:15 p.m. (1915 GMT), with the day's volume projected to hit a record 816,000 contracts, data showed. With Arm shares up 20 per cent at $137.72 on Monday, call options on the shares rising above $185 by Friday were the most actively traded Arm contracts. Call options convey the right to buy shares at a set price in the future, while puts offer the right to sell shares. Arm's share price rise has made for massive gains for recent bullish options bets. For instance a trader who had bought about 5,000 of ARM January 2026 calls for about $12.2 million on Feb. 7, saw the value of those contracts jump to about $42 million, based on their last trading price, on Monday.    Despite those gains, the trader appeared to be holding on to those call options, a bullish sign for the stock, Murphy said.    ARM puts were also busy on Monday, possibly pointing to some investors looking to lock in some of the stocks' recent gains, he said. Arm's technology is not directly used in the AI work, but companies like Nvidia are choosing it for central processing units that complement their AI-specific chips.   This service is not intended for persons residing in the E.U. By clicking subscribe, I agree to receive news updates and promotional material from Mediacorp and Mediacorp's partners. Copyright© Mediacorp 2024. Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with CNA to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us "
}