{
    "title": "Missed Out on Nvidia? 1 Artificial Intelligence (AI) Growth Stock to Buy \nNow and Hold for a Decade or Longer",
    "date": "2/17/2024",
    "url": "https://finance.yahoo.com/news/missed-nvidia-1-artificial-intelligence-112700264.html",
    "text": "Semiconductor stocks have been on fire ever since ChatGPT was launched in late 2022. Since then, a slew of new generative artificial intelligence (AI) applications have made cutting-edge graphics processing units that can handle accelerated applications a hot commodity. As Nvidia (NASDAQ: NVDA) is the leader in that subset of the chip market, its sales and stock price have been rocketing higher. After watching Nvidia's share price rise by 222% during the 12-month period that ended Wednesday, some investors are justifiably nervous that the stock has gotten too far ahead of itself. Nvidia will report its fiscal fourth-quarter results on Feb 21. During its fiscal third quarter, which ended Oct. 29, total revenue surged 206% year over year. Its valuation of about 97 times trailing earnings isn't unreasonable if you assume continued growth at its present rate. However, the semiconductor industry is famously cyclical. Demand for chips that can power generative AI applications will eventually crash. We just don't know when that crash will come. If you buy Nvidia at this inflated valuation and the bottom falls out next year, you could suffer heavy losses. For most folks who missed the boat on Nvidia, climbing aboard now entails more risk than they can tolerate. If you want to hitch your portfolio to a major player in the AI revolution with significantly less risk, consider buying shares of Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL) now to hold for the long run. The AI gold rush started when OpenAI launched ChatGPT about a year and a half ago. By that time, though, Alphabet had already been an AI-first company for several years. In a 2016 blog post, Alphabet CEO Sundar Pichai told everyone that \"in the next 10 years, we will shift to a world that is AI-first, a world where computing becomes universally available.\" If it didn't have an army of engineers skilled in the arts of machine learning, Google wouldn't be able to recognize poor spelling in search queries or rank search results properly. With AI working behind the scenes to provide better results, Google has captured a 91.5% share of the global search market, according to Statcounter. Microsoft, a tech giant currently worth over $3 trillion, launched Bing nearly 15 years ago, but it still has just 3.4% of the global market for search. Google Maps has over a billion monthly users, and millions of businesses eagerly use the platform to attract new customers. Maps is another AI-heavy application -- it wouldn't be able to forecast traffic or recommend improved routes without the contributions of some of the AI industry's most valuable talent. In addition to a search business that dominates its competitors, Alphabet is a leading provider of cloud computing services. Late last year, its cloud offering became a lot more valuable with the addition of Gemini. OpenAI caught Alphabet flatfooted when it launched ChatGPT in late 2022. In a nutshell, Gemini offers a similar generative AI experience for consumers with the chatbot formerly known as Bard. Gemini also gives enterprise-sized Google Cloud customers a chance to build AI applications of their own. With several applications that boast over a billion active users per month, Google can offer enterprise-level cloud customers access to reams of real-world data they won't find anywhere else. Google Cloud sales rose 26% year over year in the third quarter. With a large addressable market and an advantage over competitors who don't dominate the markets for search and location data, investors can reasonably expect strong growth from its cloud business for another decade. The vast majority of Alphabet's revenues and profits still come from Google Services. This segment is growing more slowly than its cloud business, but it's still a long way from stagnation. Google Services revenue rose 12.5% year over year in the fourth quarter. Over the same time frame, operating income from the services segment jumped 32%. With advantages over the competition, and its two main operating segments growing by double-digit percentages, Alphabet should be valued at a high earnings multiple -- but it isn't. You can buy the stock for around 21 times forward earnings expectations. There's no such thing as a risk-free growth stock. With reliable earnings from advertising and cloud services, though, buying Alphabet at a reasonable valuation gives you an excellent chance to come out ahead over the long run. With its firm toehold in the rapidly evolving AI space, it also has a chance to become a top performer. Buying some shares now to hold for the long run looks like a smart move. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Cory Renauer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Missed Out on Nvidia? 1 Artificial Intelligence (AI) Growth Stock to Buy Now and Hold for a Decade or Longer was originally published by The Motley Fool Related Quotes "
}