{
    "title": "Nintendo Ups Guidance; Nvidia/Cisco Partnership; Novartis Acquisition",
    "date": "2/7/2024",
    "url": "https://www.cmcmarkets.com/en-au/opto/nintendo-ups-guidance-nvidiacisco-partnership-novartis-acquisition",
    "text": "5 Top Stories By OPTO  07 Feb 2024, 04:15 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. The Kyoto-based company [7974:T] has upped its Switch sales forecast from 15 million to 15.5 million for the fiscal year ending March after its quarterly operating profit of ¥184.5bn beat expectations. Nintendo also increased its revenue, operating profit and net income guidance. The firm’s stock hit an all-time high earlier this year, buoyed by the launch of The Legend of Zelda: Tears of the Kingdom. But according to a note from Goldman Sachs analyst Minami Munakata, “the share price looks overvalued”. Nvidia [NVDA] and Cisco Systems [CSCO] announced Tuesday they are to partner to help businesses build in-house artificial intelligence (AI) infrastructure; Cisco will offer its own networking equipment alongside Nvidia’s software, AI models and development tools. “Working closely with Cisco, we’re making it easier than ever for enterprises to obtain the infrastructure they need to benefit from AI, the most powerful technology force of our lifetime,” Nvidia CEO Jensen Huang said in a statement. Pharma behemoth Novartis [NVS] has announced it is to buy German biotech MorphoSys [MOR] for €2.7bn. MorphoSys is working on a treatment for a rare bone-marrow cancer. Novartis will offer shareholders €68 per share and take the firm private; the MorphoSys share price jumped more than 40% on the news. Novartis’ M&A strategy currently involves focusing on fewer therapeutic areas. Shares in the enterprise software company [PLTR] popped 13% in extended-hours trading after its Q4 earnings report on Monday. US commercial revenue during the quarter was up 70% year-over-year to $131m, while the firm’s customer base rose 55% to 221. Nevertheless, Palantir expects the coming quarter to be quieter, with sales of between $612m and $616m, less than analyst expectations of $617.4m. The Vietnamese electric vehicle maker [VFS] announced Tuesday that it is recalling almost 6,000 of its VF 5 models manufactured between March and December last year. The issue is due to a faulty combination switch, although the firm was at pains to point out that the error had been registered on only one vehicle, with no incidents reported. VinFast made its Nasdaq debut last year. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles 5 Top Stories Meta Smashes Record; Hyundai IPO?; Delivery Hero Woes Following its earnings report, Facebook-owner Meta closed last week 20% up, at an all-time high of $474.99 per share, boosting its market cap by $197bn. 06 Feb 2024 Analysis “The Biggest Winner” — Jens Nordvig on Why India is Outdoing China Jens Nordvig, Co-Founder and CEO of MarketReader, explains why India is picking up the capital flows that are deserting China. 02 Feb 2024 5 Top Stories SK Hynix US Facility; New Nvidia China Chip; Paytm Spirals South Korean chipmaker SK Hynix is to build a new facility in the US state of Indiana, which will specialise in HBM chips used by Nvidia. 01 Feb 2024 5 Top Stories Novo Nordisk Hits $500bn; Tech Earnings Underwhelm; Tesla Slips The Danish drugmaker became the second-ever European company to surpass a market value of $500bn, following positive prognostications for Wegovy. 31 Jan 2024 © 2024 CMC Markets Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Chi-X (Chi-X Australia), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Terms and Conditions, Product Disclosure Statement ('PDS') and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Our Financial Services Guide contains details of our fees and charges. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. "
}