{
    "title": "Nvidia CEO Makes First China Tour in Years as US Curbs Roil AI",
    "date": "1/21/2024",
    "url": "https://finance.yahoo.com/news/nvidia-ceo-makes-first-china-022348791.html",
    "text": "(Bloomberg) -- Nvidia Corp. co-founder Jensen Huang celebrated the new year with staff during his first trip to China in four years, a low-key tour that coincided with growing concerns about Beijing’s ability to get around US chip restrictions. Most Read from Bloomberg Tesla Sinks After Warning About ‘Notably Lower’ Growth Rate US GDP Grew 3.3% Last Quarter, Capping Unexpectedly Strong Year Boeing Blocked From Building More 737s in Hit to Growth Plan Microsoft Cuts 1,900 Jobs in Gaming, Including at Activision He visited Nvidia’s offices in Shenzhen, Shanghai and Beijing earlier this month, according to a person familiar with the matter. Images and video of the 60-year-old donning colorful traditional garb and dancing with staff emerged online over the weekend. It wasn’t clear if he’d held formal meetings with other executives or officials, said the person, who asked not to be named discussing a private visit. Huang embarked on his tour — first reported by state newspapers off Chinese social media posts — as Nvidia’s artificial intelligence accelerators become pivotal in a tech race between Washington and Beijing. Huang has warned that an escalation in sanctions designed to cut off the flow of AI training chips could drive Chinese firms to develop their own alternatives. That could harm American tech leaders in the long run, he has said. The Nvidia co-founder name-checked Huawei Technologies Co. — which in 2023 alarmed Washington by including an advanced made-in-China processor in a smartphone — as a potential rival. Read More: US Looking Into Nvidia’s AI Chips for China, Raimondo Says An Nvidia representative confirmed Huang had celebrated the upcoming Lunar New Year with staff, without elaborating. Nvidia, which more than tripled its market value in 2023 thanks largely to its pivotal role in AI development, is up another 20% this year as investors bet on its sector leadership. It’s designed versions of its semiconductors for China that it says are compliant with successive rounds of US sanctions, as Washington watches closely. Among the social media posts, one person describing himself as an Nvidia staffer shared an image of Huang handing over a raffled Nvidia GeForce RTX 4080 graphics card. The CEO has since moved on to Taiwan, according to local newspaper EDN, for his fourth visit to the island in less than a year. Read more: Nvidia’s Red-Hot 2024 Start a Bright Spot as S&P 500 Eyes Record Most Read from Bloomberg Businessweek How the West’s Favorite Autocrat Engineered Africa’s Most Dramatic Turnaround Goldman, Lazard Look to Ex-Spies to Gain an Edge in Volatile World Stuck in a Downturn, Startups Ghost Investors Can America’s New Union Hero Take on Elon Musk’s Tesla? AI Needs So Much Power That Old Coal Plants Are Sticking Around ©2024 Bloomberg L.P. Related Quotes "
}