{
    "title": "1/100th of the cost: CPU startup Tachyum claims that one of its processing \nunits can rival dozens of Nvidia H200 GPUs ...",
    "date": "1/26/2024",
    "url": "https://www.techradar.com/pro/1100th-of-the-cost-cpu-startup-tachyum-claims-that-one-of-its-processing-units-can-rival-dozens-of-nvidia-h200-gpus-with-a-99-saving-that-could-turn-the-ai-market-on-its-head-if-true",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The 5nm Prodigy processor can dynamically switch between AI, HPC, and cloud workloads and costs $23,000 Tachyum has confirmed it will begin mass production of its Prodigy Universal Processor later this year - the product which combines the functionality of a CPU, GPU, and TPU in a single unit, and threatens to turn the AI market on its head. The 192-core 5nm processor delivers 4.5 times the performance of the best processors for cloud workloads, can be up to three times better than GPUs for high-performance computing (HPC), and can be six times more effective than GPUs for AI applications. The company first teased its universal processing component in 2022 and with it promised to transform hyperscale data centers into universal computing centers that can pave the way for the necessary computational power and efficiency to handle AI workloads.  Then, in December 2023, it released a video showing that it could emulate x86 applications – despite not incorporating any hardware in its architecture. “The successes we were able to achieve while tweaking our product roadmap have brought us to a 2024 full of anticipation as we move towards volume production of Prodigy and the fulfillment of a multibillion-dollar sales pipeline,\" said Tachyum CEO and founder Dr Radoslav Danilak. \"We look forward to fulfilling our commitment to transforming ordinary data centers into Universal Computing Centers in the near future.” Because the component incorporates functionality for various types of workloads, it can dynamically switch between computational domains – while also apparently eliminating the need for expensive hardware dedicated to AI workloads. This is all according to the company's press release – which recapped the firm's feats during 2023 and outlined the company's strategy in the coming years. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Among its outlandish claims, the company stated just one of its $23,000 processors could match the AI training performance of a highly sophisticated array of 52 Nvidia H200 GPUs — currently among the best GPUs out there. Banking that many GPUs alongside seven Supermicro GPU servers would cost $2,349,028, the company claimed, versus a single Prodigy pocket system with 2TB DDR5 DRAM. But that's just the beginning, with Tachyum slating Prodigy 2, a 3nm processor that uses PCIe 6.0 and CXL, alongside either high-bandwidth memory (HBM) 3 RAM – for release in 2026, according to Tom's Hardware. Whether the finished product lives up to the company's claims remains to be seen, but Tachyum has received a major purchase order to build a large-scale system. The firm has also released a series of white papers so developers can know what to expect when the processor becomes available. Keumars Afifi-Sabet is the Technology Editor for Live Science. He has written for a variety of publications including ITPro, The Week Digital and ComputerActive. He has worked as a technology journalist for more than five years, having previously held the role of features editor with ITPro. In his previous role, he oversaw the commissioning and publishing of long form in areas including AI, cyber security, cloud computing and digital transformation. VR headsets could be hacked in \"Inception-esque\" attacks — with attackers able to steal your data without you even noticing This popular gaming PC vendor believes it can make AI training much more affordable for small businesses — Maingear partners with Phison to deliver a quad-GPU system using Nvidia's RTX 6000 Ada Here's another good reason to dump your desktop for a laptop — boutique content creation specialist finds that laptops perform and cost almost the same as their desktop counterparts By Tom PowerMarch 22, 2024 By Kristina TerechMarch 22, 2024 By Sead FadilpašićMarch 22, 2024 By Kristina TerechMarch 22, 2024 By Mackenzie FrazierMarch 22, 2024 By Carrie MarshallMarch 22, 2024 By Dashiell WoodMarch 22, 2024 By James RogersonMarch 22, 2024 By Tom PowerMarch 22, 2024 By Frank GartlandMarch 22, 2024 By Lloyd CoombesMarch 22, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}