{
    "title": "Supermicro Levels Up: Here's Why It Could Be The Next Nvidia",
    "date": "2/6/2024",
    "url": "https://finimize.com/content/supermicro-levels-up-heres-why-it-could-be-the-next-nvidia",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest about 2 months ago  •  6 mins Supermicro’s speedy, environmentally friendly, and flexible approach to fitting out AI data centers has given the company a global leading position among AI servers, driving its profits and share price sharply higher There may be lots of hype around AI, but Supermicro’s earnings are keeping up with its share price gains, so its valuations still look reasonable. If its profits reach the bullish 2026 analysts’ forecast, that would mean it’s trading at a 14.5x price-to-earnings ratio, and a price-to-earnings-to-growth ratio of 0.55x, which looks cheap for an AI stock. But things are moving fast in the AI space and there are risks, including heightened competition and a potential fall in profit margins. And the current challenge for Supermicro is meeting the strong demand and building out the AI data centers. Supermicro’s speedy, environmentally friendly, and flexible approach to fitting out AI data centers has given the company a global leading position among AI servers, driving its profits and share price sharply higher There may be lots of hype around AI, but Supermicro’s earnings are keeping up with its share price gains, so its valuations still look reasonable. If its profits reach the bullish 2026 analysts’ forecast, that would mean it’s trading at a 14.5x price-to-earnings ratio, and a price-to-earnings-to-growth ratio of 0.55x, which looks cheap for an AI stock. But things are moving fast in the AI space and there are risks, including heightened competition and a potential fall in profit margins. And the current challenge for Supermicro is meeting the strong demand and building out the AI data centers. Super Mario is helping to boost Nintendo’s stock to an impressive all-time high. But that might be nothing compared to what’s going on with Supermicro. With a game-changing AI server package, shares of this California-based computer firm are outrunning the rest of the pack and have already doubled in price this year. Let’s take a look at why it’s, well, a super smash. We highlighted Super Micro Computers – also known as Supermicro – as a leaderboard-level AI play back in August when its share price was around $277. Its share price did jump marginally higher over the next few months, but this year, it’s gone next-level, recharged both by some sparkly quarterly results and a gem of a full-year outlook. Investor enthusiasm for all things AI isn’t hurting it either, so it’s been changing hands this week at around $663. It’s proving itself, along with Nvidia, to be one of the purest stock plays on the AI theme. These two do go hand-in-hand, after all: while Nvidia’s high-performance chips are essential for the AI revolution, they need cutting-edge data centers to make them work. And that’s Supermicro’s job: it takes an innovative, customized, and flexible approach to meet customers’ computing needs – which has made it the choice of heavyweight clients like Meta and Amazon. Supermicro supplies in rapid time, the ridiculously complicated tech behind these centers, which need servers, network, and cloud storage solutions to function. The company also uses a liquid cooling technique to manage the temperature of its multi-rack servers in a more energy-efficient way. As these gigantic data centers consume vast amounts of energy, reducing costs, improving operating efficiencies, and lowering the environmental impact are all really important and have helped give Supermicro an edge over its competitors. By the end of September, research firm IDC estimated that Supermicro had become the fourth-biggest server provider in the world, ahead of Lenovo. And, sure, Dell and Hewlett Packard Enterprise are the leaders, but their revenue growth has been falling while Supermicro’s is revving up at a double-digit pace, making it a leader in the higher-priced and higher-margin AI server market. In its latest earnings report, Supermicro announced revenues of $3.66 billion, a 133% increase from the year-earlier period, and predicted sales of at least $14.3 billion in 2024, quite a bit more than the $11.5 billion that analysts had been predicting. We’ve all heard that AI is going to change the world and, well, it's happening right now for Supermicro – that $3.66 billion in revenue for the quarter that ended in December was more than the company’s total revenue for all of 2021. And Supermicro’s got some big plans: it’s partnering with Nvidia, AMD, and Intel – the three biggest AI chip suppliers – on next-generation AI designs. So its customers will likely include all the big AI spenders like Meta, Amazon, Apple, and Tesla. Looking forward is the key to successful investing. Analysts – read: experts – massively underestimated how this year’s earnings would be, and that’s not too surprising in such a fast-changing industry. However, it does help explain why the range is so wide between their highest and lowest earnings estimates for this year and next: The table shows the highest, lowest, and average current earnings per share estimates for years ending in June 2024 and June 2025 as well as the price-to-earnings (P/E) ratio based on the average earnings per share (EPS). For 2025, the P/E ratio based on the mean EPS $28.24 estimate puts the stock at a 23.5x valuation, based on Super Micro’s closing share price of $663. But, if the highest EPS estimate of $37.97 is correct, then the stock is currently trading at a P/E ratio of only 17.46x. Now, is that cheap? One way to help you decide is by using a price-to-earnings-to-growth (PEG) ratio. That’s a company’s (P/E) ratio divided by its earnings growth rate over a set time – normally one to three years. With Supermicro’s share price at $663, its mean EPS estimate for 2024 is $21.60 and $28.20 for 2025 – and that’s an EPS growth rate of 31% (in other words, 28.20 minus 21.6 divided by 21.6). Supermicro is currently trading at a 30.7x P/E ratio based on June 2024 mean estimates – so to calculate its PEG ratio, you take the 30.7 and divide it by its growth rate of 31, which means its PEG ratio is 0.99x. Now, any PEG ratio below 1.0x is considered to be attractive. Still, the risk of using a PEG ratio in times of very fast growth is that present-day growth is unlikely to be sustained over a longer period. If we look at EPS estimates for June 2026, the current mean consensus is $32.85 per share. So based on a two-year outlook, the EPS growth rate is 26% per year (that’s 32.85 minus 21.6 divided by 21.6 divided by 2), and with the current 30.7x P/E ratio, the PEG ratio is 1.18x, which is not quite as attractive. But there’s a reason why investing is considered an art, not a science: analyst estimates can be (and often are) wrong. If the bullish EPS estimates come through for Supermicro, which for 2025 and 2026 are $37.97 and $45.59, respectively – that equates to a 17.5x P/E ratio for next year, a 14.5x P/E ratio for 2026 and a PEG ratio of 0.56x. That’s likely too cheap for an AI stock. Then again, if the pessimistic view proves to be correct, then the stock is trading at 30.7x and 40x P/E ratios, which is way too high. The key risk ahead is that Dell and maybe even Hewlett Packard Enterprise might catch up with Supermicro’s capability in data centers and put its operating margins under pressure. That could undermine the company’s profit outlook, especially if overall demand growth for data centers wavers, (which admittedly seems unlikely now, with such a shortage in supply). Personally, I still like Super Micro and see it at the early stages of a multiyear trend as AI data centers are built out across the world. But the highest target price on Wall Street right now is $700, and we are already approaching that level, so chasing the stock up from here seems a little irrational and FOMO-driven. This stock might be well-suited for some dollar cost averaging – where you buy a set amount at set intervals over the next six months or so. That approach could help you take advantage of the move while not going all-in at one price, just in case there’s a pullback up ahead. ai information technology nvidia tech stocks us ads ai Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}