{
    "title": "Nvidia's AI Surge Lifts Stocks as Market Breadth Widens",
    "date": "2/25/2024",
    "url": "https://www.tradestation.com/insights/2024/02/26/nvidias-ai-surge-stock-market/",
    "text": "Nvidia and the AI boom keep driving stocks to new highs. Still, a long-awaited shift toward smaller companies may be starting. The S&P 500 rose 1.7 percent in the holiday-shortened week between Friday, February 16, and Friday, February 23. The index also crossed 5100 for the first time, just two weeks after breaking 5000. More than three-quarters of its members and every major sector gained value, a sign of widening participation in the rally. NVDA was the big story, reporting better-than-expected earnings and revenue on accelerating demand for AI chips. Gross margins widened, boosting profit by 769 percent from the previous year. CEO Jensen Huang noted that business is expanding as more organizations — including sovereign countries — embrace machine learning. The stock had its second dramatic gap since last May. It also moved past Amazon.com (AMZN) and Alphabet (GOOGL) to become the world’s third-most valuable company. NVDA has advanced 238 percent in the last year, making it the top performer in the S&P 500, according to TradeStation data. There were also signs of widening confidence in the stock market and economy: Despite the attention on AI, technology was a mixed bag last week. Semiconductors jumped but software companies lost value. Palo Alto Networks (PANW) led to the downside after offering free products to win business. Apple (AAPL), which still lacks a major AI offering, also weighed on tech. Homebuilders outperformed despite a lack of news. However, Treasury yields showed signs of peaking. That could be noteworthy because housing stocks rallied in anticipation of lower rates in December. Cyclical sectors associated with stronger economic growth — materials, industrials and financials — were some of the biggest gainers last week. That may suggest that investors are rotating back toward “value” stocks after the recent surge in “growth” stocks like NVDA. Garmin (GRMN) was the top performer in the S&P 500 last week after strong demand for fitness products pushed results ahead of forecasts. Industrial-engineering firm Quanta Services (PWR) and business-service provider Iron Mountain (IRM) also jumped on strong results. Discover Financial (DFS) rallied after accepting a $35 billion takeover by Capital One (COF). It’s the biggest acquisition so far this year. Another big gainer was Jack Dorsey’s payments firm Block (SQ), up 20 percent. Formerly known as Square, the company raised its guidance and announced plans to convert Cash App users into banking clients. The S&P 500 has remained in a tight uptrend since it started rallying in late October. Some indicators may suggest buyers are focusing on a wider set of companies after megacap technology firms reported quarterly results. For example, 92 members of the S&P 500 hit new 52-week highs on Friday. It was the second-highest total since May 2021, according to TradeStation data. (The previous high occurred on December 14.) Second, more members of the S&P 500 are above their 20-day moving averages than above their 50-day moving averages. This event has sometimes anticipated more gains. Third, the Advance / Decline line hit a new record high. That indicates more companies are participating to the upside. This week brings a few economic reports and earnings releases. New home sales are due today. Tomorrow brings durable-goods orders and consumer confidence. Lowe’s (LOW), Macy’s (M), eBay (EBAY) and First Solar (FSLR) issue quarterly results. On Wednesday morning, the government will revise its previous estimate of fourth-quarter gross domestic product. Crude-oil inventories are also due, along with earnings from Salesforce.com (CRM), HP (HPQ) and Baidu (BIDU). Thursday brings the personal consumptions expenditures (PCE) inflation index and initial jobless claims. Friday’s main item is the Institute for Supply Management’s manufacturing report. Standardized Performances for ETF mentioned above Exchange Traded Funds (“ETFs”) are subject to management fees and other expenses. Before making investment decisions, investors should carefully read information found in the prospectus or summary prospectus, if available, including investment objectives, risks, charges, and expenses. Click here to find the prospectus. Leaving TradeStation You are leaving TradeStation.com for another company’s website. Click the button below to acknowledge that you understand that you are leaving TradeStation.com.\nI Acknowledge You are leaving TradeStation.com for another company’s website. Click the button below to acknowledge that you understand that you are leaving TradeStation.com. I Acknowledge Leaving TradeStation This event is hosted on YouCanTrade. The information for this event is being provided for informational and educational purposes only.\nYou are leaving TradeStation Securities and going to YouCanTrade. YouCanTrade is an online media publication service which provides investment educational content, ideas and demonstrations, and does not provide investment or trading advice, research or recommendations. YouCanTrade is not a licensed financial services company or investment adviser and does not offer brokerage services of any kind.\nTradeStation Securities, Inc. provides support and training channels hosted on YouCanTrade, its affiliate. Other than these support and training channels, any services offered by YouCanTrade are not sponsored, endorsed, sold or promoted by TradeStation Securities and it makes no representation regarding any YouCanTrade goods or services.\nTo acknowledge you are leaving TradeStation Securities to go to YouCanTrade, please click\nI Acknowledge This event is hosted on YouCanTrade. The information for this event is being provided for informational and educational purposes only. You are leaving TradeStation Securities and going to YouCanTrade. YouCanTrade is an online media publication service which provides investment educational content, ideas and demonstrations, and does not provide investment or trading advice, research or recommendations. YouCanTrade is not a licensed financial services company or investment adviser and does not offer brokerage services of any kind. TradeStation Securities, Inc. provides support and training channels hosted on YouCanTrade, its affiliate. Other than these support and training channels, any services offered by YouCanTrade are not sponsored, endorsed, sold or promoted by TradeStation Securities and it makes no representation regarding any YouCanTrade goods or services. To acknowledge you are leaving TradeStation Securities to go to YouCanTrade, please click I Acknowledge I Acknowledge "
}