{
    "title": "Wall Street hunts for more AI gold after Nvidia's soaring rally",
    "date": "2/29/2024",
    "url": "https://www.xm.com/fr/research/markets/stocks/reuters/wall-street-hunts-for-more-ai-gold-after-nvidias-soaring-rally-53779242",
    "text": "7 classes d’actifs - 10+ plateformes de trading - Plus de 1000 instruments Marre d’avoir encore raté un séminaire ? Nous vous présentons la formation en direct XM. Voir. \n LIVE Ce site internet est exploité par XM Global (FSC). Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Commencez à trader les instruments de votre choix sur XM MT4 et MT5, disponibles pour PC et Mac. Sinon, vous pouvez également essayer le XM WebTrader, accessible instantanément depuis votre navigateur. De plus, nos plateformes complètes pour les appareils mobiles, compatibles avec MT4 comme avec MT5, vous faciliteront l’accès aux marchés et vous permettront de trader sur votre compte à partir de votre smartphone ou de votre tablette. Vous pouvez choisir dans la liste votre plateforme mobile ou bureau favorite. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Notre centre de recherche et de formation propose des mises à jour quotidiennes sur les plus importantes sessions des bourses, avec de nombreux points quotidiens sur tous les événements financiers critiques qui façonnent chaque jour les marchés mondiaux. Avec 20 professionnels des marchés plurilingues, nous avous offrons une base de connaissances pour former nos clients et leur donner des avantages concurrentiels compétitfs. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. XM a des normes élevées de qualité pour ses services. Nous croyons que les services financiers polyvalents exigent de la polyvalence dans la pensée et une politique unifiée de principes commerciaux. Notre mission est de suivre le rythme des demandes du marché mondial et d'aborder les objectifs d'investissement de nos clients avec un esprit ouvert. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Choisissez comment vous souhaitez obtenir de l’aide. Chat en direct En utilisant notre chat en direct, vous acceptez que toutes les données personnelles fournies via le chat en direct soient traitées par nous, conformément à notre politique de confidentialité, afin d’obtenir de l’aide de la part de notre équipe expérience client. Viber Scannez le code QR ci-dessous avec votre smartphone. En utilisant notre fonctionnalité de chat Viber, vous acceptez que toutes les données personnelles que vous fournissez à XM Global Limited via Viber soient traitées conformément à notre politique de confidentialité et à la politique de confidentialité de l’application, afin d’obtenir de l’aide de la part de notre équipe expérience client. Centre d’aide 1 mars 2024 à 6h01 GMT By Lewis Krauskopf NEW YORK, March 1 (Reuters) -Money managers are scrambling to cash in on the stock market’s interest in artificial intelligence, as a stunning rally by Nvidia NVDA.O sparks a search for other companies that are capitalizing on the technology. Shares of Nvidia - whose chips are the gold standard in the AI industry - are up about 60% this year after tripling in 2023. The run has pushed its market value to roughly $2 trillion, making it the third-largest U.S. company by market cap after Microsoft MSFT.O and Apple AAPL.O. It has also spurred Wall Street to search for other AI-focused companies in hopes of catching outsized moves. Whether investors are looking at the broader chip industry or betting on firms elsewhere in the value chain, they agree on one thing: AI is here to stay. “It's not a fad,\" said Francisco Bido, senior portfolio manager for F/m Investments' Large Cap Focused Fund. \"There are too many ... cases where companies can make really good use of the technology to enhance both their top and bottom lines.” Excitement over AI helped power the Nasdaq Composite Index .IXIC to a record high on Thursday, while the S&P 500 .SPX also marked its latest record. The indexes are both up about 7% this year. Further signs of the growing fixation on AI have been easy to spot. Mentions of AI on conference calls reached a new high in the fourth quarter, Goldman Sachs said recently. The bank’s analysts have estimated artificial intelligence technology could add 1.5 percentage points to U.S. productivity growth if there is widespread adoption over the next decade. A Morgan Stanley survey of chief information officers suggests 2024 is \"a Year of Investment for AI,\" the bank said in a note this week, with CIOs naming AI/machine learning as their top priority for the first time. Bido’s fund retains a large holding in Nvidia, but has branched out into other AI plays, including rival chipmaker Advanced Micro Devices AMD.O and MongoDB MDB.O, whose database products could be in high demand as AI is poised to change data infrastructure needs. Those stocks have risen sharply, although less dramatically, than Nvidia and some other AI plays that have recently captured the market's attention. AMD shares are up 30% year-to-date, for example, while Mongo’s have risen 9%, though the shares of both companies doubled last year. By contrast, shares of server component supplier Super Micro Computer SMCI.O and chip designer ARM Holding ARM.O have jumped about 200% and 90%, respectively, in 2024. SMCI's shares tripled in 2023.  Ivana Delevska, founder and chief investment officer of Spear Invest, said Nvidia has remained the biggest holding in its Spear Alpha ETF SPRX.O. But the exchange-traded fund has also sought to capitalize on growing cybersecurity needs related to AI by owning shares of Zscaler ZS.O, a cybersecurity specialist. The fund's position in Snowflake SNOW.N, meanwhile, seeks to take advantage of data infrastructure demands. Of course, the risks of playing the often-volatile stocks of AI-related companies remain despite the technology’s higher profile. Shares of Snowflake, for example, fell 18% on Thursday after the company projected annual revenue below Wall Street estimates and disclosed the unexpected retirement its CEO. Baker Avenue Wealth Management trimmed its Nvidia holding as the stock has climbed so that it does not occupy too large a position in client portfolios, said King Lip, the firm’s chief strategist. But the firm recently started building a position in Taiwan Semiconductor TSM.N 2330.TW, a key supplier to Nvidia. \"If you still want artificial intelligence exposure but are perhaps a little skittish about Nvidia’s stock price, I think Taiwan Semi is kind of a no brainer,” Lip said. Que Nguyen, chief investment officer of equities at Research Affiliates, is looking for reasonably valued semiconductor companies that could stand to benefit from AI. Among them are Lam Research Corp LRCX.O, which supplies equipment to the semiconductor industry, and Micron Technology MU.O, which makes memory chips and data storage. Lam Research shares are up about 20% so far this year, while Micron is up 6%. “Large language models are not just processing, you need to have storage,” Nguyen said. Of course, many investors are happy sticking with big Nvidia positions. The Martin Currie US Unconstrained Fund has nearly 10% of its assets - the maximum the fund allows for one stock - in Nvidia, said portfolio manager Zehrid Osmani. He believes the company will maintain competitive advantages as it spends more heavily than rivals on research and development. \"We have high conviction in the name, and that's expressed through high position size,\" Osmani said.  Nvidia vs other AI plays https://reut.rs/3OX2vlR Reporting by Lewis Krauskopf in New YorkAdditional reporting by David Randall in New YorkEditing by Ira Iosebashvili and Matthew Lewis  Avertissement : Les entités de XM Group proposent à notre plateforme de trading en ligne un service d'exécution uniquement, autorisant une personne à consulter et/ou à utiliser le contenu disponible sur ou via le site internet, qui n'a pas pour but de modifier ou d'élargir cette situation. De tels accès et utilisation sont toujours soumis aux : (i) Conditions générales ; (ii) Avertissements sur les risques et (iii) Avertissement complet. Un tel contenu n'est par conséquent fourni que pour information générale. En particulier, sachez que les contenus de notre plateforme de trading en ligne ne sont ni une sollicitation ni une offre de participation à toute transaction sur les marchés financiers. Le trading sur les marchés financiers implique un niveau significatif de risques pour votre capital. Tout le matériel publié dans notre Centre de trading en ligne est destiné à des fins de formation / d'information uniquement et ne contient pas – et ne doit pas être considéré comme contenant – des conseils et recommandations en matière de finance, de fiscalité des investissements ou de trading, ou un enregistrement de nos prix de trading ou une offre, une sollicitation, une transaction à propos de tout instrument financier ou bien des promotions financières non sollicitées à votre égard. Tout contenu tiers, de même que le contenu préparé par XM, tels que les opinions, actualités, études, analyses, prix, autres informations ou liens vers des sites tiers contenus sur ce site internet sont fournis \"tels quels\", comme commentaires généraux sur le marché et ne constituent pas des conseils en investissement. Dans la mesure où tout contenu est considéré comme de la recherche en investissement, vous devez noter et accepter que le contenu n'a pas été conçu ni préparé conformément aux exigences légales visant à promouvoir l'indépendance de la recherche en investissement et, en tant que tel, il serait considéré comme une communication marketing selon les lois et réglementations applicables. Veuillez vous assurer que vous avez lu et compris notre Avis sur la recherche en investissement non indépendante et notre avertissement sur les risques concernant les informations susdites, qui peuvent consultés ici. Politique de confidentialité | Politique de cookies | Politique de vulnérabilités | Conditions générales Juridique : Ce site internet est exploité par XM Global Limited, dont l’adresse de domiciliation est Suite 101, 63 Eve Street, Belize City, Bélize. XM Global Limited, enregistrée auprès de la Financial Services Commission (FSC) en vertu du Securities Industry Act 2021 (numéro de licence : 000261/397) et Trading Point of Financial Instruments Limited, autorisée et réglementée par la Cyprus Securities and Exchange Commission (CySEC) (numéro de licence : 120/10), font partie de Trading Point Group. Avertissement sur les risques : nos services impliquent un risque significatif, ce qui peut avoir pour conséquence la perte du capital que vous avez investi.Merci de lire et de vous assurer que vous comprenez parfaitement notre Divulgation des risques. Régions restreintes : XM Global Limited ne fournit pas de services pour les résidents de certains pays, tels que États-Unis d'Amérique, Canada, Israël et République islamique d'Iran. XM n’adresse pas son site internet et ses services à n’importe quelle personne dans n’importe quel pays dans lequel l’utilisation de son site internet et de ses services sont interdits par les lois ou réglementations locales. Lorsque vous accédez à ce site internet depuis un pays dans lequel son utilisation peut ou non être interdite, il en va de la responsabilité de l’utilisateur de s’assurer que toute utilisation du site internet ou des services est conforme aux lois ou réglementations locales. XM n’affirme pas que son site internet est adapté à toutes les juridictions. Qu’est-ce qu’un cookie ? Les cookies sont de petits fichiers de données. Lorsque vous visitez un site internet, le site internet envoie un cookie à votre ordinateur. Votre ordinateur le stock dans un fichier situé à l'intérieur de votre navigateur. Les cookies ne transmettent pas de virus ou de logiciels malveillants à votre ordinateur. Parce que les données d'un cookie ne changent pas lorsqu'il se déplace, il n'a aucun moyen d'affecter le fonctionnement de votre ordinateur, mais ils agissent plus comme des journaux (c.-à-d. ils enregistrent l'activité de l'utilisateur et se souviennent des informations) et sont actualisés chaque fois que vous visitez un site internet. Nous pouvons obtenir des informations vous concernant en accédant à des cookies envoyés par notre site internet. Différents types de cookies permettent de suivre vos différentes activités. Par exemple, les cookies de session ne sont utilisés que lorsqu'une personne navigue activement sur un site internet. Une fois que vous quittez le site internet, le cookie de session disparaît. Pourquoi les cookies sont-ils utiles ? Nous utilisons des cookies fonctionnels pour analyser la manière dont les visiteurs utilisent notre site internet, ainsi que pour suivre et améliorer les performances et le fonctionnement de notre site internet. Cela nous permet d'offrir une expérience client de haute qualité, en identifiant et en réglant rapidement tout problème qui pourrait survenir. Par exemple, nous pouvons utiliser des cookies pour savoir quelles pages du site internet sont les plus populaires et quelle méthode de liaison entre les pages du site internet est la plus efficace. Ce dernier nous aide également à savoir si vous nous avez été renvoyé par un autre site internet et à améliorer nos futures campagnes publicitaires. Une autre utilisation des cookies est de stocker vos sessions de connexion, ce qui signifie que lorsque vous vous connectez à l'Espace membre pour déposer des fonds, un \"cookie de session\" est défini de sorte que le site internet se souvient que vous vous êtes déjà connecté. Si le site internet n'a pas défini ce cookie, on vous demandera votre nom d'utilisateur et votre mot de passe à chaque nouvelle page au fur et à mesure que vous progressez dans le processus de dépôt de fonds. En outre, des cookies fonctionnels, par exemple, sont utilisés pour nous permettre de nous souvenir de vos préférences et de vous identifier en tant qu'utilisateur, de garantir la sécurité de vos informations et de fonctionner de manière plus fiable et plus efficace. Par exemple, les cookies vous évitent de taper votre nom d'utilisateur chaque fois que vous accédez à notre plateforme de trading et vous rappellent vos préférences, comme la langue que vous souhaitez lire quand vous vous connectez. Voici un aperçu de quelques fonctions que nos cookies nous fournissent : Ce site internet utilise Google Analytics, un service d'analyse internet fourni par Google, Inc. (\"Google\"). Google Analytics utilise des cookies analytiques placés sur votre ordinateur pour aider le site internet à analyser l'utilisation du site internet par l'utilisateur. Les informations générées par les cookies concernant votre utilisation du site internet (y compris votre adresse IP) peuvent être transmises et stockées par Google sur leurs serveurs. Google peut utiliser ces informations pour évaluer votre utilisation du site internet, pour répondre aux rapports sur l'activité du site internet et pour fournir d'autres services liés à l'activité du site internet et à l'utilisation d'internet. Google peut également transmettre ces informations à des tiers si la loi l'exige ou si ces tiers traitent ces informations pour le compte de Google. Google n'associera pas votre adresse IP avec d'autres données détenues. En utilisant ce site internet, vous donnez votre consentement à Google pour traiter les données vous concernant de la manière et aux fins décrites ci-dessus. Changez les paramètres Veuillez sélectionner le type de cookies que vous voulez avoir sur votre appareil. Nous utilisons des cookies pour vous donner la meilleure expérience possible de notre site internet. En savoir plus ou modifier vos paramètres de cookies. Avertissement sur les risques :  votre capital est à risque. Les produits à effet de levier ne sont pas recommandés pour tous. Veuillez consulter notre Divulgation des risques Merci d’entrer vos coordonnées. Si vous possédez déjà un compte XM, merci d’indiquer votre identifiant de compte pour que notre équipe d’aide puisse vous apporter le meilleur service possible. "
}