{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.thehindubusinessline.com/portfolio/do-the-magnificent-7-still-have-fire-power/article67808873.ece",
    "text": "Get businessline apps on Connect with us TO ENJOY ADDITIONAL BENEFITS Connect With Us Get BusinessLine apps on Comments READ LATER The week gone by had it all. Resurfacing jitters of regional banking crisis in the US resulted in bond yields collapsing significantly in early part of the week. Then, a hawkish Fed pushing back expectations of interest rate cuts last Thursday, was followed by a significantly hotter-than-expected US monthly jobs report that resulted in yields spiking again and bonds giving up most of the gains made earlier during the week. But none of these could temper the momentum in global equity markets with the S&P 500 closing at an all-time high on Friday, propelled by Meta Platforms, which added the worth of a Reliance Industries on a single day, and Amazon, which added the worth of a TCS on single day. Earnings from these two companies capped out what has been quite an eventful year for the ‘Magnificent Seven’ stocks that are perceived by investors to be at the forefront of the AI boom. With Meta surging by 20 per cent on blowout earnings, it created a record for the largest-ever market-cap gain in a single day in Wall Street history, with a gain of around $205 billion. This takes its return in the last one year to 155 per cent, which is quite spectacular for a large-cap company, and its returns since the lows of November 2022 ($88) to 440 per cent! Cumulatively, the ‘Magnificent Seven’ have added $5 trillion in market-cap in the last one year as against the S&P 500 adding $7.25 trillion in the same period. In fact, excluding the ‘Magnificent Seven’ stocks, the rest S&P 493 has not created much value at all in aggregate over the last one year. So does this ‘Magnificent Seven’ rally have more legs? Analysis of their performance over the last one year indicates diverging trends within this cluster with few winners and losers. Leading the pack is Nvidia, whose chips make advanced AI computing possible. With virtually a near monopoly in this space, the stock has been the best performer returning 213 per cent in the last one year. And the best thing has been that in this time its one year forward PE has actually shrunk from 48.7 times same time last year to 32 times now. In the last one year, its earnings have gone up by 400 per cent while revenues have increased a stunning 125 per cent YoY. Amazon is another company whose relentless focus on costs under new CEO Andy Jassy in the last two years, has seen its stock price move up nicely despite forward PE multiple shrinking marginally from 36 times a year back to 34.6 times now. The returns in Meta and Microsoft have been a mix of improving operating performance and expansion in valuation multiples as investors warm up to the prospects of their AI products. Of course, Microsoft also comes with a burden of being too large and diversified, which inherently can temper the growth rate for company as a whole. Two companies that have underwhelmed are Tesla and Apple and hence the debate is now shifting to whether it must be the Magnificent Five, instead of seven as some point out that Tesla is an automobile company and not a tech company as Elon Musk has been touting. A lot of Tesla’s frothy valuation was tied up to expectations of launches of its fleet of Level 5 autonomous cars and robotaxis, the timings for which have been consistently pushed back and appear years away if at all feasible for now. As auto industry cyclicality hit the company, the stock has been a disappointment with earnings declining and the stock being held up by multiple expansion. The multiple expansion, too, can get tested in CY24 if investor hope wanes. While Apple has been silent on its AI plans, at its earnings conference last week Tim Cook hinted that they may have an AI announcement this year. This would be crucial for the company which has seen stock price expand amidst flattish revenue and earnings trend for two years ending FY24. What may work for the pack is that while hopes remain high, the valuations are not as frothy as they were during the dotcom boom. At the peak of the dotcom boom, the then top seven tech stocks (Microsoft, Intel, Cisco, Qualcomm, Oracle, JDS Uniphase and Sun Microsystems) had trailing PE in the range of 50 to 200 times against the crurrent magnifiient Seven’s 24-85 times now. While this may not protect investors from economic slowdown and disruptions that can displace some players, in a worst case scenario it might spare them the 80-90 per cent declines that Big Tech experienced in 2000-02 and the decade-long recovery that followed. Comments BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Terms & conditions  |  Institutional Subscriber "
}