{
    "title": "2 Top Tech Stocks That Could Make You a Millionaire",
    "date": "1/30/2024",
    "url": "https://www.fool.com/investing/2024/01/30/2-top-tech-stocks-that-could-make-you-a-millionair/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Technology stocks have delivered outstanding gains to investors in the market over the past decade, which is evident from the Nasdaq-100 Technology Sector index's 431% jump in the last 10 years. These returns suggest that the Nasdaq-100 has turned a $100,000 investment into $531,000 despite periods of volatility. However, some stocks have outpaced the Nasdaq-100 by a huge margin. For instance, as of this writing, Nvidia (NVDA 3.12%) has turned an investment of $100,000 into more than $15 million. Super Micro Computer (SMCI 0.12%) is another tech stock in this league, as a $100,000 investment made in this stock 10 years ago is now worth more than $2.2 million. The following chart shows just how lucrative an investment in Nvidia and Super Micro Computer shares has been in the past decade.  NVDA data by YCharts. Now, past performance isn't an indicator of how a stock may perform in the future. But solid growth drivers make it worth taking a look at the prospects of these companies that have made investors millionaires in the past decade. So, if you have $100,000 in investible cash after your bills are paid, loans with high interest rates are cleared, and there is enough saved for a rainy day, it may be a good idea to put that money into shares of Nvidia and Super Micro Computer. These two stocks could help you become a millionaire -- or get close to that mark -- when bought as a part of a diversified portfolio. Let's see how. The market has rewarded Nvidia handsomely for its impressive revenue and earnings growth over the past decade.  NVDA data by YCharts. TTM = trailing 12 months. The good news is that Nvidia now has stronger catalysts -- in addition to those that have powered its growth so far -- that could help it clock even faster growth over the next decade. For example, Nvidia was originally known for its graphics cards used in personal computers (PCs) to play video games. The company is the leader in that market, with a dominant share of 82%, according to Jon Peddie Research. The good news for Nvidia investors is that the market for discrete graphics cards deployed in PCs is expected to see annual growth of 16% over the next decade, according to market research firm Imarc Group. The firm estimates that this market could generate annual revenue of $77 billion in 2032. This presents a huge incremental growth opportunity for Nvidia, considering the company generated $9.4 billion in revenue from its gaming segment in the trailing 12 months. If Nvidia manages to maintain its share of this market in 2032, gaming revenue could multiply significantly and ensure the company sustains its robust growth momentum. However, Nvidia's dominance in another market could help drive even stronger growth for the company -- artificial intelligence (AI) chips. The size of the AI chip market, worth an estimated $14 billion in 2022, is expected to jump to a whopping $372 billion by 2032, based on a forecast by market research provider Brainy Insights. Nvidia controls a lion's share of this space, with an 85% share. This should pave the way for eye-popping growth in its data center business, which has generated just under $33 billion in revenue in the trailing 12 months. So, Nvidia clearly has a couple of multibillion-dollar opportunities, which explains why the company's bottom line is projected to increase at an annual pace of an impressive 102% over the next five years. That's more than double the 48% annual earnings growth Nvidia posted in the last five years. Assuming Nvidia can increase its earnings at 50% annually over the next five years, its earnings could increase to $93.50 per share in fiscal 2029 (using its projected fiscal 2024 earnings of $12.31 per share as the base). Nvidia sports a five-year forward earnings multiple of 42, which it can sustain after five years, thanks to the acceleration in its growth. Multiplying the projected fiscal 2029 earnings by Nvidia's average five-year forward earnings multiple points to a stock price of just over $3,900. That's nearly 6.5 times the company's current price, meaning this AI stock could turn a $100,000 investment into almost $650,000 in five years. So, buying $100,000 worth of Nvidia stock right now could help investors get closer to their target of becoming millionaires. And they should consider acting quickly because it is trading at 30 times forward earnings right now, a discount to its five-year average multiple. Like Nvidia, Super Micro Computer's growth is set to accelerate big time in the future, thanks to the growing demand for the company's AI server solutions. The following chart shows Super Micro's revenue and earnings increased at a nice clip since the beginning of 2022.  SMCI Revenue (TTM) data by YCharts. TTM = trailing 12 months. Looking ahead, Super Micro seems set for even faster growth. According to consensus estimates, Super Micro's revenue is expected to increase a terrific 61% in the current fiscal year to $11.5 billion. Its earnings are forecast to increase nearly 56% to $18.39 per share. More importantly, Super Micro's management believes it can continue to grow rapidly and even hit $20 billion in annual revenue within a couple of years. It is also worth noting that Super Micro is enhancing its manufacturing capacity so that it can push \"total revenue capacity to a much higher scale than $20 billion.\" Considering how fast the market for AI servers is growing, it won't be surprising to see Super Micro's revenue eventually exceed the $20 billion mark. Foxconn predicts the AI server market's revenue could increase fivefold between 2023 and 2027 to $150 billion at the end of the forecast period. Super Micro is known for providing high-performance server and storage solutions for multiple applications, including AI, cloud computing, enterprise data centers, and 5G. Even better, the company is said to be in a solid position to gain more market share in this space, according to a Barclays analyst. That's not surprising, given that Super Micro's server platforms can be used to mount chips from multiple manufacturers, including Nvidia. All this explains why analysts are predicting the company's earnings to grow at an annual pace of almost 40% over the next five years. Based on Super Micro's fiscal 2024 projected earnings of $18.39 per share, its earnings could land at almost $99 per share after five years if it indeed manages to clock 40% growth. Multiplying the projected earnings with the Nasdaq-100 index's (using the index as a proxy for tech stocks) forward earnings multiple of 29 points to a stock price of $2,870 after five years. That's more than 6 times Super Micro's current price. Also, with Super Micro trading at just 7 times forward earnings right now, buying it looks like a no-brainer, considering the potential upside on offer. As such, investors looking to add fast-growing tech stocks to their diversified portfolios -- which could help them achieve their aim of becoming millionaires in the long run -- could consider buying shares of both Nvidia and Super Micro, given the companies' big growth drivers. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool recommends Super Micro Computer. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}