{
    "title": null,
    "date": "1/4/2024",
    "url": "https://www.benzinga.com/markets/penny-stocks/24/01/36475514/powered-by-nvidia-beamr-aims-to-disrupt-the-video-world",
    "text": "Video is everywhere: We watch Netflix or Amazon Prime on television, YouTube and social media clips on our smartphones and homemade videos on messenger apps. We spend an average of 150 minutes a day watching videos online – that is about 1 of every 6 minutes of our waking hours! Videos already account for 80% of global online traffic, yeah that’s how big it is, and there is more and more demand for digital space in this market. One noticeable example is the booming sector of Artificial Intelligence (AI), which attracts tech giants and many startups in Machine Learning, Vision AI and Generative AI. Videos are also essential for automated cameras, required for security or regulatory reasons, or for a company that builds their Zoom recordings library -- and these are just a few of the relevant use cases. This huge motion picture ball has high costs. Working with video is expensive and complex. It demands constant updates and format changes. Tech giants, like Google or Meta, have the resources to handle this successfully, but many businesses can’t do it by themselves. Here is the sweet spot of Beamr BMR. With patent-proven and award-winning technology for optimizing videos, without compromising quality, and with a 13-year track record – Beamr is now collaborating with Nvidia NVDA, the GPUs empire, on a new cloud service that automates and lowers the cost of the essential services of video compression, storage and transfer. How? As with many effective technologies, the explanation is simple: it enables users to easily shrink files and save up to 50% on video storage costs – while the videos always look the same. “We have very powerful technology that we’ve developed and improved over the past decade. We attracted customers that keep choosing to work with us, like Netflix, ViacomCBS, Walmart and Deluxe,” said Sharon Carmel, Beamr CEO. “Now, we wish to democratize video optimization and bring our technology to each and every customer-facing the tough challenges of video at scale. We couldn't think of a better partner than Nvidia, and after an intense 2-year journey we recently launched our new cloud service”. Image credit: Envato elements Cloud video storage was $7.3 Billion in 2021, and is expected to grow to $13.5 Billion next year. Many experienced players move to the cloud, and many new ones join. The hybrid cloud solution, combining Beamr technology with Nvidia hardware and operating over Amazon’s AWS, fits exactly these customers' needs, now and into the future of the video world. Carmel explained: “Every company that has a large repository of videos, whether it was accumulated over years and needs management and updates, or whether it is part of Vision AI research or Machine Learning training that demands a lot of video power - has huge storage and networking costs associated with it. We can allow these users to free resources, and in 2024, we intend to take it even further with upcoming products we will launch”. Behind the scenes is Beamr’s Content-Adaptive-Bitrate technology (CABR), which is the fruit of 13 years of R&D and won an Emmy award for technology and engineering in 2021. To explain this exceptional technology in the most straightforward way, imagine a keen-eyed video expert examining a video file, frame by frame, and never missing a beat. Every pixel is perfect, every color vibrant, every motion smooth - yet size and costs lower significantly. About Beamr Beamr BMR is a world leader in content-adaptive video solutions. Backed by 53 granted patents, and winner of the 2021 Technology and Engineering Emmy® award and the 2021 Seagate Lyve Innovator of the Year award, Beamr's perceptual optimization technology enables up to a 50% reduction in bitrate with guaranteed quality. For more details, visit www.beamr.com Featured photo credit: Nvidia This post was authored by an external contributor and does not represent Benzinga's opinions and has not been edited for content. This contains sponsored content and is for informational purposes only and not intended to be investing advice. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}