{
    "title": "AI Stocks Dominate In January: Nvidia, Juniper, Palo Alto Lead The Charge - \nAdvanced Micro Devices (NASDA",
    "date": "1/19/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36695781/ai-stocks-dominate-in-january-nvidia-juniper-palo-alto-lead-the-charge",
    "text": "Tech stocks are propelling the S&P 500 index toward a new record high, originally set in January 2022. However, not all companies are from the small group of mega caps that led the final quarter rally in 2023. The index is within 30 points of the 4,818.6 intraday high reached on Jan. 4, 2022, with the top five stocks all sporting double-digit percentage gains after the first few weeks of the year. Heading the table is Juniper Networks JNPR. The software networks and cybersecurity company gained nearly 27% in January. Most of that gain was on Jan. 9 after it received a $14 billion, all-cash takeover offer from Hewlett Packard Enterprise HPE. HP is looking to expand its footprint in artificial intelligence (AI). “AI will continue to be the most disruptive workload for companies,” the company stated. The HPE portfolio will “capitalize on these substantial IT trends with networking as a critical connective component.” Also Read: The ‘Buy Everything’ Market Is Over – Synopsys-Ansys Merger Provides Fertile Ground For This Stock Picker In second place on the year-to-date gainers table is last year’s runaway winner Nvidia NVDA, with January gains of 15%. The semiconductor maker gained an astonishing 220% in 2023 and, as the stock market rally faltered into the New Year, many were questioning whether its valuation had become pushed too high. Nvidia has a price/earnings ratio of a whopping 75.4, compared to 30 for the semiconductor sector and 25.8 for the S&P 500 as a whole — and even this is above the S&P’s long-term average of 16. Zacks rates Nvidia a Strong Buy and said: “We are expecting an above average return from the NVDA shares relative to the market in the next few months. Recent price changes and earnings estimate revisions indicate this would be a good stock for momentum investors.” And as AI is widely tipped to be the major markets theme in 2024, Nvidia stands to be a major winner with its market-leading technology and firm grasp on a reported 90% of the AI graphics processing unit (GPU) market. Indeed, on Thursday it was announced that Facebook owner Meta Platforms META plans to purchase 350,000 of Nvidia’s H100 GPU’s to enhance its AI capabilities. With each unit costing around $30,000 – that would be $10.5 billion, before any discounts. Next on the January winners list is Palo Alto Networks PANW. The California-based cybersecurity firm saw gains of 14% in January. This is likely another AI play. Companies and government agencies around the world are looking to step up their security measures to offset AI-powered cyberattacks. Palo Alto Networks stock is rated Strong Buy with 29 Wall Street analysts and last week, the company was on top of Morgan Stanley’s list when the broker recommended buying more cybersecurity stocks to meet growing risks in 2024. The company reported forecast-beating fourth-quarter earnings earlier this week. Advanced Micro Devices AMD is fourth on the S&P 500 top stocks in 2024 list with a gain of 10.3% and, like its semiconductor peer Nvidia, its shares are trading at record levels. AMD, too, could be in for a good year if AI delivers on the promise many have talked about in 2023, but with Nvidia dominating this market, AMD can still outperform as demand for traditional semiconductors is expected to continue to grow. Investor Marc Chaikin, founder of Chaikin Analytics likes AMD and told Benzinga this week: “It's all about semiconductors, with AMD and Nvidia making new highs.” Number five on the table is health-tech company Intuitive Surgical ISRG. The stock has shown gains of 10.3% so far in January. Intuitive makes robotic surgical systems. It is also investing heavily in AI technologies. The goal is to improve speed in procedures of lower complexity that require minimally invasive surgery. Now Read: Inflation-Busting Price Hikes For Ozempic, Mounjaro And Others: Are Drugmakers Profiteering? © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}