{
    "title": "Nvidia 2024 Outlook: 42% Upside on Path to $100 Billion in Free Cash Flow",
    "date": "1/5/2024",
    "url": "https://markets.businessinsider.com/news/stocks/nvidia-2024-outlook-nvda-stock-price-100-billion-cash-flow-2024-1",
    "text": "       The sharp rise in Nvidia's stock price last year is likely to spill over into 2024 as the company continues to capitalize on its success in developing and selling AI chips, according to a Thursday note from Bank of America. The bank said Nvidia's fast-growing revenue and profit profile should allow it to generate $100 billion in free cash flow over the next two years. For context, Nvidia generated less than $30 billion in free cash flow over the past two years. That massive expected free cash flow generation \"is just the cherry on top of what is a very delicious cake,\" Bank of America's Vivek Arya told CNBC on Friday. The layers of that cake include the early cycle of generative AI, Nvidia's strong competitive position, and its upcoming pipeline of new AI chips. \"These cycles don't just start and end in one year. These can be decadelong cycles and there is at least three to four years of upfront hardware deployment  — and we are just in year two,\" Arya said. The burgeoning cash pile should help Nvidia embark on new growth initiatives that would boost its valuation multiple considerably. \"Of the ~$100 billion [of] free cash flow, we estimate only ~$30 to $35 billion could be deployed for buybacks, leaving a meaningful $65 to $70 billion in ammunition for new organic and inorganic growth initiatives,\" Arya said in a Thursday note. The key for Nvidia to keep growing and retain a high valuation will be its ability to build a recurring revenue profile, according to Arya, as its dependency on hardware sales is a big reason it's trading at a price-to-earnings valuation of just 20x based on 2025 earnings estimates. That valuation is considerably below its mega-cap tech peers and below its historical median price-to-earnings multiple of 35x to 40x. \"While Nvidia gets clubbed in the 'Magnificent 7', we note Nvidia trades at a 20% to 30% discount on price-to-earnings and enterprise value-to-free cash flow basis, despite 2x the free cash flow margins and 3x the sales CAGR versus the six other 'magnificent' peers,\" Arya highlighted. But Nvidia's fast-growing pile of cash should give it the optionality to continue its fast growth and boost its valuation multiple. \"We expect Nvidia to consider assets that help it create a more meaningful recurring revenue profile. While Nvidia has a solid lead in AI, hardware-oriented businesses are not valued as highly as visibility tends to be limited,\" Arya explained. Nvidia tried but failed to acquire Arm Holdings for $40 billion in 2020, which should give investors an idea of how ambitious it will be in building out its software and intellectual property assets, according to the note. \"Currently Nvidia generates only ~$1 billion or 2% of sales in annualized revenue from software/subscriptions, which we are skeptical can exceed $5 billion at most without inorganic additions to the core AI enterprise suite. We envision Nvidia considering more enhanced partnerships/M&A of software companies that are helping traditional enterprise customers deploy, monitor and analyze genAI apps,\" Arya said. Upcoming catalysts for Nvidia stock that could help it break out of its $400 to $500 trading range include the upcoming CES tradeshow and GTC tradeshow, which could see Nvidia unveil important product updates, according to the note. Arya reiterated his \"Buy\" rating on Nvidia and $700 price target, representing potential upside of 42% from current levels. Read next Indices Commodities Currencies Stocks Jump to "
}