{
    "title": null,
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/wall-street-analysts-see-upside-195756855.html",
    "text": "In this article, we will discuss the 10 stocks whose price targets were recently raised by analysts. If you want to see more such stocks on the list, go directly to Wall Street Analysts See Upside Potential for 5 Stocks with Rising Price Targets. On January 17, financial markets experienced a significant downturn, marking the worst day in a month for stocks, primarily driven by a surge in bond yields. Accrdoing to Bloomberg, this development has raised speculations that the Federal Reserve may not be quick to implement interest rate cuts, given the apparent resilience of the economy. The likelihood of a March interest-rate cut, as indicated by Fed swaps, has now been trimmed to approximately 50%, reflecting a shift in market expectations. The surge in US retail sales, reported as the highest in three months, further intensified concerns among investors. The robust reading on retail sales triggered apprehensions about the efficacy of Wall Street's assertive dovish stance, especially in the context of favorable economic data. Central bank officials, adopting a more cautious tone regarding potential easing measures, added to the apprehension among traders. This cautious stance has created an environment where market participants are now readjusting their expectations, delaying the anticipated timing of the first Fed move. As a result, the odds of a rate reduction in the first quarter have been revised downward. The comments from European Central Bank President Christine Lagarde underscore the concerns about aggressive market bets on interest-rate cuts. Lagarde emphasized that such speculative behavior in financial markets may not be conducive to policymakers' efforts and their ability to effectively manage economic challenges. Generative Artificial Intelligence (AI) has commanded considerable attention at the World Economic Forum, drawing interest from major tech players like Salesforce, Microsoft, and Google. In 2024, the spotlight has shifted to a more nuanced exploration of generative AI, with a specific emphasis on advancing the accuracy of AI results. This evolution is deemed critical for fostering confidence, particularly in high-stakes industries such as healthcare and manufacturing. Intel CEO Pat Gelsinger has emerged as a key advocate for this refinement, asserting that the next phase of AI development involves incorporating formal correctness into the underlying models. In an interview with CNBC, Gelsinger underscores the need for precision, especially in domains like medicine, manufacturing, and autonomous driving, where accuracy is paramount. Interviews with Gelsinger and Clara Shih, CEO of Salesforce AI, reveal a shared commitment to experimentation and co-piloting tests as instrumental strategies for improving accuracy and encouraging wider adoption of AI technologies. Shih introduces a pragmatic three-phase approach for Artificial General Intelligence (AGI) adoption, which begins with assisting work, progresses to ensuring accuracy in autopilot mode, and ultimately leads to trusting the technology at chosen confidence levels. This phased approach aligns with the broader goal of making AGI more approachable and less intimidating, emphasizing the crucial role of human acceptance. Sam Altman, CEO of OpenAI, contributes insights during panel discussions, characterizing AGI as a potent tool rather than a disruptive force replacing jobs. Altman underscores the collaborative potential of AI, describing it as an enhancer of productivity that amplifies human capabilities. Adena Friedman, CEO of Nasdaq, reflects on the past year as a transformative period for AI, describing it as a time of discovery. The financial industry, including Nasdaq, is gearing up for an \"activation\" phase, leveraging AI to update outdated code and modernize aging systems. The anticipated outcome is significant improvements in automated workflows, leading to substantial time savings for employees. The discussions at Davos underscore the pivotal role of generative AI in shaping the technological landscape. The current focus on accuracy, trust-building, and practical applications across diverse industries signals a transformative shift, emphasizing the collaborative potential of AI as a tool for enhancing productivity and human capabilities. On the stock market front, analysts are bullish on stocks such as Amazon.com, Inc. (NASDAQ:AMZN), NVIDIA Corporation (NASDAQ:NVDA) and Verizon Communications Inc. (NYSE:VZ) among many others. Check out the complete article to see the details of these upward revisions in price targets. Upside Potential: N/A As of January 16, Barclays analyst Ryan Macwilliams has opted to uphold his Equal-Weight rating on Intel Corporation (NASDAQ:INTC), while concurrently revising the price target upward from $32 to $44. This adjustment in the price target indicates an optimistic outlook for the stock's performance in the foreseeable future. It is important to note that the industry context for Intel Corporation (NASDAQ:INTC) is crucial in understanding these recommendations. In the dynamic landscape of the technology sector, Intel, as a prominent player in the semiconductor industry, is subject to various market forces and trends. The Equal-Weight rating implies that the analyst perceives Intel Corporation (NASDAQ:INTC) performance to be in line with the broader market, neither overweight nor underweight. This nuanced stance suggests a balanced perspective, taking into consideration both the company's strengths and potential challenges. The decision to raise the price target to $44 signifies increased confidence in Intel Corporation (NASDAQ:INTC) ability to deliver positive returns to investors. Upslope Capital Management stated the following regarding Intel Corporation (NASDAQ:INTC) in its fourth quarter 2023 investor letter: “Intel Corporation (NASDAQ:INTC) – New Long: This is not a traditional long for Upslope in any sense. Intel is outside of the box in terms of typical sector and market cap focus, and the position is really a portfolio hedge (and structured as such). The thesis is very simple: Intel is uniquely positioned to benefit in two important scenarios, both of which require “protection” for Upslope’s portfolio: a continued melt-up in technology stocks and/or rising tensions over Taiwan. Combined with expectations and sentiment around Intel that were incredibly low, this nudged me to add exposure via long-dated INTC call options. While still material in terms of delta-adjusted exposure, the position has been reduced repeatedly and is much more modest today.” Upside Potential: 2% As of January 16, Barclays has adjusted its outlook on Colgate-Palmolive Company (NYSE:CL), a key player in the consumer goods industry. Specifically, Barclays has raised the company's price target from $75 to $82, reflecting a moderate upside potential of 2% in comparison to its current market price. Despite this upward revision, Barclays maintains an Equal Weight rating on Colgate-Palmolive Company (NYSE:CL) shares. This strategic move by Barclays suggests a cautious yet optimistic stance on the company's performance. The Equal Weight rating implies that, according to Barclays analysts, Colgate-Palmolive Company (NYSE:CL) is expected to perform in line with industry peers, neither overweight nor underweight. Investors may interpret this rating as an indication of balanced expectations for the stock's future performance. The increase in the price target to $82 underscores Barclays' confidence in Colgate-Palmolive Company (NYSE:CL) ability to generate positive returns for investors. The 2% upside potential suggests a measured optimism, taking into account various factors such as market conditions, company fundamentals, and potential catalysts within the consumer goods sector. Similar to the optimistic sentiments expressed by analysts towards Amazon.com, Inc. (NASDAQ:AMZN), NVIDIA Corporation (NASDAQ:NVDA), and Verizon Communications Inc. (NYSE:VZ), they are favorable about Colgate-Palmolive Company (NYSE:CL). Upside Potential: 10% As of January 16, Barclays analyst Lauren Lieberman has made notable adjustments to the outlook for The Coca-Cola Company (NYSE:KO), a prominent player in the beverage industry. Specifically, Lieberman has increased the company's price target by 10%, elevating it from $60 to $66. Importantly, this modification reflects a substantial upside potential of 10% in comparison to its current market price. Concurrently, Barclays has maintained an Overweight rating on The Coca-Cola Company (NYSE:KO) shares. The decision to raise the price target to $66 indicates a heightened level of confidence in Coca-Cola's future performance, as perceived by Barclays. This optimistic adjustment may be underpinned by factors such as anticipated improvements in financial metrics, strategic initiatives, or positive trends within the beverage industry. The Overweight rating reaffirms Barclays' belief that The Coca-Cola Company (NYSE:KO) is poised to outperform its industry peers. This rating suggests a favorable view of the stock's potential for delivering strong returns relative to the broader market. Investors may interpret this as a signal to consider The Coca-Cola Company (NYSE:KO) as an attractive investment opportunity within the beverage sector. Hayden Capital made the following comment about The Coca-Cola Company (NYSE:KO) in its third 2023 investor letter: “It’s not just emerging markets either, where one could argue a “scarcity premium” given fewer quality public companies. Even in the US, The Coca-Cola Company (NYSE:KO) trades at ~30x P/E despite having the same earnings as 10 years ago. Both of these companies actually have lower revenues than 10 – 15 years ago too, indicating that their profit growth is mostly from margin expansion. This can only last for so long before there’s no more excess expenses left to cut. I find it ironic that all these companies trade as “bond-equivalents” in the minds of investors – even commanding lower yields than US treasuries, the safest security in the world. But it’s clear that their businesses are not nearly as safe. Coca-Cola is facing disruption risk from consumers shifting to new, heathier beverage brands. But these companies are ~35% more expensive than US Treasuries, despite the heightened risk. On a risk-adjusted basis, one could argue the implied premium is even higher.” Perhaps the explanation is simply the price volatility difference between these stocks and treasuries over the last two years. For example, 10-year Treasury bonds are down ~-20% since the beginning of 2022. By comparison, KO and PG are remarkably down only -4 – 6% over that time frame.” Upside Potential: 11% As of January 16, Piper Sandler has revised its assessment of Lowe's Companies, Inc. (NYSE:LOW), a prominent player in the home improvement retail industry. Specifically, Piper Sandler has increased the target price for Lowe's Companies, Inc. (NYSE:LOW) from $218.00 to $245.00, signaling a substantial upside potential of 11%. This adjustment is accompanied by Piper Sandler's decision to affirm an \"overweight\" rating for the stock. The heightened target price of $245.00 reflects Piper Sandler's optimistic outlook on Lowe's Companies, Inc. (NYSE:LOW), suggesting a strong belief in the company's potential for future growth. This positive adjustment may be driven by factors such as anticipated improvements in financial performance, strategic initiatives, or favorable trends within the home improvement retail sector. The \"overweight\" rating underscores Piper Sandler's conviction that Lowe's Companies, Inc. (NYSE:LOW) is well-positioned to outperform its industry peers. This rating implies a favorable view of the stock's potential to deliver robust returns compared to the broader market. Investors may interpret this rating as a signal to consider Lowe's Companies, Inc. (NYSE:LOW) as an attractive investment opportunity within the home improvement retail landscape. Lowe's Companies, Inc. (NYSE:LOW) is garnering bullish outlooks from analysts, much like the positive sentiments observed for Amazon.com, Inc. (NASDAQ:AMZN), NVIDIA Corporation (NASDAQ:NVDA), and Verizon Communications Inc. (NYSE:VZ). Madison Investors Fund made the following comment about Lowe’s Companies, Inc. (NYSE:LOW) in its Q3 2023 investor letter: “The bottom five individual contributors were Dollar Tree, Fiserv, Analog Devices, Lowe’s Companies, Inc. (NYSE:LOW), and Alcon. Both Analog Devices and Lowe’s Companies saw end-market demand moderate (in semiconductors and home improvement products, respectively) relative to the strong levels over the last couple of years. Despite these near-term trends, we remain very confident in the long-term trends within both markets.” Upside Potential: 15% As of January 16, BMO Capital analyst James Fotheringham has made significant adjustments to the outlook for JPMorgan Chase & Co. (NYSE:JPM), a major player in the financial services industry. Specifically, Fotheringham has increased the firm's price target from $192 to $194, signaling a noteworthy upside potential of 15%. However, it's important to note that despite the upward revision in the price target, BMO Capital has maintained a Market Perform rating on JPMorgan Chase & Co. (NYSE:JPM). The decision to raise the price target to $194 suggests an optimistic perspective on JPMorgan's future performance, indicating confidence in the potential for significant appreciation in its stock value. This positive adjustment may be attributed to factors such as anticipated improvements in financial metrics, strategic initiatives, or positive trends within the financial services sector. The Market Perform rating from BMO Capital implies a neutral stance on JPMorgan Chase & Co. (NYSE:JPM), suggesting that the stock is expected to perform in line with the broader market. While there is acknowledgment of the potential for upside, the rating indicates a measured view on the stock's relative performance compared to its industry peers. In its fourth quarter 2023 investor letter, Vltava Fund stated the following regarding JPMorgan Chase & Co. (NYSE:JPM): “Last spring, the US went through a brief banking crisis that cost several smaller and medium-sized banks their lives. One of them, First Republic Bank, with assets of $230 billion, went into receivership and was bought out by the largest US bank, JPMorgan Chase & Co. (NYSE:JPM). The acquisition terms were very favourable for JPM and the facts that few, if any, other banks could have taken over the whole of First Republic Bank in its then-present state while guaranteeing more than $100 billion of its deposits played a role. JPM could do it. It is not only the largest, but also by its balance sheet the strongest US bank and, in our opinion, clearly the best managed. It has come out of this crisis even stronger. We have actively followed the banking sector for 20 years in many countries around the world. Our view is that a well-managed bank can be a very good long-term investment but that it is better to focus on the best and highest quality available. Banking is not a sector where it pays to trade quality for cheaper valuations. That is why we hold JPM.”  Click to continue reading and see the Wall Street Analysts See Upside Potential for 5 Stocks with Rising Price Targets.  Suggested Articles: 17 High Growth Non-Tech Stocks That Are Profitable 16 Most Profitable Small-Cap Stocks Now 30 Most Profitable Businesses You Can Start in USA Disclosure. None. Wall Street Analysts See Upside Potential for 10 Stocks with Rising Price Targets was initially published on Insider Monkey. Related Quotes "
}