{
    "title": null,
    "date": "2/27/2024",
    "url": "https://voip.review/2024/02/27/telenor-embraces-ai-future-nvidia-collaboration/",
    "text": "Telenor, the Norwegian telecom giant, has announced a groundbreaking partnership with Nvidia, marking a significant step towards integrating artificial intelligence (AI) within its operations and offerings in the Nordics. This ambitious initiative is set to transform Telenor’s business model, embedding AI into its network operations and creating AI-driven solutions for its customer base. The collaboration is backed by a substantial investment, with Telenor committing close to 100 million kroner (approximately US$10 million) in the first year for Nvidia’s advanced technology. This financial pledge underlines Telenor’s commitment to the partnership, hinting at a long-term collaboration aimed at harnessing AI’s potential across various aspects of its business. By leveraging Nvidia’s state-of-the-art hardware and AI software, Telenor aims to pioneer a range of AI applications. This strategic move not only strengthens its position as a technology-forward telecom operator but also promises to enhance network performance through innovative solutions. The partnership specifically focuses on the development of software-defined, high-performance network solutions, utilizing Nvidia’s Aerial SDK to combine 5G RAN and AI technologies on a unified platform. Amol Phadke, EVP and GCTO at Telenor Group, emphasized the collaboration’s role in driving customer-centric innovations, operational efficiency, and the growth of the Nordic AI ecosystem. The initiative includes ambitious plans for a green AI center in Norway, aiming for minimal environmental impact while fostering AI research and development. This center is expected to serve as a hub for AI innovation, offering infrastructure to businesses and academia and promoting sustainable and responsible AI practices. Telenor’s vision of becoming an AI-first company aligns with broader industry trends towards embracing generative AI for operational efficiency and sustainability. This partnership with Nvidia, alongside a previous agreement with Ericsson focusing on energy management and ethical AI, positions Telenor at the forefront of leveraging AI for transformative change in the telecom sector.  Save my name, email, and website in this browser for the next time I comment.     © 2024 VoIP Review | About us | Privacy policy | Contact us "
}