{
    "title": "Indian founders engage with Nvidia in Silicon Valley",
    "date": "2/18/2024",
    "url": "https://www.financialexpress.com/business/industry-indian-founders-engage-with-nvidia-in-silicon-valley-3397727/",
    "text": "The Financial Express Indian founders of venture capital fund Peak XV met Jensen Huang, CEO of NVIDIA, the undisputed king of advanced chips that are now driving artificial intelligence (AI) applications, at the firm’s campus in the Bay Area as part of an AI focused trip. “We’re just scratching the surface when it comes to AI,” the venture capital fund said in a post on X and Linkedin, posting a conversation its managing director Shailendra J Singh had with Sequoia Capital partner Doug Leone.\\ “AI, like the internet in the 90s, is real, but should be played out over the next 20 years,” it said. This was part of an immersion trip organized by Peak XV as part of the closing of the ninth cohort of Surge, which is Peak XV’s scale up program for early stage startups. In another post, it said: “In the post-GPT era, #AI is now a boardroom topic and top priority for CEOs in every large company around the world. Umesh Sachdev, CEO & Co-founder, Uniphore, one of the largest AI-native enterprise-class companies, speaks to Rajan Anandan at our US immersion week”. Founders who were part of the cohort shared that the tour included a demo of all NVIDIA’s solutions and how they fit into various industries and sectors. Jensen Huang also spoke to founders about his journey and the current focus areas for NVIDIA. NVIDIA has recently made headlines world-wide after their market capitalization rose to USD 1.83 trillion, nudging past Alphabet’s USD 1.82 trillion market cap. NVIDIA also surpassed Amazon, closing with a higher market cap on Tuesday for the first time since 2002. Peak XV’s founder immersion trip took place from February 13-16, 2024 and also included an ‘AI day’ focused on learning from the playbooks of founders and operators winning in the world of AI including OpenAI, Uniphore, Glean, Moveworks, and 6Sense among others. The 60+ founders joining the immersive week in the US were hosted by Peak XV Managing Directors Shailendra Singh and Rajan Anandan. Sessions were focused on building world-class companies as well as winning in the US market. Doug Leone, who led Sequoia Capital for over 25 years, spoke to Peak XV Managing Director Shailendra Singh in a candid fireside chat for founders around AI and company building. Startups attended the US week from India, Southeast Asia and Australia and are building innovative companies across AI, deep-tech, SaaS, and consumer. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}