{
    "title": "Wall Street ends higher, lifted by Uber, Lyft and Nvidia",
    "date": "2/15/2024",
    "url": "https://www.moneycontrol.com/news/business/markets/wall-street-ends-higher-lifted-by-uber-lyft-and-nvidia-12273461.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Wall Street ended sharply higher on Wednesday as ride-hailing platforms Lyft and Uber rallied, while Nvidia displaced Alphabet as the U.S. stock market's third most valuable company. Nvidia overtook Alphabet's, market capitalization ahead of the dominant AI chipmaker's quarterly results next week, now with a with a stock market value of $1.825 trillion after its shares rose 2.5%. Uber surged almost 15% to a record high, boosted by a $7 billion share buyback plan. Lyft soared 35% after its profit beat estimates and it said it would generate positive free cash flow for the first time in 2024. Helping lift the S&P 500, Meta Platforms and Tesla both gained more than 2%. The S&P 500 climbed 0.96% to end the session at 5,000.62 points.The Nasdaq gained 1.30% to 15,859.15 points, while Dow Jones Industrial Average rose 0.40% to 38,424.27 points. Super Micro Computer jumped more than 11%, adding to recent AI-related gains for the server equipment seller. That helped the Russell 200 jump 2.4%, its biggest one-day leap since mid-December. Wall Street indexes slumped to over one-week lows on Tuesday and the blue-chip Dow posted its worst day in 11 months, after data showed core consumer prices in January stayed at nearly double the Fed's 2% target, forcing investors to reassess their rate cut expectations. \"Regardless of when that first cut is, I think the market should fear what the Fed fears. What the Fed fears is cutting too soon and having to raise rates. That would be catastrophic for this rally,” said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa, Oklahoma. Providing some relief, Chicago Fed President Austan Goolsbee said the path back to the central bank's 2% inflation target would still be on track even if price increases run a bit hotter-than-expected over the next few months. Expectations the Fed will cut interest this year have fueled a rally on Wall Street in recent months that has sent the S&P 500 to record highs. Interest rate futures suggest traders mostly expect the Fed to begin cutting rates by its June policy meeting, the CME FedWatch tool showed.Robinhood Markets rallied 13% following a surprise fourth-quarter profit. Crypto stocks Coinbase, Marathon Digital and Riot surged over 13% each as bitcoin's market value crossed $1 trillion for the first time since Nov. 21. Of the 11 S&P 500 sector indexes, nine rose, led by industrials, up 1.67%, followed by a 1.42% gain in communication services. Advancing issues outnumbered falling ones within the S&P 500 by a 3.6-to-one ratio.The S&P 500 posted 37 new highs and 4 new lows; the Nasdaq recorded 92 new highs and 68 new lows. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}