{
    "title": "Nvidia's surge ripples across stock market - lifting AI, tech and \nsemiconductor ETFs",
    "date": "2/24/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240224201/nvidias-surge-ripples-across-stock-market-lifting-ai-tech-and-semiconductor-etfs",
    "text": "By Christine Idzelis 'We think the near-term momentum in AI-related stocks is likely to continue,' says CIO of UBS Global Wealth Management Several exchange-traded funds that buy stocks with exposure to artificial intelligence surged Thursday after closely watched AI beneficiary Nvidia Corp. beat earnings expectations. The Global X Robotics & Artificial Intelligence ETF BOTZ, which has around $3 billion of assets under management, closed 4.4% higher, according to FactSet data. Megacap semiconductor company Nvidia (NVDA) was the ETF's biggest holding on Wednesday at around 18.9% of its net assets, holdings data on Global X's website show. \"We think the near-term momentum in AI-related stocks is likely to continue,\" said Solita Marcelli, chief investment officer for the Americas at UBS Global Wealth Management, in a note Thursday. \"To position, we maintain our preference for semiconductors and software, and see opportunities in beneficiaries of AI edge computing, big tech, and their partners.\" Shares of Nvidia's soared 16.4% on Thursday to an all-time high after the semiconductor company released its latest quarterly earnings results following the U.S. stock market's close on Wednesday. The megacap chip maker's big gains made it the best-performing stock in the S&P 500 on Thursday, propelling the large-cap index to a fresh record closing peak and fueling a sharp jump in its information-technology sector, in particular. AI-related exchange-traded funds whose shares also surged Thursday included the Roundhill Generative AI & Technology ETF CHAT and the Invesco AI and Next Gen Software ETF IGPT, each with around 5% gains, according to FactSet data. Both funds are much smaller than the Global X Robotics & Artificial Intelligence ETF based on assets under management. Other AI ETFs that closed sharply higher on Thursday were the ROBO Global Artificial Intelligence ETF THNQ, Wisdom Tree Artificial Intelligence & Innovation Fund WTAI, Global X Artificial Intelligence & Technology ETF AIQ, iShares Robotics & Artificial Intelligence Multisector ETF IRBO, and ROBO Global Robotics & Automation Index ETF ROBO, FactSet data show. 'AI enthusiasm intact' For now, Nvidia \"has met lofty expectations and that will keep general AI enthusiasm intact and that is a positive for the market, broadly speaking,\" said Tom Essaye, founder and president of Sevens Report Research, in a note Thursday. See: Nvidia's stock surge could add $200 billion in market cap with 'mammoth growth' on tap \"The question now is whether AI enthusiasm can continue to pull the market higher or if we're now in need of new leadership to send the S&P 500 towards 5,100 and higher,\" Essaye said. \"The replacement for AI leadership isn't evident on the surface.\" The S&P 500 index SPX rose 2.1% Thursday to finish at about 5,087. The S&P 500's information-technology sector XX:SP500.45 jumped more than 4% on Nvidia's surge, easily outperforming the index's 10 other sectors, according to FactSet data. Read: AI stocks in the S&P 500 have outperformed this year - and not just the 'Magnificent Seven' Nvidia isn't the biggest holding for all AI-themed ETFs, though. For example, the chip maker ranked third in the iShares Robotics & Artificial Intelligence Multisector ETF on Wednesday with an almost 1.3% weight, data from BlackRock's website show. ARM Holdings (ARM) was the fund's largest exposure at 1.7%, followed by Meta Platforms Inc. (META) at slightly more than 1.3%. Meanwhile, Nvidia's surge on Thursday also lifted shares of semiconductor-focused ETFs. The iShares Semiconductor ETF SOXX ended 4.9% higher while the VanEck Semiconductor ETF SMH surged 6.8%, FactSet data show. Nvidia, which was the biggest weight for both ETFs earlier this week, is among the so-called Big Tech companies that collectively represent an outsize weight in the S&P 500 index. Big Tech stocks in the group of megacap companies known as the \"Magnificent Seven,\" which span across the tech, communication-services and communication-discretionary sectors, were all rising on Thursday, with Nvidia leading the way up. Shares of the Roundhill Magnificent Seven ETF MAGS - whose holdings include Microsoft Corp. (MSFT), Apple Inc. (AAPL), Nvidia, Amazon.com Inc. (AMZN), Facebook parent Meta Platforms, Google parent Alphabet Inc. (GOOGL) (GOOG) and Tesla Inc. (TSLA) - jumped 4.8% on Thursday. Nvidia also helped lift exchange-traded funds focused on tech stocks. Shares of the Vanguard Information Technology ETF VGT, Technology Select Sector SPDR Fund XLK and iShares U.S. Technology ETF IYW all climbed more than 3% on Thursday, according to FactSet data. The U.S. stock market broadly rose , with the tech-heavy Nasdaq Composite COMP leading major indexes higher with a 3% gain Thursday. The Dow Jones Industrial Average DJIA closed 1.2% higher, with software and computer-services companies posting some of the biggest gains in the index, according to FactSet data. -Christine Idzelis This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 02-24-24 0544ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}