{
    "title": "Nvidia's Market Cap Has Surpassed Amazon's Thanks to Artificial \nIntelligence (AI). There Could Be More to Come.",
    "date": "2/14/2024",
    "url": "https://www.fool.com/investing/2024/02/14/nvidias-market-cap-has-surpassed-amazon-thanks-to/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More It finally happened. After an epic run that began last year, semiconductor specialist Nvidia (NVDA 3.12%) charged past Amazon (AMZN 0.40%) on the leader board Tuesday, with a market cap of $1.78 trillion, ahead of Amazon's $1.75 trillion. This isn't the first time Nvidia has been worth more than Amazon. Nvidia pioneered the graphics processing units (GPUs) that revolutionized the gaming industry. It first overtook Amazon's market cap in early 2001, and the pair traded places on the list several times in the year that followed. However, by early 2002, Amazon had posted its first profit and offered free shipping on orders more than $99, driving the stock higher, and investors never looked back. The tech landscape is very different now, as are the opportunities for both companies. Let's take a look at the road ahead and why one stock could be the clear winner from here. Image source: Getty Images. The past year has been transformational for Nvidia. Generative artificial intelligence (AI) burst on the scene in 2023 with the ability to generate new content, summarize information, search the internet and company databases for specific information, and even write and debug computer code. Accomplishing these feats requires a great deal of computing horsepower, and Nvidia is the clear leader in the field. It's estimated that Nvidia controls an estimated 95% of the market for chips used in machine learning, an earlier branch of AI, according to CB Insights. As the top choice for existing AI processing, this gave Nvidia the inside track to generative AI applications. The company has another clear advantage. Estimates suggest Nvidia chips represent about 95% of the GPUs used in data centers to speed information through the ether, according to CFRA analyst Angelo Zino. This means that as data centers rush to boost the capabilities of their operations, Nvidia will be the first stop. Furthermore, with an installed base estimated at $1 trillion, that's a lot of data center upgrades needed to handle the accelerating adoption of AI, and Nvidia stands to grab the lion's share of that spending. That's not to say Amazon is a slouch. The company remains the undisputed leader in e-commerce. While the figures for 2023 haven't been finalized, Amazon controlled roughly 38% of the market in 2022, a number that's forecast to grow to as much as 50% in 2024, according to online data provider Statista. Amazon Web Services (AWS) still wears the crown as the leading provider of cloud infrastructure services, with 31% of the market in the third quarter of 2023, research firm Canalys reports. The company is also a rising star in the field of digital advertising, controlling an estimated 10% of the market in 2023, according to Statista. It's Amazon's position as the leading cloud provider that presents perhaps the greatest ongoing opportunity as cloud adoption is driven by the digital transformation, and it's the perfect delivery channel to sell AI services to customers. The market for generative AI is expected to top $1.3 trillion by 2032, according to Bloomberg Intelligence, and Amazon is well positioned to get its slice of this growing pie. As an Amazon shareholder, I certainly don't plan on selling the stock, particularly given its optionality and the multiple paths for growth. That said, if forced to choose between the two, I think Nvidia is the clear winner right now. There's also the matter of valuation to consider, but it isn't as cut and dry as you might think. Bears will point out that Nvidia sells for 40 times sales, compared to Amazon's price-to-sales ratio of just 3, which seems to suggest Amazon is the cheaper of the two. While that's true, consider this: In each of the past two quarters, Nvidia grew its revenue and profits by triple digits year over year -- and is expected to do so again when the company reports its fiscal 2024 fourth-quarter results next week. When factoring its astronomic growth rate using the more appropriate price/earnings-to-growth (PEG) ratio, Nvidia's valuation is 0.4 -- and the standard for an undervalued stock is less than 1. For context, Amazon is right at 1, so while it's a deal, it certainly isn't cheaper than Nvidia. The adoption of AI is just beginning. Nvidia chips are the gold standard for AI applications, which is why there could be much more to come for the GPU maker. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Danny Vena has positions in Amazon and Nvidia. The Motley Fool has positions in and recommends Amazon and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}