{
    "title": "Nvidia forms bespoke chip unit to target cloud and wireless markets",
    "date": "2/12/2024",
    "url": "https://www.mobileeurope.co.uk/nvidia-forms-bespoke-chip-unit-to-target-cloud-and-wireless-markets/",
    "text": "- The dominant global designer and supplier of AI chips Nvidia is building a custom chip unit to design bespoke AI processors for cloud computing firms, data centre operators and service providers. It has also emerged that Nvidia is in talks Ericsson, for a wireless chip that includes the chip designer’s graphics processing unit (GPU) technology, two sources familiar with the discussions told Reuters. The two companies have collaborated for several years since announcing in 2019 they were collaborating on technologies that can allow telcos to build high-performing, efficient and completely virtualized 5G RAN. Nvidia already controls about 80% of high-end AI chip market and customers include all of the largest tech companies but its H100 and A100 chips serve as a generalized, all-purpose AI processor for many of those major customers. However, hyperscalers and service providers have been developing their own chips for specific applications such as reducing power in data centres. As a result, Nvidia wants to recapture some of this emerging business and take-on custom chip builders Broadcom and Marvell Technology. And the numbers forecast for the market are large enough to encourage it to do so. Research firm 650 Group’s Alan Weckle told Reuters he expects the telecom custom chip market to remain flat at roughly $4 billion to $5 billion a year. The numbers go up from there. Weckel said the data centre custom chip market will grow to as much as $10 billion this year, and double that in 2025. Meanwhile, the broader custom chip market was worth roughly $30 billion in 2023, which amounts to roughly 5% of annual global chip sales, according to Needham analyst Charles Shi. It is easy to see Nvidia has to make this move. Nvidia does not disclose H100 prices, which are higher than for the prior-generation A100, but, according to Reuters, each chip can sell for $16,000 to $100,000 depending on volume and other factors. Meta plans to bring its total stock to 350,000 H100s this year. Dina McKinney, a former Advanced Micro Devices and Marvell executive, heads Nvidia’s custom unit and her team’s goal is to make its technology available for customers in cloud, 5G wireless, video games and automotives, a LinkedIn profile said. Those mentions were deleted and her title changed after Reuters sought comment from Nvidia. Now or never for Nvidia? The company knows if it doesn’t move with market demand, its customers like Amazon, Google, Microsoft, Meta and OpenAI will look elsewhere, despite its market dominance. This month, Nvidia CEO Jensen Huang visited China and Taiwan where he met Taiwan Semiconductor Manufacturing Co., cryptically saying the entire supply chain will have to work extra hard to match demand in what he expects will be “a huge year.” As the US continues to block the export of advanced semiconductors to China, the country is still a huge market for Nvidia’s graphics processing units, which can be adapted for the power-intensive task of training AI models. According to Nikkei, Nvidia’s RTX 4090 graphic cards, beloved by video gamers and PC hobbyists, have been flying from store shelves across Southeast Asia and Taiwan since the US tightened export controls of advanced chips to China – buyers are snapping them up to resell in China and Hong Kong. The RTX 4090 is designed for rendering images, particular for video games, but because its computing capability can also be used to train artificial intelligence tasks. At the same time OpenAI’s Sam Altman met with officials of Samsung Electronics and SK Hynix, the makers of the high-bandwidth memory that complements Nvidia’s chips – suggesting the company may be looking to be less reliant on Nvidia’s chips. The chip industry operates in cycles of oversupply and under-supply. The Covid-19 pandemic trigged a combination of supply constraints and high demand that lasted for years, but the slump finally arrived in mid-2022, according to Bloomberg. SK Hynix, Samsung and TSMC have all signalled they expect a recovery this year. Altman and Huang’s activities add weight to those expectations. According to Reuters, Nvidia also plans to target the automotive and video game markets, according to sources and public social media postings. Weckel expects the custom auto market to grow consistently from its current $6 billion to $8 billion range at 20% a year, and the $7 billion to $8 billion video game custom chip market could increase with the next-generation consoles from Xbox and Sony. Fredrik Jejdling, executive vice president and head of Networks at Ericsson (above, left), and Jensen Huang, founder and CEO of NVIDIA (above, right), discuss the companies’ collaboration during a keynote address at MWC LA in 2019. Subscribe to Our Daily Newsletter It takes just one minute to register for the leading daily B2B newsletter for the telecoms industry, and it's free. Subscribe to Our Daily Newsletter It takes just one minute to register for the leading daily B2B newsletter for the telecoms industry, and it's free. "
}