{
    "title": "Nvidia Poised For Expansion, Analyst Highlights AI Innovations And Upcoming \nB100 Accelerator Launch - NVI",
    "date": "2/2/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/36915960/nvidia-poised-for-expansion-analyst-highlights-ai-innovations-and-upcoming-b100-acc",
    "text": "BofA analyst Vivek Arya reiterated a Buy rating on Nvidia Corp NVDA, boosting the price target to $800 from $700. The chip designer will report its quarterly earnings after closing on February 21. The analyst will seek for a notable but more measured 3% – 5% or $0.5 billion – $1 billion upside to both the reported fourth quarter (consensus $20 billion) and guided first quarter (consensus $21.4 billion) mainly due to incremental supply gains offset by China restrictions and some transition effects before the B100 accelerator launch planned for the second half of 2024. Also Read: What’s Going On With Nvidia Stock Friday? While a 3% – 5% beat would pale versus the 10% and 22% beat and raise of prior quarters and perhaps disappoint some bulls, the more measured pace will also be seen as creating more fertile ground for continued growth in the calendar year 2025 and beyond. Stepping above quarterly EPS noise, Arya will focus on Nvidia’s flagship GPU Tech Conference (GTC) planned for March 18 – March 20, where the company will likely showcase its pipeline and perhaps update the prior $250 billion annual AI accelerator TAM forecast. Arya’s top pick, Nvidia, is backed by the potential for higher pricing with the upcoming B100 accelerator and underappreciated strength in AI inferencing. Though he finds it quite early, results from top U.S. cloud customers suggest a solid motivation for spending in generative AI (20% cloud capex growth in the calendar year 2024). Microsoft Corp’s MSFT AI services contributed 6 points of growth, implying it’s now a $4 billion annualized run rate business for Azure AI platform, which integrated with company infra and data, now has 53k customers, 33% new in LTM, the analyst flagged. Alphabet Inc GOOG GOOGL Google uses AI to handle more complex search queries, bringing consumer capabilities via Gemini with platforms integrated into new handsets, Arya said. Meta Platforms Inc’s META AI-based advertising tools drive material revenue, and AI-based feed recommendations drive higher engagement. Enterprise generative AI adoption has yet to kick off and become more material in the calendar year 2025, with Nvidia benefitting from its widespread availability on public clouds and unique partnerships, Arya noted. The analyst expects the data center AI accelerator market to grow from $43 billion in the calendar year 2023 to over $160 billion by the calendar year 2027, likely an even contribution from training/inference. The analyst expects Nvidia to hold a 90% share in training and achieve >50% share in inference. Most of Microsoft’s AI success thus far has been in AI inference, likely primarily on Nvidia GPU. Nvidia’s diversity of SKUs is between ~$1.2K (RTX 40xx with tensor cores) to over $30K (H100); hence, it will not leave any part of the computing market uncovered. Notably, Nvidia has already released its TensorRT-LLM, which doubles speed on H100 GPUs and can support A100, L4, L40, and L40S SKUs, which is critical in performance improvement without hardware replacement. Nvidia is one the rare large-cap tech stocks trading at 31x and 25x calendar year 2024 and calendar 2025 PE, below its 45% calendar year 2023 – 2025 EPS CAGR, Arya said. The analyst noted a path to $40+ in pf-EPS power in calendar year 2027 at $160 billion+ in accelerator TAM and much higher if the TAM were to hit Advanced Micro Devices, Inc’s AMD $400 billion level. For Nvidia, Arya projects fourth-quarter revenue and EPS of $20 billion (versus consensus of $20.17 billion) and $4.48 (versus consensus of $4.51). Also Read: Meta Rolls Out Own AI Chip to Power Facebook and Instagram, Targets Cost Cuts and Nvidia Independence Price Action: NVDA shares traded higher by 5.00% at $661.77 on the last check Friday. Image Via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}