{
    "title": "Forbes Daily: Trillion-Dollar Chipmaker Nvidia's Investment Game",
    "date": "2/16/2024",
    "url": "https://www.forbes.com/sites/forbesdaily/2024/02/16/forbes-daily-trillion-dollar-chipmaker-nvidias-investment-game/",
    "text": "Plus: The Serial Entrepreneur Who Doesn’t Need To Be First To Win Good morning, Picture a couple holding hands, strolling along a snowy street in Tokyo lined with cherry blossom trees. Soon, OpenAI will be able to bring that scene to life. OpenAI, the company behind ChatGPT, released its latest generative AI model called Sora, which can create videos up to a minute long from a simple text prompt. The company posted the video that the technology came up with from the Tokyo description on X, along with several others. Sora doesn’t have a release date yet, and OpenAI said it is being “adversarially” tested by experts in areas like misinformation, hateful content and bias. It’s the latest offering from the Microsoft-backed AI company, including a new feature it’s testing that will allow ChatGPT to memorize users’ voices and previous chats. Lastly, a quick programming note: the Forbes Daily will take a day off on Monday for Presidents Day. We’ll see you back in your inbox Tuesday and hope you have a restful holiday weekend. Maxar satellite imagery shows a closer view of the contruction of a wall near the Rafah border crossing into Egypt.  Satellite image (c) 2024 Maxar Technologies. Egypt is setting up a camp near its border with Gaza as a contingency for a potential exodus of Palestinians from the enclave if Israel goes ahead with a ground offensive on Rafah, the border region where more than half of Gaza’s population is taking refuge, Reuters reported. Egypt is reportedly preparing a “desert area with some basic facilities” to shelter potential refugees as a “temporary and precautionary measure,” but is hopeful that ceasefire talks can prevent such an exodus. A U.S. Navy official revealed on CBS News’ “60 Minutes” that Iranian Revolutionary Guard troops are working on the ground with Houthi rebels in Yemen, providing assistance to the group that has escalated attacks on U.S. military targets in the region and shipping vessels in the Red Sea. The bombshell revelation comes as U.S. forces step up counter-measures amid fears of an escalating Middle Eastern conflict. Shake Shack’s stock surged Thursday after the burger chain smashed expectations for its quarterly financial results, sending shares to their highest level in more than two years. Shake Shack’s stock is up more than 30% year-to-date, as investors have been hungry for publicly traded restaurant chains. A Michigan woman was arrested for stealing over 1,000 luxury items valued at $823,000 from at least three fashion rental subscription websites and then reselling them online. When the companies tried to charge 42-year-old Brandalene Horn for the stolen items, she either canceled the credit or debit card she had provided or disputed the charge, the criminal complaint states. The case illustrates how even an inexperienced fraudster can create a large issue for the $1.1 trillion ecommerce industry. Wells Fargo’s stock rose more than 7% at times Thursday afternoon after regulators closed a consent order placed on the bank for its fake accounts scandal, which has remained a black eye for the company. The bank came under fire by regulators in 2016 after it was revealed Wells Fargo had created millions of accounts for customers without their consent, but the OCC said the bank had improved on its risk management and oversight of its sales practices. Barbara Picower, whose late husband profited more than any other individual from Bernie Madoff’s $64 billion Ponzi scheme, is one of the country’s 25 biggest philanthropists, with lifetime giving estimated by Forbes at $3.15 billion. Over a dozen years through 2022, Barbara injected $4.2 billion from Jeffry’s estate into the JPB Foundation she launched, which has primarily funded medical research, poverty alleviation and environmental issues. ILLUSTRATION BY STEPHANIE CUI FOR FORBES; PHOTO BY CLU/GETTY Trillion-dollar chipmaker Nvidia has invested in over two dozen companies over the last two years, through both its venture capital arm Nventures and broader corporate development team. Many of the biggest companies in tech have their own venture capital vehicles, including Alphabet, Microsoft and Salesforce. But Nvidia is relatively new to the game, and can in some ways offer benefits beyond those of a traditional venture capital firm, portfolio companies said. Red hot AI startup LangChain publicly released its first paid product Thursday to a waitlist of tens of thousands, which helps programmers building on top of large language models like OpenAI’s GPT-4 better track and test their underlying code. For companies trying to graduate from building nifty AI prototypes to large-scale, production-ready apps that can move the needle for their business, such visibility and control has proven a stumbling block, according to CEO Harrison Chase. Startup Higharc has raised $53 million to improve the old-school industry of homebuilding: His company’s software allows developers to design homes in 3D computer renderings and lets buyers make changes to those computerized models based on their choices in real time. Making the process go faster and easier could also, at least in theory, make homes more affordable. The White House says Russia has obtained a “troubling” anti-satellite weapon that is not currently operational, seemingly confirming a warning issued by House Intelligence Committee chairman Mike Turner (R-Ohio) that the U.S. was facing a “serious national security threat” involving Russia. But Turner faced backlash from members of his own party, who questioned his motives for issuing the warning, as lawmakers work to pass an aid package to support Ukraine. MORE: Russia dismissed House GOP warnings that Moscow is planning to put nuclear weapons in space, claiming the reports are a political ruse orchestrated by the White House to pressure Congress into releasing funds for Ukraine amid continued Republican opposition. Shares of Digital World Acquisition Corp., the firm intending to take former President Donald Trump’s social media venture public, surged Thursday following an announcement the reverse merger will finally move forward to the next crucial step. The publicly traded blank-check company and Trump Media & Technology Group, the parent firm of Trump’s Truth Social platform, said late Tuesday they intend to announce a Digital World shareholder vote on a merger which would result in Trump Media’s direct listing on the Nasdaq stock exchange. Kylian Mbappé will leave PSG to pursue a fortune in Spain, Saudi Arabia or other deep-pocketed leagues. (Photo by Julian Finney/Getty Images) French soccer star Kylian Mbappé plans to leave Paris Saint-Germain on a free transfer when his contract expires this summer, and he is widely expected to join Real Madrid. The 25-year-old’s exit will mark the end of PSG’s so-called super-team era, which was anchored by the star-studded trio of Mbappé, Neymar Jr. and Lionel Messi. British singer-songwriter Rod Stewart has sold his music rights to Iconic Artists Group in a deal worth almost $100 million, making him the latest artist to cash in on his catalog. Iconic Artists Group also owns assets of artists like Cher, Nat King Cole and Dean Martin, and is among the investors buying into the idea that 20th century superstars will continue to have an enduring appeal and their music, likeness and other assets will be profitable for years to come. Yin Wu, CEO and cofounder of Pulley, a new Forbes Fintech 50 member, convinced the majority of startups in her class at YCombinator to sign up for her service. TOPLINE San Francisco-based Pulley, the most visible challenger to scandal-scarred Carta and a newcomer to this year’s Forbes Fintech 50 list, is pouncing on the niche market for cap table management software. Serial entrepreneur Yin Wu isn’t at all intimidated by the fact that she entered the cap table game seven years after market leader Carta. She’s gambling that you don’t necessarily have to be first to win the long game. “When Stripe was getting started, it wasn’t the first payment processor. Braintree, Amazon Pay and Paypal all existed,” says Wu. “But when you talked to folks that were actually using any of these payment networks, it wasn't like they had such an amazing experience on these platforms. It was more like, ‘well, this is kind of what exists.’” For now, Pulley still lives in the long shadow of Carta, which has 40,000 customers and was valued at $7.4 billion during its last fundraising round in August 2021. Pulley, for its part, has $50 million in funding from Stripe, Founders Fund and angel investors including Elad Gil, Jack Altman and Avichal Garg, Wu’s husband, and the company notched a $250 million valuation in its Series B round in October 2022. But Wu insists Pulley’s fundraising modeling technology is superior, helping founders understand exactly how much their stakes would be diluted by complex early-stage funding structures and what control they may be signing away should they offer to give away pro rata shares or “most favored nation” status to attract early investors. She also highlights Pulley’s offer letter tool which seamlessly tracks equity grants to new hires on the cap table and facilitates the logistics of getting offers approved by the board and sending out option grants. Pulley charges customers $1,200 per year for its lowest-priced tier that can track up to 25 stakeholders. A growth tier for $3,500 annually includes up to 40 stakeholders and yearly 409A valuations (fair market valuations needed for tax purposes). Many customers are on custom pricing plans for more advanced features. Pulley expects to triple in revenue this year and bring in tens of millions of dollars in 2024. WHY IT MATTERS “As venture-backed companies stay private for longer, serving their needs is becoming big business,” says Forbes staff writer Hank Tucker. “For more than a decade, Carta has been Silicon Valley startups’ go-to option for tracking ownership, managing fundraising and granting equity to stakeholders, but thanks to Pulley’s emergence, founders have more choices now. Yin Wu is betting there’s enough room for more than one dominant company in the space and hopes its majority market share among prestigious Y Combinator companies will soon translate to the rest of the industry.” MORE Newcomers To The Fintech 50 2024 The White House announced Thursday it would provide federal funding for airport modernization projects. The money will be used to create wider concourses, larger security checkpoints, more efficient baggage systems, additional gate capacity and more modern air traffic control towers: $970 million: The amount the federal government is providing for the improvements 114: The number of airports where modernization projects will occur, across 44 states $25 billion: The total amount the Bipartisan Infrastructure Law, which created the aviation program that is funding the projects, is providing to modernize the United States’ airport infrastructure In the wake of the pandemic, the idea of being a digital nomad has been glamorized, and countries like Canada and Japan have unveiled visas for remote foreign workers. Being a digital nomad allows you to immerse yourself in different cultures and strengthen communication skills, but make sure to consider the challenges before embarking on such an adventure. Create a budget for your travel and living expenses, invest in remote work equipment, and research the visa requirements. The Department of Justice sued over a state law it says is discriminatory that turns misdemeanor prostitution charges into felonies akin to “violent sexual offenses” if the defendant knowingly has HIV. Which state did the DOJ sue? A. Alabama B. Tennessee C. Texas D. South Carolina Check your answer. To close Women’s History Month and reflect on Equal Pay Day 2024, join Forbes for our Equal Pay Forum on March 26 as we convene leading voices to discuss the most meaningful levers of change to power the next chapter in the fight for pay equity. Apply to attend in-person today!   "
}