{
    "title": "Advanced Micro Devices and Nvidia: Technical Analysis and Price Forecast",
    "date": "1/26/2024",
    "url": "https://www.fxempire.com/forecasts/article/advanced-micro-devices-and-nvidia-technical-analysis-and-price-forecast-1405113",
    "text": "AMD and Nvidia, titans in tech stocks, showcase similar trajectories: each is near a possible area of resistance after soaring to new highs. AMD NVDA  Advanced Micro Devices, Inc. (AMD) was up as much as $91.81 or 98.6% per share as of Thursday’s $184.92 high. The advance started 61 days ago from the late October swing low at $93.12. The stock remains in a strong accelerated uptrend that has reached new heights, increasing the risk of it running out of oxygen or money, in this case coming from enthusiastic buyers. The stock broke out above the previous record high of $164.46 from November 2021 on January 18.  Nonetheless, the next higher target zone from Fibonacci analysis shows a potential resistance area from $192.66 to $194.35. That’s about 4% higher than this week’s high of $184.92. Certainly, bullish momentum in the price of AMD stock is strong. Although on Thursday the stock closed with red candle that reflects weakness going into the close. Such weakness may carryover to coming days or is very short term. Today’s high continued the uptrend and the stock did close above stronger than it could have, just $0.35 below yesterday’s high. Shares of AMD have gained recently from expectations for strong growth and massive economic opportunity from the rise of artificial intelligence (AI). The company is scheduled to report earnings next Tuesday, January 30. Shares of Nvidia broke out to a new record high on January 8. It’s strong performance since is a good example of a classic bullish breakout. The stock has risen as much as $236.19 or 60.2% from the October 31 swing low of $392.30 as of Wednesday’s trend high at $628.49. Upward momentum may start to slow soon though as the stock approaches its next higher target derived from Fibonacci analysis at $633.23 and $643.04.  Nevertheless, there are already signs that may lead to further weakness. On Thursday the stock closed weak, in the lower half of the day’s range. That’s after reaching a new record high of $628.49. Today, Thursday, ended with a red inside day candle. Shares of Nvidia look to be very extended relative to the rising 20-Day MA (purple). This could lead to either a retracement or consolidation. A drop below Thursday’s low of $608.50 is a sign of weakening and could be the lead to further weakening. How the break follows through will provide the next clues. Nvidia reports earnings on Wednesday, February 21. Bruce boasts over 20 years in financial markets, holding senior roles such as Head of Trading Strategy at Relentless 13 Capital and Corporate Advisor at Chronos Futures. A CMT® charter holder and MBA in Finance, he's a renowned analyst and media figure,  appearing on 150+ TV business shows. Nasdaq Index, Dow Jones, S&P 500 News: Futures Signaling Cautious Sentiment Gold Prices Forecast: Fed Rate Cut Speculation Boosts XAU/USD Crude Oil News Today: Global Conflicts, US Rig Count Decline Underpinning Prices EUR/USD, GBP/USD, DXY Price Forecast: Will an Overbought DXY See a Correction? DAX Index Today: Lagarde, US Economic Indicators, and 18,300 Litecoin price forecast: 90,000 new users acquire LTC ahead of Bitcoin Halving "
}