{
    "title": "With Nvidia renewing its new prices in the U.S. stock market due to the \ncontinuous craze for generat.. - MK",
    "date": "1/28/2024",
    "url": "https://www.mk.co.kr/en/stock/10930845",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share With Nvidia renewing its new prices in the U.S. stock market due to the continuous craze for generative artificial intelligence (AI) semiconductors this year, the yield of Exchange Traded Funds (ETF), which contains a lot of Nvidia, is drawing attention this year. Most of them continued their strong trend with positive profits compared to the beginning of the year, but if you look closely, the proportion of Nvidia investment is not unconditionally proportional to the rate of return, but it differs from single digits to double digits depending on the composition of the stock. According to the Korea Exchange and Koscom Check on the 28th, the top return (top) among the top 1-10 ETFs with a high proportion of Nvidia among KOSPI-listed ETFs until the 26th of this year was KOSPI Global AI Semiconductor. The stock's share of Nvidia was 20.77% as of the day, ranking third among related ETFs, but its return was 14.72%. The secret lies in AMD, which is rapidly emerging as a key company in the semiconductor craze as much as Nvidia. The AMD investment in this stock is 24.43%, higher than that of Nvidia (20.77%. AMD broke several new highs this year, hitting an all-time high of $180.33 on the New York Stock Exchange on the 25th (local time). The closing price on the 26th was $177.25, up 27.9% from the beginning of this year. UBS, a global investment bank (IB), said, \"The AI craze continues, and the stock price is undervalued than its competitor Nvidia,\" suggesting a target price of $220, 20% higher than the current stock price, and is expected to rise further in the future. In fact, AMD's stock price growth (27.9%) exceeded Nvidia (26.7%) during the same period this year. HANARO Global Semiconductor TOP10 SOLACTIVE, which has been cruising with a return of 12.27% compared to the beginning of the year, saw the effect of Broadcom. The stock's share of Nvidia investment was 14.85%, the 10th highest among related ETFs, but the return was the second highest. The proportion of Broadcom in the ETF is 16.2%, the highest among listed ETFs in Korea. Broadcom is also a leading AI semiconductor company on the Nasdaq, which continued its upward trend this year and once exceeded Tesla's market capitalization on the 25th (local time). ACE Nvidia Bond Mixed Bloomberg, which has the highest proportion of Nvidia at 33.36%, returned 7.33% over the same period. As the proportion of single stock investment is set at its maximum, the rest must be filled with bonds such as government bonds, making it difficult to fully follow the stock price fluctuations of single stocks in the current upward market. Meanwhile, in the U.S. stock market, T-Rex Double Long Nvidia (NVDX), which has the highest proportion of Nvidia at 75.2%, recorded a return of 52.06% compared to the beginning of the year. 2024-03-24 14:09:45 2024-03-25 08:31:01 2024-03-24 15:26:58 2024-03-24 17:27:00 2024-03-24 17:13:22 2024-03-25 08:57:22 2024-03-24 09:46:12 2024-03-25 10:04:23 2024-03-19 17:09:10 2024-03-24 06:18:24 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}