{
    "title": "Prediction: Nvidia Was the Star of 2024, But These 3 Stocks Could Outshine \nIt in 2024",
    "date": "1/7/2024",
    "url": "https://finance.yahoo.com/news/prediction-nvidia-star-2024-3-130100961.html",
    "text": "Let's be honest: Last year belonged to Nvidia. The company, which produces high-powered, cutting-edge semiconductors that are often used to train artificial intelligence (AI) models, recorded a total return of 239% in 2023. Nvidia was the best-performing stock in the Nasdaq 100, and overall it recorded one of the highest annual returns of any publicly listed stock. But a new year has arrived. So let's consider which stocks might dethrone Nvidia and truly shine in 2024. Jake Lerch (CrowdStrike Holdings): My choice for king of 2024 is CrowdStrike Holdings (NASDAQ: CRWD). The company, which provides AI-powered cybersecurity services to its clients, is riding high after a memorable 2023. Indeed, few stocks performed better than CrowdStrike in 2023. Shares rallied 137% thanks to skyrocketing cybersecurity demand and improving financial fundamentals. Let's start with the overall demand for cybersecurity. Hacking and digital blackmail cases are on the rise. In fact, the last few months of 2023 saw an explosion of notable cyberattacks that brought prominent organizations to their knees. In September, hackers targeted hospitality and gaming giant MGM in a cyberattack that caused massive disruptions to the company's operations. Several pieces of key infrastructure -- including slot machines, hotel key cards, and ATMs -- malfunctioned or were rendered inoperable as a result of the hack. Meanwhile, in October, genetics testing firm 23andMe disclosed a data breach that affected at least 14,000 customers. In a public relations disaster, sensitive customer data appears to have been compromised and then sold on the dark web. Due to the rapid increase of these real-world nightmare scenarios, CrowdStrike's anti-hacking products are more in demand than ever, and its financial metrics are soaring. Revenue in its most recent quarter (the three months ending on Oct. 31, 2023) grew 35% year-over-year to a trailing twelve-month total of $2.9 billion. Free cash flow jumped to $3.59/share, up from $2.89/share one year earlier. That said, CrowdStrike isn't for every investor, in part because of its sky-high valuation. Shares trade at a price-to-earnings (P/E) ratio of 67, while its price-to-sales ratio is 21. That's high, even within the red-hot tech sector. Nevertheless, CrowdStrike could still turn in a wonderful 2024 despite its high valuation. So for growth-oriented investors, CrowdStrike is definitely a stock to keep an eye on in 2024. Will Healy (Palantir): Investors know Palantir (NYSE: PLTR) best for helping U.S. intelligence officials find Osama bin Laden. Since that time, the company has expanded into the commercial space, applying its analysis capabilities to business problems. Nonetheless, its success could reach new levels on the back of its artificial intelligence platform (AIP), which it introduced last year. The company's Gotham and Foundry platforms have long relied on AI, but AIP brings the capabilities of generative AI to the forefront, employing large language models to improve its analysis capabilities. Palantir invited clients to AIP boot camps to show its power to prospective customers, and the results were astonishing. One attendee said they built 10 times faster with one-third of the resources. Another claimed to accomplish more in one day than one of the top hyperscalers had over four months. With those successes, healthcare partners such as HCA use it for dynamic scheduling. Also, Aramark, a food and facilities provider, said AIP developed negotiating strategies it can use proactively. Admittedly, its current financials do not reflect AIP's potential success. The $1.6 billion in revenue in the first nine months of 2023 grew 16% yearly, well under the 30% annual rate it had forecasted for the 2022-2024 period back in 2021. Still, Palantir turned profitable about a year ago, and in the first three quarters of 2023 it earned a net income of $120 million. This means it does not have to turn to debt or share dilution to fund itself. Moreover, investors have caught on to its potential, as the stock has risen by around 150% over the last year. That has taken its forward P/E ratio to 55, making this an expensive stock by just about any measure. Nonetheless, the productivity gains offered by AIP bode well for the stock. Even with a high valuation, Palantir holds tremendous potential to outperform the Nvidias of the world. Justin Pope (Monday.com): Enterprise software is a ruthlessly competitive space where companies often sacrifice profits for revenue growth. But eventually the tide goes out, the market crashes, and those unable to turn a profit never again see their former highs. Monday.com (NASDAQ: MNDY), down over 60% from its high, is trying to prove it can make a comeback. Monday.com sells software-as-a-service that helps employees collaborate and manage projects. That's a crowded space with deep-pocketed (Microsoft) and emerging (Asana) competition. Yet the company has managed to keep raising its game to new levels. The company has more than doubled its annual revenue over the past several years, approaching $700 million. Over 2,000 enterprise accounts spend over $50,000 on the product annually. The product works for small organizations too, so there is room for long-term growth as Monday.com's customers grow and spend more over time. But ultimately, investors want to see profits -- and Monday.com has those too. After the company's cash flow roughly broke even for several quarters, free cash flow exploded to the positive in 2023. Its $179 in trailing 12-month cash flow is already 26% of its sales, a giant leap in profitability in a short time. That bodes well for bottom-line earnings (net income). Monday.com turned GAAP positive in Q3, so buckle up for rapid earnings growth in 2024 and beyond. Consensus analyst estimates call for earnings per share (EPS) of $2.57 in 2024, valuing the stock at a forward P/E of 67. For a business that could compound earnings at a rapid pace for several years, that's a very reasonable price to pay. Remember, the stock still sits over 60% off its high over two years ago despite being much bigger and more profitable than back then. Monday.com's return to its highs seems more like a matter of time. Should you invest $1,000 in CrowdStrike right now? Before you buy stock in CrowdStrike, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and CrowdStrike wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  Jake Lerch has positions in CrowdStrike and Nvidia. The Motley Fool has positions in and recommends Asana, CrowdStrike, HCA Healthcare, Microsoft, Monday.com, Nvidia, and Palantir Technologies. The Motley Fool has a disclosure policy. Prediction: Nvidia Was the Star of 2024, But These 3 Stocks Could Outshine It in 2024 was originally published by The Motley Fool Related Quotes "
}