{
    "title": "AMD, Nvidia Shares Rise On Bullish Wall Street Reports",
    "date": "1/16/2024",
    "url": "https://www.investors.com/news/technology/amd-stock-nvidia-stock-rise-on-bullish-wall-street-reports/",
    "text": "BREAKING: Futures Fall Slightly Advanced Micro Devices (AMD) and Nvidia (NVDA) were among semiconductor stocks moving higher on positive analyst reports on Tuesday. AMD stock and Nvidia stock notched fresh highs on the news. AMD stock received price-target increases from Barclays, KeyBanc Capital Markets and Susquehanna Financial Group. Nvidia stock scored a price-target hike from KeyBanc. KeyBanc analyst John Vinh cited strong demand for AI chips by data centers for his price hikes to AMD and Nvidia. Vinh upped his price target on AMD stock to 195 from 170 and on Nvidia stock to 740 from 650. He rates both as overweight, or buy. On the stock market today, AMD stock jumped 8.3% to close at 158.74. Earlier in the session, AMD stock hit a 52-week high of 159.71. The chipmaker recorded its all-time high of 164.46 back in November 2021. Nvidia stock surged 3.1% to 563.82. In intraday trading, Nvidia claimed a record high of 568.35. Outside of AI stocks, the semiconductor market doesn't look so hot right now, Vinh said. Automotive and industrial chip markets remain weak and are undergoing inventory destocking, he said. Server, PC and smartphone markets are weak or lackluster, he said. However, Vinh also raised his price targets on buy-rated shares of Arm (ARM), Micron Technology (MU) and Qualcomm (QCOM). On Tuesday, Arm stock slid 2.2% to 68.48. Micron popped 2.7% higher to 84.61. Qualcomm stock rose 0.7% to 141.12. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: AMD Rounds Out AI PC Chip Lineup With New Desktop Processors Nvidia Steps Up Generative AI Game With New Chips Qualcomm In Catbird Seat For Edge AI Shift, CEO Says Find Winning Stocks With MarketSmith Pattern Recognition & Custom Screens See Stocks On The List Of Leaders Near A Buy Point 3/25/2024\nThe dovish Fed and the Nvidia-led AI boom continue to be the big stock market catalysts. Uber and Eli Llly... 3/25/2024\nThe dovish Fed and the Nvidia-led AI boom continue to... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}