{
    "title": "Why Is Nvidia Stock So High, and Can NVDA Become the Biggest U.S. Company?",
    "date": "2/26/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/ESG/pressreleases/24354072/why-is-nvidia-stock-so-high-and-can-nvda-become-the-biggest-us-company/",
    "text": "After its well-received earnings report last week, Nvidia (NVDA) joined the ranks of $2 trillion companies, albeit briefly. Nvidia stock soared above $800, which makes it the most expensive “Magnificent 7” stock in absolute terms. The breathless rally in Nvidia stock has now given it a realistic chance of becoming the biggest U.S. company. Currently, only Microsoft (MSFT) and Apple (AAPL) have a market cap larger than Nvidia's, now that the semiconductor designer has surpassed both Amazon (AMZN) and Alphabet (GOOG) in size. Why is Nvidia stock so high, and could it soon become the biggest U.S. company? The key reason Nvidia stock is trading so high, in absolute terms, is because of the artificial intelligence (AI)-fueled price action over the last year. The stock has risen 61% this year, adding to its 240% rise in 2023. The shares have risen 481% over the last three years, which means NVDA is now above the levels where it was trading in 2021 when it split four-for-one. Nvidia has seen a major rerating since the beginning of 2023, thanks to its position as the preeminent supplier of AI chips. While a section of the market might be perplexed by the rise in Nvidia stock, its share price performance has been backed by solid financials. Nvidia forecast revenues of $24 billion at the midpoint for its fiscal Q1 2025, and Wall Street analysts expect its revenues to surpass $100 billion in this fiscal year and $130 billion in the next. To put that in perspective, the Jensen Huang-led company posted revenues of just under $11 billion in fiscal 2020. The company’s revenues have risen six-fold over the last four years, while the commensurate rise in profits has been even higher. In a market where most other credible growth stories – including Tesla (TSLA) – look tarnished in the short term, Nvidia brings to the table prospects of strong double-digit revenue growth with a long track record of execution. Those looking for Nvidia stock to go down meaningfully must have been disappointed, as the stock has continued to make newer highs almost every other day. Notably, despite having risen significantly from its 2022 lows, Nvidia’s valuation still looks far from stretched, based on some metrics. NVDA currently trades at a next 12-months (NTM) price-to-earnings multiple of 32.1x, and among its “Magnificent 7” peers, only Meta Platforms (META) and Apple trade at a lower multiple. Wall Street analysts also expect Nvidia’s rally to continue, and it has a consensus rating of “Strong Buy” from analysts. According to Reuters, at least 17 brokerages raised Nvidia’s target price after the company reported its fiscal Q1 earnings last week. UBS, however, was a notable exception, as the brokerage cut Nvidia’s target price from $850 to $800 on “some potential slowing in revenue growth.\" Nvidia’s new Street-high target price of $1,400 (via Rosenblatt Securities) implies its market cap rising to $3.5 trillion, which is higher than the current market cap of Microsoft – the reigning largest U.S. company. While you might have been ridiculed just a few years back for talking about the possibility of Nvidia becoming the world’s biggest company, it looks like a real possibility now. A cursory look at how the biggest U.S. companies have evolved would tell us that winners have changed over the years in line with their financial performance as well as shifting market sentiments. For instance, at the beginning of 2000, Microsoft was the biggest U.S. company - but soon lost that position to General Electric (GE). Between 2005 and 2011, oil major ExxonMobil (XOM) was the biggest U.S. company, for the most part. Apple became the world’s most valuable company in 2011, and the iPhone maker has largely held on to that position since then, aside from a few brief incursions. However, Apple lost its $3 trillion market cap and status as the world’s largest company to Microsoft last month, and has failed to reclaim the top position as of yet. Incidentally, CEO Elon Musk believes that Tesla will someday become the world’s biggest company. While Musk is known for his flamboyant claims, including about Tesla’s roadmap to full autonomy, the fact remains that stock market winners have changed, and will continue to do so in the future. Nvidia currently has momentum, and the market sentiments are even more positive after the fiscal Q4 earnings call last week. At the same time, a section of the market – which includes valuation guru Ashwath Damodaran – believes that the rise in Nvidia stock has gone too far. While the “dean of valuation” believes almost the entire “Magnificent 7” is overvalued, he singled out NVDA in particular. To be sure, the kind of multiples that Nvidia now trades at don't make the stock a good fit for value investors like Damodaran. However, for those chasing growth, I believe Nvidia is a long-term buy-and-hold story that has a chance to become the biggest company someday. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}