{
    "title": "Stocks bask in tech mania, Nvidia boom",
    "date": "2/22/2024",
    "url": "https://www.xm.com/fr/research/markets/allNews/reuters/stocks-bask-in-tech-mania-nvidia-boom-53772658",
    "text": "7 classes d’actifs - 10+ plateformes de trading - Plus de 1000 instruments Marre d’avoir encore raté un séminaire ? Nous vous présentons la formation en direct XM. Voir. \n LIVE Ce site internet est exploité par XM Global (FSC). Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Commencez à trader les instruments de votre choix sur XM MT4 et MT5, disponibles pour PC et Mac. Sinon, vous pouvez également essayer le XM WebTrader, accessible instantanément depuis votre navigateur. De plus, nos plateformes complètes pour les appareils mobiles, compatibles avec MT4 comme avec MT5, vous faciliteront l’accès aux marchés et vous permettront de trader sur votre compte à partir de votre smartphone ou de votre tablette. Vous pouvez choisir dans la liste votre plateforme mobile ou bureau favorite. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Notre centre de recherche et de formation propose des mises à jour quotidiennes sur les plus importantes sessions des bourses, avec de nombreux points quotidiens sur tous les événements financiers critiques qui façonnent chaque jour les marchés mondiaux. Avec 20 professionnels des marchés plurilingues, nous avous offrons une base de connaissances pour former nos clients et leur donner des avantages concurrentiels compétitfs. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. XM a des normes élevées de qualité pour ses services. Nous croyons que les services financiers polyvalents exigent de la polyvalence dans la pensée et une politique unifiée de principes commerciaux. Notre mission est de suivre le rythme des demandes du marché mondial et d'aborder les objectifs d'investissement de nos clients avec un esprit ouvert. Avertissement sur les risques : le trading des produits à marge implique un niveau de risque élevé. Accédez instantanément aux marchés mondiaux grâce aux plateformes de trading XM MT4 ou MT5. Choisissez comment vous souhaitez obtenir de l’aide. Chat en direct En utilisant notre chat en direct, vous acceptez que toutes les données personnelles fournies via le chat en direct soient traitées par nous, conformément à notre politique de confidentialité, afin d’obtenir de l’aide de la part de notre équipe expérience client. Viber Scannez le code QR ci-dessous avec votre smartphone. En utilisant notre fonctionnalité de chat Viber, vous acceptez que toutes les données personnelles que vous fournissez à XM Global Limited via Viber soient traitées conformément à notre politique de confidentialité et à la politique de confidentialité de l’application, afin d’obtenir de l’aide de la part de notre équipe expérience client. Centre d’aide 23 févr. 2024 à 6h29 GMT Updates prices as of 0550 GMT, adds European, U.S. futures By Stella Qiu SYDNEY, Feb 23 (Reuters) -Global stock markets are on course on Friday fora week of heady gains as AI darling Nvidia's stunning results sparked a wave of record highs from Asia to Europe and the U.S., while the yen nursed losses on a range of currencies. European markets pointed to higher openings with EUROSTOXX 50 futures STXEc1 up 0.1% and FTSE futures FFIc1 gaining 0.2%. U.S. futures NQc1, ESc1 were mostly flat. Nvidia NVDA.O surged 16.4% overnight, adding a record $277 billion in market value. Thecompany's results supercharged a global AI-led rally in technology stocks, propelling the S&P 500 .SPX, the Dow Jones Industrials, Europe's STOXX 600 .STOXX and Japan's Nikkei share average .N225 to record highs. Japan is closed for a public holidayon Friday, but Nikkei futures SSIc1 rose nearly 1%, suggesting Japanese stocks will extend their record run next week. Some regional tech shares took a breather after a stellar rally this week, but MSCI Asia-Pacific ex-Japan IT index .MIAPJIT00NUS still put on 0.3% to its highest level since March 2022. South Korea's Hynix 000660.KS, the world's second-biggest memory chipmaker which counts Nvidia (NVDA.O) as a key client, jumped 2.2% and Taiwan Semiconductor Manufacturing Co Ltd 2330.TW rallied 1%. The Global X Asia semiconductor ETF 3119.HK was up 0.9%. \"The Nvidia effect has ripped through global equity markets and given fresh wind to markets that were looking ominously poised for a 3-5% drawdown,\" said Chris Weston, head of research at Pepperstone in Melbourne. \"Consider that Nvidia holds its highly anticipated GTC (technology) conference on 18 March – where they are likely to update the market on new products and innovations – so pullbacks in the stock should be shallow, and we could see buyers push price higher into that event,\" he said. MSCI's broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS pared early gains to be up 0.2% and was heading for a weekly gain of 1.3%. Chinese shares wobbled between gains and losses. The Shanghai Composite index .SSEC rose above the psychologically key 3,000-point mark before retreating to trade 0.3% higher. It is up 4.6% for the week and has bounced about 10% from five-year lows set more than two weeks ago. Hong Kong's Hang Seng index .HSI slipped 0.2%. Data showed on Friday that China's new home prices fell for the seventh month in January, leaving sentiment fragile as policymakers' efforts to restore confidence in the debt-ridden sector struggled for traction. Shane Oliver, chief economist at AMP, said markets in general have been resilient even as global central banks pushed back against hopes for early rate cuts. \"I think the markets are sort of coming to the view 'well maybe we'll get the rate cuts'. They may not be as much as we thought, and they might be later, but if the economic activity is still good then that's not a problem.\" A Reuters poll showed that the recent rally in global stocks had a little further to go but they were divided on whether there would be a correction in the next three months. The influential Fed Governor Christopher Waller on Thursday said policymakers should wait at least another couple of months to see if inflation was indeed heading back to target. Rates markets continued to pare back U.S. policy easing expectations on the back of strong U.S. economic data. Jobless claims fell, home sales rose to a five-month high although the expansion in business activity slipped a little. The first Fed cut is now fully priced in for July, and just 80 basis points of easing is reflect in this year's curve. FEDWATCH The cash Treasuries market is closed on Friday, but overnight, the 10-year Treasury yield US10YT=RR rose to a three-month high of 4.3540%. In the foreign exchange market, the yen JPY=EBS was little changed at 150.59 per dollar on Friday, above the 150 level seen as possibly drawing Japanese intervention to slow the currency's decline. However, the yen has taken a beating against a broad range of currencies as investors bet the Bank of Japan will keep monetary policy accommodative even after ending negative interest rates. The Australian AUDJPY=R and kiwi dollars NZDJPY=R hit nine-year highs on the yen overnight and were last fetching 98.89 and 93.33 yen. The euro EURJPY=R hovered at 162.96 yen, nearing a 15-year high of 164.30. Oil prices fell after climbing on supply fears as hostilities in the Red Sea showed no signs of abating.A large build in U.S. crude inventories also weighed. O/R Brent LCOc1 eased 0.5%to $83.23, while U.S. crude CLc1 slipped 0.6%to $78.17 perbarrel. The spot gold price XAU= was flat at $2,022.22.  Asia stock markets https://tmsnrt.rs/2zpUAr4 Asia-Pacific valuations https://tmsnrt.rs/2Dr2BQA Reporting by Stella Qiu; Editing by Shri Navaratnam and Neil Fullick  Avertissement : Les entités de XM Group proposent à notre plateforme de trading en ligne un service d'exécution uniquement, autorisant une personne à consulter et/ou à utiliser le contenu disponible sur ou via le site internet, qui n'a pas pour but de modifier ou d'élargir cette situation. De tels accès et utilisation sont toujours soumis aux : (i) Conditions générales ; (ii) Avertissements sur les risques et (iii) Avertissement complet. Un tel contenu n'est par conséquent fourni que pour information générale. En particulier, sachez que les contenus de notre plateforme de trading en ligne ne sont ni une sollicitation ni une offre de participation à toute transaction sur les marchés financiers. Le trading sur les marchés financiers implique un niveau significatif de risques pour votre capital. Tout le matériel publié dans notre Centre de trading en ligne est destiné à des fins de formation / d'information uniquement et ne contient pas – et ne doit pas être considéré comme contenant – des conseils et recommandations en matière de finance, de fiscalité des investissements ou de trading, ou un enregistrement de nos prix de trading ou une offre, une sollicitation, une transaction à propos de tout instrument financier ou bien des promotions financières non sollicitées à votre égard. Tout contenu tiers, de même que le contenu préparé par XM, tels que les opinions, actualités, études, analyses, prix, autres informations ou liens vers des sites tiers contenus sur ce site internet sont fournis \"tels quels\", comme commentaires généraux sur le marché et ne constituent pas des conseils en investissement. Dans la mesure où tout contenu est considéré comme de la recherche en investissement, vous devez noter et accepter que le contenu n'a pas été conçu ni préparé conformément aux exigences légales visant à promouvoir l'indépendance de la recherche en investissement et, en tant que tel, il serait considéré comme une communication marketing selon les lois et réglementations applicables. Veuillez vous assurer que vous avez lu et compris notre Avis sur la recherche en investissement non indépendante et notre avertissement sur les risques concernant les informations susdites, qui peuvent consultés ici. Politique de confidentialité | Politique de cookies | Politique de vulnérabilités | Conditions générales Juridique : Ce site internet est exploité par XM Global Limited, dont l’adresse de domiciliation est Suite 101, 63 Eve Street, Belize City, Bélize. XM Global Limited, enregistrée auprès de la Financial Services Commission (FSC) en vertu du Securities Industry Act 2021 (numéro de licence : 000261/397) et Trading Point of Financial Instruments Limited, autorisée et réglementée par la Cyprus Securities and Exchange Commission (CySEC) (numéro de licence : 120/10), font partie de Trading Point Group. Avertissement sur les risques : nos services impliquent un risque significatif, ce qui peut avoir pour conséquence la perte du capital que vous avez investi.Merci de lire et de vous assurer que vous comprenez parfaitement notre Divulgation des risques. Régions restreintes : XM Global Limited ne fournit pas de services pour les résidents de certains pays, tels que États-Unis d'Amérique, Canada, Israël et République islamique d'Iran. XM n’adresse pas son site internet et ses services à n’importe quelle personne dans n’importe quel pays dans lequel l’utilisation de son site internet et de ses services sont interdits par les lois ou réglementations locales. Lorsque vous accédez à ce site internet depuis un pays dans lequel son utilisation peut ou non être interdite, il en va de la responsabilité de l’utilisateur de s’assurer que toute utilisation du site internet ou des services est conforme aux lois ou réglementations locales. XM n’affirme pas que son site internet est adapté à toutes les juridictions. Qu’est-ce qu’un cookie ? Les cookies sont de petits fichiers de données. Lorsque vous visitez un site internet, le site internet envoie un cookie à votre ordinateur. Votre ordinateur le stock dans un fichier situé à l'intérieur de votre navigateur. Les cookies ne transmettent pas de virus ou de logiciels malveillants à votre ordinateur. Parce que les données d'un cookie ne changent pas lorsqu'il se déplace, il n'a aucun moyen d'affecter le fonctionnement de votre ordinateur, mais ils agissent plus comme des journaux (c.-à-d. ils enregistrent l'activité de l'utilisateur et se souviennent des informations) et sont actualisés chaque fois que vous visitez un site internet. Nous pouvons obtenir des informations vous concernant en accédant à des cookies envoyés par notre site internet. Différents types de cookies permettent de suivre vos différentes activités. Par exemple, les cookies de session ne sont utilisés que lorsqu'une personne navigue activement sur un site internet. Une fois que vous quittez le site internet, le cookie de session disparaît. Pourquoi les cookies sont-ils utiles ? Nous utilisons des cookies fonctionnels pour analyser la manière dont les visiteurs utilisent notre site internet, ainsi que pour suivre et améliorer les performances et le fonctionnement de notre site internet. Cela nous permet d'offrir une expérience client de haute qualité, en identifiant et en réglant rapidement tout problème qui pourrait survenir. Par exemple, nous pouvons utiliser des cookies pour savoir quelles pages du site internet sont les plus populaires et quelle méthode de liaison entre les pages du site internet est la plus efficace. Ce dernier nous aide également à savoir si vous nous avez été renvoyé par un autre site internet et à améliorer nos futures campagnes publicitaires. Une autre utilisation des cookies est de stocker vos sessions de connexion, ce qui signifie que lorsque vous vous connectez à l'Espace membre pour déposer des fonds, un \"cookie de session\" est défini de sorte que le site internet se souvient que vous vous êtes déjà connecté. Si le site internet n'a pas défini ce cookie, on vous demandera votre nom d'utilisateur et votre mot de passe à chaque nouvelle page au fur et à mesure que vous progressez dans le processus de dépôt de fonds. En outre, des cookies fonctionnels, par exemple, sont utilisés pour nous permettre de nous souvenir de vos préférences et de vous identifier en tant qu'utilisateur, de garantir la sécurité de vos informations et de fonctionner de manière plus fiable et plus efficace. Par exemple, les cookies vous évitent de taper votre nom d'utilisateur chaque fois que vous accédez à notre plateforme de trading et vous rappellent vos préférences, comme la langue que vous souhaitez lire quand vous vous connectez. Voici un aperçu de quelques fonctions que nos cookies nous fournissent : Ce site internet utilise Google Analytics, un service d'analyse internet fourni par Google, Inc. (\"Google\"). Google Analytics utilise des cookies analytiques placés sur votre ordinateur pour aider le site internet à analyser l'utilisation du site internet par l'utilisateur. Les informations générées par les cookies concernant votre utilisation du site internet (y compris votre adresse IP) peuvent être transmises et stockées par Google sur leurs serveurs. Google peut utiliser ces informations pour évaluer votre utilisation du site internet, pour répondre aux rapports sur l'activité du site internet et pour fournir d'autres services liés à l'activité du site internet et à l'utilisation d'internet. Google peut également transmettre ces informations à des tiers si la loi l'exige ou si ces tiers traitent ces informations pour le compte de Google. Google n'associera pas votre adresse IP avec d'autres données détenues. En utilisant ce site internet, vous donnez votre consentement à Google pour traiter les données vous concernant de la manière et aux fins décrites ci-dessus. Changez les paramètres Veuillez sélectionner le type de cookies que vous voulez avoir sur votre appareil. Nous utilisons des cookies pour vous donner la meilleure expérience possible de notre site internet. En savoir plus ou modifier vos paramètres de cookies. Avertissement sur les risques :  votre capital est à risque. Les produits à effet de levier ne sont pas recommandés pour tous. Veuillez consulter notre Divulgation des risques Merci d’entrer vos coordonnées. Si vous possédez déjà un compte XM, merci d’indiquer votre identifiant de compte pour que notre équipe d’aide puisse vous apporter le meilleur service possible. "
}