{
    "title": "Nvidia's stock hits record US$740, market cap at S$1.83 trillion, worth \nmore than Amazon & Alphabet",
    "date": "2/12/2024",
    "url": "https://mothership.sg/2024/02/nvidia-record-stock-price/",
    "text": "Search Search News PE2023 Nova Celebrities Events Food Travels Videos Abroad Firsthand Environment Babelfish + More Parliament Perspectives History Covid-19 Search News PE2023 Babelfish Nova Celebrities Events Food Travels Videos Abroad Firsthand Environment + More Parliament Perspectives History Covid-19 Search ← Back An US$1,000 investment in Nvidia a decade ago would now be worth about US$175,000. Belmont Lay\n\n|\n\n\n\nFebruary 13, 2024, 11:54 AM     Shares of Nvidia rose nearly 3 per cent to a record high of over US$740, causing its market value to surge to a US$1.83 trillion capitalisation on Feb. 12, 2024 (U.S. timing) — surpassing fellow tech titans Amazon and Alphabet.  Alphabet’s market cap is US$1.82 trillion, while Amazon is US$1.8 trillion. Nvidia's market cap has even surpassed that of China's stock market as a whole, as defined by Hong Kong-listed H-shares that meet international accounting standards and are directly accessible to brokerages worldwide and serve as a good proxy of the Chinese market, Business Insider reported. Race to the top Nvidia’s stock more than quadrupled over the last 15 months after investors bought into its market-leading position in artificial intelligence. The chipmaker's burgeoning market cap was the result of its stock soaring 239 per cent in 2023, and it is currently up 50 per cent in 2024 alone. Nvidia’s market cap sat below US$300 billion as recently as October 2022. It was lagging behind Amazon and Alphabet’s above US$1 trillion valuations at the time, just before the AI wave began to crest. Nvidia is by far the most prominent producer of the semiconductor chip technology powering generative AI. Nvidia is now the fourth most-valuable public company in the world, just behind Microsoft (US$3.1 trillion), Apple (US$2.9 trillion) and Saudi Aramco (US$2 trillion). 17,000% increase Nvidia stock gained 17,000 per cent over the last decade. An US$1,000 investment in Nvidia a decade ago would now be worth about US$175,000. Nvidia stock is by far the best return of any stock on the S&P 500, nearly tripling the return of fellow chipmaker Advanced Micro Devices (AMD), which is also on investors' radars, CNBC reported. Nvidia’s earnings before interest, taxes, depreciation and amortization (EBITDA) expanded by more than 500 per cent last quarter on a year-over-year basis. However, Nvidia’s gross revenue and profits are less eye-popping compared to Apple and Microsoft. Nvidia's US$9.2 billion profit last quarter was far smaller than Apple’s and Microsoft’s over US$22 billion profits. But analysts expect Nvidia’s financials to close the gap. US$800 price target Analysts at Goldman Sachs and Bank of America have an S$800 price target for Nvidia, implying 8 per cent further upside for the stock. Nvidia will report earnings on Feb. 20 (U.S. timing) for its fiscal quarter ending January 2024. Analysts project the company to report its third consecutive quarter of record sales and profits. Top photos via Wikipedia & Nvidia If you like what you read, follow us on Facebook, Instagram, Twitter and Telegram to get the latest updates. The season is set in Thailand. February 13, 2024, 11:46 AM Please don't do this. February 13, 2024, 11:16 AM Taxi fleets have been shrinking over the years. February 13, 2024, 11:00 AM The woman has since filed a police report in Singapore. February 13, 2024, 12:14 AM The suspect has been remanded. February 12, 2024, 11:14 PM Presumably to get ahead of slow-moving traffic. February 12, 2024, 10:21 PM To rub salt into the wound, the man later discovered that he had received the wrong order from the restaurant. February 12, 2024, 10:00 PM Two technicians were called in to resolve the issue. February 12, 2024, 07:29 PM A neighbour said the woman would occasionally stay over in the unit. February 12, 2024, 06:17 PM The match started under clear skies, but there was a sudden change in weather. February 12, 2024, 05:54 PM About\n|\nAdvertise with us\n|\nContact us\n|\nWe Are Hiring\n|\nPrivacy policy Copyright © 2020 Mothership. All rights reserved. "
}