{
    "title": "Nvidia, Databricks investments value generative AI search startup at $520M",
    "date": "1/5/2024",
    "url": "https://www.computerworld.com/article/3712022/nvidia-databricks-investments-value-generative-ai-search-startup-at-520m.html",
    "text": "By Gagandeep Kaur Contributing writer, \n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nComputerworld | Perplexity AI, a generative AI search engine startup, has raised $73.6 million in new funding from investors including Nvidia, Databricks, and Amazon founder and former CEO Jeff Bezos. The deal values the company at $520 million and is one of the largest amounts raised by a search engine startup in recent years. Databricks’ investment is interesting given that its competitor, Snowflake, recently acquired the technology of another generative AI search startup, Neeva, which shut down its subscription-based search engine after failing to find enough subscribers. So far, Perplexity AI is generating $5 million to $10 million in annual revenue, according to The Wall Street Journal. Perplexity AI seeks to answer users’ questions in a conversational style, rather than sending them to another website for the answer. “There is no need to click on different links, compare answers, or endlessly dig for information. In an era where misinformation and AI hallucinations are causing increasing concern, we’re built on the idea that accuracy and transparency are prerequisites to making AI-powered search ubiquitous,” Perplexity CEO Aravind Srinivas wrote in a blog post announcing the funding. Perplexity AI plans to use the new investment to expand its offerings and grow its user base. It will face stiff competition, as other companies besides it and Neeva are entering the market. The last few years have witnessed the emergence of several startups, such as Sinequa and Squirro, using generative AI to reimagine online search. For now, they’re all playing in the margins, as Google has near dominance of online search, with as much as 90% market share in online search. Perplexity AI claims to have grown to 10 million monthly active users and to have answered around 500 million queries in 2023. In contrast, Google is estimated to field around 2 trillion searches per year. However, the backing of prominent tech leaders such as Bezos and of companies like Nvidia is likely to help Perplexity AI. Nvidia has already established itself as a prominent player in the AI ecosystem, with its hardware being used in OpenAI’s ChatGPT. The high valuation of Perplexity AI points to investors’ confidence that the company will be able to disrupt search as its CEO forecast in his blog post: “The times of sifting through SEO spam, sponsored links, and multiple webpages will be replaced by a much more efficient way to consume and share information, propelling our society into a new era of accelerated learning and research,” Srinivas wrote. Copyright © 2024 IDG Communications, Inc. Copyright © 2024 IDG Communications, Inc. "
}