{
    "title": "It's Official: These Were the 2 Best-Performing S&P 500 Stocks in 2023",
    "date": "1/2/2024",
    "url": "https://www.fool.com/investing/2024/01/02/its-official-these-2-best-performing-stocks-2023/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More 2023 is now in the books, and it exceeded almost all expectations from an investment perspective. Coming into the year, these were the price targets for the S&P 500 index among some of Wall Street's top investment banks: The index officially closed 2023 at 4,769! It marked a 26.3% return including dividends, and it was led higher by two technology giants that each logged triple-digit percentage gains for entirely different reasons. Meta Platforms (META 0.36%) stock surged on the back of a spectacular earnings recovery, but Nvidia (NVDA 3.12%) topped the charts thanks to its data center chips designed for artificial intelligence (AI) workloads. I'll share the details below and highlight why these two stocks probably aren't done moving higher. Meta Platforms entered 2023 with a stock price of $120, which was 69% below its all-time high. It set a seven-year low of $90 just a few months earlier, because investors were growing impatient with CEO Mark Zuckerberg's strategy to focus on virtual reality and the metaverse. All the while, new social media platforms like TikTok were stealing advertising dollars away from Meta's core assets Facebook and Instagram. The stock-price slide prompted Zuckerberg to declare 2023 the \"year of efficiency.\" He quickly slashed 21,000 jobs and committed to cutting costs across the board, and he even moderated spending on metaverse projects which were only generating tiny amounts of revenue. Zuckerberg also shifted the company's focus back to its social media assets. Meta aggressively invested in artificial intelligence, which can learn what content users enjoy viewing and feed them more of it to make their experience more relevant. Through the first nine months of 2023 alone, Zuckerberg said AI-powered content recommendations drove a 6% increase in the amount of time users spent on Instagram, and a 7% increase on Facebook. That gives Meta more opportunities to show ads to users, which in turn drives more revenue. The ad market also bounced back in 2023 following a dismal 2022, when businesses cut their spending amid uncertain economic conditions. Those combined factors drove Meta's revenue to a quarterly record-high of $34.1 billion in the third quarter of 2023 (ended Sept. 30). Meta's earnings per share (profit) also soared 167% year over year to $4.39 in Q3, helped along by cost cuts. The company is on track to deliver $12.92 in total earnings per share for 2023, pending its fourth-quarter results. Considering Meta stock closed the year at $353.96, it trades at a price-to-earnings (P/E) ratio of 27.4, assuming its final results come in as expected. That's a 9% discount to the 30.1 P/E of the Nasdaq-100 technology index, signaling 2024 could bring more upside for Meta's investors. But it gets better. Wall Street predicts the company's earnings will hit a record high of $15.78 in the year ahead, placing its stock at a forward P/E of 22.4. If that earnings forecast proves correct, Meta stock will have to rise 34% by the end of 2024 just to trade in line with the current P/E ratio of the Nasdaq-100. Image source: Nvidia. Meta's 2023 return was spectacular, but the biggest gainer in the S&P 500 was Nvidia. The company delivered some of the best operating results Wall Street has ever seen, sending its stock a whopping 239% higher for the year. Nvidia cemented itself as the biggest name in artificial intelligence last year, and it probably won't lose that title anytime soon. AI whipped the corporate world into a frenzy. Applications like OpenAI's ChatGPT can instantly create text, images, videos, and even computer code, which has the potential to drive a productivity boom. Developing, training, and deploying those AI applications happens in the data center, and Nvidia's graphics processing chips (GPUs) are the beating heart of that infrastructure. Nvidia is currently in its fiscal 2024 year, which ends Jan. 30, 2024. Through the first three quarters, the company generated $29.1 billion in data center revenue alone, which marked a 155% increase from the year-ago period. In early 2023, HSBC estimated Nvidia had a 90% share in the market for AI data center chips, which afforded it unprecedented pricing power. Its leading H100 GPUs are known to sell for $40,000 apiece. As a result, Nvidia's gross profit margin currently sits at a record high of 74%, sending its earnings per share soaring 599% through the first three quarters of fiscal 2024. Nvidia would have done even better if not for supply shortages. It simply can't produce chips fast enough to meet demand; cloud providers like Microsoft Azure, Amazon Web Services, and Alphabet's Google Cloud are racing to fill their data centers with the company's hardware. Oracle is currently building 100 new data centers on top of the 66 it already operates. Nvidia recently launched its new H200 data center chip. It can speed up AI model inferencing (teaching it to make live predictions) twofold compared to the H100, while consuming half the amount of energy. That's music to the ears of data center operators, because it could drive more revenue with lower operating costs. Wall Street already predicts Nvidia's revenue and earnings will surge 56% and 59%, respectively, in the upcoming fiscal 2025 year. That bodes well for more upside in its stock during calendar 2024. JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Goldman Sachs Group, JPMorgan Chase, Meta Platforms, Microsoft, Nvidia, and Oracle. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}