{
    "title": "3 Artificial Intelligence (AI) Stocks You Should Buy and Keep Forever",
    "date": "1/31/2024",
    "url": "https://www.fool.com/investing/2024/01/31/3-artificial-intelligence-ai-stocks-you-should-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Should you hold a stock forever? Some say that investors shouldn't marry their stocks. I'd argue in favor of holding stocks for as long as their underlying businesses perform, which could include forever. Admittedly, that sets the bar high. Most companies have occasional bumps and bruises. The good ones bounce back. But business is competitive, and staying atop the mountain for decades is hard. Keeping that in mind, I set out to build a list of artificial intelligence (AI) stocks that could potentially earn a permanent spot in a diversified portfolio. After all, AI is forecast to create trillions of dollars in economic value over the coming decades. That means it should be an excellent spot for long-term thinking. What makes a company (and its stock) likely to last for such a long time? Image source: Getty Images Nobody knows what the future will hold. AI could look completely different in a decade than it does now. Looking for future-resistant businesses steered me to look for a few crucial traits. Specifically, investors should take a closer look at companies with: In other words, look for situations where AI strengthens an already great company. With that said, consider buying and keeping these three AI stocks forever: You've probably seen a ton of coverage on Nvidia (NVDA 3.12%) and most investors already know about its potential. But Nvidia is too important to leave off this list just because it isn't the new thing. The company rapidly acquired a stranglehold on the AI chip market, and it is arguably the most essential building block of AI because the models that are essential to AI require lots of computing power to crunch data. According to analysts, Nvidia's AI chip market share sits around 90%. As a result, business is booming. Top and bottom-line growth rocketed off in 2023, and since the AI chip market is poised to expand tremendously moving forward, this could be the new normal for a while.  NVDA Revenue (TTM) data by YCharts Why should investors feel optimistic that Nvidia will keep its market share? The company built an end-to-end hardware and software ecosystem that helps customers using its chips deploy and maximize their AI models. The entire platform is the secret sauce, not just the chips themselves. Are companies building within this ecosystem going to bail and use something else easily? That would be like changing all the electrical wiring in your house. It's a messy job that's probably not appealing to most. E-commerce giant and cloud leader Amazon (AMZN 0.40%) is known for several businesses, so its AI potential might slip under the radar a bit. But that could work in investors' favor. Amazon has already built a trillion-dollar company on e-commerce, cloud, advertising, and streaming. Its cloud platform, Amazon Web Services (AWS), has blossomed into the world's leader with an estimated 50% market share, according to research by HG Insights. That same report estimates roughly 2.38 million businesses use Amazon's cloud computing services, so that is low-hanging fruit to begin cross-selling AI products and services. Cloud computing is already projected to continue growing for years, and weaving AI and machine learning into that business may only pour gas on Amazon's success.  AMZN Revenue (TTM) data by YCharts Additionally, Amazon's strong presence in e-commerce (38% market share in the U.S.) and rapidly growing advertising business are excellent safety nets for investors. AI can add to a winning business instead of putting Amazon in a make-or-break scenario. That sets a high floor, making Amazon an outstanding stock to buy and tuck away. CEO and entrepreneur Elon Musk seemingly likes doing hard stuff. He built a space exploration company and led Tesla (TSLA -1.15%) to disrupt the automotive industry with electric vehicles. Naturally, he wouldn't let the AI technology era arrive without tossing his hat in the ring. Tesla is investing heavily in multiple AI-related products. Tesla's full-self-driving (FSD) ambitions headline this list. The company has been developing FSD software for years that relies on camera imagery to process the vehicle's surroundings. Musk himself has said that Tesla's value depends heavily on succeeding with FSD. Additionally, the company is developing a humanoid robot that will hopefully utilize FSD's tech to perform manual labor someday. Tesla's Dojo supercomputer powers its AI, making the EV company a full-fledged technology powerhouse.  TSLA Revenue (TTM) data by YCharts FSD and robotics look promising, but ambition doesn't promise success. However, despite Musk's claim, Tesla likely has a bright future, supported by strong leadership in EVs and a growing energy business. Investors can buy into Tesla on that alone, with FSD and AI robotics being potential catalysts for Tesla to realize its full long-term investment potential. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}