{
    "title": "Here's What History Says Investors Can Expect From Nvidia in the Next Few \nYears",
    "date": "1/27/2024",
    "url": "https://www.fool.com/investing/2024/01/27/heres-what-history-says-we-can-expect-from-nvidia/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 3.12%) was one of the top stocks in 2023, rising 239%. While some thought this may have been Nvidia's ceiling, that has been far from the truth. In just under a month in 2024, Nvidia has already risen 21%, giving the impression that 2024 could be a repeat year for the stock. However, much of the optimism baked into the stock ignores an ugly truth about Nvidia that many people forget: It's a cyclical company. So, what can investors expect in the next few years? Let's take a look at what history says. Nvidia has done so well over the past year because it makes the world's most powerful graphics processing units (GPUs) suited for artificial intelligence (AI). Originally, GPUs were created to improve gaming graphics, which required significant computing power. Soon, the use of GPUs for other arduous computing tasks like AI model training, engineering simulations, drug discovery, and mapping the human genome would be sped up by using hundreds or thousands of GPUs connected together. Because of the AI arms race, many companies raced to build supercomputers to train their AI models. This fueled Nvidia's growth and resulted in Nvidia's revenue more than tripling year over year in the third quarter of fiscal year 2024 (ended Oct. 29, 2023). However, many people forget that Nvidia was in a massive slump at the start of 2023, as its cyclical nature reared its head throughout 2022. Another use for Nvidia's GPUs is cryptocurrency mining. This industry has had two major boom-and-bust cycles, one at the start of 2018 and the other during 2021. When crypto prices fall, mining cryptocurrency becomes unprofitable, as the input costs far outweigh the output. As a result, crypto miners don't purchase as many GPUs (or purchase none at all), which affects Nvidia's business significantly. In the years following a crypto crash, Nvidia saw its revenue dip.  NVDA Revenue (Quarterly) data by YCharts When Nvidia's revenue dips, it isn't optimized for profits, so its earnings fall even more dramatically.  NVDA EPS Basic (Quarterly) data by YCharts So, what does this have to do with today's AI-fueled GPU purchasing? Because GPUs are hardware, they don't need to be purchased continually. While many companies are still outfitting their supercomputers, others have already built theirs. Take Tesla's Dojo computer, for example. It required 10,000 H100 GPUs from Nvidia and likely cost more than $300 million in GPUs alone, with the average price of an H100 GPU being about $30,000. Will Tesla need to build another Dojo computer each year? Likely not. This could cause Nvidia's downfall in the next few years: Customers won't need to buy GPUs continuously. However, the problem with this analysis is that I have no idea when this will occur or how low the demand will fall. Nvidia's previous cyclical declines only brought the revenue down around 20%. If Nvidia is still slated to double from its current levels, then even if business falls 20% once demand has been satisfied, the stock still has room for more upside. On the other hand, if the business will fall 20% from current levels, the stock is currently overvalued. Additionally, 20% may be a conservative number, as once these companies build out their infrastructure, they may be set for many years. I have no idea when Nvidia's business will top out and how far it will go when business declines. But I know that it's coming. With how fully valued the company is today (160 times earnings), investors need to be careful if they're taking a position in the stock at today's prices. Keithen Drury has positions in Tesla. The Motley Fool has positions in and recommends Nvidia and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}