{
    "title": "Nvidia Just Hit a New All-Time High -- but Cathie Wood Bought This Other \nChip Stock Instead",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/nvidia-just-hit-time-high-114100989.html",
    "text": "Booming interest in artificial intelligence (AI) helped fuel the Nasdaq Composite's 43% return in 2023. While use cases for AI continue to explode, one company in particular is front and center in the action. Semiconductor giant Nvidia produces some of the most cutting-edge graphics processing units (GPUs) on the market -- chips that are used to train and power generative AI models. The demand for these chips is so high that Nvidia's business sets new records every quarter. The company's impressive results propelled Nvidia's market cap past the $1 trillion mark, earning it entry into an exclusive club whose only other current members are Apple, Microsoft, Amazon, and Alphabet. Nvidia's leadership position within the semiconductor industry led Wedbush Securities analyst Dan Ives to dub its CEO the \"Godfather of AI.\" The momentum from last year has thus far continued into 2024: Nvidia stock hit a new all-time high on Jan. 8. But while investors broadly continue to be enamored with Nvidia, Ark Invest CEO Cathie Wood just scooped up shares of a different semiconductor business. On the same day Nvidia touched that new peak, Wood added a total of roughly 58,000 shares of Qualcomm (NASDAQ: QCOM) to two of her exchange-traded funds (ETFs). Let's consider why she may have done that, and assess whether the stock deserves a position in your portfolio. A common theme in investing is trying to identify \"the next big thing.\" But in their attempts to peer into the future, investors can sometimes convince themselves that they have found a diamond in the rough and draw conclusions that aren't really based on any fundamental analysis. So while it's fun to speculate that Wood might view Qualcomm as the next big tech stock to break out, there is likely much more detail to the equation. Instead of assuming that Wood believes Qualcomm has the same potential as Nvidia, let's break down some known parameters. First, Wood is a big believer in emerging technologies. Her ETFs are invested in growth spaces ranging from autonomous driving, genomics, crypto, streaming, gaming, telemedicine, and e-commerce. Given this dynamic, it's not surprising that she would allocate a portion of her portfolio to AI -- and the semiconductor industry plays a key role in the artificial intelligence movement. Statista predicts that revenue from AI chips will grow from $53 billion in 2023 to $119 billion by 2027. This large and expanding market makes it highly likely that multiple companies will emerge as major players. For this reason, Wood might see Qualcomm as an overlooked opportunity in the AI semiconductor space, which is currently dominated by Nvidia and its top rival, Advanced Micro Devices. But before jumping to any conclusions, it's important to understand Qualcomm's position relative to Wood's other holdings. Right now, Qualcomm stock only accounts for 0.06% of Ark Invest's overall portfolio. By contrast, Nvidia accounts for 0.50%, while AMD and Taiwan Semiconductor comprise 0.30% and 0.17%, respectively. While it's clear that Wood is diversifying Ark's exposure among chip manufacturers, and the entire semiconductor sector makes up a relatively small part of the ETF's holdings. In my view, Wood's purchase of Qualcomm was merely a hedge. The number of different stocks she owns within the semiconductor industry may shed some light on her stance toward the overall market. As such, I think she is slowly building positions in the biggest brands the sector has to offer. Trading at a forward price-to-earnings (P/E) ratio of just 15, Qualcomm stock looks dirt cheap relative to Nvidia and Advanced Micro Devices. Moreover, given the S&P 500's forward P/E of 21.7, it could be that investors in general do not expect Qualcomm to be an overperformer relative to the broader market. While this may appear as an opportunity to pick up shares at a relative bargain price, investors should keep in mind that Qualcomm hasn't been without its challenges. The company has struggled to grow its revenues for several quarters, and operating losses have been piling up. The company recently resorted to layoffs in an effort to curb concerns over its growth prospects. I see Qualcomm as a turnaround story. While the company doesn't carry the same allure as its cohorts, management is making some strategic moves to ensure it is well-positioned to benefit from the themes fueling AI. Although I think the stock deserves to trade at a discounted valuation relative to its peers, it could be a reasonable buy at this price. It was interesting to see Wood scoop up Qualcomm on shares the same day Nvidia hit an all-time high -- but that alone is no reason for you to buy this stock. In fact, the intriguing timing was probably just a coincidence. If you're looking to invest in AI, semiconductor stocks are a good place to start. And while Nvidia, Advanced Micro Devices, and others are currently perceived as leaders, Qualcomm could very well emerge as a long-term winner as it marches back toward accelerated growth. Should you invest $1,000 in Qualcomm right now? Before you buy stock in Qualcomm, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Qualcomm wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Microsoft, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy. Nvidia Just Hit a New All-Time High -- but Cathie Wood Bought This Other Chip Stock Instead was originally published by The Motley Fool Related Quotes "
}