{
    "title": "Traders Get Crushed As \"New NVIDIA\" SMCI Stock Pops And Drops",
    "date": "2/19/2024",
    "url": "https://www.valuewalk.com/new-nvidia-smci-stock-pops-and-drops/",
    "text": "Home » Stocks What does a bursting bubble look like? It typically starts with a sense of dread and regret as overeager traders buy a stock near the top, only to watch with horror as the selling pressure intensifies and their losses mount. This process started on Friday as the stock that’s supposed to be the “new” NVIDIA (NASDAQ:NVDA), Super Micro Computer (NASDAQ:SMCI), lost approximately 20% of its value in a single day. Apparently, some amateur traders are learning the hard way that stocks don’t just go up forever in a straight line. This isn’t to suggest that Super Micro Computer is a bad business, by any means. Just to recap, Super Micro Computer manufactures high-end computer servers that can be used for artificial-intelligence (AI) applications. Oftentimes, Super Micro Computer’s servers come with graphics processing units (GPUs) manufactured by AI-hardware market darling NVIDIA. As a result, the market evidently decided to latch on to SMCI stock as the heir apparent to the title of “the next NVIDIA.” For what it’s worth, Super Micro Computer did demonstrate impressive growth in its most recently reported quarter. During the second quarter of fiscal 2024, Super Micro Computer generated net sales of $3.66 billion, more than double the $1.8 billion from the year-earlier quarter. Furthermore, the company reported diluted net income of $5.10 per share in Q2 FY2024, versus $3.14 per share in the same quarter of fiscal 2023. Hence, it would be understandable if SMCI stock were to move moderately higher. Technically speaking it hit their price target.$SMCI $BAC pic.twitter.com/7NSJPZrfHg However, due to the massive AI hype, SMCI stock went parabolic, running from $300 to more than $1,000 in a few weeks. For a hot minute, the stock traded at $1,077 per share. Along with the AI hype, there was also a measure of self-promotion from the company. That’s because Super Micro Computer had raised its FY2024 revenue guidance range substantially, from $10 billion to $11 billion to a new range of $14.3 billion to $14.7 billion. It’s a dangerous game that some of today’s Big Tech companies like to play. They’ll publish ultra-optimistic forward guidance, which will almost inevitably juice their stock price — a tactic that works most of the time. However, they then have to live up to those high expectations. The next thing you know, any pin can burst the bubble. For example, a less-than-optimistic analyst might issue a warning about the stock, thereby causing a wave of panic-selling. Evidently, this is what happened on Friday as Wells Fargo analyst Aaron Rakers published an Equal Weight rating and a $960 price target on SMCI stock. Moreover, Rakers cautioned that Super Micro Computer shares were “already discounting solid upside.” “We believe [the] shares will be highly susceptible to any indications of tempering GPU-based server demand,” the Wells Fargo analyst added. “Highly susceptible,” indeed. SMCI stock promptly dropped from around $1,070 to slightly more than $800 after Rakers raked the company over the proverbial coals. Just a day earlier, Bank of America (NYSE:BAC) analysts had initiated coverage of Super Micro Computer stock with a Buy rating and a $1,040 price target. I could be wrong about this, but I have a funny feeling that they’ll end up revising their price target lower in the coming weeks. Hopefully, somebody somewhere will learn a lesson about what can happen after a stock posts nine consecutive sessions of gains. Level-headed investors would be reluctant to buy a stock after such a sharp rally, but others will seek to jump on the bandwagon and ride the tail end of the move. $SMCI This is so sad… This is exactly what I was talking about. Expecting a $150-$200 sell day and to take profits before it happens. It’s sad to see people lose so much. This was up $800 in 2 months and was due for a dip. pic.twitter.com/OUlrbyXNHv The fallout of a pop-and-drop can be devastating for unwary traders. After a stock like SMCI makes a vertical move, it can certainly move higher, but the risk-to-reward balance becomes less favorable. “When things are really ripping like this, it isn’t institutions wanting to hold something as a long-term investment; it is a casino mentality for people playing momentum and taking shots,” explained Michael Matousek, head trader at U.S. Global Investors Inc. This is a textbook example of what can happen when “playing momentum” goes wrong. Chasing high flyers can lead to life-changing losses, and while Super Micro Computer may be a promising business, no one can promise that the losses in its stock will ever be recovered.  Never Miss A Story! Subscribe to ValueWalk Newsletter. We respect your privacy. Subscribe  Subscribe ValueWalk.com is a highly regarded, non-partisan site – the website provides unique coverage on hedge funds, large asset managers, and value investing. ValueWalk also contains archives of famous investors, and features many investor resource pages. Crypto promotions on this site do not comply with the UK Financial Promotions Regime and is not intended for UK consumers. Please speak to a licensed financial professional before making any investment decisions.  "
}