{
    "title": "AI In Focus Ahead Of Nvidia's Earnings, Assessing AIO's Outlook (NYSE:AIO)",
    "date": "2/18/2024",
    "url": "https://seekingalpha.com/article/4671286-ai-in-focus-ahead-nvidia-earnings-assessing-aio-outlook",
    "text": " Vertigo3d AI has been all the rage so far this year. Shares of NVIDIA (NVDA) have been on fire, up more than 40% in 2024 and +230% YoY, while the latest speculative stock of the day is Super Micro Computer (SMCI). Investors will get new information this week when the world’s third most valuable publicly traded company reports results on Thursday. How NVDA trades post-earnings will play a key role in how the AI theme unfolds as we head into the tail end of Q1. I reiterate my buy rating on Virtus Artificial Intelligence & Technology Opportunities Fund (NYSE:AIO). This closed-end fund (CEF) features solid diversification while still giving investors AI exposure. What's more, the technical picture remains attractive. Goldman Sachs According to the issuer, AIO seeks to generate a stable income stream and growth of capital by focusing on one of the most significant long-term secular growth opportunities in markets today. A multi-asset approach based on fundamental research is employed, dynamically allocating to attractive segments of a company’s debt and equity in order to offer an attractive risk/reward profile. The fund normally invests at least 80% of its net assets (plus any borrowings for investment purposes) in a combination of securities issued by AI firms and in other companies that stand to benefit from AI and other technology opportunities. AIO is still a small ETF despite increased volume and share-price appreciation in the last several months. Total assets under management sum to just $723 million as of February 16, 2024, while its dividend yield is high at 9.4% on a trailing 12-month basis. Being a closed-end fund, the expense ratio is high due to the cost of borrowing – the latest figure is 1.41%. Share-price momentum has been healthy recently, but it’s not a super highflyer compared to other, more concentrated, AI funds. Liquidity can be an issue at times considering the low average daily volume of just 137,000 shares, so using limit orders during the trading day is prudent in my view. Digging into the portfolio, AIO plots on the upper-right portion of the style box, given a high allocation to the large-cap growth niche of the stock market (when analyzing the equity portion of AIO). What is attractive is that the CEF’s price-to-earnings ratio is under 23x. Compare that to the Information Technology sector’s forward operating P/E of 28x. Morningstar With a decent valuation for its high earnings growth, the sector breakout is concentrated. Tech is 44% of the CEF while Health Care, a top-performing area of the S&P 500 so far in 2024, is an overweight at 22%. There is no Utilities or Consumer Staples exposure, two of the more defensive sectors. Thus, I would consider AIO a risk-on fund. The story does not end there, however. Forty-nine percent of the CEF is invested in common stocks, but 32% is in Convertible Securities with 16% in High Yield Bonds, according to the issuer. That mix helps create the high yield. NVDA is the largest single-stock position at 3.3%, and the top 10 equities represent just 22.5% of the portfolio. Thus, concentration is not all that high, which I like from a risk point of view. Seeking Alpha Seasonally, AIO’s track record only goes back to October 2019. Still, we uncover a key risk when assessing historical performance patterns. February and March have often been tough months for AIO, producing negative returns more than half the time. Shares have tended to rally from April through August, though. StockCharts.com With a reasonable valuation and diversification across sectors and asset classes, AIO’s chart continues to look strong. Notice in the graph below that shares recently rallied to levels not seen since May 2022. AIO notched a bullish double-bottom low at the $15 mark on a successful retest of the October 2022 low just a few months ago. A tremendous year-end rally to almost $20 has recently been consolidated, but AIO remains above key support at the $19.10 mark. Technicians call this a ‘throwback’ - a retreat to a point of polarity. Also, take a look at the RSI momentum indicator at the top of the chart – as price notched new highs, so too did momentum. That is a positive confirmation of the broader AIO rally. What’s more, we can take the previous $5 range and project a price target for the CEF. Based on the $15 to $20 range from mid-2022 through late last year, an upside measured move objective of $25 is now in play. Finally, with an air pocket of light volume by price up to $25, the fund could rise without much bearish overhead supply to halt the rally. Overall, $19 is key support, while the upside target is $25. StockCharts.com I reiterate my buy rating on AIO. The fundamental valuation appears attractive ahead of NVIDIA’s earnings report later this week. The technicals, meanwhile, appear sound. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}