{
    "title": "Are these the best AI stocks to watch in March 2024?",
    "date": "2/2/2024",
    "url": "https://www.ig.com/uk/trading-strategies/are-these-the-best-ai-stocks-to-watch--240216",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money.\n\n Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money. WHY IG? GET TO KNOW US TRADING THE FINANCIAL MARKETS IMPORTANT INFO SHARES AND ETFS KEY MARKETS MORE OPPORTUNITIES EXTENDED HOURS OUR PLATFORM AND FEATURES THIRD-PARTY PLATFORMS START EXPLORING NEWS AND ANALYSIS LEARN TO TRADE View more search results Microsoft, Apple, Nvidia, Alphabet and Amazon could be the best AI stocks to watch next month. These stocks are the largest AI stocks in the US based on market capitalisation. 2023 was arguably the year of AI — the NASDAQ Composite rose by 43% in the calendar year, driven by AI-fuelled bubbles in Nvidia alongside the rest of the so-called ‘magnificent seven.’ The year was immediately preceded by the launch of revolutionary — and crucially, free to use — ChatGPT, which was swiftly followed by a response from both Alphabet in the form of Bard (now Gemini) while many other tech companies soon followed. In March 2023, the more advanced GPT-4 hit the market, which was swiftly followed by multiple AI-generated imagery tools — in one case, a realistic fake image of Pope Francis wearing a certain clothing brand circulated the internet, highlighting the openness of AI to abuse. That same month, tech leaders from across the US spectrum signed an open letter urging a pause on AI development for six months to assess the risks. A couple of months later, ChatGPT gained internet connectivity — and was soon incorporated into Bing, Microsoft’s search engine. For context, Microsoft has a significant stake in ChatGPT’s parent, OpenAI. Add in the constant stories of academic controversies, and the months-long Writers Guild of America strike over concerns that AI had the potential to replace human writers, and it’s easy to see how AI is already embedded throughout the global markets. AI is already in use across a wide variety of real-world applications, including in entertainment, social media, art, retail, security, sport analytics, manufacturing, self-driving cars, healthcare, and warehousing alongside dozens of other sectors. Every Netflix recommendation, every supermarket rewards purchase, and every football match is analysed ever more relentlessly in order to provide more and better data. And analysts think the sector will only grow. Of course, there will be casualties; whether Microsoft or Meta, virtually every tech company is engaged in layoffs. While much of this can be blamed on higher interest rates, arguably AI is already replacing some workers. There is some disagreement on what constitutes an AI stock — and whether it must be the main focus of a company or simply be a significant growth area. Here we have listed the top AI stocks in the US based on companies where AI is a growth area and ordered by market capitalisation. Microsoft is the original global computing power, so it makes sense that the US behemoth tops the list of the best AI stocks to watch — and is now the most valuable company in the world. The business already had a strong relationship with OpenAI prior to the ChatGPT launch and has invested $13 billion into the company since 2019. In Q2 results, revenue increased by 18% year-over-year to $62 billion, while net income rose by 33% to $21.9 billion. CEO Satya Nadella enthuses that ‘we’ve moved from talking about AI to applying AI at scale. By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector.’ Most recently, the US titan has agreed a decade-long partnership with Vodafone to bring generative AI, digital, enterprise and cloud services to more than 300 million businesses and consumers. Vodafone will invest $1.5 billion in customer-focused AI developed with Microsoft's Azure OpenAI and Copilot technologies and will replace its physical data centres with Azure cloud services — meanwhile, Microsoft plans to become an investor in Vodafone's managed IoT platform. On the other hand, Copilot has reportedly disappointed some early adopters. Market Capitalisation: $2.90 trillion Apple is in the middle of a sea change — it’s now topped Samsung as the largest smartphone maker by volume in the world but has lost its crown to Microsoft as the largest company on the planet. Investor hopes for continued growth may lie in future innovation, and in particular, the long-awaited Vision pro headset which releases on 2 February in the US with a $3,499 price tag. For context, Meta’s Quest 3 can be reliably found on sale for circa £500. However, the release of the Apple headset has been met with mixed results — and Meta CEO Mark Zuckerberg even released an informal video arguing that the cheaper device is not only better value for money, but better overall. In better news, Apple’s Keyframer AI tool has impressed new users with its ability to animate images using text descriptions. In Q1 results, Apple saw revenue rise by 2% year-over-year to $119.6 billion, while quarterly earnings per diluted share increased by 16% to $2.18. CEO Tim Cook noted the company’s ‘all-time revenue record in Services’ and also enthused that the company’s ‘installed base of active devices has now surpassed 2.2 billion, reaching an all-time high across all products and geographic segments.’ Market Capitalisation: $2.82 trillion Nvidia is arguably the prime beneficiary of the AI boom, last week overtaking Alphabet in market capitalisation, and then eclipsing Amazon a day later. While this rise may be unsustainable, Q3 results saw revenue rise by 206% year-over-year and 34% quarter-on-quarter to $18.12 billion. CEO Jensen Huang now considers that ‘NVIDIA GPUs, CPUs, networking, AI foundry services and NVIDIA AI Enterprise software are all growth engines in full throttle. The era of generative AI is taking off.’ Barclays analysts remain particularly enthusiastic over the AI company, noting that ‘With supply constraints, customers are often using the entire NVDA platform in order to get priority shipments of accelerators.’ Q4 results are to be released on 21 February. Market Capitalisation: $1.39 trillion Google parent Alphabet may control 84% of the global search market share — but Yahoo was once king of search too. In addition to launching Bard, AI is already used across many of Google’s current functions. And it’s got at least two more AI-focused projects; its coding-focused Generative Language API, and DeepMind which it acquired in 2014. In Q4 results, CEO Sundar Pichai enthused that ‘we are pleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud. Each of these is already benefiting from our AI investments and innovation. As we enter the Gemini era, the best is yet to come.’ Quarterly revenue rose by 13% year-over-year to $86 billion. Perhaps most importantly, Alphabet is now ready to launch Gemini 1.5. This is seen as the company’s serious answer to ChatGPT-4, with Pichai arguing that it ‘represents one of the biggest science and engineering efforts we've undertaken as a company.’ Then there’s its new custom-built AI chips to consider — Apple may win its crown back before too long. Market Capitalisation: $1.79 trillion Amazon is well-known as the largest e-commerce retailer in the world, but the company is also a growing operator in the AI space. It offers several cutting-edge AI tools within its AWS business, including Code Whisperer and SageMaker — and clients can customise Amazon’s own machine learning model. Of course, competitors have their owns services, but Amazon is by far the largest cloud computing company, with circa a third of the global market share. Within its e-commerce offering, Amazon uses AI to identify consumer trends, manage inventory and also make personalised product recommendations — including targeted advertising. Then there’s the smart devices, including Alexa and the Fire tablets. CEO Andy Jassy enthuses that the AI opportunity will be ‘tens of billions of dollars of revenue for AWS over the next several years.’ Q4 net sales increased by 14% year-over-year to $170 billion. Market Capitalisation: $1.58 trillion 1. Create an account or log in\n2. Search for the stock you'd like to invest in\n3. Select 'buy' in the deal ticket (you can only go long when investing)\n4. Choose the number of shares you want to buy\n5. Open and monitor your position 1. Create an account or log in\n2. Choose between spread bets and CFDs and search for your opportunity\n3. Select 'buy' to go long or 'sell' to go short\n4. Set your position size and take steps to manage your risk\n5. Open and monitor your position Learn more about the differences between investing and trading. Investing in shares directly is typically lower risk, while trading on leverage offers higher rewards in exchange for increased risk. This means you could gain – or lose – money much faster than you might expect, including losing more than your deposit. You should assess your risk appetite carefully before engaging in leveraged trading. No returns are guaranteed. New to investing or trading? Try out our demo account. Past performance is not an indicator of future returns. This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. See full non-independent research disclaimer and quarterly summary. Go long or short on thousands of international stocks with spread bets and CFDs. Try a risk-free trade in your demo account, and see whether you’re on to something. Don’t miss your chance – upgrade to a live account to take advantage. Don’t miss your chance. Log in to take advantage while conditions prevail.  We reveal the top potential pitfall and how to avoid it. Discover how to increase your chances of trading success, with data gleaned from over 100,00 IG accounts.  For more info on how we might use your data, see our privacy notice and access policy and privacy webpage. Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of spread betting and CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Forex Indices Shares Options Other markets Spread betting CFD trading Share dealing Web platform Mobile trading MetaTrader 4 ProRealTime Compare features The Week Ahead News and trade ideas Strategy and planning Contact us  IG | Sitemap | Terms and agreements | Privacy | IG Community | Cookies | Investors | Modern slavery act | Vulnerability Follow us online: Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money. Professional clients can lose more than they deposit. All trading involves risk.\n\nThe value of shares, ETFs and ETCs bought through a share dealing account, a stocks and shares ISA or a SIPP can fall as well as rise, which could mean getting back less than you originally put in. Past performance is no guarantee of future results.\n\nCFD accounts provided by IG Markets Ltd, spread betting provided by IG Index Ltd and share dealing and stocks and shares ISA accounts provided by IG Trading and Investments Ltd. IG is a trading name of IG Markets Ltd (a company registered in England and Wales under number 04008957), IG Index Ltd (a company registered in England and Wales under number 01190902) and IG Trading and Investments Ltd (a company registered in England and Wales under number 11628764). Registered address at Cannon Bridge House, 25 Dowgate Hill, London EC4R 2YA. IG Markets Ltd (Register number 195355), IG Index Ltd (Register number 114059) and IG Trading and Investments Ltd (Register number 944492) are authorised and regulated by the Financial Conduct Authority.\n\nThe information on this site is not directed at residents of the United States, Belgium or any particular country outside the UK and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. Careers | Marketing partnership "
}