{
    "title": "Nvidia And Spotify Lead Five Stocks Near Buy Points",
    "date": "1/6/2024",
    "url": "https://www.investors.com/news/nvidia-spotify-lead-five-stocks-near-buy-points/",
    "text": "BREAKING: Futures Fall Slightly Nvidia (NVDA), one of the Magnificent Seven stocks, and digital audio streaming leader Spotify (SPOT) head this weekend's watchlist of stocks near buy points. In addition to NVDA and SPOT stocks, the list includes weight-loss drug pacesetter Novo Nordisk (NVO), cosmetics brand ELF Beauty (ELF) and energy drink maker Celsius Holdings (CELH). The IBD Leaderboard portfolio of elite stocks includes ELF, NVO and NVDA. Those three stocks, along with CELH, are part of the flagship IBD 50 list of leading growth stocks. SPOT stock was added to the SwingTrader portfolio on Jan. 4. While the S&P 500 rally took a small step back to start the year, slipping 1.5% for the week, SPOT, CELH and NVO all gained ground for the week, while Nvidia settled for a more modest 0.9% slip. ELF stock was the exception, falling 4.4% on the week after staging a 56% rally in the year's final two months.= Bright prospects for a soft landing are conducive for consumer stocks like Spotify, ELF and Celsius, with wage growth outpacing falling inflation. Wall Street is betting that disinflation will continue even as growth holds up and the stock market has a decent year in 2024. But with markets betting on 1.5 percentage points in rate cuts in 2024, there's some scope for disappointment if inflation progress slows. That uncertainty may be behind the market's slow start to the year. The 10-year Treasury yield, a key not just for auto and home loans but stock valuations, backed up 18 basis points to 4.05% on the week. After big gains to end the year, investors didn't want to go out on a limb ahead of the coming week's key inflation reports. Nvidia has a big week ahead, starting with a special address at CES on Monday at 11 a.m. ET. The AI chip stalwart said in a Friday post that it will reveal how \"our latest breakthroughs supercharge gaming, creating and AI performance with GeForce RTX.\" That seems to imply that Nvidia will reveal its new GeForce RTX 40 Super GPU (graphics processing units). \"All eyes will now be on the price of these GPUs and the performance gap over the existing models,\" The Verge wrote. On Friday, Bank of America analyst Vivek Arya said that Nvidia could generate $100 billion in free cash flow over 2024-2025 — and devote perhaps $30 billion to $35 billion for shareholder returns. NVDA stock rose 2.3% to 490.97 in Friday stock market action, rising past its 21-day exponential moving average. Nvidia is working on a flat  base with a 505.48 buy point. A move past 500.77, where NVDA's advance stalled out on Dec. 18, could provide an early entry. Spotify stock has basically been consolidating since Dec. 4, when it gapped up on news of a 17% staff reduction. KeyBanc analysts followed by boosting operating income estimates by 84% for 2024 and 40% for 2025, saying the move would eliminate excess headcount, rather than impede revenue growth. On Tuesday, Benchmark hiked its price target for SPOT stock to 260 from 202, keeping a buy rating and naming Spotify a top pick for 2024. The analysts are bullish about Spotify's operating leverage and new pricing tiers. Spotify was IBD Stock Of The Day on Dec. 27. SPOT stock rose 3% on the week to close at 193.52. The week's action saw Spotify test its 10-week moving average, slipping as low as 185.37. Thursday's rebound triggered an early entry, with the bounce above its 21-day line and break of a down-sloping trendline. Spotify's current basing action is too short for an official base, but it could have a new flat-base buy point after another week. Novo Nordisk was Friday's IBD Stock Of The Day, a day after inking two deals to bolster its weight-loss drug franchise. A deal with Omega Therapeutics (OMGA) will explore the body's production of heat to potentially raise metabolic activity and help burn fat. Another deal with Cellarity aims to develop a treatment for metabolic dysfunction-associated steatohepatitis, or MASH, a chronic and progressive liver disease. The deals highlight Novo's rapid pace of innovation and large pipeline full of treatments. On Dec. 1, Argus hiked its NVO stock price target to 115 from 110, noting a pipeline that includes a new formulation of its GLP-1 treatment, semaglutide, for Alzheimer's and new drugs for sickle cell and cardiovascular diseases. Meanwhile, Cantor Fitzgerald started coverage of NVO with a 120 target, saying its commercial infrastructure and manufacturing capacity will make it hard for others to catch up in the runaway obesity category that could go from $10 billion to $100 billion over the next 5-7 years. NVO stock dipped 1.5% to 105.98 on Friday, remaining just above a 105.69 buy point from a five-week flat base. Rival Eli Lilly, which was Tuesday's IBD Stock Of The Day, also has been performing well. LLY stock cleared an two early entries during the week and is close to a flat-base buy point. ELF Beauty, whose products are declared to be vegan and \"cruelty free,\" markets its cosmetics and skin care lines through various retailers including Target (TGT) and Ulta Beauty (ULTA). Customers appear to be validating its promise of quality at lower prices. In fiscal Q2, whose results were reported on Nov. 1, ELF posted 76% revenue growth — the third straight quarter of 76% to 78% growth — while raising its category market share by 330 basis points. Meanwhile, earnings per share have grown at a triple-digit pace, with increases of 128% in the latest quarter and 182% and 223% in prior quarters. CEO Tarang Amin later told CNBC that ELF has doubled its market share over the past three years and can do so again \"over the next few years.\" ELF stock rose 0.55% to 138.02 on Friday. The stock, which has pulled back since breaking above a 139.85 buy point in mid-December. That buy point, from a 14-week cup base, is still operative. ELF stock made a brief foray back into a buy zone on Friday, but closed below it on below-average volume. ELF stock has fought back to its 21-day moving average. Energy drink maker Celsius, which inked a distribution and investment deal with PepsiCo (PEP) in 2022, could see its next wave of growth come from food-service distribution. At Morgan Stanley's Global Consumer and Retail Conference on Dec. 6, Celsius management touted its entry into Jersey Mike's Subs, a number of Dunkin' Donuts locations and potential to land at Pizza Hut or,  eventually, even Starbucks. \"They (Dunkin') feel we're incremental.,\" management said, according to a write-up by TheFly.com. If the placement pans out, it \"maybe opens doors\" with other retailers. Celsius is expected to expand internationally. After a great run from May through early September, Celsius stock largely sat out the fall rally, but CELH stock broke above its 50-day line on Dec. 27. CELH rose 1.3% to 57.28 on Friday. A move past 59.58, the intraday high on Jan. 3, would offer an early entry. The Nov. 8 high of 62.99 also presents an early entry point. CELH has an official 68.95 buy point from a 17-week consolidation. Rival Monster Beverage (MNST) also is worth a look. MNST stock finished about flat for the week at 57.54, after making a run as high as 59.08. That's about where its previous rally stalled at the start of November. A move past this resistance would be actionable. YOU MIGHT ALSO LIKE: These Are The Best 5 Stocks To Buy And Watch Now Join IBD Live Each Morning For Stock Tips Before The Open IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today How To Make Money In Stocks In 3 Simple Steps Dow Futures Fall As Boeing Tumbles On FAA Grounding 3/25/2024\nThe dovish Fed and the Nvidia-led AI boom continue to be the big stock market catalysts. Uber and Eli Llly... 3/25/2024\nThe dovish Fed and the Nvidia-led AI boom continue to... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}