{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-retail-sales-tesla-stock-slides-on-more-price-cuts/",
    "text": "BREAKING: Futures Fall Slightly The Dow Jones Industrial Average briefly dropped 150 points early Wednesday after a report showed U.S. retail sales were strong in December. Meanwhile, stock market leaders Apple, Nvidia and Tesla stock all sold off sharply in morning trading. After the opening bell, the Dow Jones Industrial Average pared losses to 0.2%, while the S&P 500 lost 0.7%. The tech-heavy Nasdaq 100 futures sold off 1.4% in morning action. Among U.S. exchange traded funds, the Nasdaq 100 tracker Invesco QQQ Trust (QQQ) was down 1.4%, while the SPDR S&P 500 ETF (SPY) fell 0.8%. Further, oil prices dropped Wednesday morning, as West Texas Intermediate futures gave up gains and were down 2%. WTI futures held below $71 a barrel. The 10-year yield ticked higher to 4.12% Wednesday morning. The 10-year Treasury yield climbed to 4.06% Tuesday, its highest close since Dec. 12. Tesla (TSLA) dropped 3% early Wednesday after the electric-vehicle giant dropped the price of its Model Y Long Range and Model Y Performance in Germany by 5,000 euros, or $5,400, on its website. Last week, Tesla made similar price cuts in China. Tesla stock reversed 0.5% higher Tuesday, ending a four-day slide. Tesla stock now sits below its 50- and 200-day moving averages. The Commerce Department said that retail sales rose 0.6% last month, stronger than the expected 0.4% increase. Excluding autos, sales rose 0.4%, also higher than forecasts. And excluding gas and autos, sales jumped 0.6%, above the 0.3% estimate. Key earnings movers Wednesday morning, with results from Charles Schwab (SCHW), Interactive Brokers (IBKR) and U.S. Bancorp (USB). SCHW dropped 6% early, while Interactive Brokers shares lost more than 1%. USB stock gained nearly 1% in morning action. On Tuesday, the Dow Jones Industrial Average dropped 0.6%, while the S&P 500 moved down 0.4%. The tech-heavy Nasdaq composite lost 0.2% to snap a six-day win streak. Tuesday's Big Picture column commented, \"Weakness notwithstanding, the stock market uptrend remains on track. IBD's recommended exposure is still a highest-possible 80%-100%. Yet some market internals show a softening trend, just as the stock market enters earnings season.\" Now is an important time to read IBD's The Big Picture column amid the continuing stock market rally. Be sure to read how to adjust to changing market conditions, with IBD's new exposure levels. Learn How To Time The Stock Market With IBD's ETF Market Strategy Magnificent Seven player Amazon (AMZN), along with MercadoLibre (MELI), Netflix (NFLX), Novo Nordisk (NVO) and Spotify (SPOT) — plus Dow Jones components Amgen (AMGN), Caterpillar (CAT) and Merck (MRK) — are among the best stocks to buy and watch in the current market rally. MercadoLibre and Spotify were featured in this Stocks Near A Buy Zone column. Get Real-time Buy And Sell Alerts On Stock Market Leaders With IBD Leaderboard Biotech leader Amgen dropped 1% Tuesday, holding out of the 5% buy range past a 288.46 official buy point in a flat base. The 5% buy area went up to 302.88. AMGN stock was down 0.7% early Wednesday. Heavy machinery giant Caterpillar ended Tuesday further below its 293.88 buy trigger, amid a 1.1% drop. CAT stock lost another 3.2% Wednesday morning. Drug maker Merck is trying to break out past a cup base's 119.65 buy point, according to IBD MarketSmith pattern recognition. MRK stock rose 0.4% Wednesday. 4 Top Growth Stocks To Watch In The Stock Market Rally IBD Leaderboard stock Amazon remains just out of buy range beyond a cup base's 145.86 buy point, despite a 0.9% drop Tuesday, according to IBD MarketSmith. AMZN stock sank 1.5% Wednesday morning. MercadoLibre is breaking out past a flat base's 1,660 buy point, with two straight days of gains. MELI stock dropped 2.8% early Wednesday. Netflix declined 2.2% Tuesday, giving up a 482.70 buy point in a cup with handle. NFLX stock dropped 0.8% Wednesday. Weight-loss drug maker Novo Nordisk ended Tuesday down 0.8%, still holding above a 105.69 flat-base buy point. NVO stock moved down 0.5% early Wednesday. IBD SwingTrader stock Spotify is breaking out past a 202.88 buy trigger in a flat base, amid a four-day win streak. SPOT stock lost more than 4% Wednesday morning. IBD's latest newsletter MarketDiem gives you actionable ideas for stocks, options and crypto right in your inbox These are four best stocks to watch in today's stock market, including a Dow Jones leader. Join IBD experts as they analyze leading stocks in the current stock market rally on IBD Live Magnificent Seven stock Nvidia (NVDA) traded down 2.3% in morning action Wednesday. Nvidia advanced 3.1% Tuesday, hitting more record highs. The stock is extended past a flat base's 505.48 buy point. Nvidia is also an IBD Leaderboard stock. Among Dow Jones stocks in the Magnificent Seven, Apple (AAPL) and Microsoft (MSFT) traded lower after Wednesday's stock market open. Apple stock dropped 1.2% Tuesday, finding support around its 200-day line. Still, AAPL is sharply below a 192.93 buy point and the 50-day line. Shares fell another 1.2% early Wednesday. Microsoft stock moved up 0.5% Tuesday, further past a flat base's 384.30 buy point. MSFT was a recent IBD Stock Of The Day. And the software giant was down 1.1% Wednesday morning. Be sure to follow Scott Lehtonen on X, formerly known as Twitter, at @IBD_SLehtonen for more on growth stocks and the Dow Jones Industrial Average. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Nvidia, Tesla, Meta Reveal Rules For Santa Claus Rally And Beyond Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500 stock Super Micro has more than tripled. Tesla remains the... 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}