{
    "title": "Nvidia Stock Not Your Cup of Tea? Buy AMD.",
    "date": "1/15/2024",
    "url": "https://investorplace.com/2024/01/nvidia-stock-not-your-cup-of-tea-buy-amd/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Here's why AMD may be the AI chip play to focus on this year Advertisement Source: Pamela Marciano / Shutterstock.com Investors now have an opportunity to acquire Advanced Micro Devices (NASDAQ:AMD) shares at reduced prices. The beginning of 2024 witnessed a correction, particularly in tech and AI stocks, causing AMD shares to drop from $150 to $137. This correction is attributed to investors securing gains after the tax year, rather than signaling a long-term AI correction in 2024. The subsequent rebound in AMD stock supports this perspective. In 2023, AMD defied critics with impressive stock gains. With the ongoing development of sought-after AI chips, holding onto AMD shares in 2024 remains prudent. Despite occasional skepticism and FUD, sensible investors can confidently maintain their AMD positions. AMD, once considered irrelevant, has transformed into a leading player in CPU, GPU, and embedded chips under CEO Lisa Su’s leadership. The stock surged 127% in 2023, fueled by advancements in AI. However, its future potential warrants closer examination. Under CEO Su’s leadership, AMD stock has achieved remarkable success and holds significant potential for further growth. Su’s strategic focus on CPUs and GPUs, implemented since 2014, bore fruit with CPUs surpassing Intel’s performance, winning GPU contracts for gaming consoles, and gaining ground against Nvidia (NASDAQ:NVDA) in certain areas. AMD’s entry into the AI chip market with products like Instinct MI300A and MI300X challenged Nvidia’s dominance. The recent AMD Fluid Motion Frames preview driver includes integrated GPU support for its top mobile chips and the new Ryzen 8000G APUs. AMD’s new preview driver extends support for its software-based frame generation technology, Fluid Motion Frames (AFMF), to systems with RDNA 3-based integrated graphics chips. The Radeon 700M, featured in the AMD Z1 handheld chips and Ryzen 7 7840U, is now compatible. This update benefits AMD laptops with the specified chip, like the Framework 13 with the latest AMD mainboard. However, for laptops with both integrated and discrete graphics cards, the display must run from the integrated graphics for AFMF to function. With AMD’s stock doubling in 2023, the tech giant eyes a strong 2024. CEO Lisa Su predicts $2 billion in sales for AI-compatible Instinct MI300 accelerators, aligning with a projected $400 billion growth in the AI chip industry over the next four years. Key products, such as Ryzen 8040 Series processors and MI300 Data Center GPUs, position AMD for success in the evolving market. AMD continues to surprise with innovations, unveiling AI-compatible processors for automotive systems. Its versatility in reshaping various technology sub-sectors keeps investors excited. Despite worries about valuations, short sellers faced losses, and predictions of an AI-tech “hangover” by The Wall Street Journal in 2024 were proven wrong. Confidence remains high in holding AMD stock. While AMD may not offer life-changing returns in short order due to its mega-cap status, the stock has consistently outperformed indexes under CEO Su’s leadership. This is a stock that still provides plenty of upside potential for long-term investors, and the company’s past successes indicate ongoing strong performance is likely. As a leading contender in the AI space, the release of the mi300 chips in 2024 is expected to serve as a significant positive catalyst for AMD’s shares. The tech industry’s interest in these chips as a cost-effective alternative to Nvidia’s h100 further strengthens AMD’s position. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/nvidia-stock-not-your-cup-of-tea-buy-amd/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}