{
    "title": "Nvidia is at risk of losing sales in China",
    "date": "1/8/2024",
    "url": "https://finimize.com/content/nothing-special",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest 3 months ago  •  1 min What’s going on here? Chinese tech companies refused to settle for run-of-the-mill chips, forcing US chipmaker Nvidia to play at being average for once. What does this mean? The US is determined to be the first country to make next-level artificial intelligence systems, so it’s banned semiconductor companies from selling their smartest chips to China. That’s been a non-stop blow for Nvidia: big-money Chinese customers Alibaba and Tencent aren’t willing to accept second-best wares, slashing their orders for this year. So while Chinese cloud companies currently source around 80% of their high-end chips from Nvidia, experts predict that a prolonged ban could bring that number closer to 50% over the next five years. Why should I care? For markets: Shop local. Nvidia’s smartest chips are a cut above the rest, but the type it’s allowed to export to China aren’t much better than local alternatives. That means Chinese tech companies might as well get their fix from domestic firms like Huawei, especially if that extra funding means they can make smarter chips faster. Layer on the prospect of increasingly fraught relationships between major economies, and the Chinese market could be Nvidia’s one that got away. The bigger picture: Hail Mary. Despite the US’s best efforts, China is plowing ahead with plans to dominate the artificial intelligence market. The country’s dedicated data agency has carved out a three-year plan that should see the faltering economy benefit from cutting-edge smarts. The outline depends on China successfully developing large-language models – the type of tech behind ChatGPT – to stay on track, although that could take longer to materialize than the stumbling country would like. ai alibaba geopolitics nvidia semiconductors tencent stocks china us airlines alaska airlines ai alphabet Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}