{
    "title": null,
    "date": "1/14/2024",
    "url": "https://finance.yahoo.com/news/forget-magnificent-seven-buy-3-120000480.html",
    "text": "The so-called \"Magnificent Seven\" stocks gained considerable attention recently, and with good reason. Between them, they account for more than 27% of the S&P 500's value, and the market caps of Nvidia, Meta Platforms, and Tesla more than doubled over the last year. Nonetheless, even though the growing popularity of artificial intelligence (AI) heavily influenced those companies' share price growth, they are far from the only ones benefiting from that technology. Also, since smaller companies can more easily achieve higher revenue increases on a percentage basis, investors may look to AI stocks with comparatively smaller sizes. A trio of Motley Fool contributors suggest you take a closer look at these three. Jake Lerch (Advanced Micro Devices): My pick is Advanced Micro Devices (NASDAQ: AMD). Up 121% over the last 12 months, AMD stock already benefited from the surge of interest in artificial intelligence. Still, I think AMD has more upside. That's because the company is only now ramping up for its battle with Nvidia in AI. AMD debuted a new AI-focused chip, the MI300. Interest in AI processing has surged over the last 12 to 18 months, and it is hoping to capitalize on the skyrocketing demand for chips that can support those applications and capture some market share from Nvidia -- the current leader in AI-focused chips. Last month, AMD estimated the total size of the AI data center chip market to be $45 billion, of which the company expects to capture at least $2 billion in sales. However, it's not just the overall size of the market that's critical -- it's how fast the estimates are growing. Consider this: In June, AMD forecast that the market for AI chips would be $30 billion in 2023 -- meaning the company upped its estimated size of the total addressable market for the year by 50% in less than six months. In other words, the AI chip market isn't just growing -- it's exploding. Consequently, analysts' estimates for AMD are climbing. The consensus view now is that AMD's revenue will increase by 17% to $24 billion in 2024. To close, I would note that because the AI chip market is growing so fast, there's plenty of room for competition. Granted, Nvidia has been -- and likely will remain -- the king of the space in the near term. However, plenty of opportunity remains for AMD -- and its investors. Justin Pope (Micron Technology): AI models are large and complex, requiring cutting-edge hardware to handle massive amounts of data. Memory chips, like those that Micron Technology (NASDAQ: MU) sells, are crucial to helping these models perform by allowing them to store more data and access it faster. Historically, computer memory has been a commodity business, leaving Micron susceptible to huge swings in its results. Revenues have fallen by as much as 75% during downturns. Now, the impact of AI could be positioning Micron for a tremendous up cycle. Its high-bandwidth memory product, the HBM3E, is nearly qualified for use with Nvidia's next-generation Grace Hopper GH200 and H200 AI platforms. Micron is ramping up HBM3E production volume, which could add hundreds of millions of dollars to its revenues starting this year. Management noted on the company's earnings call for its fiscal 2024 Q1 (which ended Nov. 30) that pricing power is improving as inventory tightens. It's preventing customers from doubling orders to front-run price increases, a sign of its confidence in future product demand. Management believes that 2025 will be a record year across the memory industry. The stock rose by 46% over the past 12 months, nearly regaining all of its 2022 losses in the process. That values the stock at just over 2 times its book value. Admittedly, that ratio doesn't look like a bargain, and shares could easily fall back if the market grows restless in the coming months. But given how much AI-related demand could boost Micron's business over the coming years, the stock at these levels might look cheap in hindsight. Will Healy (Palo Alto Networks): The rise of the cloud dramatically changed the world's cybersecurity needs. Since cloud systems and the devices that connect to them can be located anywhere, security needed to move beyond the traditional firewall. Perhaps no company offers a more comprehensive set of tools for this purpose than Palo Alto Networks (NASDAQ: PANW). It competes with CrowdStrike and Zscaler, and focuses on a suite of next-generation firewalls called Strata, and a software suite designed specifically for cloud or edge security called Prisma. Its other product line, Cortex, consists of its AI-driven products. It applies multiple security components, including extended detection and response, a data lake, and managed threat hunting to apply a holistic approach to cybersecurity through AI. This approach brought Palo Alto significant revenue growth. In its fiscal 2024 first quarter, which ended Oct. 31, revenue increased by 20% year over year to $1.9 billion. This was a slight slowdown from fiscal 2023, when revenue rose by 25%. Since the cloud cannot exist without cybersecurity, Palo Alto tends to generate stable or growing revenue, but an uncertain economy may have made clients more hesitant to add services. Nonetheless, the company kept its expenses in check, and as it became profitable on a yearly basis last year, earnings have grown at a rapid pace. Net income in fiscal 2024 Q1 was $194 million versus $20 million in the prior-year quarter. Even with a marginal slowdown in revenue growth, that will likely continue. For the fiscal year, Palo Alto forecasts revenue of approximately $8.2 billion, which would amount to a 19% increase. Additionally, its approach to security has become increasingly popular with investors. Over the last year, the stock is up by more than 130%. That took its price-to-sales ratio to 15, a multiyear high. Still, its forward P/E ratio is just under 60, well below the ratios of CrowdStrike and Zscaler, which both trade at more than 90 times forward earnings. Moreover, rapid earnings growth should push that valuation down, making it more likely the stock will keep moving higher as more customers turn to Palo Alto's cybersecurity products. Should you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Advanced Micro Devices wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jake Lerch has positions in CrowdStrike, Nvidia, and Tesla. Justin Pope has no position in any of the stocks mentioned. Will Healy has positions in Advanced Micro Devices, CrowdStrike, and Zscaler. The Motley Fool has positions in and recommends Advanced Micro Devices, CrowdStrike, Meta Platforms, Nvidia, Palo Alto Networks, Tesla, and Zscaler. The Motley Fool has a disclosure policy. Forget the \"Magnificent Seven\" and Buy These 3 Artificial Intelligence Stocks Instead was originally published by The Motley Fool Related Quotes "
}