{
    "title": "Nvidia is no longer Morgan Stanley’s top chip pick. A much different name \nis.",
    "date": "1/22/2024",
    "url": "https://www.marketwatch.com/story/nvidia-is-no-longer-morgan-stanleys-top-chip-pick-a-much-different-name-is-3b51e39d",
    "text": "Morgan Stanley no longer considers Nvidia Corp. its No. 1 chip pick, and is now turning to a different part of the sector for its latest top endorsement. Morgan Stanley analyst Joseph Moore has elevated Western Digital Corp.’s stock \n        WDC,\n        +0.31%\n       to his No. 1 recommendation, bumping Nvidia’s stock \n        NVDA,\n        +3.12%\n       down to second place. While artificial intelligence is the hot theme in chips these days, Moore isn’t calling out AI so much as cheering the potential for more than 25% upside in shares of Western Digital, which makes computer data-storage products. He sees an “extremely compelling” valuation gap between Western Digital shares and peer names, and he’s upbeat that an upcoming separation of the memory- and hard-drive chip company will translate to value for investors. “While the market appeared to favor consolidation scenarios, the decision to separate the hard-disk-drive and memory assets towards the end of the year actually simplifies the story completely,” Moore wrote in a Monday note to clients. He also flagged improvements in NAND memory trends as a tailwind. “We are seeing NAND prices up more than 20% [on a sequential basis in the first quarter], more in some areas,” he wrote. “Given that the company had already guided to positive gross margins in the December quarter, we should already be at midcycle gross margins in the March quarter, in contrast to memory peers.” Don’t miss: Why Marvell just dethroned Nvidia as Citi’s top chip-stock pick Admittedly, Moore has a “somewhat mixed” view of the longer-term NAND cycle, noting that “fab utilization is quite low, and will rise imminently.” That trend is “bad for economics,” he continued, but there have also been few new entrants into the NAND market recently. He upped his price target on the stock to $73 from $52, with the new target representing 27% upside from midday levels Monday. The stock was trading up 5.2% at last check Monday. See also: If Nvidia looked more like Salesforce, it might unlock billions more in cash, analyst says Moore continues to like Nvidia’s stock, which is his top pick among compute names, though he called out the strong stock-market rally for the maker of graphics processing units over the past month: It’s gained 22% in that span. “All of the AI stocks have rallied, and with the potential for AI tocome off of allocation in [the second half of 2024], there could be some headwinds to consider,” he said. “That said, Nvidia has rallied less than other companies in the AI supply chain, while retaining the premiere position, and does have material upside for the next couple of quarters at least, and key products such as H200 and B100 should add to investor comfort with the company’s market leadership.” Check out On Watch by MarketWatch, a weekly podcast about the financial news we’re all watching — and how that’s affecting the economy and your wallet. MarketWatch’s Jeremy Owens trains his eye on what’s driving markets and offers insights that will help you make more informed money decisions. Subscribe on Spotify and Apple. There’s the potential for more beat-and-raise quarters, plus opportunity in sovereign AI, analysts say. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}