{
    "title": "ASML's orders more than tripled last quarter",
    "date": "1/24/2024",
    "url": "https://finimize.com/content/love-machines",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest 2 months ago  •  2 mins What’s going on here? Chip-making equipment manufacturer ASML’s orders more than tripled last quarter, as businesses around the world fell for the allure of AI. What does this mean? ASML is the only producer of the most sophisticated chip-making equipment out there, so the firm’s order sheets indicate the health of the industry at large. And right now, the sector’s long-running slump is nowhere to be seen. A record €9.2 billion ($10 billion) worth of orders were placed with ASML during the fourth quarter of the year, making analysts’ estimates of €3.6 billion look positively puny. That helped pull last quarter’s profit up by a better-than-expected 13% from the same time the year before. So naturally, investors showed their approval by sending ASML’s shares 10% higher on Wednesday – the biggest gain since November 2022. Why should I care? Zooming in: The break-up of the year. China was a loyal customer to ASML last quarter. In fact, Chinese companies made up over a third of ASML’s sales, as they rushed to furnish factories before US and Dutch chip export rules came into effect. Now, harsher restrictions are slated for later this year, denting the amount of orders that will come in from China. But with demand for AI-suitable equipment expected to stay steady elsewhere, ASML expects sales to remain flat this year. The bigger picture: AI is here to stay. ASML believes that AI will be a buoy for its business for years to come, as the tech needs a huge amount of computing power to run. TSMC – the main chipmaker for AI stock market superstar Nvidia – thinks the same, forecasting its revenue to tick up by 20% this year after falling nearly 5% last year. The Semiconductor Industry Association has spotted the signs, too, reporting that the AI theme helped global chip sales rise in November for the first time in over a year. ai asml earnings geopolitics regulation semiconductors tsmc stocks china europe us ai alphabet ai information technology Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}