{
    "title": null,
    "date": "1/4/2024",
    "url": "https://www.fool.com/investing/2024/01/04/1-artificial-intelligence-ai-stock-to-buy-before-i/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More 2023 was the year of artificial intelligence (AI) investing, and perhaps the biggest winners were the \"Magnificent Seven\" stocks, a moniker that includes mega-cap behemoths Apple, Microsoft, Alphabet, Amazon, Nvidia, Tesla, and Meta Platforms. One of the biggest standouts among this cohort was semiconductor company Nvidia, which saw its market cap balloon to more than $1 trillion, fueled by unprecedented demand for chips used to train generative AI models. While each of the companies above has a multitude of ways to benefit from AI tailwinds, savvy investors should know that myriad opportunities exist in the capital markets. One such company that looks set up to dominate in 2024 is Nvidia's top rival, Advanced Micro Devices (AMD 0.54%). While the company's growth in 2023 paled in comparison to Nvidia's, AMD may have just made its best countermove yet, setting up 2024 to be a milestone year. Let's dig into what AMD has in the cards, and why scooping up shares now could be a lucrative opportunity. In early December, AMD released a new line of AI chips. The cornerstone of the product release was the MI300X, AMD's biggest answer yet to Nvidia's unrelenting graphics processing units (GPUs) operation. During the unveiling, AMD's CEO Lisa Su made a bold declaration when she called the MI300X \"the most advanced AI accelerator in the industry.\" If that doesn't get you excited, let's check out some of the use cases around the MI300X accelerator that support Su's high degree of confidence. Microsoft is going to use the MI300X for applications in its leading cloud platform Azure, a strategy that could further propel the dominance of ChatGPT. Remember, Microsoft previously made a massive $10 billion investment in OpenAI, the parent company of ChatGPT. Moreover, with the release of its new CoPilot offering, Microsoft's plans to integrate ChatGPT throughout its ecosystem are becoming increasingly clear. Therefore, it's likely the Windows developer will be highly selective with its vendor partners to ensure its massive investments in AI pay off. Another noteworthy partnership includes Meta, which announced that it will be using the MI300X for AI inferencing. This is important because these use cases could be early indications that AMD's newest chips will be a bellwether for data center business -- a market that is largely dominated by Nvidia right now. Image Source: Getty Images Following the public release of the MI300X, Su sat down with CNBC to speak in more detail about how these chips could represent the next frontier of growth. More specifically, Su said that she believes the addressable market for data center AI accelerators will reach $400 billion by 2027. To put this figure in perspective, during AMD's Q3 earnings call management guided for $2 billion in data center GPU revenue for 2024. Although this looks like a low forecast relative to the potential size of the market, I'm not worried for AMD. Given the sky-high demand for Nvidia's GPUs, the company has made significant investments in manufacturing and production. I see this as an opportunity for AMD to make inroads in the data center AI market and acquire additional market share. Why? Because as Nvidia's backlog continues to grow, I see customers diversifying their GPU needs and turning to more than one provider. So while Nvidia may dominate the space right now, I think AMD has a greenfield opportunity to provide customers with commensurate (if not superior) technology, and do so at a potentially lower cost and faster delivery time. For this reason, I see AMD's forecast of $2 billion in data center GPU revenue to be conservative. Furthermore, I am incredibly bullish that this figure could grow exponentially in just a few years. AMD stock rocketed 123% during 2023. Yet Hans Mosesmann of Rosenblatt Securities sees another 45% upside for AMD stock, giving it a price target of $200. Don't worry too much about whether AMD reaches or exceeds this price target in 2024. Rather, ask yourself if you believe in the long-term secular trend of AI, and if AMD is well positioned to benefit. I think the MI300X came at just the right time. While Nvidia is the dominant player in AI GPUs, AMD has a unique opportunity to capitalize on unprecedented demand in the data center space in particular. Investors should view AI as more of a marathon than a sprint, keeping in mind that AMD spent a good portion of 2023 making strategic acquisitions, which haven't been fully integrated or monetized yet. So while AMD's current growth is not as exciting as that of its larger counterpart, its roadmap is hard to ignore. Moreover, as various applications for GPU technology begin to take shape, I see AMD emerging as a formidable leader in the space. If you're looking for alternatives to Nvidia or seeking hedges to other AI plays in your portfolio, I wouldn't sleep on AMD. In fact, given the early positive indications of MI300X's demand, 2024 could end up being a massive year for the chip company, and represent the beginning of a long-term strong force in data center AI. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}