{
    "title": null,
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-soars-52-215020844.html",
    "text": "Have you been paying attention to shares of Nvidia (NVDA)? Shares have been on the move with the stock up 12.1% over the past month. The stock hit a new 52-week high of $522.75 in the previous session. Nvidia has gained 5.5% since the start of the year compared to the 51.5% move for the Zacks Computer and Technology sector and the 156.9% return for the Zacks Semiconductor - General industry. What's Driving the Outperformance? The stock has an impressive record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its last earnings report on November 21, 2023, Nvidia reported EPS of $4.02 versus consensus estimate of $3.36 while it beat the consensus revenue estimate by 11.9%. For the current fiscal year, Nvidia is expected to post earnings of $12.31 per share on $58.92 billion in revenues. This represents a 268.56% change in EPS on a 118.42% change in revenues. For the next fiscal year, the company is expected to earn $20.07 per share on $90.57 billion in revenues. This represents a year-over-year change of 63.07% and 53.73%, respectively. Valuation Metrics Nvidia may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company is due for a pullback from this level. On this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. Investors should consider the style scores a valuable tool that can help you to pick the most appropriate Zacks Rank stocks based on their individual investment style. Nvidia has a Value Score of F. The stock's Growth and Momentum Scores are A and B, respectively, giving the company a VGM Score of B. In terms of its value breakdown, the stock currently trades at 42.5X current fiscal year EPS estimates, which is a premium to the peer industry average of 23.3X. On a trailing cash flow basis, the stock currently trades at 168X versus its peer group's average of 12.7X. Additionally, the stock has a PEG ratio of 3.15. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective. Zacks Rank We also need to consider the stock's Zacks Rank, as this supersedes any trend on the style score front. Fortunately, Nvidia currently has a Zacks Rank of #2 (Buy) thanks to rising earnings estimates. Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Nvidia fits the bill. Thus, it seems as though Nvidia shares could have potential in the weeks and months to come. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}