{
    "title": "Singtel partners with Nvidia to provide AI capabilities to its Southeast \nAsian data centers",
    "date": "1/31/2024",
    "url": "https://www.datacenterdynamics.com/en/news/singtel-partners-with-nvidia-to-provide-ai-capabilities-to-its-southeast-asian-data-centers/",
    "text": "Partnership forms part of Singtel’s commitment to Singapore’s National AI Strategy 2.0 Singapore Telecommunications, also known as Singtel, is partnering with Nvidia to deploy artificial intelligence capabilities in its data centers across Southeast Asia. Under the brand Nxera, Singtel will build an undisclosed number of energy-efficient data centers across Southeast Asia. As a result of the partnership, customers will have access to Nvidia Hopper architecture GPUs and Nvidia AI reference architecture, hosted on Nxera’s AI platform. Nxera is a project borne out of Singtel’s support for Singapore’s National AI Strategy 2.0, which calls for an expansion of the city state’s compute infrastructure in addition to increasing its talent pool of AI specialists. In a statement, Nvidia said the data centers would function as sovereign “AI factories,” processing the private datasets of companies, startups, universities, and governments. Customers will be able to use Singtel’s fixed broadband, submarine cable, and 5G networks to operate their AI workloads in a multinetwork and multi-cloud environment. The telco company is also partnering with a number of energy organizations for its Nxera project, including Thailand's Gulf Energy Development, Indonesia's Medco Power, and TNB Renewables in Malaysia, in order to ensure its data centers meet their operational net-zero goals by 2028. Operational net-zero in this case refers to direct emissions, omitting Scope 3 or other embodied emissions. Singtel’s first AI services will be based in Singapore, with future data centers set to be constructed in Indonesia and Thailand. Singtel broke ground on its Singaporean facility, known as DC Tuas, in August 2023. Set to go online in 2025, the eight-story building is set to offer 58MW of IT load capacity across 120,000 sq ft, making it one of the largest in the country. The data center is set to be integrated with the telco’s existing cable landing station (CLS). “The launch of the Nxera data center brand is a key milestone for our data center business as we look to expand our footprint in the region beyond 200MW over the next three years,” said Bill Chang, CEO of Nxera and Singtel's Digital InfraCo unit. “As we build out our data center business, we are putting in place a purpose-driven, fully aligned group of ecosystem partners with distinctive capabilities and unique platforms that will help us grow this digital infrastructure in an AI world – sustainably and responsibly.” He added: “This means democratizing AI access for enterprises, introducing renewable energy and sustainable technologies, and helping produce the talent for our new generation of data centers.” In September 2023, investment firm KKR acquired a minority stake in Singtel’s data center unit. Under the terms of the deal, KKR committed up to S$1.1 billion (~US$800 million) for a 20 percent stake in the telco's regional data center business. Telecom companies in France, India, Italy, and Switzerland have also recently announced plans to deliver generative AI services with data sovereignty through so-called AI factories. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}