{
    "title": "Can Nvidia stock hit $600 in 2024?",
    "date": "1/2/2024",
    "url": "https://finbold.com/can-nvidia-stock-hit-600-in-2024/",
    "text": "As 2023 drew to a close, Nvidia (NASDAQ: NVDA) unequivocally took center stage in the stock market spotlight. Boasting a staggering year-to-date surge of over 240%, NVDA played a pivotal role in driving the broader equity market’s rally, propelling the S&P 500 to within 0.6% of its record high. With Nvidia’s stock price more than tripling last year, on January 2 we turn our attention to whether Wall Street analysts anticipate the chipmaker sustaining this momentum in 2024 and, if so, to what extent. In a nutshell, analysts on Wall Street do not think Nvidia is done rallying. Despite a colossal gain last year, the average 12-month price target on NVDA currently sits at $628.59, implying a potential upside of 26.5% from the current stock price. This consensus forecast is based on analyst coverages on Nvidia’s stock issued in the past 12 months. Among the Wall Street firms that are most bullish on NVDA is Bernstein. Last month, the asset manager’s analysts said Nvidia is still among the cheapest AI-related stocks in spite of a 240% surge. Remarkably, the strategist said Nvidia’s “massive return in the stock has arguably been disappointing” and even though forward estimates have quadrupled in 2023 amid the AI boom, “multiples have compressed by almost 2/3 during the same period,” they wrote. In addition, NVDA’s Price to Forward Earnings (P/FE) are still sitting in the mid-20s, the cheapest since the crypto downturn at the end of 2018. P/FE refers to a valuation gauge that reflects market expectations for the company’s future profitability. Other Wall Street heavyweights including Goldman, JPMorgan, and Morgan Stanley have also raised their price targets on NVDA stock recently, each higher than $600. On the other hand, UBS analysts are among those on the bearish side of the spectrum, predicting a 20-30% pullback in the company’s shares in the first half of 2024. At the time of writing, shares of NVDA were sitting at $495.22, up 0.66% in the past five trading sessions and more than 6.4% across the month. The AI stock is facing a resistance zone between $504.3 and $505.48, the latter also being its all-time high. On the downside, NVDA is underpinned by near-term support levels at $480.88 and $476.09. Below that, the next major support for the stock is $457.67, where the 100-day moving average (MA) is located. Buy stocks now with Interactive Brokers – the most advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}