{
    "title": "Where Will Nvidia Stock Be in 5 Years?",
    "date": "1/20/2024",
    "url": "https://finance.yahoo.com/news/where-nvidia-stock-5-years-145000376.html",
    "text": "The past five years have been rewarding for Nvidia (NASDAQ: NVDA) investors. The semiconductor specialist's stock is a solid multibagger, turning a January 2019 investment of $1,000 into $14,550 as of this writing. This terrific jump in Nvidia's stock price over the past decade can be attributed to the outstanding growth in the company's revenue and earnings. This growth is fueled by multiple catalysts, including the booming demand for gaming hardware, the growing demand for high-performance computing applications, the increasing deployment of semiconductors in cars, and now the need for graphics cards for training artificial intelligence (AI) models. The good part is that Nvidia is setting itself up to deliver even stronger returns over the next five years through its aggressive product roadmap, which should allow it to capitalize on multiple multi-billion-dollar opportunities. It's worth noting that the company pointed out a couple of years ago that it sees a $1 trillion revenue opportunity across several end markets such as automotive, gaming, enterprise software, and chips and systems. Given that it's on track to finish fiscal 2024 (which will end this month) with $59 billion in revenue, it won't be surprising to see Nvidia's revenue and earnings growth accelerating big time over the next decade as it dives deeper into its addressable market. Let's look at the reasons why that may happen and where the stock could be after five years. When Nvidia reported its fiscal 2019 results five years ago, the company generated annual revenue of $11.7 billion. So, Nvidia's revenue is on track to increase 5 times in a space of five years considering its fiscal 2024 forecast, translating into a compound annual growth rate (CAGR) of 38%. A similar CAGR over the next five years would take Nvidia's annual revenue to a whopping $295 billion in fiscal 2029. However, certain Wall Street analysts believe that Nvidia could do even better. Take Mizuho analyst Vijay Rakesh, for example. He predicts that Nvidia could generate annual revenue of $300 billion in 2027 from selling AI chips alone, thanks to having a solid 75% share of this fast-growing market. While that may seem outrageous at first, a closer look at the market for AI chips indicates that Nvidia could indeed hit that ambitious mark. It's well known that Nvidia is the biggest player in one of the hottest tech niches right now -- AI chips -- which has allowed the company to record a terrific jump in revenue and earnings over the past year. Note that this market for AI chips is at the beginning of a huge growth curve. Nvidia's rival Advanced Micro Devices estimates that the market for AI accelerators could jump to $400 billion in 2027, a big jump from last year's estimate of $45 billion. Citi analysts expect Nvidia to maintain a giant 90% share of this market over the next two to three years, despite the efforts its rivals are making to cut Nvidia's lead in this market. That's because Nvidia has doubled down on the pace of innovation in AI chips, which should help it maintain a solid share of this market in the long run. As such, the possibility of Nvidia indeed generating $300 billion in annual revenue from AI chip sales after five years cannot be ruled out. It can hit that mark even if its share falls to 75% -- as Rakesh suggests -- considering that the overall AI chip market size is anticipated to hit $400 billion as per AMD's estimates. The good news is that Nvidia is looking to flex its muscles beyond the AI accelerator market. The company recently revealed new consumer-focused graphics cards people can use to run AI applications right on their desktops and laptops for gaming, creating large language models (LLMs), customizing generative AI models, and even inferencing applications. For instance, Nvidia claims that its new RTX 4080 Super graphics card \"generates AI video 1.5x faster -- and images 1.7x faster -- than the GeForce RTX 3080 Ti GPU.\" Given that the demand for devices that can run AI at the edge -- such as smartphones, personal computers, and cameras -- is expected to clock annual growth of 26% through 2032 and generate $143 billion in annual revenue at the end of the forecast period, Nvidia is doing the right thing by tapping this market early. Also, considering the other notable catalysts that Nvidia could benefit from, it won't be surprising to see the company's top line head closer to $300 billion after five years. If that's indeed the case, investors can expect the stock to deliver outstanding gains once again over the coming five years. Nvidia has a five-year average price-to-sales ratio of 20. As we are assuming that the company's revenue growth over the next five years can match the rate it has clocked in the past five, we can expect Nvidia to maintain its average sales multiple over the next five years as well. Based on a top line of $300 billion after five years, a sales multiple of 20 points toward a market cap of a whopping $6 trillion. That would be way higher than Nvidia's current market cap of around $1.35 trillion. However, Nvidia carries a discounted forward price-to-sales ratio of 14. Assuming a similar multiple after five years means that its market cap could increase to $4.2 trillion using the $300 billion revenue estimate. Again, that points toward a 3x jump in Nvidia's stock price over the next five years. All this indicates that investors can expect Nvidia to jump substantially over the next five years and multiply their investments once again, making it a top growth stock to buy right now. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  Citigroup is an advertising partner of The Ascent, a Motley Fool company. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy. Where Will Nvidia Stock Be in 5 Years? was originally published by The Motley Fool Related Quotes "
}