{
    "title": "Up 239%! Should I buy more Nvidia stock in 2024?",
    "date": "1/7/2024",
    "url": "https://www.fool.co.uk/2024/01/07/up-239-should-i-buy-more-nvidia-stock-in-2024/",
    "text": "Nvidia stock took off in 2023 as its products proved integral to the generative AI boom. Has this left the shares horribly overvalued? The content of this article was relevant at the time of publishing. Circumstances change continuously and caution should therefore be exercised when relying upon any content contained within this article. Image source: NVIDIA When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. Last year, Nvidia (NASDAQ: NVDA) stock rose almost as quickly as ChatGPT rattles off a sonnet. It ended the year at $495, up from $146 at the start. That was a staggering 239% gain! The conventional wisdom is that this epic rally has left Nvidia shares grossly overpriced. But has it? There’s a war going on out there in AI, and Nvidia is the only arms dealer. Graphics processing units (GPUs) carry out multiple computations simultaneously, making them ideal for training artificial intelligence (AI) and deep learning models. With approximately 80% share of the AI chip and associated software market, Nvidia is guiding for full-year revenue of $59bn. That would be an incredible 118% increase over last year. Meanwhile, annual profits are set to quadruple. Based on forecast earnings for FY 2025 (starting February), the stock is trading on a forward price-to-earnings (P/E) ratio of 24. That’s cheaper than peers Intel (24.9) and Advanced Micro Devices (36). This is due to its far higher rate of growth. A forward-looking P/E multiple of 24 for a company powering the AI revolution doesn’t look excessive to me. For perspective, it’s the same as McDonald’s. Moreover, the price-to-earnings growth (PEG) ratio, which factors in the firm’s anticipated five-year rate of growth, is 0.5. For context, the S&P 500 index currently has a PEG ratio of around 1.5. This suggests the stock might even be undervalued. Of course, these metrics rest upon forecasts. Something could always throw a spanner in the earnings. Sanctions, for example. The ongoing battle for technological supremacy between the US and China is well-documented. And Nvidia is already banned from exporting its higher-end chips to Chinese customers. China accounted for 21% of Nvidia’s revenue last year (FY 2023). The worst-case scenario is a complete ban on supplying products to this market. While that’s a concern, I don’t think it would be disastrous considering how big the global AI industry could eventually become. But it’s still worth pointing out. Nvidia puts its total addressable market (TAM) at $1trn. Here’s how it breaks that down. It’s generally wise for investors to take TAM projections with a large pinch of salt. Generally, that is, but not always. Nvidia was founded on the belief that a future of accelerated computing would rest upon GPUs. This is happening and nearly every blue chip around is partnering with it. So it’s plausible the firm might also be right about the size of these various markets. More importantly, the company has a tremendous record of execution to seize such opportunities. It’s one thing to identify huge growth markets, another to actually grasp them with both hands. Therefore, it wouldn’t surprise me if Nvidia’s products power multiple future industries like cloud gaming and autonomous vehicles. And I expect more businesses to rent use of the firm’s ‘AI supercomputer in the cloud’. CEO Jensen Huang estimates that $1trn of installed global data centre infrastructure will transition from general-purpose to accelerated computing as companies apply generative AI into every product and service. Given this tantalising prospect, I’m looking to add to my holding in 2024, ideally on share price weakness. Then I’ll keep my shares for the long term.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Ben McPoland has positions in McDonald's and Nvidia. The Motley Fool UK has recommended Nvidia. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 25 March, 2024 |\n        Alan Oscroft We have a good dividend yield, and a new share buyback, even in a down year. It make me think… Read more » 25 March, 2024 |\n        Jon Smith Jon Smith notes down two dividend shares from the FTSE 250 that have dividend yields around 5% and relatively low… Read more » 25 March, 2024 |\n        Jon Smith Jon Smith outlines a FTSE 250 stock from the financial services sector that has a dividend forecast almost double the… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Teladoc Health's had a pretty rough ride over the last two years and now trades close to 2016 levels. But… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc The FTSE 250 is leading the charge among UK indexes, rising by double-digits in the last six months. But this… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Zaven Boyrazian breaks down two dividend shares that have rewarded shareholders with higher payouts for more than 25 years. Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Rolls-Royce shares have almost tripled in the last 12 months, but can this upward trajectory propel the stock above £5… Read more » 25 March, 2024 |\n        Zaven Boyrazian, MSc Around 25% of the FTSE 350 offers market-beating dividend yields! But which ones are sustainable in the long run? Zaven… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}