{
    "title": null,
    "date": "1/29/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36828456/nvidia-surge-echoes-ciscos-1990s-run-more-upside-before-it-crashes-if-it-crashes-to",
    "text": "Wall Street analyst Ed Yardeni is drawing parallels between Nvidia Corp.‘s NVDA current stock market rally and Cisco Systems Inc.‘s CSCO meteoric ascent during the 1990s tech bubble. Nvidia could potentially soar even higher before facing any risk of a downturn—if such a risk materializes at all, Yardeni said. What Happened: Nvidia’s stock value continues to surge as the market grapples with a critical question: Are we on the verge of another bubble, or is this the ascent of a sustainable technological boom? Since the introduction of ChatGPT by OpenAI on Nov. 30, 2022, Nvidia — the leading manufacturer of AI chips — has seen its stock soar by an astounding 265%. This surge has outpaced the S&P 500 Semiconductor Index’s 108% gain over the same period. The growth trajectory, as Yardeni showed, shows a sharp upward trend. It’s reminiscent of Cisco’s eightfold increase before its eventual crash in the early 2000s. “Is Nvidia today's Cisco? It's possible. If so, then it has a lot more upside before it crashes—if it crashes,” Yardeni wrote. Chart: Nvidia 2022-2024 vs. Cisco 1998-2000 According to Yardeni, Federal Reserve Chair Jerome Powell, having closely examined the tenure of his predecessors, including Paul Volcker, aims to quell inflation potentially without inducing a recession. This delicate balance has led to a market expectation of interest rate cuts, as the fight against inflation shows signs of victory. Read Also: Goldman Sachs Debunks AI Bubble Fears: Why It’s Not The Next Dot-Com Disaster Why It Matters: The memory of former Fed Chair Alan Greenspan‘s 1996 warning of “irrational exuberance” is still fresh. And the possibility of asset bubbles forming is a concern that cannot be ignored. The staggering $6 trillion parked in money market mutual funds represents a vast pool of liquidity that could flood into stocks and bonds. This could potentially ignite a melt-up in the markets if interest rates are slashed, Yardeni says. If Powell and his team prematurely bask in the triumph of curbing price inflation without a recession, all while cutting interest rates, they may inadvertently stoke asset inflation. Such a scenario could inflate a bubble that, upon bursting, would likely precipitate a recession. Nvidia’s fate in the coming months or years may well signal whether we are on the cusp of a groundbreaking epoch driven by growing productivity thanks to the AI revolution, or merely the reflection of a historical bubble. “The Fed's next big mistake could be inflating a speculative stock market bubble. Powell must know that. If so, then he should reiterate that he is in no rush to lower interest rates,” Yardeni stated. Read Now: Microsoft Races To The Top, Hits $3-Trillion Valuation, Challenges Apple’s Throne Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}