{
    "title": "Wall Street Brunch: Nvidia - That's It",
    "date": "2/18/2024",
    "url": "https://seekingalpha.com/article/4671281-wall-street-brunch-nvidia-thats-it",
    "text": "Flavio Coelho/Moment via Getty Images  Flavio Coelho/Moment via Getty Images Listen below or on the go on Apple Podcasts and Spotify  Nvidia is due for the most important earnings report in years. (0:15) Walmart reports results ahead of stock split. (2:05) How do the biggest modern bubbles look today? (4:59) The top story to look out for this week Chipmaker Nvidia (NVDA) will release its much-anticipated earnings report on Wednesday. The Goldman Sachs cross-asset sales team calls it “arguably the most important single stock earnings print in years” and note the 11% implied move means the “quantum of market cap priced for gain or loss is equivalent to stock number 37 in the SP500” at more than $200 billion. Sentiment is red hot and has boosted other semiconductor names, especially those leveraged to AI. The question is whether the numbers will justify the buying binge that vaulted Nvidia over Amazon (AMZN) and Alphabet (GOOG) last week to become the third-biggest company by market cap – behind only Microsoft (MSFT) and Apple (AAPL). The consensus estimates are for revenue of $20.4 billion and EPS of $4.57, but both marks have been trending higher as revisions pile in. BofA says that apart from the numbers, investors may begin to focus on the company's flagship GPU Tech Conference on March 18-21 where it is likely to showcase its pipeline and perhaps update the prior $250 billion annual AI accelerator total addressable market forecast The sell side continues to gush over the stock. Loop Capital initiated coverage with a Buy rating and a Street-high price target of $1,200. That’s about 60% upside from current levels and tops the target of $1,100 Rosenblatt Securities issued late last year. Analyst Ananda Barush says the company is likely to see \"material upside\" to consensus estimates for 2024, 2025 and 2026. Seeking Alpha analyst Christopher Robb says Nvidia's ability to deliver on promises and exceed expectations, coupled with an unprecedented competitive advantage, means this stock can likely continue rallying despite high valuation risk. Also weighing in is Walmart (WMT), which will report Tuesday. The company is forecast to report revenue of $169.3 billion, operating profit of $6.74 billion, a gross margin rate of 23.3%, EPS of $1.64 and free cash flow of $8.58 billion. Expectations are for continued offsetting of the impact of moderating inflation benefits with traffic and unit gains. UBS expects Walmart to finish 2023 on a strong note, despite the topsy-turvy spending backdrop throughout the holiday quarter. They says the stock may look even more compelling to investors as several macro uncertainties weigh on retail in the year ahead, such as the uncertain health of the U.S. consumer, food disinflation, wavering demand for general merchandise, the distraction of the U.S. elections and the elevated interest rate environment. Walmart also has a three-for-one stock split that will become effective at the close of trading on Friday. Among other major earnings reports, Tuesday brings Home Depot (HD), and Palo Alto Networks (PANW). Etsy (ETSY) and Marathon Oil (MRO) are out Wednesday. Moderna (MRNA) and Wayfair (W) release numbers on Thursday. And Friday sees Warner Bros. Discovery (WBD). The economic calendar is pretty empty in the holiday-shortened week. But Wednesday afternoon brings the minutes of the latest Fed meeting. Following hot PPI and CPI numbers last week, fed funds futures have now moved the likelihood of the first rate cut out to June and a quarter-point cut isn’t fully price in until December. Economist Steven Blitz of GlobalData T.S. Lombard says the PPI followed the “economy's upturn that began mid-23” and the Fed will run out of room to push our rate cuts if growth continues and pulls up inflation.” “Forwards would eventually flatten the curve or flip it back positive” and the questions becomes whether the communication shifts to hikes, he added. Former Treasury Secretary Larry Summers said Friday there was a 15% the next Fed move is a hike. But Wells Fargo economists note that the market “will get three more PCE prints between now and May 1” and “look for PCE inflation to recede further in coming months, which we think will induce the FOMC to cut its target range for the federal funds rate by 25 bps on May 1.” “That said, we readily acknowledge that the risks to our Fed view are skewed toward remaining on hold for longer than we forecast if PCE inflation does not recede as much as we currently anticipate.” Stocks are coming off the first down week in the last six. Societe Generale’s cross-asset management team notes that “Global equities are just 2% off their all-time highs, while developed market equities are already at new highs driven by the S&P 500.” The say the “rally in global equities has so far been driven more by rational optimism than irrational exuberance” and note that applying dot-com peak math, the S&P 500 would have to reach 6,250 to price in the same level of irrational exuberance. And in the Wall Street Research Corner BofA Securities looked at the most prominent market bubbles in modern history and compared them to what they categorize as today’s bubble -- the Magnificent 7 stocks. That’s AMZN, APPL, GOOG, META, MSFT, NVDA and TSLA. In his weekly Flow Show note, strategist Michael Hartnett says while no bubbles are alike, there are ways to gauge the Mag Seven group -- comparisons in catalysts, price, valuation and the price of money. Bubbles have been driven by technological advances, new geographical sources of growth and central bank easing. The AI bubble was started by the Fed’s response to Silicon Valley Bank and ChatGPT, similar to what the Plaza Accord did to Japan, the Long-Term Capital Management collapse to the internet, the attack on Sept. 11, 2001, to the housing bubble of the 2000s, and the Covid pandemic with $30 trillion of policy stimulus to cryptocurrency. “Even (THE) Mississippi and South Sea Company bubbles [were] caused by amendment to English usury laws in 1714.” The Magnificent Seven had a 140% gain over the past 12 months, closing in on a 180% rise in the Dow Jones in 1920, and 150% for both Nifty Fifty in the 70s and Japan stocks in the 80s, “but not quite the 190% gain of internet bubble, nor the 230% surge in the FAANG stocks from the Covid lows,” Hartnett added. On P/E, the Mag 7 “ain’t cheap, but [it is] true that bubble highs have seen dafter valuations.” And the direction of the bond yields is a key bubble metric since the “abnormality\" of the bubble infects other assets and the economy. In 12 out of 14 observed bubbles, bond yields rose as the bubble reached a peak or pops. Given significantly higher levels of global debt today, versus history, 10-year real rates, (which are) currently 2%, will likely need to rise to 2.5-3% to end the AI, and Magnificent 7 mania,” he added. This article was written by "
}