{
    "title": "Nvidia gets boost from Morgan Stanley amid rising AI demand (NVDA)",
    "date": "2/7/2024",
    "url": "https://seekingalpha.com/news/4063817-nvidia-gets-boost-morgan-stanley-rising-ai-demand",
    "text": "I-HWA CHENG/AFP via Getty Images Nvidia (NASDAQ:NVDA) had its price target boosted at Morgan Stanley on Wednesday as the investment firm sees further gains in artificial intelligence to come for the semiconductor giant. Analyst Joseph Moore, who has an Overweight rating on Nvidia, raised his price target to $750 from $603, implying roughly 10% upside from current levels as a number of short-term data points suggest even more upside over the next two to three quarters. \"Near term GPU cloud instances remain very tight, as developers are telling us there are still long waiting lists to train models,\" Moore wrote. \"Developer contacts tell us that they are still having to wait months to train; though those wait times are coming down, they are still long, and speak to high profits in provisioning GPUs in cloud.\" Moore continued: \"[C]loud service providers are about half of NVIDIA data center demand, and as long as GPU deployments have an immediate payoff, demand is likely to remain strong.\" Moore also upped his estimates for 2024 and 2025, as he now expects full-year data center revenue to be $88B in 2024, up from a prior view of $80B and $46.7B in 2023. He expects 2025 data center revenue to be \"up slightly\" from 2024 with the company seeing some decline in margins. Cloud service providers are looking for alternatives to Nvidia's H100 and B100 offerings, including AMD's (AMD) MI300 and Intel's (INTC) Gaudi 2, but it's still Nvidia's game for now, Moore said. \"We continue to hear anecdotes about various cloud customers that might be deferring shipments of certain products, but every time we chase them down, we are told that demand remains very good, but that it is hard to build out these ecosystems as rapidly as the NVIDIA supply chain is growing,\" Moore wrote. Nvidia shares slipped in premarket trading but have gained 41% since the start of the year and more than 200% over the past 12 months. "
}