{
    "title": null,
    "date": "2/11/2024",
    "url": "https://seekingalpha.com/article/4669339-nvdx-complement-your-nvidia-total-return-with-these-two-strategies",
    "text": "Bloomberg/Bloomberg via Getty Images Bloomberg/Bloomberg via Getty Images Investors in Nvidia Corporation (NVDA) are flying high on total one-month and one-year returns of +35% and +210% as I write this. Longer-term bulls have enjoyed +15,450% over the past decade! The only problem is that such high-momentum stocks can frighten off the average investor - even though, ironically, studies like this have shown that they're not necessarily any riskier than value stocks BUT that there's an expectation of greater gains, and the resulting perception plays a major role in how an investor views a value stock versus a momentum stock: For example, Choi and Robertson (2020) directly ask a representative sample of U.S. individuals about how well academic theories describe their financial beliefs and decisions. They confirm that value stocks are viewed as safer, and momentum stocks, but not value stocks, are expected to yield higher returns. However, unlike our professionals, individuals associate momentum stocks with higher risk. This might explain the contrarian trading behavior of individual investors (Grinblatt and Keloharju, 2000, Kaniel et al., 2008). In an interesting article by Jim Taylor Ph.D. on the Psychology Today website titled \"Perception is Not Reality\", this stood out for me: Perception is not reality, but, admittedly, perception can become a person's reality (there is a difference) because perception has a potent influence on how we look at reality. So, under the assumption that, as individual investors, perception is our interpretation of reality, which then becomes our reality, there is clearly more perceived risk in momentum stocks over value stocks. So, how can we mitigate this risk that we perceive? And that's essentially my thesis: using strategies to maximize your NVDA gains with options as well as leveraged ETFs such as T-Rex 2X Long NVIDIA Daily Target ETF (BATS:NVDX), when done the right way, can not only amplify the gains but also increase your margin of safety and put you in a position to withstand harsher market corrections and volatility. The premise here is that NVDA itself, the underlying asset, is currently on a price action rampage, seemingly defying every bear thesis being thrown at it. From a practical standpoint, one way is to hedge your investments in momentum stocks like NVDA is by selling OTM put options to maximize your returns. While this is not strictly a hedging strategy in the traditional sense, it does give you higher gains. And, in the event that the stock corrects downwards after earnings, it provides an additional margin of safety. We've seen that type of correction happen a couple of times; more recently, right after Q3 2024 earnings were announced in November 2023. Seeking Alpha Seeking Alpha Since the premise here is that you're already long NVDA, you wouldn't mind acquiring additional shares at a lower price, which brings down your cost basis. Should the strike price be breached before the contract expires, you're obligated to buy at that price, but less the premium you received when writing the option. This does not account for fees, of course, but it would still lower your cost basis. In a more positive scenario, you simply pocket the premium, thereby complementing the total return on your original NVDA holding. So, what you're potentially doing with each options contract is slowly expanding the spread between your cost basis and your total return to date - pushing the one down and boosting the other with essentially both sides of a single trade! The best part is that you can keep doing this over and over to maximize your gains - on top of the appreciation of the original holding itself. The downside to this strategy is that options are typically meant for more seasoned investors who are familiar with the inherent risks of options trading. Besides, you have to be long the stock in the first place unless you're in it just for the contract premia. That's a viable play, too, and it's definitely less risky than the next strategy, which exposes you to greater risks but also holds the possibility of greater potential returns - if you play it right, and that's a major caveat. While I don't necessarily condone this strategy due to the level of knowledge and care it requires to do it successfully over and over, this particular options play is relatively simple, and you only need to be slightly out of the money to make a decent return. For example, the Feb 16 put contracts have a bid of $11.85 against the $715 strike price against an as-of-right-now pre-market price of $721.33. If the stock moves up from there, you pocket the premium when the contract expires; if it drops to your strike price, you're getting it for $71,500 less your premium of $1,185. Of course, your trailing stop loss will give you a measurable amount of downside protection below your strike price, too. All that's remaining is to rinse and repeat multiple times while NVDA keeps zooming upward. To maximize your gains and thereby reduce the quantum of any downside risk, you can consider a leveraged ETF like NVDX. However, this calls for a full warning. Leveraged ETFs such as NVDX are NOT designed to be long-term investments, and for several reasons: While the leverage enhances your gains, it equally enhances possible losses. In other words, the 2X leverage works both ways. These ETFs are reset on a daily basis, the goal being to generate 2X the gains of the underlying security on every single trading day. The risk here is high, as you can see. If the stock moves up 5%, the 2X ETF should ideally move up by 10%; if the stock declines 5%, your ETF's value drops by 10%. Logically, that looks equal, but it is most certainly not. As an example, losing $10 on a $100 investment, or 10%, means that investment needs to go up by more than 10% just to recoup that loss - and that's not including brokerage fees or management fees for the fund itself. At $90, your gain-to-recovery would be 11.11%, not 10% - and even higher due to the expense ratio and fees. To elaborate further, a 50% loss would require a 100% gain to get back to the starting point, and you'd still be out the fees and expenses, not to mention the short-term capital gains tax liability. In other words, it would take much greater gains to offset any losses, making this a very risky long-term holding when the underlying asset is volatile. Since NVDA's beta is currently at 1.72, there's greater volatility drag causing decay. A leveraged ETF decays due to the compounding of your returns and because these ETFs typically seek to outperform the underlying asset for a single trading day. Holding them for longer periods, therefore, increases the risk of decay and significantly reduces your potential return because of that volatility drag. Yet another risk is liquidity. Leveraged ETFs are usually lightly traded in comparison to traditional ETFs, which means it might be hard to exit a large position quickly. That means you need to carefully consider the size of your position in relation to the ETF's average trading volume. With NVDX, for instance, the average daily traded volume for the past two-month period (65 days, to be exact), is 190,098, which adds to your risk. Statement from the Office of Investor Education and Advocacy: Yet another layer in this 'risk onion' is a statement from this division of the SEC that warns investors of the added risk factor for single-stock leveraged ETFs. In essence, it says that ETFs such as NVDX (although that's not made explicit, of course) lack diversification benefits, and amplify both volatility and risk. Despite the many risks outlined above, NVDX gives investors the opportunity to generate additional alpha on top of their core total return on NVDA. Speculators might also be interested because it involves a much lower up-front cost: for instance, 100 shares of NVDA would set you back $69,641, not including your transaction fees. A comparable purchase of NVDX would only cost you $6,352, again not inclusive of fees and expense ratio. At 1,000 shares of NVDX, that would be $63,352 under the same cost structure. Of course, your total return on the NVDX investment isn't going to be a firm 2x of the underlying stock's gains, but a 10% return on the underlying on a particular day should theoretically yield 20% - when the stock has steady and strong upward momentum. Per Seeking Alpha data, NVDA has a price performance of about 56% on a six-month basis and still a very strong 50% on a three-month basis, which indicates a good amount of strength and stability in its momentum. That's a sign that this could be a good time to make a play with NVDX, but only if you're fully cognizant of the risks I've outlined above. Seeking Alpha Seeking Alpha Another way to validate your intended leveraged play is the daily up/down volume indicator, which tells you how many trading days in a given period showed positive versus negative momentum. In the YTD period, we've seen 21 of 28 trading days showing net price increases. If you'll notice, red days are not only a lot fewer but also smaller in quantum compared to the price increases on green days. In such a scenario, playing the NVDX leveraged ETF strategy a few days at a time should typically lead to strong returns despite the expense ratio and fees, and the inevitable short-term capital gains tax this additional income will come attached with. The ideal way to protect yourself from volatility drag is to use a trailing stop loss at a level you're comfortable losing. The advantage of such a stop loss is that it lets you take advantage of strong green days but keeps increasing the stop loss to match the increase in price, allowing you to set a loss percentage you're comfortable with and not worry that a conventional stop loss could still affect you badly should the strong momentum suddenly reverse and things take a turn for the worse. Even so, that would only be a bad thing if you don't want to own NVDA at any price or your ideal fair value is far far below the current level. For bulls who are confident of the share's trajectory based on the company's performance, it's the benefit of an even lower cost basis. Although this analysis focuses a lot on the risks of such a strategy, with a stock like NVDA that's showing strong positive price action for a prolonged period, you want to quickly maximize your gains and build a wider margin of safety for your original holding. Any contracts that you're obligated to fulfill only help reduce your cost basis and acquire the stock at a lower price point, and if you use a parallel buy the dip strategy alongside this leveraged ETF play, you can quickly secure your investment and be prepared for the inevitable correction. With another 7 trading days to go before earnings are out for NVDA on Feb 21, 2024, you can experiment with this strategy - a couple of buy and sell trades that involve holding NVDX for 2-3 days per cycle. But please do note that momentum has tended to be higher heading into earnings, so the results of any experiment you choose to run right now may not translate into similar results at other times of the earnings calendar. The momentum is strong for now but that could be the market's anxiousness (or anxiety?) to see what the announcement brings. My final warning here is to exit all positions prior to earnings because there's definitely a chance that any signs of weakness in this quarter's report are likely to render our NVDX play too risky. If you're confident that NVDA's bull run is far from over, you can resume replicating this strategy once any post-earnings turmoil settles down and there are clear indications that the stock has resumed its upward march. I'm rating this ETF a Buy, but I trust that investors will treat this as a very short-term holding of a maximum of a few days at a time. Good luck, and to add a leveraged ETF twist to an old greeting, 'many happy returns of the day!' This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}