{
    "title": "Missed Out on Nvidia? 2 Soaring Artificial Intelligence (AI) Stocks to Buy \nInstead",
    "date": "2/10/2024",
    "url": "https://finance.yahoo.com/news/missed-nvidia-2-soaring-artificial-094500043.html",
    "text": "Generative artificial intelligence (AI) is the hottest investment megatrend in recent memory, and few companies have benefited more than Nvidia, which supplies the hardware needed to train and run these applications. But there are other ways to bet on the opportunity. Let's look at two of them and explore why Super Micro Computer (NASDAQ: SMCI) and Meta Platforms (NASDAQ: META) could also have places in your investment portfolio. While less well known than Nvidia, Super Micro Computer has been one of the biggest beneficiaries of the AI opportunity. Shares have already risen 133% in 2024, capping off a gain of almost 700% over the last 12 months. And the company's stellar earnings suggest it isn't too late for investors to bet on its continued success. Super Micro's second-quarter revenue roughly doubled year over year to $3.66 billion amid surging demand for its enterprise-level computers, used for data centers, websites, and, most importantly, hosting AI algorithms. The company is hugely optimistic about the sustainability of this new core growth driver, with CEO Charles Liang claiming AI could have a bigger impact than the Industrial Revolution as it spreads to more industries like autonomous driving, education, and healthcare. The future of AI tech remain to be seen. But Super Micro is a particularly good way to bet on the industry because of the company's focus on hardware, which shields it from some of the competition and risks involved in creating consumer-focused software in an increasingly crowded market. Meta Platforms is a much larger company than Super Micro, but it is also capable of impressive growth, with shares already up around 30% year to date. While the social media giant has pivoted away from metaverse development to focus on AI, investors shouldn't lose sight of how the two opportunities could synergize over the long term. Meta's approach to AI development has been somewhat unconventional. The company is working on Llama, a large language model (LLM) similar to the technology behind OpenAI's ChatGPT, which will be capable of creating chatbots and other generative AI applications. However, unlike competitors, Meta has made its software open source and free for developers to use and modify to build their own programs. Meta's open-source AI strategy undermines the market for rival software from Alphabet and Microsoft and could help its Llama LLM rapidly gain market share as a way to create the next generation of AI apps. To be fair, it is still unclear how Meta plans to monetize its AI investments. However, the technology could have uses in the company's other core growth initiative: the metaverse. Generative AI is already capable of creating realistic dialogue and images. And as the technology improves, AI could be used to create practically limitless amounts of immersive content for the company's virtual reality (VR) experiences. As time goes on, AI-related hype will probably die down, and companies that benefited from the surge of investment capital will have to demonstrate sustainable operational improvements to justify their stock gains. For Super Micro, this task looks easier because it focuses on the less risky \"picks and shovels\" side of the AI industry, supplying the tools other enterprises need to build and run their applications. Meta Platforms will likely face more risk as it develops generative AI software in an incredibly competitive field. That said, the new tech could synergize with its metaverse development, giving the company an edge. Should you invest $1,000 in Super Micro Computer right now? Before you buy stock in Super Micro Computer, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Super Micro Computer wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 5, 2024 Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool recommends Super Micro Computer. The Motley Fool has a disclosure policy. Missed Out on Nvidia? 2 Soaring Artificial Intelligence (AI) Stocks to Buy Instead was originally published by The Motley Fool Related Quotes "
}