{
    "title": "Keysight (KEYS) Unveils 6G Neural Receiver Testing Solution",
    "date": "2/19/2024",
    "url": "https://finance.yahoo.com/news/keysight-keys-unveils-6g-neural-163700526.html",
    "text": "Keysight Technologies Inc. KEYS introduced a comprehensive training and validation solution for neural receivers in collaboration with NVIDIA Corporation NVDA. The cutting-edge 6G neural receiver design flow offers advanced tools and insights to facilitate the seamless integration of AI capabilities into mainstream wireless communication networks. Although 5G incorporates AI to improve certain components of wireless networks, 6G will be the first generation of wireless technology that is AI based.However, the performance assessment of neural receivers in end to end system is challenging, owing to the lack of availability of data required for their training. Prior to commercial deployment, it is crucial to train the neural receivers properly in order to outmatch the performance of legacy receivers. Keysight leverages the NVIDIA Sionna library to generate site-specific training data and develop digital twins of real-world networks.Post training completion, the neural receiver is deployed within an open RAN testbed. Keysight PROPSIM channel emulator is utilized in the process to emulate site specific channels. The channel emulator platform offers the industry’s widest signal bandwidth and effectively addresses the testing complexities associated with the launch of innovative technologies for a wide range of use cases, such as 5G, WIFI and advanced communication systems.The solution ensures the smooth incorporation of ray-traced channel impulse responses. Following this, the trained neural receiver undertakes the task of demodulating the signal. The process ensures efficient evaluation of the end-to-end system’s block error rate, which provides vital information into the performance of the neural receiver. This is a significant leap forward toward Keysight’s goal of replacing the human-designed receive chain of physical layers with site-specific neural receivers.The global 6G market is expected to gain solid market traction in the upcoming years. The introduction of this innovative natural receiver evolution technology will bolster Keysight’s portfolio and position it to capitalize on the significant market potential.Keysight boasts a robust 5G portfolio. Its 5G product design validation solutions, ranging from Layer 1 to 7, enable telecom and semiconductor companies to accelerate their 5G initiatives. Apart from strength in the 5G domain, the company is expected to benefit from the growing proliferation of electronic content in vehicles, momentum in space and satellite applications and rising adoption of driver-assistance systems globally.The company is gaining traction with strong industry-wide growth. It is witnessing solid adoption of its electronic design and test solutions. Electronic devices form the fulcrum of IoT services, wireless devices, data centers and 5G technologies. The rapid adoption of these devices is increasing demand for electronics testing equipment. It has lost 16.5% over the past year compared with the industry’s decline of 9.7%. Image Source: Zacks Investment Research Keysight currently carries a Zacks Rank #3 (Hold). InterDigital, Inc. IDCC, carrying a Zacks Rank #2 (Buy) at present, delivered a trailing four-quarter average earnings surprise of 170.50%. In the last reported quarter, it delivered an earnings surprise of 16.53%. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.IDCC is a pioneer in advanced mobile technologies that enable wireless communications and capabilities. The company engages in designing and developing a wide range of advanced technology solutions, which are used in digital cellular as well as wireless 3G, 4G and IEEE 802-related products and networks.Arista Networks, Inc. ANET, carrying a Zacks Rank #2 at present, is likely to benefit from strong momentum and diversification across its top verticals and product lines. The company has a software-driven, data-centric approach to help customers build their cloud architecture and enhance their cloud experience. Arista has delivered an earnings surprise of 13.28%, on average, in the trailing four quarters.The company holds a leadership position in 100-gigabit Ethernet switching share in port for the high-speed data center segment. It is increasingly gaining market traction in 200 and 400-gig high-performance switching products and remains well-positioned for healthy growth in the data-driven cloud networking business with proactive platforms and predictive operations Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report InterDigital, Inc. (IDCC) : Free Stock Analysis Report Arista Networks, Inc. (ANET) : Free Stock Analysis Report Keysight Technologies Inc. (KEYS) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}