{
    "title": "Softbank founder reportedly aims to raise $100 billion to build AI chip \ncompany that would rival Nvidia — Project ...",
    "date": "2/17/2024",
    "url": "https://www.tomshardware.com/tech-industry/artificial-intelligence/softbank-founder-reportedly-aims-to-raise-dollar100-billion-to-build-ai-chip-company-that-would-rival-nvidia",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Softbank will allegedly set up an AI processor company to complement Arm. Masayoshi Son, the founder of SoftBank Group, plans to raise $100 billion for a new chip venture called Project Izanagi, aiming to rival Nvidia in artificial intelligence processors, reports Bloomberg, citing sources with knowledge of the matter. Son envisions this initiative as contributing to the development of artificial general intelligence (AGI), leading to a future where machines surpass human intelligence. The project seeks to complement SoftBank’s Arm Holdings, which designs processor architectures. But it is unclear whether the AI processors designed by Project Izanagi will rely on technologies such as instruction set architecture (ISA) developed by Arm. Furthermore, how the venture will co-exist with Arm’s purported plans to create reference chip designs for various workloads remains to be seen. An interesting wrinkle is that the venture is named after the Japanese god of creation and life, reflecting Son’s ambitious vision for the project. Building a company that could compete against Nvidia successfully is challenging. The green company not only has plenty of talented hardware engineers and highly competitive hardware, but it also has a ubiquitous CUDA software stack. It is tough to compete against something that has been evolving for well over 16 years now. Project Izanagi is part of Son’s broader focus on AGI, which he believes will be realized within the next decade. He has consistently advocated for adopting AI, leading to a safer, healthier, and happier world. Son’s enthusiasm for AGI is intense, to say the least, despite facing numerous setbacks in his startup investments. He told a group of Japanese enterprise clients to embrace AI or risk being left behind, emphasizing the transformative potential of AGI. “AGI is what every AI expert is after,” Son is reported to have said by Bloomberg. “But when you ask them about a detailed definition, a number, the timing, how much computing power, how much smarter AGI is than the human intelligence, most of them don’t have an answer. […] I have my own answer: I am convinced AGI will be real in 10 years.” SoftBank’s financial position is strong, with ¥6.2 trillion ($41 billion) in cash and cash equivalents as of December 31. According to the report, Son intends to invest $30 billion from SoftBank, with the remaining $70 billion potentially sourced from Middle Eastern institutions. The specifics of the funding and execution are still being determined, and the project may evolve further as plans solidify, according to Bloomberg. Son’s approach to investment is dynamic, and he is known for abruptly changing his mind. The initiative is separate from any collaboration with OpenAI’s Sam Altman, although Son and Altman have reportedly discussed joining forces in semiconductor manufacturing. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Anton Shilov is a Freelance News Writer at Tom’s Hardware US. Over the past couple of decades, he has covered everything from CPUs and GPUs to supercomputers and from modern process technologies and latest fab tools to high-tech industry trends. Samsung to launch AI chips to challenge Nvidia, others — 'Mach 1' chips to launch in early 2025 AI startup Extropic emerges from stealth with superconducting processors it boldly claims will beat GPUs, CPUs, and TPUs US chip toolmakers skip Semicon China conference they sponsored amid ongoing trade war By Aaron KlotzMarch 21, 2024 By Brandon HillMarch 21, 2024 By Zhiye LiuMarch 21, 2024 By Aaron KlotzMarch 21, 2024 By Anton ShilovMarch 21, 2024 By Mark TysonMarch 21, 2024 By Christopher HarperMarch 21, 2024 By Andrew E. FreedmanMarch 21, 2024 By Aaron KlotzMarch 21, 2024 By Christopher HarperMarch 21, 2024 By Mark TysonMarch 21, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}