{
    "title": null,
    "date": "2/4/2024",
    "url": "https://finance.yahoo.com/news/wall-street-favorites-3-semiconductor-150000064.html",
    "text": "The artificial intelligence (AI) craze of 2023 fomented a surge in many semiconductor stocks, even those not directly contributing to the rise of generative AI models. In 2024, I believe there will be a continued focus on chipmakers who can take advantage of this burgeoning market. Wall Street, of course, prefers some semiconductor stocks over others. Below are three semiconductor stocks with Strong Buy ratings. Source: Evolf / Shutterstock.com Nvidia (NASDAQ:NVDA) stock was one of the best-performing names of 2023, with a staggering gain of around 240%. This year is already off to a good start. The GPU maker’s shares have risen 28% since the start of trading in January. The company, as many already know, has been riding high on the booming demand for its AI solutions. Nvidia dominates in both gaming GPUs and AI chips. Nvidia had an 81% market share of AI chips used in cloud and data centers. Moreover, despite a lack of access to China’s huge market, Nvidia has turned to another growing economy: India. Recently, Nvidia announced a $1 billion deal to provide India-based companies with its AI chips. Some of these Indian companies include staple conglomerates like Tata Group and Reliance Industries, both of which are focusing on large language models and cloud infrastructure. InvestorPlace - Stock Market News, Stock Advice & Trading Tips The chipmaker still has a lot of room to grow and remains a good bet for 2024. Source: JHVEPhoto / Shutterstock.com Advanced Micro Devices (NASDAQ:AMD) is another chipmaker behemoth set to enter the AI market in 2024. The fabless chipmaker initially made a name for itself after it dethroned Intel (NASDAQ:INTC) in the CPU market. AMD is now poised to challenge and siphon market share away from Nvidia, its prime competitor in the GPU chip market. In the second half of 2023, the chipmaker announced it expected to sell $2 billion in AI chips in 2024. As a follow-up, AMD unveiled the Instinct MI300X accelerator and the Instinct M1300A accelerated processing unit (APU) in December, which will work to train LLMs. AMD also released the specs for its new Ryzen gaming GPU and announced the Ryzen AI Software Platform, allowing developers to train AI models on Ryzen-powered laptops. As AMD gets ready to enter the AI market, investors should get excited at the number of prospects for the company. Source: Pavel Kapysh / Shutterstock.com ACM Research (NASDAQ:ACMR) is a leading supplier of wet processing equipment and technologies for the semiconductor industry. What makes ACM Research unique is its focus on the China semiconductor market. While some may see this as a weakness, investors should recognize that China’s semiconductor space has come a long way and has even surprised U.S. policymakers with its resilience. It turns out that attempting to make the playing field lopsided only made China’s domestic industry more competitive. Companies supplying manufacturing machinery to this burgeoning semiconductor sector could benefit tremendously in the long run. ACM Research’s earnings results throughout 2023 were admittedly impressive and beat Wall Street’s estimates. As a result, ACM’s share price skyrocketed more than 153% in 2023. In the current calendar year, its stock price has begun to trend downward, but I think investors should view this as a potential buying opportunity, as ACMR’s valuation still looks cheap. Analysts expect China’s government to roll out more stimulus measures, which would have a positive effect on both its economy and the global economy at large. Companies like ACMR will benefit as the world’s second-largest economy recovers. On the date of publication, Tyrik Torres did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Tyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The post Wall Street Favorites: 3 Semiconductor Stocks With Strong Buy Ratings appeared first on InvestorPlace. Related Quotes "
}