{
    "title": "Nancy Pelosi's NVIDIA bet has already netted $250K — beating her entire \nannual salary in just 10 days. Some say ...",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/nancy-pelosi-nvidia-bet-already-181500087.html",
    "text": "Nancy Pelosi’s investing prowess has once again come under the spotlight. The member of Congress and former house speaker has achieved something that, for many Americans, would be unthinkable: she has already beaten her entire annual salary of around $223,500 with one super stock trade. Commercial real estate has outperformed the S&P 500 over 25 years. Here's how to diversify your portfolio without the headache of being a landlord Take control of your finances in 2024: 5 money moves to start the new year off strong The US dollar has lost 87% of its purchasing power since 1971 — invest in this stable asset before you lose your retirement fund Pelosi (D-CA) bought $2 million dollars worth of Nvidia (NVDA) call options late last year — and by Jan. 10, her well-timed trade had already made a whopping $250,000, according to stock trading news site Unusual Whales. This is because the generative AI giant’s stock hit another all-time high on Jan. 10, hitting a record $546 — and pushing Pelosi’s in-the-money call options up by around 13%. Pelosi’s stock trades often come under scrutiny because, quite simply, she’s made a lot of money from trading during her time in Congress. Together with her venture capitalist husband, Paul, Pelosi has netted millions of dollars in profit from buying call options on other blue-chip stocks such as Salesforce (CRM), Google (GOOGL), Roblox (RBLX) and Disney (DIS). Some have accused the high-profile lawmaker of using her connections and insider information to time the market and score winning deals. But the jury is out on this Nvidia trade. Yes, there is the usual chorus of critics screaming “INSIDER TRADING!” But there is also a large collective commending the congresswoman for her “buying strength.” Read more: Find out how to save up to $820 annually on car insurance and get the best rates possible In a Reddit thread about the Unusual Whales revelation, one user noted: “13%!?!? Wow!” one user wrote. “You prove absolutely nothing by this trade. There was zero alpha generated. There was nothing suspicious about the timing. Anybody that has a brokerage account with options can buy the same calls for leverage.” Another user, who claims to be “all for banning congresspeople trading stocks,” said, “Buying the hottest stock (or call on said stock) on the planet at a random time does not indicate insider trading at all.” Nvidia stock surged by 244% over the last 12 months. Thanks to high demand for its chips used in AI computing, Nvidia now has a market value of more than $1.3 trillion, leaving it just $250 shy of Amazon (AMZN). Pelosi’s active trading continues to grind lawmaker’s gears. And it’s not just Pelosi raking in the big bucks from well-timed trades. Of the 100 trading members of Congress in 2023, 33% beat the S&P 500 (SPY) with their portfolios, according to Unusual Whales — with four politicians (Brian Higgins D-NY, Mark Green R-TN, Garret Graves R-LA and David Rouzer R-NC) achieving over 100% gains. That is dramatic in comparison to the S&P 500’s 24.8% gain. In recent years, there has been a growing movement in Washington to ban members of Congress from trading stocks and to stifle any possible corruption and conflicts of interest among lawmakers. This Pennsylvania trio bought a $100K abandoned school and turned it into a 31-unit apartment building — how to invest in real estate without all the heavy lifting Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2024 Rising prices are throwing off Americans' retirement plans — here’s how to get your savings back on track This article provides information only and should not be construed as advice. It is provided without warranty of any kind. "
}