{
    "title": "Nvidia, Western Digital among top picks at Cantor for 2024 (NASDAQ:NVDA)",
    "date": "1/23/2024",
    "url": "https://seekingalpha.com/news/4057382-nvidia-western-digital-among-top-picks-at-cantor-for-2024",
    "text": "adventtr Cantor Fitzgerald highlighted Nvidia (NASDAQ:NVDA), Western Digital (WDC), ASML (ASML), NXP Semiconductors (NXPI) and GlobalFoundries (GFS) as its top picks for 2024, while also providing its outlook for the semiconductor and related equipment sector. On average, the analysts see 14% upside for their coverage universe in 2024. Other names with at least 15% projected upside include Micron Technology (MU), Advanced Micro Devices (AMD), and Marvell Technology (MRVL). Neutral-rated names that the analysts expect will be relative underperformers include Qualcomm (QCOM), Teradyne (TER), and Intel (INTC). The analysts said we are only three quarters into a cyclical recovery. The Philadelphia Semiconductor Index (SOX) bottomed Oct. 13, 2022 and has risen by about 95% since that time. But fundamentals bottomed in the second quarter of 2023, and we are only three quarters into a fundamental upturn, which compares to the typical nine quarters over the last seven cycles. If we assume the market discounts two quarters ahead, this would suggest another strong year for Semiconductor stocks in 2024, with investors looking for an exit strategy late 2024/early 2025, the analysts added. The analysts noted that this cycle is unlike any that we have ever seen. The significant divergence in relative lead times, inventory builds, and supply/demand dynamics has led to meaningful volatility across different end markets. So the cycle is a little different today — where AI is nicely into an upcycle, PC/Smartphones are early upcycle, Data Center/Networking are about to enter an upcycle, while Industrial is mid-downcycle, and Auto is early down cycle. Traditional 'buying 2nd or 3rd cut' has less meaning, and relative volatility is elevated, the analysts added. The analysts said that at a high level, semiconductors are under-shipping GDP — mainly when excluding both Nvidia (NVDA) and Memory. So while the soft versus hard-landing debate continues amidst the next move from the Fed being potentially lower, the analysts see the setup for semiconductor revenues recovering as quite good. The analysts model semiconductor revenues growing 18% in CY'24 with risk likely 20%+ when all is said and done. The analysts believe the most interesting end markets are AI (both Compute and Networking), Memory (both dynamic random access memory, or DRAM, and NAND), while being selective on Single Pair Ethernet, or SPE, 'as arms dealers' to these trends. The analysts are modestly more upbeat on WFE as well. The analysts see WFE coming in at $87B in CY23 (versus consensus $85B) followed by $90B in CY24 (consensus $85B), and $105B in CY25 (consensus $95B+). While Taiwan Semiconductor Manufacturing (TSM) will likely be flat to modestly lower, the analysts expect higher Intel (INTC) and Samsung (OTCPK:SSNLF) a pickup in DRAM, and domestic China spending to be at least flat to support growth into 2024. In 2025, they expect a new peak led by DRAM, NAND, and a meaningful pickup in leading-edge Foundry/Logic led by GAA, Backside Power, and High NA EUV. In addition, the analysts said that the U.S. wants a national semiconductor champion — and they think this favors GlobalFoundries (GFS) as potential takeout candidate. The analysts added that no slowdown expected in China semiconductor buildout. Cantor initiated coverage on 18 names in the Semiconductor and Semiconductor Equipment industries. Below is the rating and the price target on the stocks. Nvidia (NVDA) Overweight, $775; Western Digital (WDC) Overweight, $70; ASML (ASML) Overweight, €900; NXP Semiconductors (NXPI) Overweight, $260; GlobalFoundries (GFS) Overweight, $70; Micron Technology (MU) Overweight, $100; Marvell Technology (MRVL) Overweight, $80; Advanced Micro Devices (AMD) Overweight, $190; Broadcom (AVGO) Overweight, $1,300. Applied Materials (AMAT) Neutral, $180; Analog Devices (ADI) Neutral, $205; Texas Instruments (TXN) Neutral, $180; Seagate Technology (STX) Neutral, $90; KLA (KLAC) Neutral, $625; Lam Research (LRCX) Neutral, $830; Intel (INTC) Neutral, $50; Teradyne (TER) $110; Qualcomm (QCOM) Neutral, $150. Nvidia (NVDA) has a Hold rating at Seeking Alpha's Quant Rating system, which consistently beats the market. Meanwhile, the Seeking Alpha authors' average rating is more positive with a Buy and so is the average Wall Street analysts' rating, with Strong Buy. "
}