{
    "title": "What's Going On With Nvidia, Intel, Micron Stock Friday? - NVIDIA \n(NASDAQ:NVDA), Intel (NASDAQ:INTC), Mic",
    "date": "1/12/2024",
    "url": "https://www.benzinga.com/government/24/01/36614280/whats-going-on-with-nvidia-intel-micron-stock-friday",
    "text": "Nvidia Corp NVDA, Intel Corp INTC, and Micron Technology, Inc MU, prominent U.S. chipmakers, have been summoned to testify before Congress by the House of Representatives’ China committee. The update sent the stock prices down. This request marks a notable shift in the committee’s approach, intensifying its examination of companies with substantial ties to China. The committee, which hadn’t previously held hearings with CEOs from any industry since its formation, now focuses on these tech giants due to their significant operations and sales in China, the Financial Times reports. A trade and sanctions expert, Emily Kilcrease, highlighted that this hearing is part of the committee’s efforts to exert political pressure on companies heavily involved in China. This increased scrutiny comes after the CEOs of Intel, Nvidia, and Qualcomm Inc QCOM actively lobbied against more rigid semiconductor-related export controls proposed by the Biden administration last year. These companies, which declined to comment on the letters of summons, rely on China for a considerable portion of their annual revenues. In FY17, Micron saw 50% of its $20 billion revenue coming from China, but this figure dropped dramatically to 16% in 2022, coinciding with the company shutting down its DRAM operations in Shanghai. Meanwhile, Nvidia dominates China’s AI chip market, holding as much as 90% of the market, valued at around $7 billion. Intel CEO Pat Gelsinger, Nvidia’s Jensen Huang, and Qualcomm’s Christiano Amon had previously met with White House officials to argue against stringent export restrictions, warning of potential long-term harm to the U.S. industry. The U.S. Commerce Department, however, tightened restrictions on exporting AI chips to China, impacting Nvidia significantly. Also Read: Nvidia Leads AI Chip Rivalry with New GPUs, While AMD and Intel Bet Big on AI PCs While Micron, primarily because it doesn’t produce the same advanced semiconductors as Intel and Nvidia, hasn’t faced similar scrutiny, it has experienced issues in China, including a ban by the Chinese government on some domestic groups from purchasing its chips. The House committee’s move reflects broader efforts to scrutinize U.S. companies with operations in China, including firms like BlackRock. It holds implications for these companies as China becomes a focal point in the upcoming 2024 presidential election. Kilcrease emphasized that these actions signify a push towards decoupling tech supply chains, increasing the heat on America’s key chip companies. Price Actions: NVDA shares traded lower by 0.52% at $545.35 on the last check Friday. INTC shares traded lower by 1.79% at $46.78 and MU traded lower by 1.63% at $82.03. Also Read: Nvidia Secures $1B AI Chip Deal in India, Signaling Major Market Expansion Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}