{
    "title": "Billionaire Investor Gundlach Foresees Recession, Recommends Cash Over \nOvervalued Stocks: 'Skip This Last",
    "date": "1/27/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36813488/billionaire-investor-gundlach-foresees-recession-recommends-cash-over-overvalued-st",
    "text": "Billionaire investor Jeffrey Gundlach sounded a note of caution, maintaining that despite the “exuberance” in equity markets, a recession seems to be “inevitable.” What Happened: In a conversation with Fox Business Network, Gundlach raised doubts about the current market valuations and enthusiasm. He proposed that cash might be better utilized after the forthcoming recession. “I’m suspicious of the valuations, I’m suspicious of the exuberance in the market, so I want to have cash at this point which I might want to deploy in the aftermath of the recession that is going to come,” he said. Gundlach, also known as the “Bond King”, expressed concern over the S&P 500 index, which spiked by 24% last year and has further increased by 3% this year, hitting a record high. He underscored the considerable surge in tech stocks, including Nvidia Corp. NVDA, which has hit a market capitalization of $1.5 trillion. “We’re in a valuation spot in the equity market where I think you have to start looking long term and kind of skip this last phase of the exuberance game because I think the values are very, very high.” See Also: Nasdaq, S&P 500 Futures Jump As Wall Street Eagerly Awaits Tesla’s Q4 Earnings: Analyst Says Rally Broade Gundlach pointed out that the yield curve’s inversion and subsequent de-inversion is a reliable indicator of recession. He emphasized that 10-year Treasury yields fell below 2-year yields over 18 months ago, and the gap has significantly narrowed recently. He also referred to the Leading Economic Index, which has been on a downward trend for 21 consecutive months, as an indication of looming economic turmoil. In light of this, Gundlach urged the Federal Reserve to cut interest rates this year after they were raised from virtually zero to over 5%. Why It Matters: This is not the first time Gundlach expressed concerns about a potential recession. Earlier this month, he predicted a downturn in the S&P 500. He held a bearish stance on the market, suggesting that the S&P 500 is not an ideal investment at present. He predicted that the so-called “Magnificent Seven” stocks are likely to underperform compared to the broader market. Read Next: Raise Taxes Or Be Damned: Robert Rubin Warns Of ‘Enormous’ Risks Of Runaway Deficit Photo courtesy: Picpedia © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}