{
    "title": "[KH Explains] Will OpenAI, Korean chipmakers team up to take on Nvidia?",
    "date": "1/28/2024",
    "url": "https://www.koreaherald.com/view.php?ud=20240128000099",
    "text": "Most Popular [AtoZ into Korean mind] Fatphobia pervasive in Korea Rumors of Kim Sae-ron, Kim Soo-hyun dating swirl after social media post Competition heats up in HBM market as Nvidia endorses Samsung chip [News Analysis] S. Korea's medical crisis: no end in sight ‘If Trump wins, Yoon may be pushed aside in US talks with North Korea’ Han accuses opposition leader of being 'subservient to China' Yoon calls for flexible ways to process suspension of medical licenses Health minister vows to swiftly hold talks with medical community over doctors' walkout Professors tender resignations despite Seoul’s offer of dialogue Health care standoff to worsen amid looming resignations by med professors Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Jan. 28, 2024 - 14:30 Link copied Sam Altman, the chief executive officer of OpenAI, visited Seoul last week to hold a series of meetings with top executives of Samsung Electronics and SK hynix, the world’s top two memory chipmakers, fueling speculation that the “father of ChatGPT” is in search of allies to take on Nvidia, the unrivaled market leader in chips for artificial intelligence. For Samsung and SK, being part of a possible alliance would provide a chance for them to step up their game in the heated competition for next-generation chips, industry watchers say. “OpenAI aims to take the lead in the AI era by combining its software power with an extensive hardware network,” Lee Jong-hwan, a system semiconductor engineering professor at Sangmyung University, said. Altman’s high-profile visit comes after news reports that OpenAI seeks to make its own AI chips and gain greater control over supply chains where almost 90 percent of supplies are made by Nvidia. The burgeoning demand for AI technology is fueling sales of graphics processing units, which can speed up the workloads of complex AI calculations via parallel processing. Fabless companies like OpenAI are paying a lot of money to secure Nvidia’s highly advanced but pricey GPUs. Nvidia’s top-of-the-line A100 chips, for instance, are priced at $25,000 per unit. Because of its tight supply, big tech firms are lining up to put orders. OpenAI alone is known to have purchased more than 10,000 units. Altman has repeatedly raised concerns about chip shortages. According to Bloomberg, he believes that the industry needs to act now to ensure there’s sufficient supply near the end of the decade. For the highly complex undertaking of chip manufacturing, Altman has kicked off discussions with Samsung and SK following similar talks with Intel and Taiwan’s TSMC. \"The two Korean chip behemoths are No. 1 and No. 2 in the global memory chip market. Samsung and SK hynix would likely take charge of developing and producing memory chips if they join the envisioned AI alliance,\" an industry official said on condition of anonymity. According to industry sources, one of the key agendas during their meetings was high bandwidth memory or HBM chips, the most advanced memory chips that are crucial to processing large volumes of data. In 2022, SK hynix became the first company to supply its four-generation HBM product, dubbed HBM3, to Nvidia, and it is expected to begin the mass production of the extended version HBM3E in the first half of this year. Samsung is also ramping up the production. Currently, the two Korean firms produce more than 90 percent of global supplies. For Samsung, a possible partnership with OpenAI will offer a boon for its foundry business to up the ante against TSMC. According to TrendForce, TSMC topped the global foundry market taking 57.9 percent of sales in the third quarter of 2023, while Samsung remained a distant No. 2 with a 12.4 percent market share. Even though Samsung has developed the next-generation Gate-All-Around transistor architecture, the most advanced chip-manufacturing technology, faster than its rivals, it is still struggling to win orders from big clients such as Apple, Nvidia and Qualcomm. “Korean chipmakers should create a new opportunity to cooperate on HBM or other AI chips. Samsung, in particular, has a higher potential considering its foundry and advanced packaging prowess,” Lee added. Altman’s 19-hour stay in Seoul was jam-packed with meetings and on-site visits. He arrived late on Thursday and started a tight schedule on Friday. He visited Samsung’s Pyeongtaek Campus, the world’s largest semiconductor manufacturing facility, spanning about 500 soccer fields, where he met with leaders of the tech giant’s chip business divisions. In the afternoon, he met with SK Group Chairman Chey Tae-won and SK hynix CEO Kwak Noh-jung in Seoul. Later in the day, he reportedly had a dinner meeting with Samsung Electronics Vice Chairman Kyung Kye-hyun, one of the co-CEOs who oversees chip businesses. Articles by Jo He-rim Related Stories The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  "
}