{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.fool.ca/2024/01/17/forget-nvidia-1-artificial-intelligence-ai-stock-to-buy-now/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Nvidia stock is richly priced. Any small surprises could trigger amplified volatility in 2024. Risk-averse investors may buy this AI stock instead. Image source: Getty Images Nvidia (NASDAQ:NVDA) has been the brightest star of the artificial intelligence (AI) trade. Elated investors bid up AI-related tech stocks in 2023 and ushered Nvidia into the trillion-dollar stock club. However, the large-cap stock trades expensively at 31 times last year’s sales and expectations are sky high. The market anticipates a further 55% surge in the chipmaker’s annual sales this calendar year, despite growing revenue risks. Nvidia’s was the only supplier of AI chips last year. However, new and aggressive competitors are out to steal its market share. Advanced Micro Devices is aggressively pushing a cheaper and similarly capable AI chipset this year. Export barns to China and parts of the Middle East may affect more than 20% of Nvidia’s AI-accelerator sales. Moreover, given that AI chips may have a three-year lifespan and that an upgraded accelerator may be released later this year, customers may choose to delay deliveries and wait for the latest chips. Sales growth may potentially dampen in 2024, only to peak again when repeat sales kick in. It’s possible for Nvidia to miss high growth expectations somewhere along the way. Any mishaps could trigger massive volatility in Nvidia’s stock price during the year. Given an average analyst price target of US$660 on NVDA stock, which implies a 16% potential upside over the next 12 months, a new gamble may not pay off. Risks are elevated, but the payout promise isn’t as inviting. Investors who are concerned about a potentially poor risk-reward tradeoff on Nvidia stock but still wish to play the long-term AI upside may still check out slow and steady AI-powered growth stocks. CGI Inc. (TSX:GIB.A) is one of the promising lower-risk Canadian AI stocks to check out. CGI is a technology consultancy services firm and innovation partner of choice for global firms and governments. The $30 billion company is a go-to professional guide for clients who wish to join the AI trend, develop AI models, and modernize their work processes. Its AI business lines should boom over the next few years as companies and governments adopt AI to improve work efficiency, reduce costs, or optimize earnings margins. Why is CGI an AI growth stock to buy today? The company is deploying $1 billion to advance its AI offerings within the next three years. It has established a track record of successful AI project consultancy services for years, and customer bookings soared in 2023, as the AI craze gripped the world. In November last year, the company disclosed working on 600 AI projects and acknowledged $175 million in new AI bookings — a significant 5% of its most recent quarterly revenue run rate. The company recently won a contract to integrate AI into visa processing support at U.S. embassies and consulates in the Asia Pacific region in October 2023. On January 16, CGI launched Machine Vision, a new AI product that may enjoy wide international adoption as it intelligently monitors, tracks, and manages corporate assets in a way “not previously possible through traditional solutions or human-only inspection,” the company claimed in a recent media release this month. Widespread AI adoption globally may translate into bookings growth, higher revenue, and ultimately more profits and growing free cash flow at the global business consultancy firm. Interestingly, CGI stock is very responsive to free cash flow growth, as seen below. The company’s share price has risen with free cash flow over the past several decades. Management has used growing free cash flow to make accretive acquisitions that support CGI stock’s steady rise. Long-term-oriented investors could book positive capital gains on CGI stock as AI adoption delivers sustainable revenue and earnings growth at this well-positioned IT consultancy firm. Shares currently trade at a reasonable forward price-to-earnings (P/E) ratio of 16.9, far below an average industry P/E of around 61. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 22, 2024 |\n        Karen Thomas, MSc, CFA Well Health stock has been hit hard in the last three years, yet fundamentals remain strong and keep hitting records. Read more » March 22, 2024 |\n        Amy Legate-Wolfe This growth stock has been on a tear in 2023 and 2024, with even more likely for this year and… Read more » March 22, 2024 |\n        Joey Frenette Constellation Software (TSX:CSU) stock looks more like a must-buy for investors seeking tech at a reasonable price. Read more » March 22, 2024 |\n        Amy Legate-Wolfe WELL Health (TSX:WELL) stock had a huge climb and an even larger fall. And that fall continued this week after… Read more » March 21, 2024 |\n        Joey Frenette Docebo (TSX:DCBO) is another impressive AI company in the Canadian tech scene that's overlooked by many. Read more » March 21, 2024 |\n        Aditya Raghunath Open Text is a tech stock trading at a massive discount to consensus price target estimates in 2024. Read more » March 21, 2024 |\n        Amy Legate-Wolfe Lightspeed (TSX:LSPD) stock has hit major highs but remains at its lowest lows. So, what would it take to surge… Read more » March 21, 2024 |\n        Andrew Button Constellation Software (TSX:CSU) shares cost nearly $4,000. Will the company do a stock split? Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. ©  2024 The Motley Fool Canada, ULC. All rights reserved. "
}