{
    "title": "SK Hynix US Facility; New Nvidia China Chip; Paytm Spirals",
    "date": "2/1/2024",
    "url": "https://www.cmcmarkets.com/en/opto/sk-hynix-us-facility-new-nvidia-china-chip-paytm-spirals",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. 5 Top Stories By OPTO  01 Feb 2024, 16:20 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. South Korean chipmaker SK Hynix [000660:KS] is to build a new facility in the US state of Indiana, which will specialise in HBM chips used by Nvidia [NVDA]. This is a major boost to US efforts to onshore chip production: “together with TSMC’s Arizona fabs this means Nvidia could eventually be able to have its GPUs produced in the US,” Kim Yang-paeng, a researcher at the Korea Institute for Industrial Economics and Trade, told the Financial Times. Nvidia has begun taking pre-orders for a new artificial intelligence (AI) chip tailored to the Chinese market. It will be priced at the same level as a comparable Huawei product, Reuters reported. Called the H20, it is the most powerful of three new chips Nvidia has designed for China in response to a US export ban. It will be less powerful than the firm’s flagship H100 AI, but may also be less powerful than Huawei’s Ascend 910B. CEO Elon Musk announced that Tesla [TSLA] shareholders will vote on whether to change the firm’s state of incorporation from Delaware to Texas. Volvo [VOLV-B:ST] rocketed nearly 22% after announcing it will pull funding for its lossmaking electric vehicle (EV) arm Polestar; parent Geely [175:HKG] may take on some of its 48% share, the FT reported. Chinese automakers including Changan Auto [000625:SZ] have had to delay deliveries due to issues with Huawei-produced computing units. The market value of Indian digital payments giant Paytm [PAYTM:NS] fell by a fifth on Thursday, after the central bank told its payment bank subsidiary to stop business. It may have come as a shock to the finance and tech spheres, but this move on the part of the Reserve Bank of India follows years of non-compliance with rules, including on customer due diligence, Reuters reported. India’s five million programmers are being eyed for AI talent by the likes of Microsoft [MSFT] and Alphabet [GOOGL], according to Bloomberg. The online game Palworld, a viral sensation that has been described as “Pokémon with guns”, has become the biggest third-party hit in the history of Microsoft’s Xbox Game Pass. The open-world game has passed seven million players across Xbox and PC, reported Bloomberg. Developed by Tokyo-based Pocketpair, its success is a testament to Microsoft’s new strategy of building a subscription service that offers games from both its own studio and outside developers. Disclaimer Past performance is not a reliable indicator of future results. CMC Markets is an execution-only service provider. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. CMC Markets does not endorse or offer opinion on the trading strategies used by the author. Their trading strategies do not guarantee any return and CMC Markets shall not be held responsible for any loss that you may incur, either directly or indirectly, arising from any investment based on any information contained herein. *Tax treatment depends on individual circumstances and can change or may differ in a jurisdiction other than the UK. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles 5 Top Stories Novo Nordisk Hits $500bn; Tech Earnings Underwhelm; Tesla Slips The Danish drugmaker became the second-ever European company to surpass a market value of $500bn, following positive prognostications for Wegovy. 31 Jan 2024 Is Netflix Winning the Streaming Wars? Netflix’s Q4 earnings report suggests that it is pulling ahead of streaming rivals, with Disney facing boardroom drama. 31 Jan 2024 5 Top Stories BYD Buoyant; Renault Wobbles; Tencent to Up Game Having overtaken Tesla as the top EV maker by sales, BYD said on Monday it expects net profit for 2023 to rise by up to 86.5% year-over-year. 30 Jan 2024 5 Top Stories ARK Rebound; Amazon Ditches Takeover; Samsung Partners with Baidu The iRobot share price fell by some 19% in early trading Monday, after Amazon pulled the plug on its $1.4bn acquisition of the firm. 29 Jan 2024 © 2024 CMC Markets Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money. CMC Markets UK plc (173730) and CMC Spreadbet plc (170627) are authorised and regulated by the Financial Conduct Authority in the United Kingdom. "
}