{
    "title": null,
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/video/earnings-haves-nots-season-130000426.html",
    "text": "Earnings performances have perpetuated beliefs there are still \"haves and have not\" companies, according to Roundhill Investments Chief Strategy Officer Dave Mazza, who includes the Magnificent Seven components in his summary of fourth-quarter earnings winners. Mazza joins Yahoo Finance to break down what he is seeing in earnings trends as tech stocks fly high on AI drivers. \"You can choose really two companies in any sector and say who's done it right and who's done it well, and really what investors are focusing here is on that efficiency,\" Mazza says. \"It's a sad thing to say, but companies that have embarked on layoffs are being rewarded by the market because it's improving their profit margins and the like. To me, it's not clear that it's all clear on the earnings side, but we are seeing some companies really put up some strong numbers.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. - Let me ask you this, just to switch gears a bit here too. Listen, earnings season rolls on, after the bell today. Disney, PayPal, just interested to get your thoughts on what you make of earnings season so far. You've seen about 70%, I think you have companies beat expectations. That is above the historical average, but what have been your big takeaways? - Yeah, earnings actually have been generally pretty good. I think investors are happy to see that we're out of this-- the earnings recession and the slump that we saw there, but we're still in an environment, to me, that is these haves and have nots, and that's something that-- a thesis that I've been talking about for some time, is that there's a select group of companies, some of this is the Magnificent Seven, and there's others in other sectors that are winners. And then the have nots are these losers. So for stock pickers or people looking to stay, let's take some risk and move back into areas that either had done well a few years ago, it's been challenged and we're seeing that in earnings season. Look at the bifurcation between Meta and Snap. You can choose, really, two companies in any sector and say, who's done it right and who's done it well? And really what investors are focusing here, is on that efficiency, right? It's kind of a sad thing to say, but companies that have embarked on layoffs are actually being rewarded by the market because it's improving their profit margins and the like. So to me, it's not clear that it's all clear on the earnings side, but we are seeing some companies really put up some strong numbers. - Although Snap is one that's cutting and maybe the market thinks it's not cutting it up. We've been sort of playing a fun parlor game that seems to be happening in the market right now, which is, is the Magnificent Seven still the Magnificent Seven and what's the new Fang or Mag Seven, or whatever you want to call it? Or, is it still just the Mag Seven? - Yeah, it's interesting. So it was FANG, then FANGM. And then more recently, Magnificent Seven. Now we're hearing Sensational Six, or keeping-- - Dynamic Duo, I've heard that one. - Right? It's like, you know, now people are saying keep the Magnificent Seven because we kind of like it and then maybe swap out Tesla. But what's fascinating to me is, I actually went back and looked through time, Magnificent Seven as a term didn't exist in 2013. But I went back to Meta's IPO to measure this and if you look at the divergence, the average range between the best performing and the worst performing name out of the Magnificent Seven, there are some years where it's over-- on a rolling 12 month basis-- over 1,000%. Now some of that is Tesla's outsized gains. But also remember, Meta was in a huge slump for some time. There's been times where people have counted out Apple. So I'm not ready to give up at all on the Magnificent Seven, even including Tesla. Of course, time will tell, but these companies on average-- at least compared to the other 493, are showing high top line revenue growth, high strong margin growth. And in a market, which has this uncertainty, whether it's from commercial real estate or other areas, that's where investors are saying, hey, it's not so bad what I want to sell stocks. But if I'm going to buy, I'm going to stick to the mega caps. Related Quotes "
}