{
    "title": "Beyond Nvidia: The hidden stars with 200% earnings growth",
    "date": "2/9/2024",
    "url": "https://www.sharewise.com/us/news_articles/Beyond_Nvidia_The_hidden_stars_with_200_earnings_growth_MarketBeat_20240209_1736",
    "text": " Maintaining an earnings growth rate of 200% or higher isn't something a company does by accident, and only a select few manage to pull it off. You probably won't be surprised that AI chip powerhouse Nvidia Corp. (NASDAQ: NVDA) is a member of the exclusive group of companies that can manage to grow earnings by 200% or more. Check out some smaller, less well-known stocks, part of that club: Fluor Corp. (NYSE: FLR), Jefferies Financial Group Inc. (NYSE: JEF) and Golden Entertainment (NASDAQ: GDEN). Triple-digit earnings growth often signals a company's potential for future success. That kind of rapid earnings expansion typically reflects strong demand for the company's products or services, combined with efficient operations and a management team focused on the bottom line. It also means the company isn't in recovery mode after one or more events, such as supply-chain snarls or high commodity input prices, that put a dent in profitability. Engineering and construction specialist Fluor should report earnings of $2.62 a share when it delivers 2023 results on February 20. When it reported third-quarter results in November, Fluor boosted its earnings outlook, saying, \"This revised guidance reflects positive advances on large Energy Solutions projects and continued progress on projects in our legacy portfolio.\" The Fluor chart shows a return of 17.03% in the past three months, outpacing its mid-cap index, as tracked by the SPDR S&P MidCap 400 ETF Trust (NYSEARCA: MDY), as well as the broader market, tracked by the SPDR S&P 500 ETF Trust (NYSEARCA: SPY). On February 8, Fluor stock broke out of a flat base with a buy point above $40.77, but reversed lower and ended the session at $40.07. The stock is currently actionable. Shares jumped 4.73% higher on February 7, in volume slightly heavier than normal. That suggests an institutional buyer is accumulating shares, which is always a good sign. Mid-cap financial services firm Jefferies should grow earnings by 212% this year, to $3.43 a share. The company is slimming down, selling off investments in various lines of business to bring its focus back to investment banking and asset management. For example, on February 5, the company said it was selling Italian wireless broadband provider OpNet for about $523 million. It previously sold an auto financing unit and a gold and silver mining company. Looking at the Jefferies earnings history, you'll see a big decline in net income in 2023, so the 2024 forecast is somewhat based on easy comparisons. Still, analysts see revenue growth returning after several quarters in a row of declines. While not as large as other finance stocks, Jefferies Financial may have the advantage of greater agility and growth potential due to its smaller size. Fellow Wall Street firms tracking the company expect more growth; the Jefferies analyst forecasts show a consensus view of \"buy.\" Amid the glitz and glamour of casino stocks, it's easy to overlook small-cap Golden Entertainment, which has rallied 4.55% in the past three months. The Golden Entertainment chart shows the stock forming a cup-with-handle base below a buy point of $42.14. The company operates eight casino resorts in Nevada, including the Strat in Las Vegas. It also runs PT's Taverns, with locations throughout Las Vegas. The company should grow earnings by 239% to $8.86 per share when it reports 2023 results on February 29. Like many other sectors of the economy, the gaming industry has defied expectations of a downturn due to inflation or recession fears. As a group, gaming stocks have been trending higher since late October, along with the broader market. The VanEck Gaming ETF (NASDAQ: BJK) has returned 12.03% in the past three months. Golden Entertainment analyst forecasts show a consensus view of \"buy\" with a price target of $50.67, a healthy upside of 31.64%. One caveat: The company has a heavy debt burden, uncommon in industries based on plenty of brick-and-mortar locations. The company focuses on reducing its debt, but Wall Street expects a sharp decline in earnings this year, even while seeing upside potential in the stock's price. Source MarketBeat About sharewise © All rights reserved.\nStock prices are provided by BSB-Software This page uses Cookies. For proper functioning of the page Cookies are needed. You agree to using Cookies by clicking \"OK\". \nMore infos can be found in our Privacy declaration.\n\nIf you disagree this service is only available in very limited ways. "
}