{
    "title": "NVIDIA is now worth as much as the entire Chinese stock market",
    "date": "2/13/2024",
    "url": "https://root-nation.com/en/news-en/en-nvidia-is-now-worth-as-much-as-the-entire-chinese-stock-market/",
    "text": "desktop v4.2.1 - In a new note, NVIDIA is now worth as much as the entire Chinese stock market as measured by H-shares listed on the Hong Kong Stock Exchange, Bank of America chief investment strategist Michael Hartnett said. The company’s market capitalization reached $1.7 trillion, equal to the value of all Chinese companies listed on the Hong Kong Stock Exchange. Shares of NVIDIA have soared 239% in 2023 and are up 41% in 2024 through Thursday.  In a new research note, Bank of America chief investment strategist Michael Hartnett noted that Nvidia’s $600 billion increase in value over the past two months has boosted its market capitalization to $1.7 trillion, equal to the value of all Chinese companies listed on the Hong Kong stock exchange combined. Shares listed on the Hong Kong Stock Exchange are considered a good indicator of the Chinese market because they meet international accounting standards and have direct access to brokerages worldwide. Since the beginning of last year, the market capitalization of the chipmaker has increased almost four times. As of Thursday, its shares have soared 239% in 2023 and are up 41% this year alone. Only four American public companies are worth more.  Meanwhile, the economic crisis in China sent stocks tumbling. Lackluster economic growth and a prolonged slump in the real estate market weighed on the market. The country is also dealing with deflation. The Hang Seng, a benchmark for Hong Kong-listed Chinese stocks, has fallen 26% over the past year and 8% since the start of the year. But Hartnett said there could be an opportunity for investors who can identify Chinese stocks with strong management, strong balance sheets and strong earnings. It recalls the precedent of Japan’s Nikkei collapse in the early 1990s, when a select group of 15 companies with these characteristics rose 400%, creating a bull market. Read also:  Δ  Δ Apple home screen is preparing to get customizable with the iOS 18 update WhatsApp Avatar sticker feature is coming as a privacy tool for users OnePlus Ace 3V sales have already started in China at a sub-$300 price Google Pixel market share in North America is almost 5% Google Meet Portrait Touch-up feature is becoming available on desktop Google Pixel 8a specifications have leaked ahead of its official launch Redmi Note 13 and Note 13 5G Smartphones Review Cubot KingKong AX Rugged Smartphone Review: Sturdy Yet Elegant ASUS ROG Phone 8 and 8 Pro Gaming Smartphones Review: Hot and Fast! What You Need to Know Before Installing Solar Panels Motorola Moto G34 5G Review: Successful Budget Phone © Root Nation 2012-2023 desktop v4.2.1 "
}