{
    "title": "Better AI Stock: Nvidia or Super Micro Computer?",
    "date": "2/24/2024",
    "url": "https://finance.yahoo.com/news/better-ai-stock-nvidia-super-183000828.html?prefer_reader_view=1&prefer_safari=1",
    "text": "While artificial intelligence (AI) is widely considered a software program, it requires hardware to develop and power it. This leads to investors looking for \"pick-and-shovel\" style investments, as these companies sell the tools needed to power these processes (similar to how many businesses sold picks and shovels to gold miners during the various gold rushes throughout U.S. history). Two of the top \"pick-and-shovel\" plays in the AI market are Nvidia (NASDAQ: NVDA) and Super Micro Computer (NASDAQ: SMCI). Both stocks have been rocket ships since the start of 2023, with Nvidia and Super Micro Computer's (often called Supermicro) stocks up 437% and 1,000%, respectively. But which one is the better buy now? Let's find out. While both companies could be considered \"pick-and-shovel\" investments, in reality, Nvidia makes the shovel and pick heads, while Supermicro assembles the tools and sells them to end users. Nvidia makes the graphics processing units (GPUs) to handle the complex workloads that AI models require. These hardware pieces have been around for a long time and were originally used to process gaming graphics, but have since expanded their usage to engineering simulations, drug discovery, and AI model training. When companies want to build a supercomputer to harness the power of data through AI, they don't just buy one or two GPUs; they buy hundreds or thousands. To get the most use out of them, they must also be strategically placed and connected to a server, which is where Supermicro comes in. Supermicro builds these servers for clients and offers highly configurable models that can be tailored to end-use and computing power expectations. They work closely with Nvidia to ensure they're squeezing every ounce of performance out of their servers, which benefits users in the long run. But as to which makes more sense to invest in, there's a clear choice. Supermicro is heavily dependent on Nvidia for business. If Nvidia chooses to fulfill GPU orders to other clients or the relationship sours, Supermicro's business will be crushed. These two companies have been partners for a while, so I don't see this happening, but it is something to keep in mind. Furthermore, Supermicro has fierce competition from other server builders like Hewlett-Packard and IBM, while Nvidia's AI GPUs are in a class of their own. This heavily skews the bias toward Nvidia, but another factor is also at play. Both stocks were undervalued entering 2023, but Supermicro's stock was unbelievably cheap at just over six times forward earnings. That's why Supermicro has outperformed Nvidia's stock over the past year, but that will likely stop soon. Now that Supermicro is more expensive than Nvidia, buying it doesn't make a ton of sense, especially if they're growing at the same pace. Nvidia's business model is far superior because it controls the primary product, giving it an advantage when assessing profit margins. Nvidia is far more profitable than Supermicro, and if you give me a choice between two stocks that are evenly priced and growing around the same pace, then I'll choose the more profitable one every single time. While both companies will succeed as the AI buildout continues, I'm more excited about Nvidia due to its superior margins and control over the primary product. Super Micro Computer may be a solid company to invest in, but you're better off picking Nvidia at these prices. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 20, 2024 Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool recommends Super Micro Computer. The Motley Fool has a disclosure policy. Better AI Stock: Nvidia or Super Micro Computer? was originally published by The Motley Fool Related Quotes "
}