{
    "title": "2 Stock-Split AI Stocks to Buy Before They Soar 41% and 111% in 2024, \nAccording to Certain Wall Street Analysts",
    "date": "1/13/2024",
    "url": "https://www.fool.com/investing/2024/01/13/2-stock-split-ai-stocks-to-buy-before-soar-111/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Data centers are physical locations where companies keep computing infrastructure like servers, network equipment, and data storage solutions. They come in different shapes and sizes, but cloud data centers have become particularly popular over the last decade. Cloud computing allows businesses to provision hardware and software services instantly, without spending a lot of money upfront. Countless companies have capitalized on that IT reshuffling, but few have benefited more than Nvidia (NVDA 3.12%) and Amazon (AMZN 0.40%). Nvidia chips have become key data center accelerators for workloads like artificial intelligence (AI), and Amazon is the largest provider of cloud infrastructure and platform services. Critical positioning in a booming industry drove both stocks higher. Nvidia returned 12,800% during the last decade and Amazon returned 630%. That substantial price appreciation led both companies to split their stocks somewhat recently: Certain Wall Street analysts see big gains for shareholders in 2024. Specifically, Hans Mosesmann at Rosenblatt has a 12-month price target on Nvidia of $1,100 per share, implying a 111% upside from its current price. Similarly, Scott Devitt at Wedbush Securities has a 12-month price target on Amazon of $210 per share, implying a 41% upside. Here's what investors should know. Nvidia has three primary growth engines in its gaming, professional visualization, and data center businesses, though the automotive segment could become a substantial source of revenue as the robotaxi market blossoms. Nvidia has deep roots in gaming and professional visualization. Its invention of the GPU (graphics processing unit) in 1999 revolutionized computer graphics, and the company still holds more than 90% market share in workstation graphics processors. But Nvidia also added monetization opportunities by branching into software with Omniverse, a suite of applications that support 3D design and virtual simulation. The latter is useful in training machine learning models for autonomous robots and self-driving cars. Guided by visionary CEO Jensen Huang, Nvidia moved into data centers in 2006 when it introduced the CUDA programming model, turning its GPUs into general-purpose processors. That innovation laid the foundation for tremendous success. Today, Nvidia dominates the market for data center accelerators and machine learning chips. In fact, Forrester Research has said Nvidia GPUs are synonymous with AI infrastructure. In a recent note to clients, Rosenblatt analyst Hans Mosesmann highlighted adjacent AI monetization opportunities in data center networking and software. To elaborate, networking sales tripled over the past year to become a $10 billion business, and CEO Jensen Huang says it will get much larger. Similarly, CFO Colette Kress says Nvidia started to see excellent adoption of AI software during the most recent quarter, an encouraging update, given that management sees it as a $150 billion market opportunity. Here's the bottom line: GPU sales are projected to increase by 28% annually through 2030, while the AI market is projected to expand by 37% annually during the same period. That gives Nvidia a good shot at 25% annual sales growth through the end of the decade. Despite that, its present valuation of 29 times sales looks a little pricey, especially when the three-year average is 23.5 times sales. Investors comfortable with volatility can buy a small position today, provided they are willing to hold the stock for at least five years. The triple-digit return baked into Rosenblatt's 12-month price target is unlikely, given the elevated valuation, but it is possible over a five-year time period. Amazon has three main growth engines: e-commerce, digital advertising, and cloud computing. The first two opportunities are interconnected. Specifically, Amazon operates the most-visited online marketplace on the planet, and eMarketer says the platform accounted for 38.7% of retail e-commerce sales across North America and Western Europe last year. That scale means Amazon is uniquely positioned to engage shoppers and source data from its marketplace, and the company has leveraged that advantage to build a booming advertising business. In fact, Amazon recently became the third-largest ad tech company in the world. And its recent decision to bring ads to Prime Video adds yet another opportunity. Not surprisingly, Wedbush Securities analyst Scott Devitt is particularly bullish on Amazon's ad tech business, and he recently wrote: \"The company is well positioned to continue taking share of global digital advertising spending over a multi-year period.\" But Devitt is also optimistic about the cloud computing business, Amazon Web Services (AWS), where he believes growth will accelerate in 2024. Whether that happens or not, AWS is indeed primed for long-term growth as the AI boom unfolds. Consultancy Gartner has recognized its leadership in cloud AI developer services, and AWS recently extended its portfolio with the launch of Bedrock and Amazon Q. The former is a development platform for generative AI applications, and the latter is a generative AI business assistant. Both could help AWS tap the growing demand for generative AI software, a market Bloomberg believes will grow at 69% annually through 2032. Here's the bottom line: Retail e-commerce sales are projected to increase at 8% annually through 2030, while the ad tech and cloud computing markets are forecast to grow at 14% annually during the same period. Amazon will likely split the difference, meaning annual sales growth could range from 10% to 12% through the end of the decade. That estimate leaves room for upside should Amazon be especially successful in its AI ambitions. In either case, its current valuation of 2.8 times sales looks quite reasonable, especially when the three-year average is 3 times sales. Patient investors should consider buying a small position today, but the key word is patient. The 41% upside baked into Wedbush's 12-month price target seems a bit too optimistic, but Amazon could certainly beat the market over the next five years. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Amazon and Nvidia. The Motley Fool has positions in and recommends Amazon and Nvidia. The Motley Fool recommends Gartner. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}