{
    "title": "2 Artificial Intelligence (AI) Stocks That Could Help Make You a Fortune",
    "date": "1/23/2024",
    "url": "https://www.fool.com/investing/2024/01/23/2-artificial-intelligence-stocks-that-could-help/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Artificial intelligence (AI) technology is expected to supercharge multiple industries in the long run, with Bloomberg Intelligence estimating that this market could go on to generate a whopping $1.3 trillion in annual revenue in 2032, as compared to just $40 billion in 2022. Not surprisingly, investors have been buying companies capable of winning big from the proliferation of AI in the long run. Nvidia (NVDA 3.12%) and Cloudflare (NET 0.17%) are two companies that fall in this category. While Nvidia is playing a central role in driving the AI revolution with its powerful chips, Cloudflare's internet infrastructure services also will play an important factor in the adoption of this technology. Let's see how AI could help these companies clock outstanding growth in the long run and make a fortune for investors at the same time. Nvidia is one of the first names that may come to mind if you are looking to buy an AI stock. That's not surprising, considering how this technology has led to a sharp jump in the company's revenue and earnings. Nvidia's revenue in the current fiscal year is on track to more than double to $59 billion. Meanwhile, its earnings are expected to jump significantly over the next three fiscal years, as compared to fiscal 2023 earnings of $3.34 per share.  NVDA EPS Estimates for Current Fiscal Year data by YCharts As the chart shows, Nvidia's bottom line could jump 7-fold in just three years. Such terrific growth can be attributed to its immense pricing power and robust share of the AI chip market. For example, Nvidia's flagship H100 AI graphics processing unit (GPU) -- which is in hot demand and reportedly commands a waiting period between 36 and 52 weeks -- reportedly costs $3,320 to manufacture, according to investment bank Raymond James. Nvidia reportedly sells each H100 processor at an average price of $30,000, commanding a huge profit on each unit of this AI chip. Given that Nvidia is expected to sell 2 million units of this chip in 2024, it could generate $60 billion in revenue from sales of this single processor this year. And given the potential margin that it enjoys on the sale of each H100, it should be able to generate a sizable profit from the same. Nvidia is bringing new chips to the market as well, such as the H200. This will be a successor to the H100 and is expected to go on sale this year. Given that the H200 will be more powerful than Nvidia's current flagship, the company could price it higher and generate a bigger profit. Moreover, with Nvidia controlling more than 85% of the AI chip market, it is in a solid position to capitalize on this lucrative space that's expected to generate $400 billion in revenue in 2027, as compared to $45 billion in 2023. As a result, don't be surprised to see Nvidia's earnings actually jumping to $24 per share in fiscal 2026. If we multiply the projected fiscal 2026 earnings with Nvidia's five-year average earnings multiple of 42, its stock price could jump to just over $1,000 per share over the next couple of years. That points to 75% gains from current levels. With shares of Nvidia trading at just 27 times forward earnings right now -- a discount to the Nasdaq-100's forward earnings multiple of 29 -- investors are getting a good deal on this AI stock, considering the healthy gains it could deliver. While Nvidia is a top pick to take advantage of growing investments in AI hardware, Cloudflare presents a different kind of opportunity to capitalize on this market. Cloudflare is a provider of cloud-based internet infrastructure services that help improve the performance, reliability, and security of internet connections. OpenAI turned to Cloudflare at the end of 2022 when its chatbot -- ChatGPT -- exploded in popularity. The AI start-up adopted Cloudflare's bot management solutions, distributed denial of service (DDoS), and content delivery network (CDN) to manage the huge load on its network and keep fraudulent users at bay. The good part is that Cloudflare has been winning more AI-related contracts from customers who are looking to securely collect AI and machine learning data and maintain privacy at the same time. What's more, Cloudflare has set its sights on a lucrative AI niche that could unlock a new growth opportunity for the company in the long run. Cloudflare is aggressively rolling out a cloud-based AI inference platform across the globe. The company deployed graphics cards meant for AI inference in 100 cities by the end of 2023. By the end of this year, management expects to \"have inference-optimized GPUs running in nearly every location where Cloudflare operates worldwide, making us easily the most widely distributed cloud-AI inference platform.\" The company operates data centers in 300 cities globally, and it has been deploying GPUs from Nvidia in these locations to capitalize on the potential boom in AI inference applications. Cloudflare points out that the availability of Nvidia's powerful GPUs and AI software on its cloud platform will allow customers to run large language models (LLMs) in a cost-effective manner, as they won't have to spend huge amounts of money on hardware. Such a catalyst explains why Cloudflare is anticipated to maintain impressive revenue growth.  NET Revenue Estimates for Current Fiscal Year data by YCharts What's more, analysts are expecting its earnings to increase at an annual rate of 62% for the next five years. Using Cloudflare's 2023 earnings estimate of $0.46 as the base, its bottom line could jump to $5.13 per share at the end of 2028. If we use the Nasdaq-100's forward earnings multiple of 29 as a benchmark for tech stocks and expect Cloudflare to sport a similar multiple after five years, its stock price could jump to $149. That would be a 91% increase from current levels, which is why investors may want to consider buying this AI winner before it moves higher following 68% gains in the past year. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Cloudflare and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}