{
    "title": "Looking For Other Tech Names Outside Of NVDA? Here's More! - Invesco QQQ \nTrust, Series 1 (NASDAQ:QQQ)",
    "date": "1/26/2024",
    "url": "https://www.benzinga.com/tech/24/01/36807796/looking-for-other-tech-names-outside-of-nvda-heres-more",
    "text": "The tech rally has been lovely to investors over the past few months. The tech-heavy index QQQ QQQ closed at all-time highs last week. Of course, everyone’s favorite stock to discuss throughout this run has been Nvidia NVDA, which is understandable, with it being up 250 percent in the past year. We wanted to give you more tech names that are also rising and could approach all-time highs. Let’s look at two specific cloud names: Salesforce CRM and Adobe ADBE. Salesforce is up about 95 percent over the past year and about 11 percent from all-time highs. Salesforce is a software company that sells its products to large companies under a subscription model for operations and customer relationships. Recently, it received an upgrade from Wall Street analysts, with the most prominent reason being a potential rise in subscription prices. Considering how everything costs more these days, it would not be surprising to see Salesforce raise prices for their customers in 2024. Not to mention, Adobe is up about 80 percent over the past year and about 15 percent from its all-time highs. Like Salesforce, Adobe has software products sold to the public via a subscription-based model. It also has a document cloud service that is growing twice as fast as DocuSign DOCU. The charts for both Adobe and Salesforce names show that the monthly time frames have interesting setups. In our opinion, Salesforce's all-time highs could be tested once it breaks over 285. As for Adobe, the key levels we are monitoring are 635 and 675-680 areas. If those levels are cleared, 700 might be on the horizon for this one. Do you like these two cloud names, and can their rise continue? Give us a shout on X, and let us know what you think!  If you are on Twitter, now known as “X,” feel free to follow @ThrashCapital for more content! This article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}