{
    "title": "If Nvidia looked more like Salesforce, it might unlock billions more in cash",
    "date": "1/5/2024",
    "url": "https://www.marketwatch.com/story/if-nvidia-looked-more-like-salesforce-it-might-unlock-billions-more-in-cash-analyst-says-03bd6cf0",
    "text": "Nvidia Corp. is raking in billions in cash, but one analyst thinks the chip maker could throw $100 billion more onto the pile if it started to look more like Salesforce Inc. Nvidia \n        NVDA,\n        +3.12%\n       might unlock even more cash by developing businesses that expand recurring revenue, according to BofA Securities analyst Vivek Arya. The company has suffered some boom-and-bust cycles in recent years, and another bust could be smoothed by developing longer-term software contracts akin to those of Salesforce \n        CRM,\n        -0.20%.\n      , Workday Inc. \n        WDAY,\n        +0.37%\n       and ServiceNow Inc. \n        NOW,\n        +0.13%,\n       which generate recurring revenue from their customers. Arya sees a pathway for Nvidia to rake in $100 billion in incremental free cash flow over the next two years if it can bulk up its own recurring-revenue options. Read: Apple’s stock needs to get ‘unstuck’ — and its innovation rut may not be helping “While NVDA has a solid lead in AI, hardware-oriented businesses are not valued as highly as visibility tends to be limited,” Arya wrote. Nvidia generates only about $1 billion, or 2%, of its sales from software and subscriptions. Arya doesn’t think the company can get much higher than $5 billion with its software and subscription offerings unless it turns to acquisitions. Nvidia has shown some openness to deals that would beef up its intellectual property and software offerings, Arya notes, as it tried to buy British chip designer Arm Holdings \n        ARM,\n        +0.41%\n       before facing regulatory pushback. “We envision [Nvidia] considering more enhanced partnerships/M&A of software companies that are helping traditional enterprise customers deploy, monitor and analyze [generative AI] apps,” he wrote. Nvidia “is already serving them via on-premise hardware and/or its DGX cloud service, but we believe greater direct recurring software/service channel could be more impactful.” The addition of more recurring-revenue streams could help Nvidia’s “relatively depressed trading multiple,” in Arya’s view. Nvidia shares trade at a 20% to 30% discount to its “Magnificent Seven” peers on the basis of price to earnings as well as enterprise value to free cash flow, even though the company’s compound annual growth rate on the top line is three times what it is for those other tech giants. The discount is “partly due to uncertainty in [calendar 2025] growth prospects, and partly due to a very hardware-dependent business unlike other large-cap software/internet peers that have recurring-revenue profiles,” he wrote. Arya has a buy rating and $700 price objective on the stock. See also: Amazon’s stock could be helped by this secret weapon in 2024, BofA says Strong labor markets and wage growth contributed to rising rents in these markets, according to Zillow. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}