{
    "title": null,
    "date": "1/10/2024",
    "url": "https://www.fool.ca/2024/01/10/forget-nvidia-buy-this-unstoppable-growth-stock-instead/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. NVIDIA (NASDAQ:NVDA) is a very impressive growth stock, but EQB Inc (TSX:EQB) is arguably better. Image source: Getty Images NVIDIA (NASDAQ:NVDA) has been rallying hard over the last 12 months. It started 2023 at $240 and rallied to $531 over the course of a year. If you’d invested $10,000 in the stock at the beginning of last year and held to today, you’d have $21,500 by now. If the stock keeps up its momentum in the coming months, it could overtake Amazon’s market capitalization. If that were to occur, investors would experience very good returns. The problem is, there’s a lot of uncertainty as to whether it can happen. NVIDIA’s stock already trades at nosebleed multiples; for example, 29 times sales and 39 times book value. These multiples make NVIDIA one of the most expensive U.S. tech stocks — and that group of stocks isn’t known for cheapness, to put it mildly. You can find stocks with growth rates similar to NVIDIA’s without the outrageous price tag. In this article, I will explore one such stock that just so happens to be listed on Canada’s own TSX Composite Index. EQB (TSX:EQB) is a Canadian bank that operates primarily online. It is known for its high-yielding Guaranteed Investment Certificates (GICs), which pay as much as 5.5%. It is also known for having much faster growth than the average Canadian bank, which is a big part of why its stock has risen over the last 12 months when most Canadian bank stocks declined in price in the same period. Apart from its high-yielding GICs, another thing EQB is known for its rapid growth. In its most recent quarter, it delivered the following metrics: These are all excellent growth metrics. EQB’s sales and earnings are not growing quite as fast as NVIDIA’s, but they are growing more than the average bank’s sales and earnings are. And, of course, EQB is much cheaper than NVIDIA, as I’ll show in the next section. One advantage that EQB has over NVIDIA stock is its valuation. Whereas NVDA trades at 29 times sales and 61 times earnings, EQB trades at the following: That’s a pretty cheap valuation. In fact, it’s so cheap that you might think there must be something wrong with EQB as a company for it to get so cheap. However, after looking into the matter, I concluded that EQB is a quality bank that practices sound risk management. It has a very high liquidity coverage ratio (339%), a full 239% higher than what regulators require. It also has a deposit base that’s mostly made up of GICs, which are “locked up” for a period of time, limiting the possibility of a bank run at EQB. These factors, along with the raw growth and valuation numbers, lead me to think that EQB is a growth stock worth looking at. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 22, 2024 |\n        Karen Thomas, MSc, CFA Well Health stock has been hit hard in the last three years, yet fundamentals remain strong and keep hitting records. Read more » March 22, 2024 |\n        Amy Legate-Wolfe This growth stock has been on a tear in 2023 and 2024, with even more likely for this year and… Read more » March 22, 2024 |\n        Joey Frenette Constellation Software (TSX:CSU) stock looks more like a must-buy for investors seeking tech at a reasonable price. Read more » March 22, 2024 |\n        Amy Legate-Wolfe WELL Health (TSX:WELL) stock had a huge climb and an even larger fall. And that fall continued this week after… Read more » March 21, 2024 |\n        Joey Frenette Docebo (TSX:DCBO) is another impressive AI company in the Canadian tech scene that's overlooked by many. Read more » March 21, 2024 |\n        Aditya Raghunath Open Text is a tech stock trading at a massive discount to consensus price target estimates in 2024. Read more » March 21, 2024 |\n        Amy Legate-Wolfe Lightspeed (TSX:LSPD) stock has hit major highs but remains at its lowest lows. So, what would it take to surge… Read more » March 21, 2024 |\n        Andrew Button Constellation Software (TSX:CSU) shares cost nearly $4,000. Will the company do a stock split? Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. ©  2024 The Motley Fool Canada, ULC. All rights reserved. "
}