{
    "title": null,
    "date": "1/25/2024",
    "url": "https://markets.businessinsider.com/news/stocks/broadcom-stock-reaches-record-heights-on-semiconductor-ai-boom-how-high-do-analysts-expect-it-to-climb-1032997560",
    "text": "Broadcom Inc (NASDAQ:AVGO) stock made new all-time highs on Wednesday as it recorded a high of $1,284.55 during the trading day. The high-end of the 52-week range for the stock now stands at $1,284.55. This fabless giant, best known for its extensive range of semiconductors and infrastructure software solutions, has been buoyed through 2023 by the semiconductor boom. The AI-fueled semiconductor surge pushed Broadcom’s stock over 114% higher in the past year, vastly outperforming its industry-tracking iShares Semiconductor ETF (NASDAQ:SOXX) and the broad market S&P 500 Index, which has gained 21.20%. For the past year, Broadcom's stock has been fueled by: Also Read: Here’s How Much $100 Invested In Broadcom 10 Years Ago Would Be Worth Today  Broadcom stands in a strong position to capitalize on the ongoing digital transformation and the rise of artificial intelligence. Broadcom’s business is characterized by solid financial performance marked by consistent revenue growth, increased profitability, and a strong balance sheet. As a widely exposed company, Broadcom is poised to leverage the opportunities presented by the ongoing digital revolution. With a substantial presence across diverse end markets, the company prioritizes quality and customer value over a sheer quantity-focused approach, aligning itself strategically with the global trend toward digitalization. On the valuation front, Broadcom stock currently offers better value relative to its fabless peers, Advanced Micro Devices Inc (NASDAQ:AMD) and NVIDIA Corp (NASDAQ:NVDA). While Broadcom’s forward P/E is pegged at 22.47, AMD’s is at 45.69 and Nvidia at 30.38. Qualcomm Inc (NASDAQ:QCOM), another fabless semiconductor peer, is at 14.66. The price trajectory above, as represented by growth of a $1000 each invested in each of these stocks, indicates Broadcom and AMD’s close correlation. Data compiled from Yahoo Finance.  Comparing the two fabless correlated competitors, Broadcom’s stock appears to offer better value than AMD stock. AMD’s Trailing P/E currently stands at a whopping 1,620.82. Even when AMD’s P/E is rationalized on a forward earnings basis, Broadcom’s stock appears to be the better value by good measure. However, recent analyst ratings on the stock do not indicate much upside from here. Goldman Sachs on Jan. 19 maintained a Buy rating on the stock with a price target of $1,325, implying an upside of 4.79%. Cantor Fitzgerald, which initiated coverage on the stock on Jan. 23, has a price target of $1,300 implying a 2.81% upside. Now Read: ‘Data As The New Oil’: Semiconductors ‘Catching Up’ With GDP In 2024, Says Analyst Photo: Shutterstock Indices Commodities Currencies Stocks "
}