{
    "title": "Nvidia CEO makes first China tour in years as US curbs roil AI",
    "date": "1/22/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/nvidia-ceo-makes-first-china-tour-years-us-curbs-roil-ai",
    "text": "Hello, your email is unverified. Please confirm  for access to all your SPH accounts. Create a free account with Business Times  for seamless access across SPH Media products. Welcome,  Create a free account with Business Times  for seamless access across SPH Media products. Welcome,   \"Nvidia CEO makes first China tour in years as US curbs roil AI\" Already have an account? Log in The Business Times Personal Edition at$9.90/month*\nSUBSCRIBE NOW\nFind out more about subscription packages here. Find out more about subscription packages here. The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. Subscribe to The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. NVIDIA co-founder Jensen Huang celebrated the new year with staff during his first trip to China in four years, a low-key tour that coincided with growing concerns about Beijing’s ability to get around United States chip restrictions. He visited Nvidia’s offices in Shenzhen, Shanghai and Beijing earlier this month, according to a source familiar with the matter. Images and videos of the 60-year-old donning colourful traditional garb and dancing with staff emerged online over the weekend. It was not clear if he’d held formal meetings with other executives or officials, said the source, who asked not to be named discussing a private visit. Huang embarked on his tour – first reported by state newspapers off Chinese social media posts – as Nvidia’s artificial intelligence (AI) accelerators become pivotal in a tech race between Washington and Beijing. Huang has warned that an escalation in sanctions designed to cut off the flow of AI training chips could drive Chinese firms to develop their own alternatives. That could harm American tech leaders in the long run, he has said. The Nvidia co-founder name-checked Huawei Technologies – which in 2023 alarmed Washington by including an advanced made-in-China processor in a smartphone – as a potential rival. An Nvidia representative confirmed Huang had celebrated the upcoming Chinese New Year with staff, without elaborating. Nvidia, which more than tripled its market value in 2023 thanks largely to its pivotal role in AI development, is up another 20 per cent this year as investors bet on its sector leadership. It is designed versions of its semiconductors for China that it says are compliant with successive rounds of US sanctions, as Washington watches closely. Among the social media posts, one person describing himself as an Nvidia staffer shared an image of Huang handing over a raffled Nvidia GeForce RTX 4080 graphics card. The CEO has since moved on to Taiwan, according to local newspaper EDN, for his fourth visit to the island in less than a year. BLOOMBERG The hottest news on all things startup and tech to kickstart your week. BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to t.me/BizTimes Now that you have experienced myBT with just a few keywords, subscribe to BT Premium to get full-access. You have reached your limit of 30 keywords.\nTo follow new keywords, edit your myBT settings. Get the latest coverage and full access to all BT premium content. Browse corporate subscription here  SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}