{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.fool.com/investing/2024/01/17/is-nvidia-stock-a-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More A boom in artificial intelligence (AI) last year highlighted Nvidia's (NVDA 3.12%) business, as its graphics processing units (GPUs) became the preferred hardware for developers worldwide. Increased interest in AI sent demand for the chips skyrocketing, with Nvidia well-positioned to supply its GPUs to the entire market. As a result, the company's stock and earnings soared in 2023, with its shares up 241% year over year. Demand for the high-powered chips looks unlikely to dissipate in 2024. A Reuters report revealed on Jan. 11 that India data center company Yotta plans to purchase more AI GPUs from Nvidia worth $500 million, taking its total order book with the chipmaker to $1 billion. Nvidia will have to contend with increased competition in the chip market this year as various rivals release their own AI GPUs. However, the industry is expanding rapidly, with the company's dominance unlikely to falter any time soon. Here's why Nvidia's stock remains a no-brainer buy this January. Over the last year, countless companies have announced ventures into the AI chip market after witnessing Nvidia's meteoric rise. Leading chipmakers Advanced Micro Devices and Intel both have plans to begin shipping new GPUs soon in an attempt to chip away at Nvidia's market share. Plenty of companies new to the industry are also joining in, with Amazon, Microsoft, and Alphabet all announcing ventures into AI chips last year. However, history suggests Nvidia's sovereignty will be a tough nut to crack. The company has held an over 80% market share in desktop GPUs for years, despite AMD's and Intel's presence in the sector. Intel only joined the industry last year, while AMD's history in desktop GPUs spans decades. Still, AMD's chips are more popular with enthusiasts than large-volume system builders, and they only represent about 10% of the market. A similar situation has occurred in another area of the chip market. Intel was a king in central processing units (CPUs) for years, with an 82% market share at the start of 2017 when AMD landed on the scene with its Ryzen line of CPUs. AMD has managed to steal a significant share from Intel since then. However, Intel still holds a market share above 60% in CPUs, with AMD's share at 35%. In 2023, Nvidia's rise to the top of AI saw it attain an estimated 90% market share in AI GPUs. There may be an onslaught of new rivals in the industry this year, but history suggests the company will likely remain the preferred chip supplier for years. In the third quarter of fiscal 2024, Nvidia posted revenue growth of 206% year over year, hitting $18 billion. Meanwhile, operating income soared more than 1,600% to $10 billion. This immense growth was mainly due to a 279% increase in data center revenue, representing a spike in AI GPU sales. Nvidia has enjoyed multiple quarters of glowing results due to a surge in chip demand, but the industry appears to be just getting started. According to data from Grand View Research, the AI market hit $197 billion last year and is projected to expand at a compound annual growth rate of 37% until at least 2030. That trajectory would see the sector exceed $1 trillion before the end of the decade, suggesting Nvidia still has plenty of room left to run. Additionally, Nvidia is profiting from a gradual recovery in the PC market. PC shipments have been in decline for much of the last two years because of macroeconomic headwinds, falling 16% in 2022 and continuing to tumble for most of 2023. However, a recovery finally seems to be underway. PC shipments increased by 0.3% in Q4 2023. Meanwhile, Nvidia's gaming segment (which includes PC component sales) reported revenue growth of 81% in its latest quarter. Alongside AI, Nvidia could be in for another stellar growth year in 2024 as PC sales improve.  Data by YCharts. Moreover, the chart above shows Nvidia's earnings could hit $24 per share by fiscal 2026. That figure, multiplied by its forward price-to-earnings ratio of 45, implies a potential stock price of $1,080 per share, projecting a potential growth of 91% over the next two fiscal years. It's a lofty target, but based on reasonable financial projections. Nvidia still has plenty to offer new investors with its powerful role in AI and secular tailwinds in other areas of tech, making its stock a no-brainer right now. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}