{
    "title": null,
    "date": "1/29/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-nvda-sec-filing-2024-01-29/",
    "text": "Bourgeon Capital Management LLC decreased its holdings in NVIDIA Co. (NASDAQ:NVDA - Free Report) by 94.4% in the 3rd quarter, according to the company in its most recent Form 13F filing with the SEC. The firm owned 323 shares of the computer hardware maker's stock after selling 5,431 shares during the quarter. Bourgeon Capital Management LLC's holdings in NVIDIA were worth $141,000 at the end of the most recent reporting period. Several other hedge funds and other institutional investors have also made changes to their positions in the business. Von Berge Wealth Management Group LLC raised its holdings in NVIDIA by 2.6% in the second quarter. Von Berge Wealth Management Group LLC now owns 930 shares of the computer hardware maker's stock valued at $393,000 after acquiring an additional 24 shares in the last quarter. Moody Lynn & Lieberson LLC raised its holdings in NVIDIA by 7.2% in the third quarter. Moody Lynn & Lieberson LLC now owns 89,053 shares of the computer hardware maker's stock valued at $38,737,000 after acquiring an additional 5,998 shares in the last quarter. DBK Financial Counsel LLC acquired a new stake in NVIDIA in the second quarter valued at approximately $265,000. IFM Investors Pty Ltd raised its holdings in NVIDIA by 4.9% in the second quarter. IFM Investors Pty Ltd now owns 488,552 shares of the computer hardware maker's stock valued at $206,667,000 after acquiring an additional 22,809 shares in the last quarter. Finally, Mayport LLC raised its holdings in NVIDIA by 69.6% in the second quarter. Mayport LLC now owns 1,833 shares of the computer hardware maker's stock valued at $775,000 after acquiring an additional 752 shares in the last quarter. Hedge funds and other institutional investors own 64.79% of the company's stock. Wall Street Analyst Weigh In A number of research firms have weighed in on NVDA. Piper Sandler reissued an \"overweight\" rating and set a $620.00 price objective on shares of NVIDIA in a report on Friday, November 17th. Bank of America raised their price objective on shares of NVIDIA from $650.00 to $700.00 and gave the stock a \"buy\" rating in a report on Wednesday, November 22nd. Stifel Nicolaus reissued a \"buy\" rating and set a $600.00 price objective on shares of NVIDIA in a report on Friday, November 17th. KeyCorp raised their price objective on shares of NVIDIA from $650.00 to $740.00 and gave the stock an \"overweight\" rating in a report on Tuesday, January 16th. Finally, JPMorgan Chase & Co. raised their price objective on shares of NVIDIA from $600.00 to $650.00 and gave the stock an \"overweight\" rating in a report on Wednesday, November 22nd. One analyst has rated the stock with a sell rating, four have given a hold rating, thirty-four have given a buy rating and one has assigned a strong buy rating to the company. According to data from MarketBeat, the stock presently has an average rating of \"Moderate Buy\" and an average target price of $608.30. Get Our Latest Stock Report on NVIDIAInsider Transactions at NVIDIA In other news, Director John Dabiri sold 218 shares of the business's stock in a transaction dated Friday, November 24th. The stock was sold at an average price of $484.99, for a total transaction of $105,727.82. Following the completion of the sale, the director now owns 2,183 shares in the company, valued at approximately $1,058,733.17. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC website. In other news, Director Mark A. Stevens sold 10,000 shares of the business's stock in a transaction dated Monday, November 27th. The stock was sold at an average price of $483.18, for a total transaction of $4,831,800.00. Following the completion of the sale, the director now owns 989,831 shares in the company, valued at approximately $478,266,542.58. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, Director John Dabiri sold 218 shares of the business's stock in a transaction dated Friday, November 24th. The stock was sold at an average price of $484.99, for a total value of $105,727.82. Following the sale, the director now owns 2,183 shares of the company's stock, valued at approximately $1,058,733.17. The disclosure for this sale can be found here. In the last quarter, insiders sold 155,216 shares of company stock worth $79,810,950. 3.99% of the stock is currently owned by company insiders. NVIDIA Trading Down 1.0 % Shares of NVDA stock opened at $610.31 on Monday. NVIDIA Co. has a twelve month low of $189.50 and a twelve month high of $628.49. The firm has a 50-day moving average price of $509.14 and a 200 day moving average price of $470.85. The company has a current ratio of 3.59, a quick ratio of 3.06 and a debt-to-equity ratio of 0.25. The company has a market capitalization of $1.51 trillion, a price-to-earnings ratio of 80.52, a PEG ratio of 4.08 and a beta of 1.64. NVIDIA (NASDAQ:NVDA - Get Free Report) last posted its quarterly earnings data on Tuesday, November 21st. The computer hardware maker reported $4.02 EPS for the quarter, beating analysts' consensus estimates of $3.03 by $0.99. NVIDIA had a net margin of 42.10% and a return on equity of 72.28%. The company had revenue of $18.12 billion during the quarter, compared to the consensus estimate of $16.19 billion. During the same quarter in the prior year, the company posted $0.34 EPS. The company's quarterly revenue was up 205.5% compared to the same quarter last year. Research analysts forecast that NVIDIA Co. will post 11.08 earnings per share for the current fiscal year. NVIDIA Announces Dividend The business also recently disclosed a quarterly dividend, which was paid on Thursday, December 28th. Stockholders of record on Wednesday, December 6th were paid a dividend of $0.04 per share. This represents a $0.16 dividend on an annualized basis and a dividend yield of 0.03%. The ex-dividend date of this dividend was Tuesday, December 5th. NVIDIA's dividend payout ratio is currently 2.11%. NVIDIA Profile (Free Report) NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, and internationally. The company's Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building 3D designs and virtual worlds.Featured ArticlesFive stocks we like better than NVIDIAWhy Special Dividends Can be a Delightful Surprise for Income InvestorsRetailers see earnings growth ahead but investors are lukewarmDividend Payout Ratio CalculatorMarketBeat Week in Review: 1/22 - 1/26Where to Find Earnings Call TranscriptsThe next meme stock: 6 tickers leading a meme stock revival Want to see what other hedge funds are holding NVDA? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for NVIDIA Co. (NASDAQ:NVDA - Free Report).This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Fed launches fourth dollar overhaul (From Stansberry Research) (Ad)Should you invest $1,000 in NVIDIA right now?Before you consider NVIDIA, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list.While NVIDIA currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here Ten Starter Stocks For Beginners to Buy NowJust getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider NVIDIA, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list. While NVIDIA currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. Because Nvidia already commands about 80% of the market, is advancing technology today, and is raising prices, it should continue to grow and outperform expectations for the foreseeable future. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}