{
    "title": "McGuire on Meta: Better than any other Mega?",
    "date": "1/31/2024",
    "url": "https://stockhead.com.au/news/peter-previews-meta-better-than-any-other-mega/",
    "text": "SEPTEMBER 13: NVIDIA CEO Jensen Huang, Google CEO Sundar Pichai and Meta CEO Mark Zuckerberg  on Capitol Hill, September  2023 in Washington, DC.   (Photo by Chip Somodevilla/Getty Images) News January 31, 2024February 1, 2024 |  Christian Edwards Link copied to clipboard It’s hard to believe that Facebook has a parent company. But there you have it. Harder even to believe (CEO Mark Zuckerberg) Zuck’s Mommy Meta Platforms Inc (Meta) turned out to be a pretty good idea, well handled. Meta was the second-best performing stock of the entire S&P500 index in 2023, lagging only behind Nvidia (NVDA). If US tech stocks were expected to underperform this year – having splurged without remorse from their late 2022 lows – well,  there have been no signs of an impending comeuppance just yet. But it’s a big week on Wall Street and these coming few days will be a major test of whether the Magnificent 7 can justify their Mega Tech titles.   Stockhead asked XM’s CEO Peter McGuire to unpack what makes Meta’s tech tick; how the Dunce of ’22 became the Duke of ’23 and why he reckons 2024 could prove to be even better…   From his Fortress of Sunytude in Coogee, Peter told Stockhead over the weekend that Meta’s outperformance last year has been the source of much analyst discussion – with Wall Street largely putting down the turnaround to “positive idiosyncratic and macroeconomic developments.”  Basically that means The Zuck surprised all by apparently listening to the flood of criticism which flowed his way after pursuing his ill-defined Meta dream, which became a cash-sucking nightmare. “Meta slashed thousands of jobs in 2023 to improve its operational efficiency and reduce costs, which seems to have not impacted its growth capacity. More importantly though, management’s decision to stop throwing huge amounts of cash into the Metaverse project has been the key turning point.” Instead, Pete says, Meta focused on how artificial intelligence (AI) could improve its core business through user engagement and monetisation. “Without directly selling AI products or services, but through the use of such tools, Meta managed to ride the AI wave and capitalise on what has been the main theme in stock markets. “Besides that, Meta largely benefited from the rebound in advertising activity as recession fears melted away and the base case scenario for the US economy shifted to a soft-landing.  Meta has taken the necessary steps to improve its operational efficiency and increase user engagement in its platforms via the use of AI tools, according to UBS. Pete says this alone has led to a significant resurgence in its advertising business, whose revenue is anticipated to have grown by 21% in Q4. “Of course, with 2024 being a year packed with elections and major sports events such as the Olympics and European Football Championship, it seems that Meta has the necessary setup to take full advantage of the upcoming wave of ad spending.” However, there are also some risks on the horizon. “Meta is in a constant battle with TikTok and Snapchat for the social media platform crown, forcing the firm to continuously invest in new features to stay on top of competition. “Meanwhile, its strategic shift towards advertising has proved beneficial so far, but its concentrated business is exposed in the case of a severe downturn in the economy,” he adds.  Meta’s restructuring has significantly bolstered its profit margins without jeopardizing growth and that’s expected to show up in the Q4 financials. For the last quarter of 2023, forecasts by Refinitiv analysts suggest that revenue is projected at $39.13 billion, which would represent a 21.67% increase on an annual basis. Meanwhile, earnings per share (EPS) are expected to grow by a staggering 181% relative to the same quarter last year, jumping from $1.67 to $4.95.” “Despite the relentless rally in equity markets and particularly in tech stocks, it could be argued that Meta’s shares remain in an attractive territory, considering analysts’ growth estimates,” Peter told Stockhead. “The 12-month forward price-to-earnings ratio, which denotes the dollar amount someone would need to invest to receive back one dollar in annual earnings, currently stands at 22.2x.” This ratio is way, way lower than the  tech-heavy Nasdaq’s average multiple of 26.5x.    Pete says Meta’s consecutive record highs ahead of earnings this week aren’t going to bother too many enthusiasts. “Gven that Meta’s stock is already trading at record highs and its multiples are pretty reasonable, it could be argued that there is still significant upside potential. In any case, even if Meta fails to deliver the anticipated performance, its valuation does not leave much room to the downside. “Meta’s staged a full-scale recovery since its 2022 bottom of $87.20, jumping to consecutive higher highs in the past few sessions.” Meta: Weekly technicals “Should earnings surprise to the upside, the stock might extend its series of higher highs and claim the $400 psychological mark. Even higher, further advance could cease at $454, which is the 123.6% Fibonacci projection of the $384-$87.50 downleg. “Alternatively, if earnings reflect some weakness, the price could reverse towards the 2021 peak of $384. A break below that region might pave the way for the 78.6% Fibo of $320.” Link copied to clipboard Get the latest Stockhead news delivered free to your inbox.  It's free. Unsubscribe whenever you want. By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy. Mining Mining Mining Get the latest stock news and insights straight to your inbox.  By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy. Stockhead is providing factual information where there is a reasonable likelihood of doubt.\n\t\t\t\t\t\tThe information is not intended to imply any recommendation or opinion about a financial product. A note about relevant advertising \n\t\t\t\t\t\tWe collect information about the content (including ads) you use across this site and use it to make both advertising and content more relevant to you on our network and other sites.\n\t\t\t\t\t\tThis is also known as Online Behavioural Advertising. You can find out more about our policy and your choices, including how to op-out here For investors, getting access to the right information is critical. Stockhead’s daily newsletters make things simple: Markets coverage, company profiles and industry insights from Australia’s best business journalists – all collated and delivered straight to your inbox every day. Markets coverage, company profiles and industry insights from Australia’s best business journalists – all collated and delivered straight to your inbox every day. It’s free. Unsubscribe anytime. By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy.  Get the latest Stockhead news delivered free to your inbox.   Email Lists\n\n\nMorning Update\n\n\nLunch Update\n\n\nMarket Close Update\n\n\nWeekend Update By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy "
}