{
    "title": "Samsung's Jay Y. Lee's Court Win Fuels Company's Ambitions, Sharpens Nvidia \nRivalry",
    "date": "2/5/2024",
    "url": "https://www.tradingview.com/news/benzinga:181d5ebde094b:0-samsung-s-jay-y-lee-s-court-win-fuels-company-s-ambitions-sharpens-nvidia-rivalry/",
    "text": "Samsung Electronics Co SSNLF, led by Executive Chairman Jay Y. Lee, achieved a significant legal victory when a Seoul court acquitted him of stock manipulation charges. This decision enables Lee to continue leading the conglomerate, the world’s largest manufacturer of memory chips and displays, amid a global downturn and increasing competition from Apple Inc AAPL in smartphones and SK Hynix Inc in artificial intelligence. The Nvidia Corp NVDA rival targets commercializing advanced 2-nm technology chips by 2025 and 1.4-nm chips by 2027. The court’s ruling dismissed the threat of imprisonment that had loomed over Lee, a key figure in South Korea’s business landscape, for years, Bloomberg reports. In 2023, South Korean prosecutors sought a jail term for Samsung’s Lee Jae-yong over alleged accounting fraud and stock price manipulation. The case centered on allegations related to the 2015 merger of Samsung C&T Corp and Cheil Industries Inc, which prosecutors claimed was manipulated to strengthen Lee’s control over the conglomerate. However, the judge cited significant flaws in the prosecution’s case, including inadmissible evidence and a lack of proof regarding Lee’s intentions or misleading shareholders. In 2022, the Samsung board approved the appointment of Jay Y. Lee as Executive Chair of the company, citing an uncertain global business environment. Lee would likely succeed to the throne after his father died in 2020. However, graft investigations and two stints in jail delayed the appointment. Lee battled bribery and corruption investigations dating back to 2017. In August, he won a presidential pardon. This legal outcome arrives at a crucial time for Samsung as the company navigates through a challenging period marked by declines in the smartphone and memory chip markets, as evidenced by its fourth consecutive quarter of profit decline. Additionally, Samsung is working to catch up with SK Hynix in the high-bandwidth memory sector, which is vital for AI model training. The company reported a 40% increase in HBM sales in the December quarter, indicating a recovery in memory demand and an expected rise in mobile shipments. Price Action: NVDA shares traded higher by 3.08% at $682.00 premarket on the last check Monday. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @newcapitalfx @Crypto Playhouse @santiagomartinez.tk @2_beans @matg.fxt @garret_duke @tradingauto6 @nasdaq.forex @tradeindicators @aleshkenderoficial @mytradingsetup @ketory_fx @2prettykittens @TradingView @tradingjunkies.shop @rehanams @AthanT_ @rajpalgore Whatever the trade "
}