{
    "title": "The Nvidia effect: stock surges and Big Tech players scramble for more \ninvestments",
    "date": "2/17/2024",
    "url": "https://www.thenationalnews.com/business/technology/2024/02/18/the-nvidia-effect-stock-surges-and-big-tech-players-scramble-for-more-investments/",
    "text": "Nvidia co-founder and chief executive Jensen Huang, seen at a special discussion in Dubai, has become the face of the AI chip revolution. Chris Whiteoak / The National Nvidia co-founder and chief executive Jensen Huang, seen at a special discussion in Dubai, has become the face of the AI chip revolution. Chris Whiteoak / The National Several of the technology industry's biggest names have made moves to boost their investments in generative artificial intelligence, indicating that the frenzy for the much-hyped sector isn't slowing down anytime soon. Masayoshi Son, chief executive of Japanese investment holding company SoftBank Group, is seeking as much as $100 billion to fund an AI chip-making venture, Bloomberg reported on Friday. While that pales in comparison to the $7 trillion reportedly being sought by OpenAI boss Sam Altman, who has a similar goal of boosting the world’s chip-building capacity to power AI, it is clear that investors see the technology's potential. Industry major Intel, meanwhile, is reported to be in talks with Washington to receive $10 billion in incentives under the US Chips Act. This is part of a planned incentives programme to be handed out by the end of March as the world's biggest economy also seeks to accelerate domestic semiconductor manufacturing. Whether intended or not – people familiar with the SoftBank situation say it is – the market seems to be taking some, or maybe a lot, of pages from the playbook of Wall Street's new darling – Nvidia. The chip company is riding a hot streak thanks to the generative AI craze. When the company's market capitalisation crossed the trillion-dollar mark again in August – it first did so in May – its stock had surged 133 per cent over the past 12 months and seven-fold in the last five years. Since then, the share price of the company founded and led by chief executive Jensen Huang kept skyrocketing and has added a further 65 per cent to hit $726.13 as of Friday's close. It has swelled so much that California-based Nvidia's market cap, currently at $1.79 trillion, this week surpassed those of two other tech giants – Alphabet and Amazon, placing it behind only Apple and Microsoft. “The soaring increase in spending on AI has exceeded expectations and tangible results are already being seen,” Antonio Di Giacomo, a market analyst at XS.com, wrote in a note. “[Nvidia's] central role in this emerging trend is driving its success and positioning it as a key player in today's technology landscape.” Nasdaq Analyst Research recommends a “strong buy” on Nvidia stock, with estimates as high as $1,200 and as low as $560, based on 40 analysts. Companies are in fierce competition, \"from the race to rule AI to making blockbuster investments”, CB Insights said. And it's not only Nvidia's direct rivals that are benefiting from the company's ascent to market superstardom. Even companies acquired by Nvidia are enjoying the AI-fuelled fame – especially after Nvidia on Thursday disclosed its stakes in them. SoundHound AI, a voice and speech company also based in Silicon Valley, saw its stock surge more than 66 per cent on Thursday alone and nearly two and a half times from a 2023 low last November. Nvidia invested $3.67 million in SoundHound AI in 2017, as part of a $75 million funding round. Nano-X Imaging, a medical imaging system company, saw its stock leap more than double in the past two days, adding about $400 million to its market value, and 156 per cent from a November low. Recursion Pharmaceuticals, in which Nvidia has a $76 million stake, rose more than a third this week, while TuSimple, an autonomous trucking company, more than doubled this week. The only outlier is Arm Holdings, in which Nvidia has a $147.3 million investment. Nvidia attempted but ultimately failed to acquire the UK-based company from SoftBank in 2022. Arm's stock rose 5.7 per cent on Thursday before retreating 4 per cent on Friday. “When people say that the market is doing well this year, they really mean that tech is doing well, and Nvidia is at the core of that,” said Keith Lerner, chief market strategist at Truist Advisory Services. Another key metric to look forward to is Nvidia's fourth-quarter earnings results on February 21. Wall Street pundits expect revenue in the three months ended January 31 to hit nearly $20.38 billion, which would be a surge of almost three and a half times from a year ago. “These projections reflect the market's confidence in continued success and growth in the near future,” Mr Di Giacomo said. Future Beat Your round-up of the stories shaping tomorrow’s world "
}