{
    "title": "The company providing AI servers to Nvidia soars by 201% in 2024 so far",
    "date": "2/25/2024",
    "url": "https://www.moneycontrol.com/news/business/markets/the-ai-server-provider-company-to-nvidia-jumps-by-201-percent-in-2024-so-far-12345651.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now The historic rise in Nvidia's shares in a single trading session has garnered a lot of incremental interest in the already hyped AI-based computing and related technology innovation companies. Super Micro Computer is one popular name in green computing that is creating wealth for its shareholders. The company, which has a partnership with Nvidia, is the world's third-largest server provider with a market share of 5 percent. Capitalising on the explosive growth of the generative AI market, the shares of Super Micro Computer are up by more than 80 percent in one month, while delivering an even more impressive return of 201 percent on year-to-date basis for its shareholders. In the past one year, Super Micro Computer's shares zoomed by more than 705 percent while skyrocketing by more than 4,299 percent in the past 5 years. The company's market cap stood at $48.10 billion. Super Micro Computer outperforms Nvidia & AMD Business with Nvidia Super Micro Computer is heavily dependent upon Nvidia for its business. The California-headquartered firm was able to carve out a high-growth niche with its AI servers as Nvidia worked closely with the company to design a new line of servers and workstations that fully support its H100 GPUs. As Nvidia’s business grew, it directly contributed to the increase in revenue for Super Micro Computer. Super Micro Computer reported net sales of $3.66 billion versus $2.12 billion in the first quarter of fiscal year 2024 and $1.80 billion in the same quarter of last year. For FY 2024, the company recently revised its revenue guidance to $14.3 billion-$14.7 billion from a range of $10 billion to $11 billion. Green Computing Green Computing or Green Technology is nothing but the use of computers and other computing devices and equipment in energy-efficient and eco-friendly ways. Most companies adopt green computing methods such as deploying energy-efficient central processing units (CPUs), servers, peripherals, power systems and other computing equipment. The focus is also on reducing resource use and properly disposing of electronic waste. Super Micro Computer is a leader in designing and delivering the components that make up Green Computing. The company website states that its servers are designed to require less power at a given performance level. In the news The shares of Super Micro Computer are in the news as analysts predict that the company may get strong orders from American semiconductor major AMD, which is looking to shift focus on data centre business that will require high performance servers. Data centre business was the fastest-growing business for Nvidia, as per the company's latest earnings report. Super Micro Computer is expected to sell more AMD-powered AI servers which in turn is expected to reduce the dependency on Nvidia. Super Micro Computer, as of now, generates half of its revenue from AI servers with 10 percent share in the dedicated AI server market. This is expected to rise to 17 percent within the next three years as the entire niche market is likely to expand by 150 percent, according to the estimates of Bank of America. The secular expansion of the artificial intelligence market is expected to provide some lucrative growth stocks options for long-term investors. Super Micro Computer is just one of the several companies profiting from this secular trend. Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}