{
    "title": "Nvidia stock’s single-day gain surpasses Reliance’s m-cap",
    "date": "2/24/2024",
    "url": "https://www.financialexpress.com/market/nvidia-stocks-single-day-gain-surpasses-reliances-m-cap-3403852/",
    "text": "The Financial Express The market capitalisation of Reliance Industries (RIL) at the end of Friday’s trading was Rs 20.2 trillion. That’s humongous, considering that the gap with the second-largest Indian company — Tata Consultancy Services  — is over Rs 5.5 trillion. But RIL’s total m-cap was less than what Nvidia’s shares gained in just one day. The heavyweight chipmaker added $277 billion (Rs 22 trillion) in stock market value on Thursday, after the company’s quarterly report beat expectations and reignited a rally fuelled by optimism about artificial intelligence. In dollar terms, RIL’s m-cap is less than $250 billion. The one-day increase in the stock market value of Nvidia, which controls about 80% of the high-end AI chip market, was also the largest in Wall Street’s history, easily beating a record $196 billion gain by Meta Platforms on February 2 after the Facebook parent declared its first dividend and posted robust results. Thursday’s dizzying rise of the stock catapulted Nvidia’s chief executive officer Jensen Huang to the 21st position on the Bloomberg Billionaires Index. His wealth jumped $9.6 billion to $69.2 billion. As recently as early last year, he was  ranked 128th with a net worth of $13.5 billion. The rise in Nvidia’s market value on Thursday eclipsed the entire value of Coca-Cola, at $265 billion. Its gain made Nvidia the US stock market’s third-most valuable company, pulling ahead of Amazon and Alphabet after jockeying with the two tech powerhouses in recent weeks. Microsoft and Apple, valued at $3.06 trillion and $2.85 trillion, respectively, are Wall Street’s two most valuable companies. Nvidia reported a Q4 revenue jump of more than threefold from a year ago to $22.10 billion and beat all expectations. At least 17 brokerages raised their price targets after the results. Among the most bullish, Rosenblatt Securities raised its price target to $1,400 from $1,100, implying a $3.5 trillion stock market value, Reuters reported. Nvidia’s stock has now climbed 58% in 2024, accounting for more than a quarter of the S&P 500’s increase year-to-date. That makes Nvidia’s outlook crucial not just for direct shareholders, but for owners of index funds widely held in retirement savings accounts. If you are keen to know more about Nifty 50 and BSE Sensex levels and seek expert advice on what’s driving the gains and how to build your portfolio, track the latest stock market stats, share market news and top brokerage bets on Financial Express.\n Download the Financial Express App for the fastest and most reliable business news alerts, key investment strategies and latest movers and shakers from across financial market.   "
}