{
    "title": "NVIDIA Back On Earth After Briefly Beating Alphabet, Amazon On Stock Market",
    "date": "2/12/2024",
    "url": "https://wccftech.com/nvidia-back-on-earth-after-briefly-beating-alphabet-amazon-on-stock-market/",
    "text": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy. Even though its shares delivered double digit percentage growth in 2023, NVIDIA's stock is in no mood to slow down this year as the A.I. frenzy continues to take Wall Street by storm. Despite the fact that less than two months have passed in 2024, its shares are already up by nearly 53% year to date, as multiple news reports and a broader feverish climate for artificial intelligence maintain its hold on Wall Street. This unbounded optimism has not only made NVIDIA one of the most valuable companies in the world, but it has also transformed the firm into the first semiconductor company to challenge big tech and surpass giants the likes of Alphabet and Amazon when it comes to market valuation. Despite worries all around Wall Street that high interest rates would take the juice out of stock markets and tip the U.S. into a recession, the economy has continued to grow, and artificial intelligence has provided investors with a new avenue to bet their money. The biggest beneficiary, hands down, of the A.I. wave, is NVIDIA, whose shares are now up by a stunning 401% since the start of 2023 to effectively ensure that the share price has nearly grown five fold in value. While the start of 2024 was a relatively quiet time for NVIDIA's shares, they're continuing their strong 2023 performance in February. Most of this follows the frenzy after the earnings season that saw renewed optimism in A.I. after big tech demonstrated that the market for the products exists, it can make money, and there are more investments planned in the pipeline to develop sufficient computing capacity. NVIDIA ends up being the biggest beneficiary of any surge in demand for A.I. products due to its graphics processing units (GPUs) that are believed to be industry leaders when it comes to performance. The start of the year has also seen major stock indexes touch new highs. The S&P 500 has crossed 5,000 points for the first time in its history, and despite a blasting 2023, the NASDAQ Composite is only now nearing its all time high close as well. At the heart of this performance is NVIDIA, whose shares have not only benefited from the optimism surrounding A.I. during the fourth quarter earnings season, but also from rumors that it is planning to set up a new custom chip designing business. These rumors follow a global trip from OpenAI's Sam Altman that has seen the world's most watched technology CEO in 2024 outline a whopping $7 trillion in investment needed to meet the demand for A.I. chips. Altman's plans, reported by the Wall Street Journal, include negotiations with semiconductor bigwigs the likes of the Taiwan Semiconductor Manufacturing Company (TSMC). Unconfirmed reports suggest that Altman wants to work with TSMC to build factories, a wise thought given the billions of dollars in investment and the significant expertise required to set up a new chip manufacturing site. All this hype has now ensured that NVIDIA is not only more valuable than Amazon, but it also enabled the firm's market value to cross another A.I. bigwig, the Google parent Alphabet. Earlier during trading today, NVIDIA's market value soared to sit at $1.822 which was higher than Alphabet's $1.819 trillion. At the same time, Amazon's market value was $1.802 trillion - making NVIDIA briefly the most valuable among the three. As of 1:42 p.m. Eastern time, Alphabet's market capitalization is $1.813 trillion, while NVIDIA's market cap is $1.781 trillion. Amazon, on the other hand, is worth $1.793 trillion - restoring the hierarchy in the big tech valuation pyramid, at least for now. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}