{
    "title": "Top Semiconductor Stocks to Invest In - Discover the Best Semiconductor \nStocks to Watch",
    "date": "2/13/2024",
    "url": "https://www.cmcmarkets.com/en/opto/as-nvidia-teams-up-with-cisco-which-stocks-are-leading-the-global-semiconductor-industry",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. By OPTO  13 Feb 2024, 16:45 After experiencing an oversupply in 2023, the semiconductor sector is poised for a recovery this year as demand for AI chips continues to accelerate. Here is a collection of semiconductor stocks to watch. At Cisco Live in Amsterdam last week, the enterprise technology giant [CSCO] announced a series of hardware and software products in partnership with Nvidia [NVDA]. The focus of the collaboration will be on making it easier to deploy and manage artificial intelligence (AI) systems using standard Ethernet connections. The majority of AI deployments use Infiniband, which Nvidia acquired as part of its $6.9bn buyout of Mellanox in 2020, but Ethernet is starting to make inroads into the AI connectivity market. “Companies everywhere are racing to transform their businesses with generative AI… [W]e’re making it easier than ever for enterprises to obtain the infrastructure they need to benefit from AI, the most powerful technology force of our lifetime,” said Nvidia CEO Jensen Huang in a press release. Thanks to soaring interest in ChatGPT and other large language models (LLMs) being developed by the likes of Alphabet [GOOGL] and Microsoft [MSFT], generative AI has helped to breathe new life into a stagnating semiconductor sector, which had swung from a supply shortage during the pandemic to an oversupply in some sections of the market last year. According to the World Semiconductor Trade Statistics’ market forecast last November, a “robust recovery” is on the cards in 2024, with an expected annual growth rate of 13.1%, compared to a 9.4% decline in 2023. IDC is even more optimistic, with its projection of 20% growth this year. While Nvidia grabs most of the AI headlines — its share price is up 45.9% year-to-date through 13 February — other semiconductor stocks are generating plenty of AI hype. AMD [AMD] rolled out the MI300X chip in December, its rival to Nvidia’s H100 graphics processing unit (GPU). The chipmaker is also betting on AI PCs, with president Victor Peng telling CNBC last week that the market is expanding and that the company is expecting the adoption of AI PCs to pick up in the second half of the year. In January, AMD announced its next-generation Ryzen 8000G series desktop processors, which promise to deliver “immense power and dominant performance for intensive workloads including gaming and content creation”. Speaking on the Q4 2023 earnings call last month, AMD CEO Lisa Su said that “Ryzen CPUs power more than 90% of AI-enabled PCs currently in [the] market”. The AMD share price is up 16.6% year-to-date through 13 February. Shares in Arm [ARM] soared 47.9% on 8 February after the British firm, which designs parts of processor chips, revealed that it too is benefitting from red-hot demand for all things AI. Arm-based processor chips are used to train LLMs include Nvidia’s GH200 Grace Hopper Superchip. “AI on Arm is everywhere. Arm’s performant and power-efficient CPU platform is used by more and more software developers, making it easier for OEMs [original equipment manufacturers] to adopt Arm technology, which generates further demand for Arm-based chips,” explained the company in its Q3 2024 shareholder letter. The expectation is that growing demand for energy-efficient AI applications will drive Arm’s long-term growth prospects. In the short term, the company has raised its full-year revenue guidance from a range of $2.96–$3.08bn to $3.16–$3.21bn. Arm’s share price is up 98.3% year-to-date. Marvell Technology [MRVL] is another chipmaker that has been elevated by AI. In Q3 2024, its data centre segment, which includes its custom AI chip business, beat revenue guidance, despite data centre storage demand remaining “depressed” and industry hopes for a recovery being pushed out. Data centre revenue grew 20% sequentially in the three months to the end of September, and the company is expecting it “to grow in the mid-30% range” sequentially in Q4 2024, said President and CEO Mat Murphy last November. The company’s Q4 earnings report is due in early March. The Marvell Technology share price is up 16.9% year-to-date. While it's arguably the AI chip race that has got investors the most excited, the unsexy semiconductor equipment required to make these specialist chips is just as critical — if not more so. Speaking to Bloomberg last month, ASML [ASML] CEO Peter Wennink said AI needs “massive amounts of computing power and data storage. I think without ASML, without our technology, that’s not going to happen”. Wennink’s confidence might stem from the latest numbers: revenue was up 30% in 2023 and the company is expecting similar sales in 2024. “Although our customers are still not certain about the shape of the semiconductor market recovery this year, there are some positive signs,” said Wennink in a press release. The ASML share price hit an all-time high following the earnings in late January and has continued to climb. It is up 23% year-to-date. The iShares Semiconductor ETF [SOXX] holds Nvidia, AMD, Marvell and ASML. As of 9 February, semiconductors account for 79.1% of the fund’s portfolio, while semiconductor equipment has a 20.7% allocation. The fund is up 49.7% in the past year through 9 February and up 29.8% in the past six months. The WisdomTree Artificial Intelligence and Innovation Fund [WTAI] holds Nvidia, AMD, Arm and ASML. As of 12 February, information technology has been allocated 77.3% of the portfolio, while communication services, healthcare, industrials, consumer discretionary and financials all have single-digit weightings. The fund is up 26.1% in the past year and up 20.5% in the past six months. Disclaimer Past performance is not a reliable indicator of future results. CMC Markets is an execution-only service provider. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. CMC Markets does not endorse or offer opinion on the trading strategies used by the author. Their trading strategies do not guarantee any return and CMC Markets shall not be held responsible for any loss that you may incur, either directly or indirectly, arising from any investment based on any information contained herein. *Tax treatment depends on individual circumstances and can change or may differ in a jurisdiction other than the UK. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles Beyond Meta: 5 Social Media Stocks To Watch A curated collection of stocks to capitalise on opportunities in the social media sector. 12 Feb 2024 Visionaries: What Is Warren Buffett’s Secret Sauce? Warren Buffett is regarded as one of the world’s foremost investors thanks to his groundbreaking approach to value-based investing. How does he do it? 08 Feb 2024 Is C3.ai the Smart AI Play? C3.ai offers pure exposure to AI demand; however, its most recent earnings report has dampened investor confidence. 07 Feb 2024 Pure Plays: Is Coinbase a Good Way to Get Exposure to Blockchain? OPTO's series explores why Coinbase is ideal for blockchain exposure. It assesses if spot bitcoin ETFs will boost or hinder the stock. 25 Jan 2024 © 2024 CMC Markets Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money. CMC Markets UK plc (173730) and CMC Spreadbet plc (170627) are authorised and regulated by the Financial Conduct Authority in the United Kingdom. "
}