{
    "title": "If Nvidia looked more like Salesforce, it might unlock billions more in \ncash, analyst says",
    "date": "1/5/2024",
    "url": "https://www.morningstar.com/news/marketwatch/202401051022/if-nvidia-looked-more-like-salesforce-it-might-unlock-billions-more-in-cash-analyst-says",
    "text": "By Emily Bary BofA believes the chip maker would benefit from more recurring revenue Nvidia Corp. is raking in billions in cash, but one analyst thinks the chip maker could throw $100 billion more onto the pile if it started to look more like Salesforce Inc. Nvidia (NVDA) might unlock even more cash by developing businesses that expand recurring revenue, according to BofA Securities analyst Vivek Arya. The company has suffered some boom-and-bust cycles in recent years, and another bust could be smoothed by developing longer-term software contracts akin to those of Salesforce (CRM)., Workday Inc. (WDAY) and ServiceNow Inc. (NOW), which generate recurring revenue from their customers. Arya sees a pathway for Nvidia to rake in $100 billion in incremental free cash flow over the next two years if it can bulk up its own recurring-revenue options. Read: Apple's stock needs to get 'unstuck' - and its innovation rut may not be helping \"While NVDA has a solid lead in AI, hardware-oriented businesses are not valued as highly as visibility tends to be limited,\" Arya wrote. Nvidia generates only about $1 billion, or 2%, of its sales from software and subscriptions. Arya doesn't think the company can get much higher than $5 billion with its software and subscription offerings unless it turns to acquisitions. Nvidia has shown some openness to deals that would beef up its intellectual property and software offerings, Arya notes, as it tried to buy British chip designer Arm Holdings (ARM) before facing regulatory pushback. \"We envision [Nvidia] considering more enhanced partnerships/M&A of software companies that are helping traditional enterprise customers deploy, monitor and analyze [generative AI] apps,\" he wrote. Nvidia \"is already serving them via on-premise hardware and/or its DGX cloud service, but we believe greater direct recurring software/service channel could be more impactful.\" The addition of more recurring-revenue streams could help Nvidia's \"relatively depressed trading multiple,\" in Arya's view. Nvidia shares trade at a 20% to 30% discount to its \"Magnificent Seven\" peers on the basis of price to earnings as well as enterprise value to free cash flow, even though the company's compound annual growth rate on the top line is three times what it is for those other tech giants. The discount is \"partly due to uncertainty in [calendar 2025] growth prospects, and partly due to a very hardware-dependent business unlike other large-cap software/internet peers that have recurring-revenue profiles,\" he wrote. Arya has a buy rating and $700 price objective on the stock. See also: Amazon's stock could be helped by this secret weapon in 2024, BofA says -Emily Bary This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 01-05-24 1834ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}