{
    "title": null,
    "date": "1/25/2024",
    "url": "https://www.cmcmarkets.com/en/optox/tejas-dessai-on-nvidias-competitive-advantage",
    "text": "Analysis 25 Jan 2024, 15:20GMT Tejas Dessai, AVP, Research Analyst at Global X ETFs, discusses the impact of artificial intelligence (AI) across different sectors, highlighting Nvidia’s dominance in the supply of specialised components, and the critical role its middleware has had to the company’s success. With AI disrupting numerous sectors across the global economy, OPTO Sessions spoke to Tejas Dessai, Associate Vice President for Research at Global X ETFs, about which companies are set to benefit most from the trend, and why he expects Nvidia [NVDA] to maintain its competitive advantage. While semiconductor companies supplying essential components for the AI boom have seen substantial gains, the duration and intensity of this trend remain uncertain. Other contenders for major advances include companies developing language models, robotics firms leveraging AI software to enhance robot output, and other players in the AI ecosystem.  “At this moment of mass disruption, it’s really difficult to pick individual winners”. However, Dessai suggests the trend will play out over three phases. The first and current phase is being driven by companies that supply critical components, “from the graphics processing units (GPUs) that are actually needed to run these models, to the ancillary components that go alongside a GPU to actually build data centre capacity or build the clusters that are needed to train, deploy and keep these models running”. NVIDIA stands out as a major winner. “Every year almost $250bn worth of chips go into data centres. Up until last year, NVIDIA had a very tiny share of this spending and I think that will go up significantly.”  “The whole computer puzzle will be restructured,” says Dessai, with memory and storage components needing to be rewired and networking components supplied. “That could last for a couple of years at minimum, or a lot more than that, depending on how widespread these models are able to go.” The second phase will revolve around middleware benefits, with cloud infrastructure companies and data infrastructure providers becoming pivotal. Traditional enterprises will seek access to AI models, leading to increased demand for services from industry giants like Microsoft [MSFT] Azure, Amazon’s [AMZN] Amazon Web Services and Alphabet’s [GOOGL] Google Cloud Platform, alongside a surge in data infrastructure companies facilitating data preparation and model training. The third phase should see the emergence of new interfaces and experiences capturing substantial value. While it is not clear which companies will predominate in this phase, possibilities include established players like Booking [BKNG] or its subsidiary Priceline innovating travel booking experiences, or start-ups disrupting various sectors, such as healthcare and financial services. In any case, this phase will certainly be “an exciting time and moment of mass disruption for the technology industry”. “Nvidia should be comfortably able to defend its position in the market, but at the same time we expect chip opportunities to arise outside of Nvidia that a lot of other companies can go after,” says Dessai. Nvidia currently dominates the AI premium model, where best-of-breed models are being trained on the best chips that Nvidia can provide. It also has the first-mover benefit, as well as CUDA architecture, a proprietary general purpose parallel computing platform and programming model. This model leverages the parallel compute engine in NVIDIA’s GPUs to solve complex computational problems more efficiently than can be done with a central processing unit.  “Nvidia should be comfortably able to defend its position in the market, but at the same time we expect chip opportunities to arise outside of Nvidia” “A lot of developers have familiarity with that middleware layer that Nvidia sells, which allows developers to harness the greatest efficiency out of its chips,” says Dessai, emphasising the importance of CUDA. Once these models are ready, Dessai anticipates the emergence of a new market for running them in daily, routine use cases. In this space, Advanced Micro Devices [AMD] and Intel [INTC] could vie for a share, while companies like Marvel [MRVL] and Qualcomm [QCOM] could tap into a growing demand for chips in data centres. This expanding market includes applications in IoT systems, running models on mobile devices, and deploying them in vehicles and robotic systems. Success in this mass market will hinge on keeping compute costs low, presenting a significant opportunity for companies to compete and innovate. The content in this article is for informational purposes only. Opto Markets LLC does not recommend any specific securities or investment strategies. Investing involves risk & investments may lose value, including the loss of principal. Past performance does not guarantee future results. Investors should consider their investment objectives and risks carefully before investing. "
}