{
    "title": "Wave of EV Makers Choose NVIDIA DRIVE for Automated Driving",
    "date": "1/8/2024",
    "url": "https://nvidianews.nvidia.com/news/wave-of-ev-makers-choose-nvidia-drive-for-automated-driving",
    "text": "CES — NVIDIA today announced that Li Auto, a pioneer in extended-range electric vehicles (EVs), has selected the NVIDIA DRIVE Thor™ centralized car computer to power its next-generation fleets. NVIDIA also announced that EV makers GWM (Great Wall Motor), ZEEKR and Xiaomi have adopted the NVIDIA DRIVE Orin​​™ platform to power their intelligent automated-driving systems. “The transportation industry is embracing centralized compute for highly automated and autonomous driving,” said Xinzhou Wu, vice president of automotive at NVIDIA. “The AI car computer of choice for today’s intelligent fleets is NVIDIA DRIVE Orin, with automakers increasingly looking to the advanced capabilities and AI performance of its successor, NVIDIA DRIVE Thor, for their future vehicle roadmaps.” DRIVE Thor is a next-generation centralized car computer that integrates a wide range of intelligent functions into a single AI compute platform, delivering autonomous driving and parking capabilities, driver and passenger monitoring, and AI cockpit functionality. Li Auto currently uses two DRIVE Orin processors to power its assisted-driving system, AD Max, for its L-series models. The processors, which provide a combined 508 trillion operations per second (TOPS), enable real-time fusing and processing of sensor information — powering full-scenario autonomous driving for navigation on advanced driver-assistance systems (ADAS), full-scenario assisted driving for lane change control (LCC), automated parking and automatic emergency braking (AEB) active safety features. The new AD Max 3.0 upgrade transitions the system to an end-to-end algorithmic architecture dominated by large AI models. It delivers a safer, more comfortable intelligent driving experience using an occupancy network and spatio-temporal trajectory planning and model-predictive control algorithms. Building the Future of Transportation on DRIVE\r\nGWM, among China’s leading new energy vehicle makers, has announced that it will build its self-developed, high-end intelligent-driving system, the Coffee Pilot, based on the DRIVE Orin centralized computing platform. Coffee Pilot can support parking, high-speed and urban scenes to achieve full-scenario smart navigation and assisted-driving functions without high-precision maps. GWM, which collaborated with NVIDIA to develop this intelligent-driving system, will debut its first model with the system in the first half of the year. Advanced intelligent-driving features, such as Urban Navigate on Autopilot and cross-floor Memory Parking, will be first rolled out in GWM’s WEY models. “LLM-driven AI technology will profoundly enhance future mobility as well as the entire automotive industry,” said a GWM spokesperson. “GWM is committed to working with NVIDIA and other industry-leading players to offer greener, smarter mobility for all.” ZEEKR, the premium EV subsidiary of Geely, has launched the ZEEKR Luxury Sedan, its fourth model to be powered by NVIDIA DRIVE Orin. It features a new full-stack smart driving system, powered by two DRIVE Orin systems-on-a-chip, to deliver intelligent parking and automated operation on high-speed and urban roads. ZEEKR’s full range of models is offered with two sensor options: Lidar + Vision Fusion and Pure Vision. The Navigation ZEEKR Pilot, a highway navigation feature from ZEEKR’s in-house advanced driving assistant system, will be available for use in major Chinese cities once deliveries begin. “ZEEKR is proud to work with NVIDIA on innovative, safe autonomous driving capabilities,” said Chen Qi, vice president of ZEEKR. “The new ZEEKR Luxury Sedan’s in-house-developed ADAS system is made possible with the energy-efficient, high-performance NVIDIA DRIVE car computing platform.” Xiaomi EV, the automotive arm of the technology giant, has announced its first EV, the SU7 sedan, which is built on a dual DRIVE Orin configuration for highway driving functions. Built using Xiaomi’s leading large language model for perception and decision-making, the sedan will be able to seamlessly navigate through Chinese cities, regardless of locale, administrative divisions within the country or type of road. It will come in two versions: one with a driving range of up to 415 miles on a single charge and another with a range of up to 497 miles. The SU7 will be officially launched in the first half of 2024. In production with leading automakers, trucks, robotaxis and shuttles since 2022, DRIVE Orin offers up to 254 TOPS and is scalable to support level 2+ to level 5 self-driving capabilities. About NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling industrial digitalization across markets. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/. Certain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, and availability of our products, services, and technologies, including NVIDIA DRIVE, NVIDIA DRIVE Orin, and NVIDIA DRIVE Thor; EV makers adopting NVIDIA DRIVE and integrating the NVIDIA DRIVE platform into their automated-driving systems; the transportation industry embracing centralized compute for highly automated and autonomous driving; automakers increasingly looking to the advanced capabilities and AI performance of NVIDIA DRIVE Thor for their future vehicle roadmaps; building the future of transportation on DRIVE; LLM-driven AI technology profoundly enhancing future mobility as well as the entire automotive industry; and NVIDIA’s collaborations with third parties are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. © 2024 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA DRIVE Orin and NVIDIA DRIVE Thor are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice. Download / File Link Download / File Link Download / File Link Download / File Link Download / File Link Download / File Link About NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling industrial digitalization across markets. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/. Certain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, and availability of our products, services, and technologies, including NVIDIA DRIVE, NVIDIA DRIVE Orin, and NVIDIA DRIVE Thor; EV makers adopting NVIDIA DRIVE and integrating the NVIDIA DRIVE platform into their automated-driving systems; the transportation industry embracing centralized compute for highly automated and autonomous driving; automakers increasingly looking to the advanced capabilities and AI performance of NVIDIA DRIVE Thor for their future vehicle roadmaps; building the future of transportation on DRIVE; LLM-driven AI technology profoundly enhancing future mobility as well as the entire automotive industry; and NVIDIA’s collaborations with third parties are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. © 2024 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA DRIVE Orin and NVIDIA DRIVE Thor are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice. Global contacts for media inquiries. Newsroom updates delivered to your inbox. "
}