{
    "title": null,
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/news/heres-why-think-nvidia-nasdaq-130017926.html",
    "text": "The excitement of investing in a company that can reverse its fortunes is a big draw for some speculators, so even companies that have no revenue, no profit, and a record of falling short, can manage to find investors. Unfortunately, these high risk investments often have little probability of ever paying off, and many investors pay a price to learn their lesson. Loss-making companies are always racing against time to reach financial sustainability, so investors in these companies may be taking on more risk than they should. Despite being in the age of tech-stock blue-sky investing, many investors still adopt a more traditional strategy; buying shares in profitable companies like NVIDIA (NASDAQ:NVDA). Even if this company is fairly valued by the market, investors would agree that generating consistent profits will continue to provide NVIDIA with the means to add long-term value to shareholders. Check out our latest analysis for NVIDIA In business, profits are a key measure of success; and share prices tend to reflect earnings per share (EPS) performance. Which is why EPS growth is looked upon so favourably. It is awe-striking that NVIDIA's EPS went from US$2.39 to US$7.65 in just one year. When you see earnings grow that quickly, it often means good things ahead for the company. Could this be a sign that the business has reached an inflection point? Top-line growth is a great indicator that growth is sustainable, and combined with a high earnings before interest and taxation (EBIT) margin, it's a great way for a company to maintain a competitive advantage in the market. The music to the ears of NVIDIA shareholders is that EBIT margins have grown from 26% to 46% in the last 12 months and revenues are on an upwards trend as well. Ticking those two boxes is a good sign of growth, in our book. You can take a look at the company's revenue and earnings growth trend, in the chart below. Click on the chart to see the exact numbers. Of course the knack is to find stocks that have their best days in the future, not in the past. You could base your opinion on past performance, of course, but you may also want to check this interactive graph of professional analyst EPS forecasts for NVIDIA. We would not expect to see insiders owning a large percentage of a US$1.4t company like NVIDIA. But thanks to their investment in the company, it's pleasing to see that there are still incentives to align their actions with the shareholders. Indeed, they have a considerable amount of wealth invested in it, currently valued at US$55b. Investors will appreciate management having this amount of skin in the game as it shows their commitment to the company's future. NVIDIA's earnings have taken off in quite an impressive fashion. That EPS growth certainly is attention grabbing, and the large insider ownership only serves to further stoke our interest. The hope is, of course, that the strong growth marks a fundamental improvement in the business economics. Based on the sum of its parts, we definitely think its worth watching NVIDIA very closely. We should say that we've discovered 1 warning sign for NVIDIA that you should be aware of before investing here. There's always the possibility of doing well buying stocks that are not growing earnings and do not have insiders buying shares. But for those who consider these important metrics, we encourage you to check out companies that do have those features. You can access a tailored list of companies which have demonstrated growth backed by recent insider purchases. Please note the insider transactions discussed in this article refer to reportable transactions in the relevant jurisdiction. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}