{
    "title": "With 67% ownership, NVIDIA Corporation (NASDAQ:NVDA) boasts of strong \ninstitutional backing",
    "date": "1/6/2024",
    "url": "https://finance.yahoo.com/news/67-ownership-nvidia-corporation-nasdaq-110020262.html",
    "text": "Institutions' substantial holdings in NVIDIA implies that they have significant influence over the company's share price 45% of the business is held by the top 25 shareholders Recent sales by insiders A look at the shareholders of NVIDIA Corporation (NASDAQ:NVDA) can tell us which group is most powerful. The group holding the most number of shares in the company, around 67% to be precise, is institutions. Put another way, the group faces the maximum upside potential (or downside risk). Given the vast amount of money and research capacities at their disposal, institutional ownership tends to carry a lot of weight, especially with individual investors. Therefore, a good portion of institutional money invested in the company is usually a huge vote of confidence on its future. Let's take a closer look to see what the different types of shareholders can tell us about NVIDIA. Check out our latest analysis for NVIDIA Institutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing. We can see that NVIDIA does have institutional investors; and they hold a good portion of the company's stock. This suggests some credibility amongst professional investors. But we can't rely on that fact alone since institutions make bad investments sometimes, just like everyone does. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at NVIDIA's earnings history below. Of course, the future is what really matters. Institutional investors own over 50% of the company, so together than can probably strongly influence board decisions. Hedge funds don't have many shares in NVIDIA. The Vanguard Group, Inc. is currently the largest shareholder, with 8.2% of shares outstanding. For context, the second largest shareholder holds about 7.3% of the shares outstanding, followed by an ownership of 5.0% by the third-largest shareholder. In addition, we found that Jen-Hsun Huang, the CEO has 3.5% of the shares allocated to their name. A deeper look at our ownership data shows that the top 25 shareholders collectively hold less than half of the register, suggesting a large group of small holders where no single shareholder has a majority. While it makes sense to study institutional ownership data for a company, it also makes sense to study analyst sentiments to know which way the wind is blowing. There are a reasonable number of analysts covering the stock, so it might be useful to find out their aggregate view on the future. The definition of an insider can differ slightly between different countries, but members of the board of directors always count. The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves. Insider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances. Shareholders would probably be interested to learn that insiders own shares in NVIDIA Corporation. Insiders own US$47b worth of shares (at current prices). It is good to see this level of investment. You can check here to see if those insiders have been buying recently. With a 29% ownership, the general public, mostly comprising of individual investors, have some degree of sway over NVIDIA. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders. While it is well worth considering the different groups that own a company, there are other factors that are even more important. Consider risks, for instance. Every company has them, and we've spotted   1 warning sign for NVIDIA   you should know about. If you would prefer discover what analysts are predicting in terms of future growth, do not miss this free report on analyst forecasts. NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}