{
    "title": null,
    "date": "1/29/2024",
    "url": "https://www.fool.com/investing/2024/01/29/dividend-stocks-magnificent-apple-microsoft-nvidia/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The \"Magnificent Seven\" refers to a group of the world's largest technology stocks, which have a combined market capitalization of $12.7 trillion. Given that sheer size, they represent 28.7% of the total value of the S&P 500 index, which means they have a huge influence over the general direction of the entire stock market. The chart below shows the Magnificent Seven stocks and their individual returns in 2023:  NVDA total return data by YCharts. They were a huge reason the S&P 500 gained 24.3% last year, which is more than twice its average annual return going back to its establishment in 1957. Below is a chart of the 2023 return of the S&P 500 compared to the Equal Weight S&P 500, which assigns an identical weighting to all 500 stocks in the index. The underperformance of the equally-weighted index truly highlights the influence of the Magnificent Seven.  ^SPX data by YCharts. But three of the Magnificent Seven -- Apple (AAPL 0.53%), Microsoft (MSFT -0.15%), and Nvidia (NVDA 3.12%) -- pay a dividend, so they offer investors a modest income stream on top of their spectacular growth. I'll explain exactly how much you could earn by holding these three stocks. Apple and Microsoft have been rivals for decades. Apple always had an edge in the hardware space, despite Microsoft's best efforts to produce a competitor to the legendary iPod and iPhone devices. Their businesses have ventured in different directions in recent years, but the companies have both amassed staggering valuations north of $3 trillion. Apple remains laser-focused on consumer electronics innovations. Its latest iPhone 15 Pro smartphone features the new A17 Pro chip, which lays the foundation to process artificial intelligence (AI) workloads on the device. Plus, Apple has launched the Vision Pro mixed-reality headset, marking the company's first bet on a new hardware platform since it launched the Watch in 2015. Microsoft, on the other hand, is heavily focused on cloud computing and AI software. The company invested $10 billion in start-up OpenAI last year, and it has embedding ChatGPT and the latest GPT-4 models into its entire product portfolio, including Windows, 365, Edge, Bing, and the Azure cloud platform. Microsoft will place AI at the fingertips of billions of existing customers, and it's already creating new opportunities to generate revenue. Then there's Nvidia. It was the best-performing stock in the entire S&P 500 during 2023, thanks to surging demand for its AI data center chips. It's the leader in that space by a mile, and while competitors are now launching their own hardware equivalents to the H100 chip, Nvidia is gearing up to launch its next-generation H200, which is supposed to be up to two times as powerful while consuming half the energy of its predecessor. The Apple, Microsoft, and Nvidia trio are among the best stocks to own for investors looking to expose their portfolios to the future of the technology sector. Apple, Microsoft, and Nvidia are all extremely profitable. They make so much money that it's practically impossible to reinvest all of it back into their businesses to unlock more growth. Rather than warehousing all of that spare cash, the tech giants return some of it to their shareholders as quarterly dividends. Microsoft has the best dividend yield: $0.75 per share each quarter, which translates to an annual yield of 0.74%. Holding Apple stock will yield 0.49% annually, whereas Nvidia stock yields 0.03%. In other words, if you invested $150,000 split equally among the three stocks, you would earn $627.94 per year, or a blended yield of 0.42%. That might not sound attractive considering the high interest rates right now, where even cash sitting in the bank can earn over 5% per year. However, investors should weigh that dividend income stream against the substantial capital growth in Apple, Microsoft, and Nvidia. Above, I shared their returns for 2023, and here's a look at how much each of the three stocks gained over the last five years.  NVDA total return level, data by YCharts. In other words, had you invested that $150,000 equally across the three companies in 2019, it would be worth $1.1 million today -- even if you didn't reinvest the dividends. Past performance doesn't predict future results, but the global economy is entering a technological revolution unlike anything investors have seen in the past. Artificial intelligence could drive a productivity boom, and the CEO of one of the first-ever enterprise AI companies -- C3.ai -- compares it to the dawn of the internet and the smartphone. Right now, Nvidia is the leading AI hardware provider, and it could take years for the competition to truly catch up. Microsoft Azure is the world's second-largest cloud platform, and as I mentioned earlier, it secured an investment in the AI industry's leading start-up. Azure is quickly becoming a distribution platform for GPT-4 and other third-party models, and Azure OpenAI Service has attracted 18,000 business customers in a little over a year. Apple might be focused on building AI hardware into its devices, but it's also developing large language models in-house that will lay the foundation for generative AI chatbots and other applications. Apple and Microsoft are each worth more than $3 trillion, and Nvidia is worth over $1.5 trillion, so it will be really hard for their stock prices to replicate the growth they produced in the past. However, depending which Wall Street forecast you rely upon, AI could add anywhere from $7 trillion to $200 trillion to the global economy in the coming decade, so these companies haven't seen an opportunity quite like this before. Investors will probably do well to own Apple, Microsoft, and Nvidia as part of a balanced portfolio over the long term, even if the dividend income stream seems a little modest. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, Nvidia, and Tesla. The Motley Fool recommends C3.ai. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}