{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.forbes.com/sites/johnkang/2024/02/04/koreas-best-funded-ai-semiconductor-startup-aims-to-take-on-nvidia-with-samsung-made-chips/",
    "text": "To help compete against the world’s dominant AI chip-maker, Rebellions is partnering with Samsung and recently raised $124 million in a Series B round, bringing its total funding to $210 million. Rebellions' AI chip. The incredible rise in Nvidia’s share price last year has spurred an arms race among semiconductor startups from Silicon Valley to Seoul to raise more funds and gain a foothold in the fast-growing AI chip market. In the semiconductor hub of South Korea, a four-year-old AI chip startup led by a former Wall Street quant recently got a big boost in the funding race. Last week Rebellions, based in Seongnam, south of Seoul, announced it raised $124 million in Series B funding, bringing its total funding to $210 million—more than any other AI chip startup in South Korea, according to Rebellions. “That’s almost double other competitors,” Sunghyun Park, cofounder and CEO of Rebellions, says excitedly in a video interview. Its competitors include Sapeon, which last raised $45 million in July from investors including Seoul-based private equity firm Ascent Equity Partners (a backer of “Baby Shark” creator Pinkfong), South Korean conglomerate GS Group and WE Ventures, whose portfolio includes South Korean rich lister Song Chi-hyung’s crypto exchange operator Dunamu. Another competitor is FuriosaAI, which raised a $70 million Series B in 2021 from investors including D2 Startup Factory, backed by South Korean billionaire Lee Hae-jin’s internet giant Naver; DSC Investment, an early backer of Seoul- and Seattle-based chip design startup MangoBoost; and Seoul-based Aion Asset Management. Rebellions’ Series B round valued it at $650 million. “But the funding market is very bad at the moment—interest rates are up,” adds Park, who was a quant developer at Morgan Stanley in New York before starting Rebellions in 2020. “So if we were in a normal market situation, we would definitely be a unicorn company.” Rebellions cofounder and CEO Sunghyun Park. The round was led by South Korean telecom operator KT and was joined by KT’s data center unit, KT Cloud, and Shinhan Venture Investment, an arm of banking giant Shinhan Financial Group. Other investors in the round include Temasek’s Pavilion Capital, Korelya Capital, founded and led by former French digital economy minister Fleur Pellerin who is an ethnic Korean; Japan’s DG Daiwa Ventures, a joint venture between brokerage Daiwa Securities Group and early-stage investor Digital Garage; and Noh & Partners, a South Korean private equity firm whose portfolio companies include Forbes Asia 100 to Watch 2022 honoree Seoul Robotics. Rebellions’ earlier investors include Kakao Ventures, the venture capital arm of billionaire Kim Beom-su’s internet giant Kakao; state-run Korea Development Bank; SV Investment, a South Korean VC firm which has backed the likes of Kakao and South Korean rich lister Lee Sang-ryul’s EV battery-component maker Chunbo; and IMM Investment, whose portfolio companies include billionaire Bom Kim’s Coupang and Chang Byung-gyu’s Krafton. Investors like Rebellions because of its team that combines research and development expertise from the U.S. and manufacturing know-how from South Korea, says Park, who earned a Ph.D. in electrical engineering and computer science from MIT and has previously worked at SpaceX, Intel and Samsung’s Texas office. “We are the only AI chip company that has this mix of talent,” he says. “That’s why we got a lot of attention.” Jinwook Oh, cofounder and CTO of Rebellions, for example, worked at IBM in New York for six years and holds a Ph.D. in electrical engineering from Korea Advanced Institute of Science and Technology, South Korea’s leading science and technology university. Park and his team will use the funds raised from the latest round to develop a next-generation AI chip for running large language models and hyperscalers, which are large cloud-computing service providers like AWS, Microsoft Azure and Google Cloud. Park says one of the advantages of the new chip, called Rebel, is that it’s a lot cheaper than Nvidia’s chips, which can go for over $30,000 apiece. “We’re targeting half of Nvidia’s price,” he says. “Nvidia’s margins are huge.” The $1.6 trillion-market-cap company reported a gross margin of 74% for the quarter ended October 29. “When there’s a Goliath, there’s going to be a David. I believe one of the David candidates from South Korea is Rebellions.” The South Korean startup says it is able to lower costs by using domestic suppliers and manufacturers. “By using the Korean semiconductor ecosystem, we can significantly reduce the manufacturing cost,” says Park. “It doesn’t need to be a global supply chain involving Taiwan and the U.S. That takes a lot of time and money.” Santa Clara, California-based Nvidia, for example, primarily uses TSMC in Taiwan, the world’s leading manufacturer of cutting-edge chips. More specifically, Rebellions is using the Samsung ecosystem. Samsung, led by billionaire Jay Y. Lee, is the world’s largest memory chip maker and the only other contract chip manufacturer besides TSMC capable of making today’s most advanced chips. Rebellions is co-developing Rebel with Samsung and will use the tech conglomerate’s high bandwidth memory chips and its 4-nanometer chip manufacturing process. “We are tightly coupled with Samsung, so that’s why we can significantly reduce the manufacturing cost,” says Park. Rebellions and Samsung aim to complete the development of Rebel by the end of this year and start mass production in 2025. By partnering with South Korea’s largest company—and with backing from some of the country’s top investors—Park says Rebellions can take on billionaire Jensen Huang’s Nvidia. “Currently, Nvidia is king. But nobody likes it—its market share is about 90%—nobody likes it because it’s super expensive,” Park says. “When there’s a Goliath, there’s going to be a David. I believe one of the David candidates from South Korea is Rebellions.” He adds, “We’re rebellious, it’s in our team name.”  "
}