{
    "title": "Three things to watch for the week ahead: Nvidia earnings; Pilbara Minerals \nresults; wage data",
    "date": "2/18/2024",
    "url": "https://www.proactiveinvestors.com/companies/news/1041182/three-things-to-watch-for-the-week-ahead-nvidia-earnings-pilbara-minerals-results-wage-data-1041182.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Advertising Cookies collect information about your browsing habits such as the pages you visit and links you follow. These audience insights are used to make our website more relevant. Performance Cookies collect anonymous information designed to help us improve the site and respond to the needs of our audiences. We use this information to make our site faster, more relevant and improve the navigation for all users. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Proactive leads the world in up-to-the-minute, multi-media news provision, events organisation, investor relations management and investor research\r\n Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Last updated: 16:56 18 Feb 2024 EST, First published: 16:44 18 Feb 2024 EST Josh Gilbert, market analyst at eToro, shares his three things to watch in Australia in the coming days. It’s easy to see why Nvidia is branded as magnificent, with a five-year return of over 1,500%. In that time, Nvidia has become a Wall Street darling that continues to reward investors, taking full advantage of the AI revolution. Last week, the artificial intelligence computing company claimed another feather in its cap, taking the title of the third largest company on the S&P500. Within the last year, Jensen Huang and his team at Nvidia have grown its earnings by 500%, a remarkable feat that’s even more remarkable given Wall Street expects that growth to continue. This week, consensus has Nvidia reporting earnings of US$4.56 with revenue of US$20.26 billion. If the last three results are anything to go by, we could even expect numbers much higher than that. Investors will be watching its data centre business, which has driven growth thanks to AI, but the main focus will be on guidance. Shareholders will want to hear that sales aren’t slowing down and that the AI boom is not just a flash in the pan. With such outsized gains in less-than-optimal conditions, anything but perfect will put shares on the back foot. If you take a look at the worst performers on the ASX200 this year, it's filled with miners – mainly lithium miners. It’s been a torrid few years for the price of lithium as it continues to freefall, weighing heavily on local miners who enjoyed a strong 2022 during peak prices for the asset. While the pricing environment has softened for the time being, investors should not lose sight of the significant demand for lithium, with EV growth still high at around 30% this year. The Australian investor favourite in lithium, Pilbara Minerals, reports this week and shares have held up reasonably well compared to other names. That's because it has a better balance sheet than most to get it through this lithium winter, allowing it to continue expanding and growing production. Income will fall significantly, but that is to be expected, so investors should instead focus on commentary around production. Ultimately, Pilbara is at the whim of the lithium price but the business looks the best positioned to navigate this challenging period. Michele Bullock and the RBA have continued to see data move in the right direction, with unemployment last week lifting more than expected, showing the labour market is loosening. Rising unemployment will be a significant reason for the RBA to cut rates, with market pricing looking to as early as June for the first cut. This week, the board receives another key data point from the Quarterly Wage Index. With capacity in Australia’s job market growing, wages should not see too much pressure to the upside from here, given that we will likely see the unemployment rate grow during 2024, all of which is good news for inflation. The Wage Price index is expected to lift to 1% QoQ and to 4.1% year-over-year. Sign up to receive alerts and news direct to your inbox Martin Carolan, Provaris Energy Ltd (ASX:PV1, OTC:GBBLF) managing director and CEO, joins Proactive’s Jonathan to discuss the significance of the H2Neo prototype tank's fabrication and testing. Carolan highlights the project's progression, which is crucial for optimising shipyard operations... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive North America Inc., Proactive Investors LLC. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}