{
    "title": "Nvidia replaces Alphabet as Wall St’s third most valuable company",
    "date": "2/14/2024",
    "url": "https://theprint.in/tech/nvidia-replaces-alphabet-as-wall-sts-third-most-valuable-company/1966814/",
    "text": "By Noel Randewich(Reuters) -Nvidia briefly eclipsed Google-parent Alphabet as the third most valuable U.S. company on Wednesday, just after overtaking Amazon  and as investors look to the dominant AI chipmaker’s upcoming quarterly report.\nNvidia’s stock market value hit $1.83 trillion during the trading session, just above Alphabet’s $1.81 trillion market capitalization. \n\n\nThe Santa Clara, California company’s stock was last up 1.5%, putting its value at $1.807 trillion, while Alphabet’s stock was flat, leaving it with a marginally higher value of $1.810 trillion.\n\n\r\n\t\t\t\t\tShow Full Article By Noel Randewich(Reuters) -Nvidia briefly eclipsed Google-parent Alphabet as the third most valuable U.S. company on Wednesday, just after overtaking Amazon  and as investors look to the dominant AI chipmaker’s upcoming quarterly report. Nvidia’s stock market value hit $1.83 trillion during the trading session, just above Alphabet’s $1.81 trillion market capitalization. \n\n\nThe Santa Clara, California company’s stock was last up 1.5%, putting its value at $1.807 trillion, while Alphabet’s stock was flat, leaving it with a marginally higher value of $1.810 trillion.\n\n\r\n\t\t\t\t\tShow Full Article Nvidia’s stock market value hit $1.83 trillion during the trading session, just above Alphabet’s $1.81 trillion market capitalization. The Santa Clara, California company’s stock was last up 1.5%, putting its value at $1.807 trillion, while Alphabet’s stock was flat, leaving it with a marginally higher value of $1.810 trillion.\n\n\r\n\t\t\t\t\tShow Full Article The Santa Clara, California company’s stock was last up 1.5%, putting its value at $1.807 trillion, while Alphabet’s stock was flat, leaving it with a marginally higher value of $1.810 trillion. Nvidia has been a top beneficiary of technology companies’ race to build AI into their products and services, and the latest gain in its stock comes a day after it ended a session with a market capitalization above Amazon’s for the first time in two decades.\nNvidia controls about 80% of the high-end AI chip market, a position that has sent its stock up 47% this year after more than tripling in 2023. Customers face shortages of Nvidia’s top-of-the line components while AI developers face months-long waiting lists to use its processors through cloud-computing providers.\nTechnology-related companies, including Microsoft and Meta Platforms, have also rallied to record highs on AI optimism.\nNvidia’s quarterly report next Wednesday will be one of Wall Street’s most closely watched events of the week. Analysts expect another blowout quarter and outlook, and anything less could deflate Wall Street’s AI rally, some investor warn.\n“The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session,” said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa.\nAn early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG.\nAnalysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion.\nNvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Nvidia has been a top beneficiary of technology companies’ race to build AI into their products and services, and the latest gain in its stock comes a day after it ended a session with a market capitalization above Amazon’s for the first time in two decades. Nvidia controls about 80% of the high-end AI chip market, a position that has sent its stock up 47% this year after more than tripling in 2023. Customers face shortages of Nvidia’s top-of-the line components while AI developers face months-long waiting lists to use its processors through cloud-computing providers.\nTechnology-related companies, including Microsoft and Meta Platforms, have also rallied to record highs on AI optimism.\nNvidia’s quarterly report next Wednesday will be one of Wall Street’s most closely watched events of the week. Analysts expect another blowout quarter and outlook, and anything less could deflate Wall Street’s AI rally, some investor warn.\n“The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session,” said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa.\nAn early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG.\nAnalysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion.\nNvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Nvidia controls about 80% of the high-end AI chip market, a position that has sent its stock up 47% this year after more than tripling in 2023. Customers face shortages of Nvidia’s top-of-the line components while AI developers face months-long waiting lists to use its processors through cloud-computing providers. Technology-related companies, including Microsoft and Meta Platforms, have also rallied to record highs on AI optimism.\nNvidia’s quarterly report next Wednesday will be one of Wall Street’s most closely watched events of the week. Analysts expect another blowout quarter and outlook, and anything less could deflate Wall Street’s AI rally, some investor warn.\n“The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session,” said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa.\nAn early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG.\nAnalysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion.\nNvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Technology-related companies, including Microsoft and Meta Platforms, have also rallied to record highs on AI optimism. Nvidia’s quarterly report next Wednesday will be one of Wall Street’s most closely watched events of the week. Analysts expect another blowout quarter and outlook, and anything less could deflate Wall Street’s AI rally, some investor warn.\n“The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session,” said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa.\nAn early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG.\nAnalysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion.\nNvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Nvidia’s quarterly report next Wednesday will be one of Wall Street’s most closely watched events of the week. Analysts expect another blowout quarter and outlook, and anything less could deflate Wall Street’s AI rally, some investor warn. “The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session,” said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa.\nAn early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG.\nAnalysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion.\nNvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. “The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session,” said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa. An early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG.\nAnalysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion.\nNvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. An early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG. Analysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion.\nNvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Analysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion. Nvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Nvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG. (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski)\nDisclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. (Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur and Nick Zieminski) Disclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content. Disclaimer: This report is auto generated from the Reuters news service. ThePrint holds no responsibilty for its content.   Subscribe to our channels on YouTube, Telegram & WhatsApp Support Our Journalism India needs fair, non-hyphenated and questioning journalism, packed with on-ground reporting. ThePrint – with exceptional reporters, columnists and editors – is doing just that. Sustaining this needs support from wonderful readers like you. Whether you live in India or overseas, you can take a paid subscription by clicking here. Support Our Journalism Save my name, email, and website in this browser for the next time I comment.  Δ Required fields are marked *  Name * Email *  Δ Copyright © 2024 Printline Media Pvt. Ltd. All rights reserved. "
}