{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.pcgamer.com/as-if-it-didnt-dominate-the-ai-market-already-nvidia-is-gearing-up-to-go-after-the-custom-ai-chip-market/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Could consoles be on the menu? Just in case you weren't already aware, AI is big business. Nvidia dominates the red hot AI market, with the company now valued at over 1.7 trillion dollars, making it the world's 6th largest company by market cap, and it's on track to overtake Amazon and Alphabet (Google) sooner rather than later. It's mostly achieved this on the back of soaring demand for its AI processors. But while its H100 and A100 families of mega processors generate the big bucks, there's an emerging demand for custom AI processing. According to a report from Reuters, Nvidia is putting together a new business unit focused on custom solutions, allowing customers access to its growing portfolio of intellectual property. Reuters estimates Nvidia controls about 80% of the AI market, but its chips are very expensive and are essentially general purpose processors, meaning they are not ideally suited for custom workloads, A properly designed AI accelerator or fixed function hardware for a custom workload would deliver much higher performance with lower power consumption. That could save certain companies many millions, if not billions in capital outlays and operating costs. There's some parallel with Bitcoin mining. For a while it was profitable on gaming GPUs, but once application specific chips emerged, GPUs were quickly usurped, by offering much better overall performance (hash rate) while delivering performance per watt orders of magnitude above what a GPU could do. If you're one of the Amazons or Facebooks of the world (I mean, aren't we all?), it makes sense to evaluate options that are faster, while using less power. According to Reuters' sources, Nvidia officials have met with representatives from Amazon, Meta, Microsoft, Google and OpenAI to discuss making custom chips for them. It's also reportedly approached telecom, automotive—and the interesting one for us—gaming customers.   Best CPU for gaming: The top chips from Intel and AMD.\nBest gaming motherboard: The right boards.\nBest graphics card: Your perfect pixel-pusher awaits.\nBest SSD for gaming: Get into the game ahead of the rest. Apart from that little nugget and a bit of speculation, there's not much in this news for us at this point in time, but with AI set to make bigger inroads into the gaming space, there's every possibility that gaming specific AI hardware could be developed. Consoles are a case in point. Should Nvidia wish to pursue next-generation console contracts, Nvidia's AI hardware could make its way into the console market, making it easier for developers to integrate cross platform AI functionality into their games. Gaming optimized Tensor cores, anyone? Sign up to get the best content of the week, and great gaming deals, as picked by the editors. Among the lofty goals of gaming with AI are things like adaptive gameplay, procedural content generation and interesting NPCs with adaptive behavior. They're different workloads to the generative AI and LLMs out in the world right now. Will Nvidia approach Sony and Microsoft and make a bigger play in the console market? There are many factors at play that would suggest not, but with its experience in AI, one shouldn't bet against some of Nvidia IP making its way into some form of future gaming product. If anyone knows a thing or two about gaming and AI, it'd be Nvidia. Chris' gaming experiences go back to the mid-nineties when he conned his parents into buying an 'educational PC' that was conveniently overpowered to play Doom and Tie Fighter. He developed a love of extreme overclocking that destroyed his savings despite the cheaper hardware on offer via his job at a PC store. To afford more LN2 he began moonlighting as a reviewer for VR-Zone before jumping the fence to work for MSI Australia. Since then, he's gone back to journalism, enthusiastically reviewing the latest and greatest components for PC & Tech Authority, PC Powerplay and currently Australian Personal Computer magazine and PC Gamer. Chris still puts far too many hours into Borderlands 3, always striving to become a more efficient killer. Nvidia CEO Jensen Huang reckons we might see AI-generated games in less than 10 years Ubisoft shows off AI-powered 'Neo NPCs' at GDC: 'It could be the start of a fantastic paradigm shift,' but let's be honest, it probably won't Today's Wordle answer for Saturday, March 23 By Tyler Wilde22 March 2024 By Morgan Park22 March 2024 By Lauren Morton22 March 2024 By Joshua Wolens22 March 2024 By Andy Chalk22 March 2024 By Joshua Wolens22 March 2024 By Harvey Randall22 March 2024 By Fraser Brown22 March 2024 By Sarah James22 March 2024 By Harvey Randall22 March 2024 By Jeremy Laird22 March 2024 PC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}