{
    "title": "Should stock-market investors care more about Nvidia or Fed? Crucial test \nahead.",
    "date": "2/25/2024",
    "url": "https://www.marketwatch.com/story/should-stock-market-investors-stop-worrying-about-the-fed-and-just-keep-loving-ai-34bb0abf",
    "text": "It almost seems like investors care more about Jensen Huang than Federal Reserve Chair Jerome Powell. Huang is the longtime CEO of chip maker Nvidia Corp. \n        NVDA,\n        +3.12%,\n       which stole the show last week by blowing away already lofty earnings expectations and leading stocks to new rounds of all-time highs, even as nagging worries over resurgent inflation continued to percolate in the background. Huang declared that the artificial intelligence industry, of which Nvidia is a prime supplier of crucial chips, has reached a “tipping point” that will see the technology go “mainstream.” Deep Dive: After Nvidia’s latest blowout, here are 20 AI stocks expected to rise as much as 44% That may lead investors to wonder whether they’re wasting their energy fretting over the economic cycle and the timing of Federal Reserve interest rate cuts. Should they instead embrace a rally led by technology stocks that is started to broaden out to other sectors, enhanced by the potential for advances in artificial intelligence to bring about a generational productivity boost that will lift corporate profits and cap inflation pressures? That’s a pretty picture, but one that is unlikely to come together so seamlessly. “I think investors will obsess over inflation metrics again,” Michael Arone, chief investment strategist at State Street Global Advisers, told MarketWatch in a phone interview. It so happens that the Federal Reserve’s favored inflation metric, the core reading of the personal-consumption expenditures index is due Thursday morning. The January data comes after markets were previously rattled by hotter-than-expected consumer-price index and producer-price index readings. Investors know — and the Fed has emphasized — that one month’s data doesn’t make a trend, Arone said, but it will be important for inflation to resume a trend back down toward the central bank’s 2% target. If that begins to look in serious jeopardy, market volatility will eventually be in store. Read: Wall Street is bracing for more strong U.S. economic and inflation data next week Investors came into 2024 pricing in six to seven quarter percentage point rate cuts over the course of the year, beginning in March. As the data came in and the Fed pushed back on those expectations, markets now see a somewhat better-than-50% chance cuts will begin in June and that the Fed will deliver only three or four by year-end, according to the CME FedWatch tool. Should inflation prove sticky or start to climb, investors could eventually be forced to countenance no rate cuts in 2024 or even the outside prospect that the Fed will need to hike yet again. That would be a major shock, Arone said, likely sending stocks into a correction and significantly pushing up Treasury yields. Barring that, Arone, is upbeat, and sees prospects for the rally to continue broadening out after the past week also saw strength in sectors outside tech and consumer services. A continued rally would give investors the opportunity to build exposure to small-caps and value stocks. Stocks extended their climb last week, with the S&P 500 \n        SPX\n       and the Dow Jones Industrial Average \n        DJIA\n       reaching new highs. The tech-heavy Nasdaq Composite \n        COMP\n       briefly flirted with its first record close in more than two years on Thursday and again Friday before pulling back, but still ended the week up 1.4%. Of course, the megacap-led tech rally isn’t a new phenomenon. Nvidia and its cohort of heavyweight AI beneficiaries led a 2023 stock-market rally that grew increasingly — and worryingly — concentrated. The “most important event in world stock markets last year was nothing macro but the Microsoft \n        MSFT,\n        -0.15%\n       investment in ChatGPT-maker OpenAI,” argued Christopher Wood, global head of equity strategy at Jefferies, in a note last week. “This was the catalyst for the AI thematic to start driving market psychology and, crucially, gave the most important sector in the world’s largest stock market a new story which is secular not cyclical,” he wrote. The rally has also prompted comparisons to the dot-com bubble of the late 1990s. Barron’s: Echo of 1995 or 1999? A look at how big one-day gains have contributed to the stock market’s year-to-date rally illustrates the role that tech sector strength plays. The S&P 500 was up 6.7% for the year to date through Thursday, with just five trading days accounting for that gain, noted Nick Colas, co-founder of DataTrek Research, in a note. That includes Thursday’s 2.1% rise, driven by Nvidia’s earnings, and four days with gains of 1% to 1.4%, including a Jan. 8 rise following an announcement of new chips by Nvidia; a Jan. 19 gain led by chip stocks following earnings guidance from Taiwan Semiconductor \n        TSM,\n        +0.78%\n      ; a Feb. 1 bounce following a selloff inspired by remarks from Powell; and a Feb. 2 rally driven by Meta Platform Inc.’s \n        META,\n        +0.36%\n       20% surge. The lesson is that the market is shrugging off the prospect of interest rates remaining higher for longer to focus on Big Tech’s earnings leverage, Colas wrote. “This is classic ‘midcycle’ market behavior. Investors can live with higher interest rates if (but only if) there is a promising development in an important sector.” Meanwhile, the degree of that promise remains up for debate. “Of course, many ‘new paradigms’ about U.S. productivity growth have been proffered by market pundits in the past 125 years. Not all of them have panned out, and there were really only two episodes (the mid-1960s and the mid-1990s) in which productivity growth in the U.S. stayed high sustainably,” said Thierry Wizman, global FX and rates strategist at Macquarie, in a note (see chart below). “But what matters is not so much whether this new AI-driven paradigmpans out; it matters whether people believe it will pan out, if it is tochange macro dynamics,” he said. Such a change could carry a sting. The danger is that a new growth paradigm leads the Fed to conclude that the so-called neutral rate — the level at which the official interest rate neither enhances nor sustains growth — is higher than it currently thinks, opening the door to further hikes. Meanwhile, investors are focused on whether AI will continue to drive strong results for leading technology providers and if it will allow companies that eventually use those products to become increasingly productive and more profitable, said Jose Torres, senior economist at Interactive Brokers, in a note. With many companies outside the tech sector offering cautious guidance, it doesn’t look like the practical aspects of AI are yet supporting aggregate profits, he said. “Only time will tell if Nvidia CEO Jensen’s optimism is warranted,” Torres wrote, “and while bulls have been energized by his comments and Nvidia’s quarterly results, bears are praying that AI may be more fluff than substance.” Investors betting on a ‘perfect’ landing will focus on PCE inflation data in the week ahead William Watts is MarketWatch markets editor. In addition to managing markets coverage, he writes about stocks, bonds, currencies and commodities, including oil. He also writes about global macro issues and trading strategies. During his time at MarketWatch, Watts has served in key roles in the Frankfurt, London, New York and Washington, D.C., newsrooms. William Watts is MarketWatch markets editor. In addition to managing markets coverage, he writes about stocks, bonds, currencies and commodities, including oil. He also writes about global macro issues and trading strategies. During his time at MarketWatch, Watts has served in key roles in the Frankfurt, London, New York and Washington, D.C., newsrooms. Visit a quote page and your recently viewed tickers will be displayed here. "
}