{
    "title": "The Motley Fool: Nvidia a fast-growing semiconductor giant",
    "date": "1/28/2024",
    "url": "https://www.dallasnews.com/business/personal-finance/2024/01/28/the-motley-fool-nvidia-a-fast-growing-semiconductor-giant/",
    "text": "businessPersonal Finance By The Motley Fool 5:00 AM on Jan 28, 2024 CST With a recent market value over $1.4 trillion, Nvidia is one of the largest semiconductor companies around, specializing in graphic processing units used for gaming and cryptocurrency mining, among other things, as well as artificial intelligence technology. Its stock has boosted the wealth of many shareholders, averaging annual growth of more than 60% over the past decade. Nvidia’s stock has often seemed overvalued, keeping many cautious investors away — while the stock kept rising. Recently, though, Nvidia shares, while not bargain-priced, have seemed close to reasonably valued, presenting an opportunity for risk-tolerant long-term investors. Despite its huge size, Nvidia is still growing briskly, with revenue up a whopping 206% year over year in its third quarter and net income up more than 1,250%. Such numbers are not likely to be the norm, though. Remember that stock performances are never guaranteed. Nvidia has rivals looking to take some of its market share, and its business is cyclical, rising or falling along with the economy. On top of that, the U.S. government has restricted chip exports to China and other countries, putting pressure on Nvidia. Become a business insider with the latest news. Or with: By signing up you agree to our Terms of Service and Privacy Policy Still, the stock is worth considering, even if its torrid growth rate slows. (The Motley Fool owns shares of and has recommended Nvidia.) From M.T. of Walnut Creek, Calif.: What’s the difference between swing trading and day trading? The Fool responds: Both are short-term trading practices where folks aim to profit from changes, or swings, in a security’s value over a short period. As you might guess, a day trader will buy, say, a certain stock and hold it for only a few minutes or hours, selling it by the end of the day. A swing trader is a little more patient, selling within a few weeks, at most. Both strategies will often employ “technical analysis,” which involves looking for promising patterns in graphs of stock prices without much regard for the underlying businesses. Swing traders may incorporate some “fundamental analysis,” too, assessing the financial health, competitive strengths, growth prospects and more of the companies whose stocks they’re trading. In general, we strongly recommend favoring fundamental analysis and investing in stocks for years if not decades. Short-term trading can seem more like speculating or gambling than actual investing. The Securities and Exchange Commission has warned, “Day trading is extremely risky and can result in substantial financial losses in a very short period of time.” From K.B., Potomac, Md.: What are some unusual or amusing ticker symbols? The Fool Responds: There are plenty! For example: Yum! Brands (YUM), the parent of KFC, Taco Bell and Pizza Hut; National Beverage (FIZZ); Gibraltar Industries (ROCK); Petco Health and Wellness (WOOF); Molson Coors Beverage (TAP); Southwest Airlines (LUV); 3M (MMM); Harley-Davidson (HOG); Olympic Steel (ZEUS); Heineken (HEINY); Ferrari N.V. (RACE); and Viper Energy (VNOM). Before they were bought out, eyewear maker Oakley sported the symbol OO, mattress maker Sealy had ZZ and auction house Sotheby’s had BID. Millions of Americans are not where they should be when it comes to savings for retirement. With inflation recently steep and wages not always keeping up, saving for retirement is easier said than done. Still, most of us need to be preparing for our financial futures. Here are some shocking facts to consider. Social Security is not likely to provide sufficient income in retirement. The average retirement benefit, as of December, was only $1,856, or a little over $22,000 per year. Millions of beneficiaries do collect more, but the maximum is still only $4,873 per month, or about $58,500 annually. And millions of beneficiaries are receiving less than $22,000. Clearly, most of us need to build up additional retirement income streams. They may come from stock dividends, interest-bearing investments, annuities we buy, pensions, rental income from real estate investments or a reverse mortgage, among other possibilities. According to the 2023 Retirement Confidence Survey, fully 33% of workers have less than $25,000 in savings and investments (excluding the value of a primary home), and 18% have less than $1,000. Nearly two-thirds have less than $250,000, and even that may not support people for too long — especially when you consider how costly health care can be. Per the folks at Fidelity, “a single person age 65 in 2023 may need approximately $157,500 saved (after tax) to cover health care expenses in retirement.” (Again, that’s an average, so while millions will spend less, millions will spend more.) Given all this, if you’re behind in your saving and investing for retirement, what can you do? Well, start saving more and be sure to invest long-term dollars effectively, such as in a low-fee index fund. Consider delaying retiring, too, because that can make your Social Security benefits bigger, can permit you to sock away more money and can give your investments more time to grow. Also, your nest egg would have to help support you for fewer years. Learn how to prepare for a secure retirement via our “Rule Your Retirement” service at Fool.com/services. From L.W. of Missouri: My most regrettable investing move happened decades ago. I went to my broker and told him I wanted to buy stock in steelmaker Nucor in my IRA. The broker said he was expecting it to split. I bought 160 shares in October of 2004. When I looked closer at the stock, I saw that it had just split — weeks earlier. I was too late to have my shares split. My loss on 160 shares was $8,568. The Fool responds: It seems that you might be misunderstanding how stock splits work — as many people do. The good news, though, is that you probably did not lose anything at all, because a stock split doesn’t really alter the value of a stock holding. For example, imagine that you buy 160 shares of a stock for $100 each, spending $16,000. If the stock splits 2-for-1, you’ll get two shares for each of your shares, and the stock price will be adjusted downward proportionately. So you’ll have twice as many shares, each worth about half as much. If the split happened when the stock was still at $100, you’d end up with 320 shares priced around $50 each, for a total value of about ... $16,000. We hope you’ve hung on to your shares, because Nucor’s stock has risen more than 650% since you bought We hope you’ve hung on to your shares, because Nucor’s stock has risen more than 650% since you bought, averaging annual gains of 12% — and that’s not even including its dividends. I trace my roots back to 1946, when I was founded as an investment adviser for a mutual fund. I soon launched more funds, and in 1974, the first money market fund that offered check-writing. I began offering IRAs in 1975 and 401(k)s in 1982. Today, based in Boston, I boast $11.5 trillion in assets under administration and employ more than 73,000 people. I serve more than 43 million individual investors in nine countries across North America, Europe, Asia and Australia, and I manage employee benefit programs for more than 24,000 businesses. I’m headed by the granddaughter of my founder. Who am I? Forgot last week’s question? Find it here. Last week’s answer: McIlhenny Co. The Motley Fool "
}