{
    "title": null,
    "date": "1/3/2024",
    "url": "https://www.benzinga.com/general/politics/24/01/36473198/top-stocks-sectors-loved-by-congress-members-who-traded-in-2023-apple-nvidia-microsoft-ford-and-",
    "text": "One of the hottest topics among members of Congress and investors has been the stock and options trading activity by several politicians. A new report reveals how several members of Congress outperformed the overall market, and also shares some of the top stocks and sectors picked the most by those in office. What Happened: Many stock indexes ended 2023 trading at all-time highs or near all-time highs, with 2023 turning into a rebound year for investors after a down 2022. A new report released by Unusual Whales highlighted the top traders in Congress with Brian Higgins (D-N.Y.) taking the crown with a 238.9% gain from 2023 trades. The report found that 32 members of Congress beat the performance of the S&P 500, which is tracked by the SPDR S&P 500 ETF Trust SPY. Republicans posted average gains of 17.99 and Democrats had average gains of 31.18% compared to the 24.8% gain for the S&P 500. The report highlighted some of the top sectors and stocks that members of Congress traded most often in 2023. Related Link: Tommy Tuberville Lost On Tesla Trade, Could Win Big On US Steel Trade – A Look At The Congress Trades Raising Eyebrows Top Sectors in 2023: The report highlights that the performance by political party may have been related to sector selection with many Democrats trading technology stocks and many Republicans trading financials, oil stocks and commodities that underperformed in 2023. The top overall sectors bought in 2023 shared in the report were: The top overall sectors sold in 2023 were: While financial services was a top sector among sales in 2023, several disclosures by members of Congress with sales of bank stocks timed near the collapse of several banks drew increased attention from the public. Technology led the way in 2023 with members of Congress actively buying and selling top performers in the sector. Another trade theme that often drew attention was shorting the market, which was done several times by several members of Congress, including Representative Thomas Carper (D-Del.) who used short ETFs to bet against the market. The moves come as Carper serves on the Senate Finance Committee. Top Stocks in 2023: Unusual Whales collaborated on two Congress Trading-themed ETFs in 2023, which allow investors a chance to invest alongside the members of Congress. The ETFs are the Unusual Whales Subversive Democratic Trading ETF NANC and the Unusual Whales Subversive Republican Trading ETF KRUZ. The new report from Unusual Whales highlights the top stocks that were bought and sold by members of Congress in 2023. The top 10 stocks bought by members of the House of Representatives were: The top 10 stocks sold by members of the House of Representatives were: The top 10 stocks bought by members of the Senate were: The top 10 stocks sold by members of the Senate were: The sector and stock purchases and sales are based on maximum dollars from financial disclosures, which means large transactions by several members of Congress could skew the results of how popular individual sectors and stocks were in 2023. The list of stocks and sectors that were bought and sold could illustrate a sense of where certain members of Congress believe the market is headed in 2023 and which sectors could outperform the overall market. Read Next: Best Trader In Congress Wagered $20M In Bets On A Major Tech Company – And He Loves Options © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}