{
    "title": "Better Tech Stock: Nvidia vs. Amazon",
    "date": "1/13/2024",
    "url": "https://www.fool.com/investing/2024/01/13/better-tech-stock-nvidia-vs-amazon/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The tech industry has long been known for its wealth of growth stocks, which tend to deliver consistent gains over the long term. The innovative nature of the industry has created an ever-expanding environment that often rewards companies and their investors with reliable growth. The chart below illustrates this as the Nasdaq-100 Technology Sector index has significantly outperformed the Nasdaq Composite and S&P 500 over the last decade.  Data by YCharts So, it's no surprise that successful holding companies like Warren Buffett's Berkshire Hathaway have significant portions of their portfolios in tech stocks. From 1965 to 2022, Berkshire's stock appreciated at a compound annual growth rate (CAGR) of nearly 20% as its portfolio has soared. As a result, it's not a bad idea to similarly dedicate a large portion of your holdings to tech. Nvidia (NVDA 3.12%) and Amazon (AMZN 0.40%) are two attractive options. These companies dominate their respective industries, with one leading in high-powered chips and the other home to the world's largest cloud platform. So, let's examine whether Nvidia or Amazon is the better tech stock right now. Chipmakers are some of the best ways to invest in tech. These companies are powering the industry with their hardware, with growth catalysts throughout the market. In Nvidia's case, the company's chips can be found in a wide range of items, from artificial intelligence (AI) models to cloud platforms, video game consoles, laptops, and custom-built PCs. The company's success in tech has seen its stock skyrocket over 1,400% in the last five years, while its annual revenue has risen 130%. However, a boom in AI last year suggests Nvidia has a lot more to offer new investors. Nvidia has dominated the graphics processing unit (GPU) market for years, while other chipmakers like Advanced Micro Devices and Intel have mainly prioritized central processing units (CPUs). As a result, Nvidia has been able to get ahead in industries that require GPUs like AI. Increased interest in AI caused demand for GPUs to skyrocket in 2023, with Nvidia perfectly positioned to supply its chips to the entire market. As a result, its stock is up around 250% year over year. Meanwhile, in the third quarter of 2023 (which ended October 2023), the company posted revenue growth of 206%, with operating income up more than 1,600%. The AI market is projected to expand at a CAGR of 37% through 2030 and hit a value of $257 billion this year. The sector is one of the fastest-growing areas of tech, making Nvidia's leading role in AI chips a compelling reason to invest in its stock. Like Nvidia, Amazon has vested interests in multiple areas of the tech industry. Its retail site has attained leading market share in e-commerce in numerous countries, paving the way for the company to branch out into cloud computing, consumer robotics, and even space satellites. However, its cloud platform, Amazon Web Services (AWS), is the best reason to consider investing in its stock. AWS holds a 32% market share in the cloud market, outperforming rivals Microsoft Azure and Alphabet's Google Cloud. Meanwhile, the industry is projected to develop at a CAGR of 20% until at least 2030 and reach more than $2 trillion. Moreover, AWS enabled Amazon to build a lucrative position in AI. Businesses are increasingly seeking ways to integrate the technology into their workflows and are turning to cloud services to do so. AWS has responded to rising demand by adding a diverse range of AI tools over the last year and plans to venture into chip production soon, diversifying its role in the budding arena. AWS accounts for 16% of Amazon's revenue yet makes up more than 60% of its operating income. Cloud computing is an immensely profitable business and only strengthens the company's long-term outlook. Nvidia and Amazon have both earned a spot in the \"Magnificent Seven\" of tech, which also includes Apple, Microsoft, Alphabet, Meta Platforms, and Tesla. These companies are top performers in the industry and likely have much to offer investors over the long term. However, earnings-per-share (EPS) estimates suggest Nvidia might have more growth potential in the coming years.  Data by YCharts This chart shows over the next two fiscal years, Nvidia's earnings could hit $24 per share, while Amazon's may achieve close to $5 per share. Multiplying these figures by each company's forward price-to-earnings ratios (Nvidia's 44 and Amazon's 43) yields stock prices of $1,056 for Nvidia and $202 for Amazon. Considering their current positions, these projections would see Nvidia's stock rise 96% and Amazon's 34% over the next two fiscal years. While both figures are impressive, Nvidia's higher percentage and booming chip business make it the better tech stock right now and a must-buy for 2024. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Berkshire Hathaway, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}