{
    "title": "Opinion: These Are the Stock Splits Investors Want to See in 2024",
    "date": "1/5/2024",
    "url": "https://www.fool.com/investing/2024/01/05/opinion-these-are-the-stock-splits-investors-want/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Stock splits are like making change: They don't change how much money you have -- only how it appears. But while stock splits don't change a stock's fundamentals, they often change how investors react. Many investors simply won't buy stocks with price tags over a certain amount. Here are three stocks investors are desperate to see split in 2024. Image source: Getty Images. Topping my list is a software company that is jumping headfirst into the artificial intelligence (AI) pool: Adobe (ADBE -2.29%). The company is behind iconic software products such as Adobe Photoshop, Adobe Illustrator, and Adobe Premier Pro. But it's not resting on its laurels. Adobe has quickly integrated AI-enabled features into many, if not all, of its product offerings. For example, Adobe Firefly uses AI to generate high-quality images. Moreover, those images can be used commercially, thus potentially undercutting the business model of image license companies, such as Shutterstock and Getty. However, investors hoping for an Adobe stock split shouldn't hold their breath. The company last split its shares back in 2005. Granted, shares are once again trading near an all-time high and tip the scales at nearly $600 per share as of this writing. Yet, a high dollar value alone isn't always enough to convince a board of directors to move forward with a stock split. Although investors may be desperate for an Adobe stock split in 2024, I wouldn't count on it. Next up is MercadoLibre (MELI 1.05%), the Latin American e-commerce giant. Needless to say, with a stock price well over $1,500, investors would love to see a stock split for MercadoLibre. Even so, it may not happen. Despite having gone public more than 15 years ago, MercadoLibre has never split its shares. The company, which combines e-commerce and payments processing like a Latin American fusion of Amazon and PayPal, is red-hot. In its most recent quarter (the three months ending on Sept. 30, 2023), the company reported revenue growth of 40%, with trailing-12-month revenue climbing to $13.2 billion. Better still, free cash flow grew to $84.62 per share, up from $48.88 per share one year ago. In any event, investors shouldn't get their hopes up for a MercadoLibre stock split. Why? Consider this: One reason companies tend to keep their stock prices around $100 per share is so management can fine-tune employees' stock-based compensation. However, MercadoLibre has a tiny amount of stock-based compensation. In the last 12 months, it has paid only $84 million in stock-based compensation. Compare that to a company like Airbnb, which has spent over $1 billion on stock-based compensation. In short, MercadoLibre lacks one of the main motivations for a company to split its stock. Therefore, the board of directors may choose to do what it has done since the company went public -- refrain from doing a stock split. Finally, the stock split that many investors want to see is Nvidia (NVDA 3.12%). That's because Nvidia was the stock to own in 2023, having generated a massive 239% return. What's more, the company has executed multiple stock splits dating back to 1999 -- five to be exact. The latest took place in 2021. Given the massive retail investor interest in the stock, and the fact that Nvidia has split its shares around its current price point in the not-too-distant past, it stands to reason that another stock split could be on the horizon. What's more, Nvidia is riding a wave of AI optimism that has now made it the fifth-largest American company. Indeed, it's not unrealistic to think Nvidia could surpass Amazon or Alphabet in 2024 to become the third-largest American company.  NVDA Market Cap data by YCharts That said, Nvidia now stands out among the top eight largest companies as having the highest stock price. So, it's possible the board of directors may want to divide its shares to bring them back in line with fellow megacap companies like Amazon and Alphabet, whose shares trade at around $150 per share. Finally, as noted earlier, companies prefer to keep share prices relatively low to fine-tune stock-based compensation. Nvidia, which paid nearly $3.3 billion in stock-based compensation over the last 12 months, certainly falls into this category. Nvidia has the need, the history, and the motive to split its shares in 2024. I'm sure I speak for many when I say Nvidia is the most wanted stock split in the new year.  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Jake Lerch has positions in Adobe, Airbnb, Alphabet, Amazon, MercadoLibre, and Nvidia. The Motley Fool has positions in and recommends Adobe, Airbnb, Alphabet, Amazon, MercadoLibre, Nvidia, PayPal, and Shutterstock. The Motley Fool recommends the following options: long January 2024 $420 calls on Adobe, short January 2024 $430 calls on Adobe, and short March 2024 $67.50 calls on PayPal. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}