{
    "title": "Zacks Market Edge Highlights: NVDA, MSFT, SMCI, TSCO and ULTA",
    "date": "1/26/2024",
    "url": "https://finance.yahoo.com/news/zacks-market-edge-highlights-nvda-110000194.html",
    "text": "Chicago, IL – January 26, 2024 – Zacks Market Edge is a podcast hosted weekly by Zacks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here:  https://www.zacks.com/stock/news/2216062/what-if-you-only-buy-the-magnificent-7-stocks Welcome to Episode #387 of the Zacks Market Edge Podcast. (1:00) - What Is The Best Way To Gain Exposure To The Magnificent Seven? (4:40 - Roundhill Magnificent Seven ETF: MAGS (9:30) - Breaking Down The Recent Performance For The ARK Innovation ETF: ARKK (17:20) - Invesco NASDAQ Next Gen 100 ETF: QQQJ (25:30) - Episode Roundup: MAGS, QQQM, QQQJ, MOON, MGK, TSCO, ULTA, SMCI, ZM, COIN, ARKK Podcast@Zacks.com Every week, host and Zacks stock strategist, Tracey Ryniec, will be joined by guests to discuss the hottest investing topics in stocks, bonds, and ETFs and how it impacts your life. This week, Tracey is joined by Neena Mishra, Zacks Director of ETF Research, to discuss how to get exposure to the Magnificent 7 stocks, either through ETFs or just by owning the individual stocks themselves. With the Mag 7 now making up 29% of the S&P 500 index, and many of the Mag 7 stocks hitting new highs, why not just own the Mag 7 stocks and call it a day? Neena has her favorite ETFs that will get you plenty of Mag 7 exposure, or you can buy individual stocks as well. 1. NVIDIA Corp. NVDA NVIDIA is one of the largest companies in the world with a market cap of $1.5 trillion. Shares of NVIDIA are hitting new all-time highs in 2024, gaining 212% in the last year. It’s not cheap. NVIDIA trades with a forward P/E of 48 but it’s expected to grow sales by 53% in fiscal 2025. Should you own NVIDIA in your portfolio? 2. Microsoft Corp. MSFT Microsoft is a $3 trillion market cap company, making it one of the largest companies in the world. Shares of Microsoft keep hitting new all-time highs in 2024 and are up 64.4% over the last year. Microsoft is trading with a forward P/E of just 35.8, which makes it look cheap compared to NVIDIA. However, sales are expected to rise just 14.4% in fiscal 2024, which is considerably less than the blockbuster growth expected of NVIDIA. Should you own Microsoft in your portfolio? Growth stocks other than the Magnificent 7 have been hitting new highs in recent months as well. You can own those stocks in Invesco’s NASDAQ NextGen ETF, which tracks the 101 to 200th largest companies in the NASDAQ. Or you can own the individual components. 3. Super Micro Computer, Inc. SMCI Super Micro Computer is the third largest position in the Invesco NASDAQ NextGen ETF. It has a market cap of $26 billion. Shares of Super Micro Computer are up a whopping 520% over the last year. Yet Super Micro Computer is still trading with an attractive forward P/E of just 26.7. Sales are expected to jump 53% in fiscal 2024. Should a smaller tech company like Super Micro Computer be on your short list instead of the Mag 7? 4. Tractor Supply Co. TSCO Tractor Supply is also a top holding of the Invesco NASDAQ NextGen ETF. But it’s not seeing the big returns of some of the technology names. Shares of Tractor Supply are up just 6% over the last year. It trades with a forward P/E of just 22 but earnings are expected to rise just 3.3% in 2024. Should investors consider growth stocks like Tractor Supply even if they’re not in technology? 5. Ulta Beauty, Inc. ULTA Ulta Beauty has a market cap of $23.2 billion. It’s also a top position in the Invesco NASDAQ NextGen ETF. Shares of Ulta Beauty are down 4.1% over the last year. It’s the cheapest of these NextGen stocks with a forward P/E of 18.8. Earnings are expected to rise 6.4% in fiscal 2025. Should a retailer like Ulta Beauty be on your list of must-own growth stocks? Tune into this week’s podcast to find out. [In full disclosure, Tracey owns shares of MSFT and ULTA in her personal portfolios.] Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com/performance Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Tractor Supply Company (TSCO) : Free Stock Analysis Report Ulta Beauty Inc. (ULTA) : Free Stock Analysis Report Super Micro Computer, Inc. (SMCI) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}