{
    "title": "Can NVIDIA stock hit the $600 valuation in the ongoing winning streak?",
    "date": "1/11/2024",
    "url": "https://invezz.com/news/2024/01/11/can-nvidia-stock-hit-the-600-valuation-in-the-ongoing-winning-streak/",
    "text": "Follow Invezz on Telegram, Twitter, and Google News for instant updates > Nvidia Corp. (NASDAQ:NVDA) hit a record of above $550 on Thursday, extending its winning streak in 2024. Notwithstanding, the gains in the past 12 months are 6 times higher than its composite NASDAQ index. Consequently, NVIDIA is up 239%, with the gains expected to continue for one of the best technology stocks. The key to NVIDIA’s stock price prediction is its recent breakout. The stock breached a key barrier at $500, the previous all-time high, signifying it has set a new price floor. The breakout grew buyer interest, with the stock moving in a parabolic pattern afterwards.   As expected, NVIDIA’s breakout attracted analysts’ ratings. Fairlead technical analyst Katie Stockton says the breakout offers NVDA a long-term uptrend momentum. The analyst doesn’t expect the bullish momentum to stop until the stock reaches $600. Stockton’s rating is consistent with other analysts monitored by TipRanks, who hold a higher target. The consensus estimate for the stock is a strong buy, with an average price target of $662.39. Strong fundamentals are also responsible for the robust ratings. Invezz covered how NVIDIA is increasingly becoming an industry leader in visual and AI computing solutions. The company continues to make inroads into these nascent sectors. The latest has been a new series of graphic cards for enhanced gaming and AI experience.  Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. Nvidia also partnered with biotech Amgen this week for breakthroughs in drug development using generating AI. These developments have only added fuel to a stock already on its way up. Are you looking for fast-news, hot-tips and market analysis? \n\n  \n    Sign-up for the Invezz newsletter, today. A technical outlook shows Nvidia on a strong momentum after breaking past $500. However, NVIDIA is overbought, with an RSI reading of 72 on the daily chart. Given the strong fundamentals and breakout, we anticipate Nvidia’s momentum to continue. Volume indicators support buyer strength, which backs up the prediction. A $600 valuation could be met sooner than later. Nonetheless, Nvidia could make brief pauses and pullbacks before the trend continues. This is consistent with the overbought conditions, although brief declines could offer stronger comebacks. Buying Nvidia is recommended after corrections. The stock has room to run, with the price rising to $600 and higher. However, investors are better off buying on potential market dips as long as NVIDIA remains above $500. Copy expert traders easily with Plus500. Invest in stocks like Tesla & Apple. Instantly trade ETFs like FTSE 100 & S&P 500. Sign-up in minutes. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.  Should you buy Bitcoin before the halving? Should you buy Bitcoin before the halving?  Use Invezz APP Get a better user experience Allow notifications? Allow us to send you updates You must agree to the privacy policy. "
}