{
    "title": null,
    "date": "1/29/2024",
    "url": "https://finance.yahoo.com/news/ai-dark-horses-3-underestimated-212644522.html",
    "text": "Almost invariably, whenever someone brings up AI stock opportunities, Nvidia (NASDAQ:NVDA) is the name you’ll most likely hear. If not that, then it could be Microsoft (NASDAQ:MSFT) and its multi-billion-dollar investment in artificial intelligence startup OpenAI, the creator of ChatGPT. Still, many of these enterprises now command rich premiums, especially NVDA. Still, the AI train appears to move only in one direction: northward. Per Statista, the market size in AI might reach $305.9 billion by year’s end. By 2030, the sector could hit $738.8 billion, representing a compound annual growth rate (CAGR) of 15.83%. And that could be an understatement. Bloomberg states that generative AI alone could be worth $1.3 trillion by 2032. With so many opportunities available, below are enticing AI stock opportunities to consider. InvestorPlace - Stock Market News, Stock Advice & Trading Tips Source: shutterstock.com/Below the Sky A technology player specializing in enterprise AI, C3.ai (NYSE:AI) on the surface offers plenty of relevance. Per its website, the company delivers comprehensive solutions via an application development platform along with a large and expanding canvas of turnkey enterprise AI applications. Further, C3.ai enjoys a vast clientele list that encompasses manufacturing, financial services, government, utilities, and oil and gas, among many other sectors. To be sure, AI stock gained over 54% of equity value in the past 52 weeks. However, in the trailing six months, circumstances have been less auspicious, losing nearly 37%. Unsurprisingly, analysts have become pensive on the company, pegging AI a consensus hold. Also, the average price target is modest at only $27.50, implying a bit over 9% upside potential. Still, according to Coherent Market Insights, the enterprise AI market size reached a valuation of just over $16 billion in 2022. Further, it could expand at a CAGR of 34.1% by 2030. Moreover, patient investors should note that C3.ai leverages a cash-rich balance sheet. Combined with a short interest of 36.87% of its float, AI could be one of the speculative AI stock opportunities. Source: T. Schneider / Shutterstock.com In the past 52 weeks, Axon Enterprise (NASDAQ:AXON) has already gained over 31% of equity value. So, it could be one of the AI stock opportunities. However, it doesn’t seem underestimated by most measures. Further, the company carries some controversy. With its development of the Taser – a non-lethal weapons system – along with police body cameras, it’s been thrust into recent debates involving law enforcement. And just for full disclosure, a Reuters article cast doubts on Axon’s “feel-good narrative” that it has deployed to justify its business. So yes, there’s some ugliness surrounding the enterprise. Nevertheless, it very well could be one of the AI stock opportunities. In particular, the company is focusing on various AI initiatives to help cut down on paperwork and other administrative matters. This way, officers can spend more time in their communities where they’re needed. Plus, the need for officers will likely accelerate in the future. For example, if former President Donald Trump wins the White House, that will probably upset a great many people. AI-integrated law enforcement is simply a reality, thus imbuing AXON with pertinence. Source: JHVEPhoto/shutterstock.com One of the more compelling ideas among AI stock opportunities, lidar specialist Luminar Technologies (NASDAQ:LAZR) started with much fanfare. At the peak of its popularity, LAZR traded hands near $40 on a weekly average basis, per Google Finance. However, the party quickly ended there. Since then, it’s been a long, ugly ride. In the trailing one-year period, LAZR slipped 56%. Even on a year-to-date basis, it’s ugly, dropping almost 13%. Still, I suppose an argument can be made that LAZR is significantly de-risked. That’s not just a random thought. According to TipRanks, LAZR holds a consensus moderate buy view among Wall Street analysts. Further, the assessment breaks down as four buys, four holds and one sell. It’s not the greatest read but there’s the thing: the average price target stands at $6.67, implying over 145% upside potential. Where Luminar could start making up ground is in its AI-driven initiatives. Last year, it joined forces with Plus, a global provider of autonomous solutions, to develop automated driving and safety systems for commercial vehicle manufacturers. If you don’t mind taking risks, LAZR could be one of the top AI stock opportunities at these levels. On the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. A former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The post AI’s Dark Horses: 3 Underestimated Stocks in the AI Revolution appeared first on InvestorPlace. Related Quotes "
}