{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.statista.com/chart/31585/semiconductor-vendors-annual-revenue/",
    "text": "Industry Overview Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 100m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: After a banner year for the semiconductor industry, revenues dropped by 11 percent to $533 billion, according to a recent analysis by Gartner. Almost no chip manufacturer improved its results year-on-year - with one clear exception.NVIDIA, previously best known to video gamers for its graphics cards, made it into the top 5 companies with the highest annual revenue in the semiconductor segment for the first time this year with a sales increase of almost 56 percent. This can be attributed to the AI boom of the past year, driven by the success of OpenAI's ChatGPT and the resulting increase in demand for chips geared towards AI applications. In 2022, NVIDIA was still in twelfth place in annual revenue.In contrast, the financial results of Samsung Electronics and Intel, which have alternated in first and second place among the chip manufacturers with the highest sales numbers for years, significantly worsened. Samsung, for example, lost around 38 percent of its revenue compared to the previous year, compared to 17 percent for Intel. Alongside NVIDIA, only Broadcom and STMicroelectronics in the top 10 semiconductor vendors improved on the sales front compared to their previous year, albeit only in the single-digit range. According to Gartner, the decline in sales is primarily due to oversaturation or a lack of demand in the storage segment, for example for PCs, servers and smartphones. The corresponding segment generated 37 percent less revenue than in 2022. Outside of memory products, the market only shrank by three percent, which, according to Gartner analyst Joe Unsworth, is also due to the increased interest in AI solutions. \"The demand for non-memory semiconductors for AI applications was the strongest growth driver, with the automotive sector (especially electric vehicles), defense and aerospace industries, also outperforming most other application segments,\" Unsworth said. After a banner year for the semiconductor industry, revenues dropped by 11 percent to $533 billion, according to a recent analysis by Gartner. Almost no chip manufacturer improved its results year-on-year - with one clear exception. NVIDIA, previously best known to video gamers for its graphics cards, made it into the top 5 companies with the highest annual revenue in the semiconductor segment for the first time this year with a sales increase of almost 56 percent. This can be attributed to the AI boom of the past year, driven by the success of OpenAI's ChatGPT and the resulting increase in demand for chips geared towards AI applications. In 2022, NVIDIA was still in twelfth place in annual revenue. In contrast, the financial results of Samsung Electronics and Intel, which have alternated in first and second place among the chip manufacturers with the highest sales numbers for years, significantly worsened. Samsung, for example, lost around 38 percent of its revenue compared to the previous year, compared to 17 percent for Intel. Alongside NVIDIA, only Broadcom and STMicroelectronics in the top 10 semiconductor vendors improved on the sales front compared to their previous year, albeit only in the single-digit range. According to Gartner, the decline in sales is primarily due to oversaturation or a lack of demand in the storage segment, for example for PCs, servers and smartphones. The corresponding segment generated 37 percent less revenue than in 2022. Outside of memory products, the market only shrank by three percent, which, according to Gartner analyst Joe Unsworth, is also due to the increased interest in AI solutions. \"The demand for non-memory semiconductors for AI applications was the strongest growth driver, with the automotive sector (especially electric vehicles), defense and aerospace industries, also outperforming most other application segments,\" Unsworth said.  Description This chart shows the semiconductor companies with the highest annual revenues. Report Can I integrate infographics into my blog or website? Yes, Statista allows the easy integration of many infographics on other websites. Simply copy the HTML code that is shown for the relevant statistic in order to integrate it. Our standard is 660 pixels, but you can customize how the statistic is displayed to suit your site by setting the width and the display size. Please note that the code must be integrated into the HTML code (not only the text) for WordPress pages and other CMS sites. Statista offers daily infographics about trending topics, covering:Economy & Finance, Politics & Society, Tech & Media, Health & Environment, Consumer, Sports and many more. Feel free to contact us anytime using our contact form or visit our FAQ page.  Need infographics, animated videos, presentations, data research or social media charts? More Information "
}