{
    "title": "Singtel Leverages Nvidia's AI to Power its Next-Gen Data Centres",
    "date": "1/31/2024",
    "url": "https://markets.businessinsider.com/news/stocks/singtel-leverages-nvidia-s-ai-to-power-its-next-gen-data-centres-1033014592",
    "text": "SGX-listed Singapore Telecommunications, or Singtel (SG:Z74), is leveraging American chip giant Nvidia’s (NASDAQ:NVDA) AI (artificial intelligence) platform to power its next-gen data centre brand, called Nxera. On January 31, Singtel signed four strategic deals with industry experts, including Nvidia, while unveiling Nxera. Singtel is one of the four major mobile network players in Singapore and the country’s prime fixed-line operator. Singtel’s new-age Nxera data centres will help the company meet its decarbonization target of net-zero emissions by 2028. Singtel will wind down five of its old and less efficient data centres and build greener AI-ready data centres. Currently, only two of Singtel’s data centres are operational at 60MW capacity. As per the deal with Nvidia, Singtel will become the chipmaker’s cloud partner in the Southeast Asia region. Singtel Digital InfraCo, the company’s data centre subsidiary, will provide AI enterprise solutions to both large and small businesses via the Nxera data centres hosting Nvidia’s AI platform. Bill Chang, CEO of Nxera and Singtel Digital InfraCo, said that the company will rent out Nvidia’s graphic processing unit (GPU) clusters to customers to support their cloud and AI requirements. These clusters are otherwise scarcely available and expensive to buy. Singtel is also collaborating with renewable energy players like Gulf Energy, Medco Power, Sembcorp, and TNB Renewables. By leveraging their power play, Singtel’s Nxera data centres will feature a PUE (power usage effectiveness) of 1.23, one of the lowest in the industry to date.  Moreover, Singtel will partner with local technology players to innovate a liquid and immersion cooling system to minimize water consumption and reduce carbon emissions. And finally, Singtel, along with five leading institutions, will form a Regional Sustainable Data Centre Academy by mid-2024. The academy will host the latest curriculum on data centre, machine learning, and AI and will churn out 150 professionals annually. With four unanimous Buys, Z74 stock commands a Strong Buy consensus rating on TipRanks. The Singapore Telecommunications share price target of S$3.20 implies 32.3% upside potential from current levels. Disclosure Indices Commodities Currencies Stocks "
}