{
    "title": "The Zacks Analyst Blog Highlights NVIDIA, Boeing, Sony Group, Charles \nSchwab and Synopsys",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-113000926.html",
    "text": "Chicago, IL – January 15, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NVIDIA Corp. NVDA, The Boeing Co. BA, Sony Group Corp. SONY, The Charles Schwab Corp. (SCHW) and Synopsys, Inc. (SNPS). The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corp. , The Boeing Co. and Sony Group Corp. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>NVIDIA’s shares have outperformed the Zacks Semiconductor - General industry over the past six months (+19.3% vs. +16.9%). The company’s computer & networking revenues are gaining from the strong growth of artificial intelligence (AI), high-performance computing and accelerated computing.The data center end-market business is likely to benefit from the growing demand for generative AI and large language models using graphic processing units (GPUs) based on NVIDIA Hopper and Ampere architectures. A surge in hyperscale demand and a solid uptake of AI-based smart cockpit infotainment solutions are acting as tailwinds.Collaborations with Mercedes-Benz and Audi are likely to advance its presence in autonomous vehicles and other automotive electronics space. However, its near-term prospects are likely to be hurt by softening IT spending amid macroeconomic headwinds.(You can read the full research report on NVIDIA here >>>)Shares of Boeing have outperformed the Zacks Aerospace - Defense industry over the past year (+4% vs. -6.8%). The company remains the largest aircraft manufacturer in the United States in terms of revenues, orders and deliveries. During the third quarter, the jet giant booked 398 net commercial airplane orders.A strengthening U.S. defense budget should also boost Boeing’s Defense, Space & Security segment growth. Boeing has ample liquidity to meet its debt obligations in the near term.However, Boeing expects supply-chain disruptions to continue to harm its operational results, at least in the near term. Its dispute with Embraer over termination of the earlier joint venture might cause it to incur some loss in the future. Rising jet fuel price also poses a threat to the stock’s future growth.(You can read the full research report on Boeing here >>>)Sony’s shares have outperformed the Zacks Audio Video Production industry over the past year (+13.7% vs. +12.7%). The company’s performance is benefiting from continued strength in the Games & Network (G&NS) segment. The company continues to expect to sell more than 25 million units of its PlayStation 5 in the current year.SONY sold 4.9 million units of PS5 in Q2, up 25% year over year. Strength in Music, and Pictures segments are other tailwinds. The Music segment benefits from higher recorded music and music publishing sales from paid subscription streaming services. Frequent product launches and strategic collaborations bode well.The company also raised overall guidance for fiscal 2023 revenues It now expects sales of ¥12,400 billion compared with the earlier guidance of ¥12,200 billion. However, SONY lowered guidance for Pictures and Financial Services segments. Stiff competition and weak global macroeconomic conditions are concerning.(You can read the full research report on Sony here >>>)Other noteworthy reports we are featuring today include The Charles Schwab Corp. and Synopsys, Inc. Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report The Boeing Company (BA) : Free Stock Analysis Report The Charles Schwab Corporation (SCHW) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Synopsys, Inc. (SNPS) : Free Stock Analysis Report Sony Corporation (SONY) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}