{
    "title": null,
    "date": "1/4/2024",
    "url": "https://markets.businessinsider.com/news/stocks/exclusive-buy-the-dip-%E2%80%94-there-s-a-lot-more-upside-to-come-says-marc-chaikin-1032944300",
    "text": "Stocks have experienced a shaky beginning in 2024, with initial losses followed by slight gains on Thursday. However, Marc Chaikin, founder and CEO of Chaikin Analytics, believes that this does not signify an end to the rally that began in late October. During his appearance on Benzinga PreMarket Prep, Chaikin highlighted his perspective, especially for the 493 stocks in the S&P 500 that fall outside the realm of the so-called Magnificent Seven tech giants. He pointed out that this period could be particularly significant for these stocks, suggesting potential opportunities outside the tech sector. Despite a small gain during Thursday morning, the broad market index remains 1.1% lower since 2024 trading began on Tuesday. The exchange traded fund that tracks the index, the SPDR S&P 500 ETF (NYSE:SPY) is down by the same amount. Chaikin puts this in context by explaining that on Tuesday, when the S&P 500 fell by 1%, there were more stocks that gained than stocks that lost. Because of the huge weighting of the Mag7 — Amazon.com Inc (NASDAQ:AMZN), Meta Platforms Inc (NASDAQ:META), Nvidia Inc (NASDAQ:NVDA) et al — the market was lower. “If you’ve taken profits, you’ve got to look for the opportunities to get back in to the market,” Chaikin said.  Also Read: Uncle Sam’s Crypto Stash: $8.3B Bitcoin Hoard Threatens Market Plunge Chaikin said that there’s more upward potential for the markets, anticipating that the S&P 500 will not only breach its all-time high but will also continue to climb further. He observes a technical analysis tool called the McClellan Summation Index which, on the S&P 500, has moved over 1,000. “This index only gets over 1,000 at the beginning of bull markets — not in bear markets, and not at the end of anything. So that’s telling you there’s a lot more upside,” Chaikin said. “It summarizes the mood of the market and the flow of funds into stocks,” he added. “In the S&P 500, the Summation index went to a level that’s only been seen one other time. And in this case, you can’t take a contrarian view to that.” Chaikin Analytics employs a Power Gauge rating that Chaikin himself developed, which scans the market each day for stocks displaying strong price and volume activity then assigns a rating: bullish, neutral or bearish.  In the pharma sector, Chaikin says that Pfizer Inc (NYSE:PFE), which has underperformed its peers over the past year, has just turned bullish on the Power Gauge. Regarding Eli Lilly And Co (NYSE:LLY), a stock that surged 72% in 2023 driven by its weight-loss drugs, Chaikin advises, “I would definitely be a seller here — the stock’s trading at 100 times earnings.” But his current favorites are among the industrials, consumer discretionary, financials, materials, and very selective, lesser named tech stocks. “One mid-cap name that I really like is Boise Cascade Co (NYSE:BCC),” he said. The company is a producer of wood products and supplier to the construction industry. He also likes 3M Co (NYSE:MMM), the company that is still in the middle of multiple lawsuits for supplying earplugs to the military that didn’t work properly.  “Look at the chart on 3M and the double top at the $200 area in 2019 and 2022. The stock is currently trading with a 5.5% dividend yield at $110 — that’s a lot of upside,” he said. “They always come up with something like a Post-It-Note — some innovative product that drives the top line revenue,” Chaikin added. Now Read: Apple’s Stock Rally Vs. Operational Realities: Assessing The Divide After 2 Analyst Downgrades Photo: MarcChaikin/ChaikinAnalytics 3844328/Pixabay Indices Commodities Currencies Stocks "
}