{
    "title": "3 Unstoppable Growth Stocks to Buy If There's a Stock Market Sell-Off",
    "date": "2/5/2024",
    "url": "https://www.fool.com/investing/2024/02/05/3-unstoppable-growth-stocks-buy-market-selloff/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The S&P 500's return to an all-time high confirms the market entered a bull market. With this recent realization, downturns are likely not on the minds of most investors at this moment. However, due to the cyclical state of markets, investors should expect another bear market at some point and have a plan to deal with that scenario. Fortunately, bear markets are a great time to buy high-quality stocks on sale, and when that time comes, investors should consider loading up on Nvidia (NVDA 3.12%), The Trade Desk (TTD), and MercadoLibre (MELI 1.05%). Here's why. Admittedly, Nvidia may not seem like much of a \"pullback stock.\" The stock has risen nearly sixfold since its October 2022 low, and at a forward P/E ratio of 32, it is not as pricey as investors might assume. Still, Nvidia also has a history of massive declines during bear markets. When it reached its October 2022 low, the stock had fallen by more than two-thirds from its previous all-time high in November 2021. Also, when the market turned bearish in late 2018, Nvidia lost more than half of its value in the last three months of that year. Nonetheless, investors should also know that the gains following those declines more than made up for the bear market losses. Today, Nvidia's dominant position in the artificial intelligence (AI) chip market has buoyed the stock. This led to massive revenue growth for the company. In the first nine months of fiscal 2024 (ended Oct. 29. 2023), revenue of $39 billion surged 86% higher compared with the same period in fiscal 2023. Consequently, net income reached more than $17 billion in the first three quarters of fiscal 2024. Nvidia earned only $3 billion during the same time frame in 2023. Between AI's rising popularity and Nvidia's history, any pullback will become a likely buying opportunity. The internet fostered a lucrative digital advertising industry, and ad-related tools have become increasingly crucial amid that rise. To that end, The Trade Desk's ad tech platform has become a go-to for media buyers. Through the platform, agencies and advertisers can manage ad campaigns. In the same vein as Roku, it has developed a reputation for neutrality, which reduces the odds of biased ad spending that could become an issue with an ad giant such as Google parent Alphabet. Admittedly, The Trade Desk stock is tied to the state of ad spending. The last downturn occurred in 2022, leading to a stock decline of as much as two-thirds. Despite that sell-off, the Trade Desk is doing what it needs to keep such declines temporary. This is because the business continued to grow even as the stock experienced a bear market sell-off. During the 2022 downturn, revenue increased 32% yearly. Also, the $1.3 billion in revenue in the first three quarters of 2023 rose by 23%. Nonetheless, it turned profitable during that time, reporting $82 million in net income in the first nine months of 2023, up from an $18 million loss during the same timeframe in 2022. Due to the improved profitability, the Trade Desk sells for about 49 times forward earnings. Whether the stock goes up or down, profits are likely to see rapid improvement, making The Trade Desk stock a buy on just about any pullback. MercadoLibre is a strong sell-off stock because the company has learned to prosper in an often hostile environment. This region often contends with government bureaucracy, political turmoil, and high inflation. Yet MercadoLibre thrives because of these challenges. It supports e-commerce, giving merchants an additional sales outlet. Moreover, to reach more of Latin America's cash-based customers, it started Mercado Pago, which can facilitate e-commerce transactions for those who lack access to the traditional banking system. Also, Mercado Envios handles fulfillment and logistics. The company introduced one- and two-day shipping to markets where it had not been previously available. Such businesses are recession-resistant. Thus, it should surprise few that businesses brought in $10.2 billion in the first nine months of 2023, a 36% increase year over year. Interestingly, that represents a slowdown from 2022's 48% revenue growth rate, a time when the stock suffered through a bear market. Nonetheless, MercadoLibre generated a net income of $822 million during that period, up from $317 million in the first three quarters of 2022. Furthermore, its revenue growth continued during the 2022 bear market, even as the stock sold off at the time. Not surprisingly, MercadoLibre's stock eventually recovered, rising by just under 50% over the last year. Despite that gain, it sells for 52 times forward earnings. With its rapid revenue growth in good times and bad, investors can safely buy the stock at this level. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Will Healy has positions in MercadoLibre, Roku, and The Trade Desk. The Motley Fool has positions in and recommends Alphabet, MercadoLibre, Nvidia, Roku, and The Trade Desk. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}