{
    "title": "Wall Street just can't get enough of Nvidia",
    "date": "2/17/2024",
    "url": "https://finance.yahoo.com/news/wall-street-just-cant-enough-164015115.html",
    "text": "Wall Street's excitement about Nvidia has reached a fever pitch as its valuation soars. Billionaire investors like Ray Dalio and Paul Tudor Jones snapped up shares in the last quarter of 2023. Others, including the Carolina Panthers owner David Tepper, are more bearish on the stock. Excitement on Wall Street about Nvidia is reaching a fever pitch after the chipmaker’s market value surpassed that of both Amazon and Google's owner, Alphabet, this week. Traders believe the semiconductor giant’s shares could swing by as much as 11%, according to data reported Thursday by Reuters. Nvidia is set to report its earnings for the final three months of 2023 on Wednesday. Meanwhile, a slew of 13F filings this month showed that some of America's biggest and best-known investors piled into the stock in the final quarter of 2023. Ray Dalio’s Bridgewater Associates boosted its Nvidia stake by more than 450% to $133 million over the three months to December 31, the hedge fund reported Wednesday. Meanwhile, Kenneth Fisher’s Fisher Investments upped the size of its position by $800 million to $4.4 billion, while Paul Tudor Jones’ Investment Corp. bought shares worth $59 million. Other billionaire investors, including the Carolina Panthers owner David Tepper and the legendary short-seller Jim Chanos, trimmed their positions amid concerns that the chipmaker’s recent surge wouldn’t last. Steve Cohen’s Point72 snapped up put options on 4,200 shares, which enable it to benefit if Nvidia’s stock price falls. The Nvidia trading frenzy comes after a massive surge in its shares, which has lifted the chipmaker’s valuation from $360 billion to $1.83 trillion over the past 13 months and established it as one of the market’s dominant Big Tech stocks. It has trounced its rivals such as Alphabet and Amazon over that time, with the stock up over 400% since the start of 2023. Artificial intelligence has fueled the rally, with investors seizing on the fact that Jensen Huang’s company is the world’s dominant producer of the graphics processing units needed to power large language models like OpenAI’s ChatGPT. “If AI is the next industrial revolution, then absolutely we could see Nvidia’s valuation surge continuing,” Kathleen Brooks of the online broker XTB told Business Insider. “Maybe we’ll see a bit of a split in the Magnificent Seven,” she added, referring to the group of tech stocks that drove the bulk of the S&P 500’s returns in 2023. “But Nvidia will be really leading the way.\" Correction: February 17, 2024 — An earlier version of this story misspelled the name of an XTB employee. Her name is Kathleen Brooks, not Katherine Brooks. Read the original article on Business Insider "
}