{
    "title": "Meta unveils Artemis chip to boost AI, cut Nvidia ties — Report",
    "date": "2/2/2024",
    "url": "https://cointelegraph.com/news/meta-artemis-chip-ai-development-2024",
    "text": "Meta confirmed plans to deploy a new custom semiconductor chip, dubbed “Artemis,” in its data centers to enhance AI capabilities, reducing dependency on Nvidia. Own this piece of crypto history Meta, the Facebook and Instagram parent company, is preparing to deploy a new version of a custom semiconductor chip in its data centers to support artificial intelligence (AI) development. According to a report by Reuters, an internal document revealed plans for a second generation of an in-house chip, known internally as “Artemis,” as Meta tries to boost its computing capabilities to handle more powerful generative AI products. The Artemis chip is similar to the previous one and is only capable of “interference,” through which models use their algorithm to create judgments and generate responses to user prompts. The plans were confirmed by a representative from the company who said an updated chip would be introduced during 2024 and would operate alongside “hundreds of thousands of off-the-shelf GPUs” the company had been buying. Last month, Meta CEO Mark Zuckerberg said that by the end of the year, the company plans to acquire 350,000 flagship “H100” processors from Nvidia. Related: Nvidia releases special chip for China, US export control compliant A new chip of this kind produced by Meta itself would help the company lower production and energy costs while also weaning itself from dependence solely on chips from Nvidia. Nvidia is currently one of the market leaders in producing semiconductor chips used to power high-level AI models. In November, the company reported a record $18 billion of revenue in Q3 revenue, for which it cited generative AI as a primary driver. The company’s market capitalization now tops $1.56 trillion, and it plans to expand its offerings in China with a new chip and develop a hub in Vietnam. However, Meta isn’t alone in the thought of producing its own chips in-house. Last October, OpenAI, the creator of the popular chatbot ChatGPT, said it was weighing the acquisition of a chip-making firm to make its own AI chips. Later, in January 2024, Sam Altman, CEO of OpenAI, said the company was aiming to raise funds to create a series of semiconductor manufacturing facilities. In November, Microsoft also released its own chip called “Maia,” which it claimed was the “last puzzle piece” for infrastructure systems designed for AI tasks and generative AI. Magazine: Crypto+AI token picks, AGI will take ‘a long time,’ Galaxy AI to 100M phones: AI Eye Add reaction Add reaction "
}