{
    "title": "NVDA Stock Outlook 2024: How Much Higher Can Nvidia Go?",
    "date": "2/1/2024",
    "url": "https://investorplace.com/2024/02/nvda-stock-outlook-2024-how-much-higher-can-nvidia-go/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Nvidia stock has reached stratospheric heights but there are good reasons for that Advertisement Source: Poetra.RH / Shutterstock.com Nvidia NASDAQ:(NVDA) stock was selling at $631 per share on January 30, having jumped $20 per share in just 24 hours. I was wrong to sell my Advanced Micro Devices (NASDAQ:AMD) recently, but I’m sticking with the industry leader. I had to adjust to do that, raising my price-to-sell target from $500 to unknown. How high can it go? The answer lies in looking at its two moats, beyond its strength with Cloud Czars like Alphabet (NASDAQ:GOOGL)(NASDAQ:GOOG), Amazon (NASDAQ:AMZN) and Microsoft (NASDAQ:MSFT).nThose moats are the broader cloud market and its CUDA software. My son the biochemist is studying protein structures and using an internal cloud. To do that, he recently had to spend a whole weekend uploading data. Yes, it’s a small cloud. Most research institutions now have an on-campus cloud. So, too, do most scaled enterprises, which are training their internal databases on Large Language Models, looking for valuable applications. You can also find clouds wherever clouds intersect, like at Equinix (NASDAQ:EQIX) data centers. The point is that there’s a vast cloud market beyond the Cloud Czars. The public clouds, and their consumer-facing markets, may be what most of us think of as “the Cloud.” But it’s these thousands of private clouds, hungry for Nvidia chips, that are the greater, longer-lasting opportunity. This “private cloud market” was worth $12.8 trillion in 2022, growing at over 20% per year, and should be worth over $28 trillion in 2028. These companies aren’t big enough to create their own hardware, like the Cloud Czars. They’re either accepting the cost of Nvidia upgrades or looking for cheaper substitutes. To this, add Nvidia’s own cloud services. Nvidia is bringing its most powerful chips, the Grace Hopper line, to the party. It’s not forgetting the gamers who helped drive its graphics dominance a decade ago, either. Nvidia’s cloud market, in short, has legs, which bodes well for NVDA stock. If Nvidia were just a chip company, it wouldn’t be this powerful, but Nvidia is a software company first. The key to Nvidia’s market dominance remains its CUDA software, seen as an essential building block to AI applications. CUDA is driving competitors crazy, especially Intel (NASDAQ:INTC). CEO Pat Gelsinger told the world in December “the entire industry is motivated to eliminate Nvidia’s CUDA dominance.” A month later, he had to admit in his latest earnings release Intel is nowhere near that. The earnings themselves weren’t bad. But there was notable weakness in data centers. Intel’s forward guidance was bad enough to send the stock down over 10% in less than an hour. That’s the power of CUDA. A more open framework would benefit AMD, Intel, and Chinese chip makers. It would lower the cost of AI for everyone. But CUDA is a moving target and the market isn’t going to wait for laggards. It’s the old story that the leader gets 90% of the profit, the second-place company 9%, and everyone else fights for what’s left. AI, and Nvidia, are now rocketing through the heart of the vast computer industry. Before they’re done, every computer system you touch will be using AI, and most of them will use Nvidia software. But how high is too high? On Jan. 30 Nvidia was worth $1.54 trillion, with sales approaching $45 billion, and net income expected at about $19 billion. Amazon, which everyone loves, is worth $1.66 trillion. It has 10 times Nvidia’s revenue and only 5% more net income. Nvidia is fully valued. Yes, it can go higher, and likely will over the next year or two. I can’t tell you when to sell because I don’t know myself. But we are getting closer. As of this writing, Dana Blankenhorn had LONG positions in AMZN, GOOGL, MSFT, INTC, and NVDA. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on  Mastodon or subscribe to his Substack. Artificial Intelligence, Cloud, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/nvda-stock-outlook-2024-how-much-higher-can-nvidia-go/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Crypto & Blockchain Market Analysis Stocks to Sell Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}