{
    "title": "Market Watch: Nvidia's value hits $2 trillion",
    "date": "2/28/2024",
    "url": "https://jerseyeveningpost.com/business/2024/02/28/market-watch-nvidias-value-hits-2-trillion/",
    "text": "Sponsored Content Andrew Gillham of Team Asset Management offers the week’s round-up of global markets With a lot of hype priced in ahead of Nvidia’s fourth quarter earnings release last Wednesday, the bar was already set high for the US chipmaker. In the run-up to the release, its share price had risen more than 40% since the turn of the year, pushing it above Amazon and Google’s parent Alphabet to become the world’s fourth most valuable company behind Microsoft, Apple and Saudi Aramco. In the event, Nvidia’s earnings report not only beat the high expectations but blew them out of the water. On the back of Artificial Intelligence frenzy, it revealed a 265% increase in quarterly revenues to $22.1 billion and predicted revenue in the current quarter will increase to $24 billion. Revenues from data centres, operated by Amazon’s AWS, Alphabet’s Google Cloud and Microsoft’s Azure, jumped more than 400%, reaching $18.4 billion as companies placed bulk orders to buy chips in the race to develop new AI products. In Thursday’s trading session, Nvidia’s shares jumped more than 16%, adding $277 billion to its market value, the biggest ever one-day jump by a stock. To give the move some context, it equates to more than half the market valuation of Wall Street titan JPMorgan. Nvidia’s results also provided a boost to broader markets and the technology focused Nasdaq (+1.3%) ended the week within a whisker of its previous all-time high set in November 2021. Japanese stocks are also breaking records. The Nikkei index has climbed to an all-time high, more than 34 years after its previous peak. Investor sentiment has been lifted by genuine corporate governance reform, higher dividend pay-outs and share buybacks, rising shareholder activism holding management to account and a sprinkling of AI fairy dust. Japan has some world-class robotic, tech, automation and AI-facing companies. It was not such a good week for HSBC. Its shares tumbled more than 8% on Wednesday after it reported an 80% fall in quarterly profit due to a $3 billion write-down in the value of its stake in Bank of Communications (BoCom), China’s fifth-largest lender, and another $2 billion charge relating to the sale of its retail banking operations in France. Despite the hit on the value of its 19% stake in BoCom, which has been impacted by the turmoil in China’s property sector,HSBC’s chief executive Noel Quinn asserted that the bank continues to have “strong confidence in the China economy”. The bank also forecast that net interest income will fall this year with major central banks, including the Federal Reserve, Bank of England and European Central Bank, all expected to cut interest rates. In a relatively quiet week for economic news, UK business surveys suggested that the UK’s economic downturn may be short-lived. The S&P Global Composite PMI index for the UK, which covers both the manufacturing and services sectors, rose from 52.9 in January to 53.3 in February. A reading above 50 indicates rising business activity. There was also some better news for UK consumers. The British Retail Consortium revealed annual food inflation slowed to 5% in February, the lowest rate since May 2022, as falling energy costs and a price war between supermarkets helped to limit price increases. Morrisons is the latest of the traditional “big four” UK supermarkets to match prices on more than 200 products with Lidl and Aldi to try to win back some market share from the German discount giants. In energy markets, Brent Crude gave up some of its recent gains and slipped back to $82 a barrel on reports of a draft Gaza ceasefire proposal following talks between Israel, Egypt, the US and Qatar in Paris. US President Biden said he was hopeful a ceasefire could be in place by next week. Read the Town Crier, Le Rocher and a whole host of other subjects like mortgage advice, business, cycling, travel and property. © 2024 Jersey Evening Post. All rights reserved. Powered by PageSuite "
}