{
    "title": "Report: Nvidia building unit to design custom AI chips for cloud customers",
    "date": "2/9/2024",
    "url": "https://siliconangle.com/2024/02/09/report-nvidia-building-unit-design-custom-ai-chips-cloud-customers/",
    "text": "UPDATED 17:43 EDT / FEBRUARY 09 2024 by \nMaria Deutscher Nvidia Corp. is believed to be forming a new business unit that will develop custom chip designs for cloud providers and other customers. Reuters reported the move today, citing nine sources familiar with the matter. The effort would help Nvidia establish a bigger presence in a market that is worth an estimated $30 billion annually. Several other major chipmakers, including Marvel Technology Inc. and Advanced Micro Devices Inc., already provider custom or semicustom processor designs to customers. Nvidia is the leading supplier of graphics processing units for data centers. In the infrastructure-as-a-service market, Amazon Web Services Inc. and Google LLC’s cloud unit offer Nvidia GPUs alongside instances powered by internally-developed artificial intelligence accelerators. The chip design unit the graphics card maker is forming is reportedly part of an effort to “protect itself as companies are searching for alternatives to its products.” By supporting an enterprise’s custom chip design efforts, Nvidia can generate revenue even if that enterprise doesn’t end up buying its GPUs. That revenue could take the form of chip design fees and, more notably, licensing income. When a semiconductor maker helps a customer create a custom processor, it often brings not only technical expertise to the table but also prepackaged chip component blueprints. Those blueprints remove the need to build everything from scratch and thereby speed up development. In exchange, the customer pays the semiconductor maker an intellectual property licensing fee. Broadcom Inc. reportedly provided interconnect blueprints to Google for the TPU series of AI accelerators the search giant offers through its cloud platform. Last May, JPMorgan Chase & Co. analysts estimated that the chipmaker was on track to generate $3 billion from the partnership in 2023. Besides providing interconnect-related intellectual property, Broadcom reportedly also helped Google optimize the design of its TPUs for mass production. Nvidia may be seeking to ink similar partnerships with cloud customers. Today’s report didn’t specify whether the company’s chip design unit is set to focus exclusively on AI accelerators or will also develop other types of processors. Going down the latter route could unlock additional revenue opportunities for Nvidia. In addition to GPUs, the company makes central processing units for data centers. In 2021, Nvidia debuted a server CPU called Grace that is based on Arm Holdings plc. blueprints and features dozens of cores. Late last year, Reuters reported that the company also plans to introduce an Arm-based processor for personal computers. Nvidia’s entry into the chip design market could create more competition for incumbent players such as Marvel. The latter company has delivered more than 2,000 custom processors for customers over the past two and a half decades. Besides design services, it also provides prepackaged chip component blueprints that make it easier to implement a new processor’s storage, networking and cybersecurity features. THANK YOU Resonance launches ‘full-spectrum’ cybersecurity platform for Web3 projects Oracle boosts gen AI support in its Fusion Cloud suite Anthropic releases affordable, high-speed Claude 3 Haiku model Beyond the code: The role of intelligent infrastructure in next-gen applications How knowledge graphs are shaping the future of AI and cloud computing Harnessing generative AI for global profit growth: CalypsoAI's approach Resonance launches ‘full-spectrum’ cybersecurity platform for Web3 projects BLOCKCHAIN - BY KYT DOTSON . 2 HOURS AGO Oracle boosts gen AI support in its Fusion Cloud suite AI - BY PAUL GILLIN . 3 HOURS AGO Anthropic releases affordable, high-speed Claude 3 Haiku model AI - BY KYT DOTSON . 3 HOURS AGO Beyond the code: The role of intelligent infrastructure in next-gen applications AI - BY ALICE GILLIN . 4 HOURS AGO How knowledge graphs are shaping the future of AI and cloud computing AI - BY RYAN STEVENS . 4 HOURS AGO Harnessing generative AI for global profit growth: CalypsoAI's approach AI - BY SEAD FADILPASIC . 5 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}