{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-nvda-sec-filing-2024-02-04/",
    "text": "Paragon Advisors LLC boosted its holdings in NVIDIA Co. (NASDAQ:NVDA - Free Report) by 69.4% in the 3rd quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The firm owned 4,949 shares of the computer hardware maker's stock after purchasing an additional 2,027 shares during the quarter. NVIDIA makes up approximately 0.9% of Paragon Advisors LLC's holdings, making the stock its 27th biggest position. Paragon Advisors LLC's holdings in NVIDIA were worth $2,152,000 as of its most recent SEC filing. Several other hedge funds and other institutional investors have also added to or reduced their stakes in the business. Achmea Investment Management B.V. boosted its stake in NVIDIA by 5.9% in the 3rd quarter. Achmea Investment Management B.V. now owns 221,839 shares of the computer hardware maker's stock worth $96,498,000 after purchasing an additional 12,308 shares during the period. Meridian Management Co. bought a new position in NVIDIA in the 3rd quarter worth approximately $239,000. NBC Securities Inc. bought a new position in NVIDIA in the 3rd quarter worth approximately $3,040,000. Strategic Wealth Investment Group LLC boosted its position in shares of NVIDIA by 5.1% during the 3rd quarter. Strategic Wealth Investment Group LLC now owns 13,830 shares of the computer hardware maker's stock valued at $6,016,000 after acquiring an additional 672 shares during the last quarter. Finally, Second Half Financial Partners LLC boosted its position in shares of NVIDIA by 360.7% during the 3rd quarter. Second Half Financial Partners LLC now owns 3,741 shares of the computer hardware maker's stock valued at $1,627,000 after acquiring an additional 2,929 shares during the last quarter. 64.79% of the stock is currently owned by institutional investors. NVIDIA Stock Performance Shares of NVIDIA stock opened at $661.60 on Friday. NVIDIA Co. has a 12 month low of $204.21 and a 12 month high of $666.00. The stock's fifty day moving average price is $523.22 and its 200-day moving average price is $476.91. The firm has a market cap of $1.63 trillion, a P/E ratio of 87.28, a P/E/G ratio of 2.52 and a beta of 1.69. The company has a current ratio of 3.59, a quick ratio of 3.06 and a debt-to-equity ratio of 0.25. NVIDIA (NASDAQ:NVDA - Get Free Report) last issued its quarterly earnings data on Tuesday, November 21st. The computer hardware maker reported $4.02 earnings per share for the quarter, beating analysts' consensus estimates of $3.03 by $0.99. NVIDIA had a return on equity of 72.28% and a net margin of 42.10%. The company had revenue of $18.12 billion for the quarter, compared to the consensus estimate of $16.19 billion. During the same quarter last year, the company earned $0.34 earnings per share. The firm's revenue for the quarter was up 205.5% compared to the same quarter last year. On average, equities research analysts expect that NVIDIA Co. will post 11.07 earnings per share for the current fiscal year. NVIDIA Dividend Announcement The business also recently disclosed a quarterly dividend, which was paid on Thursday, December 28th. Investors of record on Wednesday, December 6th were given a dividend of $0.04 per share. This represents a $0.16 dividend on an annualized basis and a yield of 0.02%. The ex-dividend date was Tuesday, December 5th. NVIDIA's payout ratio is currently 2.11%. Wall Street Analyst Weigh In A number of research firms have recently commented on NVDA. Bank of America increased their target price on NVIDIA from $650.00 to $700.00 and gave the company a \"buy\" rating in a research report on Wednesday, November 22nd. JPMorgan Chase & Co. increased their target price on NVIDIA from $600.00 to $650.00 and gave the company an \"overweight\" rating in a research report on Wednesday, November 22nd. Cantor Fitzgerald reiterated an \"overweight\" rating and set a $775.00 target price on shares of NVIDIA in a research report on Monday, January 29th. Stifel Nicolaus reiterated a \"buy\" rating and set a $600.00 target price on shares of NVIDIA in a research report on Friday, November 17th. Finally, Tigress Financial increased their target price on NVIDIA from $560.00 to $790.00 and gave the company a \"buy\" rating in a research report on Thursday, January 18th. One investment analyst has rated the stock with a sell rating, four have assigned a hold rating, thirty-four have issued a buy rating and one has assigned a strong buy rating to the company's stock. According to data from MarketBeat.com, the company has an average rating of \"Moderate Buy\" and a consensus price target of $608.30. Check Out Our Latest Stock Report on NVDAInsider Activity at NVIDIA In related news, Director John Dabiri sold 218 shares of the firm's stock in a transaction dated Friday, November 24th. The stock was sold at an average price of $484.99, for a total transaction of $105,727.82. Following the sale, the director now owns 2,183 shares of the company's stock, valued at $1,058,733.17. The sale was disclosed in a filing with the SEC, which is available through the SEC website. In other NVIDIA news, Director John Dabiri sold 218 shares of the firm's stock in a transaction dated Friday, November 24th. The stock was sold at an average price of $484.99, for a total value of $105,727.82. Following the completion of the sale, the director now owns 2,183 shares of the company's stock, valued at $1,058,733.17. The sale was disclosed in a filing with the SEC, which is available through this hyperlink. Also, insider Donald F. Robertson, Jr. sold 450 shares of the firm's stock in a transaction dated Friday, January 5th. The stock was sold at an average price of $484.62, for a total value of $218,079.00. Following the completion of the sale, the insider now directly owns 50,961 shares of the company's stock, valued at approximately $24,696,719.82. The disclosure for this sale can be found here. Insiders have sold a total of 155,216 shares of company stock valued at $79,810,950 over the last quarter. 3.99% of the stock is owned by corporate insiders. NVIDIA Profile (Free Report) NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, and internationally. The company's Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building 3D designs and virtual worlds.Featured StoriesFive stocks we like better than NVIDIAGolden Cross Stocks: Pattern, Examples and Charts MarketBeat Week in Review – 1/29 - 2/2Comparing and Trading High PE Ratio StocksHow to start investing in penny stocksHow to Use the MarketBeat Stock Split CalculatorExploring communication services stocks: A comprehensive guideThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Forget Bitcoin. Crypto Millionaire Predicts 8,788% Gains For THIS (From Paradigm Press) (Ad)Should you invest $1,000 in NVIDIA right now?Before you consider NVIDIA, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list.While NVIDIA currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 10 \"Recession Proof\" Stocks That Will Thrive in Any MarketWhich stocks are likely to thrive in today's challenging market? Click the link below and we'll send you MarketBeat's list of ten stocks that will drive in any economic environment.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider NVIDIA, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list. While NVIDIA currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Which stocks are likely to thrive in today's challenging market? Click the link below and we'll send you MarketBeat's list of ten stocks that will drive in any economic environment. Because Nvidia already commands about 80% of the market, is advancing technology today, and is raising prices, it should continue to grow and outperform expectations for the foreseeable future. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}