{
    "title": null,
    "date": "2/8/2024",
    "url": "https://www.mk.co.kr/en/stock/10939586",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share The joys and sorrows of students who invested in U.S. stocks were mixed. Investors who bought Nvidia are seeing valuation returns more than double, while Tesla investors are in the red. According to the return statistics of investors investing in Korean and U.S. stocks through NH Investment & Securities on the 8th, the average return of Nvidia investors reached 147.37 percent as of the 6th. A total of 29,531 people invested, most of which 99.92% were profitable rights. Nvidia, whose stock price soared 238% last year thanks to artificial intelligence (AI) momentum, is trading in the $700 range, up 45% this year as well. Due to high growth expectations, Wall Street has recently raised its price target on Nvidia. Goldman Sachs and Morgan Stanley have offered $800 and $750 target prices for Nvidia, respectively. Tesla investors, on the other hand, have an average return of -12.25%. A total of 82,466 people invested in Tesla through NH Investment & Securities, of which only 15.53% were profitable. In fact, most Tesla investors are losing money. Tesla's stock price has recently been weak due to concerns over stagnant growth caused by a slowdown in the electric vehicle market. This year alone, the stock has fallen 24%. On the other hand, Seohak ants are steadily buying Tesla shares at low prices. According to the Securities Information Portal of the Korea Securities Depository, students bought a net $815.26 million (approximately KRW 1.824 trillion) in shares of \"Bum Tesla\" this year, including Tesla, Tesla leverage, and covered call exchange rate fund (ETF). Since the beginning of the year, it has been the overwhelming No. 1 ranking in net purchase of Seohak Ant. In addition, the return of bookkeepers who mainly invested in Big Tech in the U.S. was high. The average return of those who bought Microsoft and Apple through NH Investment & Securities was 44.91 percent and 37.53 percent, respectively. On the other hand, Samsung Electronics' average return was 2.71%, and only 50.15% of the total 719,469 investors were profitable. Those who invested in Kia, whose stock price soared recently due to growing interest in undervalued stocks, laughed. Kia investors have an average return of 53.79%, with 94.86%. 2024-03-24 14:09:45 2024-03-25 08:31:01 2024-03-24 15:26:58 2024-03-24 17:27:00 2024-03-24 17:13:22 2024-03-25 08:57:22 2024-03-24 09:46:12 2024-03-25 10:04:23 2024-03-19 17:09:10 2024-03-24 06:18:24 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}