{
    "title": "Nvidia, Meta Drive These 10 Leaders. But They All Face This One Issue.",
    "date": "2/12/2024",
    "url": "https://www.investors.com/research/how-to-find-the-best-stocks-to-buy/nvidia-stock-meta-face-overheating-issue/",
    "text": "BREAKING: Futures Fall Slightly As the Nasdaq and S&P 500 tease record highs, Magnificent Seven stocks Nvidia (NVDA) and Meta Platforms (META) lead a powerhouse group of names on IBD Leaderboard. And to further highlight demand for Meta, Nvidia stock and these other tech titans, 10 out of the 13 IBD Leaderboard members also just made this month's list of new buys by the best mutual funds. Other top growth stocks on both lists include Uber Technologies (UBER), ELF Beauty (ELF), Shopify (SHOP), Zscaler (ZS) and ServiceNow (NOW). A raging bull market and seemingly unceasing demand for companies tapping artificial intelligence continue to drive these and other stocks. But when the market indexes are soaring, investors should remain grounded, armed with time-tested rules for when to sell stocks to lock in profits. One key for managing risk in a powerful uptrend is to monitor a stock in relation to its 50-day moving average. And don't forget the all-important earnings season, with Shopify due Tuesday and Nvidia set to report Feb. 21. Yes, Nvidia Is One. But These Aren't The Mag 7 You Expect. In a healthy market, leading stocks will trade solidly above their 10-week and 50-day lines. Plus, those benchmarks will be in an upward trend. Currently, that is certainly the case for Meta stock, ServiceNow, Shopify, Nvidia and the other IBD Leaderboard names. But a stock can climb too far above its 50-day line. That signals it may be due for a pullback or a sideways move. For example, having blasted past the 700 mark, Nvidia now trades a more than 30% above its 50-day line. Meta stock has climbed around 26% above that benchmark. Ahead of earnings Shopify stands more than 14% above its 50-day. Meanwhile, even after closing lower for two days, Uber still stands over 9% above that key moving average. Generally speaking, when a stock climbs more than 5% above its 50-day line, the chances of a pullback begin to increase. By no means an automatic sell signal, it is a reminder to monitor the stock to see if it and indexes may be overheating. It can be healthy for Nvidia stock, Uber, Meta and others to mildly pull back or trade sideways for a while. That helps them digest their big gains and avoid getting too frothy. Investing in stocks is rarely an all-or-nothing game. Investors can manage risk by taking a gradual approach to both buying stocks and determining when to sell. One guideline for locking in some gains on the way up in big winners like Nvidia stock and others is to take some profits when shares rise 20% to 25% above the initial buy point. This strategy can be applied as a stock makes a major run over an extended period of time. For example, while maintaining a position in big movers like Meta, Uber and Nvidia stock, investors can lock in partial profits. This allows investors to safeguard recent profits while still standing to benefit from a continued climb. Follow Matthew Galgani on X (formerly Twitter) at @IBD_MGalgani. YOU MAY ALSO LIKE: Investors Ignore Screaming Alarm Saying The S&P 500 Is Overvalued Nvidia Is King, But This Frog May Turn Into A Prince Are The Best Mutual Funds Buying Your Watchlist Stocks? Here's How To Find Out Stock Picks: Google, Nvidia Reveal 7 Telltale Traits To Monitor Identify Bases And Buy Points With This Pattern Recognition Tool 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500 stock Super Micro has more than tripled. Tesla remains the... 3/25/2024\nNvidia has nearly doubled in 2024, but new S&P 500... IBD's 2024 list of Best Mutual Funds reveals how they beat the benchmarks. ([email protected]) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}