{
    "title": "Nvidia set to close with $2 trillion valuation as Dell stokes AI rally",
    "date": "3/1/2024",
    "url": "https://wtvbam.com/2024/03/01/nvidia-set-to-close-with-2-trillion-valuation-as-dell-stokes-ai-rally/",
    "text": "By Noel Randewich (Reuters) –     Nvidia’s stock market value was on track to close above $2 trillion for the first time on Friday after an upbeat report from Dell Technologies reignited Wall Street’s AI-fueled rally. Nvidia’s stock added 3.5% after Dell, which sells high-end servers made with Nvidia’s processors, gave an upbeat forecast late on Thursday, pointing to a surge in orders for its AI-optimized servers. Dell’s shares soared as much as 38% to a record high. They were last up 30%. Friday’s gains put Nvidia’s market capitalization at $2.05 trillion, making it Wall Street’s third most valuable company behind Microsoft and Apple at $3.07 trillion and $2.75 trillion, respectively. Super Micro Computer, another company that sells servers made with Nvidia’s chips, jumped 6%. Other chipmakers exposed to AI rallied to record highs, with Broadcom and Marvell Technology each up about 8%, while Advanced Micro Devices climbed nearly 5%. The PHLX chip index rallied 4.5% to its own record high, lifting its 2024 gain to 18%. Nvidia controls about 80% of the high-end AI chip market, with customers including ChatGPT creator OpenAI, Microsoft, Alphabet and Meta Platforms snapping up tight supplies of its components to compete in the fast-emerging generative AI sector. The company has recently become Wall Street’s most traded stock by value, day to day, replacing Tesla. Investors exchanged $36 billion worth of Nvidia’s stock on average over the past 30 sessions, compared to $21 billion a day for Tesla. Trading in Nvidia on Friday afternoon reached $28 billion worth of shares. On Feb. 23, the Santa Clara, California-based company added $277 billion in stock market value in just one session, a Wall Street record, after it forecast a roughly threefold surge in quarterly revenue. Nvidia’s stock has now risen 65% in 2024 after more than tripling last year. Last month, its stock market value overtook Amazon and Alphabet. A week ago, Nvidia’s stock market value edged above $2 trillion for the first time before receding by the end of the session. Saudi Aramco has a $2.045 trillion market capitalization, although over 90% of it is closely held by the government of Saudi Arabia and less than 2% of its shares are available for trading by investors, according to LSEG data. (Reporting by Noel Randewich; Editing by Kirsten Donovan) You must be logged in to post a comment. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}