{
    "title": "Nvidia reaches fresh all-time highs!",
    "date": "1/8/2024",
    "url": "https://www.xtb.com/en/market-analysis/nvidia-reaches-fresh-all-time-highs",
    "text": " CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 77% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 77% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. Nvidia shares (NVDA.US) jump almost 5% today and are trading at fresh record highs above $500 area after company presented new graphics cards and Reuters report on plans to produce chips for China. Nvidia announced three new graphics cards at the event today, with prices ranging from $599 to $999. New graphics cards are also designed to run generative AI applications. Company's chips will also be used in laptops from Dell, Acer and Lenovo. Also today, Reuters reported that Nvidia plans to began mass production of chips designed for China in the second quarter of this year. Those will be AI chips with limited capabilities in order to comply with US export restrictions. Taking a look at Nvidia chart (NVDA.US) at D1 interval, we can see that share price climb to new record highs after a period of sideways trading. Price broke above the $500 resistance zone today and jumped above highs from November and December 2023. This content has been created by XTB S.A. This service is provided by XTB S.A., with its registered office in Warsaw, at Prosta 67, 00-838 Warsaw, Poland, entered in the register of entrepreneurs of the National Court Register (Krajowy Rejestr Sądowy) conducted by District Court for the Capital City of Warsaw, XII Commercial Division of the National Court Register under KRS number 0000217580, REGON number 015803782 and Tax Identification Number (NIP) 527-24-43-955, with the fully paid up share capital in the amount of PLN 5.869.181,75. XTB S.A. conducts brokerage activities on the basis of the license granted by Polish Securities and Exchange Commission on 8th November 2005 No. DDM-M-4021-57-1/2005 and is supervised by Polish Supervision Authority. Last week highlighted how central banks are directing asset markets right now. As we get to the peak of the hiking cycle and wait for the next move from... Today, the minutes from the latest Bank of Japan (BoJ) meeting were published. However, the minutes did not provide any additional interesting information... Throughout the past week, we've observed moments of high volatility in the markets. In the foreign exchange market, the decisions made by the Central... Already an XTB client? Login to trade Opening an account is quick and easy. Simply choose between a real and demo account and you could be trading within minutes.  CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 77% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. XTB Limited is authorised and regulated by the UK Financial Conduct Authority (FRN 522157) with its registered and trading office at Level 9, One Canada Square, Canary Wharf, E14 5AA, London, United Kingdom (company number 07227848). Copyright 2024 © XTB\n•\nCookies settings This page uses cookies. Cookies are files stored in your browser and are used by most websites to help personalise your web experience. For more information see our Privacy Policy  This page uses cookies. Cookies are files stored in your browser and are used by most websites to help personalise your web experience. For more information see our Privacy Policy You can manage cookies by clicking \"Settings\". If you agree to our use of cookies, click \"Accept all\". By clicking “Accept All”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. This group contains cookies that are necessary for our websites to work. They take part in functionalities like language preferences, traffic distribution or keeping user session. They cannot be disabled. We use tools that let us analyze the usage of our page. Such data lets us improve the user experience of our web service. This group of cookies is used to show you ads of topics that you are interested in. It also lets us monitor our marketing activities, it helps to measure the performance of our ads. Cookies from this group store your preferences you gave while using the site, so that they will already be here when you visit the page after some time. Changing the language affects the change of regulator  "
}