{
    "title": "Will Nvidia stock prices keep soaring in 2024?",
    "date": "1/12/2024",
    "url": "https://techhq.com/2024/01/2024-nvidia-stock-prices-will-keep-rising/",
    "text": "Molly Loe @TechHQ molly@hybrid.co Can Nvidia stock prices continue to rise in 2024?. Nvidia CEO Jensen Huang will hope so – Nvidia. Last year, Nvidia stock prices saw a sharp rise, a rise that’s expected to spill over into 2024, according to a note on Thursday 4th from Bank of America. The company is continuing to capitalize on its successful development and sales of AI chips. Nvidia’s fast growing revenue and profit profile should allow it to generate $100 billion in free cash flow over the next two years – even more impressive considering that over the previous two years, the company generated free cash flow of less than $30 billion. On Friday, Bank of America’s Vivek Arya told CNBC the expected free cash flow generation is “just the cherry on top of what is a very delicious cake.” “These cycles don’t just start and end in one year. These can be decade-long cycles and there is at least three to four years of upfront hardware deployment – and we are just in year two,” Arya said. The cycles he’s referring to are Nvidia’s strong competitive position, the early days of generative AI and the company’s upcoming pipeline of new chips. Naturally, more cash means more funding for Nvidia to use on new growth initiatives. Those in turn will boost the company’s valuation, and round we go again. The key to continued growth and high valuation will be Nvidia’s ability to build a recurring revenue profile, said Arya. In the Bank of America note on Thursday, he also said that “of the ~$100 billion [of] free cash flow, we estimate only ~$30 to $35 billion could be deployed for buybacks.” That leaves $65 to $70 billion of “ammunition for new organic and inorganic growth initiatives.” At the moment, Nvidia’s dependency on hardware sales means it’s trading at a price-to-earnings valuation of 20x, based on projected 2025 earnings. That’s not good: Nvidia’s tech peers trade considerably higher, and its own historical median price-to-earnings multiple was 35x to 40x. “While Nvidia gets clubbed in the ‘Magnificent 7,’ we note Nvidia trades at a 20% to 30% discount on price-to-earnings and enterprise value-to-free cash flow basis, despite 2x the free cash flow margins and 3x the sales CAGR versus the six other ‘magnificent’ peers,” Arya highlighted. The fast-growing pile of cash that Nvidia has will give it the opportunity to continue its speedy growth and boost its valuation multiple. We can take what happened in 2020 as an example of Nvidia’s high ambitions. The company tried to buy chip design giant ARM from Softbank for $40 billion. Regulatory challenges meant that in 2022 the termination of the transaction was announced. For investors, though, this is a sign that Nvidia is prepared to spend big to build out its software and intellectual property assets. Nvidia stock prices seem like they’ll only go up, so get in while you can. “We expect Nvidia to consider assets that help it create a more meaningful recurring revenue profile. While Nvidia has a solid lead in AI, hardware-oriented businesses are not valued as highly as visibility tends to be limited,” said Arya. He went on to explain that only about 2% of Nvidia’s sales in annualized revenue are from software or subscriptions. Bank of America is skeptical that could ever generate more than $5 billion without inorganic additions to the core AI enterprise suite. “We envision Nvidia considering more enhanced partnerships/M&A of software companies that are helping traditional enterprise customers deploy, monitor and analyze genAI apps.” What might help Nvidia stock break from its $400 to $500 trading range are the upcoming CES tradeshow and GTC tradeshow where the company could unveil important product updates. Arya reiterated his “Buy” rating on Nvidia and $700 price target, representing potential upside of 42% from current levels.  Molly Loe @TechHQ molly@hybrid.co 7 March 2024 7 March 2024 6 March 2024    "
}