{
    "title": "Nvidia could generate nearly $100B in free cash flow over the next two \nyears: BofA",
    "date": "1/5/2024",
    "url": "https://seekingalpha.com/news/4052674-nvidia-generate-nearly-100b-in-free-cash-flow-over-next-two-years-bofa",
    "text": "Justin Sullivan Nvidia (NASDAQ:NVDA) has been one of the primary beneficiaries of generative artificial intelligence as demand for its processors has exploded over the past 18 months. Bank of America is forecasting the good times will continue. Analyst Vivek Arya, who has a buy rating and $700 price target on Nvidia, believes the Jensen Huang-led company could generate roughly $100B in incremental free cash flow over 2024 and 2025, which could be used to boost shareholder returns (between $30B and $35B) and go after organic and inorganic growth, also known as acquisitions. \"NVDA’s relatively depressed trading multiple – just 24x/20x CY24/25E PE versus 67%/26% [pro-forma earnings per share growth – is partly due to uncertainty in calendar 2025] growth prospects, and partly due to a very hardware dependent business unlike other large-cap software/internet peers that have recurring revenue profiles,\" Arya wrote. \"In our view NVDA’s solid [free cash flow] generation creates optionality in addressing these concerns, and in helping to expand its trading multiple back to its historical median 35x-40x.\" Arya said he thinks Nvidia needs to create a \"recurring revenue profile,\" even as its lead in AI continues to be stable or even grow. \"Currently NVDA generates only [roughly $1B] or 2% of sales in annualized revenue from software/subscriptions, which we are skeptical can exceed [$5B] at most without inorganic additions to the core AI enterprise suite,\" Arya said. \"We envision NVDA considering more enhanced partnerships/M&A of software companies that are helping traditional enterprise customers deploy, monitor and analyze genAI apps.\" Nvidia failed in its acquisition to acquire Arm Holdings (ARM) from SoftBank (OTCPK:SFTBY) for $40B in cash and stock amid intense regulatory pressure around the world. Arm went public in 2023 at a valuation of $54B and is now worth approximately $70B. Though Arya did not provide any specific targets, he noted that that the company could move further into the hardware space, perhaps moving further into storage and adding to its profile of becoming an \"end-end optimized AI systems vendor.\" Nvidia shares rose 1.2% in early trading on Friday. "
}