{
    "title": null,
    "date": "1/25/2024",
    "url": "https://finance.yahoo.com/news/incredibly-cheap-artificial-intelligence-ai-131500553.html",
    "text": "If you're looking to buy a top artificial intelligence (AI) stock right now, Nvidia is likely to be one of the first names that comes to mind. That's not surprising. Its dominance in the AI chip market has been driving outstanding top- and bottom-line growth for the company. The good part is that Wall Street and investors are positive about Nvidia's prospects in 2024 and beyond as the AI chip market gains steam. This explains why Nvidia stock has already risen 20% in 2024. However, Nvidia's solid start to the year on the stock market has been eclipsed by Super Micro Computer (NASDAQ: SMCI), which has already clocked eye-popping gains of nearly 50% this month. Let's look at the reasons why shares of Supermicro -- as it's more commonly known -- have been soaring and why investors should consider buying it hand over fist straight away. In a business update provided by Supermicro on Jan. 18, the company announced significantly upgraded guidance for the second quarter of its fiscal 2024 (which ended on Dec. 31, 2023). The company -- known for providing modular server solutions, which are in solid demand as they are used for deploying AI chips -- is now anticipating fiscal Q2 revenue to land at $3.62 billion at the midpoint of its guidance range. It was earlier forecasting $2.8 billion for the previous quarter, which means that it has increased its revenue estimate by almost 30%. Additionally, Supermicro is expecting its adjusted earnings to land between $5.40 and $5.55 per share, up significantly from the earlier range of $4.40 to $4.88 per share. The updated guidance suggests that Supermicro's revenue is set to double on a year-over-year basis, while its non-GAAP (adjusted) earnings would increase 68% from the same period last year. The big increase in Supermicro's guidance and the impressive year-over-year growth that it is set to deliver was rewarded with a sharp jump in the company's stock price. But it is worth noting that Supermicro stock continues to trade at an attractive valuation despite its latest surge. The company sports a price-to-sales ratio of just over 3. That's incredibly cheap when compared to Nvidia's sales multiple of 33. What's more, Supermicro's trailing earnings multiple of 39 is also much lower than Nvidia's multiple of 65. Additionally, Supermicro is trading at just 7 times forward earnings, which points toward the impressive bottom-line growth that the company is expected to deliver. According to consensus estimates, Supermicro's earnings could increase 51% in fiscal 2024 to $17.88 per share, compared to $11.81 per share in fiscal 2023. Even better, the company is forecast to deliver impressive growth over the next couple of years as well. Assuming Supermicro does hit $27.50 per share in earnings in fiscal 2026 and trades at the Nasdaq-100 index's forward earnings multiple of 29 then (using the index as a proxy for tech stocks), its stock price could jump to $800 in just over a couple of years. That points toward 85% gains from current levels. A closer look at the market Supermicro serves will show you just why it could indeed deliver such outstanding growth, and why investors would do well to buy this AI stock while it is still trading at attractive levels. Supermicro's server solutions have been in terrific demand thanks to the growing adoption of AI. That's not surprising as the company claims that its server solutions \"maximize [the] parallel computing power of GPUs to handle billions if not trillions of AI model parameters to be trained with massive datasets that are exponentially growing.\" Supermicro offers server solutions that can be used to deploy multiple types of AI accelerators, ranging from Nvidia's popular H100 chip to Intel and Advanced Micro Devices' offerings as well. As a result, data center operators have been lining up to buy its server solutions, which can reportedly help them reduce cooling and electricity costs. The demand for Supermicro's server racks is so strong that the company recently upgraded its manufacturing capacity to 5,000 racks a month from the earlier capacity of 4,000. So, the company's updated guidance doesn't seem surprising considering the 25% jump in its manufacturing capacity, which will help it serve a \"strong market and end customer demand for our rack-scale, AI and Total IT Solutions.\" With the AI server market expected to grow fivefold between 2023 and 2027, generating an annual revenue of $150 billion at the end of the forecast period, Supermicro is at the beginning of a lucrative growth opportunity. The good part is that Supermicro is setting itself up to capitalize on this massive market by investing in more capacity. According to George Wang of Barclays, the company's new facility in Malaysia, which is expected to go online in the second half of fiscal 2024, could help it generate $30 billion in revenue. Given the solid demand for AI servers, Supermicro should ideally be able to sell almost all the capacity that it brings online. That could lead to a massive jump in the company's revenue considering that it reported a top line of $7.1 billion in fiscal 2023. As a result, investors would do well to buy this growth stock hand over fist since it could sustain its red-hot rally and soar impressively in the long run. Should you invest $1,000 in Super Micro Computer right now? Before you buy stock in Super Micro Computer, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Super Micro Computer wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 16, 2024  Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Barclays Plc, Intel, and Super Micro Computer and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. This Incredibly Cheap Artificial Intelligence (AI) Stock Is Crushing Nvidia in 2024 With 50% Gains. It Could Soar Another 85%. was originally published by The Motley Fool Related Quotes "
}