{
    "title": "These 3 \"Magnificent Seven\" Stocks Hit All-Time Highs on the Same Day. \nHere's the Better Buy in 2024.",
    "date": "1/28/2024",
    "url": "https://www.fool.com/investing/2024/01/28/magnificent-seven-stocks-hit-all-time-high-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Jan. 23 ended up being a great day for the stock market. The S&P 500 and Dow Jones Industrial Average closed at record highs. Three of the \"Magnificent Seven\" stocks closed at all-time highs as well -- Microsoft (MSFT -0.15%) at $398.90 a share, Nvidia (NVDA 3.12%) at $598.73 a share, and Meta Platforms (META 0.36%) at $385.20 per share. The other four Magnificent stocks are Apple, Alphabet, Amazon, and Tesla. Microsoft and Nvidia have each set new record highs on multiple occasions already this year. But it took until Jan. 23 for Meta Platforms to exceed its previous record close of $382.18 a share that was set on Sept. 7, 2021. Making it all the more impressive for Meta is that the stock has quadrupled since it fell below $90 a share in early November 2022. Still, past performance is no guarantee of future results. Let's go through the pros and cons of these three companies to determine which has what it takes to keep the record highs coming and which is the best buy for 2024. Image source: Getty Images. Even after Meta Platforms' epic 15-month rally, the stock still isn't all that expensive from a valuation standpoint, which goes to show how discounted Meta was and how it should have never sold off as much as it did. No matter how you feel about Facebook, Instagram, WhatsApp, or any of Meta's other apps, there is no denying that the company is an absolute cash cow. In fact, Meta has the second-lowest price-to-free cash flow ratio of the Magnificent Seven.  META Price to Free Cash Flow data by YCharts You can think of Meta's apps as digital real estate. Meta provides some of the most affordable, effective, and measurable ad space out there. The company has done a phenomenal job improving Instagram and monetizing it, which has crushed the doubters who thought it would become irrelevant in the face of TikTok. Meta would be generating even more cash if it weren't losing billions on Reality Labs, its augmented/virtual reality segment. But that's the advantage of a company like Meta. It can afford to take risks and bleed cash without derailing the business. Very few companies are in the same position. There's a lot to like about Meta as a balanced, more value-orientated Magnificent Seven stock. Nvidia passed $1 trillion in market cap last June and never looked back. Now it's knocking on the door of $1.5 trillion. At this rate, Nvidia could easily pass Amazon and Alphabet to become the third-most-valuable company in the world. It's just a matter of what multiple the market is willing to give it.  NVDA Market Cap data by YCharts The biggest risk of investing in Nvidia is that so much of its future growth is priced into the stock's current valuation. At a 78.3 price-to-earnings (P/E) ratio, Nvidia is far from cheap. But the growth is undeniable.  NVDA Revenue (TTM) data by YCharts The chart above illustrates an impressive feat from a company. In just one year, Nvidia's sales are up 66.4% and its net income has more than quadrupled. But it's Nvidia's margins that are the real standout. Generating $18.9 billion in net income on $44.9 billion in sales is almost unheard of. Nvidia makes so much profit from each dollar in sales that the company doesn't have to grow sales by that much to make its P/E ratio shrink. As you can see in the chart, Nvidia has had its downturns. The semiconductor industry is extremely cyclical. Nvidia suffered a fairly major pullback last year. Its margins were crushed, and sales and profits declined. The same thing happened in 2019. So why are investors excited now? Well, it has to do with artificial intelligence (AI). Nvidia AI accelerator processors power OpenAI's ChatGPT processors, and orders are flowing in as other companies try to hop on the AI train. \"We're at the beginning of a basically across-the-board industrial transition to generative AI to accelerated computing. This is going to affect every company, every industry, every country,\" said Nvidia CEO Jen-Hsun Huang on the company's Q3 2024 earnings call. Nvidia's products have been at the forefront of many trends, including crypto mining, gaming, and professional graphics. If the growth continues, the stock could look cheap. If it slows, the stock is going to look too priced for perfection. Nvidia as a company is doing unbelievably well. Nvidia the stock is extremely expensive. Microsoft is experiencing the best parts of both Meta Platforms and Nvidia. Like Meta, Microsoft is a cash cow with a proven business model. And like Nvidia, Microsoft is investing heavily in AI and is already reaping the rewards. I think of Microsoft as the AI sandbox. It has exposure to different industries, professional services, recreational customers in gaming, applications for school, and everyday life. This sheer number of touchpoints gives Microsoft a steep advantage. It can keep its finger on the pulse of what folks are using while learning what doesn't stick. After all, Microsoft's history is about perfecting sticky products. Microsoft Word wasn't necessarily the best word processor. Excel wasn't the most powerful spreadsheet app. But what Microsoft did better than any other company was package these applications and make them user-friendly. Making AI tools too complicated could push away less tech-savvy folk. Microsoft is taking a page out of its old playbook with Copilot, generative AI that is integrated into existing Microsoft applications. It basically acts as an assistant, and makes the applications more useful without making them more complicated. Microsoft generates tons of cash that it pours into organic growth, uses to buy back its own stock, and could use to make an acquisition if it wants. Microsoft doesn't have to cross its fingers and hope its customers adopt AI. It can try out different solutions, tweak them over time, and find out what works. Add it all up, and Microsoft has arguably the best risk/potential reward profile of any of the Magnificent Seven stocks. And for that reason, I'd buy it over Meta and Nvidia right now, although both of those picks have a lot going for them as well. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}