{
    "title": "2 Artificial Intelligence (AI) Stocks With More Upside Than Nvidia to Buy \nNow, According to Wall Street",
    "date": "1/27/2024",
    "url": "https://www.fool.com/investing/2024/01/27/2-ai-stocks-more-upside-than-nvidia-to-buy-wall-st/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Investors bought shares of Nvidia (NVDA 3.12%) hand over fist last year, as excitement about artificial intelligence (AI) percolated the stock market. In fact, the AI chipmaker saw its share price climbed 239%, making it the best-performing stock in the S&P 500 in 2023. Nvidia has already advanced another 20% in 2024, but Wall Street now sees more upside in other AI stocks. To elaborate, Nvidia has a median analyst price target of $650 per share, implying a 9% upside. But The Trade Desk (TTD) has a median price target of $83 per share, implying 20% upside. And Docebo (DCBO -2.10%) has a median price target of $56 per share, implying 24% upside. Here's what investors should know about these two AI stocks. The Trade Desk operates the largest independent ad tech platform for media buyers. Its software leans on artificial intelligence (AI) to help advertisers create, measure, and optimize campaigns across digital channels. The Trade Desk is the market leader in connected TV (CTV) advertising, and the company is quickly gaining clout in offsite retail media, the two fastest-growing segments of the broader digital advertising market. One reason The Trade Desk has been so successful is its independent business model, meaning it doesn't own media that could bias ad spending, nor does it compete with publishers by selling ad inventory. Publishers are more willing to share data with noncompetitors like The Trade Desk as opposed to fellow publishers like Alphabet, a company that monetizes media properties like Google Search and YouTube with advertising. Because of a unique combination of independence and scale, The Trade Desk has won numerous partners of import. It sources data and inventory from most major CTV publishers, including Walt Disney, and it sources data from many leading retailers including Walmart. As such, The Trade Desk provides measurement capabilities that media buyers cannot find on other ad tech platforms. One corollary of robust and unique data is differentiated AI. To that end, Morgan Stanley sees The Trade Desk as one of 11 companies best positioned to benefit from AI, and consultancy Quadrant Knowledge Solutions sees The Trade Desk as the most technologically sophisticated ad tech platform on the market, outranking even Google. Looking ahead, ad tech spending is forecasted to grow at 14% annually through 2030, but The Trade Desk should outpace the industry given its strong market position. Indeed, Wall Street is projecting annual sales growth of 21% over the next five years. In that context, its current valuation of 19.4 times sales is tolerable. Patient investors with a five-year time horizon should consider buying a small position in this growth stock today. Docebo operates a learning management system. Its platform comprises several applications that help businesses create, deliver, and measure the impact of training content across internal employees and external audiences. Two applications are particularly noteworthy because they demonstrate a proclivity for innovation and they present sizable growth opportunities. Docebo Shape uses generative AI to automate content creation, turning source material like documents, presentations, and case studies into corporate training material. Docebo Flow embeds learning content into other software products, which lends itself to external use cases like customer training. For instance, Flow lets businesses embed learning into customer-facing applications for the purpose of educating new users. Docebo gained a strong market presence through consistent innovation. European industry analyst Fosway Group has recognized its leadership in learning management systems for six straight years. In addition, Morgan Stanley analyst Josh Baer selected Docebo stock as a top generative AI pick in 2024. He said the company is not just disrupting the market for internal learning, but also leading the market in external use cases. Docebo is an unfamiliar name for many investors, but the company has landed several big customers, including two of the five largest technology companies in the world. The first is Amazon and the second is unnamed, but all evidence points to Google. Meanwhile, Docebo has also partnered with Google Cloud to further its generative AI product roadmap. New features are coming to Shape in 2024, including virtual role play with real-time feedback and an integrated copilot that simplifies learning content creation. Management says \"Shape will fundamentally change how training material is created and consumed.\" With that in mind, the learning management systems market is forecasted to grow at 20% annually through 2030, and Wall Street expects Docebo to grow sales at 25% annually over the next five years. That consensus forecast makes its current valuation of 9 times sales look downright cheap. The market is overlooking this little-known software stock, creating a fabulous buying opportunity for patient investors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Amazon, Nvidia, The Trade Desk, and Walt Disney. The Motley Fool has positions in and recommends Alphabet, Amazon, Docebo, Nvidia, The Trade Desk, Walmart, and Walt Disney. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}