{
    "title": null,
    "date": "1/29/2024",
    "url": "https://www.insidermonkey.com/blog/5-best-stocks-to-buy-according-to-billionaires-1250727/5",
    "text": "Number of Billionaire Investors: 34 Piper Sandler recently ranked the Magnificent Seven stocks based on their strengths. Alphabet Inc Class A (NASDAQ:GOOGL) is the most attractive stock according to the investment firm. A total of 34 billionaires tracked by Insider Monkey had stakes in Alphabet Inc Class A (NASDAQ:GOOGL) as of the end of the September quarter. The total worth of these stakes was $13.4 billion. Ensemble Capital Management stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: “Alphabet Inc. (NASDAQ:GOOG) (8.52% weight in the Fund): Google’s earnings report in October showed its core advertising business accelerating to double digit growth as the digital advertising recession of 2022 and early 2023 fades away. However, the company’s Cloud division, which is expected to generate growth from selling access to artificial intelligence services, saw its growth rate slow modestly. Juxtaposed with Microsoft’s Cloud business seeing growth pick up slightly, investors sold off Google’s stock on the report. While the stock recovered to new highs by the end of the year, the earnings report set back caused the stock to trail behind the S&P 500 with a gain of 6.8% for the quarter.” Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below. You can also look at the 10 Large-Cap Stocks Billionaires Like the Least and the 11 Best Robinhood Stocks According to Billionaires. NASDAQ:AMZNNASDAQ:METANASDAQ:MSFTNASDAQ:NVDANASDAQ:GOOGLNvidia Corp (NASDAQ:NVDA)Microsoft Corp (NASDAQ:MSFT)Amazon.com Inc. (NASDAQ:AMZN)Meta Platforms Inc. (NASDAQ:META)Alphabet Inc. Class A (NASDAQ:GOOGL)5 Best Stocks To Buy According to Billionaires10 Large-Cap Stocks Billionaires Like the Least11 Best Robinhood Stocks According to BillionairesShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                 Get our editor’s daily picks straight in your inbox!  "
}