{
    "title": "Dupont Capital Management Corp Acquires 31,353 Shares of NVIDIA Co. \n(NASDAQ:NVDA)",
    "date": "1/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-nvda-sec-filing-2024-01-21/",
    "text": "Dupont Capital Management Corp raised its position in NVIDIA Co. (NASDAQ:NVDA - Free Report) by 123.9% during the third quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission (SEC). The institutional investor owned 56,657 shares of the computer hardware maker's stock after buying an additional 31,353 shares during the quarter. NVIDIA accounts for 2.2% of Dupont Capital Management Corp's holdings, making the stock its 10th biggest holding. Dupont Capital Management Corp's holdings in NVIDIA were worth $24,645,000 at the end of the most recent reporting period. Other institutional investors and hedge funds have also recently added to or reduced their stakes in the company. Peoples Financial Services CORP. bought a new position in NVIDIA in the third quarter valued at about $30,000. Marquette Asset Management LLC acquired a new stake in NVIDIA during the second quarter worth approximately $34,000. MRP Capital Investments LLC acquired a new stake in NVIDIA during the second quarter worth approximately $42,000. Quarry LP acquired a new stake in NVIDIA in the first quarter valued at approximately $34,000. Finally, Perkins Coie Trust Co grew its stake in NVIDIA by 350.0% in the third quarter. Perkins Coie Trust Co now owns 135 shares of the computer hardware maker's stock valued at $59,000 after acquiring an additional 105 shares during the period. 64.79% of the stock is owned by institutional investors and hedge funds. Analyst Ratings Changes A number of research analysts have recently weighed in on NVDA shares. Sanford C. Bernstein raised their target price on NVIDIA from $675.00 to $700.00 and gave the company an \"outperform\" rating in a report on Wednesday, November 22nd. Oppenheimer restated an \"outperform\" rating and set a $650.00 target price on shares of NVIDIA in a research report on Wednesday, November 22nd. The Goldman Sachs Group boosted their target price on NVIDIA from $605.00 to $625.00 and gave the stock a \"buy\" rating in a research report on Wednesday, November 22nd. Wells Fargo & Company boosted their target price on NVIDIA from $600.00 to $675.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, November 22nd. Finally, Needham & Company LLC reaffirmed a \"buy\" rating and set a $600.00 price target on shares of NVIDIA in a research note on Wednesday, November 22nd. One research analyst has rated the stock with a sell rating, four have issued a hold rating, thirty-three have given a buy rating and one has issued a strong buy rating to the company. Based on data from MarketBeat, the company has a consensus rating of \"Moderate Buy\" and a consensus target price of $604.03. View Our Latest Research Report on NVIDIAInsiders Place Their Bets In other news, Director Dawn E. Hudson sold 1,000 shares of the stock in a transaction dated Friday, December 15th. The shares were sold at an average price of $492.52, for a total transaction of $492,520.00. Following the sale, the director now directly owns 70,500 shares of the company's stock, valued at approximately $34,722,660. The transaction was disclosed in a filing with the SEC, which is available at this hyperlink. In other news, Director Dawn E. Hudson sold 1,000 shares of the stock in a transaction dated Friday, December 15th. The shares were sold at an average price of $492.52, for a total transaction of $492,520.00. Following the sale, the director now directly owns 70,500 shares of the company's stock, valued at approximately $34,722,660. The transaction was disclosed in a filing with the SEC, which is available at this hyperlink. Also, Director Mark A. Stevens sold 10,000 shares of the stock in a transaction dated Monday, November 27th. The stock was sold at an average price of $483.18, for a total transaction of $4,831,800.00. Following the sale, the director now directly owns 989,831 shares in the company, valued at $478,266,542.58. The disclosure for this sale can be found here. In the last three months, insiders have sold 155,216 shares of company stock valued at $79,810,950. Company insiders own 3.99% of the company's stock. NVIDIA Price Performance Shares of NVDA opened at $594.91 on Friday. The business's 50-day moving average is $497.62 and its two-hundred day moving average is $464.42. The company has a market capitalization of $1.47 trillion, a P/E ratio of 78.48, a P/E/G ratio of 3.82 and a beta of 1.64. The company has a debt-to-equity ratio of 0.25, a quick ratio of 3.06 and a current ratio of 3.59. NVIDIA Co. has a fifty-two week low of $168.25 and a fifty-two week high of $595.00. NVIDIA (NASDAQ:NVDA - Get Free Report) last announced its quarterly earnings results on Tuesday, November 21st. The computer hardware maker reported $4.02 earnings per share for the quarter, topping the consensus estimate of $3.03 by $0.99. The company had revenue of $18.12 billion for the quarter, compared to the consensus estimate of $16.19 billion. NVIDIA had a return on equity of 72.28% and a net margin of 42.10%. The firm's revenue for the quarter was up 205.5% compared to the same quarter last year. During the same period last year, the firm earned $0.34 EPS. Research analysts predict that NVIDIA Co. will post 11.08 earnings per share for the current year. NVIDIA Dividend Announcement The business also recently declared a quarterly dividend, which was paid on Thursday, December 28th. Shareholders of record on Wednesday, December 6th were given a dividend of $0.04 per share. This represents a $0.16 annualized dividend and a yield of 0.03%. The ex-dividend date was Tuesday, December 5th. NVIDIA's dividend payout ratio is currently 2.11%. NVIDIA Company Profile (Free Report) NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, and internationally. The company's Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building 3D designs and virtual worlds.Featured ArticlesFive stocks we like better than NVIDIAHow to Invest in Lithium and Lithium StocksMarketBeat Week in Review – 1/15 - 1/193 Ways To Invest In Coffee, Other Than Drinking ItInvesting in coffee: 3 great strategies to consider Comparing and Trading High PE Ratio StocksHow to invest in wheat: Is it a hedge against inflation? Want to see what other hedge funds are holding NVDA? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for NVIDIA Co. (NASDAQ:NVDA - Free Report).This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ top AI stock (it’s not MSFT, GOOGL, AMZN or AAPL) (From Traders Agency) (Ad)Should you invest $1,000 in NVIDIA right now?Before you consider NVIDIA, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list.While NVIDIA currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 10 Best Stocks to Own in 2024Click the link below and we'll send you MarketBeat's list of the 10 best stocks to own in 2024 and why they should be in your portfolio. Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider NVIDIA, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list. While NVIDIA currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of the 10 best stocks to own in 2024 and why they should be in your portfolio. Because Nvidia already commands about 80% of the market, is advancing technology today, and is raising prices, it should continue to grow and outperform expectations for the foreseeable future. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}