{
    "title": "(01/22/24) Post-earnings Opportunities: A Real Life Example With NVIDIA Cor",
    "date": "1/22/2024",
    "url": "https://www.moneyshow.com/articles/tradingidea-62348/",
    "text": "Always avoid having an option in place if there is an upcoming earnings report before contract expiration, states Alan Ellman of The Blue Collar Investor This applies to covered call writing and selling cash-secured puts as it will avoid the risk inherent in the reports. However, once the report passes and any post-report volatility subsides, the underlying security can be utilized in our option-selling strategies if it meets our system criteria. This article will focus on NVIDIA Corporation (NVDA), the after-market 8/23/2023 earnings report, and the opportunities that were presented after the report was made public. The NVDA Earnings Announcement On 8/23/2023, after the market closed, NVDA announced earnings that beat market consensus by 31.0%. The stock price moved up the following trading day and option-chains were analyzed for 1-month covered call writing and put-selling post-event opportunities. NVDA: Post-Earnings Option-Chain on 8/24/2024 with NVDA Trading at $476.57  Post-Earnings Initial Call Calculations Using the BCI Trade Management Calculator  Post-Earnings Initial Put Calculations Using the BCI Trade Management Calculator  Learn more about Alan Ellman on the Blue Collar Investor Website. April 10 - 12, 2024 The Big Money Pivot - East Subscribe to MoneyShow’s daily investment newsletter Top Pros' Top Picks and get actionable advice from our top experts, including the hottest stocks to buy and sell, ETFs and funds for short- and long-term capital appreciation, and a wide variety of dividend-paying stocks set to deliver a steady stream of safe, reliable income. Get an edge on the markets with our weekly trading newsletter, Trading Insights, and receive timely trade ideas covering stocks, options, futures, and more to keep you on the right side of the action. From trading basics to advanced strategies and high-probability set-ups, the insights you need from our all-star lineup of trading pros is delivered straight to your inbox. The stock market offers virtually any combination of long-term opportunities for growth and income, as well as short-term investments for trading gains. MoneyShow’s weekly Virtual Learning Letter showcases a variety of on-demand webcasts and video market commentary by top financial experts covering the hottest financial topics each week. Support@MoneyShow.com "
}