{
    "title": "Nvidia GPUs could be facing stock shortages soon – so are we looking at \nprice hikes for GeForce graphics cards?",
    "date": "1/6/2024",
    "url": "https://www.techradar.com/computing/gpu/nvidia-gpus-could-be-facing-stock-shortages-soon-so-are-we-looking-at-price-hikes-for-geforce-graphics-cards",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Bad news from the rumor mill – but does it make any sense? Nvidia’s graphics cards could soon experience much leaner stock levels, if a new rumor is right – a prospect which brings with it the fear of GPU price hikes, though hopefully not to the extent that we’ve seen in the past. Wccftech flagged up a report from tech site MyDrivers which claims that industry sources in Taiwan are saying that Nvidia’s GeForce gaming GPUs are starting to experience lower supply levels as of Q4 2023. Be cautious about that report, of course, as with any rumor, and we aren’t told which models of Nvidia graphics cards are affected in particular, although it sounds like this is more or less across the board for consumer models. This is talking about the Asian market as the likely worst hit region, but the report mentions stock shortages in the US and Europe, too, where Nvidia GPUs could also become harder to find. The expectation according to MyDrivers is that supply of Nvidia boards could be “very limited” in the near future, worryingly, and there’s a mention of price hikes for at least some products being possible. We’ve already seen this to some extent, of course, with the RTX 4090, but that was a special case due to its ban in China (which Nvidia has sidestepped with the incoming RTX 4090 D variant, though not before a lot of vanilla 4090 stock was shipped to Chinese retailers, which had a substantial impact on global pricing of the Lovelace flagship). The worry is that other Nvidia graphics cards, or at least some Lovelace models as mentioned, could follow in those footsteps. We’re told the reason why Nvidia is pulling back production and supply for GeForce GPUs is that it’s prioritizing manufacturing chips for AI cards. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. AI GPUs are where the big profits lie – massive profits of late, in fact – so it does make some sense. What doesn’t make sense is that Nvidia is about to produce a bunch of new RTX Super refreshes: three of them are purportedly set to launch throughout this month, challenging for a place in our best graphics card rankings, after a CES 2024 reveal at the start of next week. If production capacity is being reeled back in a meaningful way, why go ahead with a bunch of new launches? Well, Nvidia needs to rejig its mid-to-upper range bracket with Lovelace, as it has made rather a hash of the GPUs available here – the RTX 4080 with its reportedly dire sales levels in particular – so it is perhaps regarded as a necessary move in that respect. Saving face against AMD in the consumer GPU market, if you will. Also, Nvidia will be scrapping the RTX 4080 and RTX 4070 Ti – they will effectively be replaced by the RTX 4080 Super and RTX 4070 Ti Super, in theory – so it’s a case of swapping in and out, rather than new cards being made as such. Although that noted, the new RTX 4070 Super will run alongside the existing RTX 4070 – the latter isn’t going anywhere. Furthermore, the pricing of these new RTX Super models is supposedly going to be pretty competitive, which again doesn’t exactly marry with the idea of stock shortages, and therefore upward pricing pressures in the near future. On top of this, the MyDrivers article feels rather brief and sketchy, and we’re not sure how much stock (pardon the pun) we’ll put in it at this point. Let’s hope it’s off the mark, anyway, because the last thing we need is to be staring down the barrel of a fresh round of GPU prices rises from Nvidia. Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). New leaks suggest the Nvidia RTX 5080 will offer better ray tracing and pricing than 4080 Another driver update, another set of huge performance boosts for free, as Intel Arc GPUs keep getting better Quordle today – hints and answers for Monday, March 25 (game #791) By Marc McLarenMarch 24, 2024 By Alex WhitelockMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 By David NieldMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 By Mackenzie FrazierMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 By David NieldMarch 23, 2024 By Darren AllanMarch 23, 2024 By Hamish HectorMarch 23, 2024 By Wayne WilliamsMarch 23, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}