{
    "title": "Nvidia's Soaring Stock Price Sparks FOMO In Broader Market, Warns \nEvercore's Julian Emanuel: 'Time To Think More ...",
    "date": "2/12/2024",
    "url": "https://www.tradingview.com/news/benzinga:18c1bdd81094b:0-nvidia-s-soaring-stock-price-sparks-fomo-in-broader-market-warns-evercore-s-julian-emanuel-time-to-think-more-about-risk-than-reward/",
    "text": "The remarkable surge in NVIDIA Corp NVDA stock price is causing a widespread fear of missing out (FOMO) in the market, according to Evercore ISI‘s Julian Emanuel. This has led to concerns about a potential market correction. What Happened: Emanuel, the senior managing director at Evercore ISI, has observed a growing FOMO sentiment among his clients, particularly those who experienced the dot-com boom and bust. This is a cause for concern, as reported by CNBC on Monday. He pointed out that this is the first time such a sentiment has been observed since 2021, raising an “alarm bell.” In a note to his clients, Emanuel highlighted parallels to the Y2K phenomenon, with the current excitement revolving around artificial intelligence and the belief that the U.S. will avoid a recession. “The sentiment is very, very bullish. The bears have been eliminated,” Emanuel said, adding, “It's time to think more about risk than reward until we get just a little cooling off.” Despite the market’s record highs, Emanuel predicts a potential 13% pullback this year, which he considers normal during a non-recession period. He advises clients to consider their buying position at that point. See Also: Nvidia’s $1.7 Trillion Market Cap Surpasses Entire Chinese Stock Market: Investment Strategist However, Emanuel is not entirely dismissive of the winning growth trade, expressing a preference for communication services, consumer staples, healthcare, and money markets. Why It Matters: Nvidia’s stock has been on a meteoric rise, with a 46% increase so far this year and a 239% surge over the past year. This rally has sparked concerns about the stock’s valuation, with some analysts suggesting a potential pause in its upward trajectory. Despite these concerns, Nvidia’s AI capabilities have continued to attract investors, with the stock being considered attractively valued by some, given its growth potential. Moreover, analysts have predicted that Nvidia will lead a double-digit semiconductor stock rally in 2024, further fueling investor interest in the company. However, the stock’s high price-to-earnings (P/E) ratio has sparked a debate on Reddit about its long-term investment potential. Despite this, Nvidia’s CEO, Jensen Huang, has emphasized the importance of AI development and the company’s efforts to make AI more accessible. Read Next: Why Is Legally-Sold Medical Marijuana Testing Positive For Pesticides, Mold Or Yeast? Image Via Shutterstock Engineered by Benzinga Neuro, Edited by Kaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @newcapitalfx @Crypto Playhouse @santiagomartinez.tk @2_beans @matg.fxt @garret_duke @tradingauto6 @nasdaq.forex @tradeindicators @aleshkenderoficial @mytradingsetup @ketory_fx @2prettykittens @TradingView @tradingjunkies.shop @rehanams @AthanT_ @rajpalgore Whatever the trade "
}