{
    "title": "Singtel boosts AI data center business with Nvidia alliance",
    "date": "2/1/2024",
    "url": "https://www.lightreading.com/data-centers/singtel-boosts-ai-data-center-business-with-nvidia-alliance",
    "text": "Singtel is working with Nvidia to make AI adoption more accessible to enterprise customers by hosting the chipmaker's GPU clusters at its Nxera data centers that are now being constructed in Singapore, Indonesia and Thailand. February 1, 2024 Singtel is working with Nvidia to make AI adoption more accessible to enterprise customers by hosting the chipmaker's GPU clusters at its Nxera data centers that are now being constructed in Singapore, Indonesia and Thailand. Nxera, the telco operator's newly launched data center brand, is an aggressive push to capture the growing AI workloads in Southeast Asia. It also represents the next generation of AI-ready, hyperconnected and \"green\" data centers. \"This tie-up provides an easy on-ramp for enterprises across all industries which can accelerate their development of generative AI, large language models, AI fine-tuning and other AI workloads. Together with our sustainable AI DCs, 5G network platform and our AI cluster with Nvidia, these form part of our next-generation digital infrastructure to support AI adoption and digital transformation in Singapore and the region,\" said Bill Chang, CEO of Nxera and Singtel's Digital InfraCo unit. The Nvidia GPU clusters will run in existing upgraded data centers initially and can be further expanded into the new AI data centers when they are ready for service. Customers can leverage Singtel's extensive fixed broadband network, submarine cables and 5G high-speed network connectivity together with Singtel's Paragon cloud platform to orchestrate their AI workloads in a multi-network and multi-cloud environment. Nxera will also provide customers with carrier neutrality to meet all their connectivity resiliency needs. Related:Singtel sells 20% of its data center arm to fund expansion in Southeast Asia Since 2021, Singtel has been delivering edge cloud services with Nvidia AI, having trialed the GPU services at the 5G@Sentosa testbed for many government agencies. The first Nxera data center is expected to come into operation in early 2026. The 58MW DC Tuas in Singapore will offer a high-density environment suited to AI workloads and will operate at a Power Usage Effectiveness (PUE) of 1.23 at full load. Besides DC Tuas, Singtel is also developing two Nxera data centers in Indonesia and Thailand. “The launch of the Nxera data center brand is a key milestone for our data center business as we look to expand our footprint in the region beyond 200MW over the next three years,\" said Chang. Ronnie Vasishta, senior vice president, telecom at Nvidia, said: \"Our collaboration with Singtel will combine technologies and expertise to facilitate the development of robust AI infrastructure in Singapore and throughout the region. In addition to supporting the Singapore government's AI strategy, this will empower enterprises, regional customers and startups with advanced AI capabilities.\" Building an AI data center ecosystem Besides partnering with Nvidia, Singtel also forge partnerships with global and local ecosystem partners across renewable energy, sustainable technologies and talent development to ensure the success of its Nxera data center unit. \"We are putting in place a purpose-driven, fully aligned group of ecosystem partners with distinctive capabilities and unique platforms that will help us grow this digital infrastructure in an AI world – sustainably and responsibly,\" said Chang. \"This means democratizing AI access for enterprises, introducing renewable energy and sustainable technologies, and helping produce the talent for our new generation of data centers.\" For one, Nxera is working with regional energy players such as Sembcorp in Singapore and Gulf Energy, Medco Power and TNB Renewables to achieve operational net-zero emissions at its data centers by 2028. Gulf Energy and Medco Power are partners in Nxera's data center joint ventures in Thailand and Indonesia respectively. \"These partnerships are critical to laying the groundwork for turning digitalization into a driver for decarbonization,\" said Chang. Furthermore, Nxera and its partners – composed of local enterprises Deston and SGP Global as well as global leaders QCT, Shell, Stulz and Supermicro – will establish a co-innovation platform to develop and test liquid and immersion cooling and water-saving technologies. When these technologies are ready, they will be implemented in DC Tuas in Singapore and in other data centers in the region. With a PUE of 1.23 at full load, DC Tuas will be one of the most efficient data centers in Asia. Nxera also intends to develop a smart IoT and digital twin platform with local software company Red Dot Analytics to monitor, manage and optimize its data center operations, using the platform's predictive and simulation capabilities to achieve better overall energy efficiency and operational resiliency. Cultivating data center talent pool Meanwhile, Nxera will be setting up by mid-2024 an academy with Singapore Institute of Technology, Nanyang Polytechnic, Singapore Polytechnic, Temasek Polytechnic and Institute of Technical Education to train talent for the data center business. It is expected to train more than 150 students annually, particularly in new areas of data center development such as sustainability and high-density AI environments. \"We are developing a sustainable data center talent pipeline to power our growth in the region. It will augment and strengthen our long-standing expertise in designing, developing and operating data centers,\" said Chang. Read more about: Gigi Onag Senior Editor, APAC, Light Reading Gigi Onag is Senior Editor, APAC, Light Reading. She has been a technology journalist for more than 15 years, covering various aspects of enterprise IT across Asia Pacific. She started with regional IT publications under CMP Asia (now Informa), including Asia Computer Weekly, Intelligent Enterprise Asia and Network Computing Asia and Teledotcom Asia. This was followed by stints with Computerworld Hong Kong and sister publications FutureIoT and FutureCIO. She had contributed articles to South China Morning Post, TechTarget and PC Market among others. She interspersed her career as a technology editor with a brief sojourn into public relations before returning to journalism joining the editorial team of Mix Magazine, a MICE publication and its sister publication Business Traveller Asia Pacific. Gigi is based in Hong Kong and is keen to delve deeper into the region’s wide wild world of telecoms.  You May Also Like Mar 25, 2024 Mar 22, 2024 Mar 22, 2024 Mar 22, 2024 Rethinking AIOPs — It's All About the Data SCTE® LiveLearning for Professionals Webinar™ Series: Fiddling with Fixed Wireless SCTE® LiveLearning for Professionals Webinar™ Series: Cable and 5G: The Odd Couple? SCTE® LiveLearning for Professionals Webinar™ Series: Delivering the DAA Difference Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG. "
}