{
    "title": "Should You Buy Nvidia After Its Huge Run? ETFs in Focus",
    "date": "2/6/2024",
    "url": "https://www.zacks.com/stock/news/2221565/should-you-buy-nvidia-after-its-huge-run-etfs-in-focus",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Shutterstock Sanghamitra Saha\nFebruary 06, 2024 NVDA Quick QuoteNVDA SMH Quick QuoteSMH BOTZ Quick QuoteBOTZ WUGI Quick QuoteWUGI VCAR Quick QuoteVCAR TRFK Quick QuoteTRFK Better trading starts here. You follow ETF News and Commentary - edit You follow Sanghamitra Saha - edit Sanghamitra Saha ETF News and Commentary The NVIDIA (NVDA Quick QuoteNVDA  -  Free Report)     stock is again a blockbuster this year as it jumped 44% courtesy of high hopes from artificial intelligence (AI). A surge in Hyperscale demand and a solid uptake of AI-based smart cockpit infotainment solutions are acting as tailwinds. The chip giant has witnessed an impressive 228.8% rally in its stock price over the past year. NVIDIA has a Zacks Rank #2 (Buy) and it is a growth stock as well as pricey too. NVIDIA’s P/E (ttm) ratio 76.13X versus the semiconductor industry’s P/E ratio of 26.53X. NVIDIA’s expected growth rate for next year is 63.17% versus the expected growth rate of 14% for the industry  and 4.96% for the S&P 500. Despite this remarkable run, Goldman Sachs remains bullish on the company's prospects and has raised its price target for Nvidia from $625 to $800, marking a potential upside of 21% from the previous Friday's closing price. This positive outlook has driven Nvidia's stock to new heights, with its market valuation now reaching $1.7 trillion, per a Business Insider article. Goldman Sachs analysts are confident that Nvidia's Data Center revenue will not fall in the second half of 2024, as previously anticipated. Instead, they expect a persistent uptick in Data Center revenue throughout the first half of 2025. This positive outlook is attributed to several factors, including continued investments by major cloud service providers in generative AI infrastructure, a widening customer base, and the introduction of new product cycles. Nvidia's reaffirmation of its conviction in growing Data Center revenue beyond CY2024, based on clear visibility into capital spending patterns among major cloud service providers. Goldman Sachs points to recent commentary from major cloud providers such as Amazon, Microsoft, and Alphabet as evidence that Nvidia is poised to benefit from continued spending on AI-enabling GPU chips like the H100. These cloud giants have reported increased adoption and monetization of AI-related services and products, contributing to Nvidia's growth prospects. Nvidia’s competitor AMD's revised 2024 Data Center GPU revenue outlook indicates a substantial increase, further validating the market's potential. Marvell's positive comments about its optical DSP and custom compute businesses led Goldman Sachs to adjust its revenue forecasts for the Data Center segment, the IBD article indicated. Forward guidance from Super Micro suggests an acceleration in revenue growth, reflecting increased demand for Nvidia's products. Positive commentary on AI-related capital spending by hyperscalers, with Meta Platforms increasing its 2024 capex guidance is another factor that can boost Nvidia’s business. Goldman Sachs anticipates that Nvidia will ramp up production of its next-gen H200 hyperscaler in the second quarter of 2024. Goldman Sachs is not alone in its optimism, as Bank of America also raised its price target for Nvidia to $800 last week, underscoring the belief that the demand for AI technologies remains in its booming stage and will continue to drive Nvidia's growth. Nvidia currently has an average brokerage recommendation (ABR) of 1.22 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 39 brokerage firms. The current ABR compares to an ABR of 1.23 a month ago based on 37 recommendations. Of the 39 recommendations deriving the current ABR, 33 are Strong Buy and three are Buy. Strong Buy and Buy respectively account for 84.62% and 7.69% of all recommendations. A month ago, Strong Buy made up 83.78%, while Buy represented 8.11%. Based on short-term price targets offered by 37 analysts, the average price target for Nvidia comes to $664.12. The forecasts range from a low of $410.00 to a high of $1,100.00. The average price target represents an increase of 0.38% from the last closing price of $661.60. NVIDIA lacks on value. The stock has very high P/E and P/CF ratios. Against this backdrop, below we highlight a few NVIDIA-heavy ETFs so that investors can avoid company-specific concentration risks. After all, the semiconductor industry, as a whole, has a decent average brokerage recommendation. Zacks Rank #1 (Strong Buy) VanEck Semiconductor ETF (SMH Quick QuoteSMH  -  Free Report)     – NVIDIA has 19.84% Focus AXS Esoterica NextG Economy ETF (WUGI Quick QuoteWUGI  -  Free Report)     – NVIDIA has 18.25% Exposure Simplify Volt RoboCar Disruption and Tech ETF (VCAR Quick QuoteVCAR  -  Free Report)     – NVIDIA has 14.05% Exposure Global X Robotics & Artificial Intelligence ETF (BOTZ Quick QuoteBOTZ  -  Free Report)     – NVIDIA has 13.29% Exposure Zacks Rank #2 Pacer Data and Digital Revolution ETF (TRFK Quick QuoteTRFK  -  Free Report)     – NVIDIA has 13.09% Exposure NVIDIA Corporation (NVDA) - free report >> VanEck Semiconductor ETF (SMH) - free report >> Global X Robotics & Artificial Intelligence ETF (BOTZ) - free report >> AXS Esoterica NextG Economy ETF (WUGI) - free report >> Simplify Volt Robocar Disruption and Tech ETF (VCAR) - free report >> Pacer Data and Digital Revolution ETF (TRFK) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days. See our report's 7 new picks today - it's really free! Privacy Policy   |   No cost, no obligation to buy anything ever. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.18%  per year. These returns cover a period from January 1, 1988 through January 1, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}