{
    "title": "Stocks close in the red, but Nvidia closes at new record",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/video/stocks-close-red-nvidia-closes-214955440.html",
    "text": "Market indices (^DJI, ^IXIC, ^GSPC) close Monday lower, while semiconductor manufacturer Nvidia (NVDA) — among other stocks — close at a record high. Yahoo Finance's Jared Blikre examines the sector action and Chinese markets after the closing bell. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. [AUDIO LOGO] - Stocks closing in the red, but it isn't all bad news. Nvidia among the stocks hitting record highs. Jared Blikre is here with the breakdown. Jared. JARED BLIKRE: NVIDIA record high, I don't believe it, I'm going to have to check this out. But you take a look at the stock action. Today, small caps really took a beating, a little bit of a one down, 1.3%. But the Dow down 7/10 of a percent. NASDAQ only down 2/10 of a percent. Not a huge day of losses. Now let's take a look at the-- well, there it is, Nvidia. Record daily highs here. Along with Eli Lilly, Costco, Booking, caterpillar, Uber, Intuitive Surgical, Marathon, Petroleum, O'Reilly, Automotive. I've been showing a lot of these names day after day at various times throughout the year. But the list is a little bit smaller today. We got some ground to make up and we don't have any indices in the record category today either. Now I wanted to take a look at the mega caps. This is a top-10 US stocks by market cap. I want to show you something that happened today. Tesla is now number 10 behind Broadcom, 576 versus 581 for Broadcom. Fell behind Eli Lilly in the 600 last week. So we'll have to see how this continues. I'm not going to read too much into that. But is worth a look there. Now here's the sector action. Let me put the percentages back here. Healthcare finished up 3/10 of a percent followed by tech. I want to show you a longer-term chart of healthcare. Guess what? It is on the cusp. It didn't break out today to a record, but it is on the verge of breaking to a record high. Based on the length of this consolidation here, if it does break out, I would expect a lot of continuation. For months, if not a year or so, financials recently broke out from a long-term resistance level, that was late last year. They've been continuing. Tech for that matter, they were the first to break out late last year. And so we've been seeing a number of these sectors just run up and break to those new highs. Now when I take a look at the leaderboard, we don't have a lot of green here. In fact, we're looking at Chip stocks and Chinese stocks. Those are basically the two winning categories of the day. Cannabis and Disruption, that's ARKK, those are the two worst. And let's just take a look at the semiconductor space. You're going to see more green here than any other heatmap I've seen today. And then for the flip side, let us take-- actually not for the flip side, but let's take another look at somewhat of a green screen, that is in China here. So Alibaba up 3%, JD up nearly 3%. But that is an ongoing saga, China trading on its own fundamentals, guys. - Jared, thank you so much. Really appreciate it. Related Quotes "
}