{
    "title": "Nvidia investors betting on big earnings beat – The Irish Times",
    "date": "2/19/2024",
    "url": "https://www.irishtimes.com/your-money/2024/02/19/nvidia-investors-betting-on-big-earnings-beat/",
    "text": "Earnings expectations are high for Nvidia on Wednesday, but bulls will argue they are high for a reason. Photograph: Jakub Porzycki/NurPhoto via Getty Images Investors await with bated breath Nvidia’s earnings report on Wednesday. The stock is on fire. Up over 50 per cent in 2024, Nvidia’s $1.8 trillion market capitalisation last week surpassed Alphabet and Amazon for the first time. Nvidia, notes Bank of America, is now worth more than the entire Chinese stock market. Earnings expectations are high for the runaway leader in the rapidly expanding AI (artificial intelligence) chip space. Analysts expect quarterly revenue to more than triple to $20.37 billion (€18.9 billion), although the soaring share price suggests the so-called whisper number is even higher. Thus, anything less than blowout earnings could cause a sell-off. One analyst warned that a bad quarter could lead to shares falling 20-30 per cent. That sounds extreme, but it would merely bring Nvidia back to where it was trading a month ago. Nevertheless, almost all analysts have buy ratings on Nvidia, with both Goldman Sachs and Bank of America recently upping their price targets. [ The magnificent seven stocks are growing apart ] [ Time to stop the doublespeak on artificial intelligence ] Skyrocketing shares might suggest Nvidia is in bubble territory, but the valuation picture is nuanced. Yes, Nvidia looks bubbly on trailing earnings, but it trades on 35 times estimated earnings – not cheap, but not exceptional either, relative to many other technology stocks. Indeed, bulls point to Nvidia’s price-earnings/growth ratio, which compares valuation to expected growth rate. Far from being elevated, it’s the lowest of the big mega-cap tech stocks. Expectations are high for Nvidia on Wednesday, but bulls will argue they are high for a reason. Proinsias O’Mahony, a contributor to The Irish Times, writes the weekly Stocktake column © 2024 The Irish Times DAC © 2024 The Irish Times DAC "
}