{
    "title": "AMD, Broadcom, Marvell, Nvidia: Big gainers from new AI spending",
    "date": "2/7/2024",
    "url": "https://www.marketbeat.com/originals/amd-broadcom-marvell-nvidia-big-gainers-from-new-ai-spending/",
    "text": " A new Bank of America report found that data center capital spending by four tech titans, Microsoft Corp. NASDAQ: MSFT, Alphabet Inc. NASDAQ: GOOGL, Amazon Inc. NASDAQ: AMZN, and Meta Platforms Inc. NASDAQ: META bodes well for the fortunes of major chipmakers. Those companies are known hyperscalers. The term refers to large companies that provide cloud services and infrastructure on a massive scale, dominating the cloud computing industry. Other companies considered hyperscalers include Alibaba Group Holdings Ltd. NYSE: BABA, International Business Machines NYSE: IBM and Oracle Corp. NYSE: ORCL. According to analysts, after three quarters of year-over-year declines, the hyperscalers are collectively expected to spend about $45 billion, an increase of 7%, led by Google and Microsoft. Bank of America analysts said they believe the industry is in the early stages of a capital expenditure, or capex, upcycle, which they estimate will last for three years. \"We remain confident in AI supporting multiple years of investment,\" they wrote, adding that the AI infrastructure cycle is only at the start of year two. It should come as no surprise that AI chip powerhouse Nvidia Corp. NASDAQ: NVDA is forecast as the top beneficiary of increased data center spending, but other top beneficiaries include Advanced Micro Devices Inc. NASDAQ: AMD, Marvell Technology Inc. NASDAQ: MRVL, and Broadcom Inc. NASDAQ: AVGO. Of course, AI demand extends well beyond the major hyperscalers. For example, according to B of A analysts, data-centric industries like healthcare and finance are actively pursuing AI models to increase operational efficiency and develop new insights into their data. This could be a case where supply and demand line up nicely: As hyperscalers increase their AI capacity, more chips are coming to market. That is a good sign for technology stocks as a whole in 2024. Even with the S&P 500 at all-time highs, analysts are forecasting further price gains in the coming months. When the broader market is seeing significant gains, it's typical that growth sectors, including technology, consumer discretionary stocks and communications stocks are leaders. The Advanced Micro Devices chart shows the stock advancing 25.73% in the past month, consolidating above its 21-day moving average below a January 25 high of $184.92. Advanced Micro Devices analyst forecasts show a consensus price target of $177.88, an upside of 5.95%. Bank of America sees the price rallying even higher to $195. Risks for AMD include competition from larger companies, irregular consumer and enterprise spending and high reliance on one outsourced manufacturer. Bank of America didn't specify that company, but Taiwan Semiconductor Manufacturing Co. Ltd. NYSE: TSM is the main manufacturer for many of the top chip designers. The Broadcom analyst forecast shows a consensus price target of $981.45, a downside of 19.73%. Analysts have a rating of \"moderate buy\" on Broadcom stock. Here again, Bank of America's forecast comes in above the consensus, with analysts seeing the price reaching $1,250, based on double-digit earnings growth and high profitability within the semiconductor industry. In 2024, Wall Street is eyeing earnings of $40.88 a share, a decrease of 4%. However, that double-digit growth is expected next year, with analysts expecting Broadcom to earn $50.70 a share, up 24%. Downside risks include high exposure to Apple Inc. NASDAQ: AAPL and Alphabet, bringing risks of changing designs that no longer rely on Broadcom chips. Marvell is smaller than the other chip companies B of A named in its recent report, both in market capitalization and in revenue. Marvell analyst forecasts show a consensus view of \"moderate buy,\" with a price target of $69.96, an upside of 4.29%. On the Marvell chart, you'll see a pullback in the past three weeks from a high of $73.53 on January 25. However, Marvell stock has maintained a gain of 11.85% in the past month. Marvell is expected to see a pretty steep decline in earnings this year, to 82 cents a share, but a rebound is forecast for 2025. Bank of America cited competitive risks versus larger industry rivals among Marvell's potential challenges. Bank of America has a $700 price target on Nvidia stock, adding that Nvidia's forward P/E, currently 35, is \"justified given stronger growth opportunities ahead as gaming cycle troughs and data center demand potentially faces strong, long-term demand dynamics.\" Nvidia analyst forecasts indicate a price target of $612.68, a downside of 10.20%. Unlike other chip stocks that are taking a breather after recent rallies, Nvidia has continued to run up; so far in 2024, Nvidia stock is up 40%, leading the Technology Select Sector SPDR Fund NYSEARCA: XLK. Risks for Nvidia include internal cloud projects, such as those being developed by Alphabet and Microsoft, and larger-than-expected impact from restrictions on shipments to China, or additional restrictions placed on activity in the region. Before you consider Alibaba Group, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alibaba Group wasn't on the list. While Alibaba Group currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's guide to investing in 5G and which 5G stocks show the most promise. Retirement, Asset Allocation, and Tax Strategies Kate Stalter has been a contributing writer for MarketBeat since 2021. Series 65-licensed investment advisor, financial advisor, Blue Marlin Advisors; investment columnist for Forbes, U.S. News & World Report Asset allocation, technical and fundamental analysis, retirement strategies, income generation, risk management, sector and industry analysis Bachelor of Arts, Saint Mary’s College, Notre Dame, Indiana; Master of Business Adminstration, Kellogg School of Management at Northwestern University Founder, financial advisor for Better Money Decisions; editor, stock trading instructor for Investor’s Business Daily; columnist, podcast host, video host for MoneyShow.com; contributor for Morningstar magazine Because Nvidia already commands about 80% of the market, is advancing technology today, and is raising prices, it should continue to grow and outperform expectations for the foreseeable future. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}