{
    "title": "Morning Brew: Nvidia Sets Up New AI Chip Unit Amid Tech Race",
    "date": "2/9/2024",
    "url": "https://www.gurufocus.com/news/2225804/morning-brew-nvidia-sets-up-new-ai-chip-unit-amid-tech-race",
    "text": "Amid a rapidly evolving technological landscape, Nvidia (NVDA, Financial) is establishing a new business unit dedicated to crafting custom chips for cloud computing entities and other sectors, including advanced AI processors. This strategic move positions Nvidia at the forefront of the generative AI race, with major tech players like OpenAI, Microsoft (MSFT), Alphabet (GOOGL), and Meta Platforms (META) vying for a piece of the pie. Nvidia's H100 and A100 chips, which are priced between $16,000 and $100,000, serve as versatile AI processors for key clients. Despite the trend of tech companies developing in-house chips, Nvidia's initiative aims to support these firms in creating custom AI solutions, challenging competitors such as Broadcom (AVGO) and Marvell Technology (MRVL). PepsiCo (PEP, Financial) has announced a 7.1% increase in its annual dividend to $5.42 per share, marking the 52nd consecutive year of dividend growth. This comes despite a slight year-over-year dip in net revenue for Q4 2023 and guidance for 2024 that fell short of consensus estimates. The company's CEO, Ramon Laguarta, noted a return to pre-pandemic consumer behavior, which could influence future performance. Additionally, Enbridge (ENB, Financial) reported a non-GAAP EPS of C$0.64 for Q4 and a 3.1% increase in its quarterly dividend, reflecting the 29th consecutive annual increase. Cloudflare (NET, Financial) experienced a surge of over 24% in share value following a Q4 earnings report that exceeded expectations and provided a higher-than-anticipated annual profit forecast. The company's positive outlook is reflected in its projected adjusted EPS and revenue for the upcoming fiscal year. In contrast, several companies faced declines, with Synlogic (SYBX) and Childrens Place (PLCE) witnessing significant drops in stock prices due to unfavorable developments and guidance. Las Vegas is gearing up for a historic Super Bowl weekend, with hotel room rates, including those at MGM Resorts (MGM, Financial) and Caesars Entertainment (CZR, Financial) properties, soaring by 300% compared to last year. This spike in rates is expected to benefit other companies with Las Vegas properties, such as Wynn Resorts (WYNN, Financial), Golden Entertainment (GDEN, Financial), Red Rock Resorts (RRR, Financial), and Boyd Gaming (BYD, Financial), as well as hotel chains like Hilton Worldwide (HLT, Financial), Hyatt Hotels (HY, Financial), and Marriott Hotels (MAR, Financial). Petrobras (PBR, Financial) has marked its return to African exploration by acquiring stakes in three exploratory blocks in São Tomé and Príncipe. The move comes as the company reported steady sales and an 11% year-over-year increase in oil and gas production. Shell (SHEL, Financial) remains the operator with a 40% stake in all three blocks. Meanwhile, the CEOs of Johnson & Johnson (JNJ, Financial), Merck (MRK, Financial), and Bristol Myers Squib (BMY, Financial) defended their drug pricing strategies at a Senate hearing, pointing to pharmacy benefit managers (PBMs) as a factor in pricing issues. Airbus (OTCPK:EADSY) (OTCPK:EADSF) is facing delivery delays, notifying airlines of postponed deliveries that were initially scheduled for late 2024 and 2025. Despite these setbacks, Airbus managed to deliver 735 planes last year, exceeding its target. The company is expected to release its year-end earnings on February 15. Additionally, W. P. Carey (WPC, Financial) has narrowed its 2024 earnings guidance following its exit from the office property market, setting a new baseline for future earnings growth. Market watchers are keeping a close eye on the consumer price index revisions, which could confirm the trend of declining core PCE inflation. The Bureau of Labor Statistics' data showed little change after annual revisions, with consumer prices excluding food and energy increasing at a 3.3% annualized rate in Q4 2023. This stability in inflation rates is a positive sign for Federal Reserve officials and market traders. Sam Altman, CEO of OpenAI, is reportedly in discussions to raise a substantial amount of funding for a project aimed at expanding global chip-making capacity. The potential investors include the government of the United Arab Emirates, with talks still in the preliminary stages. We'd love to learn more about your experiences on GuruFocus.com and how we can improve! "
}