{
    "title": "Apple (AAPL) EV car project launch reportedly delayed to 2028",
    "date": "1/23/2024",
    "url": "https://www.shacknews.com/article/138415/apple-ev-car-delayed-2028",
    "text": "New to Shacknews? Signup for a Free Account Already have an account? Login Now Reports indicate that the trillion dollar company is toning down its goals for a self-driving feature. The electric vehicle market continues to grow with fresh competition, and Apple (AAPL) has long had its eye on the pie. It seems that, although the company is still developing an EV, it has been hit with further delays as it strips back on features. On January 23, 2024, Bloomberg reported that Apple (AAPL) is delaying the launch of its own electric vehicle to 2028. This comes as the company rethinks the inclusion of some of its features including self-driving, according to people in the know. Back in April 2021, Apple CEO Tim Cook teased that Apple’s car technology is still under internal investigation in an interview with Kara Swisher. During this chat, Cook said that “autonomy itself is a core technology” and that while many internal investigations don’t see the light of day, he’s “not saying that one will not.” In Mark Gurman’s reporting, he notes that Apple found it wouldn’t be able to complete an EV with “advanced self-driving features for highways” in the foreseeable future. It seems as though Apple will continue to target self-driving, albeit at a Level 2+ system, down from the Level 5 system it had originally planned to hit. There’s certainly a lot of fierce competition in the electric vehicle space. Tesla continues to be a massive force while Sony’s venture with Honda has shown a vehicle that can be controlled with a PlayStation 5 DaulSense controller. Regardless of the current process at Apple, it will be interesting to see the product it delivers when its EV hits in 2028. Take a look at our electric vehicles page for more information on the products and companies behind them. Hailing from the land down under, Sam Chandler brings a bit of the southern hemisphere flair to his work. After bouncing round a few universities, securing a bachelor degree, and entering the video game industry, he's found his new family here at Shacknews as a Guides Editor. There's nothing he loves more than crafting a guide that will help someone. If you need help with a guide, or notice something not quite right, you can message him on X: @SamuelChandler Sam Chandler posted a new article, Apple (AAPL) EV car project launch reportedly delayed to 2028 Apple is never late or early. Apple launches precisely when it means to and everyone else doesn't matter. Sure, but this is the perfect moment for a big tech player to enter the EV market. So many potential EV buyers want to buy but hate Elon Musk/Tesla. Apple continually kicking this can down the road is a mistake, imo. The company could have eaten Tesla's lunch if it shipped a Model Y competitor in 2024-2025. It isn't like Tesla is going to have anything new by that timeframe either. nah but every major automaker will have a full line of EVs on the market It doesn’t need anything new, Model Y is selling extremely well. They’ll have the Model 2 hype train going by then I would buy an apple car over anyone else. I really would. It would be instantly be a desired purchase As long as it has a physical volume knob is there some car that doesn't have a volume control on the steering wheel or something? I think the real question is whether the charging port will be Lightning or USB C They keep trying an aluminum chassis and that dog just ain’t gonna hunt. "
}