{
    "title": "This Is How Much Apple's Top Executives Were Paid in 2023",
    "date": "1/28/2024",
    "url": "https://247wallst.com/jobs/2024/01/28/this-is-how-much-apples-top-executives-were-paid-in-2023/",
    "text": "Apple is one of the most successful, powerful, and wealthy companies in the history of the world. It’s hard to fully grasp just how much money flows through Apple, and how much control they have over the computer and smartphone industry. Just a fraction of that money is spent on top executives, but even that amount is still incredibly large compared to the regular earnings of the average American. But how much are they paid, and how does it compare? This is how much Apple’s top executives were paid in 2023. For this list, we use the data filed by Apple in their annual proxy statement to the SEC. We will include basic facts about their compensation and background on the executives. Apple is the largest company in the world by market capitalization, the largest by revenue (totaling $394.3 billion in 2022 alone), the fourth-largest personal computer seller, the largest manufacturing company, and the second-biggest phone manufacturer. Despite criticism of Apple’s poor labor practices, environmental damage, business ethics, anti-competitive business decisions, and unethical mining, people continue to flock to Apple’s products, proving the power that cool, flashy branding has over the moral fabric of our society. Apple’s CEO pay ratio is 1,177:1, which means that Tim Cook earns over a thousand times more per hour than Apple’s median worker wage. The median worker wage at Apple is $84,493, most of whom live in California, so their wage might not last as long as a similar wage in other states. The lowest-paid employees are paid much less than that. Of course, this doesn’t include those people in other countries who are working in mines, factories, and manufacturing sites as contractors for Apple who are paid less than a few Dollars a day. The median pay for CEOs in America is around $14.5 million while the average annual salary is $59,428 and the average hourly rate is around $28.34. As with most high-level executives at large companies, much of the compensation paid comes in the form of equity, instead of a normal paycheck. If the company does well, the value of this equity can increase rapidly above its value when it is given. These executives don’t need regular paychecks to buy groceries or save up to buy their kids something special; they already have enough to cover all their needs, and more, so equity payments are a perfect way to gain an asset that increases in value and motivate the executives to run the company in a profitable way. Just a couple of decades ago, the gap between executive pay and the lowest earner was still ridiculous, but much smaller, at just a few hundred times more than the median. At more than a thousand times the median, the pay gap has expanded beyond greed to actual human rights abuse and corruption. Advocates of addressing the growing wage gap face a significant uphill battle, with much opposition coming from those who misunderstand the issue. The issue with a massive wage gap isn’t that those on the bottom are jealous of the rich, it’s that it creates financial obstacles for those who are already struggling. As corporate profits increase, the rich take a larger percentage of those profits. If those at the bottom of the corporate ladder go just one year without a raise or increase in compensation, they will be earning less money than before due to price increases and inflation. The view of those who support reducing the wage gap through legislation is that if someone creates a product, they should be compensated a fair portion of the value that product generates. If they work a full day contributing to society, then they should be able to afford to live in and enjoy that society instead of starving and living in dangerous homes. Tim Cook was Apple’s COO under Steve Jobs and assumed the position of CEO after the resignation and passing of Jobs in 2011. He joined Apple in 1998 after Jobs asked him, personally, to join his company. Under Cook’s leadership, Apple’s revenue and profit have more than doubled, and the value of the company has increased from $348 billion to over $3 trillion, becoming the first trillion-dollar company in history in 2018. Tim Cook is Apple’s highest-paid CEO and the fourth-highest-paid CEO in the United States. Cook is an extremely active and public executive. He is open about his political and charitable donations (which have increased under his leadership) and is vocal about his support or opposition to social problems and political issues. He regularly begins his workday around 4:30 every morning. In 2015, Cook pledged to donate his fortune to charity. Yet, as the CEO of one of the most powerful companies in the world, all the work done by Apple ultimately is his responsibility to justify. This includes censoring online content in China, removing apps that protestors in Hong Kong used to organize, exploiting poor workers in third-world countries, and more. Cook was the first CEO of a Fortune 500 company to come out as gay. Luca Maestri is an Italian businessman with experience as an executive at General Motors (NYSE:GM), Nokia Networks, and Xerox. Maestri was appointed as CFO in 2014. Like the other executives on this list, Maestri’s actual salary is much lower than his final compensation. All high-level executives are eligible for Apple’s performance-based cash bonus program and receive significant stock and equity as compensation. Jeff Williams joined Apple in 1998, the same year as Tim Cook, and became the vice president of operations in 2004. He became the COO of Apple in 2015 following the shakeup of the executive team by Cook. In 2019, leadership changes in Apple meant that Williams now leads the Industrial Design and Human Interface Design departments. Williams played a significant part in the launch of the iPhone and has led global iPod and iPhone operations ever since. Kate Adams is an experienced attorney with experience at Sidley Austin LLP in New York, general counsel at Honeywell, a trial attorney for the United States Department of Justice, a law clerk for Supreme Court Justice Sandra Day O’Connor, and much more. For whatever reason, Adams is the only Apple executive who receives media scrutiny for her compensation. Dozens of articles reacting to her high pay were published in January of 2024 alone, while other members of the team have no articles about their compensation. Deirdre O’Brien oversees everything having to do with Apple’s employees from recruiting and employee development to partnerships, benefits, and diversity, along with her retail responsibilities. She is the longest-serving employee of Apple, joining the company in 1988 straight out of college. She was appointed to her current position in 2019. She has helped Apple grow during her thirty years with the company and grew along with it. She’s worked with five Apple CEOs and has been integral in many of the changes the company has made along the way. Tim Cook calls O’Brien the “Veep of People” since she runs the HR division. She was one of the first people to join Cook’s operations team when he joined the company in 1998. In 2019, she was 32 on Fortune’s Most Powerful Women in business list. In 2022, she was 11 on Fast Company’s Queer 50 list. No Commission Fees, No Minimums, No Velvet Ropes. (Sponsored) Robinhood revolutionized commission free investing, and it continues to do so today. With a few simple taps you can trade stocks like Nvidia and Amazon, market beating mutual funds, and trade options with Robinhood Financial. FDIC insurance coverage is just another benefit. And, you can buy and sell cryptocurrencies like Bitcoin (BTC), Ethereum (ETH), and Dogecoin (DOGE) with Robinhood Crypto. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}