{
    "title": "Apple expects iOS 18 will be a landmark update in the company's history",
    "date": "1/29/2024",
    "url": "https://knowtechie.com/ios-18-to-be-apples-biggest-update-ever-with-ai/",
    "text": "Expect iOS 18 to be different and feature-packed. by Apple just released iOS 17.4 beta for developers with many improvements and features. However, a recent report reveals the next version of its mobile operating system, iOS 18, will be a significant update, unveiling in June at WWDC 2024. This report comes from famed Apple journalist Mark Gurman through his latest Power On newsletter. He states Apple sees iOS 18 as “one of the biggest iOS updates — if not the biggest — in the company’s history.” That will be a significant shift if iOS gets a massive overhaul. With iOS 17, we got great features like the recent stolen device protection, but the underlying operating system was still similar to its predecessor. So, what’s causing all the commotion? AI, and the billion bucks a year Apple has reportedly been spending on it. According to Gurman, iOS 18 could be the company’s most ambitious update in years, with major artificial intelligence features in play. Apple’s head of software engineering, Craig Federighi, told employees last year that the operating system– codenamed Crystal–will have ambitious changes all around. Gurman has previously reported Apple is planning multiple new AI integrations with iOS 18, including a tuned-up version of Siri, which will be more intelligent and use a large language model (LLM), just like ChatGPT. Yes, that means Siri will no longer (hopefully) be outclassed by Google Assistant and Alexa. While we don’t know exactly what that will look like, we expect more natural interactions for a start. In addition, the tech giant is implementing AI in the Messages app to auto-complete sentences and more. Apple Music is also getting the AI treatment for auto-generated playlists, and AI integration will come to the iWork app suite. And let’s not forget about Apple finally jumping on the RCS train. For the uninitiated, RCS (Rich Communication Services) is set to elevate the messaging experience on our Phones, especially when interacting with Android devices. No offense to the green bubbles, but soon, they’ll be able to enjoy the same perks as the blue bubbles, like read receipts, high-resolution media, and Wi-Fi messaging. It’s like a peace treaty in the ongoing Android vs. iOS feud. Unfortunately, that’s the limit of our knowledge of iOS 18 and its features. But we are pretty sure this is just the tip of the iceberg, and 2024’s WWDC will be pretty interesting to watch to see how much AI is coming to iOS this year. Have any thoughts on this? Drop us a line below in the comments, or carry the discussion to our Twitter or Facebook. Editors’ Recommendations: Saurav loves writing and tech. So, after engineering, he didn't look back and embarked on a journey to become a tech writer. Saurav has worked for various tech websites across the globe. Saurav has recently joined Know Techie and is proud to be a part of it. Your email address will not be published. Required fields are marked * Comment * Name * Email * Save my name, email, and website in this browser for the next time I comment.  Apple is finally ready to let users customize their iPhone home screens. Sadly, the iPadOS 18 may not support iPads with pre-A10X processors. Apple has released iOS 17.4 to address a couple of potential security issues and... iOS 18 won't be a total design overhaul that mirrors visionOS. We will like see initial Apple AI announcement at the WWDC 2024. You can get the iOS 17.4 Beta on supported iPhones now. The feature is in beta right now, but there is no release timeline just... Code found in new beta revealed Apple's future plans. As an Amazon Associate and affiliate partner, we may earn from qualifying purchases made through links on this site. Copyright © 2024 KnowTechie LLC / Powered by Kinsta "
}