{
    "title": "Beyond the Ticker: Apple",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/video/beyond-ticker-apple-131624109.html",
    "text": "Apple (AAPL) generated more than $394 billion in revenue in 2022. But how were they able to achieve such success? Behind The Ticker charts its path from humble beginnings to its transformation into a tech giant. 1976 Steve Jobs and Steve Wozniak founded Apple in Los Altos, California. The company's first product, the Apple I, was invented by Wozniak and sold later that year. 1984 Apple launched the Macintosh, announced by a $1.5 million television commercial during Super Bowl XVIII. It was the first mass-market personal computer to feature an integral graphic user interface and mouse. 1985 Steve Jobs left Apple and founded the NeXT computer company. 1991 Apple introduced the Power Macintosh line, utilizing PowerPC processors from Motorola and IBM. It is a design that set the standard for most modern laptops. 1996 Steve Jobs returned after leaving the company over a decade earlier. Apple purchased Jobs' NeXT company for its operating system. Jobs was named interim CEO in 1997 and became CEO again in 2000. 1998 The iMac was introduced, selling almost 800,000 units in its first five months. 2001 Apple announced the opening of a line of Apple retail stores to be located throughout major U.S. markets. The first iPod, storing around 1,000 songs, was introduced later that year. 2007 Apple debuted the iPhone, a revolutionary product that changed the way smartphones look and function. 2011 Steve Jobs suffered from pancreatic cancer. He resigned from his position as CEO just before his death and Tim Cook took over as CEO. 2015 The Apple Watch was launched, the first new product range since the departure of Jobs. 2022 Apple became the world's first publicly traded $3 trillion company. It is currently the largest publicly traded corporation in the world by market capitalization. 2023 Apple unveiled the Vision Pro which is a mixed-reality headset. Its 2024 launch will mark the first product debut in a new major category since the Apple Watch. Apple will launch the Vision Pro on February 2, 2024, in the U.S., with pre-orders starting on January 19. From tech giants to retail titans, Beyond the Ticker is a historical series that takes a deep dive into some of Wall Street's trending companies and how they transformed into the financial icons they are today. Check out more of our Beyond the Ticker series, and be sure to tune in to Yahoo Finance. Editor's note: This video was produced by Zach Faulds. [MUSIC PLAYING] - From iPhones and iPads to Macs, Apple Watches, and AirPods, Apple's products are a daily necessity for millions. And the numbers prove it. The company generated more than $394 billion in revenue in 2022 alone. But how were they able to achieve such staggering success? \"Beyond the Ticker\" charts its path to becoming a tech giant. Steve Jobs and Steve Wozniak founded Apple in Los Altos, California in 1976. That same year, Wozniak built the company's first product, the Apple I. Apple debuted the Macintosh with its now iconic 1984 commercial during Super Bowl XVIII. The Macintosh stood out because it was the first mass market personal computer to feature a graphical user interface and mouse. Jobs left Apple after his famous falling out with CEO, John Sculley, in 1985, and subsequently, founded the NeXT computer company. In 1991, Apple introduced the Powerbook line, which set the standard for most modern laptops. In 1996, after a run of CEOs, Jobs returned to Apple. The company purchased NeXT to use its operating system and named Jobs interim CEO in 1997. Apple introduced the iMac in '98, and the line would go on to sell millions of units. Three years later, Apple debuted its first iPod, which could store roughly 1,000 songs. In that same year, the company opened its first Apple stores. But it was in 2007 that Apple unveiled its most important product of all, the iPhone. A revolutionary device, the iPhone helped create an entire business model around apps and the App Store. Jobs suffered from pancreatic cancer towards the end of his second term as CEO. He resigned from the company just before his death, and Tim Cook took over as CEO in 2011. In 2015, Apple took the wraps off of its first new device since Cook took over as head of Apple, the Apple Watch. Just seven years later, Apple became the world's first publicly traded company to reach a market cap of $3 trillion. And in June 2023, the company unveiled its most ambitious product yet, the Vision Pro, a mixed reality headset, the Vision Pro is scheduled to launch in early 2024. [MUSIC PLAYING] Related Quotes "
}