{
    "title": null,
    "date": "1/6/2024",
    "url": "https://www.marketwatch.com/story/apples-stock-has-started-2024-on-a-sour-note-not-seen-in-42-years-19b8667e",
    "text": "Apple Inc.’s start to 2024 is one for the history books, and not in a good way. The stock ended the week with its fourth session in a row of declines. That made for the first time that Apple shares \n        AAPL,\n        -0.47%\n       closed lower in each of the first four trading sessions of a year since 1982, according to Dow Jones Market Data. But as the saying goes, it’s not how you start but how you finish. And for what it’s worth, Apple’s stock ended up rallying 35% in 1982, per FactSet data. Factoring in a losing session at the end of 2023, Apple’s stock has logged five consecutive trading days in a row of declines, falling 6.4% over that stretch and logging its worst five-session streak since the period that ended Sept. 12, when it fell 7.1%. Apple has shed $193 billion in market capitalization over its current losing streak, and Microsoft Corp. \n        MSFT,\n        +0.28%\n       is moving closer to overtaking Apple as the most valuable U.S. company for the first time since late 2021. Less than $100 billion in market capitalization stands between the two companies. Read: This is why the S&P 500 can be expected to continue to outperform small-cap stocks The consumer-electronics giant is dealing with a patent dispute over features on its Apple Watch Series 9 and Apple Watch Ultra 2, though an appeals court late last year temporarily blocked an import ban on the devices. Apple could soon face bigger legal issues, however, as the New York Times reported Friday that the Department of Justice was moving closer to a sweeping antitrust lawsuit against it. Meanwhile, two analysts downgraded the stock in the first week of the year, citing concerns over its valuation and growth prospects. See more: Apple’s stock gets another downgrade as iPhone doldrums could continue Trump Media & Technology Group completed a merger with a SPAC. Shares of the merged company rose 35% on Monday. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}