{
    "title": "Microsoft Overtakes Apple as Most Valuable Company in the World",
    "date": "1/11/2024",
    "url": "https://tech.co/news/microsoft-overtakes-apples-most-valuable-company",
    "text": "Microsoft leapfrogged Apple on Thursday, becoming the most valuable company in the world, largely due to Apple reporting an underwhelming start to 2024 amid concerns about dwindling demand. Shares in Microsoft increased to 1.5% with a market capitalization of $2.888 trillion versus Apple’s 0.03% decrease at a valuation of $2.887 trillion — the first time its valuation has fallen below that of Microsoft’s since 2021. Just a few weeks prior, Apple’s valuation had peaked at $3.081 trillion on Dec. 14, ending 2023 with a 48% gain. Microsoft was stronger on that front too, closing out the year with a 57% increase, due to its prevalence in the exciting generative AI space and partnership with ChatGPT creators, OpenAI in 2023. Verifying Get the latest tech news, straight to your inbox Stay informed on the top business tech stories with Tech.co's weekly highlights reel. By signing up to receive our newsletter, you agree to our Privacy Policy. You can unsubscribe at any time. According to the Reuters report, brokerage firm Redburn Atlantic speculated on the struggling iPhone creator, saying: “China could be a drag on performance over the coming years,” citing the recovery of Chinese phone manufacturer Huawei as a major obstacle to Apple’s dominance in the Chinese smartphone market. The Chinese tech giant, Huawei Technologies, projected a 9% revenue growth in 2023 which might become a further thorn in Apple's side over the coming years. 🔎 Want to browse the web privately? 🌎 Or appear as if you're in another country?Get a huge 86% off Surfshark with this special tech.co offer. Wall Street appears to be favoring Microsoft at the moment. The company has no “sell,” whereas Apple has two. The brokerages covering the two companies also paint a fairer picture of Microsoft, with 90% of the analysts recommending buying the stock compared to two-thirds recommending buying Apple’s stock. Apple appeared to be caught off-guard when chatGPT and other AI-powered technologies were unleashed on the world and has been slow to get off the starting blocks. Whilst Microsoft and Google were busy unveiling their own chatbots, Apple could only conjure up an AI powered auto-correct system in the iOS 17 update released in September 2023. Although, Apple CEO, Tim Cook, insists the company has been working on generative AI for years. A report by Bloomberg last summer stated that Apple had developed its own chatbot dubbed Apple GPT, which is currently in the testing phase, but only time will tell how it will be applied to Apple hardware products. Since 2018, Microsoft has overtaken Apple as the most valuable company in the world a handful of times and only for short periods. The most recent stint in 2021 was incited by COVID, when supply chain issues had a negative impact on Apple’s stock price. Perhaps Microsoft should make the most of this once-in-a-blue-moon lead they have on the smartphone giant. Verifying Get the latest tech news, straight to your inbox Stay informed on the top business tech stories with Tech.co's weekly highlights reel. By signing up to receive our newsletter, you agree to our Privacy Policy. You can unsubscribe at any time. We're sorry this article didn't help you today – we welcome feedback, so if there's any way you feel we could improve our content, please email us at contact@tech.co The iPhone maker is hiring for a wide range of positions... The settlement centers around anyone who owned an Apple... The new Copilot key will be available on Microsoft's... Leaked Dell memos reveal employees can continue to work... "
}