{
    "title": "Apple’s Vision Pro headset launches next month as company seeks to expand \nmixed-reality market",
    "date": "1/8/2024",
    "url": "https://www.kfyrtv.com/2024/01/08/apples-vision-pro-headset-launches-next-month-company-seeks-expand-mixed-reality-market/",
    "text": "(AP) -Apple’s high-priced headset for toggling between the real and digital world will be available in its stores beginning Feb. 2, launching the trendsetting company’s push to broaden the appeal of what so far has been a niche technology. Apple unveiled the sleek $3,500 goggles at a software conference held at its Cupertino, California, headquarters eight months ago — an event that was designed to encourage developers to make apps tailored for a device that projects users into three-dimensional simulations of reality. Apple’s announcement coincides with a major consumer electronics show in Las Vegas where the company has long been conspicuously absent. Apple says the goggles’ operating system will be compatible with more than 1 million apps designed for the iPhone and iPad. Pre-orders begin Jan. 19, but buyers will have to go to a store to be properly fitted for the goggles, which are controlled with the eyes and a few simple hand gestures. Although Facebook owner Meta Platforms and other companies have been making virtual reality headsets for years with limited success, many industry analysts believe Apple has the potential to expand the technology’s audience beyond the video gamers and mostly tech nerds that have embraced it so far. The Vision Pro already has gotten largely enthusiastic reviews among the media who were able to test it in tightly controlled demonstrations monitored by Apple, but the device’s price tag probably means relatively few unit sales during its first year on the market. Even so, Apple’s first new product since its smartwatch debut a decade ago could set the stage for the introduction of more affordable versions for a broader audience. Right now, the Vision Pro will cost seven times more than Meta’s latest virtual-reality headset, the Quest 3. In a sign that Apple is expecting the Vision Pro to pave the way to a bigger market, the company included the ability to take 3-D videos that can be viewed through the goggles on its its latest premium iPhones, the 15 Pro and 15 Pro Max. These videos are so realistic that the people and other images in them appear to be right in front of the viewer watching them. Apple is looking for ways to juice its sales after suffering a slight decline in revenue during its last fiscal year ending in in September. Apple still raked in $383 billion in sales, with the iPhone accounting for more than half that amount. Copyright 2024 The Associated Press. All rights reserved. "
}