{
    "title": "Q4 Earnings Season Scorecard and Analyst Reports for Apple, AbbVie & Toyota",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/q4-earnings-season-scorecard-analyst-184800695.html",
    "text": "Tuesday, January 16, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features a real-time scorecard of the Q4 earnings season and new research reports on 16 major stocks, including Apple Inc. (AAPL), AbbVie Inc. (ABBV) and Toyota Motor Corp. (TM). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Q4 Earnings Season Scorecard Including this morning's reports from Goldman Sachs, Morgan Stanley and others, we now have Q4 results from 32 S&P 500 members. Total Q4 earnings for these 32 index members are up +7.2% from the same period last year on +5.8% higher revenues, with 93.8% beating EPS estimates and 59.4% beating revenue estimates. At this relatively early stage in the Q4 reporting cycle, companies appear to be easily beating consensus EPS estimates, but are struggling to come out ahead of revenue estimates. In fact, the 93.8% EPS beats percentage matches the highest beats percentage for this group of 32 index members in the last 20 quarters (5 years). On the other hand, the 59.4% revenue beats percentage is the lowest for this group of companies since 2022 Q3. Looking at Q4 as a whole, combining the actual results that have come out with estimates for the still-to-come companies, total S&P 500 earnings are expected to be up +0.3% on +2.2% higher revenues. Today's Featured Analyst Reports Apple shares led the Zacks Tech sector over the past year through roughly mid-December 2023, but have lagged since then. The stock is up +34.8% over the past year vs. +45.2% for the Tech sector and the +20.6% gain for the S&P 500 index. The company is benefiting from strong demand for the iPhone. Apple expects the iPhone’s year-over-year revenues to grow on an absolute basis in first-quarter fiscal 2024.Revenues for Mac are expected to significantly accelerate compared with the fourth-quarter fiscal 2023’s reported figure. It expects the year-over-year revenue growth for both iPad and Wearables, Home and Accessories to decelerate significantly from the September quarter due to a different timing of product launches.For the Services segment, Apple expects average revenues per week to grow at a similar strong double-digit rate as it did during the September quarter. It is benefiting from increasing customer engagement in the services segment. The expanding content portfolio of Apple TV+ aids subscriber growth.(You can read the full research report on Apple here >>>)Shares of AbbVie have outperformed the Zacks Large Cap Pharmaceuticals industry over the past six months (+22.8% vs. +16.7%). The company has several new drugs in its portfolio with the potential to drive the top line and make up for lost Humira revenues.Newer products, Skyrizi and Rinvoq, are performing extremely well, bolstered by approval in new indications. The company has several early/mid-stage candidates that have the potential to drive long-term growth. Though revenues are expected to decline in 2023, AbbVie expects to return to robust sales growth in 2025.However, the company faces several near-term headwinds like Humira loss of exclusivity, increasing competitive pressure on Imbruvica and economic pressure on Juvederm sales.  AbbVie’s shares have underperformed the industry in the past one year. Estimates have risen ahead of Q4 earnings. AbbVie has a positive record of earnings surprises in recent quarters.(You can read the full research report on AbbVie here >>>)Shares of Toyota have outperformed the Zacks Automotive - Foreign industry over the past six months (+22.7% vs. +10.6%). Continued demand for vehicles and a robust lineup of trucks and sport utility vehicles are set to fuel Toyota’s sales volumes. The Japanese auto giant aims to generate 40% of its global sales from electric vehicles by 2025 and 70% by 2030.Toyota Motors plans to invest 4 trillion yen ($35 billion) for a lineup of 30 battery electric vehicles by 2030. For fiscal 2024, Toyota projects vehicle sales of 9.6 million units, indicating an increase from 8.82 million units sold in fiscal 2023. Its investor-friendly moves also spark optimism.However, commodity cost inflation is expected to continue to weigh on the company’s margins. High capex and R&D expenses on the development of electric and autonomous vehicles are likely to dent its near-term margins and cash flows. The stock warrants a cautious stance at present.(You can read the full research report on Toyota here >>>)Other noteworthy reports we are featuring today include EOG Resources, Inc. (EOG), Monster Beverage Corp. (MNST) and General Motors Co. (GM).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>> Today's Must Read Robust Portfolio, Services Strength to Benefit Apple (AAPL) AbbVie's (ABBV) Skyrizi, Rinvoq Key to Top-Line Growth Strong Demand to Lift Toyota (TM) Sales, High Debt Ails Featured Reports EOG Resources (EOG) Continues to Bank on Oil-Rich PermianWith highly productive acreages in premier oil shale plays like the Permian, EOG Resources secures a strong production outlook. Rising leases and well expenses concern the Zacks analyst. Monster Beverage (MNST) Gains From Energy Drinks CategoryPer the Zacks analyst, Monster Beverage is gaining from the expansion of the energy drinks category and product launches. It launched many products and expanded distribution in international markets. Organic Growth Aids Cencora (COR) Amid CompetitionPer the Zacks analyst, Cencora should benefit from continued solid organic revenue growth, World Courier unit and Specialty distribution business amid cutthroat competition in the Medtech space. United Airlines (UAL) Rides on Travel Demand Amid Cost WoesUpbeat air travel demand is driving United Airlines' top line. The Zacks analyst is, however, worried about escalated labor costs that are limiting bottom-line growth. Campbell Soup (CPB) Benefits From Impressive Snacks DivisionPer the Zacks analyst, Campbell Soup is set to keep gaining from focus on strengthening the growing snacks category. Sales from the unit rose 1% and formed 44.2% of top line in fiscal-first quarter. Woodward (WWD) Benefits from Momentum in Aerospace SegmentPer the Zacks analyst, Woodward's performance is gaining from strength in its Aerospace segment. The Industrial segment is expected to gain from higher demand for power generation. Multi-basin Portfolio, Low Cost Asset Aid Murphy Oil (MUR)Per the Zacks analyst Murphy Oil's maintenance of a multi-basin portfolio boosts production and low cost operating assets in North America will drive operation. New Upgrades Cost Efficiency and Electrification Aids General Motors (GM)General Motors' (GM) cost-cutting measures and a robust push into electric mobility, fueled by the Ultium Drive system and key battery plants, make the Zacks analyst bullish on the stock. Arch Capital (ACGL) Set to Grow on Solid Premium GrowthPer the Zacks analyst, Arch Capital is set to grow on solid Insurance and Reinsurance business driving improvement in premium growth which is backed by diverse product & service portfolio. Strong Demand for Key Drugs Drive BioMarin's (BMRN) ToplineWhile BioMarin's (BMRN) key drugs like Vimzim and Naglazyme have been driving sales, the Zacks Analyst is encouraged by rapid uptake for new drug, Voxzogo which has opened up a new sales opportunity. New Downgrades Inflationary Pressures Hurt Cracker Barrel's (CBRL) Prospects Per the Zacks analyst, Cracker Barrel's operations are likely to be affected by commodity and wage inflation. Also, subdued consumer sentiments and reduced restaurant traffic is a concern. Sluggishness in China Commerce Business Ails Alibaba (BABA)Per the Zacks analyst, Alibaba is suffering from weakening China Commerce business due to sluggish growth in online physical goods GMV at Taobao and Tmall marketplaces. Decline in NII, Legal Hassles & High Costs Hurt UBS Group AGPer the Zacks analyst, a decline in NII in the near term will hurt UBS Group AG. Heightened regulatory supervision, a rising expense base and unsustainable capital distributions are other concerns. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Toyota Motor Corporation (TM) : Free Stock Analysis Report EOG Resources, Inc. (EOG) : Free Stock Analysis Report General Motors Company (GM) : Free Stock Analysis Report Monster Beverage Corporation (MNST) : Free Stock Analysis Report AbbVie Inc. (ABBV) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}