{
    "title": "How Microsoft overtook Apple to become world's most valuable company",
    "date": "1/15/2024",
    "url": "https://www.businesstoday.in/visualstories/business/how-microsoft-overtook-apple-to-become-worlds-most-valuable-company-88566-15-01-2024",
    "text": "Produced by: Tarun Mishra\nDesigned by: Mohsin Microsoft has on Thursday become the world's most valuable company, edging past Apple. Microsoft's market valuation reached $2.875 trillion, surpassing Apple's $2.871 trillion, marking the first instance since 2021 that Apple's valuation has fallen below that of Microsoft. Microsoft's ascent to the top is attributed to its early lead in generative artificial intelligence. This technological advantage played a pivotal role in Microsoft's market valuation surpassing that of Apple. Apple Inc experienced a 3.3% slide in January, with worries emerging about sustained weakness in iPhone sales, particularly in crucial markets like China. Regulatory scrutiny of the arrangement designating Google as the default search engine on iOS further impacted Apple's stock. This scrutiny poses a threat to Apple's services business, which had been a positive aspect in recent quarters. Apple's market capitalisation, which peaked at $3.081 trillion on December 14, ended the previous year with a 48% gain, trailing behind Microsoft's impressive 57% surge. The contrasting trends in market capitalisation contributed to Microsoft's overtaking of Apple. Microsoft's strategic focus on artificial intelligence, particularly through its collaboration with OpenAI and the introduction of GenAI-powered tools in 2023, played a crucial role in its ascent. The company has briefly outpaced Apple in the past and is now benefiting from the generative AI revolution. Microsoft's $13-billion investment in OpenAI is, however, facing potential investigation by European Union watchdogs. Recent revelations of deep connections between Microsoft and OpenAI have triggered an evaluation by the European Commission to determine if it warrants scrutiny under merger rules, potentially leading to a formal investigation and unwinding if deemed to impede fair competition.  "
}