{
    "title": "Apple Vision Pro unboxing: What's comes inside",
    "date": "2/7/2024",
    "url": "https://www.businessinsider.com/apple-vision-pro-unboxing-what-comes-with-headset",
    "text": "I finally have the Apple Vision Pro in my hands. On Friday, the Vision Pro officially went on sale and started being shipped to pre-order customers. Now less than a week after its release, the $3,500 mixed-reality device is already the star of hype-inducing viral videos showing the headset being worn out in the world. I received my order on Tuesday and dove in. Here's what to expect in the box when the Vision Pro arrives at your door. It's white, lightly-branded, and to the point — right in line with Apple's other sleek product packaging. The Vision Pro is securely packed in a box that's not unlike the rest of the Apple ecosystem. The Vision Pro comes packaged with a cloth to clean off any fingerprints and a protective cover for its display. The device also comes with a light seal cushion to use \"if prompted by the system or if you need more room for a better fit,\" according to the instructions. A dual loop band is included as well for \"a different fit.\" For power, the external battery pack comes with a USB-C charger cable and a power adapter. There's no need to buy your own display cover separately because the Vision Pro comes with its own snug, fabric cover. Unlike some of its competitors, Apple created the Vision Pro with a separate, detachable battery pack that can be charged with a USB-C charger. The battery comes charged enough to get started, so it's ready to use out of the box. The Vision Pro itself comes with a light seal and cushion already magnetically attached. But be careful not to pick it up by the cushion; it's magnetically attached and can pop off accidentally. The device has speakers on either side of the device and underneath the display. Physical controls include a dial called the \"digital crown\" and a top button. The solo knit is easily detached using the orange tabs inside the headset. You'll have to properly line up the battery's cable, then turn to lock it into place to power up the Vision Pro. Using the fit dial, you can adjust the tightness of the band to properly secure the Vision Pro to your head. After that, it's ready to go. Read next Jump to "
}