{
    "title": null,
    "date": "2/4/2024",
    "url": "https://finance.yahoo.com/news/foxconns-january-revenue-down-20-074345802.html",
    "text": "TAIPEI (Reuters) -Taiwan's Foxconn, the world's largest contract electronics maker and Apple's biggest iPhone assembler, on Monday reiterated that it expected an on-year drop in first quarter revenue coming off a high base. The first quarter is traditionally quieter than the previous one, the season when Taiwan's tech companies race to supply smartphones, tablets and other electronics to major vendors such as Apple for Western markets' year-end holiday period. Foxconn said in a statement that overall operations in this year's first quarter were \"gradually entering the traditional off-peak season, and seasonal performance is expected to be similar to that of the past three years\". It noted that in the first quarter of 2023, as factories resumed normal operations following the COVID-19 pandemic, increasing shipments led to a higher comparison base. \"The outlook for the first quarter of this year is expected to decrease year-on-year,\" Foxconn said, reiterating previous guidance. The company does not give numerical forecasts. Foxconn, formally called Hon Hai Precision Industry Co Ltd, said revenue last month reached T$522.1 billion ($16.65 billion), which it said was the second-highest ever for the same period, the highest being the previous January. That was up 13.5% month-on-month, but down 20.9% year-on-year. Compared to the year-ago period, it said in January revenue for cloud and networking products increased significantly due to new customer product launches, but with personal computer demand slowing revenue fell slightly for computing products. Foxconn Chairman Liu Young-way said on Sunday he expects the company's business this year to be \"slightly better\" than last year but is facing a shortage of chips for AI servers, where demand is booming. Foxconn will report fourth quarter earnings on March 14, when it will also update its outlook. Foxconn's shares closed down 0.5% on Monday ahead of the release of its January numbers, compared with a 0.2% gain for the broader market. ($1 = 31.3510 Taiwan dollars) (Reporting by Ben Blanchard; Editing by Kim Coghill and Emelia Sithole-Matarise) Related Quotes "
}