{
    "title": "Surgical AR/VR poised for widespread adoption with Apple’s Vision Pro \nlaunch: Report",
    "date": "2/10/2024",
    "url": "https://www.siasat.com/surgical-ar-vr-poised-for-widespread-adoption-with-apples-vision-pro-launch-report-2975249/",
    "text": "New Delhi: Surgical augmented reality and virtual reality (AR/VR) is anticipated to be a highly impactful innovation in the near term with widespread adoption, according to a report on Friday. This is driven by Apple’s recent foray into the extended reality (XR) market with the introduction of its spatial computing product, Vision Pro, said the report by GlobalData, a leading data and analytics company. Early adopters have responded positively to the launch, and the product’s impact on the widespread adoption of XR hardware and software is evident, with over 600 applications now available on the Vision OS marketplace. The report predicted the emerging XR innovations that are expected to influence the industry in the near to long term. These innovations encompass various advancements, such as holographic surgical displays, AR/VR applications for optometry, AR/VR integration with surgical robots, and more remote advancements like real-time 3D anatomical modelling and 4D computed tomography. “The basic premise of surgical AR/VR innovation revolves around integrating XR technologies into surgical procedures. However, the intricate nature of surgical care demands more than just superimposing computer-generated images onto a surgeon’s view. The goal extends to providing real-time visual guidance and enhanced awareness during surgery,” said Sourabh Nyalkalkar, Practice Head of Innovation Products at GlobalData, in a statement. “The notable increase in innovation activity is driven by a diverse range of players, including hardware manufacturers, chip makers, healthcare providers, software developers, and more. The growing competition in this area is illustrated by over 40 start-ups actively working on creative surgical AR/VR solutions, as identified by the Technology Foresights platform,” he added. A closer look at the start-up landscape within the surgical AR/VR domain reveals a vibrant ecosystem characterised by robust innovation and competitive dynamics. Noteworthy innovators in this space include companies like Synaptive, XACT Robotics, and CMR Surgical, which specialise in surgical robots offering enhanced visualisation capabilities tailored for precision surgeries. Conversely, start-ups such as Theator and Heartflow are concentrating on software-based solutions. These solutions aim to provide surgical intelligence to hospitals and surgeons, along with improved visualisation for cardiovascular diagnostics, respectively. Additionally, start-ups in this sector are crafting solutions tailored to specific surgical procedures. “The intricate nature of surgical XR technology is clearly reflected in the startup scene,” Nyalkalkar said. “As Apple’s Vision Pro sparks widespread adoption of XR products, it will be intriguing to observe how the companies developing solutions for surgical care adapt to Apple’s ecosystem. Also, it will be interesting to see whether Apple, known for its effective tech-driven acquisitions in new domains (like the recent additions of Mira Labs in 2023 and Curious AI in 2021), will leverage this strategy to establish its presence in the field of surgical care,” he added. Get the news updates on WhatsApp & Telegram by subscribing to our channels. For all the latest Business updates, download our app Android and iOS. "
}