{
    "title": "Apple and Amazon Have More Financial Power than Any Country",
    "date": "2/22/2024",
    "url": "https://watcher.guru/news/the-magnificent-7-apple-amazon-now-wield-greater-financial-power-than-any-major-country",
    "text": "Dubbed the Magnificent 7 by a recent Deutsche report, Apple, Amazon, and Meta, along with Tesla, Alphabet, Microsoft, and Nvidia, have been referred to as forces to be reckoned with. The report outlines how the collective market capital of these seven companies has surpassed the financial power of every G20-listed country. Also Read: U.S. Economy on Steroids, Unsustainable Future: Billionaire Investor The recent Deutsche Bank report outlines how these seven tech behemoths have been dominating the corporate sphere. The report later shared that the combined market cap of these 7 companies would ultimately make it the second-largest stock exchange in the world. Also Read: China’s Stock Market Faces $1 Trillion Losses in 2 Weeks Apart from that, Microsoft and Apple alone share similar market caps with countries such as France, Saudi Arabia, and the UK. Moreover, the concentration of investors’ interest in these companies has also compelled analysts to voice several concerns. According to Deutsche Bank analyst Jim Reid, this rise of Mag 7 has left the S&P saturated to a certain extent. “The Mag 7’s rise has left the S&P 500 at its most concentrated in at least the last 100 years. Perhaps not since the bubble of 1929 so few stocks had such high weightings in the overall market. Their future performance will likely impact the majority of global assets to some degree, or a great degree, going forward,” he later shared. The undeniable success of the Mag 7 companies is fueling a debatable scenario for analysts to discuss. However, this doesn’t change the fact that these companies are still the top investor choices. The primary reason driving the prospects of Mag 7 is their innovative approach to AI adoption. These firms have been at the forefront of adapting newer techniques and methods, such as AI, to boost their growth prospects. “In addition, no one quite knows how AI will pan out or who will win. Technology changes rapidly over time. Current high valuations assume Mag 7 will always win.” The report was later shared. According to new research conducted by Bank of America, approximately 67% of fund managers believe that “Magnificent Seven is currently the most crowded trade, with short China equities coming in next at 25%.”  Disclaimer: Our articles are NOT financial advice, we are not financial advisors. All investments are your own decisions. Please conduct your own research and seek advice from a licensed financial advisor. "
}