{
    "title": "Apple's Leap into Generative AI: What's Next for Tech? Tim Cook Addresses \nthe AI Question",
    "date": "2/3/2024",
    "url": "https://www.gizbot.com/apps-software/apples-leap-into-generative-ai-whats-next-tech-tim-cook-gen-091083.html",
    "text": "Apple could soon bring generative artificial intelligence (AI) capabilities to its devices, revealed CEO Tim Cook during the company's quarterly earning calls. While speaking about the Cupertino-based tech giant's achievements in the last quarter, Cook mentioned that it has been spending a \"tremendous amount of time and effort\" on AI. Without disclosing any details, he also hinted that these features could be released later this year. If Apple does step into the generative AI space, it will be competing with the likes of Microsoft, Google, and OpenAI. The Apple CEO said, \"As we look ahead, we will continue to invest in these and other technologies that will shape the future. That includes artificial intelligence, where we continue to spend a tremendous amount of time and effort, and we're excited to share the details of our ongoing work in that space later this year.\" During the call, Cook alluded to AI multiple times and specifically mentioned generative AI once. Despite name-dropping the emerging technology, Cook never revealed any information on exactly what Apple was working on or which devices were likely to receive AI features. While answering an analyst's question regarding any thoughts on the potential upcoming announcements on AI, Cook said, \"In terms of generative AI, which I would guess is your focus, we have a lot of work going on internally as I've alluded to before.\" \"Our M.O., if you will, has always been to do work and then talk about work and not to get out in front of ourselves, and so we're going to hold that to this as well. But we've got some things that we're incredibly excited about that we'll be talking about later this year.\" Apart from AI, another highlight during Apple's earnings call was the mention of India. The country made an appearance during the prepared remarks of both the Apple CEO and Luca Maestri, the Chief financial officer of Apple. Both mentioned India highlighting Apple's quarterly records in the country. Notably, the iPhone maker surpassed the ten million-mark in revenue for the first time in a calendar year in India, leading the category, as per a Counterpoint report. In particular, Maestri mentioned India-based software giant Zoho, highlighting the iPhone's enterprise growth. He said, \"In emerging markets, Zoho, a leading technology company headquartered in India, offers its 15,000-plus global employees a choice of devices, with 80 percent of their workforce using iPhones for work and nearly two-thirds of them choosing Mac as their primary computer.\" Further, responding to an analyst's question, Cook referenced that India grew in revenue terms for Apple with strong double digits in the previous quarter, setting a new revenue record in the region. As Apple hints at its foray into generative AI, the technology world watches with bated breath. The potential introduction of AI capabilities into Apple devices could redefine user interactions and set new benchmarks in the tech industry. With competitors like Google and Microsoft in the fray, Apple's entry into the generative AI space promises an exciting future for technology enthusiasts. Moreover, Apple's growing connection with India, as highlighted in their quarterly earnings call, underscores the country's importance as a market and as a hub for technological innovation. The anticipation builds as we await further announcements from Apple on their AI developments later this year. "
}