{
    "title": null,
    "date": "2/14/2024",
    "url": "https://siliconangle.com/2024/02/14/mark-zuckerberg-tried-apples-vision-pro-shared-thoughts/",
    "text": "UPDATED 11:45 EST / FEBRUARY 14 2024 by \nKyt Dotson Meta Platforms Inc. Chief Executive Mark Zuckerberg took to Instagram to share his thoughts on the newly released mixed-reality headset from Apple Inc., the Vision Pro, where he said that Meta’s Quest 3 headset was simply “the better product, period.” In the three-minute video, Zuckerberg (pictured) said he finally tried the new headset, noting that he expected that it would be the superior product because the Vision Pro is significantly more expensive. The price comparison is staggering: The Vision Pro starts at $3,500 and the Quest 3 starts at $499. “I have to say that before this, I expected that Quest would be the better value for most people since it’s really good, and it’s like seven times less expensive,” Zuckerberg said. “But after using it, I don’t just think that Quest is the better value. I think the Quest is the better product, period.” Apple introduced the Vision Pro in June, which shipped earlier this month, and Meta unveiled the Quest 3 in September. Both devices allow users to enjoy both virtual reality experiences, with complete immersion in virtual worlds that take over their vision, and mixed reality, which blends the physical world with computer-generated images overlaid over it. Zuckerberg mentioned that Quest 3 users don’t need to worry about wires, unlike the Vision Pro, which has wires that attach to its external battery pack. “There’s no wires that get in the way, which is a big deal,” Zuckerberg said. He also mentioned that he experienced “motion blur” in the display, stating that the Quest felt a lot “crisper.” He did say that Apple’s screen did have a higher resolution but added that the company had to make too many tradeoffs in comfort and “artifacts” to get there. The Quest is lighter than the Vision Pro at about 1.1 pounds, compared with between 1.33 and 1.4 pounds for the Vision Pro, depending on its configuration, making the Quest slightly slimmer and easier to wear for longer periods of time. Zuckerberg did give some praise to the Vision Pro for its eye-tracking system and mentioned that both headsets had gesture controls, but said that he believed the Quest 3 had better accuracy. “Quest’s immersive content library is a lot deeper,” Zuckerberg said. He mentioned that Meta has been working with studios to make content and virtual reality games for a long time. And he added that if someone wants to YouTube or play on Xbox on a big screen, “that’s only available on Quest right now.” During his commentary, Zuckerberg commented that some Apple “fanboys” might get upset if someone claims the company isn’t the leader in a new category. He hopes that Meta’s open model will help its headset win overall in the new market. “The future is not yet written,” he said. THANK YOU Blockchain-focused cryptography startup Zama raises $73M to protect data in use Bipartisan bill could see TikTok banned in US if it doesn’t split with China OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions Taalas raises $50M to develop chips optimized for specific AI models Claroty secures $100M to enhance cyber-physical system security Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research Blockchain-focused cryptography startup Zama raises $73M to protect data in use SECURITY - BY MIKE WHEATLEY . 3 HOURS AGO Bipartisan bill could see TikTok banned in US if it doesn’t split with China POLICY - BY JAMES FARRELL . 6 HOURS AGO OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions AI - BY MIKE WHEATLEY . 8 HOURS AGO Taalas raises $50M to develop chips optimized for specific AI models AI - BY MARIA DEUTSCHER . 9 HOURS AGO Claroty secures $100M to enhance cyber-physical system security SECURITY - BY DUNCAN RILEY . 9 HOURS AGO Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research AI - BY MARIA DEUTSCHER . 10 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}