{
    "title": "That Single Deal That Made Apple's iPhone The Most Successful Product Of \nOur Time",
    "date": "2/5/2024",
    "url": "https://fourweekmba.com/apple-success-story/",
    "text": "The Leading Source of Insights On Business Model Strategy & Tech Business Models The Leading Source of Insights On Business Model Strategy & Tech Business Models It was the fall of 2006 when Apple had been working on the launch of a product that would revolutionize the smartphone market. Steve Jobs had remarked several times there was nothing “smart” to that market. True, these phones had improved a lot compared to previous phones. However, they were still hard to use, not practical, and used primarily for business. Not a consumer device. Steve Jobs would put an end at all that with the launch of the iPhone, which would become a massive commercial success. Still in 2017 iPhone sales accounted for most of Apple revenues. The story of the iPhone and how it got to be – from the technological standpoint – has been told many times. Thus, this time I want to focus on the business story. How Steve Jobs, rather then the greatest visionary we all think, he might have been a great deal maker instead. Able to squeeze any industry he set up to disrupt, with deals that took advantage of already established oligopolies, cartel, and center of powers. How he managed to do that is still a mystery to me. This time I want to focus on the deal that made the iPhone a wild success: the AT&T deal. The iPhone’s success isn’t just about a technological device that innovated and was years ahead of its competitors. This is the story of a tool, primarily subsidized by the carriers industry which without it would have probably never had taken off as he did, and it all starts with one of the most inaccurate predictions of our time, from Steve Ballmer, former Microsoft’s CEO. Table of Contents Steve Ballmer is often cited as the one who got it wrong several times about the future of the tech market. However, in my opinion when it comes to technology – but in general to any real-world forecast – we all wrong. Only a few lucky ones are right in hindsight. The success of a technology is not just the result of how good it was. That is often a combination of several variables, including distribution, the state of complementary technologies, and marketing efforts (to list some of the factors). Steve Ballmer as Microsoft CEO was undoubtedly understating Apple products. But he was right about the iPhone price. How do you make a costly product like iPhone appealing to the consumer market? The answer resides in the “subsidized economy of mobile carriers.” Before Steve Jobs with the iPhone changed the rules of the game, the mobile phone industry represented a multi-billion dollar industry where the mobile carriers saw the handsets business as a commodity they could use. While that strategy had paid back in the past to bring in new subscribers, the whole industry needed a shake. And Apple was ready to give that. One of the first players that understood that the iPhone could be a potential hit – or at least could revitalize their brand was Cingular (later AT&T). In an attempt to be branded as an “innovative company” and steal subscribers from ita rivals the time seemed right for Apple‘s deal. Before we get to that point, there is another step of the story to understand here. As the story goes, Steve Jobs had understood he had to bet on the mobile market by producing its handset, which would be something in the middle between a phone and an iPod. That phone was Rokr, and it was in partnership with Motorola. When the Rokr came out – noted cultofmac – “In the end, the Rokr E1 proved disastrous. With its cheap plastic design, poor camera, and a 100-song limit, it fell far short of the iPod’s promise of 1,000 songs in your pocket. Designed to make listening to your music easy, and pitched as the “iTunes phone,” it also failed on that front. The Rokr E1 required that users buy songs via iTunes, then transfer them to the device using a cable.“ The demo of Steve Jobs on the “iTunes phone” might well be considered the least successful one. Yet those mistakes would set the stage for the iPhone. Steve Jobs didn’t wait too long before losing all his enthusiasm for the Motorola-Apple partnership. That’s why in September 2006 Apple discontinued support for the Rokr. Time to change strategy and this time with a bold move. The Cingular team was the first to understand a change in the carriers’ business model. Where before handsets providers were a mere commodity used to lock as many new subscribers with cheap phones. There was a chance now to be perceived as an innovator in the space. And what partner would best fit this role than the company that had first disrupted the computer industry and then moved to the music industry? Steve Jobs made a deal with AT&T, as reported by Wired “in return for five years of exclusivity, roughly 10 percent of iPhone sales in AT&T stores, and a thin slice of Apple’s iTunes revenue, AT&T had granted Jobs unprecedented power.“ However, Apple in return got a revenue-share model where it received $10 for every iPhone customer subscribing to an AT&T plan, plus total control over the design, manufacturing, and marketing of the iPhone. That was an unprecedented deal! That was the beginning of the end for the mobile carrier’s dominance over the smartphone companies – or at least Apple. As of December 31, 2009, AT&T served 85.1 million wireless customers, compared to 77.0 million at December 31, 2008. Part of this staggering growth was also due to iPhone success. A companion read with this article “The Untold Story: How the iPhone Blew Up the Wireless Industry – from Wired.” Who Owns Apple Apple Business Model Apple Business Growth Apple Distribution Apple Value Proposition How Much Is Apple Worth? Apple Cash On Hand Apple Employees Apple Revenue Per Employee Apple iPhone Sales Apple Profits Revenue Per Employee Apple Mission Statement The Economics of The iPhone Tim Cook’s Salary Tim Cook’s Net Worth Read next:   Copyright © 2024  FourWeekMBA Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}