{
    "title": "Andy Hertzfeld Net Worth",
    "date": "2/21/2024",
    "url": "https://www.celebritynetworth.com/richest-businessmen/business-executives/andy-hertzfeld-net-worth/",
    "text": "Andy Hertzfeld is an American computer scientist and inventor who has a net worth of $50 million. Andy Hertzfeld was part of the original Apple Macintosh computer development team in the early 80s. Hertzfeld went to work for Apple Computer after buying an Apple II. From 1979 to 1984 he worked as a designer for the Macintosh system software. After leaving Apple in 1984, he co-founded the electronics companies Radius, General Magic, and Eazel. Later, from 2005 to 2013, Hertzfeld worked as a designer at Google. Andy was the key designer of the Circles user interface in Google+. Hertzfeld was portrayed by Elden Henson in the movie \"Jobs\" and by Michael Stuhlbarg in the film \"Steve Jobs.\" Andy Hertzfeld was born on April 6, 1953 in Philadelphia, Pennsylvania. For his higher education, he went to Brown University, from which he graduated with a degree in computer science in 1975. Hertzfeld went on to attend the University of California, Berkeley for his graduate studies. In 1978, Hertzfeld purchased an Apple II computer and soon after started developing software for it. He also began writing for the monthly publications Call-A.P.P.L.E. and Dr. Dobb's Journal. This eventually drew the attention of Apple itself, which hired Hertzfeld in 1979 as a systems programmer. During his early years at Apple, Hertzfeld developed the firmware for the company's first printer, the Apple Silentype, and also wrote the firmware for the Sup'R'Terminal, the first 80-column peripheral card for the Apple II computer. A little later, he wrote an icon and font editor to enable the design of the standard Macintosh computer icons, which he enlisted his artist friend Susan Kare to design. Eventually, in 1981, Hertzfeld became a member of the design team for the Apple Macintosh computer, working for Bud Tribble alongside Burrell Smith and Bill Atkinson. He served as the primary software architect of the Macintosh Operating System, which broke ground at the time for its use of the graphical user interface. Additionally, Hertzfeld wrote major portions of the original system software for the Macintosh, including such integral components as the user interface toolbox, control panel, and scrapbook. (Photo by Steve Jennings/Getty Images) Following his departure from Apple in 1984, Hertzfeld co-founded the computer hardware company Radius with Mike Boich, Burrell Smith, Alain Rossmann, and Matt Carter. Radius specialized in Macintosh peripherals and various accessories, including processor upgrade cards, graphics accelerators, video capture cards, and color calibrators. The company's first product, the Radius Full Page Display, pioneered the concept of having multiple screens available in a single coordinate space, permitting users to move windows across the screens. Radius went public in 1990; however, by 1992, it was experiencing great difficulties, with many shareholder lawsuits accusing its managers of insider trading. After a round of layoffs in 1993, Radius acquired the video production software company VideoFusion. The next year, it acquired the rival company SuperMac. In early 1999, Radius changed its name to Digital Origin and focused on creating video editing software and hardware. A few years later, in 2002, it was acquired by the company Media 100. Hertzfeld's second company following his Apple tenure was General Magic, a software and electronics company he co-founded with Marc Porat and Bill Atkinson in 1990. Early on, the company operated in near-total secrecy; soon enough, however, it attracted the notice of many of the most prominent electronics corporations in the world, such as Sony and AT&T, which became partners and investors. In 1994, General Magic released its flagship product, the Magic Cap, the object-oriented operating system that was used in Sony's Magic Link as well as the Motorola Envoy. Among its other products, General Magic developed the antecedents to such devices and components as USBs, software modems, touchscreen controller integrated circuits, and networked games. General Magic went public in early 1995. Its success was relatively short-lived, however, as its stock had dropped substantially by the end of the decade. The company announced that it would discontinue its operations in 2002. Two years after that, General Magic was liquidated. The third company founded by Hertzfeld was Eazel, in 1999. Notably, the staff of the company included numerous former employees of such top technology companies as Apple, Microsoft, Netscape, and Sun Microsystems. Eazel's flagship product was the Nautilus file manager for Linux's GNOME desktop. After a failed attempt to monetize and secure necessary funding, Eazel ended its operations in the spring of 2001. Among his other activities, Hertzfeld volunteered his services to the Open Source Applications Foundation from 2002 to 2003. For the organization, he wrote early prototypes of the personal information management software Chandler. In 2004, Hertzfeld launched the website folklore.org, a collective storytelling platform that includes many anecdotes about the making of the original Macintosh computer. The following year, Hertzfeld began working for Google. For the brand, he served as the key designer of the Google+ Circles user interface, and also worked on the image-organizing software Picasa. Hertzfeld left Google in the summer of 2013.  In 1998, Hertzfeld married Joyce McClure. The couple resides in Palo Alto, California. They bought their Palo Alto home a year after marrying, for $350,000. Today the home is likely worth $6-7 million. © 2024 Celebrity Net Worth / All Rights Reserved "
}