{
    "title": "Apple Vision Pro \"Crackgate\" intensifying as users share horror stories",
    "date": "3/1/2024",
    "url": "https://www.pcguide.com/vr/news/apple-vision-pro-crackgate/",
    "text": "Apple Vision Pro's \"Crackgate\" is intensifying PC Guide is reader-supported. When you buy through links on our site, we may earn an affiliate commission. Prices subject to change. Read More Last Updated on March 1, 2024 Reports are circulating on social media about some Apple Vision Pro users experiencing cracks in their computing headsets. There are dozens of Apple Vision Pro users reporting cracked units on the official r/Apple Vision Pro subreddit so much so that it’s ushered in the colloquial term of “Crackgate”. It’s disappointing to see a $3,500 headset experiencing such issues so soon after its US-only launch window, especially for early adopters who bought the Apple Vision Pro; it’s looking like a far more widespread issue than originally theorized. Momentum behind Crackgate started to build just three days after the Apple Vision Pro’s release date with one Reddit post stating “we have a crack on the outer glass already”. The photo shows a small vertical line directly on the bottom middle of the headset. The user writes: “I have never used my Vision Pro outside of my bed, and whenever I am not using it, I always have the soft outer cover on” continuing with: “I wonder what caused the crack, and whether it’s a manufacturing defect or not”. Soon after this post went live on on the subreddit, which now boasts over 60,000 users, more stories of the same vertical crack on the outer glass began appearing, with the severity appearing to get worse. One user posted about a “random crack in the front glass” with the line considerably thicker and longer than the original sighting. They explain: “It’s been sitting neatly in the Apple travel-case, and it’s been subject to very light use of a couple of hours a day”. Ending with: “I haven’t dropped it or similar”. The shocking state of the photo was enough to ignite heavy discussion in the comments. The top-rated response asked if the battery was connected to the unit and charging on the wall outlet while inside of the protective cover, with some users explaining that the Apple Vision Pro cracks could be appearing due to a “heat expansion problem cracking the glass”. The Apple Vision Pro cracks appear to be getting some level of recognition from Apple itself according to threads on more posts where the headset has this issue. A user posted about another cracked front glass but followed up with Apple support. They shared their iPhone screen and “other posts on this sub of people with the same issue” to where the representative “documented everything” and set up a repair process. It’s not just users on Reddit documenting issues, either. That’s because people are also posting on Apple’s community forums as well. A user writes about the Apple Vision Pro crack: “I noticed a very small indent on the bridge of the nose of Vision Pro when I first got it” they explain, “it is very tiny, something like a fingernail size, I was concerned but assumed it just a production technique” and that “it is in line with the photos I have seen online” The top response tells the user to bring it into Apple so that it can inspect the headset to see whether it’s a manufacturing defect. Interestingly, they raise the idea of Apple charging a significant sum to repair the item: “If they think you damaged it, without Apple Care it’s about $800 to repair it” but with Apple Care it’s “still a few hundred to repair”. This appears to line up with estimates from Apple Support which now includes a service of “Cracked cover glass” which is $799 without or $299 with an AppleCare+ plan. It appears as though leaving the Apple Vision Pro in direct sunlight for hours on end could be a factor in why the headsets are cracking at an alarming rate. One user writes: “PSA: never set your Vision Pro down in a way that lets sunlight into the lenses” because “it will burn the screen and require an expensive repair”. According to the comments, there’s no warning in the box about using the headset in direct sunlight. Something to be aware of if you’re considering buying Apple Vision Pro. It doesn’t look as though the cracked Apple Vision Pro headset photos are slowing down any time soon. Earlier this week, one user posted “crack is wack!” stating that: “so apparently the cracking is real. In its case (Apple’s official case) not charging, cover on the front. [The] crack wasn’t there last time I opened it a couple of days ago. Unbelievable”. The top rated comment explains: “Crackgate has caused me to perform a new ritual of closely inspecting my device for cracks every time I take it out or put it away” and that this eventuality isn’t “what Apple was hoping would be in the forefront of users’ minds”. The original poster responded: “Last time I took it out was after seeing the posts about cracks and checking for one”. They explain: “Didn’t expect it to actually happen to me” and how they’re “worried it may happen to a lot of them”. Another thread response writes: “It’s definitely a more widespread issue than what what we see here” and that they been “disconnecting the battery after each use and also when charging the battery”. Crackgate looks to have inspired justified paranoia in the early adopters, which isn’t a good sign given its exorbitant pricing and current limited availability. “I also started waiting for the device to warm up to room temp before using it now” and “[it] really sucks this is happening and that we have to baby this thing”. Apple has yet to officially comment on this situation. We’ll be updating you with the latest news and comment as more information becomes available. The best advice we can offer is to follow the directives of users in terms of care for the headset; keep it unplugged when not in use, away from the sun or any kind of heat and be incredibly gentle. Hopefully, this is just the result of an early adopters’ first batch, and something that could be amended in due time. We’ll keep you posted. Aleksha McLoughlin is Hardware and News Editor for PC Guide and she oversees buying guides, reviews, news, and features on site. She was previously Hardware and Affiliates Editor at VideoGamer. PCguide.com is part of the BGFG family of websites. Our mission is to provide you with great editorial and essential information to make your PC an integral part of your life. You can also follow PCguide.com on our social channels and interact with the team there. © 2024 PC Guide. All rights reserved. Part of "
}