{
    "title": "Apple's App Store rule changes draw sharp rebuke from critics",
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/news/apples-app-store-rule-changes-draw-sharp-rebuke-from-critics-150047160.html",
    "text": "Apple (AAPL) has updated its long-standing App Store guidelines, giving developers the option to let users make in-app purchases for iOS apps outside of its App Store. But the changes still haven’t won over one of the company’s longtime critics. Under the new rules, app developers can provide customers with links to third-party purchase options for their apps, but they must still pay Apple fees of either 12% or 27%. Spotify (SPOT), one of Apple’s biggest critics, isn’t a fan of the changes. In a statement, the music streaming service slammed the new rules. “Once again, Apple has demonstrated that they will stop at nothing to protect the profits they exact on the backs of developers and consumers under their app store monopoly,” the company said in a statement. “Their latest move in the US — imposing a 27% fee for transactions made outside of an app on a developer’s website — is outrageous and flies in the face of the court's efforts to enable greater competition and user choice.” Epic Games CEO Tim Sweeney, meanwhile, said the changes were part of a \"bad-faith 'compliance' plan,\" and called the revised fees \"anticompetitive.\" The new App Store rules come after the US Supreme Court on Tuesday declined to hear Apple’s appeal to a lower court’s ruling that required Apple to let developers offer a third-party payment option for app purchases. An appeal by Epic was similarly denied. Epic Games originally filed an antitrust lawsuit against Apple in 2020, claiming that Apple’s refusal to allow app developers to offer third-party payment options in their iOS apps violated antitrust laws. In particular, Epic took issue with the 15% and 30% fees Apple charged developers when consumers made app purchases via Apple’s payment system. The fees, they said, positioned the App Store as an illegal monopoly that blocked competitors from the revenue stream. US District Court Judge Gonzalez Rogers held that while Apple didn’t break federal antitrust laws, it did violate California’s Unfair Competition law by not letting developers offer their own payment options. Both Epic Games and Apple appealed Gonzalez Rogers’s decision to the Ninth Circuit Court of Appeals before trying to get their cases heard in front of the Supreme Court. The appeals court also said Epic failed to establish Apple's App Store as a relevant market. The court went on to say that Epic failed to meet a requirement to show a substantially less restrictive means by which Apple could maintain its iOS ecosystem. However, the Ninth Circuit let Gonzalez Rogers’s determination that Apple had violated California’s Unfair Competition law stand. To remedy the violation, the court ordered Apple to let developers include pathways for their users to make in-app purchases outside the App Store. On Tuesday, Apple updated its app store rules giving developers the option to include a link to a separate website that users could use to make app purchases. But there’s a catch. Developers will still have to pay Apple a fee. Instead of the 15% or 30% charges, though, Apple will assess developers a 12% or 27% fee. The 12% fee will apply to developers that take part in Apple’s Small Business Program. The 27% applies to larger developers. In order for developers to offer a third-party payment option to their users, they must include a disclosure sheet that will pop up whenever a user taps a link to make an outside payment. The disclosure sheet warns that Apple, “is not responsible for the privacy or security of purchases made on the web.” Apple’s App Store is under fire across the Atlantic as well. The company recently filed an appeal to the European Commission’s Digital Markets Act (DMA), which could force the iPhone maker to completely overhaul its App Store business model. According to Reuters, Apple is appealing the EU's designation calling its App Store a single business. Instead, Apple says the App Store is actually five separate businesses with each one pertaining to its different operating systems: iOS, macOS, tvOS, watchOS, and iPadOS. It’s not just the DMA, though. The US Justice Department is also reportedly preparing to file an antitrust suit against Apple related to hardware and software business practices, according to Bloomberg. The DOJ hasn’t decided if it’s going to move forward with the suit yet, but if it does, it could come as soon as March. Alexis Keenan is a legal reporter for Yahoo Finance. Follow Alexis on Twitter @alexiskweed. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}