{
    "title": "Apple shares new Vision Pro ad just days before launch",
    "date": "1/28/2024",
    "url": "https://www.digitaltrends.com/computing/apple-shares-vision-pro-ad-just-days-before-launch/",
    "text": "Apple has dropped a new Vision Pro ad just a few days before the launch of the new device. You can watch it above. The 70-second ad, posted on Apple’s YouTube channel on Sunday, has Supertramp’s 1974 hit Dreamer as the soundtrack and shows the $3,499 mixed-reality headset being used in a variety of settings. It kicks off with a guy in his house using the device to apparently catch up on some work, with the sequence focusing heavily on how hand gestures can be used to control the Vision Pro, though commands can also be communicated via voice and eye movements. The same guy is later seen switching from work to playing with his daughter, with a digital representation of his eyes appearing on the Vision Pro’s outer display so that eye contact can be had without removing the device. It’s a feature unique among such headsets, though some people have found it a bit creepy. We see another guy at home wearing the Vision Pro to watch a movie and using a pinch gesture to increase the size of the virtual cinema screen, and a woman using it to hold a FaceTime call with a friend. It also shows an airplane passenger with the device strapped to her head as she watches a movie during a flight. The ad includes the tagline, “Hello Apple Vision Pro.” The Vision Pro headset is Apple’s most significant product launch since the Apple Watch smartwatch in 2015. For the tech giant, there’s a lot riding on the device, though the $3,499 asking price is likely to be prohibitive for many. A lot of people have been asking about the kind of apps that will be available with the brand-new device at launch. On that front, here’s everything you need to know. The Vision Pro arrives first in the U.S. and will start landing in customers’ hands on Friday, February 2. Other countries are expected to follow soon. Some Vision Pros have cracks in the middle, at the bottom of the front glass. Wohinbistdu and dornbirn / Reddit The front glass of Apple's Vision Pro is cracking down the middle for a small, but growing number of people. The cause is a mystery because the owners say they didn't drop, mishandle, or abuse the headset in any way. After an outlier 18 days ago, several more owners have reported the same problem occurring in the past 48 hours. The Apple Vision Pro is one of Apple’s most fascinating new product launches. It’s the first new product line from Apple since the Apple Watch, but the hype around it has been more like when Apple first introduced the original iPhone. Of course, Apple was not the first to the market with a VR/AR headset, but it is definitely what would be considered the most “mainstream” option out there, considering the brand name. When Apple announced the Apple Vision Pro on June 5, 2023, during its WWDC 2023 keynote, I was excited. After years of rumors, it was finally happening. Preorders started on January 19, 2024, and the  Apple Vision Pro launched on February 2, 2024, in the U.S. The problem? It costs at least $3,500, making it a hard sell for many as a first-generation Apple product. The Vision Pro is impressive, but it's not for everyone. That's why some people are already returning their orders just two weeks after the $3,500 product first launched. Fortunately, if that's you, or if you like the concept of Apple's Vision Pro, but aren't convinced it's a match for your needs, there are several alternatives to consider. Similar options start at $500 and climb to $3,900. Some of the best VR headsets available now offer many of the same capabilities, but require a VR-ready Windows gaming PC. Others fall short of the Vision Pro's specifications, but are still great choices at a much lower price. Either way, it's a great time to review what Vision Pro alternatives you can buy right now and what's coming in the near future.\nMeta Quest Pro Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}