{
    "title": "Devs claim Apple has pulled a Unity in the EU with new Core Technology Fee",
    "date": "1/26/2024",
    "url": "https://www.gamedeveloper.com/mobile/devs-claim-apple-has-pulled-a-unity-in-the-eu-with-new-core-technology-fee",
    "text": "App Store devs interested in using third-party services in the EU will need to agree to new terms, and a fee that could eventually cost them €0.50 per install. January 26, 2024 Apple is introducing a new 'Core Technology Fee' across the European Union that will charge developers hoping to use third-party storefronts a €0.50 ($0.53) fee on each first annual install past the 1 million install threshold. The fee is being rolled out as Apple looks to comply with the EU's new Digital Markets Act (DMA), which aims to prevent digital platforms identified as 'gatekeepers' from prohibiting users from interacting with third parties. Where the App Store is concerned, the legislation means Apple must let developers leverage payment services and marketplaces outside of its own end-to-end platform. For instance, Epic now intends to bring Fortnite back to iOS in Europe through its own Epic Games Store. There is, though, something of a catch for App Store developers looking to do business in Europe. In order to take advantage of the new capabilities and terms for apps in the EU, Apple is requiring developers to agree to new business terms. Those terms include a new tariff called the Core Technology Fee (CTF) that Apple says will only apply to developers \"who achieve exceptional scale on iOS in the EU.\" In reality, that means any developer who manages to achieve over 1 million installs per year. Developers can avoid that fee by choosing to remain on Apple's existing terms, but that would mean forgoing the option of distributing their iOS apps on alternative app marketplaces or using other payment providers. For those wondering what the CTF would cost developers who do find success in Europe, Apple has provided a handy calculator to show how it might scale up (and how much they could save by sticking with the company's existing terms). According to that calculator, if a free app delivered 2 million downloads in the EU under the new terms, they would be required to pay Apple just over $45,000 per month because of the CTF. That fee remains the same irrespective of whether those downloads were achieved through the App Store alone, alternative storefronts, or a combination of both.  A developer who achieved the exact same results on Apple's existing terms, however, would have to hand over, well, absolutely nothing. Scale up that success and the payments become more significant. 5 million downloads of a free app would result in over $180,000 in monthly fees. 10 million downloads would mean monthly fees of over $400,000. You can see how this could snowball–especially when you start incorporating other factors such as fees to alternative providers. Some developers claim the CFT is eerily similar to the controversial Runtime Fee that was being touted by Unity last year. The original version of that initiative would've seen charge its developers a per-install fee that scaled depending on how many installs they achieved. The engine maker eventually reworked that plan after a huge backlash. Responding to the news, Nikita Bier, creator of the Discord-owned social app Gas, suggested the CFT could result in some developers becoming indebted to Apple. \"Under the App Store's new fee structure for Europe, if you make $10 million in sales, Apple's cut is $6.2 million annually. Assuming you have no operating costs or salaries, your take home amount: $2 million after tax—or 20 percent of your sales,\" he wrote on X, sharing a screenshot of his own fee calculations. \"I will never launch an app in Europe.\" \"If you make less than $0.57 per user—which is most apps—you will end up negative and you will owe Apple money.\" Mike Desaro, founder of mobile studio Prime31, questioned whether Apple had taken a leaf out of the Unity playbook. \"Did Apple just pull a Unity? WTF is going on in the games world? Imagine a few months from now you use Unity 6 (dumb move #1) and end up getting dinged per install TWICE. Plus the Core Technology Fee. What a year it’s gonna be,\" he wrote. Epic Games boss Tim Sweeney seemed to agree with that assessment, responding with a resolute \"yes\" to an X post that asked whether Apple just introduced the equivalent of Unity's runtime install fee. He also shared a lengthy takedown of his own that described Apple's new terms as an \"illegal anticompetitive scheme rife with new Junk Fees.\" Sweeney, of course, has a longstanding beef with Apple. Epic and Apple previously took chunks out of each other in court after the latter pulled Fortnite from the App Store in 2020 for breaching guidelines by using third-party payments. Apple claims the new EU guidelines will result in more than 99 percent of developers reducing or maintaining their current fees, and like we explained earlier, the CFT is optional for developers in the EU–but only if they have no interest in exploring their options beyond the App Store ecosystem. For those keen to scour pastures new, success might come at a cost. Read more about: Chris Kerr News Editor, GameDeveloper.com Game Developer news editor Chris Kerr is an award-winning journalist and reporter with over a decade of experience in the game industry. His byline has appeared in notable print and digital publications including Edge, Stuff, Wireframe, International Business Times, and PocketGamer.biz. Throughout his career, Chris has covered major industry events including GDC, PAX Australia, Gamescom, Paris Games Week, and Develop Brighton. He has featured on the judging panel at The Develop Star Awards on multiple occasions and appeared on BBC Radio 5 Live to discuss breaking news. You May Also Like Mar 25, 2024 Mar 25, 2024 Mar 21, 2024 Copyright © 2024. All rights reserved. Informa Tech, a trading division of Informa PLC. "
}