{
    "title": "Apple clinches top spot as world's most valuable brand, outshining Amazon, \nGoogle, and Microsoft | Press Release",
    "date": "1/17/2024",
    "url": "https://brandfinance.com/press-releases/apple-clinches-top-spot-as-worlds-most-valuable-brand-outshining-amazon-google-and-microsoft",
    "text": "Apple has achieved exceptional brand value growth this year, increasing by USD219 billion (74%) to USD517 billion, reclaiming its title as the world’s most valuable brand by a huge margin. Every year, leading brand valuation consultancy Brand Finance puts 5,000 of the biggest brands to the test, and publishes over 100 reports, ranking brands across all sectors and countries. The world’s top 500 most valuable and strongest global brands are included in the annual Brand Finance Global 500 2024 ranking. “Apple has grown its brand value through strategic diversification and premiumisation, moving away from heavy reliance on iPhone sales towards ventures into wearables and services such as Apple TV subscriptions. According to our research, more than 50% of respondents recognised Apple as expensive, but worth the price, reinforcing the brand’s ability to demand a price premium”. Brand Finance research found significant gain amongst brands that have heavily invested in AI, seeing NVIDIA (brand value up 163% to USD44.5 billion) become the world’s fastest-growing brand. Microsoft (brand value up 78% to USD340.4 billion) has also seen an impressive brand value increase, jumping up two spots to 2nd place. A key supplier of chips in the AI space, NVIDIA is perceived as highly innovative while familiarity, consideration, and recommendation levels all increased year-on-year, according to Brand Finance research. The brand’s overall performance firmly positions NVIDIA as a front-runner in the AI chip market, demonstrating a successful balance between innovation and market adaptation. Deutsche Telekom (brand value up 17% to USD73.3 billion) has claimed the title as the world's most valuable telecoms brand, surpassing Verizon (brand value up 6% to USD71.8 billion). Ranked 9th globally, Deutsche Telekom also leads as the most valuable European brand. Deutsche Telekom’s customer momentum, driven by network strength, has boosted group service revenues, while successful fibre deployment in Europe, alongside 5G leadership in the US, have enhanced connectivity perceptions. Brand Finance research highlights Deutsche Telekom’s leadership in customer satisfaction metrics, driving a Brand Strength Index increase to 83/100. This consistent global brand delivery is reinforced by the introduction of Deutsche Telekom’s unified global claim, \"connecting your world,\" completing its Global Brand Strategy with heightened international focus and customer perspective. Tesla (brand value down 12% to USD58.3 billion) has dropped out of the top 10, falling to 18th place in the ranking. Tesla has been harmed by its large exposure to the Chinese EV market, and BYD (brand value up 20% to USD12.1 billion) has now overtaken Tesla to become the world’s largest EV maker. While Tesla’s brand strength remains high overall, rated AAA-, Brand Finance research shows a significant fall in reputation. Tesla’s close association with Elon Musk, a controversial leadership figure, creates added reputational risk for the brand. That said, despite BYD’s greater production volume, Tesla’s brand value is five times that of BYD. This highlights the enduring significance of brands as corporate assets, allowing Tesla to command a price premium, support its company value, and potentially fuel renewed growth. Brand Finance is launching the Global 500 at Davos on the 17th of January 2024 in partnership with Infosys, the fastest growing IT Services brand over the last 5 years. View the full Brand Finance Global 500 2024 report here ENDS Brand Finance is the world’s leading brand valuation consultancy. Bridging the gap between marketing and finance for more than 25 years, Brand Finance evaluates the strength of brands and quantifies their financial value to help organizations of all kinds make strategic decisions. Headquartered in London, Brand Finance has offices in over 20 countries, offering services on all continents. Every year, Brand Finance conducts more than 5,000 brand valuations, supported by original market research, and publishes over 100 reports which rank brands across all sectors and countries. Brand Finance also operates the Global Brand Equity Monitor, conducting original market research annually on over 5,000 brands, surveying more than 150,000 respondents across 38 countries and 31 industry sectors. Combining perceptual data from the Global Brand Equity Monitor with data from its valuation database enables Brand Finance to arm brand leaders with the data and analytics they need to enhance brand and business value. Brand Finance is a regulated accountancy firm, leading the standardization of the brand valuation industry. Brand Finance was the first to be certified by independent auditors as compliant with both ISO 10668 and ISO 20671 and has received the official endorsement of the Marketing Accountability Standards Board (MASB) in the United States. Brand is defined as a marketing-related intangible asset including, but not limited to, names, terms, signs, symbols, logos, and designs, intended to identify goods, services, or entities, creating distinctive images and associations in the minds of stakeholders, thereby generating economic benefits. Brand strength is the efficacy of a brand’s performance on intangible measures relative to its competitors. Brand Finance evaluates brand strength in a process compliant with ISO 20671, looking at Marketing Investment, Stakeholder Equity, and the impact of those on Business Performance. The data used is derived from Brand Finance’s proprietary market research programme and from publicly available sources. Each brand is assigned a Brand Strength Index (BSI) score out of 100, which feeds into the brand value calculation. Based on the score, each brand is assigned a corresponding Brand Rating up to AAA+ in a format similar to a credit rating. Brand Finance calculates the values of brands in its rankings using the Royalty Relief approach – a brand valuation method compliant with the industry standards set in ISO 10668. It involves estimating the likely future revenues that are attributable to a brand by calculating a royalty rate that would be charged for its use, to arrive at a ‘brand value’ understood as a net economic benefit that a brand owner would achieve by licensing the brand in the open market. The steps in this process are as follows: 1 Calculate brand strength using a balanced scorecard of metrics assessing Marketing Investment, Stakeholder Equity, and Business Performance. Brand strength is expressed as a Brand Strength Index (BSI) score on a scale of 0 to 100. 2 Determine royalty range for each industry, reflecting the importance of brand to purchasing decisions. In luxury, the maximum percentage is high, while in extractive industry, where goods are often commoditised, it is lower. This is done by reviewing comparable licensing agreements sourced from Brand Finance’s extensive database. 3 Calculate royalty rate. The BSI score is applied to the royalty range to arrive at a royalty rate. For example, if the royalty range in a sector is 0-5% and a brand has a BSI score of 80 out of 100, then an appropriate royalty rate for the use of this brand in the given sector will be 4%. 4 Determine brand-specific revenues by estimating a proportion of parent company revenues attributable to a brand. 5 Determine forecast revenues using a function of historic revenues, equity analyst forecasts, and economic growth rates. 6 Apply the royalty rate to the forecast revenues to derive brand revenues. 7 Discount post-tax brand revenues to a net present value which equals the brand value. Brand Finance has produced this study with an independent and unbiased analysis. The values derived and opinions presented in this study are based on publicly available information and certain assumptions that Brand Finance used where such data was deficient or unclear. Brand Finance accepts no responsibility and will not be liable in the event that the publicly available information relied upon is subsequently found to be inaccurate. The opinions and financial analysis expressed in the study are not to be construed as providing investment or business advice. Brand Finance does not intend the study to be relied upon for any reason and excludes all liability to any body, government, or organisation. The data presented in this study form part of Brand Finance's proprietary database, are provided for the benefit of the media, and are not to be used in part or in full for any commercial or technical purpose without written permission from Brand Finance. Home » Press Releases » Apple clinches top spot as world’s most valuable brand, outshining Amazon, Google, and Microsoft We use necessary cookies to make our site work. We'd also like to set optional analytics cookies to help us improve it. By clicking “Accept”, you consent to the use of all the cookies. "
}