{
    "title": "Microsoft briefly stole Apple's crown as the world's most valuable company",
    "date": "1/11/2024",
    "url": "https://siliconangle.com/2024/01/11/microsoft-briefly-stole-apples-crown-worlds-valuable-company/",
    "text": "UPDATED 18:51 EDT / JANUARY 11 2024 by \nMike Wheatley Microsoft Corp. briefly overtook Apple Inc. as the most valuable company in the world in intraday trading Thursday, only to lose the crown about two hours later. It was the first time in more than two years that the Redmond-based firm surpassed the iPhone maker. Shares of Microsoft rose by 1.6% at one point in trading today, giving the company a market capitalization of $2.875 trillion, Reuters reported. Investors have been slowly pushing the company’s stock price upwards in recent months as a result of its early lead in generative artificial intelligence. At the same time, Apple’s stock dipped 0.9% to a market cap of just $2.871 trillion, the first time since 2021 that its value has fallen below Microsoft’s. The crossover occurred at about 9:50 a.m. EST, shortly after the market opened, and reversed itself around 11:10 a.m. EST. Microsoft ended the day with its market cap sitting at $2.859 trillion, while Apple was worth $2.886 trillion. D.A. Davidson analyst Gil Luria told Reuters it was “inevitable” that Microsoft would catch Apple, since the company has been growing much faster. He added that the company “has more to benefit from the generative AI revolution.” Apple’s stock has been hit by a series of rating downgrades that have fanned concerns that sales of its flagship iPhone, which remains its biggest revenue source, could remain weak, especially in China, one of its key markets. The brokerage Redburn Atlantic said in a client note Wednesday that “China could be a drag on performance over the coming years.” It warned of competition from a resurgent Huawei Technologies Co. Ltd. and the broader Sino-U.S. tensions that have increased the pressure on Apple. According to Redburn, Apple’s services business, which has been one of its fastest growing segments in recent quarters, is also facing threats as regulators scrutinize a recent deal that has made Google become the default search engine on all iOS devices. Shares of Apple, which hit an all-time high market cap of $3.081 trillion last month, gained 48% over the last year. But Microsoft has grown faster, its stock rising 57% over the same period, thanks in part to its aggressive rollout of generative AI-powered tools in its Windows and Office suites. Microsoft is widely perceived as one of the leaders in generative AI thanks to its close association with ChatGPT creator OpenAI. Microsoft last surpassed Apple as the highest valued company in 2021, when concerns over supply chains at the height of the COVID-19 pandemic caused the iPhone maker’s stock to slide. Although Apple managed to claw back its crown before the day’s regular trading session closed, it could well struggle to hold onto it. Wall Street analysts are generally more positive on the Windows software maker, which has no “sell” rating. Almost 90% of brokerages that cover the company recommend buying its stock, Reuters reported. In contrast, Apple has two “sell” ratings and just two-thirds of the analysts that cover the company currently rate its stock as a “buy.” That said, both stocks seem quite overpriced when compared to their expected earnings, which is a common method for evaluating the worth of publicly traded companies, Reuters said. Microsoft is trading at 31 times forward earnings, above its 10-year average of 24, while Apple’s stock is trading at 28 times, much higher than its average of 19 over the past decade. THANK YOU Resonance launches ‘full-spectrum’ cybersecurity platform for Web3 projects Oracle boosts gen AI support in its Fusion Cloud suite Anthropic releases affordable, high-speed Claude 3 Haiku model Beyond the code: The role of intelligent infrastructure in next-gen applications How knowledge graphs are shaping the future of AI and cloud computing Harnessing generative AI for global profit growth: CalypsoAI's approach Resonance launches ‘full-spectrum’ cybersecurity platform for Web3 projects BLOCKCHAIN - BY KYT DOTSON . 2 HOURS AGO Oracle boosts gen AI support in its Fusion Cloud suite AI - BY PAUL GILLIN . 2 HOURS AGO Anthropic releases affordable, high-speed Claude 3 Haiku model AI - BY KYT DOTSON . 3 HOURS AGO Beyond the code: The role of intelligent infrastructure in next-gen applications AI - BY ALICE GILLIN . 3 HOURS AGO How knowledge graphs are shaping the future of AI and cloud computing AI - BY RYAN STEVENS . 4 HOURS AGO Harnessing generative AI for global profit growth: CalypsoAI's approach AI - BY SEAD FADILPASIC . 4 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}