{
    "title": "NVDA Stock Alert: Nvidia Surges to $2 Trillion Valuation",
    "date": "2/23/2024",
    "url": "https://investorplace.com/2024/02/nvda-stock-alert-nvidia-surges-to-2-trillion-valuation/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Is the next stop $3 trillion for NVDA stock? Advertisement Source: FP Creative / Shutterstock.com There aren’t any hotter stocks in the market right now than Nvidia (NASDAQ:NVDA). Today, shares of NVDA stock hit another all-time high, with the company briefly surpassing $2 trillion in market capitalization in early morning trading. At the time of writing, NVDA stock has once again passed the $2 trillion mark and appears to be heading higher. For investors in this high-performance chip maker, this rally has truly been incredible. Some investors may indeed be keen on holding their position for an extended period. And such a view makes sense if one believes that the artificial intelligence (AI) growth drivers propelling Nvidia’s recent earnings beat will remain strong for years. Even at this current market capitalization, NVDA stock trades at only 33 times forward earnings. This is largely a function of how profitable its core high-performance chip business is. But it also begs the question — if revenue and earnings growth continue to accelerate, could Nvidia actually be a bargain at this level? Let’s dive into whether Nvidia could be poised for even higher highs moving forward. Currently, there are only four companies in the world trading at market capitalizations above $2 trillion. And with Saudi Aramco’s valuation only slightly higher than Nvidia’s, it’s possible that Nvidia could be challenging Apple (NASDAQ:AAPL) and Microsoft (NASDAQ:MSFT) for the top spot around $3 trillion, if this momentum continues. Indeed, such a move toward $3 trillion would imply around 50% upside from current levels. And considering NVDA stock is already up more than 60% year to date, such a move wouldn’t be out of the question. The company’s forward multiple isn’t stretched for a company growing at this brisk of a pace. In fact, there are a growing number of investors who now believe Nvidia is a relatively cheap hypergrowth name on a PEG (price-to-earnings-to-growth) basis. That thesis is valid and has been proven correct by Nvidia’s recent earnings beats. However, the bar is now set extremely high for Nvidia. We’ll have to see how many more quarters the company can pole-vault over expectations. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Technology, Artificial Intelligence   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/nvda-stock-alert-nvidia-surges-to-2-trillion-valuation/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}