{
    "title": null,
    "date": "2/20/2024",
    "url": "https://9to5mac.com/2024/02/20/apple-maps-uk-project-new-data/",
    "text": "Apple is about to begin a big update to Apple Maps in the UK. The company revealed its plans to iMore on Tuesday, saying that it is kickstarting an eight-month project in the UK to collect new data and imagery to improve the Apple Maps experience in the country. You can see more information about Apple’s data collection plans for Apple Maps on its website. The report explains that this project will include data collection via Apple vehicles as well as people wearing Apple backpacks: Starting February 21, UK residents will see Apple vehicles driving around the country for the next eight months gathering information as part of the company’s ongoing rebuild of Apple Maps, the company confirmed to iMore on Tuesday. Apple’s vehicles will gather information through October 17, and from May 20 through September 11, you’ll also see people wearing Apple backpacks walking the streets of Birmingham, London, and Manchester. The company says that the data gathered by its cars and pedestrians will allow Apple to maintain its UK Maps experiences with improved navigation, better detail, and more accurate place information. ”Apple is conducting ground surveys with vehicles around the world to collect data to improve Apple Maps and to support the Look Around feature. Vehicle surveys may use equipment mounted on the outside of vehicles as well as iPhones, iPads, or other devices inside of vehicles,” Apple said in a statement. Apple first launched its in-house mapping data in the United Kingdom and Ireland back in 2020, offering more detailed cartography and building shapes, more accurate navigation and Google Street View-esque ‘Look Around’ views in select cities. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Apple Maps is Apple's map application that's pre… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}