{
    "title": "Apple to settle trade secrets lawsuit with chip startup Rivos",
    "date": "2/10/2024",
    "url": "https://9to5mac.com/2024/02/10/apple-settle-trade-secrets-lawsuit-rivos/",
    "text": "Apple has decided to settle with the chip startup Rivos, two years after first suing the company for stealing trade secrets. According to a filing released on Friday, Rivos and Apple informed a judge that they are planning to finalize a settlement by March 15. Apple sued the “stealth-mode” startup in May 2022, accusing Rivos of poaching engineers with access to secret company information. Apple’s lawsuit claimed that former employees stole proprietary information at the request of Rivos as part of the recruiting process. “Starting in June 2021, Rivos began a coordinated campaign to target Apple employees with access to Apple proprietary and trade secret information about Apple’s SoC designs,” Apple says in the complaint. According to Apple, the engineers stole “gigabytes of sensitive System-on-a-Chip specifications and design files.” Rivos then fired back with its own lawsuit against Apple in September 2023, accusing it of using intimidation and other tactics to deter its engineers from leaving. In a filing spotted by Bloomberg on Friday, Apple and Rivos said that they plan to settle the lawsuit and are working towards finalizing their agreement now: “The agreement provides for remediation of Apple confidential information based on a forensic examination of Rivos systems and other activities,” according to the filing in federal court in San Jose, California. “The parties currently are working through that process.” In April 2023, Apple quietly withdrew a lawsuit it filed against former executive Gerard Williams III, who was described as critical to the development of the high-performance A-series and M-series Apple Silicon chips. Williams had left Apple in 2019 to start a server chip startup Nuvia, which was acquired by Qualcomm in 2021. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}