{
    "title": null,
    "date": "2/28/2024",
    "url": "https://www.zacks.com/stock/news/2233013/will-apple-etfs-gain-momentum-after-announcement-of-ai-project",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Sanghamitra Saha\nFebruary 28, 2024 AAPL Quick QuoteAAPL XLK Quick QuoteXLK FTEC Quick QuoteFTEC IYW Quick QuoteIYW VGT Quick QuoteVGT Better trading starts here. You follow ETF News and Commentary - edit You follow Sanghamitra Saha - edit Sanghamitra Saha ETF News and Commentary Apple Inc. (AAPL Quick QuoteAAPL  -  Free Report)     has decided to cancel its ambitious project to build an electric car, marking the end of a decade-long effort that aimed to revolutionize the automotive industry. The decision was disclosed internally on Feb 27, 2024, surprising the nearly 2,000 employees dedicated to the project, per Bloomberg. Chief Operating Officer Jeff Williams and Vice President Kevin Lynch informed the team that the project, known as Project Titan, would begin winding down. The decision to cancel the project reflects challenges in the electric vehicle market, including slowing sales growth and competition. Other automakers are pivoting to hybrid vehicles, and Tesla has warned of slower expansion. By not entering the automotive manufacturing industry, Apple can further develop its CarPlay software, enhancing integration with vehicle controls and entertainment systems. Focusing on AI aligns with long-term profitability potential. Many employees from the car team will be transitioned to Apple's artificial intelligence division as the space is red-hot and is thriving with expansion plans by various tech giants. Apple’s car project’s employees will now focus on generative AI projects. Apple shares rose 23.9% in the past one year, making it the second-lowest performer among the 'Magnificent Seven,' only after another EV giant, Tesla (TSLA), which fell 2.9%. In contrast, the stocks heavily associated with AI hype – Microsoft (up 63.4%), Alphabet (up 55.2%), Nvidia (up 239%), Meta (up 178.4%), Amazon (up 84.2%) – surged much higher than Apple in the past one year. The variance in AI investments probably made this difference in performance. Hence, with Apple also joining the AI league full-fledged, there is a chance of a rally in Apple shares. Investors should note that generative artificial intelligence is expected to deliver at least $6.1 trillion in incremental value to the global economy annually, according to McKinsey & Company. Artificial intelligence (AI) continues to revolutionize the broader industry. About 177 companies within the S&P 500 cited “AI” during their last quarterly earnings call, per the factsheet (read: A New Artificial Intelligence ETF (WISE) Hits the Market). Investors reacted positively to the news, with Apple's stock climbing after the announcement. Apple shares were up 0.8% on Feb 27, and added 0.2% after hours. The decision relieved concerns and signaled a winning strategic shift for the company. Based on short-term price targets offered by 26 analysts, the average price target for Apple comes to $207.56. The forecasts range from a low of $158.00 to a high of $250.00. The average price target represents an increase of 14.57% from the last closing price of $181.16. Currently, Apple has an upbeat growth score of A but the stock lacks value and momentum. We may see an upward price target revision in the near term, to reflect Apple’s latest decision to move to AI. The Zacks Rank #3 (Hold) Apple currently has an average brokerage recommendation (ABR) of 1.80 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 28 brokerage firms. The current ABR compares to an ABR of 1.80 a month ago based on 28 recommendations. Of the 28 recommendations deriving the current ABR, 16 are Strong Buy and three are Buy. Strong Buy and Buy respectively account for 57.14% and 10.71% of all recommendations. A month ago, Strong Buy made up 57.14%, while Buy represented 10.71%. Investors intending to play Apple’s AI move but still wary of Apple shares’ slowing momentum may take the ETF route. This is because ETFs helps investors to mitigate one company’s average performance with the other companies’ stellar results. Many of Apple ETFs contain the better AI player Microsoft in their kitty. Hence, the ETF route offers investors a more comprehensive way to leverage the latest AI craze. Below we highlight a few ETFs with heavy exposure to Apple for investors seeking to bet on the stock with much lower risk. Vanguard Information Technology ETF (VGT Quick QuoteVGT  -  Free Report)     – AAPL occupies the first location with 20.22% weight. The fund has a Zacks Rank #1 (Strong Buy). Select Sector SPDR Technology ETF (XLK Quick QuoteXLK  -  Free Report)     – AAPL holds the second spot with 19.48% weight. The fund has a Zacks Rank #1. iShares Dow Jones US Technology ETF (IYW Quick QuoteIYW  -  Free Report)     – AAPL takes the second spot with 17.49% weight. The fund has a Zacks Rank #1. Fidelity MSCI Information Technology Index ETF (FTEC Quick QuoteFTEC  -  Free Report)     – AAPL takes the second spot with 19.31% weight. The fund has a Zacks Rank #1. Apple Inc. (AAPL) - free report >> Technology Select Sector SPDR ETF (XLK) - free report >> Fidelity MSCI Information Technology Index ETF (FTEC) - free report >> iShares U.S. Technology ETF (IYW) - free report >> Vanguard Information Technology ETF (VGT) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days. See our report's 7 new picks today - it's really free! Privacy Policy   |   No cost, no obligation to buy anything ever. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}