{
    "title": "Steve Jobs once said the best managers don't want to manage people",
    "date": "2/26/2024",
    "url": "https://www.businessinsider.com/steve-jobs-said-best-managers-dont-want-to-manage-people-2024-2",
    "text": "       Steve Jobs once shared some advice about the best managers: He said they're usually people who don't necessarily want to be managers. Jobs said in a 1985 interview that when he and Apple's other cofounders realized that it was going to be a big company, they hired professional managers. \"It didn't work at all,\" Jobs said in the interview. \"Most of them were bozos. They knew how to manage, but they didn't know how to do anything. And so if you're a great person, why do you wanna work for somebody you can't learn anything from?\" Related stories Jobs said that the people who are really great at their jobs make the best managers. \"They're the great individual contributors who never ever want to be a manager but decide they have to be a manager because no one else is going to be able to do as good a job as them,\" he said. Jobs said that leadership is about having a vision that you can articulate to others and get a \"consensus\" on that idea. \"We wanted people that were insanely great at what they did but were not necessarily those seasoned professionals, but who had at the tips of their fingers and in their passion, the latest understanding of where technology was and what we could do with that technology.\" Jobs cofounded Apple alongside Steve Wozniak and Ronald Wayne in 1976. He died from pancreatic cancer in 2011. The visionary leader would have turned 69 on February 24. Although Apple's massive success can be attributed to Job's vision and leadership style, this recruitment strategy is contested. The practice of promoting high-performing employees into managerial positions that they might not be properly equipped for — and subsequently fail at — is referred to as the \"Peter principle.\" Laurence J. Peter, a Canadian sociologist, observed that as high-performing employees get promoted and progress through organizations, they're often considered top talent for managerial positions. However, without proper training and guidance, those employees may not actually have the skills to be good managers and become incompetent in their roles. Read next Jump to "
}