{
    "title": "With Antitrust Theory, It’s One Bad Idea After Another",
    "date": "2/27/2024",
    "url": "https://www.forbes.com/sites/johntamny/2024/02/27/with-antitrust-theory-its-one-bad-idea-after-another/",
    "text": "“Politicians in both parties broadly agree that a handful of tech companies hold too much power.” Those are the words of former U.S. attorney general, William P. Barr, from an opinion piece published in the Wall Street Journal. That they won’t age well is a waste of words, but online writing allows for a little bit of waste. Unfortunately for Barr, but happily for the rest of us, truth isn’t arrived at by counting heads. Time was when most politicians “in both parties” felt AOL was so dominant that its tie-up with Time Warner\nTWX\n had to be delayed so that the combined entity wouldn’t control all of 21st century communication and entertainment. Missed by those formerly fearful of AOL, along with the Apple\nAAPL\n-fearful Barr, is that when politicians and government types more broadly stare at the commercial present, they’re unwittingly staring at the past. This is worth keeping in mind as Barr writes with a certitude so common to those in the sheltered-from-market-realities political class, that “Keeping markets free requires confronting anticompetitive abuses.” Unbeknownst to Barr is that actual or would-be competitive businesses, including Apple, would give anything to know just which business tactics and strategies are “anticompetitive” as a way of at least trying to remain relevant in the commercial arena. Except that they don’t know. Barr’s analysis imagines that tomorrow is a known, when in reality it couldn’t be more uncertain. The latter explains why Microsoft’s\nMSFT\n mistakes while Bill Gates ran the company vastly outnumbered the correct speculations about what was ahead. Figure that Microsoft was late on the internet, smartphones, social media, not to mention various errant products including Zune. What’s true for Microsoft has also proven true for Amazon\nAMZN\n. If we ignore how long it took the powers-that-be to take a company formerly headquartered around porn and pawn shops seriously, we can’t forget that Jeff Bezos long yearned for just a few successful ideas in order to fund the inevitable bad ones that would well outnumber the good. The digression into Microsoft and Amazon is necessary as a corrective to Barr’s rather arrogant presumption that “power” in the marketplace has permanent qualities, along with his similarly arrogant presumption about anticompetitive actions. The former imagines that the business present constitutes the frontier of progress, while the latter imagines that businesses operate with certainty about what consumers will want tomorrow. Except that they don’t know these things. That’s why Apple, Amazon, Microsoft and every other technology company with “too much power” is aggressively investing tens of billions annually in new ideas and unknown companies. The copious investment is a signal that they very much want to be competitive in the future, but quite unlike Barr, they’re much less than sure about what will make them competitive. To understand the above better, consider Barr’s odd lament that “More than half of the mobile devices in the U.S. are apple devices.” If we forget that he should be celebrating Apple’s remarkable success in the 21st century marketplace after nearly going bankrupt as the 20th century closed, we can’t ignore how unlikely Apple’s success with the iPhone was. Looking back to 2007 when the first iPhone was released, ahead of it then-Microsoft CEO Steve Ballmer scoffed. In his words about the iPhone, “Five hundred dollars? Fully subsidized? With a plan? I said that’s the most expensive phone in the world and it doesn’t appeal to business customers because it doesn’t have a keyboard, which makes it not a very good e-mail machine.” What about RIM/Blackberry, the at-the-time king of mobile devices? When asked to address Apple’s smartphone in 2007, RIM/Blackberry CEO Jim Balsilie calmly responded that “The recent launch of Apple’s iPhone does not pose a threat to Research In Motion Ltd.’s consumer-geared BlackBerry Pearl and simply marks the entry of yet another competitor into the smartphone market.” Hopefully readers see where this is going in the way that Barr seemingly does not. The very idea of “anticompetitive abuses” that Barr writes about is rooted in the impossible notion that Barr can see into the future in the way that businesses plainly cannot. Which brings us to a close. It was on July 3, 2016 that the U.S. Senate finally switched from buying RIM/Blackberry devices to iPhone and Android models. Stop and think about that, but please don’t be surprised that it took government years and years to catch up to the marketplace. Which is why Barr’s fear of Apple shouldn’t surprise us, while at the same time reminding us just how detached his analysis is from market realities. No, Apple does not violate antitrust law.  "
}