{
    "title": "Apple readying to launch AI tool for app developers: Report",
    "date": "2/16/2024",
    "url": "https://finance.yahoo.com/video/apple-readying-launch-ai-tool-150832993.html",
    "text": "Apple (AAPL) is working on a new artificial intelligence tool to help app developers work more efficiently, according to a report from Bloomberg. The tool would help Apple take on rival tech giant Microsoft (MSFT), which has its own platform, GitHub Copilot. Yahoo Finance's Madison Mills and Rachelle Akuffo break down the story. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich MADISON MILLS: Time now for our stock to watch, focusing on Apple doubling down on AI, reportedly looking to compete the next-- and complete the next version of its programming software Xcode and release it to third party software makers as early as this year. And that's according to a scoop from \"Bloomberg News.\" We see that moving up, Apple, even though it was in the red after the close yesterday, Rachelle. And what's interesting to me about this, is it seems like Apple is betting on making money from the developer side, providing this code-driven software to folks who maybe want to use it to develop apps for the App Store. Meanwhile, you have Microsoft focusing more so on AI-driven technology that will be embedded in phones the consumers will use. So I'm curious to see which of those two strategies is going to be the most financially viable one, but certainly looking good for Apple in the trade so far this morning, which is up and beating Microsoft in the early trade. RACHELLE AKUFFO: True. I think people were wondering what's going to be that next big push that we see from Apple in AI. We know that when OpenAI was pushing ahead, people were like, why aren't we hearing more from the Apple camp here? But yes, they're supposedly-- they're reportedly going to have been working on, for about a year, this software tool for app developers that will compete with Microsoft's GitHub Copilot, also ramping up development in-house, working on a tool to generate code for testing applications. That's something that they're still doing in-house. But it would coincide nicely with the new version of their flagship programming software Xcode, which is supposed to be coming out this year. Perhaps we will see it at the Developers Conference in June. Obviously, time ticking, June not that far away. But I think this might be that moment that people have been waiting for it to really see Apple step up in this space. MADISON MILLS: Right. It feels like Apple let's the other guys play in the playground for a little bit. And then they come out and say, well, now, we've got the thing that everyone's going to want. They tend to do that. And it works out for them. So to your point, we'll see in June if it does. RACHELLE AKUFFO: That's true. We had mobile phones before the iPhone, and now, look. MADISON MILLS: Right. Exactly. Exactly. Look at that. Related Quotes "
}