{
    "title": "Apple Stock Near 4-Month Low As AI Questions Linger",
    "date": "2/29/2024",
    "url": "https://www.forbes.com/sites/dereksaul/2024/02/29/apple-stock-near-4-month-low-as-ai-questions-linger/",
    "text": "Shares of Apple dipped Thursday to their lowest closing share price in almost four months, marking an uneasy stretch for the stock as investors hitch their wagons to Apple’s big technology peers who appear more readily positioned to capitalize on the artificial intelligence boom. Apple stock is amid a dim stretch. Apple stock fell about 1% to below $180 for the first time since Nov. 7, moving against solid gains by the S&P 500 and tech-heavy Nasdaq indexes, while shares of each of the five other companies in the $1 trillion market capitalization club gained 0.7% or more Thursday. The slip comes as questions linger about Apple’s AI initiatives as the likes of Microsoft deliver tangible earnings growth tied to the burgeoning technology, underscored by a Tuesday report that Apple is abandoning its decade-long electric car project – an undertaking Apple CEO Tim Cook dubbed the “mother of all AI projects” in 2017. Apple shares have fallen 3% over the first two months of 2024, far short of the S&P and Nasdaq’s 7% and 9% respective gains. Long heralded for its market-beating returns, Apple has provided a worse return to investors than the S&P on a 6-month, 12-month and 2-year basis, according to FactSet data. Apple represents a wildly successful investment on a longer-term basis, as its nearly 36% annualized total return over the last two decades far outpaces the S&P’s 10% annual return. Apple, which was the world’s most valuable company by market cap for most of 2021 to 2023, ceded its most valuable crown to Microsoft in January. The changing of the guard comes as Microsoft’s top-line and bottom-line growth far outpaces Apple’s, which reported negative sales and profit growth during its fiscal year ending in September. Cook teased at a Wednesday shareholder meeting Apple is “investing significantly” in generative AI and will have more details on its initiatives later this year. UBS analyst David Vogt said this week he expects Apple to roll out its first major AI announcement in June at the company’s Worldwide Developers Conference. In addition to AI headwinds, expectations over weak iPhone sales growth cloud Apple’s stock; iPhone sales accounted for 58% of Apple’s total revenues last quarter. Apple’s wind down of its EV project is actually a “net positive” as it allows the firm to rededicate its talent to generative AI products more likely to hit the market and demonstrates Apple’s “cost discipline,” Morgan Stanley analysts led by Erik Woodring wrote to clients earlier this week. Not So Magnificent Seven: Big Tech Stocks That Led 2023's Rally Are On Different Trajectories (Forbes) Apple Is Behind in AI—and Investors Are Getting Impatient (Wall Street Journal)  "
}