{
    "title": "YouTube Confirms Vision Pro App In Development, Still No Signs Of Netflix \nAnd Spotify Though",
    "date": "2/6/2024",
    "url": "https://www.tradingview.com/news/benzinga:cd36d7f4f094b:0-youtube-confirms-vision-pro-app-in-development-still-no-signs-of-netflix-and-spotify-though/",
    "text": "In a recent development, YouTube GOOGL has confirmed that a Vision Pro app is in the works for Apple‘s AAPL Vision Pro VR headset. What Happened: YouTube officially acknowledged the development of a Vision Pro app, as per a report by The Verge. This comes after YouTube, Spotify, and Netflix initially refused to allow their iPad apps to run on the Vision Pro. There was no mention of a dedicated visionOS YouTube app in the future. The sudden change in plans is speculated to be linked to the popularity of the Juno app for YouTube on the Vision Pro. YouTube spokesperson Jessica Gibby confirmed the news: “We do not have any specific plans to share at this time, but we can confirm that a Vision Pro app is on our roadmap.” See Also: Mark Zuckerberg ‘Just Getting Started,’ Says Ives. Munster Says ‘Not Too Late’ To Buy Meta It remains unclear when the app will be launched and what features it will include. YouTube has not yet responded to queries about whether the app will support VR and 360 videos on the Vision Pro. Why It Matters: The news of YouTube’s Vision Pro app comes after both Netflix and Spotify decided not to launch their apps on Apple’s Vision Pro. This decision was announced in January, with users being directed to access the content via a web browser as the iPad app would not run on the device. Apple’s Vision Pro headset has been receiving significant attention, with the sales numbers exceeding expectations. The headset’s first-weekend sale was estimated to be more than double what was expected, with close to 180,000 units sold over the weekend. This impressive launch was attributed to the “better than expected” pre-orders, as tech analyst Ming-Chi Kuo stated. Read Next: From Meta, Microsoft And Other Tech Titans Uniting Against Apple To Elon Musk Mocking Vision Pro: Your Weekend Appleverse Recap Photo courtesy: Apple Engineered by Benzinga Neuro, Edited by Pooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @notfundamental @johndollery @bullfxmib_official @nicolasvolume @sabaisabai_fx @javier.vasquezpalacios @milagnes @nasdaq.forex @jake_ofalltrades13 @tradingview @TradingView @rajpalgore @itspatrickspencer_ @thetradingfield @bradfairbridge @_ntokozo_sa @voyager_far_and_wide @alberto_fabio23 Whatever the trade "
}