{
    "title": null,
    "date": "1/6/2024",
    "url": "https://seekingalpha.com/news/4052731-apple-megafan-dan-ives-is-ubiquitous-that-doesnt-mean-he-doesnt-take-his-job-seriously",
    "text": "Lobro78/iStock Editorial via Getty Images Dan Ives started picking stocks in high school during the capitalism-frenzied decade of the 1980s. His parents constantly talked about equities, and he read The Wall Street Journal religiously, even though prices were at times, days out of date. Among his first buys were GE (GE) and US Air (AAL), the latter of which didn't do so well. \"I learned at an early age you can pick winners and you can also lose money,\" Ives said in an interview with Seeking Alpha. \"But even when I lost money it was exciting.\" The Long Island native was also passionate about technology, and just as the internet was exploding in the late 1990s, he got into equity research. Today, Ives is one of Wall Street's most prominent tech analysts, and a major bull on Apple (NASDAQ:AAPL), Microsoft (NASDAQ:MSFT) and Google (GOOG) (GOOGL), among others. The managing director of equity research at Wedbush Securities is ubiquitous throughout Seeking Alpha, CNBC and Bloomberg, among other venues. While he doesn't always make the right call, he has conviction and a preternatural ability to translate analyst gobbledygook into plain English, which helps drive his popularity, even if naysayers sometimes gang up on him.  For Ives though, it's more than just a job. \"We feel a responsibility to handhold investors through the ups and downs of the tech market,\" Ives, aged 49, said in a phone interview. \"We’re needed most when things are falling apart. When I go to the depths of Covid in March [and] April 2020, that’s where we handheld clients and tech investors through an unprecedented time… Our view back then was to basically buy techs stocks and it’s gonna be short lived and these were golden opportunities.\" It proved to be a good call. Since March 2020, Apple (AAPL) and Microsoft (MSFT) are up more than 200% while Google (GOOG) (GOOGL) has gained more than 150%. This is not to say Ives and his team are perfect. The analyst significantly underestimated hurdles in FireEye's acquisition of Mandiant about 10 years ago. FireEye shares sold off sharply, something he hadn't anticipated. \"We vowed we were going to learn from that experience and that was going to make us better,\" Ives said. \"You have to use your failures as opportunities to get better.\"  Ives is a public figure, and he owns it when he's wrong, Mark Freed, a venture capitalist and friend of Ives for more than two decades when the pair attended Penn State together, said. They share a love of Penn State athletics, season tickets for football games and talk frequently. \"Given he is in the business of looking forward, he accepts and owns being wrong and is always guiding the recipient of his conviction towards looking ahead versus looking backward,\" Freed said in an interview. \"If you think about it, there's nothing that can be done about what happened yesterday so what people want to hear from him is what's going to happen next.\" It's his ability to relate to anyone that is part of his success, Freed said. People may disagree with his views, but \"you won't find a person that will have a negative or disparaging thing to say about Dan. He's prepared, he's passionate, he has conviction and he connects well with everyone.\" To Wedbush colleague Taz Koujalgi, part of Ives's success comes from how broad his view is. While most Wall Street analysts hone in on their own sectors, Ives looks at the bigger picture. Though he officially covers software names, he also pays attention to Tesla's (TSLA) automotive business and Apple's hardware business. \"He can tie in a lot of those things and his perspective is a lot broader and more holistic,\" Koujalgi said in a phone interview this week. \"I am amazed by how much he can cover, the way he can combine what he is seeing in the Apple supply chain ecosystem and how that impacts the world of software… We all make a mistake just looking at what's happening in our own sector and ignoring what's happening outside.\"  Koujalgi — who speaks with Ives some 10 times a day or more — now looks beyond the software industry that he also covers and into semiconductors and hardware, among others, to incorporate different data points. He also admires Ives's collaborative nature and lack of back-stabbing behavior, which can be prevalent on Wall Street. Ives, who often paints a distinctly non-Wall Street vibe with his pastel pink and turquoise jackets and plaids, has naysayers, of course, like the following Seeking Alpha subscribers who commented last month on stories featuring the analyst. WealthWise.dca, in response to Ives saying Apple will go to $4T: \"Dan is so bullish, it makes me wanna go bearish.\" Nate311 on Ives's wish list for 2024: \"[Ives] understands apple as few analysts do (munster is another) but $4T seems unrealistic.\" Jamiemcdaniel on Microsoft's AI bet not being priced in: \"With any analysis by Dan 'super-mega-tech-bull' Ives, all risks are always priced in and the market is ignoring the many incredible practically guaranteed positives that only he and the company CEO so clearly sees.\" To which combatcorpsmanVN responded: \"@jamiemcdaniel You can criticize all you want, but Ives has been spot on regarding Microsoft and Apple and other tech stocks. Instead of criticizing him, you should listen to him you’d make some money.\" Among what Ives thinks are his biggest successes include calling the Microsoft has undergone under Satya Nadella. The stock is up 10 times since Nadella became Chief Executive in February 2014, Ives said. On Apple, which he thinks will hit $4T this year, Ives understands the criticism that the company has been lacking in innovation since Steve Jobs died. \"What investors have underestimated is the pure breadth of Apple's installed base which is 2 billion iOS devices, and their ability to monetize,\" Ives said. \"Investors who are so focused on valuation can’t see forest through the trees.\" Ives is excited to keep covering tech, as artificial intelligence is causing the industry to go at 90 miles per hour in a Ferrari — while the regulatory environment goes at 25 miles per hour. \"The new tech bull market has begun, and is being led by AI,\" Ives said. \"This is just the start of a decade-long trend.\" "
}