{
    "title": "Here's How Much Apple CEO Tim Cook Got As Salary In 2023",
    "date": "1/13/2024",
    "url": "https://www.news18.com/tech/heres-how-much-apple-ceo-tim-cook-got-as-salary-in-2023-8738337.html",
    "text": "Curated By:  Shaurya Sharma News18.com Last Updated: January 13, 2024, 08:48 IST Cupertino, California, USA Tim Cook takes home hefty pay check every year. Have you ever thought about how much Tim Cook makes as the CEO of Apple? Given the immense responsibility he has, it’s a fair question. Cook has been instrumental in shaping the company’s business since Steve Jobs passed away, putting him in a rare league of CEOs. Tim Cook took home a hefty $63.2 million (about Rs 523 crore) in compensation for the fiscal year 2023. That’s a lot of money, but it’s actually less than what he made in 2022. Why? Well, it was intentional. Cook requested a 40% reduction in his total compensation after receiving a recommendation from Apple’s compensation committee. ALSO READ: Tech Layoffs 2024 – Google, Amazon, & More Let Go of Hundreds; Startups Downsizing Too According to a report by The Hollywood Reporter via AppleInsider, Apple’s recent filing with the Securities and Exchange Commission (SEC) revealed that Tim Cook earned a base salary of $3 million, stock awards of $47 million, non-equity incentive compensation of $10.7 million, and other compensation of $2.5 million. In comparison, Cook earned a total of $99.4 million in the fiscal year 2022, despite his base salary remaining the same at $3 million. The difference in compensation is due to the stock awards, which totaled $83 million, as well as non-equity incentive compensation of $12 million and other compensation of $1.4 million. If you’re curious about how much other CEOs, like Microsoft’s Satya Nadella, make, the numbers are pretty similar. Nadella made $48.5 million in 2023, according to The Register. But not all CEOs make the same amount. For example, Google CEO Sundar Pichai made a whopping $226 million in 2022, while Shantanu Narayen, Chairman and CEO, Adobe made $31 million in 2022. "
}