{
    "title": "Magnificent 7 Stocks: 3 to Sell Before They Lose Their Luster",
    "date": "1/23/2024",
    "url": "https://investorplace.com/2024/01/magnificent-7-stocks-3-to-sell-before-they-lose-their-luster/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. In 2024 the rally could end for these three stocks Advertisement Source: shutterstock.com/eamesBot The “Magnificent 7” stocks experienced a great rally in 2023. These tech giants were also the key reason why the S&P 500 and the Nasdaq Composite rose 43% and 24% last year, respectively. While many of the magnificent 7 stocks were largely safer bets amidst much of the macro-induced market volatility, chances are 2024 will not be the same. Below are the stocks of three, major tech giants that investors should consider dumping, at least for the short run. Not surprisingly, the iPhone maker’s stock had a good run in 2023, increasing nearly 50%. However, recent challenges related to its revenue growth in its key product lines have largely cast doubt on the company’s future growth prospects. Despite new iPhone and iPad releases, Apple’s (NASDAQ:AAPL) revenue growth remained unchanged, disappointing investors. The mobile handset market is at capacity. Consumer demand for smartphones is decreasing as they lose novelty with each iteration. Another reason investors should be wary of AAPL stock is the uncertainty of the China market, which accounted for about 19% of Apple’s revenue at the end of its fiscal year 2023. Huawei’s launch of the Mate 60 Pro led many Chinese consumers to favor it over the new iPhone amidst geopolitical tensions. According to a report by Bloomberg in late October, Apple’s iPhone 15 sales were still behind the predecessor, largely due to the resurgence of Huawei’s flagship device. Unless Apple pursues a broad and competent diversification strategy, investors should not hope for strong share price appreciation. All in all, it’s one of those stocks to sell. When OpenAI released ChatGPT earlier this year, a lot of market spectators, investors, and ordinary people marveled at the technology. Meanwhile, others wondered if Microsoft’s (NASDAQ:MSFT) billion-dollar investment in the startup was finally paying off. The computer software giant had initially invested $1 billion in OpenAI back in 2019, but its cumulative investment has swelled beyond $13 billion. There was also a lot of hope that ChatGPT would change the growth prospects for Microsoft’s Bing browser, but current numbers leave more to be desired. Last year, when Satya Nadella went to testify against Google’s anti-competitive, web browser practices, he noted that even the AI-powered ChatGPT has not been able to help Microsoft meaningfully break into the search browser market. He also denied artificial intelligence was leading to dramatic shifts in Microsoft’s market share. Microsoft’s stock last year rose 58%, and its market cap now is encroaching upon $3 trillion, higher than even that of Apple’s. If much of that share appreciation was related to the AI craze feeding into the market. Investors should be vigilant about when this hype will fizzle out. Tesla (NASDAQ:TSLA) is one of the dominant players in the global electric vehicle market. The automaker managed to beat estimates throughout 2023. In particular, Tesla’s quarterly earnings have come in above analysts’ estimates, and the price-cut strategy the automaker began to pursue in the beginning year has increased quarterly deliveries while also placing pressure on gross margins. However, even though Tesla may be a decent long-term bet if one is betting on the overall EV market, the stock may face some headwinds and seriously underperform throughout 2024. Delivery numbers for Q4 2023 were released in early January. Despite beating Wall Street’s estimates again, the automaker’s deliveries trailed behind Chinese competitor BYD (OTCMKTS:BYDDY). The question of whether Tesla will continue to be second place to BYD internationally will likely be on the minds of investors this year. If Tesla continues to underperform in that regard, the stock could lose much of its luster in 2024. On the date of publication, Tyrik Torres did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Tyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/magnificent-7-stocks-3-to-sell-before-they-lose-their-luster/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}