{
    "title": "Why the Apple share price climbed 54% in 2023",
    "date": "1/5/2024",
    "url": "https://www.fool.co.uk/2024/01/05/why-the-apple-share-price-climbed-54-in-2023/",
    "text": "Despite falling revenues and profits, the Apple share price surged 54% in 2023. What did investors see in Warren Buffett’s largest stock investment? The content of this article was relevant at the time of publishing. Circumstances change continuously and caution should therefore be exercised when relying upon any content contained within this article. Image source: Getty Images When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. Last year, the Apple (NASDAQ:AAPL) share price went from $125 at the start of January to $192 by the end of December. That’s an outstanding performance, but the stock has started to fall this year. In general, 2023 was a year of two major themes – pandemic trends unwinding and the rise of AI as an investing focus. But neither of these really accounts for Apple’s strong results. Its financial performance was somewhat mixed – both sales and net income were down by 2.8%. But a 3.14% reduction in the company’s share count meant earnings per share increased. Beneath the surface, though, things have been more interesting. Apple divides its revenues into those that come from selling products and those that involve providing services. In the second half of the year, revenues from the company’s services division grew to a record $21bn. This is significant – margins in this part of the business are much higher. To some extent, this helped offset declines in iPhone sales (which are the reason the stock is falling now). But it’s still hard to see how growth in the low-single-digits justifies a 54% share price increase. For Apple, 2023 was a year of two halves (the usual number of halves for a year to have, but you know what I mean). The stock surged during the first six months of the year, but has largely traded sidewise since. This indicates to me that stock market participants viewed Apple as a defensive position. Its strong balance sheet and competitive position attracted investor capital when the pressure was on. It’s also significant – in my view – that it underperformed other big tech stocks, including Alphabet, Microsoft, Meta Platforms, and Nvidia. I suspect the reason is AI. Apple is a little futher removed from the cutting edge of AI than other big tech companies. As a result, it didn’t get quite the same boost. A third issue for Apple has been US-China relations. This was noteworthy in 2023 and looks like an ongoing risk in the future. Apple relies on China in two main ways. The first is that it’s a big market and the second is that it’s where a lot of the company’s manufacturing base is. The stock slipped 5% in September as the Chinese government instructed officials not to bring their iPhones to work. And restrictions continued to spread through the rest of the year. In October, an investigation into Foxconn – a key iPhone supplier – caused the stock to falter further. Despite Apple’s attempts to diversify its manufacturing, investors should take note. Apple spent 2023 as a shelter for investors hiding from a potential storm. I think that’s a reasonable move, but it means the stock doesn’t really look like a bargain at today’s prices. I expect the ongoing share buyback programme to keep driving shareholder value. And the significance of the company’s intangible assets shouldn’t be underestimated. Even after a retreat in January, I have this as a stock to watch, rather than to buy at today’s prices. I’m an Apple shareholder, but I think there are better opportunities for me at the moment.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Stephen Wright has positions in Apple. The Motley Fool UK has recommended Alphabet, Apple, Meta Platforms, Microsoft, and Nvidia. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 25 March, 2024 | Sumayya Mansoor This Fool explains how passive income stocks can help to create an additional income stream and details two picks she… Read more » 25 March, 2024 | Royston Wild These FTSE 250 trusts are on sale right now! And Royston Wild thinks they may be great last-minute buys for… Read more » 25 March, 2024 | Royston Wild The Lloyds share price has rebounded sharply after a tough start to 2024. Can it keep going, or will the… Read more » 25 March, 2024 | Sumayya Mansoor I reckon this FTSE 100 has been going under the radar, and recently posted excellent full-year results. Should I buy… Read more » 25 March, 2024 | Mark Rogers Ice ideas will usually offer a steadier flow of income and is likely to be a slower-moving but more stable… Read more » 25 March, 2024 | Royston Wild I'm searching the London market for the best dividend stocks to buy for my portfolio. Here are two that currently… Read more » 25 March, 2024 | Alan Oscroft Upbeat FTSE 100 results have been coming in, and interest rates must surely fall this year. Investors could be smiling… Read more » 25 March, 2024 | Ben McPoland They say statisticians don't play the lottery for obvious reasons. Fortunately, Warren Buffett has shown us a great way of… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}