{
    "title": "Apple's decision to discount iPhones in China makes a statement",
    "date": "1/16/2024",
    "url": "https://www.marketwatch.com/story/apples-decision-to-discount-iphones-in-china-makes-a-statement-bf125d38",
    "text": "Apple Inc.’s management typically doesn’t offer commentary on its business outside of the four earnings calls it hosts each year. And even on those calls, executives can be fairly circumspect. But occasionally Apple \n        AAPL,\n        -0.52%\n       speaks with its actions, and that may be the case this week. Reports highlight that the company plans rare discounts in China on iPhones and MacBook Air computers during a Lunar New Year event. Some iPhone prices in China will fall by the equivalent of $70 during the sale, the New York Times noted. It’s not like Apple to discount its own products, but the company faces various pressures in China. For one, the local competition has stepped up its game. Huawei Technologies Co. Ltd., once hampered by sanctions, has become a more formidable rival, and China’s government seems keen to help the company out. Chinese officials reportedly have told some government workers that they can’t use iPhones for official business. China is also suffering from a period of deflation that could mean more broad pressure on U.S. companies that sell products in the country. Apple didn’t immediately respond to a MarketWatch request for comment on its latest pricing moves. Though Apple sales fell by more than 2% in Greater China during the company’s September quarter, Chief Executive Tim Cook sounded a more upbeat tone on the company’s last earnings call, saying that sales in the region would have been up if not for currency impacts. He added that the iPhone business set a new September-quarter revenue record in Greater China, while the Mac and iPad businesses faced tough comparisons to the prior-year period, just as they did in other regions. “I just took a trip over there and could not be more excited about the interactions I had with customers and employees and others,” Cook said on that November call. Trump Media & Technology Group completed a merger with a SPAC. Shares of the merged company rose 35% on Monday. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}