{
    "title": "Apple welcomes Opera One to iPhone as a part of EU’s Digital Markets Act",
    "date": "1/28/2024",
    "url": "https://www.financialexpress.com/life/technology-apple-welcomes-opera-one-to-iphone-as-a-part-of-eus-digital-markets-act-bkg-3377193/",
    "text": "The Financial Express Apple’s recent announcement about allowing iPhone users to choose third-party app stores and set their preferred default web browser, following the European Union’s Digital Markets Act, has led to Opera unveiling its AI-powered web browser called Opera One for iPhones. The browser, designed to comply with Apple’s new regulations, takes advantage of the freedom granted to users to switch from Safari to another browser. While Opera One is already available on Windows, it is set to bring a similar experience to iPhones, marking a significant shift in the Apple ecosystem within the EU. Opera One, as described by Opera, is an AI-centric web browser tailored to leverage Apple’s latest regulations. With the freedom for users to choose their default web browser, Opera. Notably, this development comes as a response to Apple’s compliance with the Digital Markets Act, allowing app-makers to develop web browsers without WebKit and integrate their custom technology, providing more flexibility for developers. In line with regulatory requirements, the AI-powered Opera One web browser will be exclusively operational in the European Union. Starting March 2024, iPhone users in the EU can download Opera One on devices running iOS 17.4 or newer versions. However, developers, especially those planning to use a non-WebKit engine like Opera One, will initially need Apple’s authorization for their apps/services. This requirement ensures compliance with Apple’s standards, emphasizing a balance between user choice and platform security. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}