{
    "title": "Apple slapped with second stock downgrade as Wall Street fears sagging \niPhone demand",
    "date": "1/4/2024",
    "url": "https://nypost.com/2024/01/04/business/apple-slapped-with-second-stock-downgrade-as-wall-street-fears-sagging-iphone-demand/",
    "text": "Submit Δ Thanks for contacting us. We've received your submission. Apple was slapped with its second major stock downgrade of the week on Thursday as fears mount on Wall Street about lukewarm demand for its flagship iPhone. Piper Sandler & Co. lowered its ratings for Apple’s stock to “neutral” from “overweight” on Thursday. The firm’s analysts, who had been bullish on Apple since March 2020, pointed to fears about a weakening economic environment in China, Bloomberg reported. “We are concerned about handset inventories,” analyst Harsh Kumar wrote in the note to clients. “Growth rates have peaked for unit sales.” Kumar also pointed to other signs of trouble, such as a disputed ban on the latest Apple Watch model due to alleged patent infringement, according to MarketWatch. Apple’s stock sank more than 1% to $181.91 on Thursday. Despite the downgrade, Piper Sandler still has a price target of $205 for Apple shares. Overall, Apple shares have plunged more than 5% since the start of the year. The stock slide has erased the equivalent of about $155 billion from the tech giant’s valuation, according to Bloomberg. The latest downgrade came just two days after analysts at Barclays reclassified Apple’s stock to “underweight” from “neutral” and lowered their price target for the company’s shares to $160, down from a previous target of $161. Barclays analysts said sales checks indicated softening demand for the iPhone in China and other developed markets. “Our checks remain negative on volumes and mix for iPhone 15, and we see no features or upgrades that are likely to make the iPhone 16 more compelling,” the Barclays analysts said. While Apple has increasingly focused on software services such as its Apple TV+ streaming platform to drive revenue, the company remains heavily reliant on the iPhone and other hardware to boost sales. Overall, the percentage of analysts who have bullish ratings on Apple’s stock has reached a three-year low, according to Bloomberg data. The market expects Apple’s revenue to grow just 3.6% in fiscal 2024. Wall Street has soured on Apple even after the company’s shares rose nearly 50% last year amidst a broader tech sector rally. The Cupertino, Calif.-based firm briefly became the first company in history to achieve a $3 trillion valuation. "
}