{
    "title": "Apple Vision Pro headset: Launch date, pricing unveiled",
    "date": "1/8/2024",
    "url": "https://www.foxbusiness.com/technology/apple-vision-pro-headset-launch-date-pricing-unveiled",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Circled Squared Investments founder Jeff Sica discusses whether Microsoft can take over Apple as the company with the biggest market cap on 'Varney & Co.' Apple on Monday said its Vision Pro augmented reality headset will hit the U.S. market on Feb. 2. The Apple Vision Pro, first unveiled last summer, will come with a starting price tag of $3,499, according to the tech giant. Apple said it will start pre-orders for the device on Jan. 19 ahead of its February debut. When the Vision Pro launches, Apple’s physical U.S. locations and online store will carry it. Apple Vision Pro with the dual loop band (Apple) CEO Tim Cook touted it as the \"most advanced consumer electronics device ever created\" and said the \"era of spatial computing has arrived.\" The Vision Pro \"blends digital content with the physical world and unlocks powerful spatial experiences in visionOS, controlled by the most natural and intuitive inputs possible – a user’s eyes, hands, and voice,\" the tech giant said. APPLE'S IOS 17.2 BRINGS JOURNALING-FOCUSED IPHONE APP AND OTHER FEATURES When wearing the headset, users can have a slew of apps displayed next to each other, something Apple said could help boost productivity. A woman wears an Apple Vision Pro headset. (Apple) Users can use the Vision Pro for entertainment purposes as well. SEC SIDES WITH ACTIVIST SHAREHOLDERS IN FIGHT WITH APPLE OVER FREE-SPEECH RESOLUTION Numerous existing games have compatibility with the headset on top of new \"spatial games\" that Apple said will specifically utilize the technology. For movies and television, the company said users would feel like they’re viewing the selection of Apple TV+, Disney+, Max and other available content for Vision Pro on a \"100 feet wide\" screen. Apple Inc. \"Where a user looks stays private while navigating Vision Pro, and eye tracking information is not shared with Apple, third-party apps, or websites,\" Apple said. It will offer Optic ID, which relies on the user’s iris, for security like locking and unlocking the device. A side view of the Apple Vision Pro (Apple) Customers will also get both a solo knit band and a dual loop band for wearing their headsets, according to Apple. APPLE WINS APPEAL TO TEMPORARILY PAUSE APPLE WATCH BAN The Vision Pro will become the latest device that the company has rolled out in the U.S. in recent months. It launched its slate of iPhone 15s, with prices ranging from $799 to $1,199 depending on the model, and its Apple Watch Series 9 in mid-September. In October, it unveiled new iterations of its iMac and MacBook Pro. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}