{
    "title": "Apple's iOS 18 to be the biggest update ever in iPhone history: Report",
    "date": "1/30/2024",
    "url": "https://www.techlusive.in/mobile-phones/apples-ios-18-to-be-the-biggest-update-ever-in-iphone-history-report-1456642/",
    "text": "Follow Us on Edited By: Om Gupta Published: Jan 30, 2024, 10:00 AM IST Apple is preparing to unveil its iOS 18 software update in June, which is expected to be the most significant and impressive overhaul of its mobile operating system in the company’s history, according to a report by Bloomberg’s Mark Gurman.\n\n\n\n\n\n\n READ MORE\nYou can finally record calls on iPhone, thanks to Truecaller Gurman, who is known for his reliable sources within Apple, wrote in his Power On newsletter that he was told that iOS 18 is seen as “one of the biggest iOS updates–if not the biggest–in the company’s history.” He added that this makes the upcoming Worldwide Developers Conference (WWDC) in June “pretty exciting.”\n\n\n\n\n\n\n READ MORE\nAmazon deals: Apple iPhone 15 gets Rs 9,000 discount The report follows Gurman’s earlier claim that Apple was aiming for iOS 18 to be its most “ambitious and compelling” update in years, with a focus on artificial intelligence (AI) and rich communication services (RCS).\n\n\n\n\n\n\n\n READ MORE\nHow to check Truecaller for a number during call on iPhone Some of the features that Gurman has previously reported for iOS 18 include: – A new version of Siri that uses a new AI system to improve its voice, understanding, and capabilities. – New features for the Messages app that enhance its ability to auto-complete sentences and answer questions. – New features for Apple Music that create personalized playlists based on the user’s preferences and listening history, similar to Spotify. – Generative AI integration into development tools like Xcode, which would enable developers to create new apps faster and easier. – Generative AI updates for productivity apps like Pages and Keynotes, which would allow users to create and edit documents more efficiently and creatively. Another major change that iOS 18 could bring is the support for RCS, which is a new standard for messaging that offers more features and functionality than the traditional SMS or MMS. Apple announced in November that it plans to adopt RCS on iOS in 2024, after facing pressure from the industry and consumers to do so. However, Apple also confirmed that messages from Android users to iPhone users would still appear in green bubbles, indicating that they are not using iMessage. iOS 18 is still in development and may change before its official release, which is expected to happen in September, along with the launch of the new iPhone models. More details about the software update may emerge as the WWDC event approaches in the next few months. Author Name | Om Gupta  ₹23,890 ₹9,999 ₹19,999 ₹75,999 By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site \nnavigation, analyze site usage, and assist in our marketing efforts. Cookie Policy Select Language "
}