{
    "title": "If You Invested $1000 In Apple When The iPad Was Launched 14 Years Ago, \nHere's How Much You'd Have Today",
    "date": "1/27/2024",
    "url": "https://finance.yahoo.com/news/invested-1000-apple-ipad-launched-165158882.html",
    "text": "The Apple iPad has turned 14. Launched on Jan. 27, 2010, the iPad was subject to jokes before becoming a category-defining product. Apple Inc. (NASDAQ:AAPL) co-founder and then-CEO Steve Jobs introduced the iPad as a \"magical and revolutionary device\" that could do everything from browsing the web, sending and receiving emails, reading books and playing games, among other things. \"iPad is our most advanced technology in a magical and revolutionary device at an unbelievable price,\" Jobs said, adding that it would create an \"entirely new category of devices.\" Over the next decade and a half, Jobs was proven right and Apple capitalized on the first-mover advantage — one in two tablets being used worldwide is an iPad, according to data from Statcounter. Apple put the iPad on sale for the first time on Apr. 3, 2010 and ended up selling over 300,000 units in just one day. Jobs announced the iPad 2 in March 2011, and revealed that Apple sold 15 million iPads in the first nine months of it going on sale. Apple has since launched 10 generations of the iPad and, apart from the standard variant, announced Mini, Air and Pro variants. See Also: If You Invested $1000 In Apple When Macintosh Was Introduced 40 Years Ago, Here’s How Much You’d Have Today A little fun fact: Did you know the iPad was not Apple's first tablet? Under John Sculley's leadership, Apple launched a tablet-like device called the Newton MessagePad. \"What we want to do is we want to put an incredibly great computer in a book that you can carry around with you and learn how to use in 20 minutes,\" Apple co-founder Steve Jobs said in a 1983 speech. However, the Newton MessagePad was not well received and was discontinued by Jobs. Let’s look at how Apple stock has fared since the company launched the iPad 14 years ago. Apple stock price from Jan. 27, 2010, till today Apple’s stock, adjusted for stock splits and other corporate actions, was $7.4243 on Jan. 27, 2010. Its stock price today is $194.17, which is an increase of 2,515% during this period. Value of a $1,000 investment in Apple stock, and the Nasdaq and S&P 500 indices, respectively, from Jan. 27, 2010, till today If you had invested $1,000 in Apple stock on Jan. 27, 2010, today, you would have $26,153. Likewise, if you had invested $1,000 in an index fund replicating Nasdaq, you would have $6,982. A similar $1,000 investment in an index fund that replicates the S&P 500 would be worth $4,459. Since the iPad's release in 2010, Apple has launched a few other products like the Apple Watch, AirPods, and, more recently, Vision Pro. Apple's iPads alone made the company over $28 billion in its FY23, accounting for 7.4% of the company’s topline. Apple has since expanded the use case for iPads from simple reading and entertainment devices to something that can be used by creators as well. The iPad Pro models are tailored for productivity and creation, sporting a large, high-resolution display and featuring powerful M-series chipsets. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Google Launched Its First Ever Smartphone 13 Years Ago Today: Here's How Much A $1000 Investment Back Then Would Now Be Worth Photo courtesy: Wikimedia Commons \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? This article If You Invested $1000 In Apple When The iPad Was Launched 14 Years Ago, Here's How Much You'd Have Today originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}