{
    "title": "Apple Vision Pro Could Cannibalize iPad Down The Line, Says Mark Gurman: \nTim Cook Has His Work Cut Out",
    "date": "2/12/2024",
    "url": "https://www.tradingview.com/news/benzinga:b6f34d76b094b:0-apple-vision-pro-could-cannibalize-ipad-down-the-line-says-mark-gurman-tim-cook-has-his-work-cut-out/",
    "text": "Apple Inc.’s AAPL latest product, the Vision Pro headset, has been touted as a potential successor to the iPad, despite current hardware and software limitations all pointing to it being a prototype product. What Happened: Bloomberg's Mark Gurman praised Apple Vision Pro’s performance in video streaming, light work tasks, and email communication. The device’s hardware, including built-in speakers and an eye-and-hand control system, also received positive remarks. However, he also pointed out several issues. The Vision Pro was described as too heavy and cumbersome, with short battery life and a lack of dedicated apps, even though Apple touted the availability of 600 apps at launch. See Also: Peter Thiel-backed ‘Olympics On Steroids’ Considers Allowing Athletes To Use Apple Vision Pro Another indicator of Apple Vision Pro being unfinished in its current form is visionOS reportedly being buggier than expected from Apple products. Despite these drawbacks, Gurman echoed the sentiments of analysts who think that the Vision Pro could cannibalize the iPad by providing a better experience for the tasks that Apple’s tablet was designed to handle. The review concluded that while the Vision Pro’s future potential is visible, it will require hardware upgrades, software updates, and better support from app developers to become a viable iPad replacement. Why It Matters: The Vision Pro has been making waves since its launch, with analysts at Deepwater Asset Management likening its debut to the iPhone’s. Despite recognizing its first-generation limitations, they underscored its potential for future evolution. The device sold nearly 180,000 units over its first weekend, more than twice as much as initially expected. Furthermore, Wedbush analyst Daniel Ives has predicted a growth “renaissance” for Apple, fueled by the iPhone 15 and the Vision Pro. He sees a $5 billion annual run-rate from this opportunity, making Vision Pro a significant revenue line after the iPhone and ahead of the Apple Watch and iPad. AAPL Price Action: Apple shares closed at $188.53 on Friday, up by 0.21% in the last 24 hours. Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: ChatGPT Shocks Internet Users: You Ask, And It Will Reveal Its Secret Sauce Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Apple © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @notfundamental @johndollery @bullfxmib_official @nicolasvolume @sabaisabai_fx @javier.vasquezpalacios @milagnes @nasdaq.forex @jake_ofalltrades13 @tradingview @TradingView @rajpalgore @itspatrickspencer_ @thetradingfield @bradfairbridge @_ntokozo_sa @voyager_far_and_wide @alberto_fabio23 Whatever the trade "
}