{
    "title": "AAPL: 3 Tech Stocks to Keep an Eye on in February",
    "date": "2/7/2024",
    "url": "https://stocknews.com/news/aapl-lpl-gct-3-tech-stocks-to-keep-an-eye-on-in-february/",
    "text": "Login \n        Join Login \n                                            Join AAPL – Despite macroeconomic challenges, the long-term prospects of the tech industry look bright due to digitization, increased tech reliance, and advances in AI and automation. Therefore, it could be wise to keep an eye on tech stocks Apple (AAPL), LG Display (LPL) and GigaCloud Technology (GCT). Keep reading…. Feb 7, 2024 The technology sector is growing as a result of digital transformation, innovative solutions, automation, efficiency, and improved customer experiences amid the adoption of emerging technologies such as AI, cloud computing, and IoT. Amid this backdrop, it could be wise to keep an eye on fundamentally strong tech stocks Apple Inc. (AAPL), LG Display Co., Ltd. (LPL) and GigaCloud Technology Inc. (GCT). Before delving deeper into their fundamentals, let’s discuss what’s happening in the tech industry. The global digital transformation market is predicted to reach $4.18 trillion by 2032, growing at a CAGR of 17.2%. This expansion can be attributed to the growing use of cloud computing, artificial intelligence, and big data analytics across a wide range of industries. Also, the need for digital transformation solutions is driven by the desire to improve operational efficiency, customer experience, and market competitiveness. The information technology market is predicted to increase at an 8.3% CAGR to $12.42 trillion by 2028. According to the Consumer Technology Association®, retail revenues in the United States consumer technology industry will increase by 2.8% to $512 billion in 2024 (up $14 billion from 2023). This indicates an increase in consumer spending on technology products and services, according to the CTA’s One-Year Industry forecast. Moreover, investors’ interest in tech stocks is evident from the iShares Expanded Tech Sector ETF’s (IGM) 22.5% returns over the past six months and 43.9% over the past nine months. In light of these encouraging trends, let’s look at the fundamentals of the three above-mentioned tech stocks. Apple Inc. (AAPL) Tech giant AAPL designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories and sells various related services. Its product offerings include iPhone, Mac, AirPods Max, iPad, Apple TV, Apple Watch, HomePod, and accessories. 2024 STOCK MARKET OUTLOOK AAPL’s trailing-12-month ROCE of 154.27% is significantly higher than the industry average of 1.46%. Its 28.55% trailing-12-month ROTA is significantly higher than the 0.45% industry average. AAPL’s total net sales for the fiscal first quarter (ended December 30, 2023) increased 2.1% year-over-year to $119.58 billion. Its gross margin improved 9% from the year-ago value to $54.86 billion. Also, its net income and EPS amounted to $33.92 billion and $2.18, up 13.1% and 16% from the prior-year quarter, respectively. Street expects AAPL’s revenue and EPS for the year ending September 2024 to increase 1.3% and 7% year-over-year to $388.32 billion and $6.56, respectively. It surpassed EPS estimates in all four trailing quarters. AAPL’s shares have gained 24.8% over past year to close the last trading session at $189.30. AAPL’s POWR Ratings reflect this optimistic outlook. The POWR Ratings assess stocks by 118 different factors, each with its own weighting. AAPL has an A grade for Quality and a B for Sentiment. Within the A-rated Technology – Hardware industry, it is ranked #22 out of 36 stocks. To see additional POWR Ratings for Growth, Value, Stability and Momentum for AAPL, click here. LG Display Co., Ltd. (LPL) LPL is a Seoul, South Korea-based manufacturer of Thin-Film Transistor Liquid Crystal Display (TFT-LCD) and Organic Light Emitting Diode (OLED) technology embedded display panels used in devices such as televisions; notebooks; computers, and mobile devices. LPL’s trailing-12-month CAPEX / Sales of 18.83% is 701.8% higher than the industry average of 2.35%. For the third quarter, that ended September 30, 2023, LPL’s revenues came in at KRW 4.79 trillion ($3.61 billion). Its total assets were KRW 37.54 trillion ($28.30 billion) for the period ended September 30, 2023, compared to KRW 36.32 trillion ($26.91 billion) for the period ended December 31, 2022. Furthermore, its total current assets were KRW 10.51 trillion ($7.92 billion) compared to KRW 9.44 trillion ($7.12 billion) for the same period. Analysts expect LPL’s revenue to increase 16.3% year-over-year to $18.55 billion for the year ending December 2024. Its EPS is expected to grow 70.7% for the same period. The stock has lost 12.5% over the past month to close the last trading session at $4.40. LPL has a B grade for Value and Momentum. It is ranked #15 out of 41 stocks in the B-rated Technology – Electronics industry. Beyond what is stated above, we’ve also rated LPL for Growth, Stability, Sentiment and Quality. Get all LPL ratings here. GigaCloud Technology Inc. (GCT) GCT provides end-to-end B2B e-commerce solutions for large parcel merchandise. Its marketplace connects manufacturers primarily in Asia with resellers in the United States, Asia, and Europe to execute cross-border transactions across furniture, home appliances, fitness equipment, and other large parcel categories. GCT’s trailing-12-month ROCE of 28.98% is 147.1% higher than the 11.73% industry average. Its trailing-12-month ROTA of 13.40% is 225.2% higher than the 4.12% industry average. For the fiscal third quarter that ended September 30, 2023, GCT’s total revenues and gross profit stood at $178.17 million and $48.86 million, up 39.2% and 116.7% year-over-year, respectively. Its adjusted EBITDA increased 149.3% year-over-year to $29.78 million. For the same quarter, its net income and net income per ordinary share increased significantly year-over-year to $24.20 million and $0.59, respectively. The consensus revenue estimate of $904.55 million for the year ending December 2024 reflects a 32.4% rise year-over-year. Its EPS is expected to grow 5.2% year-over-year to $2.16 for the same period. It surpassed EPS estimates in all four trailing quarters. The stock has gained 410.1% over past year to close the last trading session at $28.16. GCT has an overall B rating, equating to a Buy in our POWR Ratings system. GCT’s is ranked #19 out of 77 stocks in the Technology – Services industry. It has an A grade for Quality and a B for Sentiment and Momentum. To see additional GCT’s ratings for Growth, Stability and Value, click here. What To Do Next? Discover 10 widely held stocks that our proprietary model shows have tremendous downside potential. Please make sure none of these “death trap” stocks are lurking in your portfolio: 10 Stocks to SELL NOW! > Want More Great Investing Ideas? 3 Stocks to DOUBLE This Year Updated: 2024 Stock Market Outlook > 10 Stocks to SELL NOW! AAPL shares were trading at $189.17 per share on Wednesday afternoon, down $0.13 (-0.07%). Year-to-date, AAPL has declined -1.75%, versus a 4.70% rise in the benchmark S&P 500 index during the same period. Rashmi is passionate about capital markets, wealth management, and financial regulatory issues, which led her to pursue a career as an investment analyst. With a master's degree in commerce, she aspires to make complex financial matters understandable for individual investors and help them make appropriate investment decisions. More... Copyright © 2024. Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions.Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use, please see disclaimer. "
}