{
    "title": "Midjourney Hires Apple Vision Pro Engineer To Lead Its Hardware Ambitions - \nApple (NASDAQ:AAPL)",
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/news/24/02/36963263/midjourney-hires-apple-vision-pro-engineer-to-lead-its-hardware-ambitions",
    "text": "Generative AI startup Midjourney Inc. scooped up Apple Vision Pro's former hardware engineer manager, Ahmad Abbas, to lead its hardware efforts. What Happened: Abbas joined Midjourney as the head of hardware in December. Before this, he led Apple Inc.'s AAPL Vision Pro development for five years. He also had a brief stint at Elon Musk’s Neuralink. Abbas has worked with Midjourney founder David Holz before his stints at Neuralink and Apple, as well as at Leap Motion, a company Holz founded in 2008. See Also: AI Cracks 2,000-Year-Old Code From Papyrus Scrolls Buried By Mount Vesuvius Volcanic Eruption Holz revealed in January the company will \"make the orb,\" although it's not quite clear what exactly it is. There is speculation that suggests it could be a device capable of creating and managing thousands of 3D rooms. Holz hinted at its potential use for AI-generated 3D worlds and possibly real-time video games. In a 2022 prediction, Holz suggested a game console with an AI processor capable of real-time game generation could be a reality within a decade. With Abbas now part of the team, this could happen sooner than anticipated. Why It Matters: The recruitment of Abbas, who played a significant role in the development of Apple Vision Pro, is a significant move for Midjourney. The Vision Pro is known for its capabilities in scanning objects and surfaces in real time. With Abbas’ expertise and the shared vision between him and Holz, Midjourney’s “Orb” project could have a major impact on the generative AI industry. Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Apple Vision Pro Is A Scratch Magnet, But It’s The Repair Costs That Should Worry You Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo: Generated using Dall-E 3 © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}