{
    "title": "Stocks to Watch: Applied Materials, Coinbase, and Apple",
    "date": "2/16/2024",
    "url": "https://moneymorning.com/2024/02/16/three-stocks-applied-materials-coinbase-and-apple/",
    "text": "By Nick Riso, Money Morning • February 16, 2024 Chips – and AI chips, in particular – are going to be a huge trend in 2024. Everyone talks about Nvidia (NVDA), and they’re right to. You can see why in CJ’s earnings prediction video. But most retail investors miss the fact that the semiconductor industry is very, very complex. There are dozens of materials, different types of chips, different functions for those chips, and all sorts of equipment to create and design everything. The latter of which is Applied Material (AMAT)’s domain. It’s catching headlines today because it reported higher-than-expected earnings results and guidance yesterday afternoon, and the stock shot up 12% in after-hours trading. Even though sales came in a bit lower than last year, the figure still topped analyst estimates. And it’s working well for them in the fact that they tallied $2.41 earnings per share (EPS) versus just $2.02 a year ago. It’s a quality company, financially healthy, its growth is stable, and it’s a hair undervalued right now. If Nvidia posts positive earnings next Wednesday, you can expect AMAT to rise. Like AMAT, Coinbase (COIN) soared after hours yesterday after reporting optimistic earnings results. And it’s no wonder why. Bitcoin exchange-traded funds (ETFs) were finally approved by the SEC last month, which grants Bitcoin access to retail investors through their brokerage account. The two largest ETFs, BlackRock’s and Fidelity’s, count just about $10 billion in cash between them. Coinbase’s entry here is as a custodian for eight of the 11 ETFs created, which means gathering fees from prime trading, custody, and trade settlement. This, in part, helped sales reach $934 million versus $629 million last year, while beating analyst EPS estimates of two cents to $1.04. The key for the future is that Bitcoin’s halving – coin production is halved every four years – occurs on April 19. With a lesser rate of supply and growing demand… prices soar. And when prices soar, Coinbase is one of the main benefactors. Another one about Apple (AAPL). It just announced a coding AI to help developers create blocks of code for anything from web development to app creation. Apple’s doing this in part to compete with Microsoft (MSFT)’s Github Copilot, and move launches the company into the outward-facing AI world (Siri not included). It’s been in AI for years, but usually on the backend of their systems. Is it a good move? Who knows. It’s a catch-up play, and the impact is yet to be seen. I urge caution, though. Apple’s recent moves have been all but reassuring for future health (have you seen the videos of people using the Vision Pro in public?? Its rumored flip phone??). Don’t get me wrong. AI needs data, as we all know, and Apple has a ton that we don’t even think about. Location services, health information, and search queries through Siri. But can it utilize this to make more money? We don’t know quite yet. By submitting your email address, you will receive a free subscription to Money Morning and occasional special offers from us and our affiliates. You can unsubscribe at any time and we encourage you to read more about our Privacy Policy. Money Morning gives you access to a team of market experts with more than 250 years of combined investing experience – for free. Our experts – who have appeared on FOXBusiness, CNBC, NPR, and BloombergTV – deliver daily investing tips and stock picks, provide analysis with actions to take, and answer your biggest market questions. Our goal is to help our millions of e-newsletter subscribers and Moneymorning.com visitors become smarter, more confident investors. © 2024 Money Morning All Rights Reserved. Protected by copyright of the United States and international treaties. Any reproduction, copying, or redistribution (electronic or otherwise, including the world wide web), of content from this webpage, in whole or in part, is strictly prohibited without the express written permission of Money Morning. Address: 1125 N Charles St. | Baltimore, MD, 21201 | USA | Phone: 888.384.8339 | Disclaimer | Sitemap | Privacy Policy | Whitelist Us | Do Not Sell or Share My Personal Information "
}