{
    "title": "Microsoft tried to sell Bing to Apple in 2018",
    "date": "2/25/2024",
    "url": "https://www.newsbytesapp.com/news/science/microsoft-offered-to-sell-bing-to-apple-in-2018-google/story",
    "text": "Hi, Logout Recently unsealed court filings as part of the United States (US) Justice Department's antitrust case against Google revealed that Microsoft tried to sell its Bing search engine to Apple in 2018. \n \nThe documents, part of Google's filings, showed that Microsoft made multiple attempts to convince Apple to make Bing the default search engine for its Safari browser. However, Apple refused each time due to concerns about Bing's search quality. Google's filings argued that discussions between Apple and Microsoft were evidence of competition in the search industry, as it is accused of monopolizing the web search sector. \n \nThe filings mention instances from 2009, 2013, 2015, 2016, 2018, and 2020 when Microsoft proposed Bing as Safari's default search engine. \n \nGoogle stated, \"In each instance, Apple took a hard look at the relative quality of Bing versus Google and concluded that Google was the superior default choice... That is competition.\" Per the filings, Apple's services head, Eddy Cue, commented on Bing's search quality, saying, \"Microsoft search quality, their investment in search, everything was not significant at all.\" \n \n\"And so everything was lower. So the search quality itself wasn't as good,\" the documents quoted him as saying. \n \n\"They weren't investing at any level comparable to Google or to what Microsoft could invest in. And their advertising organization and how they monetize was not very good either,\" Cue said. Notably, Google and Apple share a lucrative partnership, with Google paying billions of dollars to be the default search engine on Apple's platforms. The revenue from this deal with Google was a \"key reason\" why Apple's talks to acquire Bing never progressed beyond exploratory stages, reports have said earlier. The US Justice Department disclosed in its own unsealed filing that Microsoft has invested nearly $100 billion in Bing over two decades. \n \nDespite this massive investment, Bing only holds a 3% global market share, according to StatCounter. \n \nIn the fourth quarter, Microsoft earned $3.2 billion from search and news advertising, while Google's search and other revenue amounted to $48 billion. "
}