{
    "title": null,
    "date": "2/28/2024",
    "url": "https://www.news-daily.com/arena/thestreet/stock-market-today-stocks-lowstock-market-today-stocks-lower-with-inflation-in-focus-and-apple/article_95366893-b53a-5dd7-a5c2-659c2e0e6ddb.html",
    "text": "   Check back for updates throughout the trading day U.S. equity futures slipped lower Wednesday, while the dollar extended gains against its global peers and Treasury yields inched higher, as investors braced for an update on fourth-quarter GDP ahead of a key inflation report later in the week. Stocks ended modestly higher yesterday, with the S&P 500 eking out a 0.17% gain and the small-cap Russell 2000 index rising 1.3%, in an otherwise quiet session highlighted by solid demand for a $42 billion 7-year Treasury bond auction. Truck Parking Club used DOT data to explore the severity of the truck parking shortage, which is endangering drivers and those around them.  Click for more.Big-rig parking shortage across the US spells juggernaut problems Benchmark yields were edging higher overnight, however, matching a move in the dollar, as investors looked to Thursday's reading of the Federal Reserve's preferred inflation gauge, the PCE Price Index, to further establish the central bank's rate path. Ahead of that reading also comes the latest update on fourth-quarter GDP growth, which was last estimated at 3.3% and follows the Atlanta Fed's latest real-time reading of 3.2% for the current quarter. The solid growth, alongside a resilient labor market, suggests inflation pressure could remain elevated well into the spring. Benchmark 10-year Treasury-note yields were marked 2 basis points higher at 4.291% while 2-year notes were little changed at 4.681%. The U.S. dollar index, which tracks the greenback against a basket of six global currencies, was marked 0.26% higher at 104.102. In stocks, Ebay  (EBAY)  shares jumped 4.9% after the online marketplace posted better-than-expected fourth-quarter earnings, powered in part by solid holiday spending. Beyond Meat  (BYND)  soared 66% after the plant-based-food company surprised investors with stronger-than-expected fourth-quarter sales and a boost in overseas revenue. Apple  (AAPL)  shares were also in focus, slipping 0.16% after the tech giant unveiled plans to scrap its decade-long project to build an autonomous car, opting instead to shift the investment and talent to its nascent AI division. Related: Analyst says Apple's latest move is a positive for Elon Musk's Tesla AI-related stocks will also be in focus after the close of trading, with January-quarter updates from Snowflake  (SNOW)  and Salesforce  (CRM) . On Wall Street, stock futures suggest a modestly weaker open, with contracts tied to the S&P 500 indicating a 16 point decline and those linked to the Dow Jones Industrial Average suggesting a 115 point pullback. Futures tied to the tech-focused Nasdaq, which is up 6.82% for the year, are priced for a 68 point decline. In overseas markets, Europe's Stoxx 600 was marked 0.26% lower in Frankfurt, while Britain's FTSE 100 fell 0.66% in London. Overnight in Asia, China stocks turned lower after a budget report failed to confirm hopes of significant stimulus from Beijing. A weaker yen was unable to help the Nikkei 225 close in positive territory, with the benchmark falling 0.08% to 39,208.03 points. Related: Veteran fund manager picks favorite stocks for 2024 Success! An email has been sent to  with a link to confirm list signup. Error! There was an error processing your request. Get news alerts and breaking stories from Clayton News delivered to your email.     Please log in, or sign up for a new, free account to read or post comments. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Last week, a special feature was published of tips on how to save at the grocery store. The goal is to cut costs on items you are already purchasing, but make it simple. \n\nSaving Money on a Weekly Grocery Trip Can Be Easy! Here's How\n\nThe items pictured were actual purchases and the last photo highlighted additional deals, at both Kroger and Publix, that may be beneficial to the majority. \n\nDid you find this helpful? Let us know in the comments how it was helpful and/or how it can be improved! Phone: 770-478-5753\n148 Courthouse Street\nJonesboro, GA 30236 148 Courthouse Street\nJonesboro, GA 30236 148 Courthouse Street\nJonesboro, GA 30236 Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: Get up-to-the-minute news sent straight to your device. "
}