{
    "title": "Apple Issues Warning About Putting a Wet iPhone in Rice — and Details What \nto Do Instead",
    "date": "2/24/2024",
    "url": "https://people.com/apple-issues-warning-about-putting-wet-iphone-rice-shares-other-advice-8598567",
    "text": "The technology company said using the food to remedy a wet mobile device \"could allow small particles of rice to damage your iPhone\" Getty Apple is issuing a warning about a popular remedy used to aid a wet iPhone. In a recently released support note, the technology company detailed why putting a water-soaked mobile device in a bag of rice is a bad idea. Highlighting that the act can actually cause more harm than good, Apple wrote, “Don’t put your iPhone in a bag of rice. Doing so could allow small particles of rice to damage your iPhone.\" The organization also warned of two other ways to not aid a wet device, writing: “Don’t dry your iPhone using an external heat source or compressed air\" and “Don’t insert a foreign object, such as a cotton swab or a paper towel, into the connector.” Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Phil Barker/Future Publishing via Getty Instead of using rice, Apple detailed other ways in which to remedy a wet iPhone in its new 2024 support document, which was first uncovered by Macworld. According to the company, an alert will appear on the device and disable charging. At that point, users should \"tap\" their iPhone \"gently\" against their hand with the connector facing down, in an effort to remove any liquid. The iPhone should then be \"left in a dry area with some airflow,\" per Apple, for \"at least 30 minutes.\" After that time frame, users should try charging their device or connecting an accessory to see if the warning still shows up. If the alert does indeed pop up again once connected, Apple notes that means there is still liquid in the device. The company advises that users should leave their iPhone in a dry area for a longer period of time. Getty Apple released the latest versions of its mobile devices, the iPhone 15 and the iPhone 15 Pro, in September 2023. Available in regular and larger \"Max\" sizes, the devices come in an array of colors and run the company's latest operating system, iOS 17. "
}