{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.businessinsider.com/apple-designer-bart-andre-retires-leaving-report-2024-2",
    "text": "       Bart Andre, a veteran Apple designer who came up under Jony Ive, is reportedly departing the tech giant after more than 30 years — the latest in a string of departures on the company’s storied design team. Andre was one of the last remaining members of Ive’s former team, Bloomberg reported. The group is responsible for the look and feel of Apple’s hardware and software products, and was key to the development of its latest launch, the Apple Vision Pro. Andre, the designer with the longest tenure who helped lead the team after Ive’s successor Evans Hankey left last year, told colleagues this month that he is retiring, according to the report. Related stories His name has appeared on numerous Apple patents and applications ranging from a membrane-sealed keyboard and computer tower architecture to electronic devices with cooling systems. Ive’s departure in 2019 precipitated an exodus, Bloomberg reported, with many of the iPhone company's designers subsequently joining his design firm venture LoveFrom. The ongoing exits most recently included Colin Burns, Shota Aoyagi, and Peter Russell-Clarke, who left late last year. Notable holdouts from Ive’s era include VP of design Richard Howarth, Molly Anderson, and Duncan Kerr, according to Bloomberg. The outlet reported that some staffers are bothered that the design division is now being overseen by an operations exec, COO Jeff Williams, and that cost-cutting measures have curtailed the team's ability to freely explore future product ideas that may not have any immediate money-making potential. After Ive left the company back in 2019, Apple CEO Tim Cook slammed a Wall Street Journal report that said a contributing reason for his departure was Cook's lack of interest in design relative to Steve Jobs. Cook's specialty at Apple was supply-chain management and operations in the lead-up to becoming CEO. Neither Apple nor Andre immediately responded to Business Insider’s requests for comment ahead of publication. Apple's design team under Ive numbered roughly two dozen staffers, Bloomberg reported, obsessively crafting products like the AirPods and Apple Watch for years before they hit shelves. The team is also responsible for device interfaces and typography, Wallpaper reported in a sprawling 2022 profile, and has the ability to sketch, model, and prototype Apple products in-house. Read next Jump to "
}