{
    "title": "Apple warns not to put wet iPhones in rice",
    "date": "2/21/2024",
    "url": "https://scrippsnews.com/stories/apple-warns-not-to-put-wet-iphones-in-rice-1/",
    "text": "The company issued new guidance regarding fixing a wet iPhone, and it doesn't include the popular hack of putting your phone in a food staple. It’s an awful feeling: Your iPhone — the handheld mini-computer that holds much of your life — gets wet, and you need to fix it — like, now! The newer the iPhone, the more resistant it is to water and other hazards, the company says. But the devices are not totally watertight, and that's why a spilled glass of water could turn into a communication-ending disaster. The conventional wisdom says to put the phone in a bag of uncooked rice, with the hope that the thirsty grain will draw water out of it. It does seem to make some sense — and when your phone's life is on the line, you want the quickest fix. The assistive voice technology allows users who suffer from a voice disability to speak in their own natural voice. As it turns out, this old iPhone hack is not such a good idea — and Apple's support team has updated their guidelines for phone first aid to explicitly tell folks to lay off the rice. Instead, a little extra time and TLC can bring the drenched device back to life. There are a couple of reasons why rice isn't the solution. For one, tiny bits of the food staple could get stuck in sensitive parts of the phone, potentially causing damage. And rice doesn't do anything to prevent corrosion of the affected parts. Ultimately, it probably won't work, and you'll have wasted some perfectly good rice. It's better to take some deep breaths and follow Apple's support advice. Here's what to do if your iPhone gets wet: First, unplug the phone from the charging cable and any accessories. Next, hold your phone upright, with the connector port facing down. Tap it gently into your other hand. Hopefully, some of the liquid will come out. Then, place the phone in a safe, dry location that gets some fresh air, but don't force air into the connector. Let it rest for at least 30 minutes. Leave it unplugged and unbothered. After some good rest and drying out time, test the phone by plugging it into a charging cable. If the phone isn't working right, or displays a \"liquid-detection alert,\" it will need more time to dry. Apple's support technicians say to give the phone 24 hours. Go ahead and test it every so often to see if anything improves. If things aren't improving after a day, you'll have to contact Apple for more help. Apple has a detailed rundown of how to deal with a wet iPhone with even more do's and don'ts. Good luck — and save the rice for dinner. This story was originally published by Kathleen St. John at Simplemost.   Apple iPhones can get stuck in SOS mode when there's spotty service. Here's why, and how you can get out of it. AT&T has not said what caused Thursday's massive outage, leading to speculation over what caused cell networks to shut down. If you're looking to upgrade your TV before the Super Bowl, keep in mind how you access Sunday's game will matter. Krispy Kreme will be giving away free doughnuts in celebration of its big announcement with McDonald's. Officials said officer Jonathan Diller was shot beneath his bullet-proof vest while approaching a vehicle that was illegally parked at a bus stop. For the second time in two years, the Supreme Court will consider a case that will have a significant impact on abortion access.  © 2024 Scripps News, part of The E.W. Scripps Company. All Rights Reserved. "
}