{
    "title": "Apple’s Work On Foldable Technology Ramps As Company Decides The Design Of \nThe Device, But It Won’t Be An iPhone",
    "date": "2/22/2024",
    "url": "https://wccftech.com/apple-foldable-ipad-in-development/",
    "text": "Apple is expected to launch the OLED iPad Pro models by the end of next month, as the company plans to redesign its high-end tablet. While there are a slew of changes coming at launch, the OLED display will potentially be the highlight of the upgrade. However, Apple's transition to OLED panels came years after it introduced mini-LED displays for the 12.9-inch model. It appears that the company has already started working on foldable display technology for the iPhone and iPad. DigiTimes states in its paywalled report, citing supply chain sources, that Apple has been working on a foldable iPhone or iPad for five years. While we have previously heard numerous details on a foldable iPhone, the report states that the foldable will be a \"larger device\", possibly hinting at an iPad. This is not the first time we have heard details on a foldable from Apple, as the company was previously rumored to introduce the device from within the iPad lineup. The report also claims that the company is moving ahead from the design to mass production plans. However, it is too early to conclude when the device will see daylight. Apple has been testing the design and form factor of the device for years, and the company adopted a laid-back approach for the hinge technology to mature. Over the past few years, we have seen a plethora of foldable smartphones from Samsung and how it improved the hinge technology on the Galaxy Fold and Galaxy Flip. The hinge is a make or break for a foldable device as it is the most crucial element to bolster a folding display. Apple took its time to step into the foldable industry as suppliers struggled to keep up with the company's quality demands and expectations. It was recently reported that the company moved its Vision Pro engineers to work on foldable display development, which is a sign that the company is highly ambitious to launch a foldable iPhone or iPad in the future. Take note that the report only mentions that Apple's foldable will be a \"larger device\". This means the company could offer the technology on its iPad lineup or introduce a new product category altogether. With that in mind, the report corroborates past rumors that Apple has not suspended a foldable device and that the company has various departments working on the project. While it is early to draw conclusions, Apple is expected to launch its first foldable device by 2025 at the earliest. However, be sure to take the news with a grain of salt, as speculations are only based on initial information. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}