{
    "title": null,
    "date": "2/17/2024",
    "url": "https://wccftech.com/iphone-16-camera-component-leaks-to-show-vertical-setup/",
    "text": "Apple is gearing up to launch the iPhone 16 lineup later this year with a plethora of upgrades oriented towards the camera. While the iPhone 15 models launched with its fair share of improvements, the iPhone 16 is expected to take it to the next level with a new Capture Button. While details have been scarce up until now, the iPhone 16's camera component just got leaked, and it aims to show the redesigned chassis. It was previously rumored that Apple would switch from the diagonal layout of the camera sensors to a vertical layout on the iPhone 16. The latest leaked camera component of the iPhone 16, shared by Majin Bu on X, suggests that the company is indeed working on a vertical design. MacRumors independently verified the component's authenticity, which gives us further proof that the camera component genuinely belongs to the iPhone 16. It was confirmed that the component is a camera chassis, which will house the upgraded sensors of the iPhone 16. Note that the leaked camera chassis belongs to the base iPhone 16 models and not the 'Pro' models since it is a dual camera setup. The leak also confirms that the iPhone 16 will feature a vertical camera layout as Apple plans to ditch the diagonal layout of the standard iPhone 15. Apple has used the vertical camera design in the past, starting with the iPhone X, which launched in 2017. The design was brought forward until the iPhone 12. However, the company opted for a diagonal camera setup at the back with the iPhone 13, and the design was brought forward to Apple's base iPhone 15 lineup. It appears that the company is reconsidering the layout for this year's iPhone models. Majin Bu previously shared renders and schematics of the iPhone 16, suggesting that the cameras will be arranged in a vertical fashion. It was further noted by MacRumors that the camera bump on the standard models would be slightly slimmer than the iPhone 15 lineup, offering a slightly shorter plateau. Apple could possibly shrink the camera components or offer a slightly thicker design for the iPhone 16 lineup. We have also previously reported that the iPhone 16 models are expected to feature bigger battery capacities. This indicates that the design could be slightly thicker than the iPhone 15 models to fit larger battery cells. While the leaked component indicates that the iPhone 16 will feature a vertical camera system, Apple could offer Spatial Video Recording on the standard models, a feature that is exclusive to the iPhone 15 Pro models at this stage. Spatial Videos are used in the Apple Vision Pro, and the company wants users to have the feature as it would direct users to get the Vision Pro. We have to consider that this is the first leaked component of the iPhone 16 and should be taken with a grain of salt. The company is potentially testing different prototype designs for the iPhone 16 and the camera chassis could be part of the testing phase. We will share further details on the matter as soon as additional information is available. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}