{
    "title": "Apple Watch sales are BACK ON as tech company quietly disables 'lifesaving' \nhealth feature to skirt around ban due to ...",
    "date": "1/18/2024",
    "url": "https://www.dailymail.co.uk/sciencetech/article-12979049/apple-removes-smartwatches-health-features-comply-ban.html",
    "text": "By Stacy Liberatore For Dailymail.com Published:  15:59 GMT, 18 January 2024   |  Updated:  18:38 GMT, 18 January 2024  69 View  comments  Apple has disabled a health feature from its smartwatches overnight order to avoid a complete ban on sales in the US. A software update was released after news broke that imports and sales of the Series 9 and Ultra were set to be halted Thursday, which removed the blood oxygen monitor that that is analyzes breathing and lung function. The tech giant was forced to drop the feature or be banned from sell the smartwatches starting Thursday at 5pm ET after a federal court rejected Apple's appeal to continue the pauce. Despite downgrading the two Apple Watches, the company will not be changing price points, Apple told DailyMail.com. Apple has removed the blood oxygen feature from its smartwatches in order to avoid a complete ban on the models in the US The Series 9 starts at $399 and the Ultra costs $799. Apple said the cost is based on the many features of the two smartwatches and removing one does not make a difference in price. The blood oxygen feature is still available on units previously purchased. But it has been disabled on those still on shelves. Now, when a user taps on the blood oxygen icon on a modified watch, the display will show an alert directing the person to an explanation on Apple’s website, the company said. However, some customers looking to purchase a Series 9 or UIltra on Thursday have been told that sales cannot be made until Friday. A federal court was set to prohibit the import and sales of the Series 9 and Ultra Thursday at 5pm ET due to claims the tech giant copied patented medical technology from the California-based biotech company Massimo US Customs and Border Protection said this month that Apple could continue selling the devices in the meantime if it redesigns and replaces the hardware, but so far the software has only been tweaked. Apple argued it was likely to win its appeal and that keeping the ban in effect would harm the company, its suppliers and the public. However, the commission countered that Apple's arguments 'amount to little more' than a patent infringer 'requesting permission to continue infringing' and was set to reinstate the pause on sales and imports today. Apple said it 'strongly disagreed' with the ITC decision and resulting orders and they should be should be reversed. In a statement, Joe Kiani, Masimo's founder and chief executive, said the court ruling on Wednesday 'affirms that even the largest and most powerful companies must respect the intellectual rights of American inventors and must deal with the consequences when they are caught infringing others' patents.' Joe Kiani, Masimo's founder, said that a software fix would be an insufficient remedy and 'the hardware needs to change' The battled between the two companies started in 2013, when Masimo accused Apple of entering discussions with it for a potential partnership only to steal the biotech startup's idea and poach some of its engineers to implement it. Masimo first complained in 2021 that the Apple Watch Series 6, released in 2020, and all subsequent models use technology that infringed on its blood-oxygen sensor patent. According to Forbes, Kiani has spent at least $60 million fighting Apple in court. In October, the ITC announced its ruling, finding that the devices infringed on two patents owned by biotech company Masimo, based in California. Apple decided to halt sales on December 18 in an effort to 'preemptively take steps to comply should the ruling stand.' 'Apple strongly disagrees with the order and is pursuing a range of legal and technical options to ensure that Apple Watch is available to customers,' the company said in a December statement. The ban went into effect on December 24, which then left the decision to the Biden Administration that opted not to veto a ruling on patent infringements. It is rare for a president to veto a decision from the ITC, but Apple has benefitted from such an intervention in the past and likely had high hopes it could happen again. But the Biden Administration stayed quiet. Apple then filed an emergency motion with the US Appeals Court in an attempt to pause the ban, which went in effect on December 28 - letting retailers restart sales. However, the move was temporary and sales have again been halted. A Masimo spokesperson told DailyMail.com last month: 'Masimo is willing to settle. 'As Joe Kiani indicated, we believe the path forward is to have honest, good-faith discussions with Apple to explore the various ways the parties could resolve their dispute.' The Irvine-based company pioneered a sensor technology that consistently emits light through the skin to monitor blood oxygen saturation. Apple's technology shines red and near-infrared (IR) light into blood-perfused tissue. According to the company website, Masimo, founded by Joe Kiani in 1989, holds thousands of healthcare and consumer-focused patents. Data shows that Masimo is valued at $6.69 billion, and Kiani's net worth is $1.3 billion. Apple has also claimed that Masimo applied for a patent after Apple launched its smartwatches. Apple has included a pulse oximeter feature in smartwatches since its Series 6 Apple Watch in 2020. The Cupertino-based company filed two patent infringement lawsuits against Masimo in October 2022, claiming Kiani's company copied patented features of the Apple Watch to use in its medical tech. Divers and sonar crews race against the tide as they desperately search for survivors of Baltimore bridge collapse amid fears TWENTY victims plunged into freezing 47F waters: Two are saved with one in a critical condition Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}