{
    "title": "Wall Street ends down as Apple weighs",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/futures-slip-earnings-roll-tesla-113610242.html",
    "text": "By Noel Randewich and Johann M Cherian (Reuters) - U.S. stocks ended lower on Tuesday after mixed earnings from Morgan Stanley and Goldman Sachs pressured banks, and as sell-offs in Boeing and Apple weighed on the S&P 500. Morgan Stanley tumbled 4.2% to a more than one-month low after it posted a lower quarterly profit, while Goldman Sachs' stock ended 0.7% higher after it reported a 51% rise in profit. The S&P 500 banks index dipped 1.2% to an over one-month low after other major U.S. banks reported lower profits on Friday. Spirit Airlines slumped 47% after a federal judge blocked JetBlue Airways' planned $3.8 billion acquisition of the ultra-low cost carrier, agreeing with the U.S. Department of Justice the deal would hurt consumers. Apple dropped 1.2% after offering rare discounts on its iPhones in China in response to stiff competition there, days after being overtaken by Microsoft as the world's most valuable firm. Federal Reserve Governor Christopher Waller dampened sentiment by saying there should be no rush to cut interest rates even though he was more confident of inflation being on track to meet the Fed's 2% target. Traders pared expectations that the Fed might begin its rate cuts in March, with U.S. Treasury yields also rising. [US/] \"Certainly valuations are extended, but I think what is happening today is more of a broader consolidation of markets around that idea that investors had gotten a little too optimistic about how willing the Fed would be to ease rates,\" said Ross Mayfield, an investment strategy analyst at Baird. Following strong December gains, the S&P 500 has been near its January 2022 record high close for the past several sessions. It is now down about 1% from that record high. Wall Street rose last week as investors continued to bet on an early start to the Fed's monetary-policy-easing cycle, despite a lack of supporting voices among policymakers and mixed inflation data. UBS Global Research boosted its 2024 year-end target for the S&P 500 to 5,150 points, representing a more than 8% upside from current levels. Of the 11 S&P 500 sector indexes, 10 declined, led by a 2.4% drop in energy, followed by a 1.2% loss in materials. The technology index rose 0.4%. The S&P 500 declined 0.37% to end the session at 4,765.98 points. The Nasdaq declined 0.19% to 14,944.35 points, while Dow Jones Industrial Average declined 0.62% to 37,361.12 points. Volume on U.S. exchanges was relatively heavy, with 13.0 billion shares traded, compared to an average of 12.1 billion shares over the previous 20 sessions. Advanced Micro Devices jumped 8.3% after Barclays analysts raised their price targets for AMD and several other chipmakers, saying they would benefit from growth in artificial intelligence. Larger rival Nvidia climbed about 3% and hit a record high. Boeing slumped almost 8% to a two-month low after the Federal Aviation Administration extended the grounding of its 737 MAX 9 airplanes indefinitely and Wells Fargo downgraded the stock to \"equal weight\" from \"overweight.\" Declining stocks outnumbered rising ones within the S&P 500 by a 2.6-to-one ratio. The S&P 500 posted 23 new highs and two new lows; the Nasdaq recorded 63 new highs and 182 new lows. (Reporting by Noel Randewich in Oakland, California, and Johann M Cherian and Ankika Biswas in Bengaluru; Editing by Richard Chang) Related Quotes "
}