{
    "title": "Apple Vision Pro to hit US stores as VR competition stiffens",
    "date": "1/9/2024",
    "url": "https://www.siliconrepublic.com/business/apple-vision-pro-vr-headset-preorder-meta-quest-sony-xreal-competition",
    "text": "by Vish Gain 9 Jan 2024 Image: Apple Meta already has the Quest 3 on the market while both Sony and Xreal have thrown their hats in the VR ring this week to take on Apple’s pricey headset. “The era of spatial computing has arrived,” said Apple CEO Tim Cook while announcing today (9 January) that the company’s highly anticipated Vision Pro VR headset will be available in the US starting 2 February. First unveiled at the annual Worldwide Developers Conference last June, Vision Pro is Apple’s first mixed reality headset that acts as what the company calls a “spatial computer” which gives users a three-dimensional interface that is controlled by their eyes, hands and voice. Hyping up the headset as the “most advanced consumer electronics device ever created”, Cook said the Vision Pro user interface will “redefine how we connect, create and explore” . The era of spatial computing has arrived! Apple Vision Pro is available in the US on February 2. pic.twitter.com/5BK1jyEnZN — Tim Cook (@tim_cook) January 8, 2024  The headset starts at the whopping price of $3,499 and will be available across all Apple Store locations in the US as well as online. People can also pre-order the Vision Pro beginning next Friday, 19 January. When it was first revealed, Apple said the device will let users interact with digital content that feels like it is “physically present”. With 23m pixels across two displays, along with its own “spatial operating system” called visionOS, Apple said the high resolution will let users turn spaces into personal movie theatres or enhance their gaming experience. Users will be able to adjust their environment with digital landscapes or take three-dimensional photos and videos to capture memories in greater detail. Apple detailed what the product will look like in a video published when it was first announced.  But even as many eagerly await the Vision Pro despite its hefty price tag, competition in the VR space is getting stiffer as other major tech companies are also setting their eyes on the market. Meta already has a strong performer in the space with its Quest line of VR headsets, the most recent and advanced of which is the Quest 3 unveiled in September last year. At $500, its starting price is significantly lower than the Apple headset it will compete with this year. When speaking with staff last June about the future of generative AI within Meta, CEO Mark Zuckerberg reportedly dissed the Vision Pro headset, telling employees it “could be the vision of the future of computing, but like, it’s not the one that I want”. “I think that their announcement really showcases the difference in the values and the vision that our companies bring to this in a way that I think is really important,” he was quoted as saying at the time. Sony has also thrown its hat in the VR ring today with a new “spatial” headset that comes with a smart control ring. Meanwhile Xreal, formerly Nreal, unveiled its Air 2 Ultra AR glasses this week to provide what it says is an affordable alternative to competing devices. 10 things you need to know direct to your inbox every weekday. Sign up for the Daily Brief, Silicon Republic’s digest of essential sci-tech news. Related:\n                    Meta,             AR,             Apple,             VR,             Sony Vish Gain is a journalist with Silicon Republic editorial@siliconrepublic.com 20 hours ago 4 days ago 23 Feb 2024 19 Feb 2024 2 Feb 2024 22 Dec 2023 16 minutes ago 1 hour ago 15 hours ago 17 hours ago 17 hours ago 17 hours ago 20 hours ago 20 hours ago 21 hours ago 23 hours ago 23 hours ago 1 day ago 1 day ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 4 days ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}