{
    "title": "Apple's iOS 18 will be absolutely huge, report claims",
    "date": "1/29/2024",
    "url": "https://mashable.com/article/apple-ios-18-huge",
    "text": "Apple's upcoming iOS 18, likely to be announced during the company's WWDC event in June, might be one of the biggest in the company's history. This is according to Bloomberg's Mark Gurman, who talked about the upcoming release in the subscribers-only portion of his newsletter (via 9to5Mac). He claims that iOS 18 is \"seen within the company as one of the biggest iOS updates — if not the biggest — in the company’s history.\" The fact that Apple considers iOS 18 to be very important isn't new; Gurman himself wrote about it in November 2023, while also reporting that Apple then took the unusual step of pausing development of iOS 18 to focus on ironing out the bugs. One thing that makes the upcoming version of Apple's mobile platform is probably the focus on generative AI. According to Gurman, this means a smarter Siri and far more AI integration into basic iOS features including Messages and Apple Music. But Gurman now says that there's a \"lot more\" coming with iOS 18, although details on what, exactly, are absent. Macrumors pointed out that Apple announced support for cross-platform messaging standard RCS on the iPhone sometime later in 2024, which might coincide with the launch of iOS 18. For users, RCS support means that Android users will have a better experience when exchanging messages with iPhone users, and vice versa. In any case, with so much on the line, this year's WWDC will probably be exciting. Apple's developers-centered conference hasn't officially been announced yet, but it typically takes place in June. Topics\nApple\niOS Stan is a Senior Editor at Mashable, where he has worked since 2007. He's got more battery-powered gadgets and band t-shirts than you. He writes about the next groundbreaking thing. Typically, this is a phone, a coin, or a car. His ultimate goal is to know something about everything. "
}