{
    "title": "Microsoft surpasses $3 trillion market value, nearing Apple`s pinnacle",
    "date": "1/25/2024",
    "url": "https://www.wionews.com/business-economy/microsoft-surpasses-3-trillion-market-value-nearing-apples-pinnacle-683415",
    "text": "The ongoing tug-of-war between Microsoft and Apple for the top spot in market capitalisation has been a highlight since the beginning of the year. Microsoft achieved a significant milestone on Wednesday as its stock market value crossed the $3 trillion mark for the first time, solidifying its position as the world's second most valuable company, trailing closely behind Apple. This is based on a Reuters report. The ongoing tug-of-war between Microsoft and Apple for the top spot in market capitalisation has been a highlight since the beginning of the year. Microsoft briefly claimed the lead earlier in January, and now, with shares hitting a record high of $405.63, the company's market cap reached $2.99 trillion. Microsoft's ascent is attributed, in part, to its strategic investment in OpenAI, the creator of ChatGPT. This investment positions Microsoft as a frontrunner in the competitive landscape of generative artificial intelligence (AI). The company is in fierce competition with other tech giants such as Google owner Alphabet, Amazon.com, Oracle, and Meta Platforms. Leveraging OpenAI's technology, Microsoft has introduced newer versions of its flagship productivity software and Bing search engine, enhancing its competitive edge against Google's dominant search offering. On the other hand, Apple faces challenges as demand for its iPhones slows, particularly in China. The company is responding with rare discounts in an effort to boost sales in the face of tough competition from local rivals like Huawei Technologies. Reuters cited Stifel analyst Brad Reback, who highlighted Microsoft's advantage, stating, \"I think it's AI optimism for Microsoft,\" noting that Apple lacks a \"clear AI story\" and faces concerns about iPhone sales growth rates and penetration. Apple's shares closed down 0.35 per cent at $194.50, maintaining its $3 trillion market value. Analysts, optimistic about Microsoft's future, have set a median price target of $425 for the stock. This target reflects a positive trend, having risen from $415 a month ago. The average recommendation from the 54 analysts covering Microsoft is \"buy,\" according to LSEG data. Microsoft's shares gained nearly 57 per cent in 2023, and the momentum continues with a 7 per cent increase this year. In contrast, Apple's stock, which rose by 48 per cent last year, has seen a more modest uptick of about 1 per cent year-to-date. (With inputs from Reuters) "
}