{
    "title": "Apple stock downgraded... again",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/video/apple-stock-downgraded-again-151545861.html",
    "text": "Apple (AAPL) shares were downgraded from \"Buy\" to \"Neutral\" at Redburn Atlantic, with the price target unchanged at $200. Analysts there argue there is \"little room for upside\" in the stock. Meanwhile analysts at KeyBanc are keeping their \"Sector Weight\" rating on Apple, but are warning of below-average growth in the first first quarter. Yahoo Finance Live breaks down the latest analyst commentary on Apple. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich SEANA SMITH: All right, let's take a look at another top trending stock here and that is more stark warnings on Apple. Redburn Atlantic downgrading the tech giant to neutral from buy this morning citing, quote, \"little room for upside over the next few years.\" KeyBanc is keeping its sector weight rating on Apple, but warning of below average growth for the first quarter. This all goes back to exactly what that growth is going to look like. There was a bit of a reason to be, I guess, cautiously optimistic-- that seems to be a theme here in 20 tickers this morning-- about what we could see from Apple in the current quarter because yes, we are seeing weakness. We have heard a number of analysts come out talking about the fact that demand might not match expectations. But these checks at least from KeyBanc showing that it's actually holding up maybe better than some of the other analysts had been saying within their checks. So lots of focus is going to be on the iPhone 15 sale numbers and, of course, whether or not we see any follow through here to the first quarter of the year. BRAD SMITH: Yeah, I mean, it's just such a Goldilocks scenario that we're looking at for Apple here. You're looking at the company that, of course, as they attract that and cracked that $3 trillion market cap last year, ultimately going forward from here there's going to be two major questions. When do we see the company get to a services annualized run rate of $100 billion? Just wrap your minds around that. One segment of Apple's business could be worth $100 billion over the next year, two years perhaps and it's just services. But what also makes that ecosystem sticky is the range of products. And so as of right now, it's not like the Vision Pro is going to make people just fly out of their couches, out the door into the car to go pick up a VR headset. That's probably not it, not at 3,500 bucks. But what are they probably going to do? They're probably going to be updating some of those wearables that they might have. They might also have to eventually get into one of the new iPhones. I mean, every time I get an iOS update, I feel like my phone works just a little bit worse. So at the end of the day, that cyclical life cycle or the life cycle that we see and the turnover and churn of some of the previous models is something that we perhaps should be watching and what in the next super cycle will emerge. Related Quotes "
}