{
    "title": "Move over Apple: Microsoft is now the most valuable publicly traded company",
    "date": "1/13/2024",
    "url": "https://www.ctvnews.ca/business/move-over-apple-microsoft-is-now-the-most-valuable-publicly-traded-company-1.6724651",
    "text": "Microsoft is back on top. After trailing behind Apple for the majority of the past decade, Microsoft is the world’s most valuable publicly traded company as of market close on Friday. The tech giant’s stock (MSFT) closed at US$388.47 a share on Friday, giving it a market capitalization of US$2.89 trillion. Apple’s stock (AAPL) closed at US$185.92 a share, for a market capitalization of US$2.87 trillion. Market capitalization — or market cap — is the total value of all the shares of a publicly traded company. In other words, it’s the market value of the company. Microsoft’s rise to the top comes after the company had a stellar year thanks to its success with generative artificial intelligence. In 2023, the company’s CEO, Satya Nadella, made a multi-billion dollar investment in AI, including commercializing and adding AI tools like ChatGPT into its suite of products before rivals. He even strengthened Microsoft’s ties to ChatGPT maker OpenAI, a major pioneer in the field of artificial intelligence, during a board and leadership upheaval at the smaller company late last year. Apple, meanwhile, is facing a barrage of problems. iPhone sales are slowing in part because of the Chinese government’s reported efforts to restrict purchases (Beijing denies it has put any restrictions in place). That’s helped Chinese smartphone maker Huawei to gain market share. Apple also recently contended with a brief ban from selling the latest Apple Watch models in the United States. Microsoft declined to comment, while Apple did not return CNN’s request for a comment. Rescuers are searching for at least seven people in the water after a massive container ship collided with the Francis Scott Key Bridge early Tuesday, causing the bridge to collapse and sending people and vehicles into the frigid water.  Environment Canada has issued weather advisories for four provinces over freezing rain, poor air quality and heavy snowfall.  Dr. Garni Tatikian is having second thoughts about her future as a family doctor because of what she calls unfair salaries. Tatikian was among the Canadian health-care workers who shared their experiences with CTVNews.ca about the problems driving some to consider leaving the profession or quit altogether.  As Donald Trump's social media company begins trading publicly Tuesday, would-be investors might ask themselves if the stock is too pricey and potentially too volatile.  An Ontario woman is out more than $900 after a U.S. car rental company said it no longer accepts Canadian car insurance.  At least one Costco store in Ottawa has implemented a digital card scanner for member entry, a departure from the traditional in-person card check, in an effort to crack-down on shoppers who have not paid a membership fee.  Twenty-two victims of the Russia concert hall attack that killed more than 130 people remain in serious condition in the hospital, Health Minister Mikhail Murashko said Tuesday, according to state news agency Tass. Two of them are children, it said.  A 'secret' Royal Canadian Mounted Police report paints a dark picture of Canada's future due to climate change, misinformation, a global recession and other troubling trends.  More than a decade ago, the death of 600 migrants and refugees in two Mediterranean shipwrecks near Italian shores shocked the world and prompted the UN migration agency to start recording the number of people who died or went missing as they fled conflict, persecution or poverty to other countries.  The Doug Ford government will table the 2024 Ontario budget on Tuesday.  The Manitoba government has agreed to pay $530 million to settle three class-action lawsuits over child welfare benefit payments in an agreement that plaintiffs say should send a message to other provinces.  RCMP's Major Crimes unit is investigating following the discovery of four bodies at a rural residence near the village of Neudorf, Sask.  It's been more than a month since an Orleans man was chased, shocked with a stun gun and beaten by Ottawa police officers in a case of mistaken identity. Ahead of Monday's Ottawa Police Board Services Board meeting, Chief Eric Stubbs addressed the incident, citing 'deep regret'.  A young child died in B.C.'s Cariboo region over the weekend when a utility task vehicle fell through the ice on Tyee Lake, according to authorities.  A hospital in Listowel, Ont. is temporarily shutting down its obstetrics department because too many of its registered nurses will be off on maternity leave.  Hackers linked to the Chinese government launched a state-sponsored operation that targeted New Zealand's Parliament in 2021, the country's security minister said Tuesday.  Robert F. Kennedy Jr. plans to announce his running mate Tuesday as he races to secure a place on the ballot for his independent campaign for president.  A suicide bomber in northwest Pakistan rammed his explosive-laden car into a vehicle Tuesday, killing five Chinese nationals and their Pakistani driver, police and government officials said.  Prime Minister Benjamin Netanyahu on Tuesday vowed to press ahead with Israel's offensive and blasted a UN Security Council resolution calling for a pause in the fighting, saying it had emboldened Hamas to reject a separate proposal for a ceasefire and hostage release.  More than a decade ago, the death of 600 migrants and refugees in two Mediterranean shipwrecks near Italian shores shocked the world and prompted the UN migration agency to start recording the number of people who died or went missing as they fled conflict, persecution or poverty to other countries.  Rescuers are searching for at least seven people in the water after a massive container ship collided with the Francis Scott Key Bridge early Tuesday, causing the bridge to collapse and sending people and vehicles into the frigid water.  Canada welcomes the United Nations Security Council's call for a ceasefire in the war between Israel and Hamas during Muslim holy month of Ramadan, Foreign Affairs Minister Melanie Joly said Monday.  Dozens of Liberal members of Parliament are calling on the finance minister to set aside money for the Canada Disability Benefit in next month's federal budget.  Canada airlifted 18 vulnerable Canadians out of Haiti by helicopter to the Dominican Republic on Monday, and Foreign Affairs Minister Mélanie Joly says more will be offered the chance to evacuate in the coming days.  Dr. Garni Tatikian is having second thoughts about her future as a family doctor because of what she calls unfair salaries. Tatikian was among the Canadian health-care workers who shared their experiences with CTVNews.ca about the problems driving some to consider leaving the profession or quit altogether.  Two young people who were diagnosed with cannabis-induced psychosis are supporting an expert panel's recommendation that Health Canada establish a standard dose for cannabis, saying it would help nudge people toward safer consumption.  A hospital in Listowel, Ont. is temporarily shutting down its obstetrics department because too many of its registered nurses will be off on maternity leave.  The British Columbia government is warning people about a scam involving its PayBC website, where an \"identical fake website\" is collecting personal and credit card information.  New York City's celebrity owl Flaco was suffering from a severe pigeon-borne illness and high levels of rat poison when he crashed into a building and died last month, officials at the Bronx Zoo said Monday.  If content creators and corporate executives made TikTok videos about the platform’s possible U.S. demise, disco diva Gloria Gaynor’s \"I Will Survive\" could supply the soundtrack.  Harold Butler opened a kitchen drawer one night and found the instrument that would one day land him on national television.  In response to a CNN question about reports of raids of Sean 'Diddy' Combs' homes, the Department of Homeland Security Investigations (HSI) said that as part of an ongoing investigation they, along with other law enforcement partners, had 'executed law enforcement actions.'  Rebel Wilson is claiming Sacha Baron Cohen has tried to stop the release of her upcoming memoir, 'Rebel Rising.'  As Donald Trump's social media company begins trading publicly Tuesday, would-be investors might ask themselves if the stock is too pricey and potentially too volatile.  At least one Costco store in Ottawa has implemented a digital card scanner for member entry, a departure from the traditional in-person card check, in an effort to crack-down on shoppers who have not paid a membership fee.  A major Canadian food retailer was fined thousands of dollars after one of its B.C. grocery stores sold wine to a 16-year-old.  There’s a group of people in Saskatoon that proudly call themselves dumpster divers, and they’re turning the city’s trash into treasure.  Beauty is in the eye of the beholder and when you throw in nature and mix it with art, the results can be stunning. That's the case with Saskatchewan artist Rich Loffler, who has a way of bringing life to everything he works on.  PowerPoint nights involve little more than an HDMI-compatible TV, a slideshow and a willingness to razz your friends or reveal your hidden passions.  Dennis Schroder's return to Toronto was supposed to be his chance to get a measure of revenge against his former teammates but his comeback was overshadowed by off-court issues affecting the Raptors.  Toronto Blue Jays relievers Jordan Romano and Erik Swanson are expected to begin the season on the injured list in a significant blow to the back end of the team's bullpen.  Shohei Ohtani said Monday he never bet on sports or knowingly paid any gambling debts accumulated by his longtime interpreter, Ippei Mizuhara.  An Ontario woman is out more than $900 after a U.S. car rental company said it no longer accepts Canadian car insurance.  Recent unconventional guidance from a Toronto police officer has sparked a wider discussion about car theft across the province.  A retreat in new car purchases helped push the country's retail sales down 0.3 per cent to $67 billion in January, Statistics Canada said Friday.  There’s a group of people in Saskatoon that proudly call themselves dumpster divers, and they’re turning the city’s trash into treasure.  The Doug Ford government will table the 2024 Ontario budget on Tuesday.  The owner of an e-bike business says he has doubts police will find the roughly $500,000 worth of product that was stolen from a shipping container last week, while police say he “complicated” their investigation by posting video of the theft.  At least one Costco store in Ottawa has implemented a digital card scanner for member entry, a departure from the traditional in-person card check, in an effort to crack-down on shoppers who have not paid a membership fee.  With the solar eclipse just a week away, it’s time to think about how to safely view the celestial show.  Calgary singer-songwriters Tegan and Sara were honoured at this year's Juno Awards for their efforts to support 2SLGBTQ+ youth.  The Department of National Defence expects to have a contract in place by the end of this year to build a new military drone base in British Columbia.  Alberta is spending millions of dollars on technology projects to help conserve, track and manage water usage as the province faces the risk of extreme drought conditions into the spring and summer.  Beauty is in the eye of the beholder and when you throw in nature and mix it with art, the results can be stunning. That's the case with Saskatchewan artist Rich Loffler, who has a way of bringing life to everything he works on.  B.C. researchers are warning drivers in eastern Canada to take extra caution on the road during the upcoming total solar eclipse, as data from the 2017 event showed a surge in fatal incidents.  The owner of an e-bike business says he has doubts police will find the roughly $500,000 worth of product that was stolen from a shipping container last week, while police say he “complicated” their investigation by posting video of the theft.  Over the past 11 years, Love a Bull Rescue Society has found fosters and forever homes for over 500 bully breed dogs that were surrendered or abandoned. Now, it's closing.  An Ontario woman is out more than $900 after a U.S. car rental company said it no longer accepts Canadian car insurance.  The Doug Ford government will table the 2024 Ontario budget on Tuesday.  Durham police say two suspects armed with a large knife discharged what is believed to be pepper spray in a movie theatre in Oshawa over the weekend before fleeing.  The federal government is making a housing announcement in Calgary Tuesday morning.  The Calgary police homicide unit is investigating the death of a man inside a hotel in Shawnessy on Monday afternoon, after shots were reportedly fired.  After more than four years of construction and at least $34 billion in costs, the Trans Mountain pipeline expansion project is nearly complete.  An Ottawa woman said when she suspected someone was trying to gain access to her BMO account, she went to the branch to inform the bank. She was told everything was fine but, by the time she got home, $15,000 had been stolen.  Rescuers are searching for at least seven people in the water after a massive container ship collided with the Francis Scott Key Bridge early Tuesday, causing the bridge to collapse and sending people and vehicles into the frigid water.  Renfrew Mayor Tom Sidney is facing calls to resign from the town's top political position, two months after council voted non-confidence in the mayor.  Nearly 400 police officers are on the ground in Montreal as part of a 'major operation' by the RCMP.  Wintry weather is not over yet for parts of Quebec.  If you're worried that your plumbing may contain traces of lead, the City of Montreal has created an interactive map to help put your mind at ease.  Dr. Garni Tatikian is having second thoughts about her future as a family doctor because of what she calls unfair salaries. Tatikian was among the Canadian health-care workers who shared their experiences with CTVNews.ca about the problems driving some to consider leaving the profession or quit altogether.  The province has taken steps to help clients of Contentment Social Services (CSS) who were being housed in a Leduc hotel.  A teen who was the driver in a high-speed crash that killed two people has been sentenced to 24 months probation.  Two people have died following a tent fire Monday afternoon in Saint John, N.B.  Rescuers are searching for at least seven people in the water after a massive container ship collided with the Francis Scott Key Bridge early Tuesday, causing the bridge to collapse and sending people and vehicles into the frigid water.  People living at the Shubie Campground in Dartmouth throughout the winter are anticipating their living arrangement with the city to come to an end.  Harvest Manitoba is sounding the alarm over concerns baby formula the non-profit donated to those in need is being resold online.  The Parole Board of Canada has denied day release for a man who beat and sexually assaulted a girl and a woman in separate random attacks in Winnipeg a decade ago.  Mounties are investigating a two-vehicle collision on a Manitoba highway where a woman died and three people, including a two-year-old, were hurt.  RCMP's Major Crimes unit is investigating following the discovery of four bodies at a rural residence near the village of Neudorf, Sask.  With ongoing job action by Saskatchewan teachers and no end in sight to a contract dispute with the provincial government, some high school students in the province are worried graduation ceremonies could be cancelled.  The Government of Saskatchewan has given the \"green light\" to establish MRI services in Estevan. The decision comes after the province turned down a multi-million dollar private donation intended for the service late last year.  Thanks to the MRI at St. Mary’s General Hospital, patients who require heart scans will no longer need to be transferred.  Farmers in Wilmot Township are fighting back against plans to turn their land into an industrial site.  Documents show the landlord lost the home to lenders days after the lease started, but no one told the tenants.  There’s a group of people in Saskatoon that proudly call themselves dumpster divers, and they’re turning the city’s trash into treasure.  Roman Iula and his peers were supposed to be putting the final touches on their routine for Saskatoon high school dance and cheer city finals.  RCMP's Major Crimes unit is investigating following the discovery of four bodies at a rural residence near the village of Neudorf, Sask.  A building in downtown North Bay is destroyed after a fire broke out overnight.  How bad weather and disease in West Africa is affecting a northern Ontario chocolate shop as Easter approaches.  An investigation into a suspected drug dealer in Greater Sudbury resulted in the arrest of a 43-year-old woman, three search warrants and the seizure of $39,000 in drugs, police say.  Rescuers are searching for at least seven people in the water after a massive container ship collided with the Francis Scott Key Bridge early Tuesday, causing the bridge to collapse and sending people and vehicles into the frigid water.  The Doug Ford government will table the 2024 Ontario budget on Tuesday.  A man is in critical condition after being struck by a train in west London, Ont. on Monday afternoon.  The Simcoe Muskoka Regional Cancer Centre has been officially renamed the David and Catherine Hudson Regional Cancer Centre.    Two men from Wasaga Beach face weapons charges after reports of a shooting on Mosley Street early Wednesday afternoon.  Rescuers are searching for at least seven people in the water after a massive container ship collided with the Francis Scott Key Bridge early Tuesday, causing the bridge to collapse and sending people and vehicles into the frigid water.  After investigating, police said four people, two men and two women, were involved in the incident where a meeting had been prearranged to try and resolve a dispute.  The Doug Ford government will table the 2024 Ontario budget on Tuesday.  The Law Society of British Columbia has disbarred a former Victoria lawyer who misappropriated $100,000 from a client and made false and misleading claims to those he had represented, according to a decision by the society's disciplinary tribunal.  The Department of National Defence expects to have a contract in place by the end of this year to build a new military drone base in British Columbia.  An 87-year-old man who had been missing from Nanaimo, B.C., since March 17 has been found dead.  Kris Stewart has her hands full with two rambunctious, 10-week-old kittens after cloning her beloved cat Bear.  The latest funding to flow through British Columbia's Community Housing Fund will add nearly 600 rental homes to communities in the Interior and northern B.C.  Mounties in Kelowna are warning members of the public of \"potential fraudsters\" they say are collecting money for a charity that may not exist.  Around 35 centimetres of snow fell in Lethbridge over the past six days, and while experts say it will help avoid a potential drought, it all matters on how slowly it melts.  Lethbridge police are looking for video of a hit-and-run on Sunday afternoon that saw a woman and her dog hit by a vehicle, killing the dog.  The City of Lethbridge is providing a lifesaving kit at the Exmax Centre as part of a public awareness campaign aimed at promoting first-aid during emergencies.  How bad weather and disease in West Africa is affecting a northern Ontario chocolate shop as Easter approaches.  A trucking company based in Alberta has been fined $125,000 for environmental offences in northwestern Ontario that date back to 2021.  The province's Special Investigations Unit is probing an altercation in Thessalon, Ont. on Friday night where a man has survived a police shooting and is now in stable condition at a hospital.  Harold Butler opened a kitchen drawer one night and found the instrument that would one day land him on national television.  Fish harvesters in Newfoundland and Labrador are declaring victory in their negotiations with the provincial government, and are heading home after a recent protest that brought out riot police in St. John's.  Newfoundland and Labrador's provincial government delivered its annual budget to a half-empty legislature Thursday, as opposition politicians boycotted the speech and protesters stared down riot police outside.  The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. © 2024 \n\n All rights reserved. Use of this Website assumes acceptance of Terms & Conditions and Privacy Policy "
}