{
    "title": "Apple Card is helping cardholders live healthier financial lives",
    "date": "1/30/2024",
    "url": "https://www.apple.com/newsroom/2024/01/apple-card-is-helping-cardholders-live-healthier-financial-lives/",
    "text": "Text of this article January 30, 2024 UPDATE Apple Card is helping more than 12 million cardholders live healthier financial lives Users earned more than $1 billion in Daily Cash from spending on Apple Card last year Five years after Apple Card was first introduced in 2019, 12 million Apple Card users are reaping the benefits of Apple Card’s award-winning experience. From easy-to-navigate spending tools, to Apple Card Family, and the recently added Savings account,1 Apple Card continues to reinvent the credit card experience and provide features designed to help users lead healthier financial lives. “We designed Apple Card with users’ financial health in mind, and it’s rewarding to see our more than 12 million customers using its features to make healthier financial decisions,” said Jennifer Bailey, Apple’s vice president of Apple Pay and Apple Wallet. “We’re proud of what we’ve been able to deliver to Apple Card customers in just five years. As we look at the year ahead and beyond, we’re excited to continue to innovate and invest in Apple Card’s award-winning experience, and provide users with more tools and features that help them lead healthier financial lives.” “Since the launch of Apple Card, the customer response has been excellent, and we are pleased that we continue to see users incorporate the innovative tools and features into their financial lives,” said Bill Johnson, Goldman Sachs’s CEO of Enterprise Partnerships in Platform Solutions. “We are committed to continuing to deliver an excellent experience for Apple Card customers.” Using Apple Card’s digital-first tools and benefits, users are: Built into Wallet on iPhone, Apple Card has transformed the credit card experience by offering easy-to-use digital tools, creating even more ways users can get the most out of their rewards, and helping customers build and extend healthy financial habits — all while offering the privacy and security users expect from Apple. Apple Card was also named the Best Co-Branded Credit Card for Customer Satisfaction with No Annual Fee in the J.D. Power 2023 U.S. Credit Card Satisfaction Study, marking the third consecutive year Apple Card and issuer Goldman Sachs have been recognized by J.D. Power with a No. 1 ranking in their segment in the U.S. Credit Card Satisfaction Study.5 More information about Apple Card is available at apple.com/apple-card. Press Contacts Kimberly Mai Apple k_mai@apple.com Alyssa Hayes Apple ag_hayes@apple.com Heather Norton Apple heather_norton@apple.com Apple Media Helpline media.help@apple.com Kimberly Mai  Apple k_mai@apple.com  Alyssa Hayes  Apple ag_hayes@apple.com  Heather Norton  Apple heather_norton@apple.com  Apple Media Helpline   media.help@apple.com  The latest news and updates,  direct from Apple. Read more "
}