{
    "title": "11 Stocks Jim Cramer Recommended Selling, But Billionaires Love Them",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/news/11-stocks-jim-cramer-recommended-131657665.html",
    "text": "In this article, we will take a detailed look at the 11 Stocks Jim Cramer Recommended Selling, But Billionaires Love Them. For a quick overview of such stocks, read our article 5 Stocks Jim Cramer Recommended Selling, But Billionaires Love Them. Jim Cramer recently talked about the top themes of 2024 he's eyeing. Cramer said that he likes to talk about themes that investors can always fall back to. Cramer's top theme for 2024 is, unsurprisingly, AI. Related to this theme, Cramer talked about his expectations for this year and said that he's expecting a few stocks from the Magnificent Seven group to fall from their 2023 glory. Some Mag. 7 stocks Cramer has been recommending investors in 2023 include Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Cramer said that Tesla will be first to go down in the Magnificent Seven group of stocks. Cramer criticized Elon Musk's latest demands in which he said he needs to take a 25% control of Tesla in order to make it a leader in AI and robotics. Cramer called this \"pure hubris.\" Cramer also talked about some research reports which believe Apple will have a terrible time in the start of 2024 amid problems in China. Regarding the election 2024 theme, Cramer said that there has never been a president more friendly for the stock market than Donald Trump was. \"He measured himself by the Dow,\" Cramer said of Trump. Cramer said that Trump will \"fight for the rich like no other\" and the analyst expects the former President of the US to speak against capital gain tax, which Cramer thought would result in \"market soaring.\" Methodology For this article we first listed down all the stocks Jim Cramer has been recommending investors to sell or stay away from over the past 12 months. From these stocks we picked stocks with the highest number of billionaire investors. We used Insider Monkey's proprietary database of billionaires and their stock holdings to find the number of billionaire investors for these companies Number of Billionaire Investors: 6 Jim Cramer has long been bearish on Riot Platforms Inc (NASDAQ:RIOT) and recommending investors to stay away from this stock. Recently, Jim Cramer made the following comment about Riot Platforms Inc (NASDAQ:RIOT): \"Let’s stop fooling around. If you want bitcoin, buy bitcoin. I think bitcoin’s topping out, by the way, so I’m going to say, enough is enough and ka-ching is ka-ching.” In November 2023, Jim Cramer had said that Riot Platforms Inc (NASDAQ:RIOT) does not make any money and investors should own Bitcoin directly if they want to get exposure to crypto. Insider Monkey's database of billionaires shows that six billionaires had stakes in Riot Platforms Inc (NASDAQ:RIOT). Jim Cramer is bearish on RIOT but recommends buying Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Number of Billionaire Investors: 7 Earlier this month Jim Cramer categorically recommended investors to hit eject on semiconductor stock Navitas Semiconductor Corp (NASDAQ:NVTS). Jim Cramer said that Navitas Semiconductor Corp (NASDAQ:NVTS) is not making any money. \" In this market, they’ve got to make money...Let’s just exit Navitas.” A total of seven billionaires in Insider Monkey's database had stakes in Navitas Semiconductor Corp (NASDAQ:NVTS) as of the end of the third quarter of 2023. Baron Discovery Fund made the following comment about Navitas Semiconductor Corporation (NASDAQ:NVTS) in its Q3 2023 investor letter: “Navitas Semiconductor Corporation (NASDAQ:NVTS) is a leader in gallium nitride (GaN) power semiconductors and a smaller player in silicon carbide (SiC) power semiconductors. These are both new materials used as a base (substrate) on which to print power-oriented chip circuits. Shares fell during the quarter as the stock was trading at a premium valuation heading into the quarter, and investors were broadly concerned about underlying demand conditions in key end-markets like smartphones. Despite near-term concerns, the company reiterated its outlook to double revenues in 2023, reported strong design win momentum, and indicated opportunity pipeline growth. Navitas sells monolithically integrated GaN power integrated circuit chips (completed printed circuit systems on a chip), which provide greater reliability and performance compared to competitors that supply discrete power devices (multiple individual, larger components put together on a chip). It recently purchased a silicon control company to drive integration and performance even further, and its SiC products offer high performance across many different applications. The company’s high-power GaN product launches remain on track for data center, solar, and electric vehicle applications. We expect Navitas to gain share in the rapidly growing GaN and SiC power semiconductor markets over time, driven by its superior technology.” Number of Billionaire Investors: 7 In early January, Jim Cramer recommended investors to \"move on\" from petroleum services company Tidewater Inc (NYSE:TDW). Cramer said the stock has moved too much. Over the past one year the stock has gained about 61%. In November Tidewater Inc (NYSE:TDW) posted third quarter results. GAAP EPS in the period came in at $0.49. Revenue in the quarter came in at $299.3 million, beating estimates by $7.39 million. As of the end of the September quarter of 2023, seven billionaires tracked by Insider Monkey had stakes in Tidewater Inc (NYSE:TDW). Third Avenue Small-Cap Value Fund made the following comment about Tidewater Inc. (NYSE:TDW) in its Q3 2023 investor letter: “Finally, long-time holding, offshore oil services company, Tidewater Inc. (NYSE:TDW) rose 31% in the quarter, as more investors and operators recognized the importance of investing in fossil fuels to sustain long-term economic growth and national security. In a challenging environment for most asset classes, Energy was a considerable outperformer this past quarter, illustrating the potency of the investor pivot.” Number of Billionaire Investors: 7 In the summer of 2023, Jim Cramer recommended investors to stay away from  solid state lithium battery company Quantumscape Corp (NYSE:QS). Cramer had said that there was \"nothing there\" for the stock. Over the  past 12 months the stock has lost about 10% in value. A total of seven billionaires in Insider Monkey's billionaires database held stakes in Quantumscape Corp (NYSE:QS). Some notable billionaires having stakes in Quantumscape Corp (NYSE:QS) include Ken Griffin, DE Shaw and Israel Englander. Number of Billionaire Investors: 8 Jim Cramer in 2023 recommended investors to sell optical materials company Coherent Corp (NYSE:COHR) shares since he said Coherent Corp (NYSE:COHR) was not making any money. However, Cramer acknowledged that Coherent Corp (NYSE:COHR) has a strong product. Earlier this month, Goldman Sachs published a list of stocks with weak pricing power that can outperform. Coherent Corp (NYSE:COHR) made it to the list. A total of eight billionaires in Insider Monkey's billionaire database had stakes in Coherent Corp (NYSE:COHR). Liberty Park Capital made the following comment about Coherent Corp. (NYSE:COHR) in its Q3 2023 investor letter: “After its stock nearly doubled on enthusiasm surrounding artificial intelligence, Coherent Corp. (NYSE:COHR) fell nearly 40% in one day after announcing weaker-than-expected 3Q guidance. We viewed the stock move as an over reaction and closed our short position.” Number of Billionaire Investors: 8 Jim Cramer had been bearish on Plug Power Inc (NASDAQ:PLUG) throughout 2023 and in December he said he was finally \"pulling the plug\" on the hydrogen fuel cell company. In August 2023 Jim Cramer was saying that investors should take profits on Plug Power Inc (NASDAQ:PLUG) shares should the stock bounce back. Over the past 12 months Plug Power Inc (NASDAQ:PLUG) stock has lost about 82% in value. Still, eight billionaires in Insider Monkey's database had stakes in Plug Power Inc (NASDAQ:PLUG). Some notable billionaire stakeholders of Plug Power Inc (NASDAQ:PLUG) were Israel Englander, Steve Cohen, Ken Griffin and DE Shaw. Unlike PLUG, Cramer is bullish on Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Click to continue reading and see 5 Stocks Jim Cramer Recommended Selling, But Billionaires Love Them. Suggested Articles: 11 Best Jim Cramer Stocks To Buy According to Billionaires 13 Best Jim Cramer Stocks To Buy Now George Soros and Jim Cramer Love These Stocks Disclosure. None. 11 Stocks Jim Cramer Recommended Selling, But Billionaires Love Them was initially published on Insider Monkey. Related Quotes "
}