{
    "title": "Apple's Earnings Show Its Steady State Weakness (NASDAQ:AAPL)",
    "date": "2/5/2024",
    "url": "https://seekingalpha.com/article/4667506-apples-earnings-show-its-steady-state-weakness",
    "text": " ozgurdonmaz Apple (NASDAQ:AAPL) announced its earnings, with a small dip after hours. Given the much larger volatility seen with the earnings of other technology stocks, one might assume that the earnings were middle of the road. However, as we'll see throughout this article, the company's earnings indicate some fundamental weakness that will hurt shareholder returns. The company saw net sales in the most recent quarter increase by roughly 1.5%. That was less than YoY inflation. Apple Investor Relations The company's revenue growth also came almost completely from services which has double-digit revenue increase. Product sales remained roughly flat. That's concerning because of some risks in the services business that we'll discuss before. Overall it's clear above that the company's product growth has mostly flatlined. While people are excited about the Vision Pro and initial indications are positive, that is an independent growth sector. Whether or not it grows remains to be seen. However, as we can see from the graph below, even if it becomes as big as the Mac or the iPad, it will give the company ~6% revenue growth. Apple Investor Relations The above shows the company's segment performance. Europe especially was a bright spot in the company's portfolio along with Japan, however, the company's Greater China impact was clear. With the iPhone being restricted in China, and revenue declining there, the company needs to make it up elsewhere. The company's latest iPhone also improved YoY. The company's iPad revenue declined substantially but that's not surprising given that the company launched no additional iPads in 2023. That means that the company's true environment iPad revenue, once new ones come out, could be more like ~$121 billion in annual revenue with 3.4% inflation in 2023, that means the company still barely lined up with inflation. The company's cash flow shows what we'll discuss as its longer term conundrum. Apple Investor Relations The company's operating expenditures increased very modestly, but the company maintained strong operating income as it increased its margins. The company's net income was just a hair under $34 billion, representing double-digit YoY increase. A big part of this is the company cut cost of sales by $2 billion, which went straight into its bottom line. That cash flow, $34 billion in net income for the quarter, is the company's traditionally strongest quarter of the year. Given the company's $2.9 trillion market cap, the company's annualized net income is just under $100 billion. That's an earnings yield of ~3.5%. At the end of this, the question is how can the company continue to provide shareholder returns. The company effectively uses the entirety of its cash flow to pay its dividend and repurchase shares. The company has a dividend yield of just over 0.5%, which costs the company almost $15 billion on the annualized basis. Effectively the remaining $85 billion goes entirely to share buybacks. The company's outstanding share count decreased by 380 million YoY. The company's total share buybacks for the year were roughly $78 billion. That's more than 90% of the company's remaining FCF. The company's average price per share was ~$205 but that's because of continued dilution from employee compensation (>$10 billion annually). That means ~13% of the company's annualized share price repurchases goes to employee compensation. Those share repurchases help the company over time, but they are slow. Long-term with minimal profit growth we don't see the company as having a path to go past 3-4% in annualized share returns. That's lower than the 30-year treasury yield. That higher yield with lower risk is worth paying close attention to. The company has a number of major risks given its current valuation. The first is the pressure to open up the app store. Services has continued to be a bright spot in the company's portfolio and the company has resisted pressure to cut margins. That's led to a variety of different lawsuits. Being forced to open the app store could lead to a dramatic reduction in margins in what's the company's growth sector. Google also pays Apple 36% of Safari search engine revenue. That paid revenue is also facing lawsuits over arguments the payment in the $10s of billions annually has incentivized Apple not to develop its own search engine. Legal pressures to not continue that payment, depending on the outcome of the lawsuit, could cost Apple a large % of its profits. The second is the U.S. - China trade war. The U.S. has been increasing the pressure on China and it's been working. However, unfortunately, while the iPhone is a cool piece of technology it's not an essential piece of replaceable technology. Apple remains a major company and employer in China, but the Chinese government is already looking to pressure iPhone sales. Given the YoY performance in Chinese sales above, one of the company's biggest growth areas is clearly in trouble. Weak Chinese economic performance is also worth paying close attention to. These risks are worth paying close attention to given the company's lofty valuation, which could significantly impact returns. Apple is a great company and one of the most profitable companies in the world. The company runs a streamlined operation where the profits of its massive brand go to the pockets of shareholders directly. It's adept at continuously repurchasing shares and paying out its modest dividend, but growth in both of those is minimal. With minimal growth and substantial risks, we don't see Apple's shareholder returns increasing past its 3-4% yield anytime soon. That makes the company a poor investment that will lag the S&P 500. Overall, that makes Apple stock a poor long-term investment. Let us know your thoughts in the comments below. The Retirement Forum provides actionable ideals, a high-yield safe retirement portfolio, and macroeconomic outlooks, all to help you maximize your capital and your income. We search the entire market to help you maximize returns. Recommendations from a top 0.2% TipRanks author! Retirement is complicated and you only get once chance to do it right. Don't miss out because you didn't know what was out there.  We provide: Click for our discounted 2-week free trial! This article was written by The Value Portfolio specializes in building retirement portfolios and utilizes a fact-based research strategy to identify investments. This includes extensive readings of 10Ks, analyst commentary, market reports, and investor presentations. He invests real money in the stocks he recommends. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}