{
    "title": "Apple Vision Pro: virtual reality attempts to take over the world again",
    "date": "2/12/2024",
    "url": "https://english.elpais.com/technology/2024-02-12/apple-vision-pro-virtual-reality-attempts-to-take-over-the-world-again.html",
    "text": "Last week, videos of people trying out Vision Pro, Apple’s new virtual reality glasses, spread across the internet (which is to say, around the world) like wildfire. As a viral phenomenon, this is understandable: Apple specializes in generating impact, and videos of the new product look genuinely revolutionary. It’s easy to believe that we are on the verge of a technological revolution. Accordingly, a host of news programs have recently started with opening segments featuring the glasses in question. The truth is, they’re not that big of a deal. There have been companies before Apple that have gotten into the virtual reality thing. HTC, Sony, Meta, of course (for proof of how invested Facebook is in the concept of Metaverse, look no further than its name change). And if we’re being honest, none of these incursions have gone particularly well. To give you an idea, between 2020 and 2024, Meta’s virtual reality division lost $42 billion. For an even more precise idea, know that a week ago, when the company presented its sales data for the last quarter of 2023, it was genuinely happy to have “only” lost $4.5 billion in that division. Clearly, only a company like Meta, which is one of the 10 most valuable corporations in the world, can afford such a venture. Or a company like Apple, which can’t be expecting a massive influx of sales for glasses that cost $3,500. All in all, Apple has to be credited with a certain revolutionary spirit — but not so much for its new device as much as the philosophy behind it. The fact is, in a general sense, Apple is displaying a commitment not so much to virtual reality, but to augmented reality. Which is to say that the company’s philosophy breaks with that of Meta and other previous VR glasses manufacturers, who were basically set on teleporting us to a virtual universe as we sat on our couch. Apple wants to get us out the door, walking down the street, interacting with the world around us — with glasses designed to anabolize reality. Their idea is not so much that you’ll be able to have a work meeting from your living room so much as when you head to a restaurant, next to its front door a pop-up window will appear that shows its reviews, promotions and menu. And don’t forget video games in the virtual universe. We’ve already complained in this publication about Valve, which, in a very calculated and somewhat classist strategy, refuses to let its Half Life: Alyx (the best 3D video game ever created) interact with the rest of the world. But Alyx aside, the truth remains that virtual reality has given us some pleasant surprises of late. Specifically, two surprises: Asgarth’s Wrath II and Assassin’s Creed Nexus. The first, released in December during an inopportune moment, could have been among the best games of the year if Meta’s press and distribution were bigger and better. It is genuinely good: a medieval fantasy full of magic, with a solid storyline and remarkable length and depth, which deserves its place on the list of the best games ever created for this technology. The second, the three-dimensional translation of the Assassin’s Creed universe, is a stupendous recreation of the feelings imparted by the saga’s heroes. It’s short, but very intense, and clocks many successes in areas from combat to parkour, not to mention the lucid recreation of regions and cities. Undoubtedly, the game is indicative of the way forward for VR video games, a harbinger of what’s to come for the rest of the digital world. What succeeds here signals future success in the mass market. Virtual reality glasses must be refined as a product, that’s for sure. They need to work on their dizziness factor, they need to get lighter and fix the discomfort the cause to the eyes and nose. They should be more autonomous, more functional. In a word, they should be more comfortable, something that today, they are not. They should be many things, yes, but anyone who has the chance to try them will be immediately aware of their transformative potential. Put them on and you’ll see, within a few seconds, that these glasses are gazing towards everything we’ve mentioned here. Sign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition Suscríbete y lee sin límites "
}