{
    "title": "Warren Buffett Sold Apple While Continuing To Buy 2 Big Dividend Energy \nStocks",
    "date": "2/29/2024",
    "url": "https://247wallst.com/investing/2024/02/29/warren-buffett-sold-apple-while-continuing-to-buy-2-big-dividend-energy-stocks/",
    "text": "If any investor has stood the test of time, it’s Warren Buffett, and with good reason. For years, the “Oracle of Omaha” has had a rock star-like presence in the investing world, and his annual Berkshire Hathaway shareholders meeting draws thousands of loyal fans who are investors. Known for his long buy-and-hold strategies and his massive portfolio of public and private holdings, he remains one of the preeminent investors in the entire world. Long-time investors and Buffett mavens are familiar with his quote, “His favorite holding for an S&P 500 stock is forever”, so it’s not surprising to report that for all of the success and stature Berkshire Hathaway has in the investment world, the 5 top companies make up almost 75% of the fund’s total holdings. While much more concentrated than most portfolio managers would ever consider, the strategy has worked for Berkshire Hathaway investors for years and likely will in the future. While the portfolio moves are generally not earth-shaking, selling some of the most significant positions in Berkshire Hathaway is very notable. In addition, Warren Buffett continues to add shares to his energy positions. In a move that surprised many, Berkshire Hathaway reported selling 10 million shares of Apple Inc. (NASDAQ: AAPL) in the last quarter of 2023. While for most portfolio managers, that would be a gigantic portfolio move, it was the proverbial drop in the bucket as the fund still holds 905,560,000 shares, which equates to a 5.9% stake in the legacy technology leader. The sale only lowered Apple holdings by 1%. Despite the sale, Apple remains by far and away the largest holding in Warren Buffett’s portfolio. The stock is worth a stunning $164,069,380,800  at current trading levels and generates $869,337,600 in passive dividend income every year. Many Wall Street writers and analysts have commented on the sale, and while it’s not a big deal at the margin if Warren Buffet ever started selling shares on a large scale, Apple’s stock price could plunge. While the Apple sale was an eye-opener for many, Berkshire Hathaway bought another 4.3 million shares of Occidental Petroleum Corporation (NYSE: OXY) in early February. Mr. Buffett has loaded the boat on Occidental Petroleum, which pays Berkshire Hathaway a reported $897,455,953 in annual dividends. $218,255,953 from the common stock and $679,200,000 from Occidental preferred stock which yields 8%. Many on Wall Street feel that an additional purchase of 16 million more shares of Chevron Corporation (NYSE: CVX) not only speaks to Mr. Buffett’s bullish take on energy but also seems to re-enforce the decision by Chevron to forge ahead with the $53 billion merger with Hess Corporation (NYSE: HES). Chevron announced last fall that it has entered into a definitive agreement with Hess Corporation (NYSE: HES) to acquire all of the outstanding shares of Hess in an all-stock transaction valued at $53 billion, or $171 per share based on Chevron’s closing price on October 20, 2023. Under the terms of the agreement, Hess shareholders will receive 1.0250 shares of Chevron for each Hess share. The transaction’s total enterprise value, including debt, is $60 billion. Berkshire Hathaway owns 6.8% of Chevron’s outstanding stock with 126,093,326 shares, and the energy giant makes up 5.1% of the portfolio. Each year, the stock generates $776,734,888 in dividend income.        Take This Retirement Quiz To Get Matched With An Advisor Now (Sponsored) Are you ready for retirement? Planning for retirement can be overwhelming, that’s why it could be a good idea to speak to a fiduciary financial advisor about your goals today. Start by taking this retirement quiz right here from SmartAsset that will match you with up to 3 financial advisors that serve your area and beyond in 5 minutes. Smart Asset is now matching over 50,000 people a month. Click here now to get started. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}