{
    "title": "Before Usher hits the Super Bowl halftime stage, Apple Music builds \nanticipation ahead of big show",
    "date": "2/9/2024",
    "url": "https://apnews.com/article/super-bowl-halftime-show-apple-music-usher-ebffa612b35cf7c5d35f26ccbac5dfd5",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. We know a lot of Super Bowl attention has been focused on Taylor Swift, but we want to take a moment to focus on the person performing at the half-time show: Usher. Between his new album and tour announcement, it’s been a busy week. AP’s Gary Hamilton has more.           LAS VEGAS (AP) — In a short film shown at the end of the Super Bowl halftime performer news conference, the show’s headliner Usher comes up missing. The singer’s sudden absence prompts instant panic from his friends including Ludacris, Lil Jon and Taraji P. Henson, sparking a search at various Las Vegas landmarks. Ultimately, Usher is found splashing water while dancing in a Caesar’s Palace fountain in the seven-minute film “Where’s Usher!?” It’s one of the many creative projects from Apple Music, which has made a concerted effort to amplify the anticipation around Sunday’s halftime show. Since Apple Music became the halftime show sponsor, the streaming service is pushing to leave an influential mark like never before. “We’re trying to extend the campaign to more than just a show on a Sunday afternoon,” said Oliver Schusser, the vice president of Apple Music and Beats. The streaming service became the sponsor for the show in 2022 replacing Pepsi, which held the position for a decade. Schusser said Apple Music stepped in as a company that understands the music landscape. He called their partnership a “very powerful” one with the NFL and Jay-Z’s Roc Nation, which has produced the halftime show since 2019. “We want to make the halftime show press conference the artist moment,” Schusser said. “We really wanted to elevate that and make that great. We did that last year. This year, we made it even bigger.”  So far, Apple Music has gotten off to a promising start. Last year, the streaming service built a campaign for Rihanna — while keeping her pregnancy a secret — leading up to her performance, which became the most-watched in Super Bowl halftime history with more than 121 million viewers. As Usher prepares to headline this year’s festivities, Apple Music created a strategic plan before he hits the Super Bowl stage. The streaming service has been working with the singer and his team since meeting with him during last year’s Paris Fashion Week. “It’s been a journey with him and his management ever since,” Schusser said. “We want to make this a bigger and global event. Between Apple Music, Apple Music Radio, the talent who have a deep understanding of music and culture and obviously Apple’s ecosystem, I think we can amplify that.” Leading up to Sunday, it’s all about Usher. Through the streaming service’s app, listeners can check out the singer’s halftime show trailer, his curated My Road to Halftime playlist featuring his own hits and collaborators. Usher and Jermaine Dupri created a mix of songs in spatial audio with jams including DJs Tiësto, Gryffin and BLOND:ISH. Apple Music Radio’s Nadeska Alexis had a livestreamed sit-down interview Thursday with Usher where the short film was shown. There’s a story of Usher in 20 songs, an editorial feature that gives an in-depth look at his 30-year career as a performer. The platform offers a four-night Usher takeover through their live broadcasting shows hosted by Lil Wayne and Estelle along with exclusive programming on Apple Music Radio that will chronicle the singer’s evolution; workout music by past halftime performers through Fitness+ and ways to revisit his past projects before the release of his ninth studio album “Coming Home,” which comes out Friday. “From a marketing standpoint, we approach it like a product launch,” said Tor Myhren, vice president of marketing communications at Apple. “You have all the unique things about it then bring those to life. With Usher, the approach is that Usher is fun. Usher is a party. He wants to have a good time. It’s really about capturing the essence of that artist, putting that together with the essence of Apple Music.” Myhren said there’s still a focus on Usher’s performance after the Super Bowl. He said it’s imperative to capitalize off the singer’s show before turning the company’s attention to next year’s performer. “We still want people to bask in the glory of the show,” he said. “After any halftime artist plays, their streaming of their music the next week or two goes through the roof. We want to be in the middle of that. We want to give our customers a much better experience.” Myhren said the foundation has been laid. “It’s about the lead up to the show and how we can continue to reinvent that step,” he said. “We want to continue to bring this very cool musical experience to a much more global audience.” Copyright 2024 The Associated Press. All Rights Reserved. "
}