{
    "title": "Meta, Amazon report robust numbers; Apple posts mixed results",
    "date": "2/2/2024",
    "url": "https://www.moneycontrol.com/news/technology/meta-amazon-report-robust-numbers-apple-posts-mixed-results-12177871.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Three of the biggest tech companies reported their quarterly earnings on February 1. Meta announced its first-ever dividend, while Amazon posted strong earnings. However, Apple reported a sales slowdown in its key China market. These three tech companies are part of the so-called \"Magnificent Seven\" and have been driving a market resurgence. However, layoffs in the sector have recently caused optimism to cool down. Coming to the results, Apple announced its first revenue gain in over a year, though the company continues to grapple with a decline in global smartphone demand. The California-based company posted $119.58 billion in revenue and $2.18 in earnings per share (EPS), beating Wall Street expectations of $117.91 billion in full-year revenue and $2.10 in EPS. This 2 percent growth in sales is a positive sign for the tech giant, as it breaks the company's four-quarter streak of declining revenue. However, the company's shares dropped in after-hours trading. Despite the revenue growth, Apple's sales in China, its third-largest market, dropped from $23.9 billion to $20.8 billion. The company also saw a decline in global iPad sales, which dropped to $7 billion in the most recent quarter, from $9 billion in the same quarter last year. On a more positive note, Apple's iPhone sales increased to $69.7 billion in the three months ending in December 2023, up from $65.8 billion year-over-year. However, this news was dampened by the recent prediction by prominent analyst Ming-Chi Kuo, who forecasted that Apple's iPhone shipments would decrease by 15 percent year-over-year, due in part to a sizable drop in iPhone sales in China. Despite the challenges, Apple's services business maintained its growth, with the company posting $23.1 billion in revenue, up from $20.8 billion in services revenue the previous year. However, Microsoft overtook Apple as the world's most valuable company in January, hitting a $3 trillion valuation while Apple's market capitalisation slipped. Meta exceeded expectations with its fourth-quarter earnings report released on Thursday, revealing an impressive 25 percent increase in revenue from $32.2 billion to $40.3 billion. This marks the fastest rate of growth in any period since mid-2021 and is largely attributed to the rebounding online ad market, according to a CNBC report. Additionally, the company's cost-cutting measures led to an 8 percent decrease in expenses year over year, and an operating margin that more than doubled to 41 percent, indicating increased profitability. Compared to the previous year, Meta's net income increased more than threefold, from $4.65 billion to $14 billion, with earnings per share growing from $1.76 to $5.33. In a first for the company, Meta announced its intention to pay investors a dividend of 50 cents per share on March 26th. Meta also declared a $50 billion share buyback. Meanwhile, Amazon too, reported impressive fourth-quarter results on Thursday, surpassing analysts' expectations. The company's net income surged to $10.6 billion compared to $278 million in the same period last year. Furthermore, Amazon's first-quarter sales are expected to grow between 8 percent and 13 percent, reaching between $138 billion and $143.5 billion. This is higher than analysts' estimates of $142.1 billion, CNBC states. Amazon Web Services, the company's cloud computing division, saw sales climb 13 percent in the fourth quarter to $24.2 billion, in line with Wall Street's forecast. However, it was a deceleration from the year-ago period when sales grew 20 percent. On the other hand, Amazon's advertising unit saw impressive growth, with sales increasing by 27 percent year over year to $14.7 billion. The company has started showing ads on Prime Video content, which analysts predict will generate significant new revenue for the business. Wall Street Reaction Meta Platforms and Amazon.com saw a combined increase of $280 billion in their stock market value on Thursday after reporting their quarterly results. Apple's market value decreased by $70 billion following its results. Amazon's stock rose by 8 percent as the company exceeded expectations for December-quarter revenue growth due to strong online spending during the holiday shopping season. This brought the online shopping and cloud-computing giant's market capitalization to $1.78 trillion. Meta's shares rose by over 14 percent to a record high of $451, increasing its market capitalisation by $148 billion to $1.16 trillion. This came after the social media giant announced its first-ever dividend. Despite dividends being typically associated with mature, slow-growth companies, Meta delivered a 25 percent increase in revenue, reaching $40.1 billion in the December quarter, thanks to strong advertising and device sales. Apple's quarterly results were better than expected, but the company's sales in China fell short of estimates, which caused its stock to fall by 3.3 percent. Apple faces tough competition in China, and this has been a concern for Wall Street in recent months.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}