{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.cartoonbrew.com/tech/key-disney-exec-says-apple-vision-pro-is-a-big-deal-and-will-change-how-we-make-content-237637.html",
    "text": "By Amid Amidi | 02/04/2024 10:55 pm | Be the First to Comment! While many entertainment companies are taking a wait-and-see approach to Apple’s new Vision Pro spatial computing headset, The Walt Disney Company has been on board from day one. When Apple first unveiled the $3,500 vr/ar/mr headset last June, Disney was introduced as a key launch partner that would have an app ready for the device’s launch. “We’re constantly in search of new ways to entertain, inform, and inspire our fans by combining extraordinary creativity with groundbreaking technology to create truly remarkable experiences,” Disney CEO Bob Iger said at the time. “We believe Apple Vision Pro is a revolutionary platform that can make our vision a reality.” An article in Fast Company offers new insights into the Disney Company’s firm commitment to Apple’s tech, which officially launched this past Friday. It quotes Disney Entertainment & ESPN president and chief technology officer Aaron LaBerge, who describes Disney’s interest in the following way: “We’re a storytelling company, and this is a platform that allows us to tell stories in a different way. That’s why we were so excited about it.” At this early juncture, Disney hasn’t yet begun to tell any stories that are native to the Vision Pro. Rather, it has ported a version of its Disney+ streaming service to the headset. The Vision Pro version of Disney+ offers a series of 3d environmental skins, allowing users of the service to view films while, for example, on the scare floor of Monsters, Inc. or in the Avengers Tower. It’s a slick gimmick that is perhaps best explained by watching a video of someone exploring the interface: More ambitious projects are in the works. Disney is tight-lipped about what specifically it has planned for the Vision Pro with the exception of a single project that the company announced last year: an app based on Marvel’s animated What If…? series. According to Disney exec LaBerge though, this is only the beginning: This product has touched every part of our company, from the studios to the teams that manage our streaming services to our mobile developers. Even our teams at the parks have been involved in the things that we’re doing. Even more boldly, LaBerge claims that the Apple Vision Pro is “going to change our entire production and post-production pipeline. It’s going to change how we make content, how we operate our environments. It’s a big deal.” Time will tell whether Disney’s foray into ar/vr/mr is successful or it flops like the company’s now-shuttered metaverse division. And a lot of Disney’s future in this space is actually out of the company’s hands; rather it will be determined by Apple’s ability to turn the Vision Pro from a piece of novelty tech into an affordable and functional mass-consumer product. Should that happen, there could be plenty of success stories, from Disney and others. Amid Amidi is Cartoon Brew's Publisher and Editor-at-large. By Cartoon Brew Connect | 4 months ago By Cartoon Brew Connect | 3 months ago By Cartoon Brew Connect | 4 months ago By Jamie Lang | 14 mins ago By Jamie Lang | 22 hours ago By Jamie Lang | 1 day ago By Jamie Lang | 4 days ago By Jamie Lang | 4 days ago By Jamie Lang | 5 days ago By Joe Fordham | 5 days ago By Jamie Lang | 5 days ago By Jamie Lang | 6 days ago By Jamie Lang | 6 days ago By Jamie Lang | 7 days ago By Jamie Lang | 1 week ago "
}