{
    "title": null,
    "date": "2/14/2024",
    "url": "https://eftm.com/2024/02/mark-zuckerberg-tries-apple-vision-pro-and-reviews-it-compared-to-his-companys-meta-quest-3-242460",
    "text": "Select Page Posted by Trevor Long | Feb 14, 2024 | News, On The Radio, Tech I’ve seen some things in my time, but the CEO of one of the world’s biggest tech companies posting a four minute video talking about how his company’s product is better than the one the other big tech company just released is right up there on the charts of things I didn’t expect.  That’s what we got today on Mark Zuckerberg’s Instagram account. Apple Vision Pro is the device on the minds of all tech heads right now, it’s newly released and of course, it’s an all new product for Apple. When I used it, I did it with the years of experience using other and similar headsets, and I stand by my ongoing comments that “Apple Vision Pro is the single most remarkable piece of technology I’ve ever used.  I just don’t know why we need it.” While plenty of people love to come at Tech reviewers and a perceived bias that exists based on any number of factors, the Zuckerberg Post is pure gold. He does admit some solid wins to Apple, like “Apple’s eye tracking is really nice“, but goes on to say that Meta had that in Quest Pro and will likely bring it back in future. Likewise, “Apple’s screen does have a higher resolution, and, and that’s, that’s really nice” – but, “Apple’s headset has this motion blur as you move around, Quest is just a lot crisper.” Basically, Zuckerberg says in simple terms that Apple’s headset is heavy, has a narrow field of view and that Apple has made compromises in the creation of this device. Critically, Zuckerberg points out that you can do the same things on Quest 3 that people are demonstrating with the Apple Vision Pro – showing things like browser windows open in the augmented space. But what the Meta CEO never does is talk about the control of those windows and control generally, other than to touch on “for input, Quest supports precision controllers that are great for games. Both headsets support hand tracking, but you know, I found ours (Meta) to be a little more accurate.” Ahh, mate, this is buring the lede something solid.  The key and core difference here is that you don’t have to use clumsy controllers to do basic tasks on Vision Pro.  To skip over that is rather disingenuous overall. He even points to a future where a “Neural interface” might be used for control.  Completely skipping the era of hand controls. For the most part though, Mark Zuckerberg’s key points relate to a lack of things to do, content to use, games to play – he even noted you can Play Xbox on Quest 3. And this is – critically, Apple’s number 1 battle ground. Apple need – urgently, for developers to build the things we will do in Vision Pro.  To build the ideas that will make vision Pro a success. That might be multi-person virtual environments, games, or other applications, but it does showcase the core advantage Meta has right now.  Time.  They’ve had years working with developers on these headsets, Apple is starting from Scratch. Fascinating though for him to call it all out, so publicly.  A rising tide lifts all boats I assume.  Share: Trev is a Technology Commentator, Dad, Speaker and Rev Head.\r\n\r\nHe produces and hosts two popular podcasts, EFTM and Two Blokes Talking Tech. He also appears on over 50 radio stations across Australia weekly, and is the resident Tech Expert on Channel 9’s Today Show each day and appears regularly on A Current Affair.\r\n\r\nFather of three, he is often found down in his Man Cave.\r\n\r\nLike this post? Buy Trev a drink! September 6, 2018 May 4, 2018 May 28, 2021 April 16, 2020 Copyright 2021 EFTM Pty Ltd "
}