{
    "title": "Major Shareholders Planning to Force Apple to Reveal Use of AI",
    "date": "2/27/2024",
    "url": "https://www.macrumors.com/2024/02/27/shareholders-to-force-apple-to-reveal-ai-use/",
    "text": "Some of Apple's biggest investors are set to pressure the company tomorrow to reveal its use of artificial intelligence tools (via the Financial Times). Apple's annual shareholder meeting takes place tomorrow, allowing those with a major stake in the company to put forward proposals. One resolution proposed by the American Federation of Labor and Congress of Industrial Organizations (AFL-CIO) asks Apple to disclose its use of AI and any ethical guidelines that the company has adopted regarding the technology. The resolution is set to be supported by Norges Bank Investment Management and Legal & General, Apple's eighth and 10th-largest shareholders. Norges Bank, which operates the world's biggest sovereign wealth fund, wrote in its voting disclosures that Apple's board should account for \"social consequences of its operations and products.\" Likewise, Legal & General said that Apple \"discloses very little about its approach to managing AI-related risks.\" Legal & General met with Apple to discuss AI, but it declined to increase transparency around its development and use of the technology. \"Apple should be transparent in their uses of AI and their risk management processes,\" the company said. The major investor advisory firm Institutional Shareholder Services is encouraging Apple investors to support the AI resolution, arguing that Apple's guidelines \"do not specifically identify the potential risks resulting from the use of AI\" and, as a result, \"there are concerns regarding shareholders' ability to properly evaluate the risks associated with the use of AI.\" Meanwhile, Apple is urging investors to reject the resolution, claiming that \"the scope of the requested report is overly broad and could encompass disclosure of strategic plans and initiatives harmful to our competitive position.\" Shareholder petitions in the United States are usually non-binding, but those that review support from more than 30% of investors usually put sufficient pressure on the company to act. Apple is widely expected to announce a range of new AI features for its devices at WWDC later this year. Get weekly top MacRumors stories in your inbox. Our comprehensive guide highlighting every major new addition in iOS 17, plus how-tos that walk you through using the new features. App Store changes for the EU, new emoji, Podcasts transcripts, and more. Get the most out your iPhone 15 with our complete guide to all the new features. A deep dive into new features in macOS Sonoma, big and small. Revamped models with OLED displays, M3 chip, and redesigned Magic Keyboard accessory. Updated 10.9-inch model and new 12.9-inch model, M2 chip expected. Expected to see new AI-focused features and more. Preview coming at WWDC in June with public release in September. Action button expands to all models, new Capture button, camera improvements, and more. 4 hours ago by Tim Hardwick 4 hours ago by Tim Hardwick 22 hours ago by Tim Hardwick 22 hours ago by Tim Hardwick 1 day ago by MacRumors Staff  MacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPad, Mac, and other Apple platforms. "
}