{
    "title": "Navigating PayPal's Decline",
    "date": "2/23/2024",
    "url": "https://finance.yahoo.com/news/navigating-paypals-decline-130003440.html",
    "text": "Financial services conglomerate PayPal Holdings Inc. (NASDAQ:PYPL) remains in the shadow of its former glory. After peaking at record highs of $310 a share at the height of the Covid-19 pandemic in 2021, the stock has come tumbling down. The company has seen its market value fall by 80% over the past three years, compared to a 16% gain for the S&P 500. The payment technology company's stock fell 22% last year, underperforming the overall financial services sector, which benefited from an uptick in interest rates. Warning! GuruFocus has detected 4 Warning Signs with PYPL. The underperformance can be attributed, among other things, to investors reacting to underwhelming margins in recent quarters. Eroding market share in the high-value core branded checkout business has also significantly dragged margins and stock sentiments into the market. PayPal was one of the beneficiaries as millions of people locked down at the height of the pandemic rushed online to do shopping. The coronavirus-driven shift to online shopping and digital transactions drove record payment volumes, adding about 50 million active users in 2021. Likewise, the company registered its strongest-ever annual performance in 2020 as it processed over 900 billion in payments. That is no longer the case, as an end to pandemic restrictions has seen a significant shift in consumer shopping patterns. Traffic to brick-and-mortar stores has rebounded, translating to reduced payments that people make on e-commerce platforms through the company's offerings. Additionally, the company's unbranded businesses, led by payment processing, have remained resilient. However, the same cannot be said about branded businesses led by Venmo that face intense competition from Apple (NASDAQ:AAPL), among others. A shift in the company's payment volume into lower-margin channels is also a serious concern. While PayPal remains a leader in digital payments, its long-term outlook remains threatened as tech juggernauts look to encroach on its niche market. Apple and Alphabet (NASDAQ:GOOG) are the two tech heavyweights that threaten to disrupt the company's fortunes on mobile payments, which continues to send jitters throughout the investment community. Following the past year's underperformance, CEO Alex Chriss has set outlined a strategic plan to make the company leaner as one of the ways to fuel profitable growth. Nevertheless, he has warned that it could take some time before some of the initiatives bear fruit and move the needle, as depicted by the company's flat growth forecast on adjusted profit for the current year. Even though the company delivered solid fourth-quarter results, the stock fell by almost 10% as the market reacted to 2024 guidance. The full-year outlook further underlined the problems the fintech giant faces even as it strives to chart a new path. Revenue increased 9% to $8 billion for the quarter, beating consensus estimates of $7.33 billion. The increase came as the company recorded a 15% increase in total payment volume, which peaked at $409.80 billion. Source: PayPal The bottom line came in better than expected at $1.48 a share, representing a 19% year-over-year increase and was better than consensus estimates of $1.27. Even though the company delivered earnings growth in the fourth quarter, it is no longer growing at the high rates it did at the height of the pandemic. Nevertheless, a 2% decline in active accounts to 426 million underlines weakness in the underlying business as PayPal faces stiff competition on digital payments. It marked the fourth consecutive quarter of account losses for the company, signaling the impact of other digital payment services. Growth is mainly fueled by the unbranded business units that handle transactions with merchants that come with low profit margins. While the total payment volume in unbranded business units grew by 30% year over year, the company generated less earnings. The branded segment is the bread and butter of the entire business, as fees range between 2.49% and 3.49%. The low payment costs at stake also translate to high margins. The higher rates generated by the branded business units are reasonable as they generate additional revenue for the same business. According to Craig Maurer of Financial Technology Partners, PayPal needs to generate about $10 of unbranded checkout volume to generate the same margin dollar as $1 volume with branded payments. Source: PayPal Additionally, Venmo boasts a robust network of more than 35 million merchants. The platform, which allows people to send and receive money through peer-to-peer technology, has started allowing users to hold money in their accounts. The decision is expected to positively impact the total payment volume that the service handles, which has been increasing since 2017. The increase can be attributed to Venmo allowing people to send money online for free. The service has since become a hit with people who do not carry cash, like students and teens. The service makes money through a 2.90% transaction fee for businesses and a 1% fee for users who want to withdraw money installed into a linked card. Source: Statista Nevertheless, a shift in growth drivers to less lucrative operations could put more pressure on the company's operating margin. During the earnings call, PayPal told analysts it expects flat transaction margin dollars in 2024 relative to last year. If profit margins are to improve, PayPal will have to earn more whenever customers click on its branded services, such as the Venmo button, to make payments. The branded checkout payment volume was up by 6.50% in the fourth quarter. Compared to the unbranded business unit, the much-subdued growth can be attributed to stiff competition from offerings by Apple Pay, Google Pay, Shopify (NYSE:SHOP) and Amazon (NASDAQ:AMZN). Further indication that a decline in business accounts is a concern is the company's disappointing full-year guidance. The guidance has overshadowed the market-beating earnings, signaling the company might have to tweak its operations to bounce to high growth levels. Like any innovative fintech company, PayPal is already looking to address the issues that have triggered a significant contraction in its operating margins. It is also trying to address its competitive threat as tech giants push for market share in the lucrative digital payments landscape. The new management seeks to turn the company into a leaner entity pursuing profitable growth. The plan is already underway, with the company announcing plans to cut about 2,500 jobs, or 9% of its global workforce, as part of a plan that targets up to $900 million in cost savings that should significantly impact its operating margin. The results of the restructuring are already visible, with the operating income margin in the fourth quarter improving to 23.30%. If inflation continues to drop, consumer spending is expected to improve, increasing the total payment volume it handles and boosting income margins. The layoffs come as the company seeks to focus more on efficiency and deploy automation. The digital technology company is also consolidating its technology as it looks to reduce complexity and duplication, which should reduce its labor force costs and strengthen profit margins. Amidst the cut, the company will continue to invest in areas likely to create and accelerate growth. Consequently, the digital payment company has affirmed its push into artificial intelligence as it looks to unveil new products and solutions capable of enhancing efficiency and competitive edge. One of the new AI-powered features the company is launching will help ensure a faster checkout experience. It is also making it possible for customers to enjoy AI-powered merchant recommendations. In addition to the AI push, regulatory winds are blowing in favor of PayPal. Amid regulatory pressure, Apple has agreed to open the tap-to-pay functionality to third parties. The move opens the door for PayPal to be one of the tap-to-pay applications on iOS devices. Consequently, the company is working on a new consumer app to exploit the new EU regulation. Integrating PayPal services into Apple Wallet should translate into big business for the company in terms of payments and transactions through iOS devices. PayPal is also aggressively offloading its credit risk as it looks to free up more cash that can be used to return cash to shareholders. The signing of a deal with private equity firm KKR (NYSE:KKR) to purchase up to $43 billion of the buy-now-pay-later loans (BNPL) in Europe is part of the strategic plan to bolster cash reserves. BNPL was a hit at the height of the pandemic as it allowed the payment giant to attract millennial and gen Z consumers to its platform. Nevertheless, their fortunes have turned sour in recent years, especially with rising interest rates and runaway inflation dampening customers' purchasing power. The closing of the BNPL deal with KKR is expected to free up close to $1 billion, which PayPal will redirect to share buybacks. In addition, given the uncertainty about whether customers will clear the loans, the KKR deal removes an element of risk from its books. While PayPal has underperformed over the past year, going by the 22% slide, it is not necessarily on the wrong track. Total payment volume, a key metric in the payment sector, is growing at an impressive double-digit rate, which underlines the company's core business that is growing at a solid pace. In addition, the company continues to deliver operating income margin improvements, signaling its cost-cutting initiatives are bearing fruit. This article first appeared on GuruFocus. Related Quotes "
}