{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.marketbeat.com/originals/warren-buffett-goes-ex-tech-and-pro-oil-sell-apple-buy-chevron/",
    "text": " Every market brings you a cycle to take advantage of, that is for sure, and there will always be cycles to come. Warren Buffett has been quoted saying that timing the market can turn out to be a futile attempt for the average investor; of course, he wasn’t talking about himself now that he has been caught red-handed timing the cycle that is starting soon. In the latest round of capital rotation in the investment giant Berkshire Hathaway NYSE: BRK.A, you can spot what Buffett himself has been thinking about the sectors that could outperform in the coming months; here’s a hint: It includes the Technology Select Sector SPDR Fund NYSEARCA: XLK and the Energy Select Sector SPDR Fund NYSEARCA: XLE. For reasons that you too will learn today, Buffett has been cutting some of his paper gains in Apple NASDAQ: AAPLE stock while at the same time rotating some of this newfound liquidity into the promising story found in Chevron NYSE: CVX for the coming months. It all starts with the cycle and macro forces at play, and here they are. Understanding that the technology stocks sector may be a bit overextended today, particularly after seeing names like NVIDIA NASDAQ: NVDA breaking past all-time highs almost every month, investors like yourself may be looking to find other sectors that could pose the opportunity to squeeze further profits. Spreading the past twelve-month performance between the technology sector and the energy stocks that sit on the opposite end, you can see that energy has underperformed by as much as 45.3% over this period, begging the question of when the cycle will end and rotate the other way. That time could be coming sooner than you think, now that the FED is looking to cut interest rates this year, an event that could go as quickly as May, according to the FedWatch tool from the CME Group NASDAQ: CME. What happens if rates do go down? Since the value of money is tied to the trend in interest rates, the dollar index could lower if or when the FED cuts rates. A lower dollar drives oil prices higher (good for Chevron) and makes domestic consumption decline (alarming for Apple); so, Warren, is timing the market as futile as it seems? Even analysts at The Goldman Sachs Group NYSE: GS have expressed their view toward the manufacturing sector, maybe betting on the lower dollar sparking new export demand from the U.S. They are pointing toward a breakout of the sector, which of course, includes Chevron as a prime member for rising profits. One word of caution: this does not mean you should dump all of your Apple stock in case you own any; guys like Buffett can sell a stock only to rebalance their portfolio or to book some profits to be reinvested in other more attractive deals. So, here are the reasons why – beyond the macro – Chevron can be more attractive than Apple. If there’s anything your portfolio should be after in this coming cycle, it is growth and above-average growth. When it comes to Apple and its peers, growth is a lacking factor considering today’s analyst projections, and just the opposite is the case for Chevron. Taking the energy stocks as a group, they are expected to grow their earnings per share by an average rate of 7.1% over the next twelve months. Analysts believe that Chevron stock can jump 14.6% to be above the industry average and superior to its close competitor, Exxon Mobil NYSE: XOM, which expects only 8.3% growth. On the opposite end of the spectrum, you have the mega-cap technology stocks, which are expected to grow their EPS by a respective 11.2% over the next year; Apple sits well below this average at only 8.4%; it also happens to be below its closest competitor Microsoft NASDAQ: MSFT who expects to see 13.1%. Knowing what you know now, it should come as no surprise to learn that Chevron – in its $180.9 price target – brings you a 17.0% potential upside, while Apple only comes at 12.6% along its $205.3 targets. The reason behind this divergence? Well, you should be able to answer that by now. So now you see, Buffett gave you the initial hint, but it is the actual marketplace and analyst expectations that are literally confirming the thesis as to where the new growth can be found in the new upcoming cycle. Before you consider Berkshire Hathaway, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Berkshire Hathaway wasn't on the list. While Berkshire Hathaway currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Which stocks are likely to thrive in today's challenging market? Click the link below and we'll send you MarketBeat's list of ten stocks that will drive in any economic environment. Value Stocks, Asian Markets, Macro Economics Gabriel Osorio-Mazilli has been a contributing writer for MarketBeat since 2023. Value investing, long/short trading, options, emerging markets CFA Level I candidate; Goldman Sachs corporate training; independent courses Analyst at Goldman Sachs, associate at Citigroup, senior financial analyst in real estate Because Nvidia already commands about 80% of the market, is advancing technology today, and is raising prices, it should continue to grow and outperform expectations for the foreseeable future. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}