{
    "title": "Apple @ Work: T-Mobile's Meraki deployment highlights a continued missed \nopportunity for Apple",
    "date": "2/24/2024",
    "url": "https://9to5mac.com/2024/02/24/t-mobiles-meraki-deployment-highlights-a-continued-missed-opportunity-for-apple/",
    "text": "Apple @ Work is exclusively brought to you by Mosyle, the only Apple Unified Platform. Mosyle is the only solution that integrates in a single professional-grade platform all the solutions necessary to seamlessly and automatically deploy, manage & protect Apple devices at work. Over 45,000 organizations trust Mosyle to make millions of Apple devices work-ready with no effort and at an affordable cost. Request your EXTENDED TRIAL today and understand why Mosyle is everything you need to work with Apple. Back in late January, T-Mobile made an announcement that caught the eye of our team. The company announced a “Connected Workplace” to deliver a seamless business solution that includes fast performance, Cisco Meraki devices, a cloud-managed networking platform, 24/7 support, and more. When I read this news, all I could think was about how this is a huge missed opportunity for Apple on the hardware and services side. About Apple @ Work: Bradley Chambers managed an enterprise IT network from 2009 to 2021. Through his experience deploying and managing firewalls, switches, a mobile device management system, enterprise grade Wi-Fi, 1000s of Macs, and 1000s of iPads, Bradley will highlight ways in which Apple IT managers deploy Apple devices, build networks to support them, train users, stories from the trenches of IT management, and ways Apple could improve its products for IT departments. Let’s take a look at what’s involved here: Here’s what T-Mobile says comes with the new 5G business plan: This is a really fantastic tool for remote companies. “Anytime we introduce a new solution, we build it to address critical business challenges, make things easier and deliver the best value for our customers,” said Mishka Dehghan, SVP, Strategy, Product, and Solutions Engineering, T-Mobile Business Group. “With Connected Workplace, we’ve brought together Cisco best-in-class Meraki network technologies with our award-winning 5G network to make it easier for businesses to streamline their network infrastructure, ease the burden on IT and improve operations.” One of the biggest challenges for IT teams that support remote employees is dealing with a networking environment you don’t control. You’ll get a ticket that says, “Everything is running slow on my Mac, and Zoom lags when I am on video.” These are the nightmare tickets for someone doing help desk support. There are a million variables here. Let’s say that even the computer works fine, so you determine it’s something on the network. How do you begin to troubleshoot the problem? How do you proceed even if you determine it’s an RF/Wi-Fi/ISP issue? This situation is where Cisco and T-Mobile’s solutions come into play. Businesses could deploy a Meraki firewall/access point for each employee powered by a 5G network from T-Mobile. Business IT leaders would then have insights into the overall network environment of the users they support. This solution from T-Mobile and Cisco highlights an area I believe Apple is missing out on. “Back in the day,” Apple’s AirPort products were some of the best home networking solutions. Before the days of the simplicity of products like Amazon eero, Apple was the most user-friendly solution on the market. Apple exited the market at a time when users began to see value in premium home networking equipment. I propose that Apple create a modern home router with Wi-Fi that has the option of traditional wired internet but also includes an option to use AT&T/Verizon/T-Mobile. Company IT leaders could negotiate multiple agreements with different vendors to have options for when internet connectivity becomes a challenge. I envision this working because someone could use a traditional internet provider with a redundant 5G connection (or even a primary 5G connection). Users could log into their Managed Apple ID on the device to create a business-only connection solely for business purposes while providing healthy telemetry data to the IT team to understand service quality. Apple could benefit from selling the router in mass quantities to IT teams and then have a revenue-sharing agreement with the cellular providers. It would be a win/win for Apple, cellular providers, end-users, and IT teams. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Apple @ Work is a 9to5Mac series where Bradley C… Bradley lives in Chattanooga, TN. Tips, feedback, corrections and questions can be sent to Bradley@9to5mac.com. The MacBook Air is the best value on the market for laptops. The best day to day headphones for iOS and macOS. "
}