{
    "title": "Meta, Microsoft take on Apple and lobby EU to reject new App Store terms",
    "date": "2/22/2024",
    "url": "https://sea.mashable.com/tech/31356/meta-microsoft-take-on-apple-and-lobby-eu-to-reject-new-app-store-terms",
    "text": "Meta and Microsoft are not about to just let Apple get away with \"malicious compliance.\" According to a new report from the Financial Times, two of the biggest critics of Apple's new App Store rules are officially lobbying the EU to reject the iPhone maker's crafty new App Store terms. Meta and Microsoft are hoping that the EU rejects Apple's proposal and forces the company back to the drawing board regarding new policies that comply with the Digital Markets Act (DMA). The DMA is a new EU law created to open up Big Tech and spur competition in the market. However, since Apple announced its DMA-inspired policy updates last month, many developers have criticized the Cupertino-based tech giant for contorting the law to do the exact opposite. “The initial steps [to comply with the DMA] that Apple has put forward are very prohibitive to us actually creating a meaningful alternative to the one store that’s available on the world’s largest gaming platforms, which are mobile phones,” said Microsoft Gaming CEO Phil Spencer in a statement to the Financial Times. “So we will continue to work with regulators to open that up.” Perhaps the best example of Apple's problematic \"compliance\" with the DMA – and the issue at the heart of Meta and Microsoft's complaints – is the company's App Store changes. Under the DMA, Apple is no longer permitted to monopolize the iOS app marketplace and must enable alternative marketplaces on iOS for developers to distribute their apps. This means that in the EU, developers will no longer be beholden to Apple's content policies or in-app purchase revenue share model. In response to the new regulation, Apple updated its App Store rules to allow for alternative marketplaces, but they made it potentially cost prohibitive for developers to distribute apps through them. The most significant change for developers looking to release apps without Apple's Store is the Core Technology Fee (CTF). Under Apple's new scheme, any developer that agrees to the updated terms would have to pay €0.50 to Apple, per first install annually, for each user, for every install above one million. The fee will be charged regardless of whether the app is paid or free. These new rules open the possibility for the first time where an app developer could owe Apple more money than it made from the app. \"I don't think that the Apple thing is going to have any difference for us because I think that the way that they've implemented it, I would be very surprised if any developer chose to go into the alternative app stores that they have,\" Meta CEO Mark Zuckerberg said in an earnings call earlier this month. \"They've made it so onerous, and, I think, so at odds with the intent of what the EU regulation was that I think it's just going to be very difficult for anyone, including ourselves, to really seriously entertain what they're doing there.\" Along with Meta and Microsoft, other companies like Spotify and Fortnite creator Epic Games have knocked Apple. Epic Games CEO Tim Sweeney specifically accused Apple of \"malicious compliance,\" a phrase that has since become the go-to terminology for Apple's behavior. The backlash to Apple's DMA-inspired changes has been strong enough already that the EU is already taking steps to review them. Apple's reaction to the DMA has the European Commission completely questioning whether the years it took to create the law has had the desired outcomes, according to the Financial Times. One independent analyst told the outlet that it basically appeared like Apple was seeing what it could get away with under the new law. The EU could potentially fine Apple for non-compliance when the law goes into effect if it determines that these policy updates do not embody the spirit of the DMA. Or the DMA could reject Apple's App Store proposal entirely and force the company to come up with a new DMA-compliant policy. Whatever the European Commission decides will be crucial in determining if the DMA will actually open up the marketplace — or let Big Tech companies continue to monopolize entire markets. "
}