{
    "title": "Apple's wearable ideas include smart glasses and cameras in your ears",
    "date": "2/25/2024",
    "url": "https://www.theverge.com/2024/2/25/24082760/apple-smart-glasses-airpods-cameras-smart-ring",
    "text": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Apple’s future roadmap for wearables may include AI-powered smart glasses, as well as AirPods with cameras, according to Mark Gurman in today’s Power On newsletter for Bloomberg. Both concepts are in the exploratory phase inside Apple, representing more of a look at the company’s future plans than discreet products. The smart glasses would be angled as AirPods stand-ins, he says, just with more sensors, AI features, and longer-lasting batteries. But even though they’d serve as a cheaper head-worn gadget than the Vision Pro, they wouldn’t be the AR face computer with high-quality transparent displays that Apple is trying to get to. Gurman writes that these glasses would instead be a step in that direction that’s more comparable to Meta Ray-Bans, which feature a camera and an AI assistant you can talk to, but no display. Apple also reportedly started looking into camera-equipped AirPods last year, under the codename B798. If the company can pull it off, they would reportedly be roughly the same size as modern AirPods, just with embedded, low-resolution cameras that would be paired with AI to help users with their routines. Apple is looking for ways to bolster its wearables division as its existing products have matured. Putting cameras on AirPods is a decidedly wacky idea that vaguely points at Apple’s plans for generative AI, and who knows — if people are open to face computers, why not ear cameras, too? Gurman mentions that the long-rumored Apple smart ring idea still has its champions in Cupertino, but Apple isn’t actively developing anything in what’s still an interesting, but unproven wearable category. The company has put much more work into AR glasses, though. And with Meta having established that compelling, screen-less smart glasses are possible, it makes sense that Apple might be starting down that avenue. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}