{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.investopedia.com/buffett-berkshire-hathaway-slashed-positions-in-hp-apple-and-paramount-global-in-q4-2023-8581981",
    "text": " JOHANNES EISELE / Contributor / Getty Images Warren Buffett's Berkshire Hathaway (BRK.A, BRK.B) sold off about 10 million shares or nearly $2 billion of Apple (AAPL) stock in the final quarter of 2023, according to the firm's 13-F filing, among a number of changes to its portfolio. Buffett made significant trims in the fourth quarter to three long-time holdings: Apple, HP (HP), and Paramount Global (PARA). Berkshire reported that it reduced its Apple position by close to 10 million shares or almost $2 billion, though Berkshire still ended 2023 with more than 900 million shares of the tech giant. Berkshire also sold off the majority of its position in HP, reducing its holdings by about 80 million shares and ending the year with roughly 23 million shares remaining. Berkshire reduced the size of its Paramount Global position by about 30 million shares, leaving about 63 million shares. Berkshire made three major additions to preexisting positions during the last months of 2023. The company bought up an additional 16 million shares of Chevron (CVX) and another 19 million shares of Occidental Petroleum (OXY), both energy firms. Berkshire also added about 30 million additional shares of Sirius XM (SIRI), more than quadrupling its position. Berkshire fully exited four positions in the last quarter of the year. The two largest sell-offs were nearly 11 million shares of financial services company StoneCo (STNE) and nearly 6 million shares of home construction firm D.R. Horton (DHI). Berkshire also closed out two smaller stakes in insurance companies Globe Life (GL) and Markel (MKL). Famous for his long-term buy-and-hold approach to investing, Buffett did not take on any new positions over the period. United States Securities and Exchange Commission. \"Berkshire Hathaway 13F.\" "
}