{
    "title": "Apple Card users earned more than $1B in Daily Cash in 2023",
    "date": "1/30/2024",
    "url": "https://techcrunch.com/2024/01/30/apple-card-users-earned-more-than-1-billion-in-daily-cash-in-2023/",
    "text": "Apple revealed today that users earned more than $1 billion in Daily Cash from spending on Apple Card last year. The tech giant also announced that Apple Card has topped more than 12 million users. Apple Card, which first launched in 2019, is exclusively available in the United States. The company also revealed that nearly 30% of Apple Card customers make two or more payments per month. Plus, more than 1 million users are sharing the card via Family Sharing, and nearly 600,000 users are building credit equally with their spouses, partners or another adult. “We designed Apple Card with users’ financial health in mind, and it’s rewarding to see our more than 12 million customers using its features to make healthier financial decisions,” said Jennifer Bailey, Apple’s vice president of Apple Pay and Apple Wallet. “We’re proud of what we’ve been able to deliver to Apple Card customers in just five years. As we look at the year ahead and beyond, we’re excited to continue to innovate and invest in Apple Card’s award-winning experience, and provide users with more tools and features that help them lead healthier financial lives.” Last April, Apple launched Apple Card’s high-yield savings account offered by Goldman Sachs and reached over $10 billion in deposits a few months later. Apple says the vast majority of users currently auto-deposit their Daily Cash into savings, and nearly two-thirds of users have deposited additional funds from a linked bank. Today, savings offers a high-yield APY (annual percentage yield) of 4.5%. The savings account offered an APY of 4.15% at launch. Apple also revealed that more than 200,000 users have been approved for an Apple Card after enrolling in the Path to Apple Card program, which provides customized steps to help you get approved for Apple Card in the future after your initial application was rejected. "
}