{
    "title": "Apple's share price just tanked, weeks before the expected Vision Pro \nlaunch — AAPL down more than 4% after major ...",
    "date": "1/3/2024",
    "url": "https://www.imore.com/apple/apples-share-price-just-tanked-weeks-before-the-expected-vision-pro-launch-aapl-down-more-than-4-after-major-bank-issues-price-warning",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Not looking good. Anyone with Apple shares in their portfolio should probably pay attention to what just happened to the share prices of the most valuable company in the world. Overnight, Barclays downgraded the value of stocks in the firm to ‘Underweight,’ falling 3.6% of their value. That’s a seven-week low for Apple as it fights against non-optimal consumer buying power and adverse conditions in certain overseas markets. According to Reuters, Apple had a 2023 that saw a 50% rise over the course of the year — but now, Barclays has pointed towards a ‘lackluster’ sales performance from the iPhone 15, and analyst Tim Long reckons that the iPhone 16 is going to be no different. That doesn’t say much for the continued confidence in the tech giant, and it gets worse from there. China’s markets also pose a threat, especially with the resurgence and power of homegrown Huawei. Sticking the knife in the side of Apple further are concerns over its services — or, more precisely, the numerous lawsuits around the world over its potentially over-protective practices. That’s fights like the battle against Epic amongst others that threaten to pry open the gates of Apple's very carefully curated garden. The continued Apple Watch woes are also likely a factor, as Masimo and its blood oxygen sensor controversy resulted in Apple Watches being pulled from Apple Store shelves for a short period in the United States in December. When your stock price is based on how well you sell things, not being able to sell those things isn’t going to help — particularly with the risk-averse stock investor. Apple will be hoping for a better year this time around, especially now that its stock price has seen such a drop. Maybe that injection of stock juice comes in the form of the anticipated Vision Pro headset — although it's going to have to be really good if it wants to sell enough to make Apple’s stock prognosis any better. iMore offers spot-on advice and guidance from our team of experts, with decades of Apple device experience to lean on. Learn more with iMore! As iMore's Senior Staff writer, Tammy uses her background in audio and Masters in screenwriting to pen engaging product reviews and informative buying guides. The resident audiophile (or audio weirdo), she's got an eye for detail and a love of top-quality sound. Apple is her bread and butter, with attention on HomeKit and Apple iPhone and Mac hardware. You won't find her far away from a keyboard even outside of working at iMore – in her spare time, she spends her free time writing feature-length and TV screenplays. Also known to enjoy driving digital cars around virtual circuits, to varying degrees of success. Just don't ask her about AirPods Max - you probably won't like her answer. BREAKING: EU opens investigation into Apple over DMA compliance — Apple could face a fine of up to 10% of its worldwide turnover Steve Jobs' signed business card sold at auction for over $180k Law enforcement's GrayKey iPhone unlocking devices now support iOS 17 and the iPhone 15 for the first time By Oliver HaslamMarch 25, 2024 By Lloyd CoombesMarch 25, 2024 By Oliver HaslamMarch 25, 2024 By Daryl BaxterMarch 25, 2024 By James BentleyMarch 25, 2024 By Stephen WarwickMarch 25, 2024 By Stephen WarwickMarch 25, 2024 By Tammy RogersMarch 25, 2024 By Lloyd CoombesMarch 24, 2024 By Lloyd CoombesMarch 24, 2024 By Lloyd CoombesMarch 24, 2024 iMore is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}