{
    "title": "Why Microsoft's stock is a better investment than Apple",
    "date": "1/13/2024",
    "url": "https://www.marketwatch.com/story/why-microsofts-stock-is-a-better-investment-than-apple-12037448",
    "text": "Apple Inc. has long been the most valuable U.S. company, but Microsoft Corp. seems poised to overtake it. A look back at the companies’ financial performance and a look ahead at expected revenue and profits make the case that Apple is no longer a growth stock and that Microsoft is the better long-term investment. At the close on Friday, Apple \n        AAPL,\n        -0.50%\n       remained in the top spot with a market capitalization of $2.892 trillion, just ahead of Microsoft \n        MSFT,\n        +0.37%\n       at $2.887 trillion. Apple’s stack was down 3.4% for 2024, while Microsoft was up 3.3% in the new year. Read: Apple stock looks expensive vs. the rest of the ‘Magnificent Seven’ Here’s a quick comparison of total returns (with dividends reinvested) for the stocks, and for the SPDR S&P 500 ETF Trust \n        SPY,\n       to show how the companies’ forward price-to-earnings valuations have moved, through the close on Thursday: Apple’s forward P/E (price divided by rolling 12-month earnings-per-share estimates among analysts polled by FactSet) has more than doubled over the past five years. The entire stock market is more expensive than it was, as you can see with SPY’s valuation climbing 30%. Microsoft’s valuation on this basis has grown 46%, not only because its stock hasn’t performed as well as Apple’s stock has, but because Microsoft has grown its earnings per share much more quickly. Here’s a look at compound annual growth rates (CAGR) for the companies’ sales and earnings per share over the past five years and the S&P 500 \n        SPX.\n       These are calendar-year numbers, adjusted by FactSet because some companies, including Apple, have fiscal years that don’t match the calendar. The numbers for 2023 are based on the first three quarters’ results and estimates for the fourth quarter. The table also includes projected CAGR for sales and earnings per share from 2023 through 2025. Over the past five years, Apple’s sales and earnings per share have grown at a faster pace than those of the S&P 500, but Microsoft has grown more quickly. Looking ahead, the estimates point to a pace of sales growth for Apple that will trail that of the index and lag far behind Microsoft. Apple is also expected to increase earnings at a slowing pace, again way behind Microsoft and even the index. A rapid pace of growth justifies a premium share price, so it makes sense that Microsoft now trades at a higher forward P/E than Apple does. But Apple’s premium to the full S&P 500 is difficult to justify, based on these numbers. Analysts working for brokerage firms seem to agree. Here is a summary of ratings and price targets for Apple and Microsoft: Following a stellar 2023 for both stocks, expectations for share price increases over the next year are modest. But the analysts favor Microsoft by a large margin. Click on the tickers for more about each company. Click here for Tomi Kilgore’s detailed guide to the wealth of information available for free on the MarketWatch quote page. Don’t miss: Mastercard’s stock upgrade backed by a high growth estimate and incredible long-term success Why gold-mining stocks look set to outperform physical gold. Philip van Doorn writes the Deep Dive investing column for MarketWatch. Follow him on Twitter @PhilipvanDoorn. Philip van Doorn writes the Deep Dive investing column for MarketWatch. Follow him on Twitter @PhilipvanDoorn. Visit a quote page and your recently viewed tickers will be displayed here. "
}