{
    "title": "13 Most Buzzing Stocks To Buy Now",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/news/13-most-buzzing-stocks-buy-220818778.html",
    "text": "In this article, we will take a detailed look at the 13 Most Buzzing Stocks To Buy Now. For a quick overview of such stocks, read our article 5 Most Buzzing Stocks To Buy Now. Investors are still deeply divided over what the future might look like for the stock market in the weeks and months to come. While the bulls believe a soft landing is in sight, doubts remain over the Federal Reserve's possible plan of action regarding rate cuts as inflation remains sticky. A latest Wall Street Journal report cited CME FedWatch tool data which says there is now a 50% chance the central bank keeps interest rates unchanged during its March meeting. When 2024 was about to start this figure stood at just 3.85%. The optimism seen in the last quarter of 2023 was overwhelming and proved to be fickle. The WSJ report also said, citing swap contracts tied to the consumer-price index, that traders now see inflation at 2.4% over the next five years, the highest level since November. This shows we might be in for a long period of elevated inflation and high interest rates. In this environment, would mega-cap tech stocks like Amazon.com Inc (NASDAQ:AMZN), NVIDIA Corp (NASDAQ:NVDA) and Apple Inc (NASDAQ:AAPL) which posted euphoric gains in 2023 be able to keep going higher? Only time would tell. For now let's take a look at the stocks that are trending these days. Luis Louro / shutterstock.com Methodology Amid earnings, the beginning of the election buzz and upcoming economic data, it's interesting to see which stocks are currently trending in terms of high volume. For this article we used Yahoo Finance' stock screener which looks for mid-, small- and large-cap stocks with high trading volume and movement. From these stock we selected stocks with the highest number of hedge fund investors.  Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator. Number of Hedge Fund Investors: 13 Crypto mining and digital assets company Marathon Digital Holdings Inc (NASDAQ:MARA) has gained about 80% in value over the past one year amid a rebound in bitcoin. In December, Marathon Digital Holdings Inc (NASDAQ:MARA) achieved record bitcoin production as Marathon Digital Holdings Inc (NASDAQ:MARA) produced 1,853 BTC in the month, which was up 56% from November 2023. It was also a 290% YoY increase. Out of the 910 funds tracked by Insider Monkey, 13 hedge funds tracked by Insider Monkey had stakes in Marathon Digital Holdings Inc (NASDAQ:MARA). Number of Hedge Fund Investors: 18 Lucid Group Inc (NASDAQ:LCID) is one of the most shorted stocks in the EV space amid fears regarding production and uncertainty in 2024 due to upcoming elections. Earlier this month, the stock fell to an all-time low after Lucid Group Inc (NASDAQ:LCID) said it produced 2,391 vehicles during the last quarter of 2023 and delivered 1,734 vehicles, better than the analyst estimates for 1,696 vehicles delivered. Number of Hedge Fund Investors: 18 As US presidential elections 2024 inch closer, investors are starting to closely watch EV companies as a new government in the US could make or break EV stocks amid new policies. Analysts believe if Republicans come into power and make policies unfriendly to US EV companies, it would bode well for Chinese EV companies like Nio Inc - ADR (NYSE:NIO) which would also plan faster expansion in other markets. As of the end of the third quarter of 2023, 18 hedge funds out of the 910 funds tracked by Insider Monkey had stakes in Nio Inc - ADR (NYSE:NIO). The biggest hedge fund stakeholder of Nio Inc - ADR (NYSE:NIO) during this period was Jos Shaver's Electron Capital Partners which owns a $38 million stake in Nio Inc - ADR (NYSE:NIO). Number of Hedge Fund Investors: 34 Brazilian mining giant Vale SA (NYSE:VALE) ranks 10th in our list of the top buzzing stocks to buy now. The stock is moving after Bloomberg reported that Brazilian President Luiz Inacio Lula da Silva wants his former finance minister to be the next CEO of Vale SA (NYSE:VALE). In December, Vale SA (NYSE:VALE) disclosed that its iron ore production of 310M-320M metric tons in 2024 will be flat when compared to  2023. A total of 34 hedge funds out of the 910 funds tracked by Insider Monkey had stakes in Vale SA (NYSE:VALE). The biggest stakeholder of Vale SA (NYSE:VALE) during this period was Ken Fisher's Fisher Asset Management which owns a $243 million stake in Vale SA (NYSE:VALE). Miller Value Partners Income Strategy made the following comment about Vale S.A. (NYSE:VALE) in its second quarter 2023 investor letter: “Vale S.A. (NYSE:VALE) fell during the quarter with iron ore prices. The company reported 1Q23 revenue of $8.44B, -22.7% Y/Y, below consensus of $8.79B, and Adjusted EBITDA of $3.69B, compared to 1Q22 EBITDA of $6.55B, below consensus of $4.49B. The Brazilian miner produced 66.8 million tons (Mt) of iron ore in 1Q23, +5.8% Y/Y, below consensus of 67.7 Mt, 67.0 thousand tons (kt) of copper, +18.4% Y/Y, and 41.0 kt of nickel, -10.5% Y/Y. Although management reaffirmed its FY23 production guidance, analysts seemed to be concerned by the negatively offsetting impacts of weaker iron ore prices as China, the world’s largest iron ore buyer, has threatened to curb any “unreasonable” price gains for the metal in an effort to prevent this year’s steel output from exceeding 2022 levels. Vale generated 1Q23 free cash flow (FCF) of $2.28B, bringing trailing-twelve month (TTM) FCF to $6.73B, or a FCF yield of 11.3%. The company repurchased $763MM worth of shares in the quarter and paid $1.80B in dividends, bringing total capital returned to shareholders in the quarter to $2.56B, or 4.3% of the company’s market cap.” Number of Hedge Fund Investors: 43 Ford Motor Co (NYSE:F) ranks ninth in our list of the most buzzing stocks to buy now. Earlier this month Ford Motor Co (NYSE:F) posted domestic Q4 sales volumes, with record electric vehicle (EV) numbers. Ford Motor Co (NYSE:F) sold 25,937 EVs in the period, a growth of 24% on a YoY basis. Number of Hedge Fund Investors: 52 AT&T Inc (NYSE:T) is buzzing as investors get ready to see the company's fourth quarter earnings report. Earlier in the month Oppenheimer upgraded the stock to Outperform with a $21 price target. Oppenheimer's analysts see several tailwinds for the stock, including AT&T Inc's (NYSE:T) 120MHz C-Band portfolio which now covers over 200M point of presence, or POPs. Oppenheimer said that about 60% of AT&T Inc's (NYSE:T) subscribers are now fiber, which means healthier margins and pricing leverage. In addition to AT&T, other stocks trending right now include Amazon.com Inc (NASDAQ:AMZN), NVIDIA Corp (NASDAQ:NVDA) and Apple Inc (NASDAQ:AAPL). AT&T is one of the most buzzing stocks to buy right now popular among hedge funds. Miller Value Income Strategy made the following comment about AT&T Inc. (NYSE:T) in its Q3 2023 investor letter: “Our third-largest holding at quarter end was AT&T Inc. (NYSE:T), a leading provider of communications and connectivity services in the US. At $15/share, the stock trades at the same price it did almost thirty years ago. The share price is much less interesting to us in relation to where it has traded in the past than in relation to how much cash the company generates and what management is doing with it. At just over 6x earnings, the stock trades near its lowest price-to-earnings (P/E) multiple ever, also representing close to its largest-ever P/E discount to the stock market. The business converts most of its earnings to free cash flow, implying a forward free cash flow yield north of 15%. Just under half of free cash flow is going toward the dividend (7.5% yield), while much of the balance is going to debt paydown. In other words, if the stock does not fall below its lowest-ever valuation, investors clip a rock-solid 7.5% in cash, while owning a growing portion of a very steady business as management reduces debt outstanding. A discounted cash flow model will suggest that intrinsic value for shares begins with a “2,” suggesting the stock is undervalued on an absolute basis. The lack of volatility in the underlying fundamentals also makes it unique when compared to many other things we own, which reduces the probability of permanent capital impairment and argues for a significant weight in the portfolio. AT&T looks particularly attractive when compared to some of the larger names dominating the S&P 500. Compare the stock to Apple, for instance, whose revenues and profits are likely to shrink this year, even as it trades at 29x this year’s earnings estimate. The ongoing return to rationality and capital accountability, along with extreme valuations in the megacap tech stocks, have us more excited about our portfolio’s prospects than we can remember for quite some time. As always, we remain the largest investors and welcome any questions or comments.” Number of Hedge Fund Investors: 70 Intel Corp (NASDAQ:INTC) is creating a buzz as investors get ready to receive Intel Corp's (NASDAQ:INTC) earnings report slated to be released on January 25. Recently, a Gartner report said Intel Corp (NASDAQ:INTC) ranked first in the list of top semiconductor companies in 2023, with a  total semiconductor revenue of $48.7 billion. As of the end of the third quarter of 2023, 70 hedge funds out of the 910 funds tracked by Insider Monkey had stakes in Intel Corp (NASDAQ:INTC). The most significant stake in Intel Corp (NASDAQ:INTC) is owned by William B. Gray's Orbis Investment Management which owns a $468 million stake in Intel Corp (NASDAQ:INTC). Intel ranks fifth in our list of the most buzzing stocks to buy now. Upslope Capital Management stated the following regarding Intel Corporation (NASDAQ:INTC) in its fourth quarter 2023 investor letter: “Intel Corporation (NASDAQ:INTC) – New Long: This is not a traditional long for Upslope in any sense. Intel is outside of the box in terms of typical sector and market cap focus, and the position is really a portfolio hedge (and structured as such). The thesis is very simple: Intel is uniquely positioned to benefit in two important scenarios, both of which require “protection” for Upslope’s portfolio: a continued melt-up in technology stocks and/or rising tensions over Taiwan. Combined with expectations and sentiment around Intel that were incredibly low, this nudged me to add exposure via long-dated INTC call options. While still material in terms of delta-adjusted exposure, the position has been reduced repeatedly and is much more modest today.” Number of Hedge Fund Investors: 81 Tesla Inc (NASDAQ:TSLA) shares are creating a buzz on the Wall Street as investors await Tesla Inc's (NASDAQ:TSLA) earnings that are set to be announced on January 24. The stock also came in the limelight after Elon Musk expressed his desire to have about 25% voting control over Tesla Inc (NASDAQ:TSLA) in order to make Tesla Inc (NASDAQ:TSLA) a leader in AI and robotics. Tesla ranks sixth in our list of the most buzzing stocks to buy now. Like Tesla, Amazon.com Inc (NASDAQ:AMZN), NVIDIA Corp (NASDAQ:NVDA) and Apple Inc (NASDAQ:AAPL) are also trending. Tesla Inc (NASDAQ:TSLA) shares have gained about 47% over the past one year. Some analysts expect Tesla Inc's (NASDAQ:TSLA) earnings to come in weaker than expected amid pricing wars in the EV sector. As of the end of the third quarter of 2023, 81 hedge funds out of the 910 funds tracked by Insider Monkey had stakes in Tesla Inc (NASDAQ:TSLA). Tsai Capital Corporation stated the following regarding Tesla, Inc. (NASDAQ:TSLA) in its fourth quarter 2023 investor letter: “Tesla, Inc. (NASDAQ:TSLA) ($248.48 – up 101.7% for the year. Recent high $299.29): Tesla has significant and underappreciated competitive advantages across multiple verticals including electric vehicles, software and energy storage. Misunderstood by much of Wall Street – and consequently a favorite of short sellers – Tesla continues to grow rapidly and increase its lead over the competition while delighting consumers in the process. Despite his unconventional (and sometimes off-putting) personality, Elon Musk is a visionary who has created enormous shareholder value. Musk is also a long-term thinker who has embraced the scale-economies-shared business model favored by Henry Ford and Jeff Bezos, intentionally reducing prices, increasing the customer value proposition and expanding the total addressable market. Tesla’s massive scale and cost advantages are now challenging the viability of legacy auto, which has hundreds of billions of dollars of outdated property, plant and equipment in a world that is rapidly transitioning to electric vehicles (EVs). While we expect competition for EVs to intensify and for Tesla to lose market share over time, we also believe the company will increase production and deliveries from approximately 1.8 million vehicles today to approximately 15 million vehicles in 2030 and further its lead in autonomous driving capability. In fact, we expect Tesla will eventually license its autonomous driving software, creating high-margin (70-80%), recurring licensing revenue. Tesla is also one of only two companies that dominate the energy storage market, which has the potential to grow to several hundred billion in revenue as power plants around the world increase their focus on renewable energy. Our investment in Tesla is aligned with our preference for companies that have strong balance sheets and the managerial skill to reinvest capital at high rates of return into large addressable markets.”  Click to continue reading and see 5 Most Buzzing Stocks To Buy Now.  Suggested Articles: Analysts on Wall Street Lower Ratings for These 10 Stocks 17 High Growth Non-Tech Stocks That Are Profitable 11 Stocks Insiders and Billionaires Are Crazy About Disclosure: None. 13 Most Buzzing Stocks To Buy Now is originally published on Insider Monkey. Related Quotes "
}