{
    "title": "Five things to watch for in the Canadian business world in the coming week",
    "date": "1/28/2024",
    "url": "https://www.newmarkettoday.ca/national-business/five-things-to-watch-for-in-the-canadian-business-world-in-the-coming-week-8174049",
    "text": "Sign in Join now, it's FREE! TORONTO — Five things to watch for in the Canadian business world in the coming week: Apple case A Vancouver court will decide Monday whether to approve a settlement of up to $14.4 million that Apple has offered after being accused of having performance mitigation features in its iOS software and defects in some iPhones. Metro results Metro Inc. will report its first-quarter results before financial markets open on Tuesday and hold its annual meeting of shareholders later the same day. The results come as the grocery industry faces scrutiny from shoppers struggling to deal with rising food prices. GDP figures Statistics Canada will release its reading for gross domestic product for November on Wednesday. The agency's early estimate suggested an increase of 0.1 per cent for November with gains in manufacturing, transportation and warehousing, and agriculture, forestry, fishing and hunting partially offset by decreases in retail trade. Rogers results Rogers Communications Inc. will report its fourth-quarter financial results and hold a conference call with financial analysts on Thursday before markets open. Sisters Melinda Rogers-Hixon and Martha Rogers retired from the board earlier this month as part of a private settlement between members of the Rogers family after their fight over who should lead the company. Imperial Oil results Imperial Oil Ltd. will hold a conference call with investors to discuss its fourth-quarter results on Friday. The results come as Canada's oil industry ramps up production in expectation of the imminent completion of the Trans Mountain pipeline expansion, which will increase oil export capacity to the West Coast. This report by The Canadian Press was first published Jan. 28, 2024. Companies in this story: (TSX:MRU, TSX:RCI.B, TSX:IMO) The Canadian Press  Check out Village Report - the news that matters most to Canada, updated throughout the day.  Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM. Subscribe © 2024 NewmarketToday.ca "
}