{
    "title": "SEC Rules Apple and Disney Must Face Shareholder Votes on AI Use",
    "date": "1/4/2024",
    "url": "https://www.pymnts.com/cpi_posts/sec-rules-apple-and-disney-must-face-shareholder-votes-on-ai-use/",
    "text": " In a recent decision by the U.S. Securities and Exchange Commission (SEC), tech giant Apple and entertainment conglomerate Disney are set to include shareholder votes on artificial intelligence (AI) matters during their upcoming annual meetings. According to Reuters, the ruling comes after the SEC rejected requests from both companies to exclude these proposals from the agenda. The shareholder proposals were initiated by a pension trust of the AFL-CIO, the largest American labor union federation. The labor group has also submitted AI-related measures to four other technology companies, indicating a growing concern within the labor community about the impact of AI on workers. At Apple, the AFL-CIO requested a comprehensive report on the company’s utilization of AI in its business operations, along with a disclosure of any ethical guidelines that Apple has adopted concerning its use of AI technology. Disney faced a similar request, with the labor group seeking a report on the board’s role in overseeing AI usage. Related: Comcast Looks To Sell Hulu To Disney Next Year The AFL-CIO argued in its supporting statement at Apple that AI systems should not be trained on copyrighted works or the intellectual property of professional performers without transparency, consent, and compensation to creators and rights holders. Brandon Rees, deputy director of the AFL-CIO’s office of investment, expressed optimism about the SEC’s decision, stating that it could lead to agreements with Apple and Disney aligning their AI disclosures with industry standards, citing Microsoft as an example. Rees criticized Apple and Disney, asserting that both companies have yet to address the ethical issues surrounding AI adequately. He emphasized that the SEC’s decisions highlight the need for these industry giants to catch up with their peers in addressing ethical concerns related to AI technologies. Both Apple and Disney had contended that the shareholder proposals should be excluded from their ballots as they related to “ordinary business operations,” specifically, the companies’ choices of technologies. However, the SEC rejected this argument, stating in separate letters, “In our view, the Proposal transcends ordinary business matters and does not seek to micromanage the Company.” Source: Reuters Linklaters Appoints New Global Practice Head of Antitrust\nMar 26, 2024 by\n                    CPI EU Probes Big Tech Under the DMA: Why?\nMar 25, 2024 by\n                    CPI FTC Intervenes in Teva’s Inhaler Litigation Against Amneal Amid Patent Crackdown\nMar 25, 2024 by\n                    CPI Saks Fifth Avenue Faces Antitrust Battle in New York Court\nMar 25, 2024 by\n                    CPI UK Competition Watchdog Expresses Concerns Over Funeral Sector\nMar 25, 2024 by\n                    CPI Antitrust Chronicle® – Pricing Algorithms\nFeb 28, 2024 by\n                    CPI Pricing Algorithms and Antitrust Enforcement: Sandboxes to the Rescue?\nFeb 28, 2024 by\n                    CPI AI, Algorithmic Pricing, and Collusion\nFeb 28, 2024 by\n                    CPI Competition & Collusion in a World of Algorithmic Pricing: Antitrust Risks & Enforcement Trends\nFeb 28, 2024 by\n                    CPI Pricing Algorithms in Antitrust’s Sights?\nFeb 28, 2024 by\n                    CPI "
}