{
    "title": "Apple CEO Tim Cook and NBA Commissioner Adam Silver Talk Vision Pro: “This \nChanges Everything”",
    "date": "2/5/2024",
    "url": "https://www.hollywoodreporter.com/business/digital/apple-ceo-tim-cook-nba-commissioner-adam-silver-vision-pro-interview-1235815418/",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter The Hollywood Reporter tagged along on Vision Pro release day as Cook met with Silver and toured the NBA league office. By \n\n\tAlex Weprin Media & Business Writer Tim Cook wanted to know more about the stats. The Apple CEO was huddled over an iMac in the NBA’s league headquarters in New York alongside NBA commissioner Adam Silver, flanked by a wall of regulation basketballs. On the white table in front of them was the computer, and a piece of hardware that Cook says “really changes everything.” Apple Vision Pro. The NBA had been hard at work on a dedicated app for the device, and two of its developers, senior software engineers Lauren Marshall and Matthew Parrott, were walking Cook and Silver through its features, like the ability to watch up to five games at once, the possibilities of immersive video, and, as Cook inquired about, real-time stats that can be displayed next to the live games. \n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tLifestyle\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tCONCACAF Nations League Final 2024 Livestream: How to Watch USA vs. Mexico Online\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tGeneral News\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tNBC's Paris Olympics Opening Ceremony Coming to Imax Cook and Silver, in a joint interview shortly after the demo, were effusive about the potential of the device to transform not just how people watch sports, but all entertainment content. “I’ve seen several demos of the output of different games, and it’s just mind blowing, it’s so much different,” Cook said, when quizzed by The Hollywood Reporter about the potential of the device. “It’s hard to go back to the 2-D world after you’ve been in the 3-D world, you just don’t want to do it.” “I think what the marketplace is going to do now is cause other content creator organizations — not just the NBA — to look at the transformative nature of this and start investing,” Silver added, recalling a meeting with Cook years earlier in his office, where the tech executive urged the league to invest in its own direct-to-consumer operations. “There’s a strong incentive now for us to take this global content and find ways to distribute it around the world and create an even more engaging and immersive experience. So I think you’re going to see a lot of content creators saying, we need our own developers, we need our own engineers. We can’t just leave it to others, and that’ll raise the bar for everybody.” Cook’s tour of the NBA league office took place the morning of Vision Pro’s release day, Friday Feb. 2. Just a couple of hours earlier, Cook was on hand to open the doors of Apple’s flagship Fifth Ave. Store, with employees counting down from 10 to signal Cook to swing open the oversize glass doors, and a line of die-hard Apple enthusiasts waiting outside to pick up their Vision Pro devices. Cook shook their hands as they walked in, and stuck around for selfies and to chat with buyers. A few blocks south and a few hours later in the NBA office, Cook says that many of the first customers he spoke to that morning were developers looking to get their hands on the Vision Pro so that they could experience it for themselves. He adds that, similarly, Apple is also deeply invested in getting the Vision Pro in the hands of creators who will create original content for the device, partners like the NBA and Disney, yes, but also people like filmmaker James Cameron, or Jon Favreau (who helped create an immersive dinosaur experience for the device that has to be seen to be believed). “We started talking to a lot of creators, and everybody is blown away by the storytelling that can take place in this versus the tools of the past,” Cook says. “And so my gut is there’s going to be a lot of people running towards this, but we’ll see.” In the NBA’s office, of course, live sports is always top of mind. The league’s app had been in development since shortly after the Vision Pro was announced at last year’s WWDC. “We had a lot of discussions about immersive environments versus the shared space where you can have apps living side by side,” says Chad Evans, the NBA senior VP, head of product and platform. The Vision Pro allows for both, the ability to envelope yourself in an environment like a theater, or an environment where you can simultaneously access other apps. “When we think about the fan experience, they want to be able to talk to their friends about the game. They want to be able to access their social media apps. And so we really thought about this multi app environment where you can surround yourself with NBA content and how can our app live in that ecosystem.” Evans adds that actually trying the device was “sort of this aha moment,” allowing his team to understand what they wanted to do. And then there’s the potential for immersive video, which can put users at the center of the action. “I think the fan wants to be a part of the game and a part of the action, and there’s nothing like being in Vision Pro and feeling like you’re on the court,” Cook says. “It’s not that you have a courtside seat. It’s so much better than that.” “As Tim said it this is in many ways better than sitting courtside,” Silver added. “It can take you anywhere on the floor. It can give you the perspective of a player, it can bring you places that you could never otherwise go and absorb it.” And even Silver waxed poetic about its potential to change how consumers watch sports. “We saw it for soccer, we saw it for baseball [in the Vision Pro demo], and I think as Tim said, this is of course early days, but this is transformative,” Silver added. “This to me, will be how people over time experience sports through the media.” Of course, there will be an adjustment period required. “It will take a lot, you know, it will take rethinking about production and camera locations on the courts and so forth. You will have to re-engineer everything, but it’s so worth it,” Cook says. After completing the demo Silver and Cook walked down a set of wooden bleachers into what is normally the NBA employee cafe. The tables and chairs had been cleared out, however. Instead, waiting for them was the NBA development team responsible for the Vision Pro app. Cook and Silver shook hands and posed for photos, including a group shot. On the wall is an almost floor to ceiling screen showing NBA footage. Evans, speaking with THR on bench seating overlooking a foggy Fifth Avenue and Central Park, expresses enthusiasm for the potential of immersive spatial video recording of games. Silver says the NBA is already planning to take advantage of the tech, and will utilize some of Apple’s specialized equipment to film All Star week events in Indianapolis later this month, but ultimately he expects any network or streaming service with live sports to experiment it. “I’d say in terms of a rights category, one thing that Apple has been so great at is looking out into the future,” Silver says. “I see sort of a double meaning of Vision Pro, it is literally a vision of the future. And as we look out, I’d have to imagine that anyone who’s licensing content for us is going to want to have these rights themselves, whether it’s actually Apple or someone who’s producing content: Disney, ESPN in order to use Apple hardware. “I think it’s my job to incentivize our partners to be able to look out into the future,” he added. “We’re just scratching the surface here.” Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. "
}