{
    "title": "Steve Jobs adopted a no ‘bozos’ policy and said the best managers are those \nwho never wanted the job—here are his 3 best management tips",
    "date": "2/24/2024",
    "url": "https://fortune.com/2024/02/24/steve-jobs-management-advice/",
    "text": "It’s been more than a decade since we lost Steve Jobs, the mastermind behind some of the biggest technological innovations in history. He lost his battle with pancreatic cancer in 2011, and would have been 69 years old today. Jobs’ outsize influence as Apple’s leader left a lasting impression on managers and employees alike. But one of his most unwavering beliefs might surprise leaders who aspire to success as great as the Apple cofounder. When Jobs and Apple’s other cofounders, including Steve Wozniak, first realized how big their company would be, they decided to go out and hire what they called “professional management,” or folks who just knew how to manage people. But it quickly backfired. “It didn’t work at all,” Jobs said in a mid-1980s interview. “Most of them were bozos. They knew how to manage, but they didn’t know how to do anything.” Jobs’ comment gets at the crux of a central debate in management: whether managers should actually want to be managers or not. Jobs argued the people who were least expecting to be leaders ended up being the best managers in the long run. That’s because other employees were more likely to actually learn something from them because they’ve mastered that skill—rather than focusing only on management techniques. That’s the first of Jobs’ best management tips: elevating the people to management who perform at the highest levels. “You know who the best managers are. They’re the great individual contributors who never ever want to be a manager, but decide they have to be a manager because no one else is going to be able to do as good a job as that,” Jobs said in the same interview. Jobs took a gamble on Debi Coleman, a member of the Macintosh team who was 32 years old at the time he promoted her. She studied English literature in college but earned her MBA from Stanford University and proved herself to be an exceptional financial manager. “There’s no way in the world anybody else would give me this chance to run this kind of operation,” Coleman said in a 1980s interview. “I don’t kid myself about that there’s an incredible high risk—both for myself personally and professionally, and for Apple as a company—and put a person like myself in this job.” Apple was “betting on a lot of things” when it made her a financial manager, Coleman said. The company was “betting that my skills and organizational effectiveness override” her lack of tech and manufacturing experience. Coleman went on to become chief financial officer of Apple and was referred to as one of Silicon Valley’s “most prominent technology executives.” She died in 2021. Another key position held by Jobs was that Apple would be a collaborative company—and uniting his employees with a “common vision” was a central concept. “That’s what leadership is: having a vision, being able to articulate that so that people around you can understand it and getting a consensus on a common vision,” Jobs said in the mid-1980s interview. That collaborative approach has continued to show itself throughout Apple’s history as Jobs long said that his company was the “largest startup” in the world. “There’s tremendous teamwork at the top of the company, which filters down to tremendous teamwork throughout the company,” Jobs said in a 2010 interview at the D8 Conference. “Teamwork is dependent on trusting the other folks to come through with their part without watching them all the time.” Jobs took it upon himself to be heavily invested with and involved in recruiting at Apple. He wanted people who were “insanely great at what they did” but “not necessarily those seasoned professionals.” Jobs wanted employees and managers who knew what Apple could do with technology and wanted to bring it to “lots of people.” “The neatest thing that happens is when you get a core group of 10 great people,” Jobs said in the mid-1980s interview. “It becomes self policing as to who they let into that group. So I consider the most important job of someone like myself [to be] recruiting.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}