{
    "title": "Alibaba's DingTalk Launches 3D Messaging App for Apple's Vision Pro Headset",
    "date": "2/6/2024",
    "url": "https://finance.yahoo.com/news/alibabas-dingtalk-launches-3d-messaging-144739631.html",
    "text": "Alibaba Group Holding Limited’s (NYSE:BABA) DingTalk has introduced a dedicated app for Apple Inc’s (NASDAQ:AAPL) Vision Pro headset, enabling users to engage in 3D messaging and video conferencing. This app is part of the initial wave of applications optimized for Apple’s high-end headset, priced at $3,499 in the U.S. market. DingTalk’s Vision Pro app, featuring advanced functionalities, allows users to manage multiple windows and utilize hand gestures for drawing directly on the screen, SCMP reports. Furthermore, the app supports Apple’s Persona feature, which creates realistic digital avatars from users’ facial scans, enhancing video calls with true-to-life expressions tracked in real-time. The launch positions DingTalk alongside other Chinese applications embracing Apple’s latest tech offering, despite its current availability being limited to the U.S., with plans for expansion into other markets, including China. Alibaba’s workplace communication platform DingTalk accomplished a landmark of 700 million users by the end of 2023. Under President Ye Jun, DingTalk revealed an AI agent powered by Alibaba Cloud’s Tongyi Qianwen. Additionally, popular Chinese mobile games and services like Honkai: Star Rail by miHoYo and the online travel service provider Trip.com have announced their apps for the Vision Pro, expanding its ecosystem with diverse content ranging from gaming to immersive travel experiences. As DingTalk surpasses 700 million users, including 120,000 enterprises, the platform continues to innovate, recently incorporating an AI agent to streamline workflows. This move reflects a broader trend among Chinese tech giants integrating AI into their offerings. Analysts expect Apple’s Vision Pro to offer a significant EPS boost from immersive tech and apps. Vision Pro’s AR features can also be a valuable tool for e-commerce, helping customers try on new clothing items or visualize new furniture products in their homes. Price Actions: BABA shares traded higher by 3.18% at $77.00 premarket on the last check Tuesday. AAPL shares traded higher by 0.25% at $188.15. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo courtesy: Apple \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? ALIBABA GR HOLDING (BABA): Free Stock Analysis Report This article Alibaba's DingTalk Launches 3D Messaging App for Apple's Vision Pro Headset originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}