{
    "title": "Could Nvidia Be Worth More Than Apple?",
    "date": "2/25/2024",
    "url": "https://247wallst.com/technology-3/2024/02/25/could-nvidia-be-worth-more-than-apple/",
    "text": "Almost no one saw the astronomical rise of AI chip company Nvidia (NASDAQ: NVDA) coming. Its market cap, at nearly $2 trillion, has jumped ahead of tech behemoths Amazon (NASDAQ: AMZN) and Alphabet (NASDAQ: GOOG). Its revenue is rising at a triple-digit pace, and the AI revolution means that pace could continue for several more quarters, if not longer. Only two public corporations have a higher market cap than Nvidia. One is Microsoft (NASDAQ: MSFT) at $3.1 trillion. The other is Apple (NASDAQ: AAPL) at $2.8 trillion. Among the differences between Apple and Nvidia is that one benefits from older technology, and one benefits from technology that is considered the wave of tech and, in some ways, the world’s future. Even Warren Buffett sold Apple shares. Apple’s success is almost completely hardware-driven, and its primary product, the iPhone, is over a decade old. Additionally, Apple is no longer growing. In its most recent quarter, revenue rose a very modest 2% to $119.6 billion. Of this, all but $23.1 billion came from hardware. Apple has an installed base of 2.2 billion active devices. However, the flagship iPhone was introduced in 2007. Investors worry that each new smartphone generation is not different enough from the previous version to keep iPhone sales rising rapidly. Apple’s shares are higher by a modest 24% in the last year, while the S&P is up 19%. Nvidia’s shares are up 238% in the last year. Part of this steep climb came after it announced spectacular earnings. Its revenue in the most recent quarter was much smaller than Apple’s, at $22.1 billion. However, it grew by 265%. The company forecasts that the current quarter will likely post astonishing growth again. CEO Jensen Huang commented, “Accelerated computing and generative AI have hit the tipping point. Demand is surging worldwide across companies, industries and nations.” AI, based on many tech experts, could be the most important technological improvement since the invention of the internet or the first widely available PC. If it changes how people work and their daily lives as much as expected, the AI revolution could be even more critical. Can Nvidia’s stock rise by 40% to match Apple’s? If the AI revolution is close to most expectations, and its revenue continues to grow at trip digits, it is possible. The Modern Investment App For a Richer Tomorrow (Sponsored) Robinhood set out to democratize investing to individuals, and it’s not slowing down. The app makes it possible to buy and sell stocks, mutual funds, trade options, and even cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH). With FDIC insurance ,an award winning design, and benefits like IRAs and more, Robinhood could be your path to a richer tomorrow. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}