{
    "title": "Apple Stock: Poised To Continue Disrupting Our Lifestyles (NASDAQ:AAPL)",
    "date": "2/10/2024",
    "url": "https://seekingalpha.com/article/4669245-apple-poised-to-continue-disrupting-our-lifestyles",
    "text": "Nikada/iStock Unreleased via Getty Images Nikada/iStock Unreleased via Getty Images In 2024, Apple (NASDAQ:AAPL) lost its number one position as the world's most valuable public company to Microsoft (MSFT). Apple has maintained its status as the world's largest public company for an extended period, and my fundamental analysis indicates that this accolade is well-deserved. Reclaiming the top spot may simply be a matter of time. My optimism regarding Apple stems from its expansive ecosystem, boasting over 1.5 billion users and unparalleled brand loyalty, which provides a solid strategic foundation for growth. While it is highly likely that iPhone sales growth will naturally decelerate due to market saturation, Services emerge as a standout performer with exceptional growth prospects. Moreover, the recent release of the groundbreaking Vision Pro device has the potential to revolutionize both professional and entertainment domains, reminiscent of the impact the iPhone had in 2007-2008. Valuation also plays a pivotal role in my investment decisions, and my analysis suggests that AAPL is attractively valued. With these strengths in mind, I firmly believe that AAPL merits a \"Strong Buy\" rating. Apple is one of the world's largest companies that manufactures and sells smartphones, tablets, PCs, software, and peripherals across the world. According to Apple's latest quarterly earnings, the iPhone represented 58% of the company's total sales. Apple's 10-Q report Apple's 10-Q report The latest quarterly report was released on February 1. The December quarter was robust for Apple as the company topped consensus estimates and delivered a 2.1% YoY revenue growth and profitability improvement despite the soft microenvironment, which is evidenced by a disappointing recent Q4 report from Samsung Electronics (OTCPK:SSNLF), one of Apple's biggest rivals. From the products' perspective, the iPad and wearables/accessories were in line with the soft environment, but the strength demonstrated by the iPhone mitigated the dip in other products. After several weak quarters, the smartphone market demonstrated a solid 8% rebound in Q4, which was a notable tailwind for Apple. Given the extensive coverage of the iPhone across the internet, I won't delve into exhaustive details here. However, it's important to highlight the significant rebound in the smartphone market, which marks a notable shift from the negative trend observed in previous quarters. With penetration levels already relatively high, I anticipate steady growth to persist for this product. Moreover, considering the substantial portion of revenue derived from the iPhone, I foresee it maintaining Apple's exceptional profitability well into the foreseeable future. SA SA It is important to remember that Apple is not only about selling physical products, but its second-largest revenue stream is services, which includes revenues from payment services, subscriptions, and advertising income. There are around 1.5 billion active iPhones in the world at the moment, so there is a vast target audience for Apple's \"Services\" revenue stream. I think this line of business will likely become the primary growth catalyst in the foreseeable future. The massive growth dynamics back my confidence in this stream in recent years. statista.com statista.com The enormous customer base for Services is not the only factor that will highly likely help the line of business' rapid expansion in the next few years. Apple's brand's strength is intact, which we see from data suggesting that Apple's ecosystem has a staggering 79% customer loyalty and a customer retention rate of 90%. Such high brand loyalty allows Apple to introduce sharp service fee increases, which seem not to affect its brand's power at all. Apart from existing services, the rapidly expanding adoption of artificial intelligence (\"AI\") capabilities provides more room for Apple to introduce new offerings to customers based on the subscription model. I am optimistic about Apple's potential for significant growth in service revenue, driven by several solid factors. Firstly, the company boasts a massive \"cash cow\" in the form of the iPhone. Secondly, Apple has a strong track record of innovation and substantial financial resources, enabling heavy investment in internal R&D and strategic acquisitions of innovative startups-reportedly acquiring 32 AI startups in 2023 alone. These investments in AI suggest a high likelihood of Apple introducing new, groundbreaking AI-powered features, potentially offered through a subscription model. Furthermore, with approximately 1.5 billion active iPhones globally, Apple possesses vast volumes of data, a valuable asset for training its machine learning (\"ML\") algorithms. This data can ultimately enhance the quality of AI and ML services offered by the company. Yahoo Finance Yahoo Finance I like to look at the company's future prospects through the prism of the BCG matrix. As I mentioned, the iPhone itself is an apparent cash cow because of its high market share, high profitability, and highly likely decelerating growth rates in next years as smartphone penetration levels increase. The vast opportunity to drive service growth due to the iPhone's extensive adoption brings a massive synergetic effect, which will highly likely make Service the major star of Apple in the next couple of years. BCG BCG With all due respect, the Mac, iPad, or wearables are unlikely to become the new stars as these products did not demonstrate resilience to cyclicality like the iPhones and Services did. But the company's brand new Vision Pro device, which was officially released just recently, has a chance to become a star over the long term. A few days after its official release, the Vision Pro is an apparent question mark with all the initial hype caused primarily by the power of Apple's brand. The future success after the hype cools down will depend on the true value for customers from this product. I am not a virtual reality expert, nor did I have an opportunity to test the device by myself, but some reviews look very impressive and give the firm feeling that Vision Pro indeed provides an unmatched experience and can be a true technological disruptor both for entertainment and professional settings. Naturally, skepticism surrounds the device's hefty $3,500 price tag and concerns about comfort while wearing it. However, it's worth recalling how iconic figures like Steve Ballmer scoffed at the iPhone's $500 starting price and lack of a physical keyboard back in 2007. The subsequent success of the iPhone speaks volumes, demonstrating the potential for groundbreaking innovations to overcome initial doubts and reshape entire industries. Therefore, I believe that there is a significant probability that Vision Pro might become a true game changer and supercharge Apple's long-term growth prospects like the iPhone did more than 15 years ago. Apple has been the world's most valuable company, with a market cap of around $3 trillion, for a long time and just recently lost its leadership to Microsoft. The controversy around the \"Magnificent 7\" overvaluation seems like a hot topic any time; try to type into your search engine \"Magnificent seven bubble,\" and you will find dozens of fresh articles explaining why the U.S. bit tech companies' valuations are about to burst. I want to emphasize that there was an article from Clem Chambers calling Apple stock a bubble in April 2012, almost twelve years ago. At that time, Apple's market cap was around $500 billion, i.e., the market cap nearly sextupled despite black swans like the one-in-a-century pandemic or the biggest war in the middle of Europe since WWII. macrotrends.net macrotrends.net Therefore, to determine the attractiveness of Apple's valuation, I prefer to rely on the discounted cash flow (\"DCF\") valuation model instead of hot headlines. I use a 9% WACC for discounting and a 6% constant growth rate for the terminal value (\"TV\") calculation. The constant growth rate is always a controversial metric, and some readers might call me too optimistic when I give AAPL a 6% constant growth rate. On the other hand, over the last 20 years, Apple's revenue grew from $8 billion to $383 billion, which equals a 21% CAGR. In this context, a 6% constant growth rate looks conservative and fair. I use a TTM 22.4% levered free cash flow (\"FCF\") margin and forecast a 50 basis points annual expansion. As usual, I rely on consensus revenue estimates only for the two upcoming fiscal years and forecast a 6% revenue growth rate for years beyond, which aligns with my constant growth rate assumption. There are currently around 15.6 billion AAPL shares outstanding. Calculated by the author Calculated by the author Based on my DCF calculations, AAPL's fair price is $218, which is 15% higher than the current market price. Therefore, the stock is very attractively valued, especially given the company's unparalleled brand and customer ecosystem loyalty. As we have seen in the fundamental analysis, having most of the revenue generated from the iPhone is a highly profitable business. That said, this industry is very attractive to other advanced consumer electronics companies and highly competitive. Apart from Apple, the global smartphone industry is crowded with several large Asian manufacturers. Samsung has been consistently leading in terms of market share, but on the chart below, we can also see that players like Xiaomi (OTCPK:XIACF) and Oppo also hold market shares that are not so far below Apple. The competition is intense, and Apple must consistently be at the forefront of innovation to protect its market share. Counterpoint Counterpoint Samsung's flagship Galaxy S-series smartphone has been the major direct competitor of the iPhone for a long time and consistently rolls out new innovative features. For example, the company recently introduced its Galaxy S24 model, which features generative AI capabilities the iPhone does not have yet. With that in mind, it's crucial to recognize that the iPhone is engaged in a continuous technological race with its competitors, leaving no margin for error in such a fiercely competitive landscape. Hence, I would identify competition risk as the most significant concern for Apple, particularly given the company's heavy reliance on profits from the smartphone segment. While the recent release of Apple's Vision Pro holds promise and, in my view, has the potential to revolutionize an entire industry, I perceive a significant risk associated with it. I believe this groundbreaking device could render tablets and laptops obsolete, thereby cannibalizing Apple's revenues from the iPad and Mac. Essentially, while the company may unlock a notable new revenue stream, it could come at the expense of two existing ones, potentially offsetting the overall impact. Upon reviewing the official description of the new product, it appears that its capabilities overlap with those offered by tablets and laptops. While the spatial computing experience will certainly offer a fresh and innovative experience for consumers, it's difficult to imagine the necessity for a laptop or tablet when one already owns a device capable of performing similar tasks, but with features emblematic of an entirely new digital era. To me, Apple appears to be an obvious \"Strong Buy\" due to its promising future growth and innovation prospects, expected to be driven by its considerable accumulated financial resources, the ongoing success of its cash cow, the iPhone, and the vast potential of its services business. Additionally, the stock is currently trading at a notable discount, which further bolsters my optimism as an investor, offering the potential for greater capital appreciation. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AAPL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}