{
    "title": "Warren Buffett Just Revealed the 8 Stocks That Berkshire Hathaway Will \nLikely Hold Forever -- and Apple Wasn't One ...",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/warren-buffett-just-revealed-8-110700652.html?ref=biztoc.com",
    "text": "Warren Buffett is known as a buy-and-hold investor. He once stated, \"When we own portions of outstanding businesses with outstanding managements, our favorite holding period is forever.\" However, Buffett doesn't hold forever every stock he buys. There's a good bit of churn in Berkshire Hathaway's (NYSE: BRK.A) (NYSE: BRK.B) portfolio. But the legendary investor has identified a handful of Berkshire's holdings that he believes are forever stocks. Buffett just revealed the eight stocks that he thinks Berkshire Hathaway will likely hold forever -- and Apple (NASDAQ: AAPL) wasn't one of them. In his letter written to Berkshire Hathaway shareholders last year, Buffett discussed two long-term holdings -- American Express (NYSE: AXP) and The Coca-Cola Company (NYSE: KO). He noted that Berkshire completed building big positions in both stocks in the mid-1990s after several years of buying. American Express and Coca-Cola have been massive winners for Buffett and Berkshire. In his letter written last year, he used them to make an important point: \"The weeds wither away in significance as the flowers bloom. Over time, it takes just a few winners to work wonders.\" Buffett mentioned AmEx and Coca-Cola again in his most recent letter to Berkshire shareholders, which was released on Saturday. He emphasized the lesson from these two purchases: \"When you find a truly wonderful business, stick with it.\" In his latest shareholder letter, Buffett added other stocks that he said Berkshire \"expect[s] to maintain indefinitely.\" The first new addition to the list was Occidental Petroleum (NYSE: OXY). Berkshire has been buying Occidental shares hand over fist. At the end of 2023, the conglomerate's stake in the company stood at 27.8%. It's now the sixth-largest position in Berkshire's portfolio. Buffett stressed that Berkshire doesn't have any intention of fully acquiring Occidental or gaining control of the oil and gas producer. However, he said that \"we very much like our ownership,\" along with the option to increase Berkshire's position. There are two things about Occidental that Buffett especially likes. First, the company has extensive oil and gas operations in the U.S. Second, Occidental is a leader in carbon capture. Although Buffett acknowledged that the technology is still unproven, he argued that it, along with Occidental's large oil and gas holdings, \"are very much in our country's interest.\" Buffett discussed the other five stocks that he believes Berkshire will hold practically forever as a group, rather than individually. They're the five huge Japanese trading houses: Itochu (OTC: ITOCF) (OTC: ITOCY) Marubeni (OTC: MARUY) Mitsui (OTC: MITSF) (OTC: MITSY) Mitsubishi (OTC: MSBHF) Sumitomo (OTC: SSUM.F) (OTC: SSUM.Y) Berkshire currently owns stakes of roughly 9% in each of these Japanese companies. Buffett noted that the conglomerate has committed that it wouldn't increase its ownership in any of them beyond 9.9%. What does Buffett like about these five companies? For one thing, he mentioned that each of them \"operates in a highly diversified manner somewhat similar to the way Berkshire itself is run.\" He likes the Japanese companies' policies that are beneficial to shareholders, including smart stock buybacks. Buffett also stated that the investments could open the door for Berkshire to partner with the companies down the road. Apple remains Berkshire's largest holding, by far. Buffett didn't list the tech giant in his list of stocks that Berkshire would hold forever. In the fourth quarter of 2023, Berkshire even trimmed its position in Apple. Does this mean that Buffett doesn't view Apple as a forever kind of stock? I don't think so. For one thing, it's important to remember that Buffett only focuses on a small number of specific Berkshire holdings in each shareholder letter. He didn't discuss Occidental (except for one brief mention), Itochu, Marubeni, Mitsui, Mitsubishi, or Sumitomo in last year's letter, even though Berkshire owned all of these stocks then. In May 2023 at Berkshire's shareholder meeting, Buffett stated that Apple \"is a better business than any we own.\" Again, all eight of the stocks that he indicated he thinks Berkshire will own indefinitely were in Berkshire's portfolio when he made that statement. The bottom line is that we shouldn't assume that there aren't other stocks in addition to American Express, Coca-Cola, Occidental, and the five Japanese trading-house stocks that Berkshire will hold for decades to come. I'd bet that if Buffett were asked to name the full list, Apple would be on it -- and probably several other stocks, too. Should you invest $1,000 in Berkshire Hathaway right now? Before you buy stock in Berkshire Hathaway, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 American Express is an advertising partner of The Ascent, a Motley Fool company. Keith Speights has positions in Apple and Berkshire Hathaway. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy. Warren Buffett Just Revealed the 8 Stocks That Berkshire Hathaway Will Likely Hold Forever -- and Apple Wasn't One of Them was originally published by The Motley Fool Related Quotes "
}