{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.kiplinger.com/stocks-warren-buffett-is-buying-and-selling-berkshire-hathaway",
    "text": "Save up to 74% Subscribe to Kiplinger When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Warren Buffett upped Berkshire Hathaway's holdings in the oil patch and trimmed its Apple stake, among other moves in Q4. Warren Buffett's Berkshire Hathaway (BRK.B) trimmed its Apple (AAPL) stake in the fourth quarter, added to positions in Chevron (CVX) and Occidental Petroleum (OXY), slashed holdings in HP (HPQ) and Paramount Global (PARA) and completely exited small bets on four other stocks. Although the Apple move grabbed the most headlines, the sales look more like an attempt to keep the iPhone maker's weight in the Berkshire portfolio from getting too out of whack. AAPL stock rallied more than 12% in the final three months of last year. Berkshire responded by reducing its position by 1%, or 10 million shares. And yet even after lightening up, Apple still accounts for 50.2% of Berkshire's total portfolio value, up from 50% three months ago. Be a smarter, better informed investor. Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. Chairman and CEO Buffett is thought to manage about 90% of Berkshire Hathaway's equity portfolio, with co-portfolio managers Ted Weschler and Todd Combs handling the remainder. Buffett, who has called Apple Berkshire's \"third business\" and its \"best business,\" is thought to handle most of the firm's Apple investments, but it's possible Weschler or Combs made the sales from their own smaller holdings. Before we get into Berkshire's other trades, it's important to note that Buffett has always run a highly concentrated portfolio. Apple, as noted above, accounts for more than half the portfolio, while Berkshire's top five holdings comprise more than 80%. The top 10 holdings account for 93%. As for Buffett's latest moves, on the buy side of the ledger he took advantage of weakness in the energy sector to add to two of his favorite oil stocks. Shares in Chevron, the only energy name among Dow Jones stocks, spent much of Q4 trading below $150 a share. Occidental Petroleum, meanwhile, spent a good chunk of December below $60 a share. Buffett has tended in the past to pick up CVX and OXY when they slip below those respective levels, so it shouldn't come as too much of a surprise that he added to both holdings in Q4. Berkshire upped its CVX stake by 14.4%, or almost 16 million shares. With 126 million shares worth $18.8 billion, the energy major is BRK.B's fifth largest holding at 5.4% of the portfolio (down from almost 6% three months ago). As for OXY, Berkshire raised its stake by 8.7%, or 19.6 million shares. At 4.2% of the portfolio – down from 4.6% three months ago – OXY is Berkshire's sixth largest position. Lastly, Berkshire quadrupled its ownership of Sirius XM Holdings (SIRI). However, at 0.6% of the BRK.B portfolio, SIRI remains an immaterial position. Berkshire initiated a small stake in John Malone-backed SIRI in the third quarter of 2023. (BRK.B has owned SIRI before, exiting a small stake back in 2021.)  On the sell side of Berkshire's ledger, things were a bit busier. In addition to trimming Apple, Buffett slashed BRK.B's stake in HP by 78%. Buffett initiated a commanding position in the PC and printer maker back in 2022. At the time, HP looked like a classic Buffett value play, but that didn't quite work out. HPQ now comprises 0.2% of the BRK.B portfolio. That's a sharp drop from 0.84% last quarter. Elsewhere, BRK.B cut its stake in Paramount Global by a third. PARA now accounts for just 0.27% of the portfolio, down from 0.39% a quarter ago. And finally, in a series of exits, BRK.B completely sold out its positions in D.R. Horton (DHI), StoneCo (STNE), Markel (MKL) and Globe Life (GL). DHI had comprised just 0.2% of the BRK.B portfolio, while the other three stocks accounted for less than 0.1%. For a look at all of Warren Buffett's stocks and exchange-traded funds, be sure to check out the complete holdings of the Berkshire Hathaway portfolio. Dan Burrows is Kiplinger's senior investing writer, having joined the august publication full time in 2016.  A long-time financial journalist, Dan is a veteran of SmartMoney, MarketWatch, CBS MoneyWatch, InvestorPlace and DailyFinance. He has written for The Wall Street Journal, Bloomberg, Consumer Reports, Senior Executive and Boston magazine, and his stories have appeared in the New York Daily News, the San Jose Mercury News and Investor's Business Daily, among other publications. As a senior writer at AOL's DailyFinance, Dan reported market news from the floor of the New York Stock Exchange and hosted a weekly video segment on equities.  Once upon a time – before his days as a financial reporter and assistant financial editor at legendary fashion trade paper Women's Wear Daily – Dan worked for Spy magazine, scribbled away at Time Inc. and contributed to Maxim magazine back when lad mags were a thing. He's also written for Esquire magazine's Dubious Achievements Awards.  In his current role at Kiplinger, Dan writes about equities, fixed income, currencies, commodities, funds, macroeconomics, demographics, real estate, cost of living indexes and more.  Dan holds a bachelor's degree from Oberlin College and a master's degree from Columbia University.  Disclosure: Dan does not trade stocks or other securities. Rather, he dollar-cost averages into cheap funds and index funds and holds them forever in tax-advantaged accounts. Figuring out when it’s time and knowing how to talk about it are just the start. You also need info about estate plans, insurance and health care decisions. By Tony Drake, CFP®, Investment Advisor Representative\n\nPublished 26 March 24 Opportunity zones, Delaware statutory trusts and real estate income funds can help investors maximize gains and mitigate taxes. By Dwight Kay\n\nPublished 26 March 24 Digital World Acquisition sizzled, too, ahead of tomorrow's merger with Trump Media & Technology Group. By Karee Venema\n\nPublished 25 March 24 Experts assess economic signals for 2024. By Simon Constable\n\nPublished 25 March 24 A fiscal year has uses for financial reporting. Here's why it's an important concept for investors to be aware of. By Will Ashworth\n\nPublished 23 March 24 The Nasdaq Composite managed to notch a new record close Friday, building on the week's impressive gains. By Karee Venema\n\nPublished 22 March 24 Reddit sizzled in its market debut, while Apple slumped after the tech giant was slapped with an antitrust lawsuit. By Karee Venema\n\nPublished 21 March 24 The main indexes notched new record closes Wednesday after the Federal Reserve kept its outlook for rate cuts unchanged. By Karee Venema\n\nPublished 20 March 24 Inflation has eased over the last year but remains elevated, the central bank says. By Esther D’Amico\n\nPublished 20 March 24 Chipotle stock is sizzling Wednesday after the burrito chain announced a 50-for-1 stock split. By Karee Venema\n\nPublished 20 March 24 Kiplinger is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}