{
    "title": "3 Stocks to Watch From the Prospering Computer Industry",
    "date": "2/23/2024",
    "url": "https://ca.finance.yahoo.com/news/3-stocks-watch-prospering-computer-160100563.html",
    "text": "Wall Street took a break from rally on Monday, with all three major indexes dipping slightly The Zacks Computer - Mini Computers industry is benefiting from steady demand for enterprise devices, including laptops, tablets and smartphones. Industry participants like Apple AAPL, HP HPQ and 3D Systems DDD are benefiting from these trends. The improving availability of 5G-enabled smartphones has been a key catalyst for the industry participants. The launch of foldable and AI and ML-infused smartphones, tablets, wearables and hearables is another major growth driver for the industry participants. Robust demand for production printers, materials and software bodes well for 3-D printing solution providers. However, waning demand for consumer PCs and geopolitical challenges, including raging inflation and high interest, are major headwinds. Industry Description The Zacks Computer – Mini Computers industry comprises companies that offer smartphones, desktops, laptops, printers, wearables and 3-D printers. Such devices are based either on iOS, MacOS, iPadOS, WatchOS, Microsoft Windows, or Google Chrome and Android operating systems. The companies predominantly use processors from Apple, Intel, AMD, Qualcomm, NVIDIA and Samsung. Expanding screen size, better display and enhanced storage capabilities have been the key catalysts driving the rapid proliferation of smartphones. This has been well-supported by faster mobile processors. Laptops, both consumer and commercial, benefit from faster processors, sleek designs and expanded storage facilities. The addition of healthcare features has been driving the demand for wearables. 3 Mini Computer Industry Trends to Watch Enterprise Adoption Remains Healthy: Strong enterprise demand has been benefiting the industry participants. The growing adoption of a hybrid working environment bodes well for the players, as demand for laptops and tablets is expected to increase. Demand for smart devices that offer facial recognition, retina scans or finger impressions to verify the user for biometrics is gaining traction as enterprises enhance security.Impressive Form Factor Drives Demand: Expanding screen size, better display and enhanced storage capabilities have been the key catalysts driving the rapid proliferation of smartphones and tablets. This has been well-supported by faster mobile processors from the likes of Qualcomm, NVIDIA, Apple and Samsung. Improved Internet penetration and speed, along with the evolution of mobile apps, have made smartphones indispensable for consumers. Improved graphics quality is making smartphones suitable for playing sophisticated games. This is driving the demand for high-end smartphones and opening up significant opportunities for device makers.PCs Face Extinction Risk: Personal computers (desktops and laptops), be it Windows or Apple’s MacOS-based ones, have been facing the risk of extinction due to the rapid proliferation of smartphones and tablets. Stiff competition from smartphones has compelled global PC makers to not only upgrade hardware frequently but also add apps and cloud-based services to attract consumers. Nevertheless, the emergence of 5G, AI, machine learning and foldable computers is likely to be the key catalysts in expanding the total addressable market of PCs. Zacks Industry Rank Indicates Bright Prospects The Zacks Computer – Mini Computers industry is housed within the broader Zacks Computer and Technology sector. It carries a Zacks Industry Rank #104, which places it in the top 41% of more than 250 Zacks industries.The group’s Zacks Industry Rank, which is the average of the Zacks Rank of all the member stocks, indicates bright near-term prospects. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than two to one.The industry’s position in the top 50% of the Zacks-ranked industries is a result of a positive earnings outlook for the constituent companies in aggregate. Looking at the aggregate earnings estimate revisions, it appears that analysts are optimistic about this group’s earnings growth potential. Since Oct 31, 2023, the Zacks Consensus Estimate for this industry’s 2024 earnings has moved up 0.5%.Given the bullish outlook, there are a few stocks worth watching in the sector. But before we present those stocks that you may want to consider for your portfolio, let’s take a look at the industry’s recent stock-market performance and valuation picture. Industry Lags Sector and S&P 500 The Zacks Computer – Mini Computers industry has underperformed the broader Zacks Computer and Technology sector as well as the S&P 500 index over the past year.The industry has gained 22.8% over this period compared with the S&P 500’s return of 27% and the broader sector’s rise of 50.9%. Industry's Current Valuation On the basis of forward 12-month P/E, which is a commonly used multiple for valuing computer stocks, we see that the industry is currently trading at 26.61X compared with the S&P 500’s 21.02X and the sector’s 26.72X.Over the last five years, the industry has traded as high as 32.32X and as low as 13.92X, with the median being 24.64X, as the chart below shows.   3 Computer Stocks to Watch Right Now Apple: This Zacks Rank #3 (Hold) company is benefiting from a steady demand for iPhone devices, as well as an expanding footprint in emerging markets.  You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. A growing subscriber base and improving customer engagement are tailwinds for the services business. Apple currently has more than 1 billion paid subscribers across its Services portfolio. The App Store continues to draw the attention of prominent developers worldwide, helping it offer appealing new apps that drive the App Store’s traffic. A growing number of AI-infused apps will attract subscribers to the App Store.The Zacks Consensus Estimate for fiscal 2024 earnings has decreased by 0.6% to $6.56 per share over the past 30 days. The stock has declined 4.2% in the year-to-date period.  HP: This Zacks Rank #3 company’s sustained focus on launching the latest and innovative products is likely to help it stay afloat in the current uncertain macroeconomic environment.Product innovation and differentiations are the key drivers that have helped HPQ maintain its leading position in the PC and printer markets.The Zacks Consensus Estimate for fiscal 2024 earnings has been steady at $3.45 per share over the past 30 days. HP shares have declined 3.8% year to date.  3D Systems: This Zacks Rank #3 company expects the dental market to stabilize amid the high inventory level in the supply chain and weakness in consumer discretionary spending.3D System expects a slower recovery in 2024 than its earlier expectation. Dental sales are expected to benefit from the continuing migration of orthodontic solutions from metal brackets and wires to clear aligners in the long run. Improved asset management and resource utilization are anticipated to reduce its total inventory significantly in 2024.The Zacks Consensus Estimate for 2024 earnings has increased by a penny to 8 cents per share over the past 30 days. The stock has declined 21.9% in the year-to-date period. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report HP Inc. (HPQ) : Free Stock Analysis Report 3D Systems Corporation (DDD) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein  Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises.  Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr.,  (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach  “The Daily Show” host tears into the former president’s claim ― and shows why the case matters. New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit.  The Ohio lawmaker was asked about Donald Trump’s debunked claims about the 2020 election. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Anne Hathaway told Vanity Fair during a cover story interview that Christopher Nolan more or less saved her career when public opinion turned against her in the lead up to and the aftermath of her winning the Oscar for “Les Miserables.” Hathaway was widely mocked online at this time, and she once remembered googling herself …  The president has been going after his presumptive 2024 opponent with a little more venom than usual President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… The rapper was caught off guard when her \"whole boob\" fell out of her top on stage "
}