{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.pocket-lint.com/apple-watch-series-9-us-ban-explained/",
    "text": "What Apple's ITC ban means for current Apple Watch owners, and how we got here. The once unthinkable has occurred: Apple is banned from selling not one but two different products over a patent dispute that dates back more than a decade. Since Jan. 17, 2024, the company has sold modified versions of the Apple Watch Series 9 and Apple Watch Ultra 2 in the US that do not feature the blood oxygen monitoring functionality those wearables previously included. How did we get here, what happens next, and what does it all mean if you own a Watch Series 9 or Watch Ultra 2? This guide will attempt to answer those questions. This particular legal saga dates back to 2013, with the release of the Apple Watch Series 6 in 2020 representing a flashpoint. Two years before it announced the original Apple Watch in 2015, Masimo, a medical device maker based out of Irvine, Calif., alleges Apple asked for a meeting the company said would help it \"to understand more about Masimo's technology to potentially integrate that technology into Apple’s products.\" At the time, Masimo was known for its pulse oximetry tech, which many wearables use to measure SpO2 or blood oxygen saturation. 'When Apple takes an interest in a company, it's the kiss of death. First, you get all excited. Then you realize that the long-term plan is to do it themselves and take it all.' According to Masimo, it left those discussions feeling they were productive. However, later that same year, Apple began hiring some of the company's key talent, offering them \"sizable salaries\" to bring their expertise to Cupertino. Among the employees Masimo lost to Apple was its chief medical officer. \"When Apple takes an interest in a company, it’s the kiss of death,\" Joe Kiani, the founder and CEO of Masimo, told The Wall Street Journal in 2023. \"First, you get all excited. Then you realize that the long-term plan is to do it themselves and take it all.\" In fall 2020, Apple released the Watch Series 6, the first Apple Watch to feature a blood oxygen monitor. Earlier in the year, Masimo filed a complaint with the US District Court in Central California accusing the company of stealing trade secrets and infringing upon its pulse oximetry patents. Apple subsequently counter-sued Masimo, alleging the company had infringed on several Apple Watch patents with its W1 Medical Watch. Patent litigation is a slow process, and the original lawsuit from Masimo dragged on until May 2023, ending in a mistrial. In search of more immediate relief, tech companies will often turn to the US International Trade Commission (ITC) while they continue to litigate their patent disputes in court. That's what Sonos did when it accused Google in 2020 of infringing on its smart speaker patents, and it's also exactly what Masimo did. In 2021, the company filed a complaint with the ITC, urging the federal agency to block imports of the Apple Watch Series 6. At the start of 2023, a judge ruled in favor of Masimo, finding that Apple had infringed on two of the company's pulse oximeter patents. On Oct. 26, 2023, the ITC upheld the judge's ruling and granted Masimo's request for a complete ban on imports of Apple Watch Series 6, Series 7, Series 8, and Series 9 models. The commission also ordered a stop to sales of Apple Watch units that were already in the country. At the same time, it sent the decision to the Biden administration for presidential review, starting a 60-day process that ended on Dec. 26. There was the possibility of President Joe Biden or the US Trade Representative vetoing the ITC decision, thereby allowing Apple to avoid the import and sales ban, but that did not happen. \"After careful consultations, Ambassador Katherine Tai decided not to reverse the ITC’s determination,\" the ITC said on Dec. 26. After the decision, Apple stated: At Apple, we work tirelessly to create products and services that meaningfully impact users' lives. It’s what drives our teams -- Clinical, Design and Engineering -- to dedicate years to developing scientifically validated health, fitness and wellness features for Apple Watch, and we are inspired that millions of people around the world have benefited greatly from this product. We strongly disagree with the USITC decision and resulting exclusion order, and are taking all measures to return Apple Watch Series 9 and Apple Watch Ultra 2 to customers in the US as soon as possible. On Dec. 18, 2023, Apple announced it was preparing to comply with the ITC order. On Dec. 21, the company stopped selling the Watch Series 9 and Watch Ultra 2 through its online store. Before Apple won a temporary stay, the company's website said those models were \"currently unavailable.\" On Dec. 24, both wearables were not available for purchase from the more than 270 retail locations the company operates across the US. As expected, Apple moved quickly to file an appeal with the ITC after the import ban went into effect on Dec. 26. On the same day, the company requested an emergency stay of the ban until at least Jan. 13, 2024, or the day US Customs and Border Protection was expected to decide if redesigned versions of the Watch Series 9 and Watch Ultra 2 no longer infringe on Masimo's patents. In court documents, Apple claimed it would \"suffer irreparable harm\" if it could not sell those models during legal proceedings. \"At a minimum, the Court should grant a stay long enough for Customs to make this decision,\" the company said. One day later, a US appeals court granted Apple's request for a temporary stay of the ban. The company then resumed selling the Watch Series 9 and Watch Ultra 2 until Jan. 18 at 5pm ET. Since then, Apple has been able to skirt the ban after it submitted modified versions of the watches without the contested pulse oximetry technology to US Customs and Border Protection (CBP). The agency decided those variants fall outside the scope of the ITC's ruling. If you bought an Apple Watch Series 9 or Watch Ultra 2 before the ban, you can continue to use the blood oxygen monitoring features found on your wearable. In a statement Apple shared with 9to5Mac, the company said that the ongoing dispute would have \"no impact to Apple Watch units previously purchased that include the Blood Oxygen feature.\" If you bought your Series 9 or Watch Ultra 2 before Jan. 17, 2024, you will want to do your best to avoid damaging it -- Apple Watch units replaced through the warranty service might not include blood oxygen monitoring. On new units, the blood monitoring app still comes pre-installed, but launching the software displays a message that states that Sp02 tracking is no longer available. The notification directs users to the iPhone Health app to learn more, with a link to a support page on Apple's website. If you bought your Series 9 or Watch Ultra 2 before Jan. 17, 2024, you will want to do your best to avoid damaging it. In one of his recent Power On newsletters, Bloomberg's Mark Gurman wrote that Apple told AppleCare reps Apple Watch units replaced through the warranty service might not include blood oxygen monitoring. In a statement the company shared with The Verge, Apple said it was \"pursuing a range of legal and technical options to ensure that Apple Watch is available to customers.\" On Dec. 18, Bloomberg reported the company was \"racing to make changes to algorithms on the device that measure a user's blood oxygen level,\" believing it could avoid a \"complicated hardware overhaul.\" Before the CBP ruled Apple could resume selling modified versions of the Watch Series 9 and Watch Ultra 2, there were doubts a simple software update would be enough to bypass the ban. If Apple can't find a long-term solution to the dispute, it will limit the company’s ability to offer certain wellness and sleep-tracking features in the future. Apple could license the infringed patents, but the company does not appear interested in striking a deal, with Kiani recently telling The New York Times Apple \"had not engaged in licensing negotiations.\" Asked about the ban during a recent CNBC interview, Apple CEO Tim Cook said the company was \"focused on appeal\" and that customers have \"lots of reasons to buy the watch even without the blood oxygen sensor.\" Like the legal case that started all of this, Apple's appeal could take more than a year. Either way, a speedy resolution is not likely. Keep reading Pocket-lint for more on the Apple Watch ban updates and analysis.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. After double majoring in unemployment (English and Art History), Igor's career prospects were, to say the least, limited. It was either become a teacher or a writer. Thankfully, he chose the latter. Following a brief stint as a music journalist, he wisely followed the advice of one of his editors and began reporting on Toronto's startup community in 2012.\nThat opportunity eventually lead him to MobileSyrup, one of Canada's leading technology publications. In 2019, he joined Engadget and spent the next for years working with the site's news team. He now leads Pocket-lint's Lifestyle section. AirPods Max's design, case, and compatibility makes them my top headphones, but I do wish they had these two Bose 700 features. Capture your best ideas in a notebook that never runs out of pages with these great note-taking tablets. If you're bored of the norm, and want a change from the usual Samsungs and Apples of the world, the Honor Magic 6 Pro is certainly worth considering. Want to take great photos while leaving the tripod and filters at home? The OM-1 Mark II hides impressive capabilities. If your voice is too quiet when using the mic on your AirPods, you should be able to fix it. The Apple Watch Series 10 could feature a redesigned body and new health tracking features when it arrives later this year. "
}