{
    "title": "Should Apple investors worry about a Justice Department antitrust lawsuit?",
    "date": "1/22/2024",
    "url": "https://www.marketwatch.com/story/should-apple-investors-worry-about-a-justice-department-antitrust-lawsuit-a9a8cc98",
    "text": "As the Justice Department marches inexorably toward an antitrust lawsuit against Apple Inc. that could come as soon as March, some investors are bracing for collateral damage to the company’s fortunes. Most, however, aren’t sweating this. They have deeper concerns. Since a report Wednesday that confirmed months of rumors about an imminent lawsuit over how software and hardware limitations on iPhones and iPads hinder competitive services, analysts, investors and legal experts have engaged in a Silicon Valley parlor game of what the impact on Apple \n        AAPL,\n        -0.46%\n       could be. In assessing both short- and long-term risks, viewpoints differ wildly — from outright fear to indifferent shrugs. “Apple should be worried. My understanding is that [the impending lawsuit] relates to software including Apple iMessage and alleged monopolies over their software as a service,” Chris Mattmann, an expert in artificial intelligence and adjunct research professor at the University of Southern California, said in an interview. “Antitrust against Apple in the past has focused on hardware limitations that Apple imposes on vendors and also their specific lock-ins, including developing their own new AI/M2 chips.” Mattmann expects a potential hit to Apple’s stock price, especially over government scrutiny of iMessage as part of a Justice Department suit. “There have been some issues with [iMessage],” he said, and with how Apple customers who use apps from developer Beeper are unable to use iMessage on their Macs. But Mattmann could be in the minority. Analysts and investors, well-versed in government crackdowns against Apple and the rest of Big Tech over the past few years, are focused on the general economic picture and Apple’s performance in particular. “A lot of these issues have been around a long time, as evident by the Epic Games lawsuit, actions in the EU and rumors of a Justice investigation. This is not particularly news to Wall Street,” Yuri Khodjamirian, chief investment officer at Tema ETFs, said in an interview. He argued that the bigger immediate issue for investors is Apple’s less-than-scintillating results in the past few quarters, along with projections of 3% growth this year. Khodjamirian isn’t worried, though: He anticipates a healthy bump in iPhone sales, based on his estimates for the replacement cycle of the existing installed base of 2 billion Apple hardware devices worldwide. Apple does not break out iPhone numbers. Two analysts downgraded Apple shares earlier this month, but at least one believes the company’s stock could soar nearly 25%: BofA analyst Wamsi Mohan is betting on long-term optimism about iPhone sales, foreign-exchange trends and strength in pockets throughout the world. Read more: Apple’s stock could soar nearly 25%, BofA says, going against tide of skepticism Speculation about Apple’s near future comes against the backdrop of the U.S. Supreme Court’s decision on Jan. 16 not to hear appeals of an antitrust ruling on Epic Games Inc.’s lawsuit over App Store policies, along with a torrent of other legal scrums involving Apple. Apple won on nine of 10 counts in a federal court case in 2021, but Judge Yvonne Gonzalez Rogers ruled Apple violated California’s unfair-competition law in limiting developers’ ability to communicate with users outside the app or to use alternative payment systems. Last year, the Ninth U.S. Circuit Court of Appeals upheld her overall decision, prompting both Apple and Epic to appeal to the Supreme Court. Read more: Appeals of Apple-Epic antitrust ruling are denied The legal machinations prompted Apple to issue new policies that require developers to pay it a 27% commission if they use an alternative payment method — much like the company did in South Korea and the Netherlands following similar legal rulings in those countries. Epic Chief Executive Tim Sweeney said on X, formerly Twitter, that his company will contest Apple’s new policies in the U.S. District Court for the Northern District of California. Sweeney described the tech giant’s approach to complying with the judge’s ruling to allow developers to  steer customers to payment options within their own apps as an act of “bad faith.” “Once again, Apple has demonstrated that they will stop at nothing to protect the profits they exact on the backs of developers and consumers under their App Store monopoly,” Spotify Technology \n        SPOT,\n        +5.15%\n       said in a statement. Spotify filed an antitrust complaint against Apple in Europe in 2019. Other companies, such as Beeper and Life360’s Tile, which makes a competitor to [Apple’s tracking device] AirTag, have made similar complaints. The Justice case may be an attempt to finish off what Epic started in its lawsuit, say legal experts. “It sounds like it may be an effort to bat in some runs that Epic left on base when it lost its antitrust claims over Apple’s app store/walled garden model,” antitrust attorney Paul Swanson said in an email message. Worldwide, legal headaches are piling up for Apple Chief Executive Tim Cook and the company’s army of attorneys. The company was recently listed among six that are considered “gatekeepers” by Europe’s Digital Markets Act, a law that sets strict requirements to reduce anticompetitive behavior and that goes into effect March 7. Besides Apple, those companies are Alphabet Inc. \n        GOOGL,\n        +0.31%\nGOOG,\n        +0.28%,\n       Amazon.com Inc. \n        AMZN,\n        +0.14%,\n       TikTok parent ByteDance, Meta Platforms Inc. \n        META,\n        +1.36%\n       and Microsoft Corp. \n        MSFT,\n        +0.43%. If companies do not comply with the rules laid down by the DMA, they can be fined up to 10% of global annual turnover, and up to 20% for repeated violations. The EC could also force gatekeepers to sell a business or parts of it, as well as ban them from acquiring services. On Friday, the European Commission said Apple will let third-party mobile-wallet and payment providers access the company’s near-field communication, or NFC, capabilities in concessions following an antitrust investigation. Meanwhile, a U.S. ban on the sale of Apple Watch Series 9 models equipped with blood-oxygen sensors continues to bedevil the company in its patent dispute with Masimo Corp. \n        MASI,\n        -1.20%. Read more: Apple Watch ban put back in place by federal appeals court amid patent fight The Justice Department’s case against Apple is expected to start as the department awaits a federal court’s decision on its antitrust lawsuit against Google and that company’s search business. The latter case was the government’s first major monopoly case to make it to trial in decades. In 1998, the Justice Department successfully sued Microsoft. That trial, strikingly similar to the current Google case, centered on claims that Microsoft illegally grouped its products in a way that stifled competition and compelled people to use its products. In an era when Apple has bundled its hardware and software into easy-to-use products for billions of customers, it will be difficult for the government to beat the company in court, Khodjamirian argues. “Apple’s approach has created value initially with better security and ease of use for consumers,” he said. “That presents a harder case for antitrust lawyers and the traditional definition of anticompetitive behavior.” Trump Media, which operates Donald Trump’s social-media platform Truth Social, will begin trading Tuesday, while Krispy Kreme surges on an announcement that McDonald’s will sell its doughnuts. Jon Swartz is a senior reporter for MarketWatch in San Francisco, covering many of the biggest players in tech, including Netflix, Facebook and Google. Jon has covered technology for more than 20 years, and previously worked for Barron's and USA Today. Follow him on Twitter @jswartz. Visit a quote page and your recently viewed tickers will be displayed here. "
}