{
    "title": "Microsoft & Apple in Tug-Of-War: ETFs in Focus",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/microsoft-apple-tug-war-etfs-160500211.html",
    "text": "The competition between Apple AAPL and Microsoft MSFT for the title of the world's most valuable company has become severe once again. This is especially true as Apple’s market value has decreased to $2.87 trillion while Microsoft is trading at nearly $2.84 trillion.    The competition is not new as Microsoft has occasionally surpassed Apple in market value since 2018, most recently in 2021.The tug-of-war between the two tech giants has put focus on tech ETFs having the largest exposure to these companies. These are Technology Select Sector SPDR Fund XLK, Vanguard Information Technology ETF VGT, iShares U.S. Technology ETF IYW and MSCI Information Technology Index ETF FTEC.These ETFs have Apple and Microsoft as the top two holdings. All these funds have a Zacks ETF Rank #1 (Strong Buy).AppleAfter rising 48% in the previous year, the iPhone maker has been struggling in 2024, with shares plunging 4% on concerns about iPhone sales, particularly in China. Two analysts — Piper Sandler and Barclays — downgraded the stock rating on worries about iPhone demand. iPhone sales in China dropped 30% in the first week of 2024 due to growing competitive pressure from Huawei and other domestic rivals.Adding to Apple's challenges is the tepid forecast for its new product, the Vision Pro mixed-reality headset, which is set to be launched in the United States on Feb 2. Analysts predict that its impact on Apple's earnings per share will be minimal.Further, the tech giant had offered a cautious outlook for the holiday quarter. Apple CFO Luca Maestri indicated that revenues in the quarter are expected to be \"similar\" to last year, with revenues for Mac, iPad and Wearables categories expected to \"decelerate significantly\" from the fourth quarter.MicrosoftMicrosoft rose 2% in 2024 after a 57% surge in 2023, given its strength in the cloud business and artificial intelligence drive. The world’s largest software maker is optimistic about the long-term prospects of its Azure business, as it expects revenues in this segment to continue to accelerate (read: ETFs to Tap Microsoft's Longest Win Streak Since 2021).Azure has become Microsoft’s key growth engine in recent years and has helped revive the company’s brand among developers, according to CNBC.ValuationBoth tech companies look relatively expensive in terms of price-to-earnings ratios. Apple is trading at a P/E ratio of 28.21 versus the industry average of 20.56, while Microsoft’s forward P/E is 33.73 versus the industry average of 31.88.With regard to average brokerage recommendation (ABR) on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated on the actual recommendations (Buy, Hold, Sell etc.), Apple currently has an ABR of 1.80 made by 28 brokerage firms, with Strong Buy and Buy accounting for 57.14% and 10.71% of all recommendations, respectively.On the other hand, Microsoft has an ABR of 1.24 made by 28 brokerage firms, with Strong Buy and Buy accounting for 84.21% and 7.89% of all recommendations, respectively.Earnings Estimate RevisionsApple saw no earnings estimate revision over the past month for the fiscal year (ending Sep 2024), with an estimated earnings growth of 7.01%. This compares favorably with the industry’s growth projection of 6.04%. The stock currently has a Zacks Rank #3 (Hold) and falls under a bottom-ranked Zacks industry (bottom 20%).Microsoft saw a positive earnings estimate revision of a penny over the past month for the fiscal year (ending June 2024), with an estimated earnings growth of 13.6%. This compares favorably with the industry’s growth projection of 13.3%. MSFT has a Zacks Rank #3 and a Growth Score of A. The stock falls under a bottom-ranked Zacks industry (bottom 38%). Select Sector SPDR Technology ETF (XLK)This most popular technology ETF follows the Technology Select Sector Index and has $56.2 billion in AUM. This fund trades in a heavy volume of 7 million shares and charges 120 bps in fees per year. In total, the fund holds about 64 securities in its basket, with Microsoft and Apple taking the top two spots with 23% and 21.4% of the assets, respectively.Vanguard Information Technology ETF (VGT)This fund manages about $57 billion in its asset base and provides exposure to 315 technology stocks by tracking the MSCI US Investable Market Information Technology 25/50 Index. Here, Apple and Microsoft account for 22.2% and 20.8% share, respectively. The ETF has 0.10% in expense ratio while volume is solid at nearly 471,000 shares (read: 5 Best-Performing Technology ETFs of 2023).iShares U.S. Technology ETF (IYW)This ETF tracks the Russell 1000 Technology RIC 22.5/45 Capped Index, giving investors exposure to 133 technology stocks. Microsoft and Apple account for 17.1% and 16.4% of assets, respectively. The fund has AUM of $13.6 billion while charging 40 bps in fees and expenses. Volume is good as it exchanges nearly 658,000 shares in hand a day.MSCI Information Technology Index ETF (FTEC)This fund is home to 303 technology stocks with AUM of $8 billion. It follows the MSCI USA IMI Information Technology Index. Apple and Microsoft make up for a respective 21.6% and 20.6% share. The ETF has 0.08% in expense ratio while volume is good at 227,000 shares a day. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Technology Select Sector SPDR ETF (XLK): ETF Research Reports Fidelity MSCI Information Technology Index ETF (FTEC): ETF Research Reports iShares U.S. Technology ETF (IYW): ETF Research Reports Vanguard Information Technology ETF (VGT): ETF Research Reports To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}