{
    "title": "Apple Hardware VP DJ Novotney Departing for EV Maker Rivian",
    "date": "1/28/2024",
    "url": "https://www.pymnts.com/apple/2024/apple-hardware-vp-dj-novotney-departing-for-ev-maker-rivian/",
    "text": "A veteran Apple executive who oversaw the company’s electric vehicle efforts is reportedly resigning. DJ Novotney, a vice president of hardware engineering, is leaving Apple after nearly 25 years to take a job with electric vehicle maker Rivian Automotive, Bloomberg News reported Sunday (Jan. 28), citing sources with knowledge of the matter. According to the report, these sources say Novotney was a senior lieutenant to a number of Apple’s key hardware engineering executives and was a major player in developing several generations of the iPod and iPhone, and was chosen by former hardware chief Dan Riccio to help lead development of the iPad. “Great products are what we do best and I have been so very lucky along the way to be part of so many amazing teams that developed everything from iPod, iPhone, iPad, Watch and so many more,” Novotney wrote in a memo to colleagues seen by Bloomberg. “Apple has been my life, but now is the time for me to move on and help bring to life a new set of products.” The news comes days after a separate Bloomberg report that Apple had scaled back and delayed its plans to put out a vehicle. Apple had initially hoped to release a fully autonomous vehicle, but has now apparently lowered its ambitions and is now focusing on an electric vehicle (EV) with more limited features, including more basic driver-assistance features. These changes are happening amid consumer unease about EVs, something PYMNTS’ Karen Webster examined last month. She wrote that this hesitancy is “made more real when considering that there are only 160,000 charging stations in the U.S. right now — and even fewer supercharging stations that provide a top up in 30 minutes.” Most take three to four hours to generate a full charge. And while the White House has said it plans to pay to develop 500,000 stations, that number is still short of the 700,000 that would be needed in a scenario in which 40% of vehicles in the U.S. were electric. “The problem facing the EV ecosystem today is there were not enough early adopters to create sufficient demand for suppliers of charging stations, so the U.S. lacks the density of fast charging stations that later adopters of EVs would require to give up gas,” Webster wrote. “And investors in EVs may have underestimated the importance of that and overestimated the willingness of consumers to overlook battery anxiety based on the enthusiasm of those early adopters.”  We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}