{
    "title": "Supreme Court rebuffs Apple's appeal on app payments, threatening billions \nin revenue",
    "date": "1/16/2024",
    "url": "https://apnews.com/article/supreme-court-apple-epic-fortnite-antitrust-iphone-c412553d88f8798acd7d5e1cbb5826bc",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. FILE - In this Sept. 28, 2021 file photo, people try out iPhone products at an Apple Store in Beijing. The Supreme Court on Tuesday, Jan. 16, 2024 allowed a court order to take effect that could loosen Apple’s grip on its lucrative iPhone app store, potentially siphoning billions of dollars away from one of the world’s most profitable companies. (AP Photo/Andy Wong, file) The U.S Supreme Court is bathed in afternoon sun Thursday, Jan. 11, 2024, in Washington. (AP Photo/Mariam Zuhaib)     WASHINGTON (AP) — The Supreme Court on Tuesday allowed a court order to take effect that could loosen Apple’s grip on its lucrative iPhone app store, threatening to siphon billions of dollars away from one of the world’s most profitable companies., The justices rejected Apple’s appeal of lower-court rulings that found some of Apple’s app store rules for apps purchased on more than 1 billion iPhones constitute unfair competition under California law. Apple outlined in court documents filed late Tuesday how it plans to change in-app payments, while indicating it will preserve most of the fees it collects from developers who make money from their services provided on iPhones and iPads. The proposal provoked claims that Apple is acting in bad faith and set the stage for more legal sparring. The rejected appeal to the Supreme Court stemmed from an antitrust lawsuit filed in 2020 by Epic Games, maker of the popular Fortnite video game. Epic lost its broader claim that Cupertino, California-based Apple was violating federal antitrust law, and the justices also rejected Epic’s appeal Tuesday. But in turning away Apple’s effort to maintain exclusive control over in-app payments, the court lifted a hold on an order to allow app developers throughout the U.S. to insert links to other payment options besides its own within iPhone apps. That change would make it easier for developers to avoid paying Apple’s commissions ranging from 15% to 30%. In its Tuesday court filing, Apple said it will now allow app developers to provide payment links to external websites but would still seek to collect commissions ranging from 12% to 27% from them to prevent “free-riding” on the software system that powers its iPhones and iPads.  Apple also plans to impose a potentially cumbersome approval process before the external links or buttons can be placed within iPhone and iPad apps in an effort “to minimize fraud, scams, and confusion.” The protections also will include a so-called “scare screen” warning to consumers who click on a link for an alternate payment system saying that Apple is “not responsible for the privacy or security of purchases made on the web.” In a series of social media posts, Epic CEO Tim Sweeney attacked Apple’s plan with as “bad-faith compliance” and maintained the revised commissions remain anti-competitive. He vowed to oppose Apple’s proposal in federal court. Apple has strong incentive to maintain as much of its commissions on in-app transaction as possible. Those fees have turned into a significant part of Apple’s service’s division, which generated $85 billion in revenue during the company’s last fiscal year ending in September. The specter of consumers being able to defect to other payment channels for in-app transactions is one of several factors that has been weighing on Apple’s stock, which has declined 5% so far this year. The drop has enabled Apple’s long-time rival, Microsoft, to eclipse it as the world’s most valuable company. Apple’s shares dipped 1% Tuesday leaving the company with a market value of slightly more than $2.8 trillion. Microsoft, whose stock has edged up 4% so far this year, is valued at $2.9 trillion. Besides the possibility of the Supreme Court refusing to consider the payment issue in the Epic case, investors also have been fretting about new European regulations scheduled to take effect in March that also could force Apple to allow alternate payment methods inside iPhone apps. Epic, based in Cary, North Carolina, had claimed that Apple’s app store — which was launched in 2008, a year after the first iPhone went on sale — had turned into an illegal monopoly that stifles innovation and competition while generating billions of dollars in profit for Apple. Although a federal judge rejected the assertion that Apple had a monopoly on mobile apps, she concluded consumers should have more discretion in how to pay inside apps. Back in August 2020, Epic tried to offer an alternative way to get its mobile app, attempting to evade Apple’s commissions charged when digital goods were purchased by players on Fortnite and other games. Apple ousted Epic from its app store after it tried to get around Apple’s restrictions. Although it lost most of its claims in the Apple case, Epic last month won a jury trial against Google and its Play Store for apps on Android phones in a lawsuit mirroring its action against Apple. A federal judge still must determine what changes Google will have to make to its Play Store. Liedtke reported from San Ramon, California. Copyright 2024 The Associated Press. All Rights Reserved. "
}