{
    "title": null,
    "date": "1/23/2024",
    "url": "https://www.statista.com/statistics/216459/global-market-share-of-apple-iphone/",
    "text": "Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 100m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: Industry-specific and extensively researched technical data (partially from exclusive partnerships). A paid subscription is required for full access. Additional Information Show sources information\n                            \n                                Show publisher information\n                            \n                                Use Ask Statista Research Service January 2024 Worldwide 2007 to 2023 The figures up to and including the fourth quarter of 2008 were collected by Gartner. The values from the first quarter of 2009 are taken from publications by IDC. Consumer Electronics Global unit shipments of portable media players 2014 Telecommunications Global smartphone shipments by vendor 2009-2023 Telecommunications Global smartphone sales to end users 2007-2023 Consumer Electronics Apple's revenue share by operating segment 2012-2024, by quarter To download this statistic in XLS format you need a Statista Account To download this statistic in PNG format you need a Statista Account To download this statistic in PDF format you need a Statista Account To download this statistic in PPT format you need a Statista Account As a Premium user you get access to the detailed source references and background information about this statistic. As a Premium user you get access to background information and details about the release of this statistic. As soon as this statistic is updated, you will immediately be notified via e-mail. … to incorporate the statistic into your presentation at any time. You need at least a Starter Account to use this feature. You only have access to basic statistics.\n                                    \n                                    This statistic is not included in your account. Business Solutions including all features.  Overview Apple financials Trend: Smartphones Further related statistics "
}