{
    "title": "The Company Taking on Apple’s Watch Technology",
    "date": "1/24/2024",
    "url": "https://gimletmedia.com/shows/the-journal/6nh3vl5x",
    "text": "January 24, 2024 If you own an Apple Watch, you may have noticed the device’s pulse oximeter feature. Masimo, a medical technology company, claims that the oximeter technology is theirs and it is suing Apple. Masimo CEO Joe Kiani and WSJ’s Aaron Tilley on the story of how Masimo decided to take on a tech giant.  Further Listening: -One Company’s Quest to Burst Apple’s Blue Bubble Texts  Further Reading: -The Entrepreneur Who Bet His Company on a Fight With Apple -Apple to Remove Blood-Oxygen Sensor From Watch to Avoid U.S. Ban  Learn more about your ad choices. Visit megaphone.fm/adchoices March 26, 2024 Sam's Life in a Brooklyn Jail from \"The Trial of Crypto's Golden Boy\" The Journal We’re back for Sam Bankman-Fried’s sentencing. After the crypto golden boy was found guilty on all counts in November, this week he’ll find out how long he will serve in federal prison. Caitlin Ostroff and Rachel Humphreys get an insight into Bankman-Fried’s life for the past few months, from unappetizing prison food to tutoring inmates. March 25, 2024 Why the U.S. Government Is Suing Apple The Journal The Department of Justice announced a landmark lawsuit against Apple, alleging that it has built a monopoly in smartphones by thwarting innovative apps and accessories that would make users less dependent on Apple’s technology. WSJ’s Tim Higgins breaks down the lawsuit and what it could mean for the company and its CEO Tim Cook. March 22, 2024 Trump Needs $450 Million He Doesn’t Have The Journal Donald Trump’s finances are under stress. He faces a $454 million judgment against him in a civil-fraud case. Meanwhile, his campaign fundraising is trailing President Biden’s. WSJ’s Peter Grant unpacks the developments and a potential windfall for Trump. More from The Journal We've updated our Terms of Service.  Learn More This website uses cookies to ensure you get the best experience on our website.  Learn More "
}