{
    "title": "Apple’s Top Hardware Engineering Architect Is Leaving The Company For \nRivian Automotive After More Than Two And A Half Decades",
    "date": "1/29/2024",
    "url": "https://wccftech.com/apple-top-executive-leaving-for-rivian-after-25-years/",
    "text": "Another key Apple executive has departed the firm after a massive tenure, believing to find greener pastures at Rivian Automotive, according to the latest report. The hardware engineering architect was DJ Novotney, who worked at the Cupertino firm for 25 years and had a pivotal role in creating and designing iconic products. Based on the latest report, Novotney likely parted ways with Apple amicably. Though several Apple executives have left the company after brief tenures, it is surprising that Novotney would leave his post after dedicating a major portion of his life to one company. During his 25 years at Apple, Bloomberg reports Novotney worked on several products that have garnered positive reviews worldwide, such as the iPod and iPhone for multiple generations. The ex-Apple employee was also responsible for leading the development of the iPad and helped bring the first-generation Apple Watch to the market. Additionally, Apple’s secret car endeavor, dubbed ‘Project Titan’ had Novotney stationed on it, so it is no surprise that Rivian recently recruited him, as his expertise would prove valuable to the organization. It is possible that with Apple stalling the development of its autonomous electric car, Novotney believed that he could add value elsewhere, but nothing has been confirmed if this was the reason for his departure. At Rivian, Novotney will become Senior Vice President of vehicle programs. As for his exit from Apple, the former executive informed his colleagues on Friday, stating that he was very lucky to be a part of the teams at Apple. “Great products are what we do best and I have been so very lucky along the way to be part of so many amazing teams that developed everything from iPod, iPhone, iPad, Watch and so many more. Apple has been my life, but now is the time for me to move on and help bring to life a new set of products.” Novotney is one of the few Apple executives who have remained at the company for an incredibly long time. Former Chief Designer Jony Ive had maintained nearly the same tenure, but after his departure, he went ahead and opened his own firm called LoveFrom. News Source: Bloomberg Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}