{
    "title": "Move over Apple: Microsoft is now the most valuable publicly traded company",
    "date": "1/12/2024",
    "url": "https://www.cnn.com/2024/01/12/business/apple-microsoft-most-valuable-publicly-traded-company/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Follow: Microsoft is back on top. After trailing behind Apple for the majority of the past decade, Microsoft is the world’s most valuable publicly traded company as of market close on Friday. The tech giant’s stock (MSFT) closed at $388.47 a share on Friday, giving it a market capitalization of $2.89 trillion. Apple’s stock (AAPL) closed at $185.92 a share, for a market capitalization of $2.87 trillion. Market capitalization — or market cap — is the total value of all the shares of a publicly traded company. In other words, it’s the market value of the company. Microsoft’s rise to the top comes after the company had a stellar year thanks to its success with generative artificial intelligence. In 2023, the company’s CEO, Satya Nadella, made a multi-billion dollar investment in AI, including commercializing and adding AI tools like ChatGPT into its suite of products before rivals. He even strengthened Microsoft’s ties to ChatGPT maker OpenAI, a major pioneer in the field of artificial intelligence, during a board and leadership upheaval at the smaller company late last year. Apple, meanwhile, is facing a barrage of problems. iPhone sales are slowing in part because of the Chinese government’s reported efforts to restrict purchases (Beijing denies it has put any restrictions in place). That’s helped Chinese smartphone maker Huawei to gain market share. Apple also recently contended with a brief ban from selling the latest Apple Watch models in the United States. Microsoft declined to comment, while Apple did not return CNN’s request for a comment. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}