{
    "title": "Zacks Industry Outlook Highlights Apple, HP and 3D Systems",
    "date": "2/26/2024",
    "url": "https://finance.yahoo.com/news/zacks-industry-outlook-highlights-apple-141900015.html",
    "text": "Chicago, IL – February 26, 2024 – Today, Zacks Equity Research discusses Apple AAPL, HP HPQ and 3D Systems DDD. Link: https://www.zacks.com/commentary/2231033/3-stocks-to-watch-from-the-prospering-computer-industry The Zacks Computer - Mini Computers industry is benefiting from steady demand for enterprise devices, including laptops, tablets and smartphones. Industry participants like Apple, HP and 3D Systems are benefiting from these trends. The improving availability of 5G-enabled smartphones has been a key catalyst for the industry participants. The launch of foldable and AI and ML-infused smartphones, tablets, wearables and hearables is another major growth driver for the industry participants. Robust demand for production printers, materials and software bodes well for 3-D printing solution providers. However, waning demand for consumer PCs and geopolitical challenges, including raging inflation and high interest, are major headwinds. The Zacks Computer – Mini Computers industry comprises companies that offer smartphones, desktops, laptops, printers, wearables and 3-D printers. Such devices are based either on iOS, MacOS, iPadOS, WatchOS, Microsoft Windows, or Google Chrome and Android operating systems. The companies predominantly use processors from Apple, Intel, AMD, Qualcomm, NVIDIA and Samsung. Expanding screen size, better display and enhanced storage capabilities have been the key catalysts driving the rapid proliferation of smartphones. This has been well-supported by faster mobile processors. Laptops, both consumer and commercial, benefit from faster processors, sleek designs and expanded storage facilities. The addition of healthcare features has been driving the demand for wearables. Enterprise Adoption Remains Healthy: Strong enterprise demand has been benefiting the industry participants. The growing adoption of a hybrid working environment bodes well for the players, as demand for laptops and tablets is expected to increase. Demand for smart devices that offer facial recognition, retina scans or finger impressions to verify the user for biometrics is gaining traction as enterprises enhance security. Impressive Form Factor Drives Demand: Expanding screen size, better display and enhanced storage capabilities have been the key catalysts driving the rapid proliferation of smartphones and tablets. This has been well-supported by faster mobile processors from the likes of Qualcomm, NVIDIA, Apple and Samsung. Improved Internet penetration and speed, along with the evolution of mobile apps, have made smartphones indispensable for consumers. Improved graphics quality is making smartphones suitable for playing sophisticated games. This is driving the demand for high-end smartphones and opening up significant opportunities for device makers. PCs Face Extinction Risk: Personal computers (desktops and laptops), be it Windows or Apple's MacOS-based ones, have been facing the risk of extinction due to the rapid proliferation of smartphones and tablets. Stiff competition from smartphones has compelled global PC makers to not only upgrade hardware frequently but also add apps and cloud-based services to attract consumers. Nevertheless, the emergence of 5G, AI, machine learning and foldable computers is likely to be the key catalysts in expanding the total addressable market of PCs. The Zacks Computer – Mini Computers industry is housed within the broader Zacks Computer and Technology sector. It carries a Zacks Industry Rank #104, which places it in the top 41% of more than 250 Zacks industries. The group's Zacks Industry Rank, which is the average of the Zacks Rank of all the member stocks, indicates bright near-term prospects. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than two to one. The industry's position in the top 50% of the Zacks-ranked industries is a result of a positive earnings outlook for the constituent companies in aggregate. Looking at the aggregate earnings estimate revisions, it appears that analysts are optimistic about this group's earnings growth potential. Since Oct 31, 2023, the Zacks Consensus Estimate for this industry's 2024 earnings has moved up 0.5%. Given the bullish outlook, there are a few stocks worth watching in the sector. But before we present those stocks that you may want to consider for your portfolio, let's take a look at the industry's recent stock-market performance and valuation picture. The Zacks Computer – Mini Computers industry has underperformed the broader Zacks Computer and Technology sector as well as the S&P 500 index over the past year. The industry has gained 22.8% over this period compared with the S&P 500's return of 27% and the broader sector's rise of 50.9%. On the basis of forward 12-month P/E, which is a commonly used multiple for valuing computer stocks, we see that the industry is currently trading at 26.61X compared with the S&P 500's 21.02X and the sector's 26.72X. Over the last five years, the industry has traded as high as 32.32X and as low as 13.92X, with the median being 24.64X. Apple: This Zacks Rank #3 (Hold) company is benefiting from a steady demand for iPhone devices, as well as an expanding footprint in emerging markets. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here. A growing subscriber base and improving customer engagement are tailwinds for the services business. Apple currently has more than 1 billion paid subscribers across its Services portfolio. The App Store continues to draw the attention of prominent developers worldwide, helping it offer appealing new apps that drive the App Store's traffic. A growing number of AI-infused apps will attract subscribers to the App Store. The Zacks Consensus Estimate for fiscal 2024 earnings has decreased by 0.6% to $6.56 per share over the past 30 days. The stock has declined 4.2% in the year-to-date period. HP: This Zacks Rank #3 company's sustained focus on launching the latest and innovative products is likely to help it stay afloat in the current uncertain macroeconomic environment. Product innovation and differentiations are the key drivers that have helped HPQ maintain its leading position in the PC and printer markets. The Zacks Consensus Estimate for fiscal 2024 earnings has been steady at $3.45 per share over the past 30 days. HP shares have declined 3.8% year to date. 3D Systems: This Zacks Rank #3 company expects the dental market to stabilize amid the high inventory level in the supply chain and weakness in consumer discretionary spending. 3D System expects a slower recovery in 2024 than its earlier expectation. Dental sales are expected to benefit from the continuing migration of orthodontic solutions from metal brackets and wires to clear aligners in the long run. Improved asset management and resource utilization are anticipated to reduce its total inventory significantly in 2024. The Zacks Consensus Estimate for 2024 earnings has increased by a penny to 8 cents per share over the past 30 days. The stock has declined 21.9% in the year-to-date period. Why Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Join us on Facebook: https://www.facebook.com/ZacksInvestmentResearch/ Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates. Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report HP Inc. (HPQ) : Free Stock Analysis Report 3D Systems Corporation (DDD) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}