{
    "title": null,
    "date": "2/20/2024",
    "url": "https://indianexpress.com/article/technology/tech-news-technology/top-tech-companies-by-market-cap-9170956/",
    "text": "The tech world is dominated by a handful of behemoth companies worth trillions of dollars. These giants have their fingers in all sorts of tech – smartphones, software, cloud services, social media, you name it. Let’s take a look at the current top dogs based on market capitalisation (alongside glorious photos of their headquarters). Kicking off our list is Microsoft. Bill Gates and Paul Allen founded this software giant in 1975, and it’s been shaping the tech landscape ever since. With a staggering 2,21,000 employees, Microsoft eclipses even Apple’s workforce. What started with the ‘Altair BASIC’ – the company’s first product – has expanded into the Windows operating system which powers more than 1.4 billion monthly active devices worldwide now. The company has also expanded into consumer electronics, cloud services, game studios and more. Plus, Microsoft Office keeps the work lives running of millions – Excel spreadsheets, PowerPoint decks, Teams meetings, the company has it all covered. With such a vast catalogue of products 2023’s revenue of $211 billion doesn’t come as a surprise. Apple slides in at number two, the reigning king of consumer tech. Apple churned out $119.6 billion in revenue last quarter alone, fueled by demand for its iconic hardware like iPhones, iPads, Macs and accessories like AirPods and Apple Watches. Founded by Steve Jobs, Steve Wozniak and Ronald Wayne way back in 1976, Apple has grown into an absolute juggernaut. For instance, over two million jobs across all 50 states in the US are attributable to Apple’s presence. The company is credited with driving much of the hardware trends in consumer tech. And as long as they keep pumping out innovative new gadgets and services like the Vision Pro mixed reality headset, the company is poised to remain firmly atop the tech throne. You may not be too familiar with Nvidia, but this semiconductor company has skyrocketed in value thanks to the AI boom. Originally bursting onto the scene in 1993 as the brainchild of three chip engineers, Nvidia initially focused on enhanced computer graphics and visuals. By the early 2000s, they had scored a major contract to produce chips for Microsoft’s Xbox console. But Nvidia’s real claim to fame arrived years later as a pioneer of powerful GPUs (graphics processing units) that turned out to be perfect for running cutting-edge AI algorithms and neural networks. Today, Nvidia’s high-performance chips are absolutely essential for applications like supercomputers, data centers, and AI model training. Amazon has brought something of an online shopping revolution and have resultantly put thousands of malls out of business around the globe, especially during the pandemic. Founded by Jeff Bezos in 1994, this e-commerce juggernaut brought in over $500 billion in revenue last year by essentially being a hyper-efficient product delivery service. But Amazon is so much more than an online store. There’s the Prime membership program with videos and music, the market-leading AWS cloud computing division, Alexa voice assistants, Twitch game streaming, and numerous other consumer tech verticals. The tech giant formerly known as Google rebranded to Alphabet Inc. in 2015 as a parent company overseeing all Google businesses. Alphabet is involved in everything from Android mobile operating systems to YouTube videos to self-driving car initiatives. With a global brand as strong as Google’s, it’s no surprise Alphabet rakes in ridiculous advertising revenue as we feverishly search and browse online. Expect this titan to remain a fixture among the tech elite. Formerly known as Facebook Inc., social media titan Meta Platforms oversees Facebook, Instagram, WhatsApp and other apps and services. Mark Zuckerberg founded the addictive original Facebook product in his Harvard dorm room in 2004 as a way for students to connect. The platform exploded in popularity quickly, boasting a whopping 400 million monthly users just six years later. Meta recently pivoted to focus heavily on the “metaverse” (hence the rebrand from Facebook) but its bread and butter remains selling ads on its suite of social platforms with billions of users. While you may not recognise the name, Taiwan Semiconductor Manufacturing Company (TSMC) is an absolute juggernaut in the chip world. This pure semiconductor foundry produces a staggering 90% of the world’s most advanced microchips found in smartphones, laptops, medical devices and even missile systems. By keeping its entire focus on manufacturing chips to dizzying degrees of precision, TSMC has pulled ahead of more diversified rivals like Samsung and Intel. Pretty much every major tech company is lining up to place orders with TSMC’s cutting-edge fabrication plants. Founded in 2003 by American entrepreneurs Martin Eberhard and Marc Tarpenning (and named after visionary inventor Nikola Tesla), this company singlehandedly made EVs cool. Musk joined as an investor in 2004 and took over as CEO in 2008, the same year Tesla’s first car (the Roadster) shipped. From there, it was a rocket rise as models like the Model S, 3, X and Y took the automotive world by storm with their eye-popping acceleration and coveted tech integration. While 2023 was a dream for Tesla’s rocketing stock price, 2024 has brought the company back to earth somewhat. Production costs are rising, competition is increasing, and some major customers are rethinking their EV investments. Next up is semiconductor and software provider Broadcom Inc. With 20,000 employees, it’s significantly smaller than the other mega-caps on this list. But Broadcom punches way above its weight by innovating in both hardware and software domains. Over its 60+ year history, Broadcom firsts include the first LED dot matrix display, cable modems enabling home internet, fiber optic solutions for IBM mainframes, digital vehicle technology and the first 5G radio switch. The company now designs, develops, and supplies a wide range of semiconductor, enterprise software, and security solutions. Hailing from South Korea, Samsung Group is best known for its consumer electronics like TVs, phones and wearables. But this conglomerate has arms reaching into all sorts of software, enterprise and smart home tech realms too. Founded back in 1969, Samsung’s 320,000 employees work hard to place its smartphones, tablets and home appliances into households worldwide. While often playing second fiddle to Apple in mobile, Samsung remains an innovative force pushing boundaries in hardware design and functionality.  Zohaib is a tech enthusiast and a journalist who covers the latest trends and innovations at The Indian Express's Tech Desk. A graduate in Computer Applications, he firmly believes that technology exists to serve us and not the other way around. He is fascinated by artificial intelligence and all kinds of gizmos, and enjoys writing about how they impact our lives and society. After a day's work, he winds down by putting on the latest sci-fi flick. • Experience: 3 years • Education: Bachelor in Computer Applications • Previous experience: Android Police, Gizmochina • Social: Instagram, Twitter, LinkedIn                        ... Read More The U.S. is monitoring the arrest of Indian opposition leader Arvind Kejriwal and urges a fair legal process. Germany also expressed concern over the arrest, causing India to protest. Delhi CM and AAP leader Arvind Kejriwal was arrested on corruption charges a month before national elections. The U.S. and Germany both emphasize the importance of a fair and impartial trial for Kejriwal.    "
}