{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.dnaindia.com/business/report-big-discount-on-apple-iphone-15-ahead-of-valentine-s-day-available-on-flipkart-at-just-rs-3076840",
    "text": "Sriram Raghavan opens up on mixed response to Katrina Kaif, Vijay Sethupathi-starrer Merry Christmas: 'If I tried to...' This National Awardee used to sing in trains, worked as RJ, gave several flops, one film changed career, now owns... Seeing Is Believing: How Expert Merge Hardware And Software For Better Vision CUET UG 2024 registration deadline extended: Check last date to apply IND vs AUS Test series 2024-25 schedule out: Check dates, venue, first match to be played in… Business In India, the price of the Apple iPhone 15 with 128GB of storage was Rs 79,900. However, the Flipkart Sale is currently offering the Apple iPhone 15 for just Rs 39,949 in advance of Valentine's Day. Ritik Raj Updated : Feb 04, 2024, 01:27 PM IST For those unaware, the Apple iPhone 15 is the most affordable and value-for-money model in Apple's flagship iPhone 15 series. The price of the iPhone 15 has decreased in a number of online sales since it was released. Flipkart has now launched Big Bachat Days, which have lowered the price of iPhones, ahead of Valentine's Day. Among these intriguing choices is the iPhone 15, which was initially offered for Rs 79,900 but is currently only available for Rs 72,999. However, you can purchase the iPhone 15 for just Rs 39,949. Whether you are planning to buy it for yourself or as a Valentine's Day gift, this price reduction represents a significant savings for customers. This is one of the best chances to get an iPhone for less money. The Apple iPhone 15 is available on Flipkart for Rs 72,999, but customers can save Rs 4000 by using their HDFC card to make purchases, bringing the price down to Rs 68,999. Furthermore, Flipkart is allowing you to exchange your old iPhone 14 for up to Rs 33,505 off, which lowers the price of the Apple iPhone 15 to Rs 39,949. The Dynamic Island design of the Apple iPhone 15 features a notchless design, thin bezels, frosted glass on the back, and a slightly bigger camera lens. The USB-C port located at the bottom edge is another significant modification that is easily noticed. The Apple iPhone 15 is the most significant update to the device in recent memory and one of the most sophisticated models to be released. It has a ton of new features and is a huge improvement over last year. Despite this, the Apple iPhone 15 features a new chipset, Dynamic Island, USB-C port, and 48MP camera setup. Controversy: Why So Much Hate Towards Hardik? Fan War Explained | Hardik Pandya Vs Shivam Dube | IPL Virat Kohli Scripts History, Wins 4th ICC Men's ODI Cricketer Of The Year Award | ICC Awards 2023 A Message For Fans | Team India's Losses In Last 10 years | U19 World Cup 2024 | T20 World Cup 2024 IND vs ENG Test Series 2024 Highlights | India Lead Series By 2-1 Against England | IND v ENG Recap "
}