{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.politico.eu/article/hurry-up-and-tax-google-apple-eu-urges-the-world/",
    "text": "Bloc to tell the G20 that the time has come to push through tax overhaul. EU finance ministers will call on G20 countries to finalize global corporate tax reforms that would hit international companies such as U.S. tech giants Google, Amazon and Apple, according to a document obtained by POLITICO. The EU's “Terms of Reference,” drawn up by national treasury officials, will serve as the basis of the bloc's negotiating position at a gathering of ministers and central bank governors of the world's biggest economies at the end of the month in São Paulo, Brazil. The three-page document puts pressure on the U.S. administration to make good on its pledge to implement the reforms. The initiative stands on two “pillars,” which G20 leaders rubberstamped in the fall of 2021. The first pillar introduces a global levy for the world’s 100 biggest companies. The second aims to set an international minimum corporate tax rate of 15 percent — already written into EU law. But progress has been slow across the globe. The idea is particularly controversial in Washington, where Republicans fear the rules unfairly target U.S. digital giants. The Organisation for Economic Cooperation and Development, which brokered the reforms, has had to delay the signing ceremony for the global levy multiple times. The new timeline hopes for more than 140 nations to sign the global treaty, called a Multilateral Convention, in four months. “Finalizing the remaining work needed to implement the two-pillar agreement on the revision of the international tax rules is a top priority,” the EU says in its document. “The G20 should urge … that the Multilateral Convention (MLC) for Pillar 1 is ready for signature by the end of June 2024 at the latest and call for its swift ratification.” “We applaud members of the OECD/G20 Inclusive Framework who have started the implementation of Pillar 2,” the document added. “We call on other countries to follow swiftly.” Eurozone leaders will on Friday discuss the decade-old plan to boost investment and the economy. But it’s going nowhere fast. “War is back” in Europe, Paris says as it floats idea to counter decades of underinvestment. It’s likely to prove highly controversial, particularly in Germany. The relationship between a powerful German MEP and a Dutch businessman blurred the lines between public service and private gain. Frankfurt beat numerous European capitals in race to host coveted anti-money laundering authority. "
}