{
    "title": "Best-selling smartphones in 2023: Apple iPhones lead the chart",
    "date": "2/21/2024",
    "url": "https://bgr.com/tech/apple-iphone-models-were-7-of-the-10-best-selling-smartphones-in-2023/",
    "text": "Sign up for our daily newsletter If you buy through a BGR link, we may earn an affiliate commission, helping support our expert product labs. For the first time, Apple secured seven out of 10 spots in the best-selling smartphones in 2023. From number 1 to number 7, the company’s iPhones secured these spots, followed by entry-level Samsung Galaxy A phones. This chart comes from Counterpoint Research’s Global Monthly Handset Model Sales Tracker, which says the combined market share of the top 10 smartphones in 2023 reached the highest ever at 20%, up from 19% in 2022. With that, Apple’s iPhone 14 was the best-selling smartphone in 2023, with the US and China making up half of its sales. The model contributed 19% of the total iPhone sales for 2023, down from the 2022 bestseller iPhone 13’s 28% share. Minor differences between the iPhone 13 and iPhone 14 led to lower adoption of the base variant and increased sales of the iPhone Pro variants, which offer critical upgrades like Dynamic Island, a more advanced chipset, higher display refresh rate, and camera improvements. The iPhone 15 series took the top three spots on the global bestseller list for Q4 2023, with the iPhone 15 Pro Max becoming the best-selling smartphone. Still, the latest lineup occupied positions 5 to 7. Interestingly, no iPhone Plus or mini joined the list of best-selling smartphones in 2023. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. Counterpoint highlights that Apple’s iPhone 13 maintained its fourth position with double-digit YoY volume growth in Japan and India. Carrier promotions in Japan drove sales of older iPhones over the newer generation, while in India, the iPhone 13’s value proposition made it a popular choice. What’s interesting about the best-selling smartphones in the 2023 list is the fact that the iPhone 14 was the most popular iPhone, even though little has changed from this model to the iPhone 13. Despite improving repairability, this iPhone had more software tweaks than hardware changes, which, in the opinion of a hardcore Apple user, wouldn’t entice people to upgrade. With that in mind, the iPhone 15 may become the 2024 best-selling smartphone, followed by the iPhone 15 Pro Max, and so on. José is a Tech News Reporter at BGR. He has previously covered Apple and iPhone news for 9to5Mac, and was a producer and web editor for Latin America broadcaster TV Globo. He is based out of Brazil. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. -\n\t\t\t\t\t\tJonathan S. Geller, Founder BGR is a part of Penske Media Corporation.\n© 2024 BGR Media, LLC. All Rights Reserved. "
}