{
    "title": "How To Buy Apple Stock (AAPL) – Forbes Advisor Canada",
    "date": "2/23/2024",
    "url": "https://www.forbes.com/advisor/ca/investing/how-to-buy-apple-aapl-stock/",
    "text": "The Forbes Advisor editorial team is independent and objective. To help support our reporting work, and to continue our ability to provide this content for free to our readers, we receive payment from the companies that advertise on the Forbes Advisor site. This comes from two main sources. First, we provide paid placements to advertisers to present their offers. The payments we receive for those placements affects how and where advertisers’ offers appear on the site. This site does not include all companies or products available within the market. Second, we also include links to advertisers’ offers in some of our articles. These “affiliate links” may generate income for our site when you click on them. The compensation we receive from advertisers does not influence the recommendations or advice our editorial team provides in our articles or otherwise impact any of the editorial content on Forbes Advisor. While we work hard to provide accurate and up to date information that we think you will find relevant, Forbes Advisor does not and cannot guarantee that any information provided is complete and makes no representations or warranties in connection thereto, nor to the accuracy or applicability thereof. The Forbes Advisor editorial team is independent and objective. To help support our reporting work, and to continue our ability to provide this content for free to our readers, we receive payment from the companies that advertise on the Forbes Advisor site. This comes from two main sources. First, we provide paid placements to advertisers to present their offers. The payments we receive for those placements affects how and where advertisers’ offers appear on the site. This site does not include all companies or products available within the market. Second, we also include links to advertisers’ offers in some of our articles. These “affiliate links” may generate income for our site when you click on them. The compensation we receive from advertisers does not influence the recommendations or advice our editorial team provides in our articles or otherwise impact any of the editorial content on Forbes Advisor. While we work hard to provide accurate and up to date information that we think you will find relevant, Forbes Advisor does not and cannot guarantee that any information provided is complete and makes no representations or warranties in connection thereto, nor to the accuracy or applicability thereof. Updated: Feb 23, 2024, 5:44am Whether you’re an Apple fan or you can’t quit your Android, there’s no denying Apple Inc’s (AAPL) power in the stock market. According to its most recent earnings report, Apple’s fourth-quarter 2023 revenue totalled TK ($89.5 billion), down 1% year-over-year. With a market capitalization of $3.88 trillion ($2.90 trillion USD), Apple stock has gone up 389% over the past five years. If those numbers have you salivating for a slice of AAPL, you can buy Apple stock in six simple steps. Featured Partner Offer 1 Questrade On Questrade's Secure Website Build your own portfolio or have one pre-built and save on fees  self-directed account stocks starting at $0.01 per share (min. $4.95, max. $9.95) pre-built portfolios with management fees starting at 0.25% (0.20% after $100,000) 2 Qtrade Direct InvestingTM On Qtrade’s website. Division of Credential Qtrade Securities Inc Get $50 upon opening and funding a new account, up to $150 for 3 accounts. Account must be funded with minimum $1,000 AND at least 1 trade fulfilled within 60 days of account opening date. Offer ends October 31, 2024. Use promo code OFFER2024 Trading fee $6.95 - $8.75 An online brokerage is your gateway to buying and selling stocks. In addition to enabling you to purchase Apple shares, online brokerage accounts also provide a wealth of research, educational materials and account types to help you meet your investing goals. If you’re investing for long-term goals, like your child’s college education or your retirement, you’ll probably want to buy AAPL in a tax-advantaged account like a Tax-Free Savings Account (TFSA), a Registered Retirement Savings Plan (RRSP) or a Registered Education Savings Plan (RESP). If you’re saving up to buy a home or build wealth, a non-registered account (one in which gains are taxed as they are earned) is a better choice. This is because there are no contribution or withdrawal limits on non-registered accounts and there are no age limits. For example, an RRSP must change into a Registered Retirement Income Fund after age 71, so you can invest as much as you want at any age. Fees, services and investment options can vary according to the broker you choose, so compare multiple brokerages to find the right one for you. If you’re not sure where to start, check out our picks for the best online brokers. Even CEO Tim Cook doesn’t have an unlimited amount of money to pour into Apple. When deciding how much to invest in Apple, ask yourself the following four questions. Before purchasing stocks, spend some time thinking about your investment goals. Investing always has some level of risk, and buying large amounts of single shares of any company can be particularly risky. Apple itself notes that it has experienced substantial price volatility in the past and can be significantly impacted by external factors. While past performance is no indication of the future, you may face similar volatility in the future. Lawrence Sprung, a CFP and wealth advisor with Mitlin Financial, recommended that the price fluctuations should influence how you invest in Apple. “I think Apple, as an investment, is well suited for someone that has a moderate or higher risk tolerance, ability to withstand volatility and a long-term time horizon,” he said. “They are a leader in their industry, and typically that will present a great case for a good long-term investment.” Though it’s exciting to buy shares of an individual company, especially a big name like Apple, you should take a moment to do your due diligence. Start your evaluation by reviewing the documents that publicly traded companies like Apple are required to file regularly: annual reports (Form 10-K) and quarterly reports (Form 10-Q). These reports disclose detailed performance and financial information, and they’re usually referred to in the financial press as earnings reports or quarterly earnings. You can find them on Apple’s investor relations site or by searching the SEC’s database. You can also make use of expert analyses to provide some insight, like you might find on Globe Investor, TMX Money or Forbes. You can then take all of the information and expert commentary you collect to determine if Apple seems to be a financially sound company you want to invest your money in. On your brokerage platform, you can put in a request to buy AAPL stock at the best current price or use a more advanced order type, like limit or stop orders, to only purchase shares once the stock price falls below a certain threshold. You can buy any U.S. stocks in Canada and your brokerage takes care of the paperwork. Since Apple is traded on the Nasdaq exchange, it can be bought or sold between 9:30 a.m. and 4:00 p.m. ET Monday through Friday. However, the Nasdaq does have pre-hours and after-hours trading, which you may be able to access through your online brokerage. Nasdaq’s pre-market trading hours are 4:00 a.m. until 9:30 a.m., and its after-hours trading runs from 4:00 p.m. until 8:00 p.m. ET. ​​If you place an order outside of the hours your brokerage allows you to trade during, it will be processed once trading resumes. If you’re buying stock in an American company like AAPL from Canada, you will have to pay a currency conversion fee to convert your Canadian dollars to U.S. dollars. The conversion fee is usually 1% to 4% on top of the exchange rate and applies when both converting your money during the purchase and converting it back during the sale. To avoid these fees, you can keep money reserved for purchasing American stocks in a U.S. dollar bank account. You can also perform Norbert’s Gambit to save on conversion fees. It is when you buy a stock or ETF that’s interlisted on American and Canadian stock exchanges. You buy Canadian shares of that stock or ETF, then you ask your brokerage to “journal over” your Canadian shares and turn them into American shares of the same stock, you then sell your American shares in U.S. currency and can use the U.S. dollars that result to purchase any American stock or ETF you want, like APPL, without converting from Canadian dollars. In addition to currency conversion fees, there are possible tax implications for buying American stocks. The IRS recognizes Canadian retirement accounts, so if you purchase U.S. stocks to include in your RRSP, you won’t have to pay any tax to America. However, any dividend payments you receive when you don’t use your RRSP will be subject to a 15% withholding tax to the IRS and you will also be subject to foreign gains taxes from the CRA. Plus, if you happen to make more than $5 million USD on your investments in the U.S., you will be required to pay American estate tax when you die. It’s wise to periodically review your investment portfolio and its performance. To evaluate the performance of Apple or other stocks, first start by looking at the annualized percent return. This will give you a number you can compare to other investments as you gauge how well your investment performed. You may also want to revisit the fundamental data you looked at earlier to see how it develops over time. You can compare this information to other stocks or benchmarks like the S&P 500 and Nasdaq Composite Index. By looking at those benchmarks, you can get an idea of how your investment is performing relative to certain industries or the market as a whole. You probably won’t hold your AAPL shares forever. Eventually, the time will come for you to cash out and hopefully see a tidy profit on your investment. To sell your Apple stock, return to your online brokerage platform, enter the ticker symbol, the number of shares (or dollar value) you want to sell and select a sell order type. These generally have the same names and work effectively identically to the order types we covered above. Keep in mind, if your investment has increased in value, you will have made a capital gain. Canadians will not generally be subject to American capital gains tax on U.S. stocks or bonds unless they have a more than 5% interest in a U.S. corporation and that corporation derives its principle asset value from U.S. real estate, like mining or real estate companies. This means if you do receive any capital gain from an American stock such as TSLA, the taxes that come from that (50% of the actual capital gain) are payable only in Canada to the CRA. If you’re concerned about how selling your Apple shares may impact your taxes, don’t be afraid to speak with a tax professional, like a certified public accountant (CPA). Featured Partner Offer 1 Questrade On Questrade's Secure Website Build your own portfolio or have one pre-built and save on fees  self-directed account stocks starting at $0.01 per share (min. $4.95, max. $9.95) pre-built portfolios with management fees starting at 0.25% (0.20% after $100,000) 2 Qtrade Direct InvestingTM On Qtrade’s website. Division of Credential Qtrade Securities Inc Get $50 upon opening and funding a new account, up to $150 for 3 accounts. Account must be funded with minimum $1,000 AND at least 1 trade fulfilled within 60 days of account opening date. Offer ends October 31, 2024. Use promo code OFFER2024 Trading fee $6.95 - $8.75 While individual shares are one way to invest in Apple, it’s not your only option. You could also invest in index funds or exchange-traded funds (ETFs), which you can buy through your online brokerage like you can individual stocks. Because these investment funds own hundreds or even thousands of different stocks, they’re generally considered to be less risky than individual stocks while still offering solid long-term returns. “Index funds or ETFs are an inexpensive way to gain exposure to Apple and other companies in the technology industry,” said Sprung. “This allows investors to mitigate some risk by not having exposure to simply one security in that industry or a significant overweight.” What’s more, Apple makes up a not-insignificant portion of many leading index funds (roughly 6% to 7% of many S&P 500 funds, for instance), meaning you’ll still have a hearty exposure to AAPL even while you diversify the rest of your holdings. According to ETF.com, there are a whopping 452 ETFs with holdings in AAPL; the top 10 have holdings greater than 14% allocation. For instance, Vanguard Information Technology ETF holds a hefty 22.26% AAPL stock. Kat Tretina is a freelance writer based in Orlando, FL. She specializes in helping people finance their education and manage debt. Aaron Broverman is the lead editor of Forbes Advisor Canada. He has over a decade of experience writing in the personal finance space for outlets such as Creditcards.com, creditcardGenius.ca, Yahoo Finance Canada, Nerd Wallet Canada and Greedyrates.ca. He lives in Waterloo, Ontario with his wife and son. "
}