{
    "title": "Apple wins Apple Watch antitrust lawsuit with AliveCor",
    "date": "2/7/2024",
    "url": "https://www.siasat.com/apple-wins-apple-watch-antitrust-lawsuit-with-alivecor-2973351/",
    "text": "San Francisco: Apple has won its ongoing legal battle with the US-based medical device company AliveCor over the Apple Watch’s heart monitoring technology. AliveCor had accused Apple of limiting third-party access to specific heart rate data collected by the Apple Watch, claiming that it was an anticompetitive move. However, a judge in a US District Court has ruled completely in favour of Apple, stating that the company is not required to stand trial for the lawsuit, reports 9to5Mac. “AliveCor’s lawsuit challenged Apple’s ability to improve important capabilities of the Apple Watch that consumers and developers rely on, and today’s outcome confirms that is not anticompetitive,” an Apple spokesperson was quoted as saying. “We thank the Court for its careful consideration of this case, and will continue to protect the innovations we advance on behalf of our customers against meritless claims,” it added. The case dealt with upgrades to Apple Watch’s heart rate algorithm made as part of watchOS 5 in 2018. The company switched from the “Heart Rate Path Optimizer” algorithm (HRPO) to “Heart Rate Neural Network” algorithm (HRNN). The company argued that these modifications hurt the experience of using its SmartRhythm feature, available in its own watchOS app. AliveCor then filed an antitrust case in May 2021, claiming that Apple should have continued to provide Apple Watch heart rate data from pre-watchOS 5 algorithms as well. Apple did not do this because it discovered that the HRNN was more accurate, the report mentioned. In a summary judgement, US District Judge Jeffrey White ruled in favour of Apple in this case. The judge ruled that Apple’s changes to watchOS were not anticompetitive and that the lawsuit should not proceed to a jury trial. “AliveCor is deeply disappointed and strongly disagrees with the court’s decision to dismiss our anti-competition case and we plan to appeal. We will continue to vigorously protect our intellectual property to benefit our consumers and promote innovation,” AliveCor was quoted as saying. Meanwhile, Apple has announced changes to iOS, Safari, and the App Store in the European Union in response to the Digital Markets Act (DMA) coming into force in March. Get the news updates on WhatsApp & Telegram by subscribing to our channels. For all the latest Business updates, download our app Android and iOS. "
}