{
    "title": "People at Vision Pro party in SF dance, pinch air",
    "date": "2/25/2024",
    "url": "https://www.businessinsider.com/apple-vision-pro-party-san-francisco-2024-2",
    "text": "       People in San Francisco are wearing Apple's new face computer to upscale locations like dance parties, or even breaking them out during dinners. Apple released the Vision Pro on February 2, billing it as an immersive \"spatial computing\" experience with both productivity and entertainment applications — and a $3,499 price tag. Since its release, people have been spotted wearing the device in public in some of California's largest cities, like San Diego, where police had to warn folks not to wear them while crossing the street. Apple recommends using the Vision Pro in controlled indoor settings and says users should stay aware of their surroundings and body posture while wearing the device. Related stories Some techies in San Francisco aren't doing so great with the second suggestion, instead wearing the device to parties where DJs and attendees wore the devices and danced to music together, The San Francisco Standard reported. The AI collective Cerebral Valley hosted an event to celebrate the release of the Vision Pro. Though the event had the feel of a nightclub, the publication reported that partygoers stood out by \"pinching\" and plucking things in the air that only they could see from within their headsets. Videos from the event on X, formerly known as Twitter, show guests poking at the air and waving their hands in front of them. The Vision Pro's high price tag also means that most people haven't been able to try the device out unless they've attended one of Apple's free store demos. That means that some of those who have the device, like Business Insider's Jordan Hart, found it to be an effective \"party trick.\" It turns out that also applies to techie dinners in the city too. Nick Linck, founder of the Residency, a live-in fellowship for startup founders, shared a post on X showing two guests at a crowded dinner party wearing the Vision Pro. Linck quipped on X that it's \"not really an sf dinner party anymore without a couple of vision pros.\" Reibman told The Standard that he has also seen people wearing the Vision Pro at several recent dinners.  Read next Jump to "
}