{
    "title": "Apple launches the Vision Pro, Taylor Swift fans strike back and Palworld \ncomes under fire",
    "date": "2/3/2024",
    "url": "https://techcrunch.com/2024/02/03/apple-launches-the-vision-pro-taylor-swift-fans-strike-back-and-palworld-comes-under-fire/",
    "text": "Hey, folks, welcome to Week in Review (WiR), TechCrunch’s regular newsletter that recaps the week in tech that was. And, boy, was it a week. Lots happened — let’s dig in. As layoffs in tech picked up, the Vision Pro, Apple’s attempt at an AR headset, launched with hundreds of apps right out the gate. Taylor Swift fans struck back after explicit deepfakes of the superstar flooded X, the platform formerly known as Twitter. And the Pokémon Company said that it would investigate Palworld, the viral video game hit, over potential plagiarism and uncanny resemblance to its IP. We cover all that and more in this edition of WiR. But first, a reminder to sign up here to receive the WiR newsletter in your inbox every Saturday if you haven’t already done so. Tech layoffs jump: Tech redundancies have scaled to a three-quarter high as firms shed workers en masse. This week, Okta fired 400 employees; Block laid off around 1,000 people; and PayPal let go “thousands” of staffers. As Alex and Anna write for TechCrunch+, yes, tech layoffs are accelerating — and it’s affecting companies big and small. iOS 18: Apple’s upcoming iOS 18 software update may be “the biggest” in the company’s history, writes Aisha. It could bring — among other things — a revamped Siri, improved autocomplete in Messages and perhaps even support for RCS. Apple Vision Pro: Apple’s first “spatial computing” device has arrived with ~600 apps and games in tow. Brian’s been giving it a spin for the better part of the week — be sure to read his initial thoughts and impressions. And if you’re looking to pick one up yourself, here’s what you can expect. Swifties unite: Nonconsensual deepfake porn of Taylor Swift went viral on X last week. In lieu of meaningful action from the platform beyond basic keyword filtering, Taylor Swift fans came together to make the musician’s deepfakes as difficult to find as possible. Palworld under fire: The Pokémon Company said it hasn’t granted any permission to “another company” — referring to viral new game Palworld-developer Pocketpair — to use Pokémon IP or assets and “intends to investigate and take appropriate measures” against the fast-growing survival game operator. A SaaS revolution: Writing for TC+, Julien Codorniou, a SaaS investor at Felix Capital, says that he sees an opportunity for savvy software entrepreneurs to build the Microsoft or Salesforce of the frontline workers’ world. On Equity, Alex spoke with Anshu Sharma, the CEO of data privacy company Skyflow, who riffed on interest rates, business cycles and the Vision Pro — as well as how the Vision Pro fares against a theory Sharma recently blogged about for TechCrunch+. Meanwhile, Found featured Carly Zakin and Danielle Weisberg, co-founders and co-CEOs of the Skimm, a digital media company dedicated to succinctly giving women the information they need to make confident decisions. And over on Chain Reaction, Jacquelyn interviewed Chris Dixon, general partner at VC firm Andreessen Horowitz. Dixon has been at the firm since 2012 and founded and leads a16z’s crypto team, which invests in the web3 world through four mega-funds with over $7 billion under management. Fairness and equality: Rebecca writes about how pitch competitions help level the playing field for underrepresented founders — but that it isn’t enough. Ethereum makes a comeback: Ethereum developer interest hit new all-time highs in 2023 despite a bear market, Jacquelyn reports. Solana, Polygon, Optimism and other blockchains also saw an uptick in dev activity. “Die slow motherf*ckers”: Y Combinator president Garry Tan published a menacing tweet — a questionable lyrical reference to famed West Coast rapper Tupac Shakur — before deleting it and later apologizing. "
}