{
    "title": "iOS 18 may have Vision OS-like design elements. Here's what we know so far \n| Mint",
    "date": "2/12/2024",
    "url": "https://www.livemint.com/technology/tech-news/ios-18-may-have-vision-os-like-design-elements-heres-what-we-know-so-far-11707718111650.html",
    "text": "Apple recently launched its Vision Pro mixed reality headset in the US, which has attracted a lot of attention from both the Cupertino company's loyalists and critics for its unique features and futuristic-looking technology. However, a new report claims that Apple may be looking to implement many of these innovative features in its iOS 18 operating system, which is likely to be announced at its WWDC 2024 developer conference. According to a report by The Verifier, Apple is looking to bring many of the visual elements of visionOS to iOS 18 and iPadOS updates. In particular, Apple hasn't made many drastic changes to its operating system for iPhones and iPads in a long time, and this could change with the iOS 18 update. The report notes that iOS 18 will bring a facelift with a fresh design in everything related to the user interface, including menus, built-in apps and Safari. The visionOS interface is inspired by iOS, but thanks to a complex background and floating windows, elements in visionOS have rounded corners, shadows and depth, 9to5Mac reports. Generative AI in iOS 18: A recent report by Bloomberg's Mark Gurnman had also revealed that Apple is working on bringing a number of AI features to its iOS 18 update. Apple's forthcoming iOS 18 update is likely to usher in a new era of artificial intelligence, introducing a host of innovative features designed to enhance user experiences.\n   The anticipated AI features could include auto-summarization, allowing users to distill lengthy content, and an auto-complete function for apps, streamlining interactions with applications. Furthermore, Apple is said to integrate AI into Apple Music, promising a more personalized and intuitive music streaming experience. The report also hints at the introduction of new AI-based developer tools, providing creators with enhanced capabilities to innovate within the Apple ecosystem. \n    \n    \n\n\n\n\nYou may be interested in\n\n\n\n\n\n\n\n\n\n\n\n\n     \n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Chip(per) ambitions: Why India needs its wafer fabs          Dholera chip fab: India's leap into electronics manufacturing          Mint Primer| Google vs Indian startups row: its global implications          Ask me anything: Inside the race to build desi GPTs          A Google Maps competitor in India's tech revolution          ‘Need another technology leap for AI to start reasoning like humans’          Govt's ₹1-trillion deep tech fund: why we need it, and is it enough?          Telepathy: Would you allow a chip implant in your brain?          Budget 2024: India's digital public infra now a new 'factor of production'          Rights issue caps Byju's wild ride from top startup to throwaway valuation       Explore Premium  \n\n\n                Catch all the  Technology News and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 12 Feb 2024, 12:58 PM IST\n\t\nTopics You May Be Interested In \n ios 18 \n ios 18 update \n ios 18 release date \n vision pro \n pro vision apple \n apple vision \n apple \n apple ios 18 A recent report by Bloomberg's Mark Gurnman had also revealed that Apple is working on bringing a number of AI features to its iOS 18 update. Apple's forthcoming iOS 18 update is likely to usher in a new era of artificial intelligence, introducing a host of innovative features designed to enhance user experiences. The anticipated AI features could include auto-summarization, allowing users to distill lengthy content, and an auto-complete function for apps, streamlining interactions with applications. Furthermore, Apple is said to integrate AI into Apple Music, promising a more personalized and intuitive music streaming experience. The report also hints at the introduction of new AI-based developer tools, providing creators with enhanced capabilities to innovate within the Apple ecosystem.    Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}