{
    "title": "Apple’s EV Wind Down Offers Reprieve to Tesla and Detroit Rivals",
    "date": "2/27/2024",
    "url": "https://www.bnnbloomberg.ca/apple-s-ev-wind-down-offers-reprieve-to-tesla-and-detroit-rivals-1.2040050",
    "text": "Are you looking for a stock? Try one of these Are you looking for a stock? Try one of these More More Latest Videos {{ video.Name }} The information you requested is not available at this time, please check back again soon. Feb 27, 2024  David Welch and Gabrielle Coppola, Bloomberg News An Apple Store in San Francisco.\n                        , Photographer: Justin Sullivan/Getty Images (Bloomberg) -- The sudden demise of Apple Inc.’s electric vehicle program is a bleak sign for the car market. It’s also a welcome boon for automakers themselves. Tesla Inc. and Detroit’s automakers can breathe a sigh of relief after the electronics giant scrapped its car program, eliminating a threat in an EV market where growth is slowing and providing a pool of engineers and other talent who may be out of a job. In the past year, Elon Musk’s company has cut prices and warned of slumping demand, while established carmakers like General Motors Co. and Ford Motor Co. have delayed investment and pulled back production plans. Now they have one fewer competitor to worry about in a crowded and uncertain arena, especially a tech company with $61 billion in cash to throw around. “They’re probably relieved,” said Gartner Inc. analyst Mike Ramsey. “Apple getting in the market scared people early on.” Apple exiting the EV market before it really revved up underscores just how tough the business has become. The cars are still too expensive for most consumers and charging is patchy in the US. EV sales are expected to rise just 9% this year, after growing at a compounded annual rate of 65% over the past three years, according to a forecast by Bloomberg Intelligence. That means every company standing will be fighting over about 10% of new buyers in the US market. Read More: Apple Cancels Work on Electric Car, Ending Decadelong Effort EV startups are already struggling amid meager sales and heavy cash burn. Rivian Automotive Inc. forecast flat production this year and said it would lay off workers, sending its shares to their biggest ever decline. Lucid Group Inc. will only make 9,000 vehicles this year, putting it on weaker financial footing. Hertz Global Holdings Inc. last month revealed plans to sell 20,000 plug-in vehicles — a third of its US EV fleet — due to weak demand, rapid depreciation in value and high repair costs. It marked a sharp reversal from Hertz’s earlier embrace of EVs from Tesla and other automakers. While GM is having a hard time building EVs due to production problems, Ford has seen demand fall and has reined in investment plans. GM delayed plans to open an electric pickup plant outside Detroit. Germany’s Mercedes-Benz has backed off its plan to sell only EVs by 2030. Auto Market Disruption This is another example of the tech sector underestimating how difficult it is to disrupt the auto sector, said Jeff Schuster, global vice president of automotive research at consultant GlobalData. “Everybody from that world just looks at it and thinks, ‘Oh, these dinosaurs, we can come in, this is easy, what could be so difficult? We manufacture phones and we have all this technology, we can take it over,’” Schuster said in an interview. “Nine times out of 10, most find it a little more challenging and certainly more dynamic and complex than they expect.” Other market watchers had a slightly different take. It’s a bit of a double-edged sword for automakers, said Jochen Siebert at JSC Automotive, a car consulting firm in Singapore. “One the one hand, Apple isn’t a direct threat, but on the other, if Apple kind of says, ‘the automotive industry isn’t interesting,’ that has a backlash affect on everybody else,” he said. “Every carmaker needs to be interesting for investors and it’s not good if Apple takes away the stamp of approval,” Siebert said. “If the biggest software company in the world says ‘cars aren’t interesting,’ why do you still bother with cars?” That aside, others felt Tesla may benefit the most from Apple’s about-face. The last thing Musk wanted a year after cutting prices on his vehicles by 25% or more was a Silicon Valley rival with the same kind of high-tech appeal, Gartner’s Ramsey said. “They certainly had the most downside,” he said. “Tesla benefits big time from being a status vehicle. And an Apple EV definitely would be a status vehicle.” Celebrating the move, Musk on Tuesday sent a post on X with a saluting emoji and a cigarette. Li Xiang, the CEO of Chinese carmaker Li Auto Inc., also took to social media after the news, posting on his Weibo account that “giving up carmaking and focusing on artificial intelligence is an absolute strategic decision at the right time.” He also noted that AI is a prerequisite for making a great car anyway. Automakers will now also be looking to snap up some of Apple’s unwanted talent, said Brad Holden, a founder of the executive search firm Holden Richardson. “There will be great talent on the street so it will be picked up,” Holden said. Read More: Big Auto’s EV Revolution Is a Tough Sell for Ordinary Americans --With assistance from Keith Naughton, Mark Gurman and Chunying Zhang. (Updates with further industry reaction from 12th paragraph.) ©2024 Bloomberg L.P. 5 things you need to know for the trading day Meta has lost consumer trust, favour Alphabet and Amazon for FANG buys right now: Hatem Dhiab Stay away from the FAANG, but remain invested in tech: Strategist Darren Sissons discusses the FAANG stocks and Microsoft Amazon breakout would be a 'really big deal': Fairlead Strategies founder Katie Stockton Investors to see 'nothing but blowout earnings' for this quarter: Belpointe's David Nelson "
}