{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.livetradingnews.com/warren-buffett-is-dumping-stocks-what-is-he-buying-224781.html",
    "text": "In a recent move that has kept investors intrigued, Berkshire Hathaway, the conglomerate helmed by legendary investor Warren Buffett, revealed adjustments to its stock holdings, shedding some familiar names while potentially hinting at significant new investments. According to a regulatory filing detailing its U.S.-listed stock holdings at the close of 2023, Berkshire disclosed that it had trimmed its extensive stake in Apple, a company Buffett has championed in the past. The conglomerate sold 10 million Apple shares in the fourth quarter, though it still retained over 905 million shares valued at approximately $174 billion. While Buffett has traditionally been instrumental in Berkshire’s investments in Apple, the recent stock sales may have been executed by portfolio managers Todd Combs and Ted Weschler, who oversee certain Berkshire investments. Notably, Berkshire reported no holdings in several common stocks, including homebuilder DR Horton, insurer Globe Life, insurance and investment firm Markel, and Brazilian credit card processor StoneCo. These holdings, valued at over $1 billion collectively at the end of September, have since been liquidated. On the other hand, Berkshire bolstered its position in oil giant Chevron, one of its significant holdings, while scaling back its stakes in technology company HP and media conglomerate Paramount Global. For the second consecutive quarter, Berkshire secured permission from the U.S. Securities and Exchange Commission (SEC) to temporarily withhold disclosure of one or more of its holdings. This confidentiality is typically sought when Berkshire is making substantial investments, such as its multibillion-dollar stakes in companies like Chevron, Exxon Mobil, IBM, and Verizon Communications. The rationale behind such confidentiality requests lies in Berkshire’s desire to prevent investor speculation and prevent premature stock purchases by others. This strategy aligns with Buffett’s reputation as one of the preeminent investors globally. In its third-quarter report in November, Berkshire hinted at a potential investment in the banking, finance, or insurance sector, having recently allocated $1.2 billion towards stocks in that domain. However, the specific destination of these funds remains undisclosed. Despite requests for comment, Berkshire has remained tight-lipped about its recent moves. Notably, the conglomerate has divested from Exxon, IBM, and Verizon in recent times. At the helm of Berkshire Hathaway since 1965, Warren Buffett has guided the conglomerate through decades of success. Berkshire’s diverse portfolio includes numerous businesses such as the Geico car insurer, BNSF railroad, energy and industrial companies, and consumer brands like Benjamin Moore, Dairy Queen, and See’s Candies. Berkshire’s upcoming annual report, along with Buffett’s highly anticipated letter to shareholders, slated for release on February 24, is expected to shed further light on its recent investments and business operations, offering insights that investors eagerly await. Shayne Heffernan S. Jack Heffernan Ph.D. Economist at Knightsbridge holds a Ph.D. in Economics and brings with him over 40 years of trading experience in Asia and hands on experience in Venture Capital, he has been involved in several start ups that have seen market capitalization over $500m and 1 that reach a peak market cap of $15b. He has managed and overseen start ups in Crypto, Mining, Shipping, Technology and Financial Services. Your Trusted Source for Capital Markets & Related News © 2024 LiveTradingNews.com – For The Traders, By The Traders – All Right Reserved. "
}