{
    "title": "Why Apple Is No Longer A Great Stock",
    "date": "2/11/2024",
    "url": "https://247wallst.com/consumer-electronics/2024/02/11/why-apple-is-no-longer-a-great-stock/",
    "text": "Apple’s (NASDAQ: AAPL) run as America’s greatest stock and most valuable company by market cap is over. And that will not change. Despite several challenges, China is the primary reason for Apple’s downfall. There have been worries for at least a year that the iPhone 15 might sell poorly compared to recent generations. It may not have enough upgrades from the iPhone 14. It could be too expensive. Perhaps competing models like the Galaxy Z Flip5 from archrival Samsung had attracted Apple customers. The iPhone had a modest sales increase based on the company’s most recent earnings. Apple’s revenue rose only 2% overall to $119.6 billion. iPhone revenue worldwide grew faster, but not by much. The increase for the quarter was from $65.8 billion to $69.7 billion. The earnings report also shows that Apple wheels fell off in China. Revenue for what Apple calls Greater China dropped from $23.9 billion in the year-ago quarter to $20.8 billion. China is the largest smartphone market in the world by far, with over 900 million users. Apple competes with local manufacturers in China, which is not a challenge in any large country. China-based Huawei has about a third of the market, as does Apple. Xiaomi and Honor each have slightly less than 10%. Samsung has a presence in the market. Apple’s stock has been downgraded recently because of worries about China. The competition is fierce, unlike in the US and much of Europe. Without healthy growth in China, Apple’s prospects are mediocre. Take This Retirement Quiz To Get Matched With An Advisor Now (Sponsored) Are you ready for retirement? Planning for retirement can be overwhelming, that’s why it could be a good idea to speak to a fiduciary financial advisor about your goals today. Start by taking this retirement quiz right here from SmartAsset that will match you with up to 3 financial advisors that serve your area and beyond in 5 minutes. Smart Asset is now matching over 50,000 people a month. Click here now to get started. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}