{
    "title": "EU set to hit Apple with a 500 million Euro fine over music streaming",
    "date": "2/18/2024",
    "url": "https://www.gizchina.com/2024/02/18/apple-fine-music-streaming/",
    "text": "According to a report by the Financial Times, Apple is about to be fined by the European Commission for the first time. The European Union is set to impose a record fine of 500 million euros on Apple for alleged antitrust violations related to its music streaming business. The fine is the result of an investigation into whether Apple’s App Store policies stifle competition, following a complaint from Spotify. The EU accuses Apple of anti-competitive behaviour and abusing its dominant market position. If imposed, this would be the first time the EU will be fining Apple.  On March 13, 2019, streaming music service Spotify filed a complaint against Apple to the European Union’s antitrust regulators. Spotify accuses Apple of unfairly restricting its rivals and favouring its streaming music service, Apple Music. Spotify said Apple’s control of the App Store deprives consumers of choice and competes with other streaming music service providers in a way that favours Apple Music. Horacio Gutierrez, Spotify’s general counsel, said the company was forced to use Apple’s billing system in 2014. He said that when Apple launched Apple Music for 9.99 euros, it was forced to reduce its monthly service fee. Spotify subsequently stopped using Apple’s in-app purchase system. The fine will be part of the conclusion of a case following a formal complaint filed by Spotify in 2019. Apple has blocked music streaming apps such as Spotify from offering users alternative ways to subscribe to its services, thereby bypassing Apple’s in-app purchase commissions, a move the European Union considers illegal. These provisions are often referred to as App Store “anti-diversion provisions.” The upcoming EU ruling won’t force Apple to allow alternative in-app payment methods. However, it will insist that music streaming app developers are free to link to their sites for online subscriptions. There will be no need to pay Apple a commission, hence the price will be hopefully lower. If the fine is imposed, it would have significant implications for Apple and could potentially lead to changes in its App Store policies. The company has previously faced antitrust scrutiny in Europe, including a 1.1 billion euro fine in France, which was later reduced to 372 million euros. Apple has expressed its displeasure with the investigation, stating that the App Store has facilitated healthy competition and helped services like Spotify thrive. However, the company has not yet officially responded to the reports of the impending EU fine.  The EU’s decision to levy a substantial fine on Apple underscores the increasing regulatory pressure on major tech companies. This development is part of a broader global trend of antitrust scrutiny and regulatory action aimed at ensuring fair competition and consumer protection in the digital marketplace. The outcome of this case will be closely watched. It may have far-reaching implications for the practices of other tech giants operating in the EU. The impending fine of 500 million euros on Apple by the European Commission is a significant development. It reflects the scrutiny faced by major tech companies, particularly regarding their market dominance and business practices. The European Union’s decision, spurred by Spotify’s complaint, underscores the importance of fostering fair competition. Apple’s alleged antitrust violations related to its music streaming business highlight the broader regulatory challenges faced by tech giants. Big tech brands need to find a way to navigate complex competition laws and regulations. Apple has defended its App Store policies as promoting healthy competition. However, the EU’s stance signals a commitment to ensuring that market dynamics remain conducive to innovation and consumer welfare. The implications of the EU’s decision extend beyond Apple. It reflects a broader trend of increased regulatory scrutiny and enforcement actions targeting big tech firms worldwide. As the digital economy continues to evolve, regulatory authorities are stepping up efforts to address concerns related to market concentration. They are also checking monopolistic practices and consumer rights. The outcome of this case will likely impact Apple’s future business strategies and App Store policies. It will also set a precedent for how other tech companies operate within the EU’s regulatory framework. Efe Udin, a government tech policy expert is a seasoned tech writer with over seven years of tech writing experience. Efe's true passion lies in exploring the intersection of technology, politics, and brand feuds.\n\r\nWith an astute understanding of the power dynamics and competitive landscape within the tech world, Efe delves into the intricacies of how technology influences political discourse and how brand rivalries shape the industry.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}