{
    "title": "Turnaround Picks: 3 Unloved Stocks That Are Ready to Rise",
    "date": "2/16/2024",
    "url": "https://investorplace.com/2024/02/turnaround-picks-3-unloved-stocks-that-are-ready-to-rise/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Some investors may seem bullish on these well-known companies Advertisement Source: shutterstock.com/Lemonsoup14 A lot of well-known companies have had to contend with slumping share prices in recent years. After years of strong and predictable gains, many companies have seen their stocks fall out of favor with investors. This can be due to a number of factors. Slowing sales, dwindling profits, loss of market share, and failure to keep up with shifting tides can all lead to once mighty stocks falling on hard times. While many securities are still down for the count, some are getting up off the mat and look ready to fight their way back into the good graces of investors. After declining and then languishing for long periods, certain stocks seem to have finally bottomed and are marching higher once again. For shareholders who held on and kept the faith, this is a moment of vindication. Yet for other investors, it’s a moment of opportunity. Let’s delve into three unloved stocks with promising catalysts to bring them back into investors’ favor. Even Warren Buffett is selling Apple (NASDAQ:AAPL) stock. The famed investor just disclosed in a regulatory filing that his holding company Berkshire Hathaway (NYSE:BRK-A, NYSE:BRK-B) sold 10 million AAPL shares during the fourth quarter of last year. The sale made headlines as Buffett has long been Apple’s self-proclaimed biggest fan, and the company’s largest individual shareholder. Berkshire Hathaway currently holds a little more than 905 million shares of Apple worth $165 billion. While Apple continues to be Buffett’s biggest position, comprising nearly half (45%) of his stock portfolio, the sale late last year is further evidence of the poor sentiment surrounding AAPL stock. The ill will is reflected in the fact that Apple’s share price is down 2% year to date (YTD). Declining sales of its legacy devices, such as the iPhone, are the main reason the stock is down. However, there’s reason to believe Apple’s stock is ready to rise as the company introduces its Vision Pro augmented reality (AR) headset. The Vision Pro is Apple’s first entirely new device since the Apple Watch was introduced in 2015, and should help to boost the company’s finances and share price. Additionally, early reviews of the Vision Pro are positive. Recently, Walt Disney Co. (NYSE:DIS) delivered quarterly financial results that look to be getting the company and its stock out of the dog house with investors. Shares of the Mouse House have risen 12% since the company issued its latest earnings print on Feb. 7. DIS stock is now up 23% on the year and trading at a 52-week high. It’s a big turnaround after the share price languished at a multi-year low for most of 2023. Further, the reversal of fortune comes after Disney reported better-than-expected Q4 financial results. Also, it increased its dividend payment to shareholders by 50%. Starting this July, Disney will pay a semi-annual dividend to stockholders of 45 cents. That’s a whopping 50% higher than its current payout. Walt Disney reinstated its dividend late last year after suspending it in 2020 during the Covid-19 pandemic. If that weren’t enough, Disney also announced a new $3 billion stock buyback plan. Investors are loving it. For 20 years, General Electric (NYSE:GE) was viewed as a value trap. From the late 1990s through to the pandemic in 2020, GE stock consistently slid downwards. It was so bad that in July 2021, the company executed a one-for-eight reverse stock split to artificially raise its share price in what was widely viewed as an act of desperation. My, how things have changed! Currently, GE stock is up 18% on the year and has gained 75% in the last 12 months due to a remarkable turnaround at the industrial conglomerate. At the end of January, General Electric reported Q4 2023 financial results that beat Wall Street forecasts across the board. Also, the company reported earnings per share (EPS) of $1.03, which was higher than the 91 cents consensus estimate of analysts. Revenue in Q4 rose 15% to $19.42 billion, beating forecasts of $17.67 billion. GE said the strong print was due to demand for parts and services at its jet engine business. Much of the turnaround has come from the company separating its diverse business units. General Electric completed the separation of its healthcare business last year and plans to spin off its energy business into a separate company this April. On the date of publication, Joel Baglole held a long position in AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia. 5G, Communications, Energy, Financial, Technology, Utility Blue-Chip Stocks, Dividend Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/turnaround-picks-3-unloved-stocks-that-are-ready-to-rise/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}