{
    "title": "Apple Car: it's the end of the road, but here's what could have happened",
    "date": "3/1/2024",
    "url": "https://www.techradar.com/news/apple-car",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A (very long) story of twist and turns  - Apple's car project is reportedly dead\n- Apple was committed to implementing full self-driving technology, to meet 2026 release schedule\n- There were apparently plans to launch the car for under $100k\n- Apple supposedly tried and failed to partner with several major automakers It looks like it's the end of the road for the so-called Apple Car, as Cupertino's self-driving car project is reportedly dead, according to Bloomberg reporter and accurate Apple tipster Mark Gurman. Rumored for years, and likely a genuine project, efforts to make the Apple Car have stalled and Apple is apparently shifting the efforts of the Apple Car team to focus on generative AI. With that in mind, consider the below to be more of a collection and rumors of tips around the Apple Car, rather than steadfast information. Gurman could be wrong, but his reports are generally accurate. And the idea of Apple entering a very challenging market where it would be a complete newcomer was perhaps always a bit hard to swallow. Well the answer to the above is 'never' as the Apple Car project is reportedly dead. Back in 2020, Apple analyst Ming-Chi Kuo claimed that the Apple Car might not be launched until 2028 and then two-years later reports emerged suggesting that Apple had since re-jigged its Apple Car release date target to 2026. After a while without any Apple Car rumors, analyst Daniel Ives went on record to say that he thought the arrival of the vehicle was a question of \"when, not if\" – we suspect that Ives may not stick to his guns on that one in light of Gurman's report. Given the Apple Car project is reportedly over, take the blow as a recap rather than latest information. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. As far back as May 2018, Apple was reportedly in talks with German automotive giant Volkswagen to produce an autonomous employee shuttle van based on the T6 Transporter commercial vehicle – a program which was expected to lead to the development of an Apple car for the mass market. But after a series of high-profile test crashes and employee leaks, the partnership between the two companies stifled, and little more was disclosed on the matter. At the start of 2021, we thought the tech giant was in promising talks with Hyundai regarding production of the autonomous electric vehicle. Then we reported on rumors which suggested Apple had in fact signed a manufacturing deal with Hyundai's subsidiary company, Kia, which would bring the Apple Car to market as early as 2024. Alas, in typical Apple style, another report then emerged which suggested Apple swiftly called off those talks with both Hyundai and Kia, with the company turning its attention to several Japanese automotive manufacturers in an effort to bring its ambitious EV (electric vehicle) plans to fruition. Rumors then began indicating that Apple approached Nissan as one of these potential Japanese manufacturing partners, but a report from the Financial Times suggested that \"contact was brief and the discussions did not advance to senior management levels following divisions over branding.\"  It's no surprise, though, that automotive collaboration has been such a sticking point for Apple. Despite being widely-considered the most successful business in the world, Apple's expertise lies in tech development, not vehicle manufacturing. Basically, that means it needs – or thought it needed – help from another organisation to bring its Apple Car vision to life, but the big car brands were seemingly unwilling to become a bit-part supplier – in the same way that Foxconn is to Tesla – on a vehicle that would ultimately bear the Apple name. One unlikely rumored alliance was that of Apple and LG Electronics. According to a Korea Times report from April 2021, Apple was “very near” to landing a collaborative deal with the South Korean tech giant (alongside Canadian automotive supplier Magna International), which has recently departed from the smartphone industry to focus resources on growth areas where its brand is better positioned – like electric vehicle components. LG isn’t a name traditionally associated with auto manufacturing, but neither is Apple, so we thought this common ground could have proven the clincher in Apple's ongoing hunt for a partnership on the project. Talks didn't last long, though, and subsequent reports then emerged suggesting Apple was also in negotiations with Chinese battery supplier CATL – which, like Foxconn, already counts Tesla among its customers – to produce the power source for the Apple Car. By most accounts, however, a deal was dependent on the latter's willingness to build manufacturing facilities in the US, and enduring political tensions between Washington and Beijing proved a roadblock in this regard. A Korea Times report suggested Apple bosses also sat down with Korean EV components manufacturers – CATL and LG among them – in August 2021, but official communications on the matter were non-existent. Moving on to 2022, none of those names – LG, CATL or Magna International – inked an official, public deal with Apple.  Another slightly left field name that emerged as a potential collaborator was Lucid Motors, an American automotive manufacturer that specialises in electric cars. On top of a like-minded design philosophy which places emphasis on developing luxury, disruptive products, both Lucid Motors and Apple are connected in another way – Jony Ive. That question of what form those plans could've taken was answered, tentatively, by Apple CEO Tim Cook in an April 2021 interview. When pressed on whether the Apple Car would end up being a fully-fledged vehicle or software-based project, Cook said: “We love to integrate hardware, software and services, and find the intersection points of those because we think that’s where the magic occurs. That’s what we love to do. And we love to own the primary technology that’s around that.” The integration of \"hardware, software and services\" sounded, to us, like Apple was committed to producing an entire vehicle. Ironically, though, the company's \"love\" of owning \"primary technology\", as Cook suggested, spoke to the central problem it faced when searching for a manufacturing partner on the project.  Still, flying solo would have taken Apple back to its original project roadmap, which saw the company handling all research, development and logistics on the Apple Car in-house. As for who was leading that development within the company itself, Kevin Lynch, well-known for overseeing the brand's Apple Watch division (as well as his role in creating Adobe Creative Cloud), was in the lead role. The project was being overseen by Apple's AI and machine learning chief, John Giannandrea, who stepped in for Bob Mansfield after the latter's retirement in 2020. That appointment seemed to lead to a high turnover of Apple Car executives leaving the company in 2021 – former software engineering manager Joe Bass was poached by Silicon Valley rival Meta, for example – but it's normal that regime changes would trigger a revolving door of new and departing employees. Now it looks like the Apple Car project has been shuttered completely, likely marking the end of speculation around Apple and driverless cars, at least for now. Axel is a London-based Senior Staff Writer at TechRadar, reporting on everything from the latest Apple developments to newest movies as part of the site's daily news output. Having previously written for publications including Esquire and FourFourTwo, Axel is well-versed in the applications of technology beyond the desktop, and his coverage extends from general reporting and analysis to in-depth interviews and opinion.  Axel studied for a degree in English Literature at the University of Warwick before joining TechRadar in 2020, where he then earned an NCTJ qualification as part of the company’s inaugural digital training scheme. Quordle today – hints and answers for Tuesday, March 26 (game #792) Qualcomm unveils S5 Gen 3 Sound platform with 'almost 50x more AI power' Scotland vs Northern Ireland live stream: how to watch 2024 international friendly online By Alex WhitelockMarch 25, 2024 By Luke HughesMarch 25, 2024 By Darren AllanMarch 25, 2024 By Kristina TerechMarch 25, 2024 By Mark WilsonMarch 25, 2024 By Mackenzie FrazierMarch 25, 2024 By Carrie MarshallMarch 25, 2024 By Hamish HectorMarch 25, 2024 By Sead FadilpašićMarch 25, 2024 By Chiara CastroMarch 25, 2024 By Muskaan SaxenaMarch 25, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}