{
    "title": "Apple Turned Its Epic Defeat Into Another App Store Victory",
    "date": "1/18/2024",
    "url": "https://www.wired.com/story/apple-epic-defeat-app-store-victory/",
    "text": "To revisit this article, visit My Profile, then View saved stories. Paresh Dave What can $83 million in legal defense fees buy? In Apple’s case, billions of dollars in annual App Store revenue that had been under threat until this week. While the iPhone maker’s costly legal battle started by developer Epic Games technically isn’t quite over, Apple looks mighty victorious after the US Supreme Court on Tuesday refused to hear Epic’s appeal of its losses. That means up to 30 percent of app developers’ sales will continue to flow into Apple’s pockets—just as they did before Epic picked a fight in 2020. That outcome adds to a glum picture for developers like Fortnite maker Epic, consumers, and governments from around the world that have been trying for years to loosen the restrictions Apple and Google maintain over downloading, paying for, and using apps on mobile devices. A handful of small victories in the US, Netherlands, and elsewhere have forced policy changes at Apple and Google and cost the companies some revenue. But overall Apple’s App Store and Google’s Play Store function much as they always have and retain their hold over businesses that want to reach customers on mobile devices. The few tweaks Apple and Google have made to their app stores in response to legal and regulatory pressure have not been overwhelmingly enticing to users or developers. Anyone who wants to download or offer a mobile app is essentially stuck with the two giants’ stores—and must comply with their rules. A jury last month found Google’s mobile store to be unlawfully monopolistic but the company will likely make appeals and is operating it essentially unchanged. After this week’s Supreme Court rejection, Apple put into effect a concession to comply with Epic’s lone victory in its legal fight, but added a new fee that developers say largely wipes out the potential benefits. Apple did not respond to a request for comment. Apple’s tweak allows developers selling apps in the US to link from their apps to purchase pages on their own websites. This practice was previously banned, locking developers into using Apple’s payments system and paying up to 30 percent of revenue to Apple. But to link out to alternative purchase options on their websites, developers must apply for permission and also offer in-app purchases through Apple’s billing system. And they have to certify that they have processes for handling billing complaints and that their payment processors meet what Apple calls “certain industry standards.” Apple then has to approve the wording used to link the alternative purchase options. Finally, when users click those links, they will encounter a full-screen warning that they are taking a risk by going into a world where Apple’s protections don’t apply. For any consumers brave enough to keep going and make a purchase, Apple will collect up to 27 percent of the revenue, via a newly created fee that extends the much-loathed levy that previously had been placed only on in-app purchases. Developers will have to provide “periodic accounting of qualifying out-of-app purchases” and allow Apple to audit their records, though it acknowledges that “as a practical matter … collection and enforcement will be exceedingly difficult and, in many cases, impossible.” Stephen Ornes Caroline Haskins Andy Greenberg Aarian Marshall The revisions provide developers “a meaningful opportunity” to do business outside of Apple’s billing system “while also enabling users to make an informed choice” about where to transact, attorneys for the company say in a court filing. The arrangement is similar to how Apple began allowing alternative purchase options—with a fee—in the Netherlands and South Korea to address government pushback. Google is testing a similar scheme in dozens of countries in response to developer complaints and regulators’ scrutiny. Epic and other developers critical of Apple, including Spotify and privacy-focused email provider Proton, are calling on Apple to make a stronger concession. They say that the costs of using their own billing tools and handling customer service would offset the slight reduction in the revenue share paid to Apple to complete sales outside of its system. \"Imposing a 27 percent fee for transactions made outside of an app on a developer’s website is outrageous and flies in the face of the court's efforts to enable greater competition and user choice,” Spotify spokesperson Jeanne Moran says. “Once again, Apple has demonstrated that they will stop at nothing to protect the profits they exact on the backs of developers and consumers under their app store monopoly.” Epic CEO Tim Sweeney says the company plans to contest Apple’s new rule in the court whose ruling the Supreme Court declined to review this week. Whether US district judge Yvonne Gonzalez Rogers will be receptive is uncertain. She sided with Apple on nine out of 10 charges in her original ruling and said she wanted to avoid micromanaging its business. Epic would have to prove Apple’s revised rules fail to increase competition, transparency, and consumer choice. Rebecca Haw Allensworth, a Vanderbilt Law School professor who’s followed Epic’s case, says it would be fair to call Apple’s new linking rule “bad faith” because it “basically recreates the system the courts found anticompetitive.” But though the judge wouldn’t want a remedy that undermines her ruling, it’s difficult to predict how she would rule on a challenge from Epic. A new set of appeals all the way to the US Supreme Court is possible. But the case turned on California’s unfair competition law, and the Supreme Court generally tries to stay out of state issues. Its taking up Epic’s appeal had been a long shot, says Herbert Hovenkamp, a University of Pennsylvania law professor with antitrust expertise. Further litigation also could be doubly expensive for Epic. Apple says in court papers that because it won 90 percent of the case, Epic should pay the same proportion of its $83 million and mounting in legal bills. Apple argues that’s required under the App Store developer agreement Epic signed when it began offering apps for Apple devices, and then later breached by trying to circumvent Apple’s payments rules. “Epic has no legitimate grounds to dispute the amount,” attorneys for Apple write. Developers including Spotify and Epic are holding out hope that Apple will have to cede more substantial ground by early March to comply with the EU’s Digital Markets Act, a new law requiring online gatekeepers to open their systems such as app stores to more competition. It’s unlikely any changes in response to the DMA would apply outside of the EU, though. After years of political, public, and legal pressure on Apple’s and Google’s app stores, they are looking as immovable and lucrative as ever. In your inbox: Will Knight's Fast Forward explores advances in AI This shadowy firm enables businesses to operate in near-total secrecy Scientists are inching closer to bringing back the woolly mammoth The first rule of the Extreme Dishwasher Loading Facebook group is … Phones for every budget: These devices stood up to WIRED’s testing Morgan Meaker Amanda Hoover Amanda Hoover Morgan Meaker Paresh Dave Morgan Meaker Will Knight Aarian Marshall More From WIRED Reviews and Guides © 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices "
}