{
    "title": "Apple Stock Is Still A Buy. Here's Why.",
    "date": "1/8/2024",
    "url": "https://investorplace.com/2024/01/apple-stock-is-still-a-buy-heres-why/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. The iPhone maker remains a leading technology company with the management team and resources needed to right the ship Advertisement Source: Eric Broder Van Dyke / Shutterstock.com Apple (NASDAQ:AAPL) is off to a difficult start in 2024 with several analysts downgrading the stock and news that the Justice Department is preparing an antitrust lawsuit against the iPhone maker. However, investors would be foolish to bet against AAPL stock. Long-term, the stock is still a safe bet. As recently as Dec. 13, AAPL stock closed at an all-time high of $197.96 on a split-adjusted basis. Throughout 2023, Apple’s share price rose 53% and added nearly $1 trillion in market value. At its peak last year, Apple’s market capitalization stood at $3.08 trillion, making it the most valuable publicly traded company in the world. That success now seems like a distant memory as Apple has been hit with multiple analyst downgrades to start 2024, pushing AAPL stock nearly 5% lower since Jan. 2. Barclays (NYSE:BCS) came out of the gate with a negative outlook for AAPL stock. The bank downgraded the stock to “underweight” (sell) and lowered its price target on the shares to $160, which was 17% lower than where the stock was at to start of the new trading year. Barclays cited concerns about soft demand for the company’s latest iPhone when issuing its downgrade. “Our checks remain negative on volumes and mix for iPhone 15, and we see no features or upgrades that are likely to make the iPhone 16 more compelling,” wrote Barclays.  Several other analysts followed Barclay’s lead and also downgraded Apple’s stock. News of the downgrades hurt investor sentiment surrounding Apple’s shares. Just as the analyst downgrades on AAPL stock were subsiding, The New York Times broke news on Jan. 5 that the U.S. Department of Justice is preparing an antitrust lawsuit against the company that is expected to be filed this year. Reportedly, the Justice Department lawsuit will target how the Apple Watch works exclusively with the iPhone, as well as the company’s iMessage service that is available exclusively on Apple devices. Apple’s payments system is also being scrutinized by the Justice Department. Reports of the antitrust lawsuit come weeks after the company was forced to temporarily halt sales of its Apple Watch Series 9 and Apple Watch Ultra 2 over a patent dispute. The U.S. International Trade Commission found that the company violated patents held by medical technology company Masimo (NASDAQ:MASI) related to a blood oxygen feature on certain models of the smartwatch. However, Apple was able to resume sales of the disputed watches after it appealed the Trade Commission’s ruling. For its most recent fiscal year, Apple reported smartwatch sales of $19.6 billion, comprising about 5% of the company’s total revenue. Clearly, Apple has entered some choppy waters to begin the year. However, investors shouldn’t count the company or its stock out. There are still many reasons to be bullish on AAPL stock with several near-term catalysts on the horizon. While sales of the company’s signature devices are slowing, notably the MacBook computer which posted a 34% year-over-year sales decline in the third quarter of 2023, Apple is not taking the situation lying down and is moving to diversify its business. In recent months, Apple has announced new microchips for its personal computers (PCs) and cut the price of its MacBook Pro laptop. The company is also shifting its manufacturing away from China and to other low-cost centers such as India. Apple has also moved up the planned release of its Vision Pro mixed-reality headset to February of this year. Unveiled last June and priced at $3,499, the Vision Pro is Apple’s first entirely new product since the Apple Watch was introduced in 2015. Plus, Apple continues to grow the revenue it is generating from the services side of its business which includes Apple TV and its payments business. In Q3 of this year, revenue from the company’s services came in at a stronger-than-expected $22.31 billion compared to forecasts of $21.35 billion. Services revenue grew 16% year-over-year. Apple’s gross margin for the quarter was 45.2% versus 44.5% that was expected, showing that the company remains highly profitable. Apple has $162 billion of cash on hand. Clearly, the New Year hasn’t gotten off to a great start for Apple. But despite the near-term headwinds, the company remains a best-in-class technology stock and its track record of returning value to shareholders is unmatched. After all, this is a company that buys back more of its own shares each year than any other publicly traded company. With strong management, ample cash, and new products and services coming to market, there’s every reason for investors to keep the faith. AAPL stock is still a buy. On the date of publication, Joel Baglole held a long position in AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia. Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/apple-stock-is-still-a-buy-heres-why/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}