{
    "title": "Apple (AAPL) Wins Record-Breaking 13 Academy Award Nominations",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/apple-aapl-wins-record-breaking-153600361.html",
    "text": "Apple AAPL has emerged as a major player in the movie industry thanks to impressive content. It recently won a record 13 Academy Award nominations, including ten for Killers of the Flower Moon.The Martin Scorsese directorial was the first Apple Original Films release to have a wider theatrical run, garnering roughly $150 million in global box office sales.Killers of the Flower Moon has garnered nominations across multiple categories, including Best Picture, Best Director and a historic nomination for Best Actress for Lily Gladstone, who has become the first Native American to be recognized in this category.The movie, set in the world of the Osage Nation, also earned nominations for Best Supporting Actor (Robert De Niro), Best Costume Design, Best Production Design, Best Original Score, Best Original Song, Best Film Editing and Best Cinematography.Indigenous artists Robbie Robertson and Scott George have also made history with their first-ever nominations in the Best Original Score and Best Original Song categories, respectively. Scott George, a member of the Osage Nation, became the first of his tribe to receive an Academy Award nomination.Moreover, Martin Scorsese's nomination for Best Director places him in the annals of history as the most-nominated living director, amassing a total of ten lifetime Academy Award nominations. Apple Inc. price-consensus-chart | Apple Inc. Quote Adding to Apple's triumph, Ridley Scott's epic feature Napoleon secured three nominations in the categories of Best Costume Design, Best Production Design and Best Visual Effects.This year's 13 nominations mark a significant milestone for Apple, more than doubling its previous record for Academy Award nominations in a single year. Since its launch just over four years ago, Apple has become one of the most-nominated studios for this year's Oscars.The historic nominations for Killers of the Flower Moon follow Apple's notable wins at the 2022 Academy Awards with CODA, making history as the first motion picture starring a predominantly deaf cast in leading roles to win Best Picture. The success continued in 2023 with The Boy, the Mole, the Fox and the Horse winning the Oscar for Best Animated Short Film.Killers of the Flower Moon has received widespread acclaim, earning nine BAFTA Film Award nominations and being named the Best Film of the Year by the National Board of Review. The film has accumulated over 200 accolades globally and has secured its place as the #1 Best Film of 2023 by notable publications such as The New York Times and The New Yorker. Apple recently added Killers of the Flower Moon to its streaming service, Apple TV+. The streaming service has been focusing on quality content amid intensifying competition from the likes of Netflix NFLX, Disney DIS and Amazon AMZN.Consumption of Apple TV+ doubled in 2023, per a report from Deadline cited by 9TO5 Mac. Total viewership surged 42% year over year.Movies and shows like The Family Plan, The Morning Show, Lessons in Chemistry, Messi Meets America, Slow Horses, For All Mankind, Silo, Hijack, Bad Sisters and Ted Lasso drove consumption.Mark Wahlberg-starrer The Family Plan, which premiered on Dec 15, became the most-viewed movie ever for the service since its launch. The latest season of Jennifer Aniston - Reese Witherspoon starred The Morning Show witnessed a viewership increase of 20% over the second season.Apple shares have outperformed Disney but lagged both Amazon and Netflix in the past year. While Apple has returned 37.4%, Amazon and Netflix have gained 61.3% and 45.3%, respectively. Disney shares have dropped 13.3%.Apple currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here. Disclaimer: This article has been written with the assistance of Generative AI. However, the author has reviewed, revised, supplemented, and rewritten parts of this content to ensure its originality and the precision of the incorporated information. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Netflix, Inc. (NFLX) : Free Stock Analysis Report The Walt Disney Company (DIS) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}