{
    "title": "Apple's Vision Pro's Path To Success",
    "date": "1/30/2024",
    "url": "https://www.forbes.com/sites/timbajarin/2024/01/30/apples-vision-pros-path-to-success/",
    "text": "The success of the innovative Vision Pro will rely heavily on robust and creative software. Looking back at Apple's history, its hardware successes were driven by software and the use of innovative designs and creative user interfaces to run these software programs. The original Apple I and II were each viewed as a hobbyist computer rather than a serious productivity tool during the first two years on the market. IBM executives panned it and never considered it to be anything but a hobbyist tool. However, that changed when a small Silicon Valley company, Visicorp, developed a software product called Visicalc. Visicalc was the first personal computer spreadsheet, and almost overnight, it turned the Apple II into a productivity tool that got the attention of all types of business users. Visicalc soon found its way into the offices of CFOs and their accounting teams, and the spreadsheet changed financial planning forever. Visicalc drove the Apple II into large and small businesses, putting Apple on most companies' computing roadmap. This combo of hardware with spreadsheet software became a threat to IBM's computer business and is why IBM created the original IBM PC in 1981. They saw it as threatening their core business of creating high-powered calculating machines. The Apple II, driven by Visicalc and other productivity tools that followed, started Apple down a path that Apple began to adopt quickly by using software to drive hardware sales. A second example of software driving hardware sales came after the Mac and a new piece of software from Aldus called Pagemaker came out. As I wrote in my 40th anniversary of the Mac column last week: \"When one looks back at how the Mac has influenced the history of computing, the introduction of Pagemaker on a Mac launched the desktop publishing revolution. By 1986, Macs, the Apple Laser Writer, and Pagemaker shook up the publishing industry and eventually changed personal computing forever. This tech trio elevated desktop publishing and delivered the Mac's second most significant impact on the computer market.\" The success of Apple's hardware is directly related to the role of software. The combination of innovative hardware with creative software will drive Apple's Vision Pro to succeed in the future. There is a significant difference in that Apple's success with the Apple II and Mac relied on software from third-party developers. With the Vision Pro device, Apple took proactive control by laying the significant groundwork for its success well in advance. In 2017, Apple introduced its AR Kit developers software program. AR Kit was initially designed for use on the iPhone and iPad in a 2D format. However, Apple had an innovative piece of hardware in the works that AR Kit would support seven years later, the Vision Pro. This software development kit is a big deal. I have always maintained that the most creative people in tech, besides the brilliant engineers of semiconductors, operating systems and UIs, are the software application developers. Indeed, software developers are at the heart of the success of most hardware and do not get the credit they deserve for the success of almost all digital products. As the Vision Pro hits the market this week, I am sure you will hear a lot of criticism and praise about this revolutionary XR headset. Some will call it a niche product. Others will disparage its $3500 price. Some who have tested it point out it is heavy in its weight. On the other hand, they also marvel at what it delivers and its capabilities. However, the Vision Pro is a new canvas for software developers to paint on and make it more useful for business, education, gaming, sports, entertainment, and, over time, for mainstream consumers. When software developers have great development tools, you can't underestimate their creativity and how their programs will drive the success of any hardware they support. (For our company's review of the Vision Pro click here) From the start, Apple has created essential software programs for the Vision Pro that highlight its capabilities. And it supports AR Kit apps as well. But imagine when thousands of Apple developers get their Vision Pros next week and begin a journey, driven by visionary thinking, of creating software that we can't even imagine today and helps drive us to the era of 3D, immersive computing that lies ahead.  "
}