{
    "title": "Tim Cook rise at Apple, from education to CEO",
    "date": "1/13/2024",
    "url": "https://www.businessinsider.com/tim-cook",
    "text": "       Tim Cook has helped Apple become the most valuable company in the world, with a market cap approaching $3 trillion. He's steered the tech giant through the death of Steve Jobs, multiple product launches, and the growth of Apple's subscription business. While Cook is globally recognized today as the leader of one of the most important tech companies, he came from a modest beginning. Cook was born in Mobile, Alabama, in 1960. His father, Donald Cook, was a shipyard worker and his mother, Geraldine Cook, worked at a pharmacy. He graduated from Alabama's Auburn University in 1982 with a degree in industrial engineering. After college, Cook worked at IBM for 12 years. While working at IBM, he earned an MBA at Duke by taking night classes. Cook was misdiagnosed with multiple sclerosis in 1996, an experience he said made him view the world in a different way. Since then, he's become known as a fitness buff. Cook left IBM and jumped into a COO role at a company called Intelligent Electronics. He eventually became vice president of corporate materials at Compaq, then one of the hottest PC manufacturers around. Meanwhile, Steve Jobs had just come into power as Apple's CEO, following the ouster of Gil Amelio. Jobs had the tough task of turning the company around after many years of fading relevance. He went looking for fresh blood for his executive team. Jobs approached Cook, identifying him as a strong prospect for the new Apple. Cook signed on to Apple in 1998 as SVP of worldwide operations. It must have been a difficult decision for Cook. In 1997, Apple was an industry laughingstock: Michael Dell, one of Microsoft's closest partners, once said that if he were in Jobs' shoes, \"I'd shut it down and give the money back to the shareholders.\" And experiencing Jobs' biggest flop first-hand just a few years later probably didn't make the transition easier, either: In 2000, Apple released the Power Mac G4 Cube, but the small PC, which Cook called an \"engineering marvel,\" never found its audience. But Cook said the \"spectacular failure\" taught him an important lesson in humility and intellectual honesty. \"This was another thing that Steve taught me, actually,\" Cook said during a visit to Oxford University in 2017. \"You've got to be willing to look yourself in the mirror and say, 'I was wrong, it's not right.'\" One of Cook's biggest early coups was closing Apple's own factories and warehouses and replacing them with contract manufacturers, meaning that devices could be made in larger quantities and get delivered faster. In 2005, Cook also started making investments that would lay the groundwork for the future of the company, including forming critical deals with manufacturers on flash memory, the computer-storage component that would form the basis for the iPhone and iPad. Cook's prescience meant that when competitors sought to build their own phones and tablets, they had to compete for what little factory capacity and components those factories could spare, after they had already fulfilled their commitments to Apple. Thanks to Cook's management expertise, his star within the company rose rapidly. Apple was on the track toward growth and big profits, and Cook got a lot of the credit. As his influence grew, Cook became known within the company for his no-mercy, relentless questioning style, his willingness to hold hours-long meetings, and his propensity for sending emails at all hours and expecting answers. In 2007, Apple introduced the iPhone — the device that would change everything. That same year, Jobs brought Cook closer to the core of the business by naming him COO. Related stories As COO, Cook helped run Apple's business and made more appearances at public events, getting out in front of executives, customers, partners, and investors. In 2009, Tim Cook was named interim CEO while Steve Jobs was on leave to manage his declining health. Jobs had been diagnosed with pancreatic cancer in 2003, and it was starting to take its toll. Cook even offered Jobs a portion of his liver, since they share a rare blood type. But Jobs refused, saying, \"I'll never let you do that. I'll never do that.\" In January 2011, Cook took over as interim CEO once again while Jobs was on medical leave. In August 2011, Jobs resigned his role to focus on his health — the board then named Cook the permanent CEO of Apple. When Jobs died in October 2011, Cook had the flags on the campus of Apple headquarters flown at half-staff in his memory. Cook reportedly considers the time following Jobs' death the loneliest time of his life. Cook told Stanford University's graduating class of 2019 that mentors can leave you prepared but not ready. Cook said that after Jobs' death, \"when the dust settled, all he knew was that he was going to have to be the best version of himself that he could be.\"  Cook had some big shoes to fill. The iPhone, especially, is an internationally beloved Apple product, and Jobs is held up as one of the greatest CEOs in history. \"His greatest gift ... was not a singular product, but rather Apple itself,\" Cook said of Jobs in 2017. Jobs once said that making things with \"a great deal of care and love\" is ultimately the thing that \"keeps Apple, Apple,\" and Cook has said that he believes Jobs' vision lives on everywhere in the company. In the months following Jobs' resignation and then his death, there was a lot of uncertainty over whether or not Apple could keep the momentum going under Cook. Though Cook was now in the limelight as CEO of Apple, he followed Jobs' example as a public figure and has remained intensely private when it came to his personal life, directing the attention as much as possible back on Apple. In 2014, though, Cook ended years of speculation by publicly announcing, in an editorial in Bloomberg Businessweek, that he was gay. That made Cook the first openly gay CEO of a Fortune 500 company. During his tenure as CEO, Cook has kept a lot of important Apple traditions alive, including appearances by rock stars, like the Foo Fighters at Apple's events, and Jobs' famous \"one more thing\" product announcements. In 2015, Apple released the Apple Watch, the company's first entirely new product in the post-Jobs era. And in 2016, Apple introduced AirPods, tiny wireless earbuds that have become a runaway hit and an important product for Apple's growth. The company has since released several upgraded versions of the buds — analysts estimate they're among Apple's best-selling products. Apple has also expanded its iPhone lineup under Cook, adding lower-cost iPhones like the iPhone SE, as well as more expensive \"pro\" models that cost more than $1,000. In recent years, Apple has expanded beyond hardware to focus on subscription services like Apple Music, Apple TV+, and Apple News+, services that help retain existing Apple customers. Apple's services division — as well as wearables — is now a major factor in fueling the company's growth. The latest product launch, though, under Cook was the Vision Pro. In June 2023, Apple unveiled the mixed-reality headset and said it was the \"most advanced personal electronics device ever.\" The headset, which is priced at $3,499, has 12 cameras and features a technology Apple calls \"Eyesight\" which allows someone approaching to see the face of the person wearing the headset. Vision Pro sales will begin February 2. In the last few years, Apple has seen some more high-profile execs depart: Apple's retail chief Angela Ahrendts departed in April 2019; Jony Ive, Apple's design chief and another of Jobs' close friends, left the company that June; and marketing chief Phil Schiller announced he was stepping down in August 2020, though he remains involved at Apple as a fellow. But the company's growth hasn't slowed — in fact, Apple's market cap has tripled since 2018. When Apple surpassed a $2 trillion market cap in 2020, it helped Cook reach billionaire status for the first time. In 2021, Cook received the 10th in a series of payouts from a deal he received when he took over as CEO. Cook lives in a $2.3 million home in Palo Alto, California, but rarely takes expensive vacations and doesn't own yachts or private planes like other tech CEOs. Like some of his fellow tech executives, Cook has pledged to give away most of his wealth. Matt Weinberger, Joey Hadden, and Avery Hartmans contributed to an earlier version of this report. Read next Jump to "
}