{
    "title": "Supreme Court declines to hear Apple-Epic antitrust case, meaning app \nmakers can now point customers to the web",
    "date": "1/16/2024",
    "url": "https://techcrunch.com/2024/01/16/supreme-court-declines-to-hear-apple-epic-antitrust-case-meaning-developers-can-point-customers-to-the-web/",
    "text": "The Supreme Court has denied both Apple and Fortnite maker Epic Games’ request to appeal a lower court’s ruling on the alleged anticompetitive nature of Apple’s App Store. The decision to not hear the case was a bit of a surprise, given that a jury trial recently found Google guilty in a similar antitrust battle with Epic. With the nation’s highest court refusing to weigh in on Apple’s status, that means the original ruling still stands. Apple had largely won its case, as the judge decided that Apple had not engaged in anticompetitive practices. However, there was one area where Apple would have to cede ground to developers, the court had ruled — it said that app makers should be able to steer their customers to the web from links inside their apps. This upset to Apple’s “anti-steering” rules for its App Store is what originally prompted the tech giant’s appeal. It does not want to allow app developers to market their own websites and payment mechanisms from inside iOS apps, which could reduce the purchases made on its App Store — and therefore Apple’s cut of developer revenues through its commissions. Developers, however, want to have a direct relationship with their customers. And for consumers, there may be a benefit to transacting on the web as the in-app purchases or subscriptions may be available for less than in the App Store, as the developer no longer has to pay the “Apple tax,” or commissions. In a statement, Epic Games’ CEO Tim Sweeney dubbed the Supreme Court’s decision to not take up the case as a “sad outcome for all developers,” but proclaimed that the “fight goes on.” “The Supreme Court denied both sides’ appeals of the Epic v. Apple antitrust case. The court battle to open iOS to competing stores and payments is lost in the United States. A sad outcome for all developers,” said Sweeney in a prepared statement. Now the District Court’s injunction against Apple’s anti-steering rule is in effect, and developers can include in their apps ‘buttons, external links, or other calls to action that direct customers to purchasing mechanisms, in addition to IAP,'” he continued. “As of today, developers can begin exercising their court-established right to tell U.S. customers about better prices on the web. These awful Apple-mandated confusion screens are over and done forever. The fight goes on. Regulators are taking action and policymakers around the world are passing new laws to end Apple’s illegal anticompetitive app store practices. The European Union’s Digital Markets Act goes into effect March 7,” noted Sweeney. The Supreme Court denied both sides’ appeals of the Epic v. Apple antitrust case. The court battle to open iOS to competing stores and payments is lost in the United States. A sad outcome for all developers. — Tim Sweeney (@TimSweeneyEpic) January 16, 2024  Apple in April 2023 had won its appeals court battle with Epic, the U.S. Ninth Circuit Court of Appeals ruled. The court upheld the district court’s earlier ruling related to Epic’s antitrust claims, but also the lower court’s judgment in favor of Epic under California’s Unfair Competition law, which will require Apple to remove the “anti-steering” clause from its agreement with App Store developers. The latter could potentially lead to a loss of billions in annual revenue for the tech giant if app makers can successfully redirect their customers to pay for purchases and subscriptions via the web. Apple investors immediately understood the impact of this decision, as Apple’s stock dropped over two and a half percent shortly after the news broke. It has since recovered slightly and is currently down by 1.09% as of the time of writing. “The Supreme Court’s decision not to take up Apple’s appeal confirmed that the company’s anti-steering policy is illegal, anti-competitive and must come to an end,” noted Rick VanMeter, executive director of the lobbying group Coalition for App Fairness, which includes Epic Games, Spotify, Tile, Match and others. “It’s a win that developers can now point their customers to their websites to make purchases, which will lower prices and increase consumer choice. This is a step in the right direction and highlights the need for legislation — like the Open App Markets Act — to create an open and free app store ecosystem,” he added. "
}