{
    "title": "China claims it has cracked Apple AirDrop’s encryption to identify senders",
    "date": "1/10/2024",
    "url": "https://www.cnn.com/2024/01/10/tech/china-apple-airdrop-encryption-hnk-intl/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter, which explores what you need to know about the country’s rise and how it impacts the world. A Chinese tech company has succeeded in cracking the encryption around Apple’s AirDrop wireless file sharing function to identify users of the popular feature, according to judicial authorities in Beijing. The company, Wangshendongjian Technology, was able to help police track down people who used the service to send “inappropriate information” to passersby in the Beijing subway, the city’s Justice Bureau said in a Monday statement. It had identified the senders’ mobile phone numbers and email addresses as part of an investigation following a complaint, the department said. Several suspects had been identified, it said, without giving details about the nature of the messages. AirDrop has been blamed for nuisance messages received by some commuters on subways and buses in Chinese cities. The popular wireless file sharing function was also reportedly used by protesters to spread anonymous messages critical of the Chinese government in the last few months of 2022. Wangshendongjian Technology “broke through the technical difficulties of anonymous traceability through AirDrop,” which “prevented the further spread of inappropriate remarks and potential bad influence,” the department said. CNN has reached out to Apple (AAPL) for comment. According to international media, including The New York Times and Vice World News, some residents in China used AirDrop, which can be used only between Apple devices, to spread leaflets and images echoing slogans used in a rare protest against Chinese leader Xi Jinping in October 2022. In 2019, AirDrop, which is effective only over short distances, was particularly popular among anti-government demonstrators in Hong Kong, who regularly used the feature to send colorful posters and artwork to subway passengers urging them to take part in protests. In November 2022, shortly after the protest against Xi, Apple began to limit AirDrop sharing with non-contacts for devices in China, which made it harder for users to share files with people they didn’t know. That feature was later expanded globally. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}