{
    "title": "5 huge challenges facing Apple this year",
    "date": "1/25/2024",
    "url": "https://www.cnn.com/2024/01/25/tech/five-big-challenges-apple-is-facing-in-2024/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Follow: Sales problems in China. Patent lawsuits in the US. Behind in generative AI. It’s only a few weeks into 2024, and Apple’s year ahead is paved with trouble. The tech giant’s barrage of challenges impact many parts of its overall business. Just last week, Microsoft took Apple’s spot as the most valuable publicly traded company, after trailing behind the iPhone maker for the better part of the last decade. Microsoft’s stock climb is due largely to its early and sweeping bets on generative artificial intelligence, an area in which Apple has largely remained mum. But some analysts believe the company will be able to navigate its way through the mounting minefields throughout the year. “Being Apple, which is still the largest company in the world by market cap, I’m sure it will do all it can to minimize the impact of these problem areas,” said David McQueen, a director at ABI Research. “It will still have an extremely loyal base of users so that its brand value and recognition, and quality are not compromised.” Here’s a closer look at what’s ahead for Apple: One of Apple’s biggest hurdles this year will be addressing the market in China, the world’s second-largest economy. The company has scrambled to attract iPhone customers in the country following the release of the wildly successful Huawei’s Mate 60 Pro smartphone. In a surprise move, Apple recently offered temporary discounts on its iPhones and other products in China, dropping prices about $70 for iPhones. (Macs and iPads were also heavily discounted). It’s normal for other sellers who carry Apple products to trim prices but the company itself rarely offers discounts. The move raised eyebrows about how well the iPhone is performing in one of Apple’s most critical markets, which drove about 20% of the company’s sales last year. A recent Reuters report noted iPhone sales in China dropped 30% in the first week of the year amid pressure from rival Huawei. Dan Ives, an analyst with market research firm Wedbush, called China both Apple’s biggest challenge and opportunity. Despite growing competition, he said China has about “100 million iPhones in the window of an upgrade opportunity.” One of Apple’s most popular products, the Apple Watch, remains currently banned in the US, as one of the most momentous patent disputes in quite some time continues to unfold. Last week, a US federal appeals court reinstated a ban on some of the more premium versions of the Apple Watch. Apple had requested a stay on the ban while it appealed a US International Trade Commission ruling that went into effect last month. That ITC order prevented Apple from importing the Apple Watch Series 9, Apple Watch Ultra 2 and other more recent models to the US because it was in violation of medical company Masimo’s pulse oximeter patent. Apple sold 49 million smartwatches in 2022 and about 26.7 million in the first 9 months of 2023. Although a ban will likely impact sales results, Jitesh Ubrani – a research manager at market research firm IDC – said its Apple’s reputation that’s also on the line. “It’s not a good look,” he said. “There may be an impact on sales in the first quarter of next year, but at the end of the day, no one wants to be caught infringing on patents.” It’s unclear how long the dispute will last or if Apple will settle the lawsuit. Major tech companies, including Microsoft, Meta, Google and Samsung, continue to roll out generative AI features to their services, computers and smartphones. However, Apple has been largely quiet on the topic. The company is rumored to introduce new Siri features powered by AI in the release of iOS 18 later this year. Some on-device generative AI features also could become exclusive to iPhone 16 models, thanks in part to its custom chips. But AI innovations on flagship smartphones isn’t entirely novel. Google’s latest Pixel 8 lineup, which launched in October 2023, already has many AI features, and Samsung’s Galaxy S24 lineup, which hits shelves later this month, packs AI-powered tools such as real-time translation, generative AI-powered search and updated photo editing features. The push around AI is part of a greater effort by smartphone makers to differentiate themselves in a crowded market and drum up excitement where innovation has largely stalled in recent years. Although it’s unlikely consumers will switch to other brands specifically for AI features, people will eventually come to expect Apple to deliver similar or more advanced features. This isn’t the first time Apple has lagged in emerging areas, such as 4G, 5G and foldable screens – none of which caused significant setbacks. McQueen said although Apple’s competitors, namely Samsung, will have bragging rights and “be able to point out this AI weakness,” he questioned if customers really know what they’re getting with on-device AI and why it’s worthy of an upgrade. At the same time, iPhone adoption remains strong. Market research firm IDC recently released data that revealed Apple passed Samsung in smartphone shipments last quarter for the first time. The pressure is on Apple to boost sales across its other product categories. In November, Apple posted year-over-year sales declines for the fourth quarter in a row, struggling in particular with Mac and iPad sales. iPhone revenue, however, grew 3% to $43.8 billion. Still, Barclays downgraded Apple stock earlier this month citing disappointing iPhone 15 sales in China and softening demand for the latest iPhone. The next-generation iPhone 16 due out later this year is expected to have only incremental upgrades, as well. Apple also faces challenges around the upcoming rollout of the Vision Pro headset, which will be its riskiest product launch in years. The company will have to prove a device that blends both virtual reality and augmented reality, a technology that overlays virtual images on live video of the real world, is indeed the future of computing. And it won’t be an easy sell: While innovative, it’s still a $3,499 clunky computer you wear on your face. A handful of major tech companies deemed by the EU to be dominant “gatekeepers,” including Apple, will have to implement new platform rules this year. That means Apple may have to give up exclusive control of how iOS apps are distributed, a move that could ultimately impact its revenue. The new Digital Markets Act (DMA), which passed in 2022, aims to bolster online services competition. Some of the most visible proposed changes for EU users involve apps, such as how you can install them and what can be pre-installed on devices. One change will require dominant operating systems to allow smaller, third-party app stores to exist, as well as the ability to install apps from anywhere outside the official app store. Although Google has allowed for both on the Android platform, Apple has maintained tight control over iPhone apps. Apple and other industry players have argued that opening up operating systems in this way could leave users vulnerable to downloading more harmful apps. Under the new rules, dominant app stores won’t be able to de-list apps for refusing to use the gatekeeper’s proprietary payment systems, an issue highlighted most recently by Apple’s antitrust case with Epic Games. Much of Apple’s app store revenue comes from the 30% cut it receives through its payment channels from in-app sales of digital goods and services, so the provisions could directly affect the company’s business model. This month, the US Supreme Court declined to hear an appeal by Apple and Epic in the case, leaving in place a lower-court ruling finding that Apple illegally monopolized app distribution. The decision not to hear the case also effectively upheld an injunction requiring Apple to modify some of its developer terms. The company hasn’t shared too many other details about it plans to comply with the legislation but the early March deadline is soon approaching. CNN’s Brian Fung and Clare Duffy contributed to this report Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}