{
    "title": "Wall Street Breakfast Podcast: AAPL Settles Gift Card Lawsuit",
    "date": "1/4/2024",
    "url": "https://seekingalpha.com/article/4661114-wall-street-breakfast-podcast-apple-reportedly-settles-gift-card-scam-lawsuit",
    "text": "Nikada/iStock Unreleased via Getty Images  Nikada/iStock Unreleased via Getty Images Listen below or on the go on Apple Podcasts and Spotify  Apple (AAPL) to settle suit related to iTunes gift card scam - report. (00:23) TikTok (BDNCE) sets sights on Amazon (AMZN) with goal of growing e-commerce tenfold. (01:46) CVS to drop Humira (ABBV) from certain formularies, cover biosimilars instead. (02:36) This is an abridged transcript of the podcast. Apple (NASDAQ:AAPL) has agreed to settle a lawsuit which alleged that the company knowingly let scammers exploit its gift cards, and keep the stolen funds for itself. According to the Reuters report, Apple and the plaintiffs agreed on material settlement terms after working with a mediator, the report added citing a filing in federal court in San Jose, California. The issue involved scammers who insisted that victims buy App Store and iTunes gift cards to pay for things like taxes, hospital bills, utility bills, bail and debt collection. Victims were then told to share the codes on the backs of the cards, in spite of a warning sign on the cards which reads, \"Do not share your code with anyone you do not know.\" As per the complaint, Apple would typically deposit about 70% of the stolen funds into the scammers' bank accounts, and keep about 30% for itself as a \"commission\" for knowingly converting stolen codes into dollars. According to the complaint, the victims likely lost \"hundreds of millions of dollars\" in the fraud. The lawsuit covered anyone in the U.S. who bought gift cards redeemable on iTunes or the App Store between 2015 and July 31, 2020 and provided codes to the scammers, and did not receive refunds from Apple. A draft for a formal settlement is being prepared to be presented for preliminary approval. In June 2022, a judge denied Apple's efforts to dismiss the lawsuit. ByteDance's (BDNCE) TikTok is aiming for 10x the merchandise volume of its U.S. e-commerce business to as much as $17.5B in 2024. Bloomberg reports that TikTok is looking to take a piece of a market that is currently dominated by Amazon (AMZN). The majority of TikTok's revenues come from Southeast Asia. The firm is currently looking to increase sales in the US and Latin America. TikTok Shop is one of the fastest-growing features for ByteDance (BDNCE). ByteDance revenue climbed about 30% in 2023 to more than $110B, surpassing projections. Recently, in a $1.5B agreement, TikTok bought a 75% stake in GoTo Group's Tokopedia e-commerce division in Indonesia. CVS Health (NYSE:CVS) said that its Caremark unit will remove AbbVie’s (NYSE:ABBV) Humira from its major national commercial formularies on April 1 and cover biosimilars of the product instead. The company said Humira will still be included in its Choice and Standard Opt Out commercial formularies. CVS added that AbbVie has agreed to supply a “committed” volume of Humira co-branded with CVS’ new Cordavis biosimilar unit. CVS launched Cordavis last August. On our catalyst watch for the day, Standard BioTools (LAB) and SomaLogic (SLGC) holders are scheduled to vote on the merger, which has seen opposition from several SomaLogic holders. Goldman Sachs Energy Conference includes participation from Plug Power (PLUG), Phillips 66 (PSX), EOG Resources (EOG) and SolarEdge Technologies (SEDG). Costco (COST) reports sales results. Other articles to look out for on Seeking Alpha: Microsoft adds Copilot AI button in first big change to PC keyboard in decades Mark Zuckerberg sold $428M worth of Meta stock at the end of 2023 Piper Sandler downgrades Apple on iPhone sales and macroeconomic worries Major market averages closed on Wednesday to the downside. The Nasdaq (COMP.IND) ended lower by 1.18%, the S&P 500 (SP500) finished in the red by 0.8%, and the Dow (DJI) ended lower by 0.76%. eight of the eleven S&P sectors ended lower, led down by Real Estate. The three areas that were able to pull out gains were Energy, Communication Services, and Utilities. The 10-year Treasury yield (US10Y) dipped 2 basis points to 3.90%. At the same time the 2-year Treasury yield (US2Y) was near even at 4.32%. The FOMC minutes from the Dec. 12-13 meeting were released Wednesday. The minutes show that Federal Reserve officials believe interest-rate cuts will likely start in 2024, though the policy path is highly uncertain. Several members noted that keeping the benchmark rate at an elevated level might be necessary should inflation stay above target. Now let’s take a look at the markets as of 6 am. Ahead of the opening bell today, Dow, S&P and Nasdaq futures are in the green. The Dow is up 0.16%, the S & P 500 is up 0.12% and the Nasdaq is up 0.16%. Crude oil is up 0.8% at more than $73 per barrel. Bitcoin is down 1.4% and above $43,000. In the world markets, the FTSE 100 is up 0.16% and the DAX is up 0.23%. The biggest movers for the day premarket: FuboTV (NYSE:FUBO) is up 4.8% following the announcement of a new multi-year distribution agreement with Nexstar Media (NXST). On today’s economic calendar: 815 ADP jobs report 830 initial jobless claims This article was written by "
}