{
    "title": "Meta will benefit from Vision Pro in many ways, here's how",
    "date": "1/29/2024",
    "url": "https://mixed-news.com/en/vision-pro-benefits-for-meta/",
    "text": "Meta is reportedly optimistic about Vision Pro because it will benefit in several ways from Apple's entry into the market. The Vision Pro is launching on Friday. Apple's entry is the most significant event in the VR industry in the past decade, comparable only to Facebook's acquisition of Oculus in 2014, as I wrote in an initial analysis of Vision Pro shortly after its announcement. No one has believed in and invested as much in the future of this technology as Meta. At least $50 billion has already been invested in research and development, and Mark Zuckerberg said in a recent interview that he plans to continue investing $15 billion a year in this area. No one has been able or willing to match that level of investment, which is why Meta dominates the VR market today. The company has sold well over 20 million Quest headsets and created by the most profitable VR ecosystem for developers. The competition gave way: HTC focuses mainly on enterprise customers, Sony is shying away from bigger investments, and Bytedance more or less shut down its VR business. Apple could be Meta's first major competitor. Vision Pro is not a rushed product, as we have seen from many other manufacturers who have dabbled in VR over the years. The device has been in development for nearly a decade, has cost billions of dollars, and is technically superior to most headsets on the market today. Apple is also said to be preparing a more affordable second-generation device. So it looks like Apple is serious about its major new hardware category. Whether Meta will have to fear Apple remains to be seen in the coming years. Currently, Vision Pro and Meta Quest are very different products in terms of price, scope, and functionality. For now, Apple's entry into the market has mostly positive consequences for Meta. Its executives are optimistic that Apple Vision Pro will validate Mark Zuckerberg's Metaverse gamble and draw more consumers, writes the Wall Street Journal, citing people familiar with the leadership team's thinking. Zuckerberg and CTO Andrew Bosworth have been saying for years that at least one strong competitor could offer a huge boost to the market, they say. Check your inbox or spam folder to confirm your subscription.  Meta employees see Quest and its software ecosystem as an alternative to Apple that could become the Android counterpart in the coming headset wars, the sources said. But Google is likely to have a say in the matter, as it is working with Samsung on its own Vision Pro competitor, which, unlike Meta so far, could be granted access to the Google Play store. Right now and for the foreseeable future, Meta serves the lower price segment, while Apple sells a high-priced premium product. The price difference between these headsets is huge, and many people considering a headset for the first time after trying out the Vision Pro are more likely to opt for a Quest 2 or Quest 3 for monetary reasons. So this is a win for Meta, not Apple. But Meta also benefits from the new competitor in another important way: Apple's UX design could provide a blueprint for Meta's system software, which has always been weak in this area, and the product could set the pace in other ways as well. The Wall Street Journal's sources say that the Vision Pro rumors have influenced Meta's approach to both technology and marketing. Indeed, the company has shifted from the metaverse concept to mixed reality, and Quest Pro and Quest 3 could be interpreted as indicators of this rethinking. From all this we can conclude that Apple's entry into the market will be good for the current quasi-monopolist Meta and the industry as a whole: through the influx of new design ideas, consumer groups, developers, and investors. Meta will no longer have to shoulder the efforts in this area alone, and a sigh of relief should be the prevailing feeling at Meta for the time being. Note: Links to online stores in articles can be so-called affiliate links. If you buy through this link, MIXED receives a commission from the provider. For you the price does not change. Check your inbox or spam folder to confirm your subscription.  "
}