{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.citizen.digital/news/apple-employs-23000-kenyans-in-nairobi-ruto-now-says-n336615",
    "text": "File image of President William Ruto. | PHOTO: PCS President\nWilliam Ruto hailed the strides Kenya has made in the technology sector in his\nspeech at the World Governments Summit in Dubai, UAE, on Tuesday. He\ntold delegates that during his trip to the United States in September last year\nfor the U.S.-Kenya Business Roadshow, Tim Cook, the CEO of the American tech\ngiant Apple, told him that the multinational employs about 23,000 Kenyans in\nNairobi. Ruto\nsaid this while drumming up support for the digital economy, which he termed a\nsource of remote opportunities for young people who do not need to leave their\nhomes. “The\ndigital economy is delivering attractive opportunities for young people, to\nwork for employers scattered across the world without having to leave their\nhomes in Kenya,” Ruto noted. “When\nI visited Silicon Valley last year, Apple’s Tim Cook informed me that his\ncompany now employs about 23,000 Kenyans, all working from Nairobi.” Citing\nhis encounter with a college student he said he met in the rural village of\nKaiboi in Nandi County, who works remotely for a Germany-based AI company, Ruto\nsaid his focus on the possibilities from the combined energy, technology and\nthe potential of Kenyan youth is sharper. “We\nmust not allow a fear of future unknown to deprive brilliant youngsters like\nBrian of opportunities. If we sacrifice the benefits of progress hoping for\nsecurity, we risk losing both,” he said. Ruto\npraised Kenya as a regional leader in technological advancement and termed the\nM-Pesa mobile banking platform a proud home-grown innovation. “In\nKenya, we understand that the soul of innovation is the constant endeavour to\nmeet public demand by providing solutions to problems, efficiently delivering\nservices and transforming challenges into productive opportunities,” he said. On\nthe governance front, Ruto noted that his administration is determined to\ndigitise all government processes and automate public services to make them\naccessible to citizens at their convenience. “In\nthe last year, we increased the number of digitally accessible government\nservices from 5 per cent to over 80 per cent. The goal is to make the\ngovernment 100 per cent digital by the end of this year,” he said. Apple\nemploys about 160,000 people globally. Following\nhis U.S. roadshow which was meant to highlight the business and investment\npotential in Kenya's booming tech sector, President Ruto sparked debate after\nsaying he had struck an agreement with Apple and other top Silicon Valley names, which would see these corporations give Kenyans hundreds of thousands of what he\ndescribed as digital jobs. “I\nvisited Google, Intel and Apple. All these companies are looking for online\nworkers,” said Ruto then.  Without\ngetting into specifics of which corporation promised to employ what number of\nworkers, the president at the time added; “They want us to give them 100,000, 200,000 and\n300,000 workers out of the Kenyan youth.” Want to send us a story? Submit on \n                Wananchi Reporting on the Citizen Digital App or Send an email to\n                wananchi@royalmedia.co.ke or Send an\n                SMS to 25170 or WhatsApp on \n                0743570000   No comments yet. © 2024 Citizen Digital. All rights reserved. "
}