{
    "title": "Steve Jobs Wanted Apple Employees To 'Bond' By Wearing A Uniform So He Had \nA Vest Designed For Them — 'Oh ...",
    "date": "2/26/2024",
    "url": "https://finance.yahoo.com/news/steve-jobs-wanted-apple-employees-183416537.html",
    "text": "The late Steve Jobs, the visionary co-founder and former CEO of Apple Inc., not only transformed technology but also became an icon himself, partly because of his signature look — a black turtleneck, Levi’s 501 jeans and New Balance sneakers. His distinctive style has its origins in a story that intertwines Jobs’s admiration for Japanese design and his relationship with fashion designer Issey Miyake. Jobs’s visit to Sony Group Corp. in the 1980s sparked the idea of creating a uniform for Apple employees. In Walter Isaacson’s biography of Jobs, this moment is captured with a detailed account of how Jobs was inspired by the uniformity and sense of belonging among Sony’s workers, leading him to pursue a similar vision for Apple. Don't Miss: Copy and paste Mark Cuban’s startup investment strategy according to his colorful portfolio. This startup is accepting investors for as little as 25 cents – what’s the catch? “He looked very ashamed and told me that after the war, no one had any clothes, and companies like Sony had to give their workers something to wear each day,” Jobs said of then Sony Chairman Akio Morita. According to the biography, the Sony uniform was a taupe nylon jacket, distinguished by its innovative and functional design, which features a standout characteristic: The sleeves can be detached from the shoulders with a zipper, transforming the garment into a sleek vest. Motivated by this concept, Jobs reached out to Miyake, hoping to instill a similar sense of identity at Apple. “I decided that I wanted that type of bonding for Apple,\" Jobs said. \"So I called Issey and asked him to design a vest for Apple. I came back with some samples and told everyone it would be great if we would all wear these vests. Oh man, did I get booed off the stage. Everybody hated the idea.\" Trending: Average retirement income in America has been revealed – Will you make enough each month? Although the idea of an Apple uniform was not embraced by employees, it opened a new chapter in Jobs’s style and his friendship with Miyake. Despite the initial rejection, Jobs found a personal uniform that suited him, saying, “So I asked Issey to make me some of his black turtlenecks that I liked, and he made me like a hundred of them.” Jobs’ choice of a personal uniform was more than a fashion statement; it was a reflection of his approach to work and life. The simplicity and consistency of his attire mirrored his philosophy of focusing on what truly mattered. By eliminating the daily decision of what to wear, Jobs could concentrate more on his work and the innovative endeavors at Apple. When Jobs died in 2011, he left behind a world transformed by his vision. His influence continues to resonate, not just in the products Apple creates but in the way people think about technology and its role in their lives. Jobs’s story — a blend of innovation, personal branding and unconventional thinking — is a lasting inspiration for future generations. His distinct personal uniform was a visual reminder of his commitment to challenging the status quo and making a mark on the world. Read Next: Harvard-founded AI startup is solving paywalls, growing 5x yearly and looking for new shareholders. If the average American household is a millionaire, why do people feel so broke? \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article Steve Jobs Wanted Apple Employees To 'Bond' By Wearing A Uniform So He Had A Vest Designed For Them — 'Oh Man, Did I Get Booed Off The Stage. Everybody Hated The Idea' originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}