{
    "title": "Former Apple CEO John Sculley Compares Apple Vision Pro To iPhone: 'What \nTim Cook And His Team Have Done",
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/general/entertainment/24/02/36948605/former-apple-ceo-john-sculley-compares-apple-vision-pro-to-iphone-what-tim-cook-and-his-tea",
    "text": "John Sculley, the former CEO of Apple Inc AAPL, recently praised the company’s latest product, the Apple Vision Pro, comparing it to the revolutionary iPhone. Sculley’s comments come amidst a wave of positive reviews and high expectations for the new device. What Happened: In an interview with Fox Business, Sculley lauded the Apple Vision Pro, stating that it is on par with the iPhone in terms of its impact on the tech industry. He also commended the Apple team, led by current CEO Tim Cook, for their work on the new product. “What Tim Cook and his team have done is more than extraordinary,” Sculley said. He also mentioned that the Vision Pro surpasses the Oculus, a product by Meta Platforms Inc., in terms of user experience. “I worked with Steve Jobs back when he was creating the Macintosh, and so I know what you go through with developing a whole new user experience,” Sculley said Monday on “The Claman Countdown.” See Also: Jeff Bezos Closer To Replace Elon Musk As World Richest Person? Amazon Co-founder Plans To Sell 50M Shares Worth Over $8.6B Amid Stock Surge The Apple Vision Pro is the company’s first new product in seven years and was launched at the flagship Apple Store in New York City. Despite some initial controversy, including an arrest related to the product, Sculley believes that the Vision Pro will have a significant impact on Apple’s overall value. Why It Matters: The Apple Vision Pro has been a major topic of discussion in the tech industry since its announcement. The device, which is a mixed-reality headset, has been praised by analysts for its unique and immersive experience. Some analysts have even suggested that a future version of the Vision Pro could potentially replace the iPad. Apple’s decision to equip the Vision Pro with a suite of Microsoft Corp apps also indicates the company’s vision for the device as a productivity tool. This strategic move aligns with Apple’s broader approach to integrating its products into professional and creative workflows. CEO Cook has also expressed his excitement about the Vision Pro, describing it as “mind-blowing” and emphasizing the device’s potential to revolutionize the way we experience content in a 3D world. Read Next: Mark Zuckerberg ‘Just Getting Started,’ Says Ives. Munster Says ‘Not Too Late’ To Buy Meta Photo courtesy: Shutterstock Engineered by\n        Benzinga Neuro, Edited by\n        \n\n              Kaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the\n        extensive Benzinga Ecosystem, including native data, APIs, and more to\n        create comprehensive and timely stories for you.\n        Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}