{
    "title": "Soulja Boy Shares Creative Suggestion For How To Use Apple Vision Pro",
    "date": "2/11/2024",
    "url": "https://hiphopdx.com/news/soulja-boy-apple-vision-pro",
    "text": "editions Copyright © 2024 HipHopDX All Rights Reserved AD LOADING... Soulja Boy is having great time with his new Apple Vision Pro, and it didn’t take long for his mind to wander into NSFW territory. On Friday (February 9), the “Crank Dat” hitmaker went live on social media and shared real-time commentary about his experience with the hottest gadget on the market right now. AD LOADING... “Imagine watching porn on this joint,” he said, reading aloud a viewer’s comment. “Yo, all your whole photo albums come on here, so imagine the flicks you got in your phone — I was just watching that shit in 3D like, ‘Oh my God!’ “Chat, when y’all get this shit, whatever flicks y’all got on y’all phone, y’all gotta watch that shit on the Apple Vision — I’m telling you! This shit look 3D. Nah, this shit is crazy, this shit is crazy.” AD LOADING... He added: “You can make this shit full screen! I had the whole flick covering the whole room — you could see was me on that going crazy!” Soulja Boy shares creative suggestion for how to use Apple Vision Prohttps://t.co/GhwssN2YOh(via @livebitez) pic.twitter.com/jbY3MWtuPs — HipHopDX (@HipHopDX) February 10, 2024  Soulja Boy isn’t the only artist who is taken aback by the features of Apple’s latest item — T-Pain recently tried it out as well and is also a fan of the virtual-reality device. Earlier this week, the Florida native posted a social media video of himself walking around wearing an Apple Vision Pro over his eyes with a review that could easily pass as an advertisement for the multinational tech company. related news February 6, 2024 “Y’all thought y’all was going to leave me in this mundane, bad graphics-havin’ ass, boring, no color-havin’ ass reality,” he began. “You’re sadly mistaken. You got another thing coming and I’m calling the cops ’cause you fit the description of a hater. “I’m just letting you know — y’all ain’t leaving me behind in this terrible-looking world. I’m going forever, I’m wearing this bitch everywhere — it’s over. Ya’ll shut down Google Glass because ya’ll said ain’t nobody going to wear them damn glasses with the little Dragon Ball Z thing on the side of it.” AD LOADING... Additionally, Kid Cudi has also been having fun with the product as he tweeted over Grammy weekend: “I was invited to a grammy after party, I looked outside at this end of days rain, then looked at my Vision Pro. Ima have to miss dat party.” Cassidy Sets Record Straight On Rumor He Ghostwrote Benzino's Eminem Diss Tracks news | Mar 26, 2024 50 Cent Trolls Diddy & Meek Mill With Donald Trump N-Word Deepfake news | Mar 26, 2024 Drake's Dad Shades Future, Metro Boomin & Kendrick Lamar Over 'We Don't Trust You' Shots news | Mar 26, 2024 Coming Soon... After These Messages  AD LOADING... AD LOADING... Copyright © 2024 HipHopDX All Rights Reserved "
}