{
    "title": "Apple hits the brakes on ambitious car venture Project Titan: Dave Lee",
    "date": "2/29/2024",
    "url": "https://www.biznews.com/tech/2024/02/29/apple-hits-brakes-project-titan-dave-lee",
    "text": "  In a decade-long saga of speculation, from augmented reality to smart seat belts, Apple’s venture into the automobile world, dubbed Project Titan, has hit a roadblock. Reports suggested ambitions to rival Tesla and even collaborate with McLaren on a supercar. However, according to Bloomberg News, Apple has decided to abandon the project, redirecting resources to artificial intelligence. Amidst concerns about profitability and leadership changes, the Apple Car dream comes to a halt, leaving only CarPlay as the company’s road presence. Sign up for your early morning brew of the BizNews Insider to keep you up to speed with the content that matters. The newsletter will land in your inbox at 5:30am weekdays. Register here. By Dave Lee What could Apple have done with the humble automobile? ___STEADY_PAYWALL___ Ideas, some credible and others less so, have dripped out for a decade. For a time, the company was rumored to be working on something small based on BMW’s i3. Then it was said to actually be a van. With augmented reality, a new kind of battery and smart seat belts. Reports suggested a desire to leapfrog Tesla and go straight to full self-driving — and it was granted permission to test its technology on California roads. It was looking at building charging infrastructure. So insatiable was the appetite for any news on the car, Apple watchers had started to pay attention to the kinds of vehicles bought by Apple executives to see whether there were any signs as to their tastes and the project’s probable direction. My favorite report of all was that Apple had looked into a deal with the legendary motor group McLaren, signaling the Apple car might one day be a true supercar. A British one, no less. I could just picture it making its debut in a Bond movie: a tuxedoed Daniel Craig flirting with Siri to open the door to let him out. Alas, we’ll never know what could have been. Apple’s decision to scrap its car project, according to reporting from Bloomberg News’ Mark Gurman, brings everyone’s favorite Silicon Valley rumor to an anti-climatic but sadly predictable end. Apple’s presence on our roads will remain limited to CarPlay, its in-car software. Some of the company’s 2,000 workers on the project — named Titan — will be reassigned to work on artificial intelligence, Gurman wrote. Others will have to apply for other positions; some will be laid off. In this era of cost-cutting across the tech business, the Apple Car was a distraction that could no longer be justified, not when the needs of AI must take priority, with Apple seen as a laggard. Indeed, that Apple should bother making a car was always a difficult sell at the best of times. The large margins it enjoys on its hardware could not possibly be replicated, and the ordeal of putting a vehicle into production would have daunted even Tim Cook, for whom complex supply chains are a speciality. The initial struggles of Tesla, and costly abandonments of other car projects, such as Dyson’s, would have always been front of mind — and slowing growth in the sector made pushing ahead an even bigger risk. Indecision over the road the Apple Car should have taken seemed to be at the root of its problems. Leadership changes were frequent. Big-name former Tesla executive Doug Field joined Apple only to leave for Ford three years later. Project Titan was a project troubled — an unkind take is that the company has thrown billions of dollars down the drain through mismanagement and a lack of clear vision. Then again, Apple’s share price would rise handsomely whenever there was even a slither of news about the car’s existence — and it wouldn’t fall back when those rumors failed to materialize. Details of the project’s cancellation barely moved the company’s stock when reported on Tuesday. Despite today’s news, there will always be, I suspect, rumors of an Apple Car being worked on somewhere in the bowels of Cupertino or some mystery location. Hazy details will be spoken about the same way we speculate about specimens at Area 51, or the whereabouts of Lord Lucan. But any expectations that something would hit the road before the end of this decade have now been dashed. The Apple Car, sadly, is canceled. Read more: © 2024 Bloomberg L.P. Listen to the story of Cyril Ramaphosa's rise to presidential power, narrated by our very own Alec Hogg. Narration by Alec Hogg BizNews © 2024 BizNews, Inc. | The Rational PerspectiveTerms & ConditionsComments Policy "
}