{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.investopedia.com/dow-jones-today-02152024-8582133",
    "text": "Colin is an Associate Editor focused on tech and financial news. He has more than three years of experience editing, proofreading, and fact-checking content on current financial events and politics. He received his M.A. in journalism from The New School and his B.A. in history and political science from McGill University. Update—Feb. 16, 2024: For today's live markets coverage, see here. Stocks rose Thursday after data showed U.S. consumers reined in spending more than expected in January. The Dow Jones Industrial Average rose 0.9% Thursday to recover nearly all of Tuesday's CPI sell-off. The S&P 500 rose 0.6% and the Nasdaq Composite ticked up 0.2%. Retail sales decreased 0.8% in January, more than the 0.2% contraction economists were expecting. U.S. consumers have consistently surprised economists with their willingness to spend in the face of higher costs, rising rates, and an uncertain economic outlook. Cisco (CSCO) shares fell after the networking giant said it would cut 5% of its workforce, or about 4,250 jobs. Paramount (PARA) and Apple (AAPL) shares slid after Warren Buffett's Berkshire Hathaway cut its stakes in the longtime holdings. Stocks advanced yesterday, rebounding slightly from Tuesday's sell-off following a hotter-than-expected inflation report. Equity Indexes Wrap: Tech Rally Hits a Wall; Energy, Financials Boost the Dow The Dow Chevron (CVX) rose 3.4%, benefiting from rising oil prices and evidence Warren Buffett’s Berkshire Hathaway added to its stake in the company. Financials outperformed, with JPMorgan Chase (JPM) gaining 2.2% and Goldman Sachs (GS) rising 2%. Cisco Systems (CSCO) fell 2.4% after the networking company offered softer-than-expected earnings guidance and said it would cut about 5% of its workforce. Apple (AAPL) slid 0.2% after Berkshire’s 13-F revealed it trimmed its approximately $170 billion stake in the tech giant in the fourth quarter. The S&P 500 CBRE Group (CBRE) gained 8.5% after topping fourth-quarter earnings estimates. Wells Fargo (WFC) jumped 7.3% after federal regulators relaxed oversight of the company’s sales practices, citing progress the firm has made on risk management since the order was imposed in 2016 following a fake accounts scandal. West Pharmaceuticals (WST) sank 14.1% after offering disappointing 2024 sales guidance. Deere & Colin. (DE) slid 5.2% after lowering its full-year earnings forecast. The company said it expects customers to replenish fleets this year at a slower pace than expected. Paramount Global (PARA) lost 4.6% after Berkshire Hathaway trimmed its stake in the entertainment company. The Nasdaq 100 Tesla (TSLA) surged 6.2%, rebounding slightly from a month-long sell-off. Shares have lost about 20% of their value so far this year. DoorDash (DASH) advanced 5.2% ahead of its earnings report after the bell. Diamondback Energy (FANG) rose 5.1%, continuing to gain after jumping Monday on news of its planned merger with Endeavor Energy. Datadog (DDOG) led the index’s laggards, falling 3.2%. Alphabet (GOOGL) slid 2.2% following reports OpenAI was developing a web search product to compete directly with Google. Nvidia (NVDA), which yesterday overtook Alphabet as the third-most valuable U.S. company, slipped 1.7%. Wells Fargo Stock Jumps as Regulators Relax Oversight Following 2016 Fake Accounts Scandal Shares of Wells Fargo (WFC) jumped Thursday after the Office of the Comptroller of the Currency (OCC) terminated a consent order against the bank that had been in place since 2016 when federal watchdogs accused the company of illegal sales practices, including opening millions of accounts without customers' knowledge. “The OCC believes that the safety and soundness of the Bank and its compliance with laws and regulations does not require the continued existence of the Order,” according to an OCC order published Thursday. The order, imposed in September 2016, required the bank to revamp its sales and risk management practices under the supervision of regulators. Investigations following the 2016 order revealed pervasive risk management issues at the bank, leading the Federal Reserve in 2018 to restrict the bank’s growth with an asset cap. “I have repeatedly said that implementing a risk and control framework appropriate for a bank of our size and complexity is our top priority, and closing consent orders is an important sign of our progress,” said CEO Charlie Scharf, who joined the bank in 2019, in a statement. Wells Fargo shares were up 7.4% at $52.12 Thursday afternoon, putting their 12-month return at about 9%. Albemarle Stock Rises on Better-than-Feared Earnings Shares of Albemarle (ALB) rose Thursday after the lithium miner reported a smaller-than-expected drop in earnings in the fourth quarter. Albemarle recorded a net loss of $618 million, or $5.26 per share, on net sales of $2.4 billion. That’s a significant decline from the year-ago quarter when the company reported net income of $1.1 billion on net sales of $2.6 billion. Still, the results were better than analysts had been expecting. Albemarle’s earnings and its stock have been battered by tumbling lithium prices. The cost of lithium soared in 2022 amid a shortage and surging demand for electric vehicles. (Lithium is a key component in EV batteries.) Miners, in turn, ramped up production, but EV demand waned last year as high prices and interest rates shut out buyers. Now, lithium miners are dealing with a glut. Albemarle gave a wide range of sales and earnings outlooks based on three average lithium prices—$15,000 per kilogram, $20,000 per kilogram, and $25,000 per kilogram—to reflect the volatility of lithium prices. The company forecast full-year net sales of between $5.5 billion and $7.6 billion. Adjusted EBITDA is expected to fall within a range of $0.9 billion to $2.6 billion. The company also said it was taking steps to cut capital expenditures and costs that it estimated would increase cash flow by more than $750 million. Shares were up 3.2% Thursday afternoon after jumping more than 8% earlier in the session. Still, the stock has lost more than 50% of its value in the last year. Nvidia 13-F Boosts Obscure AI Stocks Call it the Nvidia Effect: Shares of several little-known AI companies soared Thursday after the chipmaker’s first 13-F filing—a requirement for corporations with investments of more than $100 million that manage they manage themselves—revealed stakes ranging from $380,000 to $75 million. Shares of Nano-X Imaging (NNOX), an Israeli medical imaging company with a market cap of about $360 million, surged 50% Thursday after Nvidia’s 13-F revealed it held 59,632 of the company's 57 million shares. The stock pared some gains after jumping more than 90% shortly after the open. Soundhound AI (SOUN), a voice recognition company, also soared 50% on the filing, which showed Nvidia owned 1.7 million shares. Nvidia’s $3 million stake in TuSimple Holdings (TSPH), an autonomous vehicle company that delisted from the Nasdaq earlier this month, sent its shares trading over the counter up more than 40%. Shares of Recursion Therapeutics (RXRX), the second-largest of Nvidia’s investments, jumped 9%. None of the stakes are particularly large given Nvidia’s size, and they’re far from controlling stakes. Still, Wall Street’s assessment Thursday seemed to be that any connection to Nvidia, no matter how small, is reason for optimism. Dan Loeb's Third Point Exited Alphabet, Slashed Uber Stake in Fourth Quarter Billionaire Dan Loeb's Third Point Capital exited its position in Alphabet (GOOGL) and slashed its stake in Uber Technologies (UBER) in the fourth quarter of 2023, according to the company's latest 13-F filling. Loeb sold out of several positions to wrap up 2023. His fund exited its $118 million position in Alphabet Class A shares. Other notable exits from the quarter included about 1 million shares of T-Mobile US Inc. (TMUS) worth roughly $140 million and 5.5 million shares of Option Care Health (OPCH) valued at about $176 million. Third Point reduced its positions in several tech companies in the last quarter. It sold 480,000 shares of Amazon, 210,000 shares of Microsoft, 600,000 shares of Taiwan Semiconductor Manufacturing Co. (TSM), and 1.7 million shares of Intercontinental Exchange Inc. (ICE). Loeb slashed the fund's holdings in Uber by 3.2 million shares, ending the fourth quarter with 1 million. -Nathan Rieff Cisco Systems Stock Falls Amid Cautious Guidance, Job Cuts Shares of computer networking giant Cisco Systems (CSCO) slipped in early trading Thursday after the company issued softer-than-expected current-quarter guidance and unveiled plans to slash 5% of its global workforce. The legacy computing giant said it sees fiscal third-quarter adjusted earnings of 84 to 86 cents, with the top end of that range falling considerably short of the 92 cents-a-share consensus view. Revenue guidance also missed the mark, with the company’s projected range of $12.1 billion to $12.3 billion coming in below analysts’ estimate of $13.09 billion. “In terms of the macro environment, we are seeing a greater degree of caution and scrutiny of deals given the high level of uncertainty,” Robbins told analysts in a post-earnings call. “As we’re hearing this from our customers, it’s leading us to be more cautious with our forecast and expectations,\" he added. Cisco also said Wednesday that as part of a restructuring plan, it plans to trim its global workforce by 5%, representing a loss of around 4,250 jobs. Cisco shares were down 2.2% at $49.19 Thursday morning. They have gained just 1% in the past twelve months. -Timothy Smith Buffett Trimmed Positions in HP, Apple, and Paramount Global in Q4 Warren Buffett's Berkshire Hathaway (BRK.A, BRK.B) sold off about 10 million shares or nearly $2 billion of Apple (AAPL) stock in the final quarter of 2023, according to the firm's 13-F filing, among a number of changes to its portfolio. Buffett made significant trims in the fourth quarter to two other long-time holdings: HP (HP) and Paramount Global (PARA). Berkshire sold off the majority of its position in HP, reducing its holdings by about 80 million shares and ending the year with roughly 23 million shares remaining. Berkshire reduced the size of its Paramount Global position by about 30 million shares, leaving about 63 million shares. Berkshire made three major additions to preexisting positions during the last months of 2023. The company bought up an additional 16 million shares of Chevron (CVX) and another 19 million shares of Occidental Petroleum (OXY), both energy firms. Berkshire also added about 30 million additional shares of Sirius XM (SIRI), more than quadrupling its position. -Nathan Reiff Stocks Making the Biggest Moves Premarket Gains: Losses: Stock Futures Rise Ahead of Retail Sales Data Futures contracts connected to the Dow Jones Industrial Average were up 0.2% in premarket trading. S&P 500 futures were 0.1% higher. Nasdaq 100 futures also inched up 0.1%. Michael M. Santiago / Getty Images Board of Governors of the Federal Reserve System. “Responding to widespread consumer abuses and compliance breakdowns by Wells Fargo….” Wells Fargo. “Wells Fargo Confirms Termination of 2016 OCC Sales Practices Consent Order.” Albemarle. “Albemarle Reports Fourth Quarter and Full Year 2023 Results.” Nvidia Corp. \"Form 13-F.\" TuSimple. \"TuSimple Announces Intention to Delist from Nasdaq.\" Third Point Capital. \"13-F Form for the Period Ended December 31, 2023.\" Cisco. \"Cisco Reports Second Quarter Earnings.\" CNBC. \"Cisco Says It's Cutting 5% of Global Workforce, Amounting to Over 4,000 Jobs.\" "
}