{
    "title": null,
    "date": "2/4/2024",
    "url": "https://apnews.com/article/argylle-box-office-apple-71dc9ebd5d048531e0282ab187564f0d",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. This image released by Apple shows Dua Lipa, left, and Henry Cavill in a scene from “Argylle.” (Peter Mountain/Apple via AP) NEW YORK (AP) — Apple has had its first box office flop. “Argylle,” the $200-million star-studded spy thriller from Apple Studios, debuted with $18 million in ticket sales, according to studio estimates Sunday. The film, directed by Matthew Vaughn, managed to lead the weekend box office, but still found little interest from moviegoers. Although Apple has been in the original film business since 2019 and won the Oscar for best picture with 2021’s “CODA,” the company has only recently produced its own lineup of big-budget releases. The first two — Martin Scorsese’s “Killers of the Flower Moon” and Ridley Scott’s “Napoleon” — could be called successful. “Killers of the Flower Moon,” though not profitable with $156 million in global sales, was one of the most celebrated films of 2023 and is nominated for 10 Academy Awards. “Napoleon,” released in November, has raked in $219 million worldwide — also not enough to turn a profit. But both films raised Apple’s reputation as a home to top directors and prestige filmmaking. The same can’t be said for “Argylle,” a twisty thriller starring Bryce Dallas Howard, Sam Rockwell and Henry Cavill. The movie was badly dinged by critics, who gave it a Rotten Tomatoes score of 35% “fresh.” Ticket buyers also gave it a thumbs down, with a C+ CinemaScore. Apple has paired with traditional studios for each of those releases. Universal Pictures handled the rollout of “Argylle,” which opened in 3,605 North American venues and took in an additional $17.3 million in 78 international markets. Paramount handled “Killers of the Flower Moon,” while Sony steered “Napoleon.”  “Argylle,” with “Kingsman” director Vaughn at the helm, was made with aspirations of starting a new franchise. But one of its biggest talking points ahead of its release was conjecture that Taylor Swift might have been involved with the movie thanks to the prominent presence of argyle patterns and a cat in the promotional materials. Despite plenty of online discussion, Swift had no involvement in the film. Second place on the weekend went to the Christian drama series “The Chosen.” The first three episodes of the fourth season of the series, which dramatizes the life of Jesus, played in 2,263 theaters. The Angel Studios release grossed $6 million Friday through Sunday. On another quiet weekend in cinemas, the rest of ticket sales went mainly to holdovers and awards contenders. Warner Bros.’ “Wonka,” in its eighth week, crossed $200 million domestically. After four weeks in theaters, Paramount’s “Mean Girls” crossed $100 million. “The Beekeeper,” from the Amazon MGM, neared $50 million in its fourth week. Although many Oscar contenders hit theaters months ago, the top choices of those in theaters remain Cord Jefferson’s “American Fiction” ($15 million thus far for MGM), starring Jeffrey Wright, and Yorgos Lanthimos’ “Poor Things” ($28.2 million, plus $40.1 million overseas), starring Emma Stone. Estimated ticket sales for Friday through Sunday at U.S. and Canadian theaters, according to Comscore. Final domestic figures will be released Monday. 1. “Argylle,” $18 million. 2. “The Chosen,” $6 million. 3. “The Beekeeper,” $5.3 million. 4. “Wonka,” $4.8 million. 5. “Migration,” $4.1 million. 6. “Mean Girls,” $4 million. 7. “Anyone But You,” $3.5 million. 8. “American Fiction,” $2.3 million. 9. “Poor Things,” $2.1 million. 10. “Aquaman and the Lost Kingdom,” $2 million. Follow AP Film Writer Jake Coyle at http://twitter.com/jakecoyleAP Copyright 2024 The Associated Press. All Rights Reserved. "
}