{
    "title": "Apple Potentially Working On AirPods With A Camera Alongside Other Wearable \nDevices For Health And Fitness",
    "date": "2/25/2024",
    "url": "https://wccftech.com/apple-airpods-with-a-camera/",
    "text": "It was recently reported that Apple is developing a new smart ring that will compete against the likes of the Galaxy Ring from Samsung. While details are short at this stage, a new report now suggests that Apple is exploring a plethora of new wearable devices, including the AirPods with a camera. The products are potentially in their early stage alongside the smart glasses. Apple launched the Apple Watch back in 2015, which was the company's first device to measure health metrics. The company is now exploring further options to enhance the dynamics of data collection using different devices. According to Mark Gurman's latest Power On newsletter, Apple is potentially developing new wearable devices that the company could see fit to launch in the coming years. The list of devices mentioned in the report includes the smart ring, smart glasses, and AirPods with a camera built-in with additional sensors. We have previously covered that the company is possibly working on a new smart ring, which will compete against the likes of the Galaxy Ring and Oura. The ring will house numerous sensors that could work alongside the Apple Watch to detect and gather additional data for various health metrics. The report mentions that company executives received the idea of a smart ring a few years ago from the industrial design team. Gurman notes that the company is not actively developing the smart ring. Other than the smart ring, Apple is also exploring the possibility of incorporating cameras and additional sensors in its AirPods. The company's engineers explored the option to fit a low-resolution camera on the AirPods. According to the analyst, if Apple moves ahead with the design, the AirPods could offer AI-based features to help users with day-to-day tasks. Lastly, the report mentions that the company is also working on smart glasses with mixed reality capabilities. The device could work similarly to the Vision Pro, but the company could shave off a few features due to its smaller size. Moreover, smart glasses could potentially house health-centric features for users. The analyst says Apple's smart glasses would compete against Meta's Ray Ban Smart Glasses and Amazon Echo Frames. The wearable would feature built-in speakers and camera sensors. However, the wearable is not expected to be released any time soon. The report is based on initial speculation, and the final word rests with Apple, so be sure to take the news with a grain of salt. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}