{
    "title": "Apple reportedly faces €500m fine from EU over music streaming access",
    "date": "2/19/2024",
    "url": "https://www.theguardian.com/business/2024/feb/19/apple-faces-possible-500m-fine-from-eu-over-music-streaming-access",
    "text": "Brussels to issue levy after Spotify complained about block on telling users about cheaper alternatives to app store, according to FT Apple is reportedly facing a €500m fine from the EU over restrictions on access to music streaming services, in what would be a landmark blow to the US tech company. The European Commission is investigating whether Apple blocked music streamers from telling users about cheaper ways to subscribe outside its app store where it takes a significant cut of revenues. According to the Financial Times, Brussels plans to impose a fine of €500m (£427m), which would represent a landmark ruling against Apple after years of complaints from companies whose services are delivered via iPhone apps. The Swedish streaming company Spotify filed a complaint with the EU in 2019, claiming that Apple limits choice and competition in its app store by charging a 30% fee on all purchases. Apple also prevented Spotify and other companies from informing customers on their phones that they could avoid the commission – and get a better deal – simply by signing up on Spotify’s website. Apple says its fee is justified because it spends heavily on providing a secure app store, and provides Spotify with access to hundreds of millions of customers. However, Spotify argues that Apple’s own music streaming service, Apple Music, does not face the same extra cost, giving it an advantage and making the fees anti-competitive. The European Commission will say Apple’s actions are illegal and go against the bloc’s rules that enforce competition in the single market, according to the FT, which cited five people close to the investigation. The commission could also reportedly ban the practice of blocking music services from advertising cheaper subscriptions outside the platform. Apple has never faced a competition fine from the European Commission, although it received a €1.1bn fine from France in 2020 – subsequently revised down to around €370m on appeal – for anti-competitive agreements with two wholesalers. However, it and other big tech companies are under increasing scrutiny over competition concerns. Google is appealing against fines of more than €8bn levied by the EU in three separate competition investigations. Apple defeated a lawsuit by the Fortnite developer Epic Games that claimed that the app store was an illegal monopoly, but Epic in December won a similar cases against Google, which operates the Android mobile phone software. Last month, Apple said it would allow EU customers to download apps without going through its own app store, a response to the bloc’s Digital Markets Act. The law, the details of which were revealed last year, introduces new obligations for “gatekeepers” including Amazon, Google and Amazon who hold particularly powerful positions in controlling mobile phone software choices. Sign up to Business Today Get set for the working day – we'll point you to all the business news and analysis you need every morning after newsletter promotion The European Commission declined to comment. Apple did not provide fresh comment, but pointed to a previous statement saying it would respond to the commission’s concerns “while promoting competition and choice for European consumers”. "
}