{
    "title": "Apple reportedly building foldable iPhone flip phones",
    "date": "2/8/2024",
    "url": "https://qz.com/apple-foldable-iphone-ipad-flip-phone-1851238195",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Remember those patents Apple filed last year that hinted at a foldable iPhone? Apparently, CEO Tim Cook’s company hasn’t given up on trying to make a true foldable. A new report claims two foldable iPhone prototypes are in the works, suggesting Apple is trying to catch up with the burgeoning foldable market. However, we may not see it for at least another two years, and it will likely come out after we see a foldable iPad. We still don’t have many, or really any, specifics on how a foldable phone might fit into Apple’s current device ecosystem. Still, a new report from The Information cites an unnamed source with direct knowledge of Apple’s efforts that the Cupertino, California company has two prototypes currently going through tests. They are clamshell-type devices like the Samsung Galaxy Z Flip 5, which folds lengthwise, allowing it to stand up like a bipod or at a 90-degree angle. At the same time, the company has been working on a foldable iPad that eliminates the worst aspects of foldables, namely the fragility and the annoying crease. Apple’s team is apparently very concerned about the fragility of these kinds of phones and who can blame them. Otherwise, the design team wants a foldable iPhone with external displays akin to the latest Galaxy Z Flip or Motorola Razr+. Still, it would also need to be extremely thin so as not to take up too much pocket space when collapsed. Considering how hard it is to minimize the size of battery and display components, it’s a rather tough conundrum. According to the report, Apple has gone back and forth on whether it’s worth committing to a folding iPhone. Cook had reportedly approached Apple engineers as early as 2018 about the possibility of foldables. That was back when foldable screens were only born on early prototypes or expensive concept devices, and it was two years before Samsung unveiled its first Galaxy Z Flip. The Information made it clear these phone prototypes aren’t on the docket for this year or even 2025, though the company has reportedly made inquiries to different manufacturers about parts. The company paused work on a foldable iPhone in 2020 but kicked it back into gear more recently. There’s also always the chance Apple will nix work on the prototypes if it can’t find a real “Apple” way of doing a foldable phone. The company is still trying to discover more “compelling features” that would put an Apple foldable on the map. The foldable iPads are more likely to rear their heads in the next few years than the iPhone. The early versions of the foldable iPad reportedly had an 8-inch screen, and Apple is apparently very focused on eliminating the crease. Apple apparently wants the table to be able to lie completely flat as well. If they’re looking for inspiration, they might turn to the OnePlus Open, a foldable phone with the most minimal crease of any foldable we’ve seen. We’ve been seeing reports from known Apple analysts and the regular rumor mill that we might see a foldable iPad this year, though there have been just as many naysayers like Bloomber’s Mark Gurman who claim otherwise. The Information’s anonymous source claimed that we would likely see Apple’s squashable tablet before any phone version, as Apple can test its fans’ appetite for foldables before betting big on a major release like the iPhone. Maybe Apple will be a little less risk-averse going forward, especially since its $3,500 Apple Vision Pro headset has been released to both praise and a fair bit of consternation. We still have to wait and see how well that device sells, but if things go better than expected, the company could have reason to think Apple fans might actually want something—you know—new for a change. This article was originally published on Gizmodo. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}