{
    "title": "Google Follows Apple's Lead, Set To Begin Making Smartphones In This Asian \nCountry",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/news/google-follows-apples-lead-set-080756161.html",
    "text": "This story was first published in the Benzinga India portal. Alphabet Inc (NASDAQ: GOOG) (NASDAQ: GOOGL) subsidiary Google is poised to begin manufacturing its Pixel smartphones in India as soon as the next quarter, according to a report by Nikkei. This move signifies a strategic pivot for the tech behemoth to diversify its supply chain and penetrate the burgeoning Indian smartphone market. The production line for the premium Pixel 8 Pro is set to be established in Southern India in the coming weeks. This will be followed by the Pixel 8 production in Northern India by mid-year. The tech giant is initially starting with limited production volumes. This move comes as India's reputation as a smartphone manufacturing hub continues to grow. Tech forerunners such as Apple, Samsung, Oppo, and Xiaomi are extending their presence in the region. See Also: PhonePe Launches Appstore To Challenge Google Play's Dominance In India: Here's Why The shift is a significant change in strategy for Google, which had been relying on Vietnam for manufacturing amidst the escalating tensions between the U.S. and China. The decision mirrors a larger industry trend towards a 'China+2' strategy. This approach seeks to establish multiple non-China production bases to ensure supply chain resilience. Google's foray into India follows up on the 2023 announcement regarding the release of its first India-manufactured Pixel phones. With this venture, Google joins the ranks of Apple and Samsung in capitalizing on the vast Indian market. The Indian government's efforts to transform the country into a tech manufacturing powerhouse through incentives and potential import restrictions further attract companies like Google. Similar actions are being taken by other tech giants like Apple, Acer, and ASUS, which are also escalating their production efforts in India. Photo by Samuel Angor on Unsplash Read next: Amazon Enters India’s Fast Fashion Arena With ‘Bazaar’, Rivals Flipkart And Ajio On Alert \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? ALPHABET (GOOGL): Free Stock Analysis Report ALPHABET (GOOG): Free Stock Analysis Report This article Google Follows Apple's Lead, Set To Begin Making Smartphones In This Asian Country originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}