{
    "title": "Apple defeats Khosla-backed AliveCor suit over watch tech",
    "date": "2/7/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/apple-defeats-khosla-backed-alivecor-suit-over-watch-tech",
    "text": "APPLE will not have to face a lawsuit alleging its smartwatch copied heart-monitoring technology from a Khosla Ventures-backed startup, AliveCor, a federal judge ruled. US district judge Jeffrey White in Oakland, California, entered a judgment on Tuesday (Feb 6) in favour of Apple. Details of the decision were filed under seal, due to confidentiality concerns by the companies. A redacted version will be made public in the coming weeks. “AliveCor’s lawsuit challenged Apple’s ability to improve important capabilities of the Apple Watch that consumers and developers rely on, and today’s outcome confirms that is not anti-competitive,” Apple said. AliveCor said it was “deeply disappointed” in the decision and plans to appeal. “We will continue to vigorously protect our intellectual property to benefit our consumers and promote innovation,” the company said. The dispute was based on a meeting in 2015, when AliveCor co-founder David Albert was invited by Apple executives to show off his heart-monitoring device, dubbed the KardiaBand. AliveCor claims Albert was told the iPhone maker intended to collaborate on the technology. Apple has said the meeting was like hundreds of others it has hosted with developers over the years, with no pretence of a partnership. Start and end each day with the latest news stories and analyses delivered straight to your inbox. After 18 months of discussions between the companies, in “a clear attempt to steal AliveCor’s thunder”, Apple announced its own heart health initiative for the Apple Watch, a few hours after AliveCor informed Apple of the official launch date for the KardiaBand, according to the complaint. Over the next few years, as Apple updated the Watch operating system, no other service was allowed to offer heart-rate monitoring on the device because of the company’s “concentrated campaign to corner the market”, AliveCor claimed in its antitrust complaint. Apple denied that allegation and said it has allowed third-party apps to use its heart-rate sensor technology since 2015. AliveCor said separate patent claims against Apple are still being litigated. BLOOMBERG BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}