{
    "title": "Vision Pro is ‘second most impressive tech since…’: Read Sam Altman’s quick \nreview of $3500 Apple headset",
    "date": "2/10/2024",
    "url": "https://www.financialexpress.com/life/technology-vision-pro-is-second-most-impressive-tech-since-read-sam-altmans-quick-review-of-3500-apple-headset-3390034/",
    "text": "The Financial Express OpenAI chief Sam Altman has called Apple’s new Vision Pro the “second most impressive tech since the iPhone.” We can’t say for sure if he has tried the headset in person but regardless of whether or not he has, it’s big praise for Cupertino’s debut “spatial computing” headset that’s got the whole industry talking. Altman took to X (the platform previously known as Twitter) to share his “quick review” of the USD 3500 Vision Pro that recently went on sale, though in select regions only. The headset blends virtual and augmented reality, collectively called mixed reality, and is being widely seen as the iPhone maker’s next big thing for a future beyond the iPhone. Having said that, it’s exorbitant pricing could deter it from mass adoption and so, all eyes would be on the second and third generation models to see how Apple plans to scale and make it available to even more people. vision pro is second most impressive tech since the iphone Developer support is also crucial. A good thing about the Vision Pro is that visionOS, the headset’s operating system supports iPad apps natively while big brands like Disney have collaborated with Apple to launch dedicated apps and content to try and make full use of the phenomenal tech. At the same time, there are others like Netflix and Spotify that don’t plan to release separate apps in which case users will have to depend on browsers for streaming. YouTube recently got onboard after speculation that it, too, might give the Vision Pro a miss. There is no denying that the Vision Pro packs tremendous potential despite the challenges including limited battery life (and Apple’s workaround with the battery that powers the headset isn’t the most graceful either). Its groundbreaking display (there are two of those, one for each eye with 23 million pixels in total) alone is tempting enough to sway many, not to mention, adding to the cost of making one. It has two processors (M2 and R1), both Apple-made and as many as 12 cameras and LiDAR for tracking. The somewhat modular design, too, is a big selling point though Apple needs to cut down on weight in the next generation. Like it or not, the Vision Pro has re-ignited the whole debate around virtual reality in particular and while rivals like HTC and Meta have offered headsets on similar lines for years (at much lower prices), Apple’s entry into the space means even they should get the push needed for the industry to go forward faster and innovate further. Altman is not the only big-ticket name endorsing the Vision Pro, even Elon Musk has previously spoken positively about it. Then there are analysts who predict it’s a combination of the Mac and TV, one that could be a threat to two-dimensional screens someday. Follow FE Tech Bytes on Twitter, Instagram, LinkedIn, Facebook. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}