{
    "title": "microLED Apple Watch Ultra canceled: Here's what we know",
    "date": "3/1/2024",
    "url": "https://bgr.com/tech/the-apple-watch-ultra-microled-project-has-been-canceled-according-to-another-leaker/",
    "text": "Sign up for our daily newsletter If you buy through a BGR link, we may earn an affiliate commission, helping support our expert product labs. A day after BGR reported that the microLED Apple Watch Ultra project could have been canceled, analyst Ming-Chi Kuo corroborated this idea by saying Apple has given up on this product. Previously, manufacturer Osram announced an unnamed customer canceled all orders for microLED displays, which could possibly be Apple. While the company expected increased revenue in 2025, when Apple was first expected to release its microLED Apple Watch Ultra, Osram’s CEO said that the project was abandoned, which made its shares drop. Now, according to analyst Ming-Chi Kuo, Apple canceled the microLED Apple Watch Ultra project as this display couldn’t add “significant value to this product,” in addition to production costs being too high to make it economically viable. Apple Micro LED update:1. My latest survey indicates that Apple has canceled the Micro LED Apple Watch projects because Apple thinks that Micro LED can’t add significant value to this product, and the production costs are too high to make it economically viable.2. Apple has… A previous report said the cost for a microLED display at this moment would be around $150, although Apple only pays $38 for the current Apple Watch OLED display. Usually, when Apple pays that much for a screen, the product it sells would cost around $1,500, which is almost double what the Apple Watch Ultra costs at this moment. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. With that, Kuo believes Apple laid off many people from the microLED development team, as “there’s currently no visibility on any microLED related project.” He continues: “It’s undoubtedly a major setback for Apple, which hopes to own the next generation of display technology to make its products more competitive.” Besides that, Bloomberg‘s Mark Gurman has hinted that Osram wasn’t the only microLED manufacturer Apple was in talks with. Still, Kuo thinks otherwise: “3. Osram was Apple’s exclusive LED chip supplier for Micro LED. The company’s cancellation of its Micro LED collaboration with Apple means that Apple has no plans to mass-produce Micro LED devices in the foreseeable future.” AMS-Osram was one supplier in the Apple Watch Ultra microLED project. There are several others. I doubt it was canceled. https://t.co/wu0mfli3GO Despite the microLED display, Apple was rumored to be planning sleep apnea detection for the 2024 Apple Watch while also studying to roll out blood pressure sensors in phases. The first iteration would just tell a user if their blood pressure is trending upward; a 2027 version could have the ability to provide exact numbers and even diagnose related conditions. In addition, Apple is putting all its efforts into a blood glucose sensor for a future Apple Watch. While it’s unclear if the company will be able to pull a non-invasive system, it’s easier to predict this technology could be presented in 2027 rather than 2024. José is a Tech News Reporter at BGR. He has previously covered Apple and iPhone news for 9to5Mac, and was a producer and web editor for Latin America broadcaster TV Globo. He is based out of Brazil. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. -\n\t\t\t\t\t\tJonathan S. Geller, Founder BGR is a part of Penske Media Corporation.\n© 2024 BGR Media, LLC. All Rights Reserved. "
}