{
    "title": null,
    "date": "1/2/2024",
    "url": "https://arstechnica.com/apple/2024/01/2024-may-be-a-year-of-reckoning-for-apples-85-billion-services-business/",
    "text": "Front page layout Site theme Michael Acton, Financial Times\n    -    Jan 2, 2024 2:11 pm UTC Apple faces a legal reckoning in 2024, with a series of regulatory decisions by US and EU authorities over the coming months set to determine the future of its $85 billion-a-year services business. The biggest hit to the iPhone maker could come from a US antitrust trial against Google, where it emerged that the fellow tech giant had paid more than $26 billion in 2021 to make its search engine the default on Apple devices and other smartphones and browsers. Should Google lose the case, it could be forced to stop making regular payments to Apple, which Eric Seufert, an independent analyst, estimates as being worth a quarter of annual revenues earned by Apple’s services arm. Meanwhile, Apple and other tech giants face increasing scrutiny from the Biden administration over concerns about the dominance of its App Store, which it is already being forced to change in the EU due to legislation designed to rein in the power of Big Tech. Together, the legal and regulatory actions spanning two of Apple’s biggest markets represent the biggest threat to the company’s business in years. Its services arm, which includes income from the App Store, video streaming arm, and Apple Music, has steadily increased as a proportion of the company’s total revenues, which is still dominated by sales of devices such as the iPhone. The Google trial, seen as the most significant antitrust monopoly trial in more than 25 years in Washington, will hear closing arguments in May. Should Google lose, it will almost certainly file an appeal, but such a decision would raise questions about how the two tech giants work with one another into the future. “I think the judge was intrigued with that issue during the trial,” said Bill Kovacic, a former Federal Trade Commission chair and competition professor of law and policy at George Washington University Law School. “The question in the background was: ‘if Apple is going to have an auction for that prime placement, what should Google have done?’” The White House is at the same time intensifying its efforts to tackle what it regards as excessive corporate power. Jonathan Kanter, head of the Department of Justice’s antitrust unit since November 2021, has made no secret of his ambition to bring cases against the biggest US companies. His department has been probing Apple’s App Store policies for years and is now, according to Kanter, “firing on all cylinders.” The window for him to bring a case is closing, however, as the US presidential election and a potential change in administration loom. The DoJ did not respond to a request for comment on the Apple probe. Regulators, businesses, and enforcers have for years been seeking to pry apart Apple’s iOS ecosystem, a move the tech giant has always insisted would undermine the mobile operating software’s security. Apple, however, acknowledged recently in a filing to the Securities and Exchange Commission that it would have to make changes to its App Store in the EU, due to the bloc’s new Digital Markets Act, which has a March deadline for legal compliance from tech companies. In the EU, Apple is preparing to allow “sideloading,” which enables iPhone users to bypass its store and download apps from elsewhere. This will breach, for the first time, the walled-off ecosystem that the company has protected since Steve Jobs unveiled the iPhone in 2007. Apple has dragged its feet on this issue, since it maintains the practice will create security risks to its system. Sideloading could have an impact on the App Store, where Apple charges developers as much as a 30 percent fee on digital purchases. Games account for more than half of that revenue. Google’s Play Store, which charges a similar fee, is also in the spotlight after it lost a landmark trial against Epic Games in California in December. Apple draws between $6 billion and $7 billion in commission fees from the App Store globally each quarter, according to Sensor Tower estimates. Competitors are pushing to earn some of that share and launch rival app stores and payment methods on Apple devices. Microsoft is talking to partners about launching its own mobile store. Fortnite maker Epic Games, a longtime Apple foe, wants its store on iOS devices and points to its lower 12 percent fee as an incentive for consumers to switch to its platform. While Epic broadly lost a lower court judgment into its claims against Apple in 2021, a California judge ordered Apple to put an end to App Store rules that prevent developers from steering customers outside of the store to make purchases. The appeals court upheld that injunction earlier this year. The US Supreme Court will review the case next year. For investors, gauging the ultimate risk from the raft of regulatory and legal actions across the world is difficult. “I think there’s just a belief that there’s all this noise in the background, and ‘don’t worry about it,’” said Gene Munster, managing partner at Deepwater Asset Management. Investors, he said, had been “lulled to sleep” by Apple’s initial wins against Epic in particular. “But I think investors should take it seriously.” Apple declined to comment. © 2024 The Financial Times Ltd. All rights reserved. Not to be redistributed, copied, or modified in any way. Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox. Sign me up → CNMN Collection\n  WIRED Media Group\n  © 2024 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 1/1/20) and Privacy Policy and Cookie Statement (updated 1/1/20) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights |  Do Not Sell My Personal Information\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices "
}