{
    "title": "Apple’s EU app store changes are truly epic—but they may not be enough",
    "date": "1/26/2024",
    "url": "https://fortune.com/2024/01/26/apple-eu-dma-digital-markets-act-ios-iphone-alternative-app-stores-epic-sweeney/",
    "text": "Apple on Thursday announced fundamental changes to the way it runs its mobile business in Europe, to very grudgingly comply with the European Union’s new Digital Markets Act (DMA)—a massive reform of antitrust law that specifically targets Big Tech. But Apple’s move is already facing strong opposition from those who are supposed to benefit from it. The changes, which the company revealed with stark warnings about the security and privacy implications for European iPhone and iPad users, will make it possible for those users to download alternative app stores, pay for in-app purchases and subscriptions without using Apple’s payment system, and choose to use non-Safari browsers like Chrome or Firefox—which will no longer have to be built on top of Apple’s WebKit engine—from the first time they turn on their device. However, companies that have long been pushing for the ability to launch rivals to the in-house iOS App Store are deeply displeased with the way Apple has chosen to make the changes. Epic Games, which has spent years crusading against the massive cut Apple demands for in-app sales, and which intends to launch its own iOS app store in the EU later this year, is the most notable example. In a blistering X post, Epic CEO Tim Sweeney laid into Apple’s decision to claim a €0.50 ($0.54) “core technology fee” per first installation from developers who choose to distribute very popular apps (i.e., those seeing over 1 million downloads per year) through alternative app stores. Apple says this would apply to less than 1% of developers, but nonetheless, it would demand that fee whether the installation comes via its own App Store or a rival channel. “They are forcing developers to choose between App Store exclusivity and the store terms, which will be illegal under [the] DMA, or accept a new also-illegal anticompetitive scheme rife with new Junk Fees on downloads and new Apple taxes on payments they don’t process,” Sweeney thundered. (That last point is curious, as Apple explicitly said that “developers can use a payment service provider within their app or link users to their website to process payments for no additional fee to Apple.”) This opposition could well mean that the changes still leave Apple falling foul of the DMA—which comes with the threat of fines theoretically running as high as 20% of global annual revenue. “The DMA will open the gates of the internet to competition so that digital markets are fair and open. Change is already happening. As from 7 March [the deadline for DMA compliance] we will assess companies’ proposals, with the feedback of third parties,” Thierry Breton, the European Commission’s digital chief, told Reuters on Friday. “If the proposed solutions are not good enough, we will not hesitate to take strong action.” Asked for comment earlier in the day, a Commission spokesperson told Fortune that the EU executive body—which is in charge of enforcing the DMA—“strongly” encourages Big Tech companies whose platforms fall under the law to “test their proposals with third parties.” Apple told Fortune that it was sharing its changes with everyone, and that it had previewed them to the Commission in more than 50 meetings. Epic won’t be the only company griping to the Commission. Aptoide, which already has an alternative app store for iOS but currently requires users to have “jailbroken” iPhones to use it, also told Reuters that it was preparing to send formal feedback on Apple’s changes. “This was definitely a good move, but the fees are still too high,” said CEO Paulo Trezentos. Sweeney’s complaint went beyond the issue of fees, also touching on the measures Apple said it would take to mitigate the theoretical security threats posed by alternative app stores. Apple will still review all iOS apps, regardless of how they’re distributed, through a “notarization” procedure entailing both automated and human review—crucially, it will also retain the right to deny authorization to alternative app stores, “to ensure marketplace developers commit to ongoing requirements that help protect users and [app] developers.” “Apple proposes that it can choose which stores are allowed to compete with their App Store. They could block Epic from launching the Epic Games Store and distributing Fortnite through it, for example, or block Microsoft, Valve, Good Old Games, or new entrants,” Sweeney wrote. “Epic has always supported the notion of Apple notarization and malware scanning for apps, but we strongly reject Apple’s twisting this process to undermine competition.” The DMA itself states that “gatekeepers” such as Apple will need to apply “fair, reasonable, and nondiscriminatory general conditions of access” for other businesses that want to set up shop on their platforms. With such strong pushback already evident, there’s a chance that Apple’s changes may not reach those benchmarks. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}