{
    "title": "Spotify CEO calls Apple’s new EU App Store changes ‘extortion’",
    "date": "1/27/2024",
    "url": "https://www.siasat.com/spotify-ceo-calls-apples-new-eu-app-store-changes-extortion-2965108/",
    "text": "San Francisco: Swedish music streaming service Spotify’s CEO Daniel Ek has criticised Apple’s proposed App Store changes ahead of the EU Digital Markets Act (DMA), saying the changes are “at best vague and misleading” and a “new low for the company”. In a blog post, the Spotify CEO alleged that under the false pretense of compliance and concessions, Apple has put forward a new plan “that is a complete and total farce”. “Essentially, the old tax was rendered unacceptable under the DMA, so they created a new one masquerading as compliance with the law,” he argued. Earlier, Epic Games’ CEO Tim Sweeney, whose company sued Apple over antitrust practices, also condemned Apple’s plan, saying it was a case of “malicious compliance” and full of “junk fees”. Ek said that a completely new 0.50 cent Euro fee per download, every year, in perpetuity, to Apple for just allowing developers to exist on iOS “is extortion, plain and simple”. “If Apple’s already charging a commission of 17 per cent (and 10 per cent for recurring payments) on digital goods purchased, why would they also need to charge an annual flat fee for every user?” he argued. “From our read of Apple’s proposal, a developer would have to pay this fee even if a user downloaded the app, never used it and forgot to delete it. This will hurt developers, potential start-ups and those offering free apps”. Under the new terms, if Spotify stays in the App Store and wants to offer its own in-app payment, “we will pay a 17 per cent commission and a 0.50 cent Euro Core Technology Fee per install and year”. “This equates to us being the same or worse as under the old rules. With our EU Apple install base in the 100 million user range, this new tax on downloads and updates could skyrocket our customer acquisition costs, potentially increasing them tenfold,” Ek noted. Apple has announced changes to iOS, Safari, and the App Store in the European Union in response to the DMA coming into force in March. For users, the changes include new controls and disclosures, and expanded protections to reduce privacy and security risks the DMA creates, the company said in a statement. The key news is that third-party app stores will be allowed on iOS for the first time. The changes will arrive with iOS 17.4 in March. Get the news updates on WhatsApp & Telegram by subscribing to our channels. For all the latest Business updates, download our app Android and iOS. "
}