{
    "title": "Microsoft briefly overtakes Apple as world's most valuable company, before \nApple takes back crown",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/microsoft-briefly-overtakes-apple-as-worlds-most-valuable-company-before-apple-takes-back-crown-165431534.html",
    "text": "Microsoft (MSFT) on Thursday briefly overtook Apple’s (AAPL) market capitalization, making it the most valuable publicly traded company in the world. The software giant took the top spot just after the start of trading, hitting north of $2.8 trillion. Apple’s market cap was also trading above $2.8 trillion, but was just behind Microsoft. The two companies quickly traded spots again, putting Apple back on top, and continued switching places throughout the morning. Shares of Apple have struggled in the first two weeks of the year, as analysts from three banks downgraded the company’s stock amid fears of slowing iPhone demand. On Wednesday Redburn Atlantic analyst James Cordwell said he saw little room for upside for Apple’s stock in the next few years, and that an “anticipated underwhelming March quarter could impact confidence in this outlook.” Barclays's Tim Long also downgraded Apple’s stock, dropping it to Underweight from Equal Weight, and lowered its price target from $161 to $160. Piper Sandler’s Harsh Kumar also slapped the stock with a downgrade to Neutral. Analysts generally fear that Apple iPhone 15 is underperforming in China amid renewed homegrown rival Huawei and the country’s broader economic slowdown. Greater China is Apple’s third-largest revenue driver behind North America and Europe. In 2023, the area accounted for $72.6 billion of the company’s $383.3 billion in total revenue. Despite those downgrades, analysts on Wall Street are still overwhelmingly positive; 32 of the 53 analysts tracking the stock currently maintain Buy ratings. Another 16 have Hold ratings, and just five analysts have Sell ratings on the stock. Apple is also gearing up to roll out its hotly anticipated Vision Pro AR/VR headset. The device, which Apple refers to as a spatial computer, goes on sale Feb. 2 for $3,499. That starting price is expected to be a steep barrier for most consumers, but if the headset proves consumers and enterprises are interested in diving deeper into the AR/VR space, it could be a boon for Apple in the long run. While Apple is facing fears over iPhone sales, Microsoft is looking to ensure that its massive investments in ChatGPT maker OpenAI and its own generative AI offerings pay off for investors. The company has poured billions into OpenAI, a partnership that is coming under increasing scrutiny from regulators in the UK and EU, and needs to show that its customers are actually buying into generative AI-powered apps. So far things are looking bright for Microsoft. In its fiscal Q1 earnings report, the company said its AI tools provided a better-than-expected boost to its cloud business. During the quarter, Microsoft's Intelligent Cloud segment, which includes its Azure business, brought in $24.3 billion in the quarter, better than Wall Street’s expectations of $23.6 billion. Azure and other cloud services revenue jumped 29% in the quarter, beating Wall Street's expectations of 27%. Microsoft is also banking on its AI investments permeating the consumer market, as it launches a new Copilot key for Windows laptop and desktop keyboards. The move, which required buy-in from Microsoft’s OEM partners, marks the first major update to Windows keyboards in nearly 30 years. Intel, AMD, and Qualcomm have also introduced new processors designed to power on-device AI capabilities, adding to the broader AI push into the consumer market. The PC industry is gearing up for a potential turnaround in 2024 as consumers begin to venture out and buy new laptops and desktops after holding off over the past four years. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}