{
    "title": "Microsoft briefly took Apple's crown as most valuable company",
    "date": "1/12/2024",
    "url": "https://www.siliconrepublic.com/business/microsoft-apple-most-valuable-company-iphone-ai",
    "text": "by Leigh Mc Gowran 12 Jan 2024 Image: © Koshiro/Stock.adobe.com Apple has held the top spot for years, but the company’s sales took multiple hits in 2023, while Microsoft has seen a surge in growth from its AI and cloud investments. Competition to be the world’s most valuable company is heating up, as Microsoft managed to surpass Apple for a brief moment yesterday (11 January). Multiple reports claim Apple lost its top spot for the first time since 2021, as its shares suffered a dip at the start of 2024 due to demand concerns. Meanwhile, Microsoft’s shares have been rising steadily since last year. The trading day ended with Apple back on top, but the fact Microsoft managed to briefly surge past the iPhone maker shows how successful some of its recent endeavours have been in the eyes of investors. The brief achievement was praised by Epic Games founder and CEO Tim Sweeney, who called it a “well-deserved honour”. Epic Games has been in legal battles with Apple and Google since 2020 after its cornerstone game – Fortnite – was removed from the app stores of both Apple and Google for violating in-app purchase rules. “From Bill Gates to Steve Ballmer to Satya Nadella, they have a 50-year track record of supporting and empowering developers to do great work, while respecting developer and user freedom,” Sweeney said. “A sharp contrast to Apple and Google.” Microsoft had a very successful 2023, with a significant boost to its earnings thanks to its multibillion-dollar investment in ChatGPT-maker OpenAI. The tech giant has incorporated AI into various products and managed to beat expectations in its earnings report last October. Microsoft also saw significant growth in its cloud computing services last year. In October, the software giant reported a 13pc growth in its overall revenue year-on-year to $56.5bn. Meanwhile, Apple’s revenue saw multiple drops in 2023 due to an impact on sales for its various gadgets including its flagship product the iPhone. In November 2023, Apple reported a decline in overall sales in both China and Europe, while US sales saw only small growth. A preliminary report by Counterpoint claimed Apple’s dominance in the premium smartphone market – those with a wholesale price of more than $600 – dipped slightly in 2023. 10 things you need to know direct to your inbox every weekday. Sign up for the Daily Brief, Silicon Republic’s digest of essential sci-tech news. Related:\n                    AI,             Microsoft,             cloud,             smartphones,             Apple,             iPhone Leigh Mc Gowran is a journalist with Silicon Republic editorial@siliconrepublic.com 25 Jan 2024 20 Feb 2024 6 days ago 15 Feb 2024 31 Jan 2024 30 Jan 2024 12 hours ago 14 hours ago 14 hours ago 14 hours ago 17 hours ago 17 hours ago 18 hours ago 20 hours ago 20 hours ago 21 hours ago 22 hours ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 3 days ago 4 days ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}