{
    "title": "Livermore IT director stole more than 140 Apple laptops from his Redwood \nCity employer",
    "date": "1/29/2024",
    "url": "https://www.mercurynews.com/2024/01/29/livermore-it-director-stole-more-than-140-apple-laptops-from-his-redwood-city-employer/",
    "text": "Today's e-Edition Get Morning Report and other email newsletters  Get Morning Report and other email newsletters Today's e-Edition Trending: Andrew Halvorsen’s job as senior director of information technology at a Redwood City tech company included buying Apple laptops for employees. But according to federal prosecutors, Halvorsen sold at least 141 of the computers for cash, costing the company more than a half-million dollars. Halvorsen, a 49-year-old Livermore resident, pleaded guilty Monday to conspiring to transport stolen property out of California. His federal indictment alleged that he started stealing and selling MacBooks in 2019, and kept up the scheme until last May. The company that employed him is not named in the indictment, which refers to it as a “cloud-based machine data analytics” business. Related Articles\nCrime and Public Safety |  \n\n\t\t\tMan charged with groping fellow passenger on SFO-bound flight\t\t\n\n\nCrime and Public Safety |  \n\n\t\t\tWoman arrested on suspicion of embezzling nearly $300,000 from Silicon Valley tech firm\t\t\n\n\nCrime and Public Safety |  \n\n\t\t\tSan Mateo reaches $25 million settlement with three women sexually assaulted by officer\t\t\n\n\nCrime and Public Safety |  \n\n\t\t\t2 East Bay shoplifting suspects found in possession of guns, drugs\t\t\n\n\nCrime and Public Safety |  \n\n\t\t\tSan Mateo sheriff increasing patrols after woman groped near Half Moon Bay park\t\t\n\nAfter stealing the laptops, Halvorsen sold them to someone — described only as “co-conspirator 1” and a resident of Alamo — who resold them to other buyers, often out of state, according to Halvorsen’s indictment in Sacramento U.S. District Court. Halvorsen was undone by a joint investigation between the IRS and FBI, according to the U.S. Department of Justice. He faces a maximum five years in prison and $250,000 fine, but prosecutors are asking the court for 18 to 24 months imprisonment, given his guilty plea. However, the prosecution noted in the plea agreement that its position on sentencing could change, depending on Halvorsen’s future cooperation with investigators or any “post-plea obstruction of justice.” According to the plea agreement, he agreed to pay back his company’s losses of $535,800, and could also be hit with a court-ordered fine. Halvorsen’s sentencing is scheduled for April 15. Copyright © 2024 MediaNews Group "
}