{
    "title": null,
    "date": "1/6/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/us-moves-closer-filing-sweeping-antitrust-case-against-apple",
    "text": "THE Justice Department is in the late stages of an investigation into Apple and could file a sweeping antitrust case taking aim at the company’s strategies to protect the dominance of the iPhone as soon as the first half of this year, said three people with knowledge of the matter. The agency is focused on how Apple has used its control over its hardware and software to make it more difficult for consumers to ditch the company’s devices, as well as for rivals to compete, said the people, who spoke anonymously because the investigation was active. Specifically, investigators have examined how the Apple Watch works better with the iPhone than with other brands, as well as how Apple locks competitors out of its iMessage service. They have also scrutinised Apple’s payments system for the iPhone, which blocks other financial firms from offering similar services, these people said. Senior leaders in the Justice Department’s antitrust division are reviewing the results of the investigation so far, said two of the people. The agency’s officials have met with Apple multiple times, including in December, to discuss the investigation. No final decision has been made about whether a lawsuit should be filed or what it should include, and Apple has not had a final meeting with the Justice Department in which it can make its case to the government before a lawsuit is filed. The Justice Department is closing in on what would be the most consequential federal antitrust lawsuit challenging Apple, which is the most valuable tech company in the world. If the lawsuit is filed, US regulators will have sued four of the biggest tech companies for monopolistic business practices in less than five years. The Justice Department is currently facing off against Google in two antitrust cases, focused on its search and ad tech businesses, while the Federal Trade Commission has sued Amazon and Meta for stifling competition. The Apple suit would likely be even more expansive than previous challenges to the company, attacking its powerful business model that draws together the iPhone with devices like the Apple Watch and services like Apple Pay to attract and keep consumers loyal to its products. Rivals have said that they have been denied access to key Apple features, like Siri virtual assistant, prompting them to argue the practices are anticompetitive. Start and end each day with the latest news stories and analyses delivered straight to your inbox. A spokesperson for the Justice Department declined to comment for this article. Apple also declined to comment. The company has previously said that its practices do not violate antitrust law. In defending its business practices against critics in the past, Apple said that its “approach has always been to grow the pie” and “create more opportunities not just for our business, but for artists, creators, entrepreneurs and every ‘crazy one’ with a big idea.” The company prides itself on the way the iPhone integrates hardware and software to create a seamless customer experience. In 2020, Tim Cook, Apple’s CEO, said during testimony before a Congressional antitrust committee that the company redefined mobile phones with “its effortless user experience, its simplicity of design and a high-quality ecosystem.” He added that Apple competed against Samsung, LG, Google and other smartphone makers, which offer a different approach. “Apple does not have a dominant market share in any market where we do business,” Cook said at the time. “That is not just true for iPhone; it is true for any product category.” The case would add to the growing regulatory pressure both domestically and abroad cutting into Apple’s business, currently valued at US$2.83 trillion. This year, European regulators are expected to force Apple to accommodate app stores beyond its own under the Digital Markets Act, a law passed in 2022 to rein in tech giants. Similar actions against the App Store have been taken or are under consideration in South Korea and Japan. Additionally, the European Commission said in 2021 that Apple had violated its antitrust laws by imposing app store fees on competitors to its Apple Music product. The commission’s investigation into the issue is continuing. The resolution of the Justice Department’s investigation could be affected by the details of how Apple complies with European regulations, said two people with knowledge of the matter, who spoke anonymously because the investigation was ongoing. The investigation has encompassed a wider span of Apple’s business interests than previously reported, said six people with knowledge of the meetings. That includes how Apple has blocked cloud gaming apps, which let users stream a multitude of titles to their phones, from being offered in its App Store. Investigators spoke with executives at Tile, the Bluetooth tracking service, about Apple’s competing AirTag product and the company’s restrictions to outside parties on access to the iPhone’s location services. Executives at Beeper, a startup that made iMessage available on Android phones, spoke with investigators about how Apple blocked it from making it possible to offer messaging across competing smartphone operating systems. Investigators also had conversations with banks and payment apps about how Apple prevents them from accessing the tap-to-pay function on iPhones. Tile and Beeper declined to comment for this article. They have also looked at how the Apple Watch works better alongside the iPhone than other competing smartwatches. Users of Garmin devices have complained in Apple’s support forums about being unable to use their watches to reply to certain text messages from their iPhones or tweak the notifications they receive from the iPhone that they have connected to their watch. Apple’s new privacy tool, App Tracking Transparency, which allows iPhone users to explicitly choose whether an app can track them, drew scrutiny because of its curtailing of user data collection by advertisers. Advertising companies have said that the tool is anticompetitive. Meta, the owner of Facebook and Instagram, encouraged the Justice Department to look at the issue in its conversations with the agency, two of the people said. The company – which makes most of its money from advertising – said in 2022 that it could lose roughly US$10 billion in revenue that year because of the changes. Meta declined to comment. Investigators have also examined Apple’s policy of applying fees to purchases made inside iPhone apps, which companies like Spotify and the dating app powerhouse Match Group say is anticompetitive. NYTIMES BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}