{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.benzinga.com/general/entertainment/24/02/37205962/vision-pro-199-travel-case-has-the-internet-divided-the-most-un-apple-thing-they-have-done",
    "text": "Apple Inc. AAPL first-generation mixed reality headset Vision Pro's NASA space suit-like travel case has the internet divided, with some users applauding the design, while others questioning the utility of this $199 accessory. What Happened: The Vision Pro travel case is a white, bulb-shaped pouch with a Ripstop outer shell. Ripstop is a lightweight, durable, and water-resistant nylon material. The case also has a Polycarbonate protective structure with a microfiber inner lining and retractable handle. It also has \"compartments for your battery, ZEISS Optical Inserts, Apple Vision Pro Cover, and additional accessories.\" The case was specifically designed by Apple to protect the Vision Pro headset for users when they are on the go. However, it has drawn mixed reactions from tech reviewers and users. See Also: Vision Pro’s Future Version May Replace The iPad, Says Mark Gurman: ‘Many People Buy Apple’s Tablets Just For…’ Derrick Gee, a TikTok user, described the case as “the most un-Apple thing they’ve done for so long.” YouTuber Faiz Aly has likened its appearance to a NASA space suit, while TechWeWant, a YouTube channel, said it gives the vibe of a pillow and sleeping bag. My fav Apple Accessory is a…puffy case? #design #applevisionpro Users on X, formerly Twitter, have given mixed reviews. While some have complimented the case, saying it has \"super interesting design details\", others were not satisfied with it. \"It’s like two bicycle helmets stacked.\" Users are also \"disappointed\" that given the expensive price of Vision Pro, that is $3,499, the case wasn't included by the tech giant. Here are some reactions to the Vision Pro travel case: People on the internet have also been sharing links to third-party Vision Pro carrying cases that apparently cost considerably less than its $199 price tag. Why It's Important: While Apple Vision Pro has generated quite a stir among tech enthusiasts, reports have surfaced about early adopters returning their headsets, citing issues like quality, software bugs and limited use cases. Meanwhile, Apple's rival in the AR/VR headset category, Meta Platforms, Inc. CEO Mark Zuckerberg and CTO Andrew Bosworth have declared that their company's Quest 3 is a far superior device than Vision Pro. However, Microsoft Corporation executives seem to approve the headset, with the head of Microsoft Word describing the experience as \"more fun\" than his home entertainment system. He did admit the weight and strain on his eyes after prolonged use. Last week, it was reported that just 12 days after its launch Vision Pro was able to reach 1,000 dedicated apps milestone. Image Credits – Shutterstock Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Apple's Longtime Focus On iPhone To Change In 2024, With Vision Pro, AirPods Taking The Limelight, Suggests Mark Gurman © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}