{
    "title": null,
    "date": "2/17/2024",
    "url": "https://247wallst.com/consumer-electronics/2024/02/17/apple-may-not-break-199-again/",
    "text": "Apple’s (NASDAQ: AAPL) share price hit $199.62 on December 11 last year. The price started relentlessly from $59 in November 2019. It was easy money for people who bought the stock then or as it rose over the four years—those easy money days started to end late last summer. It may be a coincidence, but the iPhone 15 was launched on September 12, 2023. Since then, anxiety about its success, particularly in China, has weighed on its share price. Warren Buffett recently sold Apple shares. Apple’s management has tried to argue that its hardware business is less and less critical to its financials. There is some strength to that position. Apple’s revenue rose only 2% in the most recent quarter to $119.6 billion. EPS was up 16% to $2.18. CEO Tim Cook said Apple’s active installed base topped 2.2 billion. It is from this installed base that Apple’s quick-growing Services business gets its growth. In the quarter, Services revenue rose 11% to $23.1 billion. iPhone revenue for the quarter rose 6% to $69.7 billion, which showed the iPhone 15 was not a blistering success. And revenue from Mac and Wearables retreated. That means two of Apple’s five divisions retreated. The iPhone could not carry enough revenue weight, so Apple’s hardware growth was at least reasonable. China was a huge disappointment. Revenue in the most recent quarter dropped from $23.9 billion in the year-ago quarter to $20.8 billion. Apple calls the region “Greater China”. Analysts warned early this year that Apple’s market share might be slipping. Apple needs China to be a strong region. It tops the list of nations based on smartphone sales—over 900 million Chinese own one. Optimists about Apple’s future would like to see its share break above $200, but That may never happen.  If you want to retire before 65, pay attention. Study after study has shown that the longer you stay invested, the better your chances at an early retirement. Every day that goes by without saving and investing for tomorrow means more to earn and save later. Don’t waste any more time and get started with Robinhood today. The app makes it easy to buy and sell stocks, mutual funds, trade options, and even cryptocurrencies. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}