{
    "title": "Apple scooped 75.6% market share in India’s premium smartphone segment",
    "date": "2/16/2024",
    "url": "https://tech.hindustantimes.com/tech/news/apple-scooped-75-6-market-share-in-india-s-premium-smartphone-segment-story-6ODccf2hK54EAIwKUu3SZI.html",
    "text": "Copyright © HT Media Limited  All rights reserved. Apple reached a record 75.6 per cent market share in the fourth quarter of 2019 in India and the credit goes to the stellar performance of iPhone 11 and price drop on previous generation models. According to the International Data Corporation (IDC), in the premium ($500 or  ₹36,000 and above) segment, Apple reached a record 75.6 per cent market share. According to Navkendar Singh, Research Director, IDC India, while the first half of 2019 was relatively slower for Apple, it managed to find growth in the second half. \"It happened on the back of price drops on previous generation iphone models (iPhone XR, 7, 8). This, along with affordability schemes like cashbacks, EMIs especially on the e-tailer platforms during festive quarter of Diwali, led to this growth,\" Singh told IANS. Buoyed by iPhone 11 sales primarily due to lower launch price and price drop on previous generation models, Apple registered double-digit growth in India for iPhones in the holiday quarter (October-December period), the company's CEO Tim Cook announced late last month. Apple also registered a good growth in wearables in India. ALSO READ: Apple's official e-store to be operational in India by Q3 2020 \"Apple Watch and Airpods have been well received by the Indian consumers. Price reductions on Apple Watch Series 3 and the promotional discounts offered by banks and e-tailer channels on Apple Watch Series 5 made the device a popular purchase among consumers,\" informed Singh. iPad 2018 model also helped Apple register strong growth in India in 2019. Frequent discounts on e-tailers made this device more attractive for consumers who are looking for an entertainment specific device. \"As the tablet market is consolidating to the top five vendors, it helped Apple to gain the share in the premium segment. Also, this year, Apple was able to win a few large commercial deals, it further strengthens its position in the commercial segment,\" Singh told IANS. Apple became one of the fastest-growing brands in India in the fourth quarter of 2019, capturing 2 per cent market share with a year-on-year growth of 41 per cent. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71589384342893 "
}