{
    "title": "MLS inks marketing deal with Apple's Beats brand",
    "date": "2/19/2024",
    "url": "https://www.sportsbusinessjournal.com/Articles/2024/02/19/mls-beats-apple-marketing-partnership",
    "text": "Beats selected Atlanta United, Columbus Crew, Inter Miami, LAFC, Nashville SC, NYCFC, St. Louis City SC and Toronto FCBeats/MLS Apple-owned consumer audio brand Beats by Dr. Dre will produce custom headphones for players on eight MLS clubs this season as part of a new global marketing partnership with the league. Financial terms of the four-year deal were not disclosed, but both parties confirmed it is additive on top of the league’s 10-year, $2.5B media partnership with Apple. The agreement makes Beats the league’s official consumer audio products partner, a designation previously held by JLab Audio. Beats selected eight clubs -- Atlanta United, Columbus Crew, Inter Miami, LAFC, Nashville SC, NYCFC, St. Louis City SC and Toronto FC -- to provide with hand-painted headphones in 2024. Other clubs will follow throughout the partnership. Beats CMO Chris Thorne said that the brand has recently increased its efforts in the soccer space, including through a partnership with Manchester City F Erling Haaland, to resonate with the sport’s younger fan base. “What we love is so many of the fans appear to be the Gen Z youthful audience that Beats has forever resonated with since we started,” Thorne said. “A huge focus for us the past few years has been how do we continue to stay youthful, creating great products that audience loves and then how do we connect with them.” RELATED: MLS Season Preview: The Messi Effect MLS Exec VP/Apple Partnership, Properties, & Events Camilo Durana said the partnership with Beats is a natural extension of some of the initiatives the two companies have engaged in already around Apple Music, such as themed playlists. He believes highlighting the connection between soccer and music will deepen fans’ connection with their favorite players and teams. “By allowing our players to wear Beats on the field as they warm up for games and go through their routines, we can start to think big and connect the dots between that visual, share player playlists with fans, further tell their stories of where they're from and why they're choosing certain music,” Camilo said. RELATED: SBJ Q&A: MLS Commissioner Don Garber Beats also plans to announce partnerships with several MLS players this year. Thorne wouldn’t disclose whether that group will include Lionel Messi, but he noted that the brand received a massive amount of attention last season when it helped the Inter Miami star gift his new teammates custom Beats headphones. “I had more requests for that headphone than any other that we’ve made,” Thorne said. RELATED: The Half-Century Club: Three MLS clubs mark milestone NFL meeting preview; MLB's opening week ad effort and remembering Peter Angelos. On this week’s pod, our Big Get is CBS Sports college basketball analyst Jay Wright. The NCAA Championship-winning coach shares his insight with SBJ’s Austin Karp on key hoops issues and why being well dressed is an important part of his success. Also on the show, Poynter Institute senior writer Tom Jones shares who he has up and who is down in sports media. Later, SBJ’s Ben Portnoy talks the latest on ESPN’s CFP extension and who CBS, TNT Sports and ESPN need to make deep runs in the men’s and women's NCAA basketball tournaments. Shareable URL copied to clipboard! https://www.sportsbusinessjournal.com/Articles/2024/02/19/mls-beats-apple-marketing-partnership Sorry, something went wrong with the copy but here is the link for you. https://www.sportsbusinessjournal.com/Articles/2024/02/19/mls-beats-apple-marketing-partnership Register for a free SBJ account to unlock one extra article per month.  © 2024 Leaders Group. All rights reserved.The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Leaders Group. © 2024 Leaders Group. All rights reserved. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Leaders Group. Already a subscriber? Click below to sign in. Upgrade your subscription to get all the news you need: Adding SBJ weekly content will give you the comprehensive view of sports business with: Already a subscriber? Click below to sign in. Upgrade your subscription to get all the news you need: Adding SBJ daily content will give you the comprehensive view of sports business with: "
}