{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.straitstimes.com/business/apple-s-longest-serving-designer-to-depart-company-adding-to-exodus",
    "text": "LOS ANGELES - Apple’s longest-serving senior industrial designer is leaving the company, marking the near-complete turnover of a team once led by legendary design chief Jony Ive. Mr Bart Andre, who joined Apple in 1992 alongside Sir Ive, told colleagues in February that he is retiring, according to people familiar with the matter. Mr Andre was one of the last remaining designers from the Ive era and helped create the aesthetic for Apple products released over the past three decades – even prior to founder Steve Jobs returning to the helm in the late 1990s. The designer was known as one of Sir Ive’s top lieutenants and helped run the team after former chief Evans Hankey, Sir Ive’s successor, departed in 2023. He is also known as one of the biggest holders of Apple patents. The departure is the latest in recent months for the group. Top designers Colin Burns, Shota Aoyagi and Peter Russell-Clarke all left around the end of 2023. Multiple long-time designers on Apple’s software design team have also signalled they are planning to leave in the near future. Both the industrial design and user interface groups are overseen by Mr Jeff Williams, the company’s chief operating officer. He has held that role since Sir Ive’s departure in 2019 but took on direct management of the industrial design team in 2023, when Mr Hankey left. Having an operations person oversee a division dedicated to design and innovation has rankled some staff, according to the people close to the situation. There have also been cost-cutting measures that have added to the unrest, they said. Under Sir Ive, the team embarked on exploratory projects that did not necessarily have an immediate payoff – something that has been reined in. Apple did not respond to a request for comment. Sir Ive’s core design team was made up of about two dozen people for well over a decade. Around the time Sir Ive left in 2019, an exodus began. Nearly all of the senior designers who reported directly to Sir Ive have now left. Many of them joined LoveFrom, a design firm founded by Sir Ive that worked with Apple until two years ago. The industrial design team has been replenished with new outside talent, but there are few long-time members remaining who worked under Sir Ive and helped create hit products like the iPhone, iPad and Apple Watch. Mr Richard Howarth, who serves as vice-president of design, is a carry-over from the Ive era, along with Ms Molly Anderson and Mr Duncan Kerr. The Apple design team is tasked with devising the look and feel of devices and software, as well as developing new features and interfaces. That includes minute details like the sound of ringtones and alerts from an iPhone. The group was also central to the creation of the company’s last two product categories, the Apple Watch and Vision Pro. The watch’s design was spearheaded by Sir Ive, who also helped craft the iMac, iPod and iPhone. Though the Vision Pro began development during his tenure, he left years before it was released. BLOOMBERG Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2024 SPH Media Limited. All rights reserved. "
}