{
    "title": "Apple’s Vision Pro Discussed By Lightspeed",
    "date": "2/26/2024",
    "url": "https://www.forbes.com/sites/walterloeb/2024/02/26/apples-vision-pro-discussed-by-lightspeed/",
    "text": " Apple launches Vision Pro Mixed Reality Headset Photographer: David Paul Morris/Bloomberg “Apple’s Vision Pro mixed reality headset opens doors to exciting content, immersive experiences and opportunities for retailers and brands to engage consumers with their products, increase sales and achieve greater efficiencies,” said John Shapiro Chief Products Technology Officer of Lightspeed a leading software company. We spoke about Apple Vision Pro which has been introduced by the company for $3,500. There are a lot of questions than one could ask about price, demand, usage, many of them were answered during my meeting with John. He said that Apple Vision Pro allows retailers to interact in an entirely new manner that was previously unavailable in the physical space of a store, on television or from a home computer. It adds a whole new dimension to omnichannel retail that provides a range of benefits to consumers and retailers alike. However, it is a glimpse of the future, rather than the arrival of these experiences today. The device is too heavy, bulky, intrusive and expensive to achieve mass adoption at this time. But, like the first iPhone that was slow, expensive and clunky, future generations of the Vision Pro are likely to address these shortcomings and see much better consumer reception as a result. John challenged Apple to engage consumers and gain more sales. Apple should provide a more engaging shopping experience to build connections between consumers, products and brands, while also helping to reduce shoppers cause for hesitation, ultimately converting more in store browsing into purchases. Applications will include: 1. Trying on virtual clothing 2. Instant product information while in-store (i.e. a bottle of wine’s origin, food pairings, and reviews) 3. Access to stylists and personal shoppers In addition, John felt Apple could achieve greater efficiencies from the ability to test and find the most effective floor and window displays (i.e. virtual assorting). In addition, more effective marketing through applications that will push engagement, increase in the moment product promotions and make suggestions based on each shopper’s preferences. This will allow retailers to streamline operations and marketing budgets. John Shapiro gave me a few key initial considerations pertaining to the use of the mixed reality devices in retail, as well as in the longer term as independent retailers are able to deploy other solutions. 1. Take omnichannel (i.e. home shopping) to the next level. Since the pandemic, retailers have learned that an omnichannel business model is required for success. Retailers need to be everywhere the consumer is, on-line (e-commerce, social commerce, etc.) and off-line (in-store, curbside, etc.) As mixed reality technologies like Apple’s Vision Pro apply the AI and extensive data retail business collect through their platform, we will realize the “ultimate” multi-dimensional omnichannel retail business in the future,” (albeit not for many years until Vision Pro and/or other mixed reality technologies are widely accessible, but it is coming and is very exciting). 2. A number of retailers have already deployed 3D model shopping (take View in Room AR\nAR\n experiences) including IKEA, Wayfair and others. 3. We will initially see examples of Vision Pro’s potential from large brands and enterprise retailers. These are the companies that can afford to invest in extensive technology teams to stay up-to-date with consumer trends and technical capabilities. John has seen launches of some exciting applications’ that demonstrate the potential of mixed reality technologies like J. Crew, Virtual Closet, Lowe’, Style Studio, Alo Yoga and others. 4. Lightspeed Commerce has a mission to enable SMB merchants to compete and win, offering a technology platform that helps accelerate their business. John pointed out that Macy’s offers a VR/AR furniture shopping experience, which results in better economics: “In pilot stores, shoppers who used the virtual reality headsets to view Macy’s furniture had more than a 60% greater average order value than non-virtual reality furniture shoppers. Macy’s says. In addition, VR shoppers had less than 2% return rate on transactions. To increase operating efficiency, there are numerous B2B and operational use cases. A number of wholesale platforms, of which NuORDER by Lightspeed is a leading offering, allows brands to create virtual buying experiences. Born out of necessity during Covid, these “virtual markets” have returned to largely in-person events as the pandemic has subsided. Devices such as the Vision Pro can enable a truly immersive virtual showroom experience enabling brands to offer a much more compelling digital experience to their buyers. Similarly, retailers can use these virtual experiences to do assortment planning and layouts, window display plan outs etc. How is Vision Pro use for Retail today? John Shapiro said that retailers are starting to launch VR apps for consumer engagement including: 1. Elf – The “your best e.l.f” vision OS app encourages users to unwind and explore the best version of themselves through playful, inspirational environments that contextualize an assortment of 3D e.l.f. products. 2. J. Crew - J. Crew announced the “J. Crew Virtual Closet” which allows users to shop J. Crew products in an interactive, high-definition 3-D environment. The J. Crew Virtual closed utilizes Share Play, a powerful set of features for shares experiences while on a Face-Time call, to chat with J. Crew expert stylists or host group calls to get others’ opinion on looks. 3. Lowe’s - Lowe’s launched Lowe’s Style Studio which leverages spatial computing to provide customers with an immense 3D kitchen experience, allowing them to visualize and design their dream kitchen from the comfort of their homes 4. Alo Yoga - Alo Yoga has launched “alo Sanctuary” the first wellness-driven shopping app for Apple Vision Pro. The app lets users experience mindful meditation in ultra-high fidelity outdoor environment while shopping. POSTSCRIPT: There was much more to the discussion. Companies like Macy’s, Lowe’s and Elf have implemented some initial uses of the device and have found strong customer acceptance. The interesting fact is that everything is based on fast service. I am indebted to John Shapiro’s for his wise comments. The key to new technology is whether retailers will undertake the high cost to develop the device. Eventually, we will see more frequent uses for those devices and John Shapiro agrees that this will be the case with Apple’s Vision Pro.  "
}