{
    "title": "iPhone captures highest-ever market share in Samsung's homeland",
    "date": "2/21/2024",
    "url": "https://www.sammobile.com/news/apple-iphone-25-percent-market-share-korea/",
    "text": "© 2024 SamMobile SamMobile has affiliate and sponsored partnerships. If you buy something through one of these links, we may earn a commission. Last updated: February 21st, 2024 at 06:21 UTC+01:00 Apple has been giving Samsung a tough fight in the global smartphone market. And for the first time ever, last year, Apple shipped more iPhones annually than Samsung did. This doesn't look good for Samsung at all. What's even worse is that Apple's market share has reached a record high in Samsung's homeland, South Korea. According to a new report from Counterpoint Research, Apple's smartphone market share breached the 25% mark in South Korea for the first time. Its market share has been increasing by 1% point every year since 2020, and it increased by 3% points in 2023. Over the past few years, Apple's market share in the Korean smartphone market has seen a sharp rise, while Samsung's market share has been declining. The South Korean firm's market share declined by 2% points last year. However, Samsung still has a 73% share of the South Korean smartphone market. This rise in Apple's influence in South Korea is attributed to the MX Generation (people in their 20s and 30s). According to a report, 8 out of 10 pre-orders for the iPhone 15 were done by people in their 20s and 30s. In comparison, more than half of the pre-orders for the Galaxy S24 series were placed by people in their 30s and 40s. The iPhone 15 Pro Max, which is the priciest iPhone in Apple's lineup, costs KRW 2.5 million ($1,864), which is KRW 400,000 ($300) more than the Galaxy S24 Ultra. Despite a higher price, iPhones are selling more rapidly in the country. Apple opened its first retail stores in South Korea last year. First, it opened Apple Gangnam in the high-end neighborhood. Then, the company opened the Apple Hanam store last year. Last month, the iPhone maker opened the Apple Hongdae store. Samsung also opened its flagship retail store, Samsung Gangnam, in the same neighborhood as Apple Gangnam, but it is being seen as a failure by experts and industry insiders.  You might also like The first iPhone was launched in 2007, while the first Galaxy smartphone was unveiled in 2009. Ever since their launch, Android and iOS have copied features from each other, but Android has always been better at UI customization. While Apple has made several improvements in the past few years, it still lacks a basic feature […] The way Apple locks down its customers has long been heralded as the epitome of prudent business management. It was presented as the best way for companies that make mobile devices to ensure that their user base remained loyal, and companies that took a different route were almost looked down upon. Apple's infamous walled garden […] Samsung Wallet is getting the Mobile Driver's License and Mobile National Veterans Registration Card integration feature in South Korea. Samsung and the Ministry of Public Administration and Security launched this feature in South Korea earlier today. South Korea's Ministry of Public Administration and Security has announced that displaying one's driver's license and national veterans registration […] Samsung Electronics held its 55th annual general shareholders meeting today at the Suwon Convention Center in Suwon, Gyeonggi-do, South Korea. The company revealed its strategy for this year and expects revenue of $100 from its chip packaging business. The company's 55th annual general shareholders meeting was attended by general shareholders, institutional investors, and top-level management […] One of the most praised features of Samsung’s Galaxy S24 Ultra is its anti-reflective display. The screen uses Corning’s Gorilla Glass Armor, which features an anti-reflective coating that cuts reflections by up to 75%, making the content on the screen look clearer and more vibrant in environments with light sources, such as under direct sunlight. […] Samsung has launched two new power banks in South Korea. The PD Wireless Charging Battery Pack 10,000mAh and the PD Charging Battery Pack 20,000mAh are now available in Samsung's home country. Both new power banks are made using recycled materials in their exterior design. PD Wireless Charging Battery Pack 10,000mAh and PD Charging Battery Pack […] Reviews Best picks Devices Samsung Galaxy A55 SM-A556E Samsung Galaxy S24 SM-S921B Samsung Galaxy S24 Plus SM-S926U Samsung Galaxy S24 Ultra SM-S928B Samsung Galaxy A14 5G SM-A146B Samsung Galaxy A15 5G SM-A156E Samsung Galaxy A25 SM-A256E Samsung Galaxy S23 FE SM-S711U Opinions Notebook TV Social media © 2024 SamMobile "
}