{
    "title": "EU to slap Apple with €500 million fine in culmination of antitrust probe \nafter Spotify complaint: Report",
    "date": "2/18/2024",
    "url": "https://fortune.com/2024/02/18/eu-apple-fine-antitrust-probe-spotify-complaint/",
    "text": "The European Union is close to hitting Apple Inc. with its first ever antitrust fine as well as a ban on App Store rules that the bloc believes thwart competition, according to the Financial Times. The fine of around €500 million ($539 million) is expected to be announced next month, the FT said, citing five sources it did not name. Apple could have been fined as much as 10% of its annual global sales. The probe was sparked by a complaint in 2019 from Sweden’s Spotify Technology SA, which claimed it was forced to ramp up its monthly subscription price to cover costs associated with Apple’s alleged stranglehold on how the App Store operates. The European Commission homed in on Apple’s so-called anti-steering rules in a formal charge sheet in February 2023, saying the conditions were unnecessary and meant customers faced higher prices. In early 2022, Apple began allowing Spotify and other music services to direct app users to the web to sign up for subscriptions. This bypasses Apple’s revenue cut of as much as 30% and gives consumers more pricing and subscription options. But Spotify hit back at Apple’s efforts, saying in June that the restrictions still existed and the changes were “just for show.” Aside from attacking firms for their past abuses, the commission, the EU’s antitrust arm, has also pushed through sweeping new rules to head off competition violations by tech firms before they take root. The Digital Markets Act enters into full force in March 2024, and lays out a series of dos and don’ts. Under the DMA, it will be illegal for the most powerful firms to favor their own services over those of rivals. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}