{
    "title": null,
    "date": "2/13/2024",
    "url": "https://markets.businessinsider.com/news/stocks/qualcomm-s-soaring-success-with-iphone-modem-deal---analyst-eyes-higher-valuation-1033062857",
    "text": "Piper Sandler analyst Harsh V. Kumar reiterates an Overweight rating on Qualcomm Inc (NASDAQ:QCOM) with a price target of $165. Kumar maintained that QCOM is a premier tech play across its business lines as Internet-of-Things (IoT) revenues will likely increase in March following the bottom in the December quarter, coupled with robust opportunities in the company’s automotive segment. Kumar noted that the IoT business in the longer term could ultimately provide Qualcomm with $1.5 billion+ in quarterly revenues further down the line as more industrial-edge devices come online. The analyst noted that Qualcomm’s automotive business exiting fiscal 2024 is up ~30% Y/Y. Additionally, his projections see the auto segment exiting fiscal 2025 with $3 billion in annual revenues, well on track to meet management’s expectations. The analyst wanted to clarify misconceptions circulating around the chip designer. He heard from some investors about confusion around the shipment and share of modems at Apple Inc (NASDAQ:AAPL).  Also Read: Qualcomm Beat Q1 Expectations: Why One Analyst Flags Huawei As A ‘Key Risk Factor’ Kumar noted that Qualcomm’s position is straightforward. The chip designer currently has 100% of the 2023 iPhone 15 modem share. The analyst said the company recently also very publicly signed a 3-year deal (for phones introduced in 2024, 2025, and 2026) with Apple and is assuming they will retain a 20% share of the last model, the 2026 iPhone release. Currently, the stock is trading at a ~15x P/E multiple, per Kumar, in line with its crucial handset competitors. Additionally, average multiples over the previous year’s time horizon hovered in the 15x P/E range. Given Qualcomm’s diversification away from handset revenues and the subsequent proliferation of IoT and automotive into the model, the stock should not trade alongside its counterparts.  The stock should trade at a slight premium to the handset players in the region of 18x-20x P/E in the longer term once macro conditions are correct, as per the analyst. Kumar projects second-quarter revenue and EPS of $9.30 billion (in line with the consensus) and $2.29 (versus $2.31 consensus). Price Action: QCOM shares traded lower by 2.59% at $149.82 on the last check Tuesday. Qualcomm office. Photo via Shutterstock. Indices Commodities Currencies Stocks "
}