{
    "title": "Zacks Market Edge Highlights: AAPL, COST, WSM, LLY and HLT",
    "date": "2/23/2024",
    "url": "https://finance.yahoo.com/news/zacks-market-edge-highlights-aapl-083500150.html",
    "text": "Chicago, IL – February 23, 2024 – Zacks Market Edge is a podcast hosted weekly by Zacks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here:  https://www.zacks.com/stock/news/2230305/how-to-start-stock-investing-in-your-50s Welcome to Episode #391 of the Zacks Market Edge Podcast. (0:45) - Can You Start Investing In Your 50’s? (10:45) - Where Should You Be Investing For The Long Term? (32:10) -  Episode Roundup: AAPL, COST, LLY, HLT, WSM Podcast@zacks.com Every week, host and Zacks stock strategist, Tracey Ryniec, will be joined by guests to discuss the hottest investing topics in stocks, bonds, and ETFs and how it impacts your life. This week, Tracey is going solo to discuss how you can start investing, for the first time, in your 50s. She does not address retirement investing but this would be a side account, simply for investing. There’s a lot of talk about how to get started in your 20s and 30s but what about in your 50s? All investors, no matter their age, should have a plan. What is the goal for this money? Why are you saving, and investing, it? It could be a 5-year plan to save for a dream vacation. It could be an account to fund a boat in retirement. It could be because you simply always want to buy some stocks but just never started, outside of your retirement accounts. A plan will keep you heading towards your goals, even if things get rocky. Many people think that it’s too late to buy stocks in your 50s yet nearly all of the examples of top investors that have been featured on this podcast over the last 8 years had started investing later in life. Remember Boston Pops clarinetist Edward Avedisian who donated $100 million to Boston University in 2022? He didn’t start investing in stocks until his 40s. He bought tech IPOs in the 1980s and 1990s and held them, including companies like Microsoft. When he died in 2022 at age 85, he had an investing portfolio worth $125 million. Another top investor was Anne Scheiber who invested $5,000 in stocks when she was 51. She bought and held brand name companies, including drug companies, for the next 50 years. When she died in 1995, she donated $22 million to Yeshiva University. Once you set up a brokerage account, you need to fund it and then actually buy some stocks. Investors can buy ETFs, which provide a basket of stocks, or individual companies. Tracey discusses two ETFs in the podcast that could help you get started. However, many investors like buying individual stocks. But how do you decide what stocks to buy? Tracey likes the Peter Lynch method of “buy what you know.” Peter Lynch, the famed Fidelity Magellan portfolio manager from the 1980s and 1990s, liked to buy companies whose products he was familiar with and used. He always had a caveat that investors should always research companies before buying the stock. Did you just buy new living room furniture and loved the selection at West Elm? Are you a big fan of Costco and have been a member for year? Are you a loyalty member at Hilton hotels and love their resorts in Mexico? Does everyone in your family own Apple products, including the new Apple Vision Pro virtual reality headset? Have you been keeping up with the news on weight-loss drugs and think the drug companies, like Eli Lilly, are going to make a ton of money? This is “buy what you know.” Start with an idea and then do the research. 1. Apple Inc. AAPL Apple has a dedicated fan base which buys the new products, no matter what they are. It recently launched the Apple Vision Pro, a new virtual reality headset. Will it be the next big thing to power Apple’s earnings higher? Shares of Apple have fallen 5.3% year-to-date but it remains an expensive stock on a forward P/E level. It trades at 27.7x. Apple pays a dividend, yielding 0.5%. Should Apple be on your short list? 2. Costco Wholesale Corp. COST Costco has been a top retailer for years, with consumers loving the brand in both the United States and Mexico. Shares are up 9.5% year-to-date and have hit new all-time highs. Costco is not a cheap stock, on a P/E basis. It has a forward P/E of 46. Investors will get a dividend, however, currently yielding 0.6%. Should Costco be on your short list? 3. Williams-Sonoma, Inc. WSM Williams-Sonoma is a furniture and home accessory retailer with powerhouse brands like West Elm, Pottery Barn and Williams-Sonoma. Shares of Williams-Sonoma are up 9% year-to-date. But Williams-Sonoma is still attractively priced, with a forward P/E of 15.2. It’s also shareholder friendly and pays a dividend, yielding 1.6%. Should Williams-Sonoma be on your short list? 4. Eli Lilly & Co. LLY Eli Lilly shares are hitting new all-time highs in 2024 on the rollout of weight loss drugs. Shares are up 28% year-to-date. Eli Lilly’s earnings growth is incredible. The Zacks Consensus Estimate is calling for earnings growth of 96% this year. Eli Lilly pays a dividend, currently yielding 0.7%. Should Eli Lilly be on your short list? 5. Hilton Worldwide HLT Hilton is a global leisure and hospitality company. It’s been making a push into the all-inclusive market in Mexico and the Caribbean in recent years. Shares are up 9.3% year-to-date as consumers are still looking for experiences. While earnings are expected to rise 12.7% in 2024, the shares aren’t cheap with a forward P/E of 28. Hilton does pay a dividend, but it’s yielding just 0.3%. Should Hilton be on your short list? Tune into this week’s podcast to find out. Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com/performance Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Eli Lilly and Company (LLY) : Free Stock Analysis Report Costco Wholesale Corporation (COST) : Free Stock Analysis Report Williams-Sonoma, Inc. (WSM) : Free Stock Analysis Report Hilton Worldwide Holdings Inc. (HLT) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}