{
    "title": "Apple's first folding device won't be an iPhone — iPad or MacBook could \ndebut as early as 2025, but company ...",
    "date": "2/22/2024",
    "url": "https://www.imore.com/ipad/apples-first-folding-device-wont-be-an-iphone-ipad-or-macbook-could-debut-as-early-as-2025-but-company-concerned-about-quality-of-foldable-panels",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A foldable iPad could be on the way. The long-awaited foldable iPhone may be further away than otherwise thought, but there’s a silver lining that may come in the form of a tablet. As reported by Digitimes, Taiwan-based sources say “Apple has been developing foldables for the past five years, and its first foldable product will not be a smartphone. It will instead be a larger device.” Digitimes cites a report stating that while Apple has been unhappy with screen quality up until this point for its foldable iPhone project, a larger foldable iPad or MacBook could launch as early as 2025, though this may be pushed back to 2026. According to the report, “Apple has looked into devices from several makers” but one of those projects was suspended “since the display panels did not pass the company’s own testing standard.” However, it’s worth noting that this is a natural part of developing a project. As some parts of it become unfeasible, money is then further invested into projects that seem fruitful. The foldable iPhone has not yet been axed, but it may take longer to get to market until Apple finds the display quality that it wants. According to Digitimes, “The company has already been developing a larger, non-phone foldable device for at least five years, and recent rumors note that design efforts are converging, a sign that mass production is near”. According to the same report, hinges and panels are two main factors that are important to the development of foldable devices that make them different from standard devices. Over the last few years, Samsung, Huawei, and more have seen advancements in hinge technology, which means Apple doesn’t have to worry about perfecting the tech. As a result, panels are now the biggest obstacle for Apple to overcome. Foldable devices are not the only new direction Apple is taking in regards to its display tech. The iPad Pro line expected to launch in the next few weeks will have a brand-new OLED screen. This is likely to be the best iPad for some time. In addition, the iPad Air 6 will get bigger with the standard 10.9-inch model and a new 12.9-inch version. iPad appears to be getting a lot of new ideas over the next few years, which might make it the perfect time to upgrade. iMore offers spot-on advice and guidance from our team of experts, with decades of Apple device experience to lean on. Learn more with iMore! James is a staff writer and general Jack of all trades at iMore. With news, features, reviews, and guides under his belt, he has always liked Apple for its unique branding and distinctive style. Originally buying a Macbook for music and video production, he has since gone on to join the Apple ecosystem with as many devices as he can fit on his person.  With a degree in Law and Media and being a little too young to move onto the next step of his law career, James started writing from his bedroom about games, movies, tech, and anything else he could think of. Within months, this turned into a fully-fledged career as a freelance journalist. Before joining iMore, he was a staff writer at Gfinity and saw himself published at sites like TechRadar, NME, and Eurogamer.  As his extensive portfolio implies, James was predominantly a games journalist before joining iMore and brings with him a unique perspective on Apple itself. When not working, he is trying to catch up with the movies and albums of the year, as well as finally finishing the Yakuza series. If you like Midwest emo music or pretentious indie games that will make you cry, he’ll talk your ear off. 'Not true' — rumored March 26 iPad Pro and Air launch isn't happening, insider warns The upcoming OLED iPad Pro bezels are the thinnest Pro models have ever been and a new matte finish option is on the way Apple 'accidentally' updates every AirTag in the world at the same time - here's why By Stephen WarwickMarch 22, 2024 By James BentleyMarch 22, 2024 By Connor JewissMarch 21, 2024 By Connor JewissMarch 21, 2024 By Oliver HaslamMarch 21, 2024 By Connor JewissMarch 21, 2024 By Oliver HaslamMarch 21, 2024 By John-Anthony DisottoMarch 21, 2024 By Oliver HaslamMarch 21, 2024 By Oliver HaslamMarch 21, 2024 By James BentleyMarch 21, 2024 iMore is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}