{
    "title": "Should Apple investors worry about a Justice Department antitrust lawsuit?",
    "date": "1/22/2024",
    "url": "https://www.morningstar.com/news/marketwatch/2024012261/should-apple-investors-worry-about-a-justice-department-antitrust-lawsuit",
    "text": "By Jon Swartz Two analysts downgraded Apple shares earlier this month, but at least one believes the company's stock could soar nearly 25% As the Justice Department marches inexorably toward an antitrust lawsuit against Apple Inc. that could come as soon as March, some investors are bracing for collateral damage to the company's fortunes. Most, however, aren't sweating this. They have deeper concerns. Since a report Wednesday that confirmed months of rumors about an imminent lawsuit over how software and hardware limitations on iPhones and iPads hinder competitive services, analysts, investors and legal experts have engaged in a Silicon Valley parlor game of what the impact on Apple (AAPL) could be. In assessing both short- and long-term risks, viewpoints differ wildly - from outright fear to indifferent shrugs. \"Apple should be worried. My understanding is that [the impending lawsuit] relates to software including Apple iMessage and alleged monopolies over their software as a service,\" Chris Mattmann, an expert in artificial intelligence and adjunct research professor at the University of Southern California, said in an interview. \"Antitrust against Apple in the past has focused on hardware limitations that Apple imposes on vendors and also their specific lock-ins, including developing their own new AI/M2 chips.\" Mattmann expects a potential hit to Apple's stock price, especially over government scrutiny of iMessage as part of a Justice Department suit. \"There have been some issues with [iMessage],\" he said, and with how Apple customers who use apps from developer Beeper are unable to use iMessage on their Macs. But Mattmann could be in the minority. Analysts and investors, well-versed in government crackdowns against Apple and the rest of Big Tech over the past few years, are focused on the general economic picture and Apple's performance in particular. \"A lot of these issues have been around a long time, as evident by the Epic Games lawsuit, actions in the EU and rumors of a Justice investigation. This is not particularly news to Wall Street,\" Yuri Khodjamirian, chief information officer at Tema ETFs, said in an interview. He argued that the bigger immediate issue for investors is Apple's less-than-scintillating results in the past few quarters, along with projections of 3% growth this year. Khodjamirian isn't worried, though: He anticipates a healthy bump in iPhone sales, based on his estimates for the replacement cycle of the existing installed base of 2 billion Apple hardware devices worldwide. Apple does not break out iPhone numbers. Two analysts downgraded Apple shares earlier this month, but at least one believes the company's stock could soar nearly 25%: BofA analyst Wamsi Mohan is betting on long-term optimism about iPhone sales, foreign-exchange trends and strength in pockets throughout the world. Read more: Apple's stock could soar nearly 25%, BofA says, going against tide of skepticism Speculation about Apple's near future comes against the backdrop of the U.S. Supreme Court's decision on Jan. 16 not to hear appeals of an antitrust ruling on Epic Games Inc.'s lawsuit over App Store policies, along with a torrent of other legal scrums involving Apple. Apple won on nine of 10 counts in a federal court case in 2021, but Judge Yvonne Gonzalez Rogers ruled Apple violated California's unfair-competition law in limiting developers' ability to communicate with users outside the app or to use alternative payment systems. Last year, the Ninth U.S. Circuit Court of Appeals upheld her overall decision, prompting both Apple and Epic to appeal to the Supreme Court. Read more: Appeals of Apple-Epic antitrust ruling are denied The legal machinations prompted Apple to issue new policies that require developers to pay it a 27% commission if they use an alternative payment method - much like the company did in South Korea and the Netherlands following similar legal rulings in those countries. Epic Chief Executive Tim Sweeney said on X, formerly Twitter, that his company will contest Apple's new policies in the U.S. District Court for the Northern District of California. Sweeney described the tech giant's approach to complying with the judge's ruling to allow developers to  steer customers to payment options within their own apps as an act of \"bad faith.\" \"Once again, Apple has demonstrated that they will stop at nothing to protect the profits they exact on the backs of developers and consumers under their App Store monopoly,\" Spotify Technology (SPOT) said in a statement. Spotify filed an antitrust complaint against Apple in Europe in 2019. Other companies, such as Beeper and Life360's Tile, which makes a competitor to AirTags, have made similar complaints. Legal travails globally Worldwide, legal headaches are piling up for Apple Chief Executive Tim Cook and the company's army of attorneys. The company was recently listed among six that are considered \"gatekeepers\" by Europe's Digital Markets Act, a law that sets strict requirements to reduce anticompetitive behavior and that goes into effect March 7. Besides Apple, those companies are Alphabet Inc. (GOOGL) (GOOG), Amazon.com Inc. (AMZN), TikTok parent ByteDance, Meta Platforms Inc. (META) and Microsoft Corp. (MSFT). If companies do not comply with the rules laid down by the DMA, they can be fined up to 10% of global annual turnover, and up to 20% for repeated violations. The EC could also force gatekeepers to sell a business or parts of it, as well as ban them from acquiring services. On Friday, the European Commission said Apple will let third-party mobile-wallet and payment providers access the company's near-field communication, or NFC, capabilities in concessions following an antitrust investigation. Meanwhile, a U.S. ban on the sale of Apple Watch Series 9 models equipped with blood-oxygen sensors continues to bedevil the company in its patent dispute with Masimo Corp. (MASI). Read more: Apple Watch ban put back in place by federal appeals court amid patent fight The Justice Department's case against Apple is expected to start as the department awaits a federal court's decision on its antitrust lawsuit against Google and that company's search business. The latter case was the government's first major monopoly case to make it to trial in decades. In 1998, the Justice Department successfully sued Microsoft. That trial, strikingly similar to the current Google case, centered on claims that Microsoft illegally grouped its products in a way that stifled competition and compelled people to use its products. In an era when Apple has bundled its hardware and software into easy-to-use products for billions of customers, it will be difficult for the government to beat the company in court, Khodjamirian argues. \"Apple's approach has created value initially with better security and ease of use for consumers,\" he said. \"That presents a harder case for antitrust lawyers and the traditional definition of anticompetitive behavior.\" -Jon Swartz This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 01-22-24 0830ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}