{
    "title": null,
    "date": "1/23/2024",
    "url": "https://www.afr.com/technology/investors-to-look-for-ai-powered-gains-during-big-tech-earnings-season-20240123-p5ezh4",
    "text": "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login San Francisco | Investors will look for signs that multibillion-dollar investments made by big tech companies into developing artificial intelligence are translating into financial gains, as the “Magnificent Seven” report their annual earnings over the coming days. Apple, Microsoft, Meta, Amazon, Alphabet, Nvidia and Tesla propped up the S&P index of blue-chip US companies last year as investors grew excited about the potential of AI, generating 62 per cent of its total 26 per cent return for 2023. The S&P 500 closed at a new high on Friday after a blistering rally in tech stocks. Sissie Hsiao, vice president and general manager of Google Assistant and Bard (left), during the Fortune Brainstorm AI conference in San Francisco last month. Bloomberg Six of the seven companies – excluding Tesla, whose earnings are expected to decline – will drive the bulk of earnings growth on the S&P 500 when they report their fourth-quarter results over the next two weeks, analysts at Bank of America say. They added that year-on-year fourth-quarter earnings across the index would have declined without the six companies. Enthusiasm for big tech stocks has accelerated thanks to hype around generative AI – systems that can spew out humanlike text, images and code within seconds – with the cutting-edge technology promising massive productivity gains while shaking up whole industries. Their shares delivered an average gain of 105 per cent over past year. Over the upcoming earnings season, investors will be closely monitoring divergent fortunes among the companies, to see signs of which group is moving fastest to profit from the AI boom. “Investors will all be focused on Microsoft earnings in the last week of January because that is a sneak preview of what’s coming for the rest of software and chips over the next 12 to 18 months,” said Daniel Ives, research analyst at Wedbush Securities. “This is a key period laying the groundwork for who is going to win in the AI arms race.” Microsoft and chipmaker Nvidia have been on the front foot of the AI revolution so far. Microsoft kicked off a flood of deals between big tech companies and AI start-ups when it announced a $US10 billion investment in OpenAI last year, becoming the biggest backer of the makers of AI-powered chatbot ChatGPT. Revenues at Microsoft’s subscription AI software Copilot and cloud computing service Azure – both poised to grow from the group’s integration with OpenAI technology – will be closely watched as an early barometer for cashing in on AI this year. The recent tumult at OpenAI, where Sam Altman was removed as chief executive before being quickly reinstalled, appears to have had little effect on investor appetite in Microsoft, which once again overtook Apple as the world’s biggest company by market value this month. Meanwhile, stock in Nvidia, maker of market-leading AI chips, gained 239 per cent last year, within reach of surpassing Amazon’s market capitalisation of $US1.6 trillion ($2.3 trillion). While Microsoft and Nvidia have been the first to show clear revenue growth resulting from their AI products, analysts will be watching closely whether other big tech groups will update their financial forecasts this year as their AI investments begin to bear fruit. Competitors including Meta and Alphabet-owned Google have unleashed a wave of spending on AI start-ups and internal research and development as they rush to integrate the technology into their products. Also under scrutiny will be the groups forced to reinvest to tackle bigger growth opportunities in AI, such as by increasing spending on high-end chips that are in short supply. Google launched its first standalone AI consumer product in May with its Bard chatbot, followed by a second-generation model named Gemini in December. But critics said the company had been hemmed in by its hugely profitable search business and was cautious about introducing generative AI products that could cannibalise its business model. Apple and Amazon have been slower to announce big public investments in AI but are poised to roll out products that could be viewed as a bid to catch up. “Microsoft clearly has a lead with OpenAI integration and companies like Alphabet and Amazon are doing whatever they can to catch up,” said Colin Sebastian, senior research analyst at Baird. The fourth-quarter results will cap a year of resilience for big tech after the post-pandemic slowdown of 2022 forced the companies into lay-offs and further cost-cutting at the start of last year. Amazon Web Services, Microsoft and Google have benefited from growth in global enterprise spending on cloud services, while Meta and Google were buoyed by increased advertising and consumer spending as concerns about an economic recession in late 2023 failed to materialise. There have been hundreds more job cuts at companies including Google and Amazon this month, in some cases to reduce costs while boosting AI investment. But these are far fewer than in January last year, when Google, Meta, Microsoft and Amazon laid off between 6 and 13 per cent of workers, signalling a more buoyant start to the year for the sector. Earnings at Nvidia, Amazon, Meta, Google, Microsoft and Apple are expected to decelerate to year-on-year growth of 33 per cent in the first quarter of this year, according to consensus analyst estimates. Tesla shares have slumped this year ahead of fourth-quarter earnings after analysts revised down profit estimates. The flood of investment into AI in last year is expected to be followed by the integration of the technology into more applications this year, which could drastically shift the landscape of successful AI products. Analysts at Jefferies predicted that Amazon would launch an “all-out offensive to catch up in AI” this year. It launched Amazon Q, an AI-powered assistant for users of its cloud services, in November. Apple is rumoured to be accelerating its generative AI efforts this year, including the possibility of an iPhone that can run large language models despite the devices’ limited memory. In October, it discreetly launched an open-source AI model, “Ferret”, that is capable of understanding images. “Google and Amazon saw strong cloud activity this quarter because of the aggressive shift towards AI across the enterprise [business],” Mr Ives said. “That’s where the use cases [for AI] explode, and where [the companies] start to significantly benefit in terms of real monetisation.” Financial Times Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}