{
    "title": "Apple overtakes Samsung to gain world's largest smartphone-maker crown",
    "date": "1/16/2024",
    "url": "https://www.euronews.com/business/2024/01/16/apple-overtakes-samsung-to-seize-crown-as-worlds-largest-smartphone-maker",
    "text": "Apple has long led the smartphone market by revenue and profits; it has now overtaken Samsung to become the world leader by volume. Apple became the biggest smartphone manufacturer in the world in 2023, in terms of volume, surpassing Samsung and putting an end to its 12-year streak. Apple's success was largely fuelled by more consumers deciding to buy higher-end models, regardless of   price, because of their durability and features. Conversely, the past year saw Samsung focusing more on the mid and high-end markets, attracted by increased profitability. It lost share in the lower-end of the market. With increased competition from lower-end Chinese smartphone manufacturers such as Xiaomi, Oppo and Transsion, which have successfully grabbed the lion's share of the African smartphone market, Samsung could find it more difficult to reclaim its lost share. According to research group IDC, Apple claimed 20.1% market share in 2023 in terms of shipments, with Samsung coming in at 19.4% and Xiaomi at 12.5%. Oppo had an 8.8% market share and Transsion had 8.1%. The increase in volume marked a much-needed win for Apple in 2023, which experienced a somewhat difficult year. The US International Trade Commission banned the import and sale of the Series 9 and Ultra 2 Apple watches in the US at the end of last year, after determining that Apple had violated patent rights of medical device maker Masimo. The ban mainly concerned Apple Watch's blood-oxygen tracking technology in the two models, two of the newest in its range. Although Apple was able to restart selling the watches after a US appeals court temporarily halted the ban, the company still has to fight a hefty legal battle, as well as deal with the fallout on the product's prices. The company also announced it was looking at redesigning the two models, which could mean a watch software update. It is also likely that the new design will not contain pulse oximetry functionality. The smartphone maker has also seen falling demand in China, with Jefferies analysts estimating that Chinese iPhone sales in the last week of December plunged as much as 30% year-on-year. This was mainly due to other brands such as Huawei and Xiaomi delivering increasingly competitive and features-packed products. China has traditionally been a huge iPhone hub, with the company also having its biggest factory there. However, labour issues, Chinese trade laws and US-China tensions have escalated significantly over the years, leading to Apple facing a number of supply chain and production issues. This has led to the manufacturer now reportedly contemplating other production hubs, such as India, specifically Tamil Nadu and Karnataka, as part of a wider strategic and manufacturing shift. As a result, the iPhone 14s was produced in India, instead of China, although several other models and products are still being made in China.   "
}