{
    "title": "GM's Cruise, AV Industry Under Scrutiny In California As Driverless Vehicle \nReps Attend Hearing - Apple (",
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36960627/gms-cruise-av-industry-under-scrutiny-in-california-as-driverless-vehicle-reps-attend-hearing",
    "text": "With its fleet of robotaxis currently parked following an accident with a pedestrian in October, can Cruise, the autonomous vehicle (AV) operator, recover the reputational damage the incident has caused — not just for the GM GM-owned company, but for all operators of AVs? This is what GM is concerned with ahead of a Tuesday hearing held by state regulators regarding the company’s failure to disclose details of the October incident. Also Read: Uber, Lyft Can Hitch A Ride Higher If Q4 Earnings Beat Wall Street Estimates According to Reuters, the California Public Utilities Commission is holding the hearing as part of an investigation into GM’s failure to disclose details of an accident involving a self-driving car. On Oct. 2, a Cruise AV hit a pedestrian who was thrown into its path by another vehicle. The AV then executed a pull-over maneuver that dragged the pedestrian 20 feet at 7mph. The CPUC contends that when a Cruise official reported the incident to the commission, they omitted the details of the pull-over maneuver that caused significant injuries to the pedestrian. While Cruise has offered to pay $75,000 to resolve the CPUC investigation and has fired a number of executives in the aftermath of the incident, its entire fleet — which operated in San Francisco, Phoenix and Austin — was suspended by the company, which has since cut 24% of its workforce. The future of the AV market darkened further after San Francisco attorney David Chiu filed a lawsuit in December against the state of California, alleging that the CPUC allowed companies — including Cruise and Alphabet’s GOOGL Waymo — to expand despite safety issues. First reported by the Washington Post last week, the lawsuit asked the CPUC to review whether its decision to allow Waymo to operate its robotaxi service in the city was compliant with the law. The lawsuit contends that, despite hundreds of serious safety incidents reported by the public and city officials, “the commission approved requests by Cruise and Waymo to operate.” Meanwhile, several companies have cut or abandoned their research into self-driving vehicles. A year ago, Ford F and Volkswagen VWAGY announced the end of their AV joint venture following the closure of the Argo AI business. Earlier this year, Apple Inc AAPL, which has reportedly been in development for nearly a decade already, said it was pushing back its expected launch to 2028, according to a report by Bloomberg. And just last week, automotive technology manufacturer Aptiv APTV said it was reducing its stake in Motional, its self-driving technology joint venture with South Korean carmaker Hyundai. After incurring million of dollars of losses on the project, Aptiv added that it would provide no further funding. Now Read: Oil’s Comeback: Middle East Turmoil Pumps Life Into 2024 Markets Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}