{
    "title": "MacPaw’s Setapp becomes one of the first to agree to Apple’s controversial \nDMA rules",
    "date": "2/29/2024",
    "url": "https://techcrunch.com/2024/02/29/macpaws-setapp-becomes-one-of-the-first-to-agree-to-apples-controversial-dma-rules/",
    "text": "Mac and iOS software development company MacPaw is becoming one of the first to publicly adopt Apple’s new DMA (Digital Markets Act) rules in the EU, to offer Setapp, its subscription-based platform of curated apps, to Apple customers on iOS and Mac in the region. The move is notable given the pushback Apple has received on its compliance with the new EU regulation so far. A number of companies, including Spotify, Fortnite maker Epic Games, Microsoft, Mozilla, Proton, and others have called Apple’s new system “extortion,” and “malicious compliance,” and issued in “bad faith.” At issue is how Apple plans to charge a new core technology fee, that allows the iPhone maker to continue to profit from apps that are distributed outside its App Store. Those apps will still have to pay Apple €0.50 for each first annual install per year over a 1 million threshold, making it an expensive move for larger app or game makers with millions of users or players. Apple justifies the fee by pointing out that it offers more than the App Store and payment processing; it also offers the mobile platform iOS and all the tools to build and share apps on iOS as well. Though others have fought against Apple’s DMA rules, MacPaw has chosen to opt in — a one-way conversion that offers no ability, at present, to return to Apple’s existing rules. In doing so, MacPaw plans to offer a beta version of its Setapp subscription service in the EU this April, after the DMA regulation has kicked in. Image Credits: MacPaw Setapp Image Credits: MacPaw Setapp The subscription service will offer premium, ad-free apps from over 20 developers, including SnapMotion, PhotosRevive, Rocket Typist, Dropshare, Expenses, Elk, BusyCal, Letterly, Studies, Focused Work, Be Focused, Cloud Outliner, SideNotes, Awesome Habits, Elephas, GetSound, PDF Search, SQLPro Studio, Taskheat, and ClearVPN. These apps encompass a variety of categories, including productivity and business tools, creative and design software, lifestyle tools, utility apps, and more. The current version of Setapp offers dozens of apps for $9.99 per month and up, depending on the platform and number of devices. The EU version’s pricing has yet to be announced. The company tells us participating developers aren’t prevented from marketing their app separately under the App Store with a different bundle ID, but the choice of where to buy the app will be left up to the EU consumer. While the service is being likened to an alternative app store, to be clear, it will involve a subscription for all-you-can access to its apps, which is not Apple’s App Store model. Given the concerns about the additional fees that come with the new rules, it’s unclear if this will ultimately be a profitable move for the software company. As for developers looking for additional distribution, however, another channel for reaching iOS users could be beneficial if MacPaw’s terms are agreeable. MacPaw couldn’t predict whether or not the move will help grow its revenue at this time. “Creating a profitable business model requires both time and market feedback,” said Oleksandr Kosovan, CEO at MacPaw, in an email shared with TechCrunch. “We are committed to investing in this opportunity, doing everything within our power to enhance our customers’ experience and deliver greater value to the developers who align with our model,” he noted. MacPaw has already accepted Apple’s new terms, we’re told. Now the company is inviting customers and developers to join the waitlist for the beta, which it expects to grow over time. "
}