{
    "title": "Are Magnificent 7 Stocks Dead? The Analyst Behind the Moniker Thinks So.",
    "date": "2/23/2024",
    "url": "https://www.tradingview.com/news/investorplace:a92ba7aad094b:0-are-magnificent-7-stocks-dead-the-analyst-behind-the-moniker-thinks-so/",
    "text": "Mike O’Rourke, chief market strategist at Jones Trading and creator of the “Magnificent Seven” name for Big Tech stocks, believes the title has already lost its functionality. Indeed, O’Rourke recently released a note titled, “R.I.P. Magnificent Seven Era,” arguing the tag is now defunct. Is he right? According to O’Rourke, who claims to have made the moniker in spring 2023, the Magnificent Seven refers to the main seven stocks that have driven market sentiment recently. O’Rourke believes the term is no longer adequate to describe the major market movers. The Magnificent Seven, as it is currently known, consists of Alphabet GOOG, Amazon AMZN, Apple AAPL, Meta META, Microsoft (MSFT), Nvidia NVDA and Tesla TSLA. However, O’Rourke now maintains that Meta and Nvidia represent the two titans of the original seven. He even suggests they may merit their own title, perhaps “The Terrific Two.” “It was last April when we coined the term ‘Magnificent Seven’ to encapsulate the seven largest stocks in the S&P 500 as they drove 88% of the index’s gains in the first 4 months of 2023,” O’Rourke noted Thursday. “Today’s events, along with others that unfolded thus far in February 2024, have sown the seeds for the end of that remarkable run.” Nvidia’s Recent Surge Fuels Speculation That ‘Magnificent 7’ Has Dropped to Just 2 O’Rourke’s claim isn’t without precedent. Nvidia added a record $277 billion in market capitalization Thursday, following the company’s outstanding Q4 earnings report Wednesday. In doing so, Nvidia broke Meta’s previous record set earlier this month. “These two companies, along with these moves, are playing a prominent role in slaying the Magnificent Seven as we know them,” O’Rourke wrote. “This earnings season has shown that Nvidia and Meta Platforms have both lower multiples and significantly faster growth than other Magnificent Seven names, and that is why other members will be deemed less attractive given their expensive multiple and megacaps status.” O’Rourke also commented on the potential weaknesses of other members of the Mag 7 in comparison to Meta and Nvidia. Indeed, according to O’Rourke, Alphabet, Microsoft and Amazon all have major hurdles to jump to have growth potential comparable to META and NVDA. Tesla is a particularly tough fit within the Magnificent Seven, as it is forecasted to show a dip in earnings, while still trading at 65 times forward earnings. Indeed, Tesla is easily the biggest loser in the group this year. It is down about 22% year-to-date, at the time of writing. “When the valuation and growth prospects become this distorted among leadership names, investors will start rotating towards the winners and maybe even look elsewhere for new opportunities,” O’Rourke said. It’s worth noting that not everyone is in agreement that O’Rourke coined the term Magnificent Seven. Indeed, some maintain it was Michael Hartnett, Bank of America analyst. However, it is still difficult to say who was truly first. On the date of publication, Shrey Dua did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. With degrees in economics and journalism, Shrey Dua leverages his ample experience in media and reporting to contribute well-informed articles covering everything from financial regulation and the electric vehicle industry to the housing market and monetary policy. Shrey’s articles have featured in the likes of Morning Brew, Real Clear Markets, the Downline Podcast, and more. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @lewicz.michal @hiramedina @mytradingsetup @Cenobar @mytradingsetup @horibuful @fx_papi @setupstrading @olka_gadzieva GMS @globalsignals_ @TradingView @rajpalgore @mytradingsetup @neo_inversion @chartfeed @captainkolbaska @mytradingsetup @life_of_lorena.fx Whatever the trade "
}