{
    "title": "Apple might develop smart ring, smart glasses, AirPods with camera and \nmore: Report",
    "date": "2/26/2024",
    "url": "https://www.businesstoday.in/tech-today/news/story/apple-might-develop-smart-ring-smart-glasses-airpods-with-camera-and-more-report-418911-2024-02-26",
    "text": "Feedback After Samsung, Apple is likely to launch its own smart ring, as per reports. The company is also expected to launch its smart glasses and new AirPods with integrated cameras to offer AI features. This hints that Apple is committed to expanding its foothold in the market. Notably, with products like Apple Watch and AirPods, wearables contribute to 10 per cent of the company’s earnings. Apple Smart Ring According to a report by Bloomberg's Mark Gurman, the Apple fitness ring is likely to track key health metrics just like Apple Watch. Users who do not like to wear watch can opt for this one for health related features. It might even come with more long lasting battery than an Apple Watch. Gurman even hinted that this smart ring could be a cheaper alternative of Apple Watch that can easily sync health and fitness data when paired with iPhone. If released, it will compete against the likes of Oura Ring and Samsung’s Galaxy Ring. Apple AR Glasses After the big launch of Apple Vision Pro headset, Apple is expected to launch new AR glasses. With feature like integrated speakers, AI features, health features and cameras that can identify the environment, these smart glasses can be a replacement of AirPods. These glasses will go up against the likes of Meta's Ray-Ban Smart Glasses and Amazon's Echo Frames. Gurman stated that these glasses are in a “technology investigation” stage within Apple’s hardware engineering division. Hence, the release is expected to be quite far as of now. Apple AirPods with camera People who don’t like to wear spectacles, can opt for AirPods with cameras and health sensors. Last year, Apple started exploring how it can integrate low-resolution camera sensors in AirPods. Gurman hints that whenever these AirPods release, they will focus on assisting people with daily routines. For the unversed, Samsung is set to launch its first smart ring called Galaxy Ring at the ongoing MWC 2024 event in Barcelona, Spain. Also Read: ‘I continue to remain CEO’: Byju Raveendran asserts continued leadership amidst company turmoil Trai recommends introduction of CNAP Supplementary Service for caller name display on phones; see details Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}