{
    "title": null,
    "date": "2/14/2024",
    "url": "https://ca.news.yahoo.com/apple-just-pulled-piracy-app-201952990.html",
    "text": "Apple removed Kimi, a platform that showed pirated movies and shows for free, from its app store. The app ranked higher than Netflix's app and got over 100 reviews before it got pulled, per Wired. The removal appears to follow Apple's intellectual property guidelines for its apps. Apple appears to have removed Kimi, a piracy app that once featured a library of free films and shows to stream, from its iOS app store, Wired reported earlier this week. The app for bootlegged entertainment included movies nominated for the 2024 Oscars, such as \"Poor Things\" and \"Killers of the Flower Moon,\" Wired found. It also featured TV shows like \"RuPaul's Drag Race\" that are currently releasing new episodes. Screen quality varied depending on the selected content, and an ad for online casinos covered the top of the screen, according to the outlet. But janky resolution and spammy pop-ups didn't stop users from downloading the app. Before it vanished, Kimi rose the ranks in the tech giant's app store — beating the likes of apps from Netflix, Hulu, and Amazon Prime Video on Apple's \"Top Charts\" for the \"Top Free Apps\" in the entertainment category, Wired reported on Tuesday. The app also reportedly garnered over 100 user reviews in the App Store. It's unclear who exactly was behind the app. The app store, Wired observed, listed Kimi's only developer as \"Marcus Evan,\" which could be the creator's fake name. Business Insider was unable to reach \"Marcus Evan\" or Kimi ahead of publication. When asked about the app, Apple told BI that Kimi used a bait-and-switch tactic to make it through its approval process by presenting itself as a vision-testing platform. Apple said it immediately removed Kimi once it caught the lie and has zero tolerance for apps that change after they are reviewed. The company's guidelines around intellectual property contain language that suggests it prohibits piracy apps. \"Make sure your app only includes content that you created or that you have a license to use,\" the tech giant's app store guidelines say. That includes streaming of audio and video content and access to third-party services. \"Your app may be removed if you've stepped over the line and used content without permission.\" This isn't the first time Apple pulled a piracy app. In 2015, Popcorn Time, an app akin to Kimi, reportedly raked in millions of users looking to watch free movies and shows, Wired previously reported. Popcorn Time is now nowhere to be found on the app store. But the company hasn't just cracked down on piracy apps. In 2019, Apple removed 18 apps it deemed harmful for violating its policies on adware. Two years later, the iPhone maker banned Parler, a social media app once popular among Trump supporters and members of the far-right — after claiming it promoted violence. Do you have a story to share about Apple? We'd love to hear it. Contact BI reporter Aaron Mok at amok@insider.com. Read the original article on Business Insider The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein  Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises. 連續13日閃購，PS5 Slim、Marshall、Switch OLED、AirPods Pro 2、DJI等人氣產品平到笑！ Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr.,  (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer “The Daily Show” host tears into the former president’s claim ― and shows why the case matters.  The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit.  The Ohio lawmaker was asked about Donald Trump’s debunked claims about the 2020 election. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Anne Hathaway told Vanity Fair during a cover story interview that Christopher Nolan more or less saved her career when public opinion turned against her in the lead up to and the aftermath of her winning the Oscar for “Les Miserables.” Hathaway was widely mocked online at this time, and she once remembered googling herself …  The president has been going after his presumptive 2024 opponent with a little more venom than usual President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… The rapper was caught off guard when her \"whole boob\" fell out of her top on stage "
}