{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.tuko.co.ke/business-economy/economy/537851-william-ruto-apple-employs-23000-workers-nairobi-drums-support-digital-economy/",
    "text": "Global site navigation Local editions PAY ATTENTION: TUKO is in WhatsApp Channels now! Subscribe and read news in favourite messenger. Elijah Ntongai, a journalist at TUKO.co.ke, has more than three years of financial, business, and technology research expertise, providing insights into Kenyan and global news. Dubai - President William Ruto lauded the significant advancements achieved by Kenya in the technology sector during his address at the World Governments Summit held in Dubai, United Arab Emirates. Emphasising the potential of the digital economy, he underscored the transformative opportunities it offers for Kenyan youth. Read also Kenya Newspapers Review, Feb 13: William Ruto Embarks on Another Tour of Restive Mt Kenya Region President Ruto showcased Kenya's position as a regional leader in technological innovation, commending the success of M-Pesa, the mobile banking platform, as a homegrown solution that has revolutionised financial services in the country. PAY ATTENTION: Click “See First” under the “Following” tab to see TUKO News on your News Feed During his speech, President Ruto shared insights from his trip to the United States in September last year for the US-Kenya Business Roadshow. He recounted a conversation with Tim Cook, the CEO of Apple, where he learned that the multinational corporation employs approximately 23,000 Kenyans in Nairobi alone. In his speech, the president featured Brian Kipchumba, who recently showcased his digital skills to the president at an ICT HUB in Nandi, as an example of the digital transformation in Africa. President Ruto expressed his optimism about the myriad opportunities available to young Kenyans, highlighting the impact of remote work facilitated by the digital economy. Read also Alex Chamwada Overjoyed as Daring Abroad Show Launches Diaspora Investment Forums for Kenyans He noted that individuals can now work for global employers without the need to leave their homes, citing examples of Kenyan youth employed by international companies while residing in their homeland. Following the president's speech, Kenyans on X questioned the validity of the statement that Apple employs 23,000 Kenyans to work from Nairobi. @Haaland_sholla said: @kachwanya said: @karenkingahi17 said:   Ruto announced plans to secure jobs for Kenyans in the digital economy and is launching digital hubs in all wards for youths to access computers and the internet. Read also Babu Bashir: Kenyan Man Running Thriving Car Wash Business in Saudi Arabia While launching the ICT hub in Bungoma county, Ruto said youths have to appear for training and then start clicking on the computers to earn dollars. A Kenyan content creator released a satirical video pressing a laptop keyboard, and dollars were ejected underneath the machine. PAY ATTENTION: check out news exactly for YOU ➡️  click on “Recommended for you” and enjoy! Source: TUKO.co.ke Recommended for you      Check more articles for you "
}