{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.businessinsider.com/dropped-iphone-water-dont-dry-it-in-rice-apple-says-2024-2",
    "text": "       Have you ever been told to put your iPhone in a bowl of rice after accidentally dropping it in the sink or — even worse — toilet? You might just be making the problem worse. Earlier this year, Apple quietly published new guidelines on what to do when water gets into your iPhone. Typically, when phones, or any electronic devices, get wet, one common course of action is to put them in uncooked rice. The theory is that the raw grains can absorb the moisture. But Apple's latest support document discourages iPhone users from doing that, saying that small grains of rice could actually damage your phone if, say, particles get lodged into the ports. Related stories According to Apple, you also shouldn't try to dry your moist iPhone by inserting a \"foreign object\" like a cotton swab or paper towel into the port, or use an external heat source like a blow dryer. Still, the updated guidelines offer a few suggestions on what users can safely do. For example, if you plug your iPhone into a wall outlet with a lightning accessory and a \"Liquid Detected\" alert appears, immediately unplug the cable from both ends. Once the cable is disconnected, gently tap your iPhone against your hand with the port facing the floor to allow excess liquid to escape. After that, store the phone in a dry area where there's some airflow for at least 30 minutes, then try charging it. If the liquid detection alert appears a second time, unplug and leave your phone to fully dry for up to 24 hours. After waiting, try charging the phone again. If the phone still isn't charging, momentarily unplug the cable from the adapter and the adapter from the wall, then reconnect them. And if all else fails, you may need to bring your iPhone to a repair shop or, at worst, consider getting a replacement. Nevertheless, your wet phone may still have a likely chance of surviving. A video of an iPhone 6 drop test showed that the 2014 version continued to work after being dunked underwater. Years later, the iPhone 11 Pro passed a similar water resistance test. Apple didn't immediately respond to a request for comment from Business Insider before publication. Read next Jump to "
}