{
    "title": "Apple to settle trade secrets lawsuit against chip startup Rivos",
    "date": "2/10/2024",
    "url": "https://www.moneycontrol.com/news/business/apple-to-settle-trade-secrets-lawsuit-against-chip-startup-rivos-12237511.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Apple opens new tab plans to settle a lawsuit that accused tech startup Rivos of stealing its trade secrets related to computer-chip technology, according to a joint court filing on Friday in California federal court. The companies told the U.S. District Court for the Northern District of California, opens new tab that they had \"signed an agreement that potentially settles the case,\" and that the agreement allows Apple to examine Rivos' systems and recover any confidential information. Representatives for Apple and Rivos did not immediately respond to requests for comment and more information about the settlement.Apple sued \"stealth\" startup Rivos in 2022. It said Mountain View, California-based Rivos had hired away dozens of its engineers and used its confidential information to develop competing \"system-on-chip\" (SoC) technology. SoCs are integrated circuits with several computer components in a single chip, including central processing units and graphic processing units. Apple said in the lawsuit that it spent billions of dollars and more than a decade of research on its SoC designs, and that they have \"revolutionized the personal and mobile computing worlds.\"Rivos denied the allegations and claimed that Apple had \"sought to punish Rivos and any Apple employees who may seek to work there since the moment Apple learned about the promising startup.\" It countersued Apple last September for unfair competition.Apple settled related claims in the case last month against six former employees who left the company to join Rivos. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}