{
    "title": "Sam Altman shares his first thoughts about Apple Vision Pro",
    "date": "2/12/2024",
    "url": "https://www.androidheadlines.com/2024/02/sam-altman-apple-vision-pro.html",
    "text": "Sign Up! \n\nenvelope_alt Get the latest Android News in your inbox every day \n\narrow_right Sign up to receive the latest Android News every weekday: Only send updates once a week Apple / Sam Altman shares his first thoughts about Apple Vision Pro Apple recently took the wraps off one of the biggest releases in a long time, the Apple Vision Pro. There’s no denying that it hasn’t made enough buzz in the industry, and reports also suggest that it’s being sold for a higher price in other markets, due to its US-only availability. Subsequently, industry leaders such as Sam Altman were among the first ones to drop a quick review of Apple Vision Pro. OpenAI chief Sam Altman took to X to share his quick review of the Apple Vision Pro. He believes it’s the “second most impressive tech since the iPhone.” On the same post, another user commented that it probably has the worst name. However, Sam Altman quickly responded, “ChatGPT is a lot worse. [sic]”Advertisement\n\n\nAdvertisement Of course, we don’t know whether he tried the Apple Vision Pro or not but a compliment from someone, who has changed his tune of the generative AI space, does matter. He doesn’t delve into more details as to why he believes so. But a comparison with the first-generation iPhone means that he believes that Apple’s Vision Pro has the potential to become the next big thing in tech. Elon Musk, too, was among the early adopters of the Apple Vision Pro. However, his appraisal of Apple’s latest release is mixed. Musk concedes that the Vision Pro failed to surprise him. He draws a parallel with the first-generation iPhone, suggesting there’s ample room for improvement in the Vision Pro. Bloomberg’s Mark Gurman notes that there’s more to this and essentially, this is just the prototype of the final product. He further adds that the Apple Vision Pro will not affect the sales of or replace the iPhone or Mac; rather, it will impact the iPads. For those unaware, Apple Vision Pro is up and selling for $3500 for the base variant in the US. Apple is also giving 30-minute one-on-one demos to experience visionOS, made specifically for the Apple Vision Pro. Copyright ©2024 Android Headlines. All Rights Reserved. Abhinav Anand is an independent tech journalist with a passion for mobile phones and operating systems. His work has so far been featured in Financial Express, Economic Times, KnowTechie, and PhonesWiki.\nHe's been fascinated by tech ever since he got his hands on a Windows XP-powered PC, and he's been reading and writing about it ever since. He's even so passionate about tech that he'd fumble over saying \"A-B-C-D-E\" but never \"Q-W-E-R-T-Y.\"\nAbhinav has a love-hate relationship with AI. He loves the possibilities it offers, but he also hates the way it can be used to manipulate people. When he's not writing a story or review, Abhinav is either reading or cooking up a storm in the kitchen. Main Deals & More Android News Sign Up! \n\nenvelope_alt Get the latest Android News in your inbox every day \n\narrow_right Sign up to receive the latest Android News every weekday: Only send updates once a week "
}