{
    "title": "The Apple Vision Pro has a “guest” mode for your friends to try it",
    "date": "1/16/2024",
    "url": "https://www.theverge.com/2024/1/16/24039995/apple-vision-pro-guest-mode-friends",
    "text": "By  Emma Roth, a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO. Apple’s Vision Pro headset will come with an option that lets you share it with friends and family members — a feature currently available on nearly every other headset. In a press release on Tuesday, Apple says you can let a “guest user” who’s not registered to the device try out certain apps and experiences, without needing to set up an account on the device. Although not explicitly mentioned by Apple, it seems guest users will be able to bypass the headset’s Optic ID requirement that unlocks the device upon scanning your iris. Apple doesn’t go into too much detail about how this will all work, but the company notes guests may access “some app content, such as large photo attachments, in Messages” while the Settings app is open. Additionally, Apple says it will restrict Apple ID settings, Optic ID, passcode, passwords, Apple Pay, Persona, and health data while a guest is using the headset. When Apple first announced the Vision Pro headset, the company never made it clear how or if you could share the $3,499 device. But last year, 9to5Mac found a “Guest Mode” available within the visionOS software development kit, which would let users create a password that gives their friend or family member access to the Vision Pro’s app. Apple didn’t confirm the feature’s existence until now. Along with a mention of guest users, Apple also confirmed rumors that you’ll be able to use a travel mode “to stabilize visuals” if you ever get the urge to use it while on a plane. The Vision Pro will come with 3D movies and experiences from Disney Plus as well as support for streaming apps like Amazon Prime Video, Paramount Plus, Peacock, and others when it launches on February 2nd. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}