{
    "title": "Apple Vision Pro Hits Stores Friday: iPhone-Like Frenzy Missing For AR \nHeadset, But Analysts Expect 500K-",
    "date": "1/30/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36850102/apple-vision-pro-hits-stores-friday-iphone-like-frenzy-missing-for-ar-headset-but-a",
    "text": "Apple Inc AAPL’s highly anticipated Vision Pro headset hits the market this week and initial sales suggest strong demand for the augmented reality device. The official launch is on Friday and in-store demos are expected to boost interest globally. The dynamics of its pre-order sales have sparked insights from renowned analyst Ming-Chi Kuo and Wedbush Securities. Despite a successful launch, Vision Pro didn’t fly off shelves as rapidly as expected, with extended shipping times indicating initial inventory sell-out. Analyst Ming-Chi Kuo estimated 160,000 to 180,000 units sold during pre-orders, expressing concerns about sustained demand as shipping times remained unchanged 48 hours after pre-orders opened. Unlike iPhone sales, Vision Pro’s slower uptake hints at potential demand tapering after the initial surge from core fans and heavy users. A MacRumors report aligns with Kuo’s estimates, citing around 200,000 units sold in the two-week pre-order period. Despite reservations, Kuo remains optimistic about Apple’s potential to sell 500,000 units, leveraging its vast user base. Kuo acknowledged Vision Pro as a “very niche product” and emphasized its limited market appeal compared to mass-market devices. Significant demand prompted Apple’s supply chain, including Luxeshare in China, to work overtime during the Lunar New Year, highlighting the company’s commitment to meeting Vision Pro demand. Despite not matching the iPhone-like frenzy initially, sustained interest and increased production efforts suggest Apple’s AR venture gains traction within its user base, with strategic moves closely monitored in the coming months. See Also: Zoom Unveils Futuristic Meeting Features For Apple Vision Pro With A New App “With strong pre-orders coming out of the gates over the last week we now expect Apple to ship and sell roughly 600k+ Vision Pro headsets for 2024” said analyst Daniel Ives from Wedbush. Currently featuring 230 native apps, the Vision Pro platform anticipated doubling to nearly 500 apps by summer, indicating a growing ecosystem. Ives projected future iterations, like Vision Pro 2, to have lower price points below $2,000, aiming for broader user adoption and initial sales of over 1 million units for FY25. Vision Pro is Apple’s strategic entry into AI, setting the stage for a separate AI App Store discussed at WWDC this summer. The vision involves seamless integration with other Apple devices, unlocking consumer AI applications across health, fitness, sports content and autonomous technologies. Despite some market skepticism, Ives sees Vision Pro as a foundational step toward a broader technological future envisioned by Apple’s leadership. Wedbush Securities maintained an Outperform rating on Apple stock with a $250 price target. Read Next: ‘History Will Repeat Itself:’ Munster Warns Meta Welcoming Headset War With Apple Echoes BlackBerry’s Greeting To Cupertino’s 2007 Smartphone Debut Photo: Courtesy Apple © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}