{
    "title": null,
    "date": "1/23/2024",
    "url": "https://www.marketwatch.com/story/apples-mac-turns-40-bringing-back-memories-of-the-companys-once-renegade-ways-5b3d88f3",
    "text": "As Apple nears the 40th anniversary of one of its most groundbreaking products ever, the Macintosh, it is also a reminder to investors that the company that revolutionized the personal computer is now a middle-aged tech giant. Apple’s \n        AAPL,\n        -0.50%\n       innovation and contribution to the history of personal computing is profound. The company, and the renegade team led by co-founder Steve Jobs, turned the PC into a machine that was actually personal, easier to use and more compact in size. The Macintosh included the innovation of the graphical user interface and the mouse. From the archives (2014): The Mac team reunites after 30 years And as investors who have followed Apple for years likely remember, the Mac was not an immediate hit when it debuted on Jan. 24, 1984. But eventually, its influence spread far and wide. Microsoft Corp. \n        MSFT,\n        +0.39%\n       copied the mouse and the graphical user interface, and as Creative Strategies Chairman Tim Bajarin recounted in a recent piece in Forbes, the Mac and software designed for it helped create the desktop-publishing industry. The big anniversary is being feted in Silicon Valley on Wednesday, where the Computer History Museum will host an “Insanely Great” event and panel discussion, with stories from some of the original Macintosh team members. Visitors to the museum can also see an original Mac and early electronic parts and prototypes, like an original wirewrap prototype No. 4, a gift from Macintosh software engineer Andy Hertzfeld, and a Mac main logic board. One longtime Apple employee,  Chris Espinoza, who has worked there for 46 years, is on the panel. But it appears the Mac’s 40th birthday will not be celebrated at Apple itself. The Cupertino, Calif., tech giant did not have any obvious references to the milestone on its website as of Tuesday, and an Apple spokeswoman did not yet respond to a query about how the company was commemorating the event. Apple has had a tough year. The company has seen four consecutive quarters of falling revenue, and the December quarter is forecast to see flattish growth. Its stock looks more expensive than some of its peers in Big Tech. The U.S. Department of Justice is reportedly preparing a sweeping lawsuit against the company while Wall Street analysts wonder what its next big product will be. And some believe the forthcoming Vision Pro mixed-reality headset will be a niche product, and not a blockbuster like the iPhone. Companies, like humans, tend to get bigger, slower and lose their nimbleness as they age.  Apple has come back from far worse, as when Jobs returned as CEO and led the company out of near-bankruptcy and made major strides in innovation. But a big question continues to hang over the tech giant — can a company with a $3 trillion market value continue to grow and innovate as it has in the past? The 40th anniversary of the Mac and its daring, rambunctious past is perhaps a birthday that the company would rather just ignore.     The EV company had been in talks with a big carmaker about a potential transaction, but that company has terminated negotiations. Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. Visit a quote page and your recently viewed tickers will be displayed here. "
}