{
    "title": "The latest news, headlines, and business stories for January 9",
    "date": "1/9/2024",
    "url": "https://www.businessinsider.com/news-today-january-9-apple-vision-pro-2024-1",
    "text": "       Hi! CES officially kicks off today, but I've already seen some wild tech, including a transparent TV. (More on that below.) In today's big story, we have a release date for Apple's next big product. What's on deck: Markets: The economy is entering its first \"super cycle\" in 40 years. Tech: Carta is in hot water for secretly using client information. Business: Tiger Woods and Nike are splitting ways after nearly three decades. But first, can you try this headset on? If this was forwarded to you, sign up here. Apple's new reality On the eve of the biggest tech conference, a company not officially in attendance had the day's biggest news. Apple, which typically avoids a large public presence at CES, announced the launch date of its Vision Pro, a mixed-reality headset it hopes will eventually be its biggest product since the iPhone. You can buy the Vision Pro online and in US Apple Store retail locations starting February 2, as long as you're willing to fork over at least $3,499. Business Insider's Sarah Jackson has all the details on Apple's big upcoming launch. The release of the Vision Pro has been a long time coming. We got our first look at it in June, but the rumors about Apple launching a VR-type product had swirled for a while. And with tech rival Meta having been in the space for a few years, it seemed natural Apple would enter the fray. But Apple doesn't launch a new product on a whim — its last big product launch was over eight years ago — so this release is a big deal. There has also been a level of mystery surrounding the Vision Pro. The initial reviews of the headset were good, but it was all very cloak and dagger. Journalists who tested it back in June could only do so in a private room, couldn't take photos or videos, and only had 30 minutes. The launch of the Vision Pro feels like a make-or-break moment for virtual reality. The concept of using some type of goggles to create a virtual reality has existed for decades. Old-school gamers will remember Nintendo's ill-fated Virtual Boy, which was one of the company's biggest failures. But in the almost 30 years since, now feels as good a time as any for the tech to finally take off. Add in the fact that a good chunk of employees are working partially from home, and there are real use cases for it. Beyond it feeling like a cultural turning point for the tech, there's also the fact that the most valuable company in the world really wants it to work. With a market cap nearing $3 trillion, Apple isn't hurting. But the company is facing its fair share of headwinds, from a ban on Apple watches to underperformance in China, one of its major markets, Apple could use a big win, and the Vision Pro could be just that. As BI's Julie Bort previously wrote, the headset could be at the core of creating a multi-billion dollar market for entertainment. A recession could still be possible. Talk of a \"soft landing\" has been ramping up lately, with lower inflation and strong employment numbers driving the conversation. But according to Deutsche Bank, such trends could indicate a downturn. Markets are stumbling, despite a red-hot end to 2023. On Friday, the S&P 500 notched its first losing week in 10 weeks, bond prices dropped by the most since October — and strategists are saying investors may have gotten ahead of themselves in December. The economy is on the verge of a new \"super cycle.\" The coming super cycle, or period of rapid expansion, is underpinned by AI and decarbonization, a Goldman Sachs analyst said. The chip industry's false promise. America is spending $52 million to counter China's edge in semiconductor chips. But economic conditions, construction slowdowns, and the slow distribution of government funds have dampened the promised semiconductor job boom. The latest tech flex — a transparent TV. LG calls it \"the world's first wireless transparent OLED TV.\" The device can double as a digital fish tank, fireplace, or other artwork. And the company said it could make rooms feel larger or give owners more options with home decor. Silicon Valley is blasting Carta for misusing customer information. Carta handles sensitive information for more than 30,000 startups. And now, it's under fire by companies like Linear for secretly using client information to fuel its brokerage business. \"Below Deck\" cast members say they were underpaid, subject to racist comments, and cruelly manipulated. The show's stars are paid a fraction of what a Real Housewife makes, despite working grueling 18-hour days and getting sky-high ratings. Tiger Woods ends partnership with Nike. The pro golfer spent nearly three decades as a Nike athlete. Woods' most recent contract (signed in 2013) reportedly earned him $200 million over 10 years. Boeing CEO has a fresh nightmare. After years of struggling, 2024 was meant to be the year things turned around for Boeing. But Alaska Airlines' near-disaster threatens to disrupt that. Plus, United Airlines just discovered loose bolts in its Boeing 737 Max 9 fleet. Home prices are forecast to fall in these 34 cities. Some Gen Z jobseekers are bringing mom and dad to interviews and it's turning off employers, new survey finds. In venture capital, layoffs, restructuring, and \"quiet firing\" indicate it's open season on investing jobs. Now, some VCs are seeking a fresh start. The best work-life balance advice came from my 24-year-old boss. Here are the five lessons I carry with me at every job. How to Win Friends and Influence People: The Sam Altman Edition. I graduated from college early to save money. It wasn't worth it. Photos show what it's really like to live in Las Vegas, from grocery-store slot machines to tarantula sightings. Bitcoin could soar 344% to $200,000 by the end of next year as ETF approval drives huge inflows, Standard Chartered says. The Fed will slash rates six times this year as recession spreads across the US and the job market deteriorates, market veteran says. Elon Musk says \"3 years of random testing\" found no traces of drug use as he fires back at bombshell WSJ report. Angela Bassett will receive an honorary Oscar. The annual ceremony was rescheduled from November 2023, since the WGA and SAG-AFTRA strikes were still going on. Happy birthday, Flo Milli! Toosii, Richard Nixon, Kate Middleton, Sean Paul, Jimmy Page, and Emily Mariko were also born on this day. Earnings today: Albertsons, WD-40, Neogen, and other companies. Costco rotisserie chicken How a chef turns Costco's $5 chicken into a week of easy meals. They enjoy using it for quesadillas, burrito bowls, pastas, and other easy dishes. The Insider Today team: Dan DeFrancesco, deputy editor and anchor, in New York City. Diamond Naga Siu, senior reporter, in San Diego. Hallam Bullock, editor, in London. Jordan Parker Erb, editor, in New York. Hayley Hudson, director, in Edinburgh. Lisa Ryan, executive editor, in New York. Jump to "
}