{
    "title": "Microsoft Vs. Apple: Big Tech Giants' Valuation Gap Narrows to Just $30B",
    "date": "1/12/2024",
    "url": "https://markets.businessinsider.com/news/stocks/microsoft-vs-apple-big-tech-magnificent-seven-stock-market-analysis-2024-1",
    "text": "       Microsoft is just $30 billion in market capitalization away from snatching Apple's crown as the world's most valuable company as the AI investing frenzy powers its stock price higher. Shares in the Redmond, WA-based Big Tech company climbed 0.5% Thursday, meaning it's now up 2.3% year-to-date. Apple's stock fell 0.3%, extending its losses for 2024 to 3.6%. Microsoft was up as much as 1% earlier in the trading session, briefly passing the iPhone maker in valuation terms, before it pared back some of those gains later in the day. Apple's market capitalization stood at $2.89 trillion at the closing bell, according to data from Refinitiv. Microsoft was worth $2.86 trillion. The gap between the two \"Magnificent Seven\" rivals now stands at just $30 billion – the narrowest it's been since November 2021, per FactSet. Investors have piled into artificial intelligence stocks over the past year – and that's fueled a rally for Microsoft, which has poured tens of billions of dollars into the ChatGPT developer OpenAI and seen demand for its Azure cloud-computing division soar. Apple has taken a more cautious approach than its rivals on AI, while Wall Street analysts have also flagged slowing iPhone sales in China as a potential cause for concern. Earlier this month, Barclays warned of a slowdown in demand for Apple's products and slashed its rating for the tech stock to \"underweight.\" Its downgrade sparked a sell-off that wiped out over $100 billion in market cap in a single day. Apple and Microsoft have been rivals since the 1980s. Apple has been the most valuable US company in market cap terms since November 2021, with the gap widening to as much as $600 billion in August 2022, according to FactSet data. Axel Springer, Business Insider's parent company, has a global deal to allow OpenAI to train its models on its media brands' reporting. Read next Indices Commodities Currencies Stocks Jump to "
}