{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.tradingview.com/news/benzinga:19a300f4c094b:0-former-apple-engineer-sent-to-prison-for-stealing-trade-secrets-judge-recommends-teaching-math-in-prison/",
    "text": "A former Apple Inc. AAPL engineer, Zhang Xiaolang, has been sentenced to four months in prison for stealing trade secrets from the company. The stolen information was intended for a Chinese electric car startup. What Happened: Zhang, who pleaded guilty to a single count of trade-secret theft in August 2022, was accused of downloading a 25-page Apple document containing schematic drawings of a circuit board design for an autonomous vehicle, reported Bloomberg. The document was downloaded to his wife’s computer as he prepared to join a Chinese startup specializing in electric cars with autonomous driving features. See Also: Tim Cook Evades Elon Musk’s Fate As Judge Throws Out Lawsuit Accusing Apple Of Overpaying CEO, Other Execs By Tens Of Millions On Tuesday, U.S. District Judge Edward Davila in San Jose, California, issued the final judgment, proposing that Zhang serve his sentence in a minimum-security facility. The judge also recommended that Zhang be given the opportunity to teach math to other inmates. Why It Matters: The theft of trade secrets is a serious offense, as evidenced by the legal actions taken against other individuals in the tech industry. In 2022, Tesla filed a lawsuit against a former engineer for stealing information on the company’s Dojo supercomputer technology. The engineer was accused of illegally transferring confidential information on the supercomputer technology to his personal computer. In another case, a former engineer at Alphabet subsidiary Waymo was sentenced to 18 months in prison for stealing secrets related to self-driving technology and passing them on to Uber Technologies. The engineer was also ordered to pay restitution to Waymo and a fine. These cases highlight the severity of trade secret theft and the legal consequences that follow. Photo by Laurenz Heymann on Unsplash Read Next: Microsoft Back On Top, Dethrones Apple As World's Most Valuable Company Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @lewicz.michal @hiramedina @mytradingsetup @Cenobar @mytradingsetup @horibuful @fx_papi @setupstrading @olka_gadzieva GMS @globalsignals_ @TradingView @rajpalgore @mytradingsetup @neo_inversion @chartfeed @captainkolbaska @mytradingsetup @life_of_lorena.fx Whatever the trade "
}