{
    "title": "People are dragging Apple's Finewoven cases",
    "date": "2/26/2024",
    "url": "https://www.businessinsider.com/people-are-dragging-apples-finewoven-cases-2024-2",
    "text": "       Apple's Finewoven iPhone cases don't seem to be holding up. Since hitting the market last September, the Finewoven case was marketed as a luxurious case for the iPhone that could replace Apple's leather ones. But some iPhone 15 users have taken to social media to complain about the current physical condition of their cases. \"The edges are peeling, the fabric is scratched up like an old CD and it's browning like a rotten banana,\" reporter Joanna Stern wrote in The Wall Street Journal's \"Tech Things\" newsletter after using the case for five months. \"I've been waiting for the CDC to show up at my house to declare it a biomedical concern.\" John Gruber, a popular technology blogger, later created a poll on X, formerly Twitter, to see whether the case has remained intact or not for other users. About half of 3,324 voters agreed that \"It's a piece of junk.\" Only 17.9% of the voters said the phone has \"held up well.\" Gruber posted the same poll on Threads and Mastodon with similar results. In response to the X poll, users have shared their thoughts on the case along with photos of it in different states of disrepair. Related stories \"This product is the worst Apple has even released,\" one user wrote on X with photos of his bruised case he said is in an \"appalling state.\" \"It should be withdrawn.\" The appalling state of an @Apple “FineWoven” (e.g. real leather substitute) premium iPhone Pro case after only 4 months of standard real-world use: this product is the worst Apple has even released - it should be withdrawn and customers should receive a fully refund & apology. pic.twitter.com/WnyFN2HhPk \"Blue seems to be the worst,\" another person said on X, referring to the color of his iPhone case. \"I think water damage is what did this to mine — I'm outdoors a lot in the rain (Scotland) but nothing THAT crazy — this looks like it's been dragged through the jungle!\" Yeah blue seems to be the worst. I think water damage is what did this to mine - I'm outdoors a lot in the rain (Scotland) but nothing THAT crazy - this looks like it's been dragged through the jungle! pic.twitter.com/GMbRGacGi5 Some even said they were so dissatisfied with Apple's case that they now use iPhone cases from other brands. Not all iPhone users have been disappointed with the product. One user said the case shows \"very minimal wear\" and \"feels better in the hand\" than Apple's leather cases. Another said they \"loved\" the case and that it \"tends to slip less on car consoles\" than leather or silicone ones. Apple didn't immediately respond to Business Insider's request for comment on the reviewer's issues. In its product description, the company wrote that the \"high-quality case is made to be durable and protect your iPhone\" and that the material may show wear, scratches, and imprints over time. Starting at $60, the Finewoven case for the iPhone 15 comes in five different colors. It is made out of \"durable microtwill\" from recycled goods that the company says has a \"soft, suede-like feel.\" A cheaper version is available for the iPhone 13 Pro Max.  Read next Jump to "
}