{
    "title": "Nvidia briefly hits $2 trillion valuation as AI frenzy grips Wall Street",
    "date": "2/23/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L2N3F81FU:0-nvidia-briefly-hits-2-trillion-valuation-as-ai-frenzy-grips-wall-street/",
    "text": "Nvidia NVDA briefly hit $2 trillion in market value for the first time on Friday, riding on insatiable demand for its chips that made the Silicon Valley firm the pioneer of the generative artificial intelligence boom. The milestone followed another bumper revenue forecast from the chip designer that drove up its market value by $277 billion on Thursday - Wall Street's largest one-day gain on record. Its rapid ascent in the past year has led analysts to draw parallels to the picks and shovels providers during the gold rush of 1800s as Nvidia's chips are used by almost all generative AI players from ChatGPT-maker OpenAI to Google. That has helped the company vault from $1 trillion to $2 trillion market value in around eight months - the fastest among U.S. companies and in less than half the time it took tech giants Apple AAPL and Microsoft MSFT. Thomson ReutersNvidia blows past $2 trillion valuation as AI bet pays off \"For AI companies today - the leaders of the sector - what's going to be binding for them is not going to be demand. It's just going to be their capacity to answer the surging demand,\" said Ipek Ozkardeskaya, senior analyst at Swissquote Bank. Nvidia's shares closed 0.4% higher on Friday, giving it a market value of about $1.97 trillion. They had risen as much as 4.9% to a record high of $823.94 earlier in the session, after a more than 16% jump on Thursday. Thomson Reuters2024 Market cap shifts: A snapshot of the world's top companies 2024 Market cap shifts: A snapshot of the world's top companies The shares have surged nearly 60% this year, after more than tripling in value in 2023. The chip designer's 2024 share surge has been crucial to the S&P 500's SPX gains, contributing to more than a quarter of the stock index's rise this year. Its latest market-beating forecast of whopping 233% growth in first-quarter revenue helped global markets notch record highs on Thursday. Thomson ReutersNvidia's rising results The breakneck growth has drawn analysts and investors from far and wide to Nvidia. \"I'm a European fund manager, but I must have had more emails about their results than I've had about any other set. There have been calls, every broker doing 10-minute debriefs, it's been mind boggling,\" said one investor, who declined to be named. Despite the share surge, Nvidia's valuation has fallen due to rapid increases in analysts' estimates. It has a 12-month forward price-to-earnings ratio of about 31, down from 49 times a year ago, according to LSEG data. \"Leading cloud computing companies plan to boost their capital expenditure to satisfy demand for AI training and inference, and it appears that virtually all this spending will fall into Nvidia's pockets,\" said Brian Colello, a strategist at Morningstar. \"We anticipate revenue will rise by a couple of billion each quarter throughout fiscal 2025 for Nvidia as more chip supply comes online.\" Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @lewicz.michal @hiramedina @mytradingsetup @Cenobar @mytradingsetup @horibuful @fx_papi @setupstrading @olka_gadzieva GMS @globalsignals_ @TradingView @rajpalgore @mytradingsetup @neo_inversion @chartfeed @captainkolbaska @mytradingsetup @life_of_lorena.fx Whatever the trade "
}