{
    "title": null,
    "date": "2/28/2024",
    "url": "https://fortune.com/asia/2024/02/29/xiaomi-founder-lei-jun-shocked-apple-decision-stop-making-ev/",
    "text": "Both Xiaomi and its founder, Lei Jun, are big fans of Apple. The Chinese smartphone maker embraces Apple-like designs in its products and advertising, leading some to dub the company “the Apple of China.” And Lei cites Steve Jobs as an inspiration, saying that the 1984 book Fire in the Valley put him on the path to launching his own company. So it wasn’t a big surprise when, in March 2021, Xiaomi announced it was entering the EV space, following Apple’s 2014 decision to explore building a car. At the time, Xiaomi promised to spend $10 billion over 10 years to eventually offer “quality smart electric vehicles.” But now Apple’s car plans are reportedly dead, with the U.S. tech company shifting personnel to AI projects instead. The man behind the “Apple of China” said he was “shocked” by Apple’s decision, in a Wednesday post on Chinese social media platform Weibo. He continued that Xiaomi made a “strategic choice” to invest in EVs, and that the company remains committed to the project, despite the difficulty. In December, Lei told state broadcaster CCTV that Xiaomi devoted 3,400 engineers and 10 billion Chinese renminbi ($1.4 billion) toward the company’s first prototype vehicle. He noted that the overall investment was 10 times as high as what automakers generally devote to new models. Xiaomi can break into the car market because EVs combine elements of both traditional automobiles and consumer electronics, Lei said at the time. The smartphone maker unveiled its first EV, the SU7 electric sedan, in late December. The car made its first public appearance at the Mobile World Congress in Barcelona this week. Domestic deliveries could start as soon as the second quarter of the year, Xiaomi group president Lu Weibing told CNBC. The company hasn’t revealed a price tag yet, but Lu said a formal release would come “very soon.” The company is targeting the premium market, which Lu described as a good starting point owing to Xiaomi’s experience selling smartphones to “20 million premium users.” Chinese consumers adopted EVs at a rapid pace in recent years, helping companies like BYD and Li Auto generate record-high sales. But Xiaomi will be trying to enter the world’s largest EV market right as the pace of growth starts to slow down, and as other EV makers get bogged down in fierce price wars to capture more market share. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}