{
    "title": "Apple Vision Pro users report mysterious cracks in front glass, costly \nrepairs add fuel to the fire | Mint",
    "date": "2/24/2024",
    "url": "https://www.livemint.com/technology/tech-news/apple-vision-pro-users-report-mysterious-cracks-in-front-glass-costly-repairs-add-fuel-to-the-fire-11708742077521.html",
    "text": "A growing number of Apple's Vision Pro owners are reporting a concerning issue, i.e., unexplained cracks appearing on the front glass of their headsets. While the exact cause remains unknown, the similarities in the reports are raising eyebrows, according to a report by The Verge. The issue first gained attention on MacRumors, where several users shared photos of their Vision Pros with near-identical hairline cracks running vertically across the glass, specifically above the nose bridge. Notably, these users claim they haven't dropped, mishandled, or otherwise abused their devices. The unexplained cracking of the front glass on Vision Pro headsets continued to puzzle users and raise concerns about the device's durability. While no official explanation has been provided, theories are swirling as to the cause and the potential impact on owners. The initial reports from MacRumors and Reddit, along with Engadget's experience, highlighted the near-identical nature of the cracks – all vertical hairline cracks appearing above the nose bridge. Notably, users emphasize careful handling and no obvious trauma to their devices, fueling speculation beyond accidental damage. Further adding to the mystery, Reddit's r/VisionPro subreddit has seen similar reports, with five users posting pictures of their cracked headsets. Additionally, Engadget reported the same issue occurring on their review unit. “I'm traveling currently and not in the US. I love the product but this is quite frustrating - anyone else with similar issues or experiences on how to handle this? I won't be back in the US for a bit. Weirdly cropped image but I don't want myself in the reflection,\" a Reddit user posted. “To be entirely honest, as long as the tracking is not affected, I don’t really care how the outer glass looks like. But here is the thing. For the last 3 days I have never used my Vision Pro outside of my bed, and whenever I am not using it, I always have the soft outer cover on and the unit has never been dropped or anything like that, and I just noticed the crack last night. I wonder what caused the crack, and whether it’s a manufacturing defect or not,\" another Reddit user shared. Additionally, Apple Vision Pro is currently not available for purchase in India. It launched in the US on February 2, 2024, and there is no official announcement yet on its launch date in India. However, in US it is priced at around $3,499. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}