{
    "title": "Apple Inc. stock outperforms competitors on strong trading day",
    "date": "2/6/2024",
    "url": "https://www.marketwatch.com/data-news/apple-inc-stock-outperforms-competitors-on-strong-trading-day-59598531-6eb3b4ca2e7c",
    "text": "Shares of Apple Inc. \n        AAPL,\n        -0.32%\n       inched 0.86% higher to $189.30 Tuesday, on what proved to be an all-around positive trading session for the stock market, with the NASDAQ Composite Index \n        COMP,\n        +0.50%\n       rising 0.07% to 15,609.00 and the Dow Jones Industrial Average \n        DJIA,\n        +0.02%\n       rising 0.37% to 38,521.36. This was the stock's second consecutive day of gains. Apple Inc. closed $10.32 below its 52-week high ($199.62), which the company achieved on December 14th. The stock outperformed some of its competitors Tuesday, as Microsoft Corp. \n        MSFT,\n        +0.38%\n       fell 0.04% to $405.49, Alphabet Inc. Cl C \n        GOOG,\n        +0.34%\n       rose 0.33% to $145.41, and Alphabet Inc. Cl A \n        GOOGL,\n        +0.36%\n       rose 0.29% to $144.10. Trading volume (42.8 M) remained 11.7 million below its 50-day average volume of 54.4 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. The record-setting rally in U.S. stocks could run into trouble if companies report disappointing profits, according to a top equity-market strategist at Morgan Stanley. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}