{
    "title": "TNB Tech Minute: Apple Ends Effort to Make Its Own Electric Car - Tech News \nBriefing - WSJ Podcasts",
    "date": "2/27/2024",
    "url": "https://www.wsj.com/podcasts/tech-news-briefing/tnb-tech-minute-apple-ends-effort-to-make-its-own-electric-car/b9177b5e-fb4a-4585-8086-13b10c0c8fb1",
    "text": "Plus: OpenAI seeks to dismiss a lawsuit from The New York Times. And cable giant Cox buys software provider OpenGov. Alex Ossola hosts. This transcript was prepared by a transcription service. This version may not be in its final form and may be updated. Alex Ossola: Here's your TNB Tech Minute for Tuesday, February 27th. I'm Alex Ossola for The Wall Street Journal.\nApple has put an end to its decade-long multi-billion dollar effort to build its own electric vehicle. The secret group inside the iPhone giant known internally as Project Titan has been informed that Apple will be shutting down its efforts in building a car while the company ramps up investments in the area of generative artificial intelligence. That's according to a person familiar with the situation. Some of the employees inside the group will be shifting to Apple's AI group, while other employees working on car hardware will likely face layoffs.\nOpenAI has moved to dismiss a lawsuit from the New York Times. The Times is suing OpenAI and Microsoft for alleged copyright infringement. The Times has claimed that OpenAI used its content to create AI tools and that these tools divert traffic from the Times's website. In a court filing, OpenAI argued for the dismissal of parts of the case. OpenAI said that certain allegations were more than three years old and the company didn't have actual knowledge of the specific acts of alleged infringements. The company also disputed part of the Times's complaint alleging that the Times had \"paid someone to hack OpenAI's products.\"\nAnd we exclusively report that Cox Enterprises is buying OpenGov. Cox, a big family-owned communications provider, already held a big minority stake in OpenGov, a software provider for cities and state agencies. Now, executives of the companies say Cox is buying the rest, valuing OpenGov at $1.8 billion. OpenGov's management and employees will roll over a significant portion of their equity into the deal and the company will be run by its existing leadership under the Cox umbrella.\nFor a deeper dive into what's happening in tech, check out Wednesday's Tech News Briefing podcast. Zoe Thomas is the host of Tech News Briefing. Before joining The Wall Street Journal, she was a producer and reporter for BBC News. Zoe has covered business, economics and technology stories across North and South America and Asia. She has been based out of bureaus in San Francisco, Mumbai and her hometown of New York. When not at work, you can often find her searching for new culinary delights or food trends to test out. "
}