{
    "title": "EU set to fine Apple €500 million in music streaming penalty: Report",
    "date": "2/19/2024",
    "url": "https://www.wionews.com/business-economy/eu-set-to-fine-apple-eu500-million-in-music-streaming-penalty-report-691527",
    "text": "As per the FT report, the fine is the culmination of a lengthy antitrust investigation probing allegations that Apple violated EU laws by allegedly leveraging its platform to prioritise its music streaming services over competitors. Brussels is gearing up to administer its first-ever fine against Apple, reportedly amounting to approximately €500 million (approximately $539 million), marking a significant milestone in the European Commission's efforts to regulate big tech, the Financial Times (FT) reported on Sunday. According to sources familiar with the matter the fine is the culmination of a lengthy antitrust investigation probing allegations that Apple violated EU laws by allegedly leveraging its platform to prioritise its music streaming services over competitors. The investigation, initiated following a formal complaint by music-streaming giant Spotify in 2019, scrutinised whether Apple obstructed apps from informing iPhone users about potentially cheaper alternatives for accessing music subscriptions outside of its App Store ecosystem. The European Commission is expected to announce its findings early next month, asserting that Apple's actions contravene EU competition regulations designed to foster fair market competition. \"This fine sends a clear message that the EU will not tolerate anti-competitive practices, particularly from dominant players in the market,\" FT quoted a spokesperson from the European Commission as saying. \"Apple's conduct has stifled competition and undermined consumer choice,\" they added. According to insiders, Brussels will charge Apple of exploiting its dominant market position and enforcing unfair trading conditions on its rivals. The impending fine is anticipated to be one of the most substantial penalties imposed by the EU on major tech firms, rivalling the hefty fines previously levied against Google, which are currently under legal scrutiny. While Apple has never before faced fines for antitrust violations from Brussels, it encountered legal trouble in France in 2020, resulting in a €1.1 billion penalty, later reduced to €372 million following an appeal. In response to the impending ruling, Apple has emphasised its commitment to fostering a competitive environment while expressing disappointment in the EU's pursuit of what it deems a meritless complaint. Apple said that its App Store has played a pivotal role in enabling Spotify's success as the leading music streaming service in Europe. However, critics remain sceptical, citing ongoing concerns about Apple's alleged anti-competitive practices. "
}