{
    "title": "Microsoft is the world's most valuable company.",
    "date": "1/11/2024",
    "url": "https://www.windowscentral.com/microsoft/microsoft-briefly-passes-apple-in-market-cap-for-the-top-spot-as-both-companies-hover-around-dollar287-trillion-market-capitalization",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Microsoft is well on its way to take the crown as the world's most valuable company. Microsoft is on the brink to surpass Apple as the world's \"most valuable company.\" As a matter of fact, it's already happened a couple of times today. The tech giant saw a 1.5% rise, pushing it to a market cap of $2.888 trillion beating Apple's $2.887 trillion. As we reported last week, Microsoft was already well on its way to overtake Apple. Microsoft's rise to the top seat can be attributed to its multi-billion dollar investment in OpenAI's technology, which has draw a lot of investor interest. Apple's shares on the other hand, fell by almost 1%. The iPhone maker's reluctance to hop onto the AI bandwagon coupled with a low demand for iPhone (particularly in the Chinese market) are among the main reasons that can easily explain the dramatic shift. That said, Apple has been at the top of its game since 2010 with most of its success coming from the iPhone. Unfortunately, Microsoft hasn't been able to crack the mobile scene, especially after pulling the plug on Windows Phone. At the height of the COVID-19 pandemic, Microsoft gave Apple a run for its money as companies shifted to hybrid work leading to an increase in demand for its cloud computing services. This is a developing story. We'll update it with more information throughout the day. All the latest news, reviews, and guides for Windows and Xbox diehards. Kevin Okemwa is a seasoned tech journalist based in Nairobi, Kenya with lots of experience covering the latest trends and developments in the industry. With a passion for innovation and a keen eye for detail, he has written for leading publications such as OnMSFT, MakeUseOf, and Windows Report, providing insightful analysis and breaking news on everything revolving around the Microsoft ecosystem. While AFK and not busy following the ever-emerging trends in tech, you can find him exploring the world or listening to music. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}