{
    "title": null,
    "date": "1/20/2024",
    "url": "https://www.notebookcheck.net/Apple-Vision-Pro-will-launch-with-only-15-stock-apps-optimized-for-spatial-computing.794955.0.html",
    "text": "The Apple Vision Pro has finally gone up for pre-order with the limited number of units up for grabs selling through well according to early reports. However, as the device has become publicly available for sale, more details have been made publicly available about the device. This includes information about the apps made by Apple for the Vision Pro that come shipped with the device. In total, the Apple Vision Pro ships will launch with just 15 pre-installed apps that are optimized for Apple’s spatial operating system, visionOS. This compares with around at least 40 apps that are pre-installed and optimized for Apple’s iPad, which is notable as the Vision Pro also supports iPad apps. However, while Vision Pro comes pre-installed with just 25 apps in total, the remaining 10 apps, which include Books, Calendar, Home, Maps, News, Podcasts, Reminders, Shortcuts, Stocks and Voice Memos will be non-spatial iPad apps that haven’t been given the 3D spatialized treatment - at least not at the time of launch. Given Apple’s attempts to appropriate the term ‘spatial computing’ as though it never existed before the Vision Pro, the lack of spatially optimized apps at launch is a strange oversight. The Vision Pro is arguably the most important Apple product launch of the past decade, and is said to be a technology the company considers will eventually replace the iPhone in the future. With developer interest in the device muted, and no marquee third-party titles announced to coincide with its on-sale date, early adopters will have very few authentic and high-quality spatial app experiences on launch. This includes apps from Netlix, Spotify and YouTube, both of which have made it clear that they have no plans to create a visionOS-specific version of their iPad apps – in fact, both companies have also said that they have no plans to support the regular versions of their iPad apps on the Vision Pro either. At this early juncture, the approach of Netflix and YouTube (among others) to the Vision Pro is understandable given the limited early uptake and market compared to Apple’s iOS and iPadOS ecosystems. No such excuses for Apple, however. Purchase the Meta Quest 3 from Amazon bundled with Asgard's Wrath from $499. @markgurman via X/Twitter "
}