{
    "title": "Apple fiscal 1Q sales to be impacted by weak China demand",
    "date": "1/30/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1039734/apple-fiscal-1q-sales-to-be-impacted-by-weak-china-demand-1039734.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Emily began her career as a political journalist for Australian Community Media in Hobart, Tasmania. After she relocated to Toronto, Canada, she reported on business, legal, and scientific developments in the emerging psychedelics sector before joining Proactive in 2022. She brings a strong journalism background with her work featured in newspapers, magazines, and digital publications across Australia, Europe, and North America, including The Examiner, The Advocate, The Canberra Times, and... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 18:03 30 Jan 2024 GMT Apple Inc (NASDAQ:AAPL, ETR:APC) will hand down its first quarter fiscal 2024 financial results after the stock market closes on Thursday, February 1, and analysts have warned that weak consumer demand in China will drag on the iPhone maker’s revenue. Capital.com analysts believe this impact will be greatest on Apple’s products division. “Regional revenue in China is forecast to drop by 1.7%, with greater competition in that market from domestic players also impacting Apple’s topline,” they wrote. ‌They believe investors will be looking out for commentary from Apple’s management about future consumer demand, not only in China but also in the United States and other developed markets. “Another issue could be supply disruptions, chip security, and the outlook for the Apple watch off the back of an ongoing patent dispute about the product’s oximeter feature,” they added. As such, the analysts believe Services revenue will drive Apple’s performance for the fourth quarter, but noted a drop in fees from a year earlier could slow growth in that segment. Wall Street analysts, on average, expect Apple to report revenue of $117.62 billion for the quarter and earnings per share of $2.09. Services revenue is expected to grow 9.1% year-over-year to $22.65 billion while iPhone sales are expected to have benefitted from the release of new models, forecast to grow 1.4% over the year-ago quarter to $66.68 billion. Shares of Apple traded lower ahead of its results, down 1.9% at US$188 in the early afternoon on Tuesday after well-known technology analyst Ming-Chi Kuo projected lower iPhone demand for 2024. Sign up to receive alerts and news direct to your inbox Kodal Minerals PLC (AIM:KOD) CEO Bernard Aylward joins Proactive's Stephen Gunnion with details of the latest milestones at the Bougouni lithium project in southern Mali.\r\n\r\nAylward highlighted that the project has seen significant progress following the completion of a transaction last... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}