{
    "title": "iOS 18 Set to Introduce Extensive Visual Redesign Inspired by visionOS: \nReport",
    "date": "2/12/2024",
    "url": "https://www.thekashmirmonitor.net/ios-18-set-to-introduce-extensive-visual-redesign-inspired-by-visionos-report/",
    "text": "iOS 18 could arrive later this year with a massive visual overhaul to the user interface (UI), according to a report. The next major operating system update for iPhone and iPad is expected to arrive in the second half of 2024 along with new AI features that are baked into the system and the company’s Siri voice assistant — a recent report suggested that iOS 18 could be the Cupertino company’s biggest update to the mobile OS in several years. A report in The Verifier (in Hebrew) citing anonymous sources claims that Apple will redesign parts of iOS to look like visionOS — the company’s operating system for the recently launched Apple Vision Pro. Featuring several translucent UI elements along with a blur effect, visionOS runs on Apple’s first ‘spatial computer’ and lets users view content in both augmented reality (AR) and virtual reality (VR) modes. Apple is planning on refreshing parts of the operating system such as the built-in apps like Safari, as well as system menus and popups with a new design, inspired by visionOS, as per the report, that claims the first indicator of the upcoming changes was added to the Apple TV+ app with the tvOS 17.2 update. Apple Updates Systems Ahead of Third-Party App Store Support in the EUThe iPhone maker updated its eponymous content streaming app for Apple TV to tvOS 17.2 in December 2023. The update brought a new translucent sidebar menu that features design elements that are similar to visionOS. The report claims that the company will roll out the same menu design to iPadOS later this year. While the publication does not have a good record in terms of leaking accurate information related to upcoming Apple products or software, this is not the first time that Apple is said to be working on a major update to iOS. Bloomberg’s Mark Gurman has also claimed that iOS 18 will be the company’s biggest update to its mobile OS in several years. The company is reportedly working on several AI features that will be baked into the upcoming operating system. Apple is yet to make any announcements related to its upcoming software updates, and given the company’s secrecy around its products and software, we can expect to find out that iOS 18 will look like in June at WWDC 2024. That’s when the company typically shows off its upcoming software updates for iPhone, iPad, Mac, Apple TV, and Apple Watch, along with its Xcode development environment. (Except for the headline, this story has not been edited by The Kashmir Monitor staff and is published from a syndicated feed.) © 2024 The Kashmir Monitor Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}