{
    "title": "No, not Eminem or M&M's! It's 'MnM': a new trio of AI tech stocks ousting \nTesla and Apple as must-haves - an expert ...",
    "date": "2/11/2024",
    "url": "https://www.dailymail.co.uk/yourmoney/article-13046719/No-not-Eminem-M-Ms-MnM-new-trio-AI-tech-stocks-ousting-Tesla-Apple-haves-expert-explains-buy-401-k.html",
    "text": "By Daniel Jones, Consumer Editor For Dailymail.Com Published:  14:15 GMT, 11 February 2024   |  Updated:  14:17 GMT, 11 February 2024  11 View  comments  Forget the Magnificent Seven and FAANG - a new portfolio of technology stocks is set for the moon, one analyst says. The new group of must-watch stocks feature just three articifical intelligence leaders in Microsoft, Nvidia and now Meta. Soaring share prices for big American technology companies over the past decade have been the driving force for stock market - and 401(k) - gains. The dominance, initially, of Facebook, Apple, Amazon, Netflix and Google lead to them being dubbed FAANG by CNBC's Jim Cramer. Last year, saw the emergence of the Magnificent Seven - adding in Tesla, Microsoft and Nvidia but ditching Netflix. Microsoft, Nvidia and Meta are stocks to watch, says Raymond James analyst Josh Beck (pictured). He dubbed then 'MnM' - not to be confused with rapper Eminem or M&M's Together, the seven rose 75 percent in 2023 - but since then Tesla, in particular, and Apple have faltered. Tesla is down 27 oercent this year. “MnM? Microsoft, Nvidia & *now* Meta Leading in AI Era,” Raymond James analyst Josh Beck said in a note to clients. This year, Microsoft is up 10 per cent to $405 - overtaking Apple as the world's biggest company - Nvidia is up 44 percent to $693, and Meta, formerly Facebook, is up 33 percent to $459. Tesla is down 27 percent since January 1, while Apple is flat. Amazon and Netflix are both up but are not seen as having the AI-fuelled potential of MnM. DailyMail.com asked another analyst about MnM - and whether it was too late to invest. Bret Kenwell, from eToro, said:  'It’s been a fantastic stretch for the so-called “MnM” trio — Microsoft, Nvidia and Meta. 'Meta and Nvidia are up about 30 percent and 40 percent year to date and about 145 percent and 220 percent over the past year, respectively. 'Microsoft hasn’t been a slouch either, up almost 60 percent over the past 12 months. 'Can it continue? Some consolidation certainly would be reasonable given the recent run, not just in these specific stocks, but for the Nasdaq and S&P 500 in general. 'Still, secular tailwinds remain strong for the MnM trio.' By that, he means there is still positive news for the three stocks in light of the rush to AI. Before Beck came up with MnM on Friday, there had been other - less creative - alternatives to the Magnificent Seven. Bret Kenwell, from eToro, gives his thoughts on MnM - Microsoft, Nvidia and Meta The Super Six, for example, would exclude Tesla, while the Fabulous Five left out Apple too. Beck focused Friday's note on Meta, which saw shares rise 22 percent that day - gaining more than $200 billion in market value. That is the biggest single-say increase in a company’s value ever for a US-traded company, according to Dow Jones Market Data. DailyMail.com also asked eToro's Kentwell his thoughts on the three indiviuallly. Read his thoughts below.... META  'Despite Meta’s meteoric rise to new highs, the company initiated a dividend and added a whopping $50 billion to its buyback plan, on top of a strong quarterly report. 'Yet it only trades at 23 times forward earnings estimates, which are forecast to grow almost 32% this year.' Meta's share price was also boosted last week when it announced its first ever quarterly dividend of 50 cents a share and an additional $50 billion in share buybacks. Buybacks and dividends help boost stock prices by rewarding investors with cash simply for holding stock in the company. Meta's first cash dividend of 50 cents a share will be paid out on March 26, and on a quarterly basis going forward. NVIDA  'It’s easy to critique Nvidia simply based on the stock’s immense rally (and on the idea that AI is just a passing fad),' Kentwell said. 'But that’s not the case with AI — a movement that Nvidia is at the forefront of. It’s a clear leader in the AI revolution and a high-quality company at that. 'With a $1.7 trillion market cap, Nvidia is hardly flying under the radar anymore. But it’s not as if the stock gains have come without a catalyst. Earnings and sales have ballooned, as have margins and free cash flow. The rally isn’t simply due to feverish speculation, it’s in anticipation of strong AI-fueled demand. 'Nvidia’s valuation is a bit more stretched, thanks in large part to its near-50% rally in the last three months. 'However, it would be shortsighted to forget that Nvidia spent the second half of 2023 consolidating below $500. The recent breakout has been powerful, but shouldn’t be considered all that surprising.' MICROSOFT  'Microsoft is a bit more muted this year, up about 8 per cent, but its fiscal year wraps up in June,' Kentwell said. 'After that, consensus expectations accelerate, calling for double-digit earnings and revenue growth in fiscal 2024 and 2025, respectively. 'With its balance sheet strength, immense cash flow and strong margins, it remains a blue-chip name within mega-cap tech. 'With an expected acceleration in earnings and sales, along with its AI exposure via OpenAI and various business units, it’s reasonable that Microsoft will be attractive to investors looking for safer ways to play AI.' All three in MnM stocks are seen as leaders in AI  Nvidia has got a jump on rival chipmakers Intel and AMD on AI processors. It not only makes AI chips for home and busiuness computers, phones and other gadgets - but also mega powerful ones for data centers used by big businesses. Microsoft, meanwhile, has invested billions of dollars into artificial intelligence - making it a leader ahead of Apple, Google and Amazon. It got attention for taking a stake in Chat GPT creator OpenAI, the leading chatbot that is also now built into its Edge internet browser. But it has started selling Copilot, an AI assistant that can summarize an email inbox or craft a slide show, for $30 per month. Facebook and Instagram-owner Meta is moving into AI - with chatbots that businesses can use to talk to customers. The company also launched AI tools for businesses that allows ad buyers to create and track campaigns - and get around strict rules from Apple that block cookies on apps and web browsers. Nvdia, which manufactures computer chips, has enjoyed returns of nearly 250 percent this year and is the top performer in the S&P 500 CAN NVIDIA OVERTAKE AMAZON? Wall Street's enthusiasm about artificial intelligence has Nvidia on the verge of becoming more valuable than Amazon for the first time in two decades, and the AI chipmaker is not far behind Google-owner Alphabet. A 40 percent surge in Nvidia so far in 2024 has elevated its market capitalization to $1.715 trillion as of mid-day trading on Wednesday, only about 3 percent below Amazon's $1.767 trillion value, and less than 6 percent below Alphabet's $1.812 trillion value, according to LSEG data. Nvidia reports quarterly results on February 21. Morgan Stanley raised its price target to $750 from $603, with analyst Joseph Moore writing in a client note that \"AI demand continues to surge\". After Nvidia's stock more than tripled in 2023, it has already become the U.S. stock market's fifth most valuable company. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}