{
    "title": "Apple faces major UK investor rebellion over lack of AI transparency",
    "date": "2/25/2024",
    "url": "https://www.cityam.com/apple-faces-major-uk-investor-rebellion-over-lack-of-ai-transparency/",
    "text": "Featured Submit a story Tell us your story. Featured Submit a story Tell us your story. Featured Submit a story Tell us your story. Featured Submit a story Tell us your story. Featured Submit a story Tell us your story. By: \t\t\t\t\n\n\t\t\t\t\t\tJess Jones Legal & General Investment Management (LGIM) and Abrdn are planning to challenge Apple’s disclosure practices regarding artificial intelligence (AI) at its upcoming annual shareholder meeting. They are backing a resolution, led by the US union federation AFL-CIO, urging the tech heavyweight to publish a ‘transparency report’ on its AI usage and ethical frameworks. The resolution says: “AI may be used in ways that violate the privacy of customers and members of the public. “AI may be used to generate deep fake media content that may result in the dissemination of false information in political elections.” It also addresses worries about AI’s impact on jobs and workplaces. Apple has advised shareholders to reject the proposal, citing its broad scope. LGIM and Abrdn held discussions with Apple prior to backing the resolution. LGIM, one of the top 25 holders of Apple stock, said: “Apple is among several companies that have an outsized influence on the integration of AI into our economy. “We believe companies like Apple should be transparent in their uses of AI and their risk management processes. “As AI becomes increasingly embedded in our society, LGIM believes that it presents opportunities to drive long-term value and has the potential to create significant risks, stemming, for example, from data privacy and security, regulatory compliance and workforce transitions. Importantly, we also view societal trust in AI as a material risk,” it added. Andrew Mason, head of active ownership at Abrdn, said: “Apple is exposed to various risks associated with the use of AI and the requested disclosure, including ethical guidelines, could provide shareholders with robust evidence of due diligence and safeguards that can protect long-term value.” The US Securities and Exchange Commission dismissed Apple’s attempt to exclude the resolution from its shareholder meeting on Wednesday. Apple has not responded to a request for comment. In its annual meeting notice, the company said: “We are committed to responsibly advancing our products and services that use artificial intelligence and already provide resources and transparency to our approach to artificial intelligence and machine learning, all under the active oversight of our board.” Read more EU set to fine Apple €500m over music streaming misconduct Share this article Subscribe to the City A.M. newsletter to have our top stories delivered directly to your inbox. Follow us for breaking news and latest updates Subscribe to get the essential daily news updates from City A.M's top stories to your inbox. "
}