{
    "title": "Did ex-Apple exec drop $60M on this SF building?",
    "date": "2/16/2024",
    "url": "https://www.sfexaminer.com/news/business/did-an-ex-apple-designer-just-drop-60m-on-a-sf-building/article_658ee166-ca13-11ee-97cc-af92804b74ff.html",
    "text": "  The Little Fox Theatre Building at 535 Pacific Ave. in San Francisco was purchased Friday by an entity that appears to be connected to Jony Ive’s design firm, LoveFrom. The Clint Reilly Organization has sold a historic Jackson Square structure for nearly $60 million to a business entity that appears linked to former Apple designer Jony Ive. In a deal completed Friday, an entity named 535 Pacific LLC paid $59.7 million for the Little Fox Theatre building at 535 Pacific Ave., according to records filed with the county Assessor-Recorder’s Office. That works out to about $1,695 per square foot for the 35,221 square-foot building, according to documents from the Assessor’s Office. The structure, which ranges from three to five stories, is around the corner from a collection of buildings Ive’s design firm LoveFrom has purchased over the last three years. The San Francisco address listed for 535 Pacific LLC is the same given for entities used to make other purchases in the area. Derek Giovanetti, the contact person listed in the documents filed with the Assessor’s Office for 535 Pacific LLC, was listed on a previous document filed by LoveFrom. 535 Pacific LLC took out a $63 million loan related to the purchase from 535 Pacific Partners LLC. Giovanetti and Ive did not immediately respond to requests for comment. In an emailed statement, Reilly — who also owns The Examiner — declined to confirm the name of the purchaser, citing a confidentiality agreement, but said he was “pleased” with the deal. Reilly said he’d grown attached to the Little Fox Theatre building, which he’d owned since 1991. “The transaction is great for San Francisco and augurs a comeback which is certainly coming in future years,” he said. The purchase price was well above the property’s assessed value and the going rate for commercial properties in the area. The land and structures at 535 Pacific had an assessed value of $6.6 million for fiscal year 2022-23. In the last quarter, two properties sold in the Jackson Square neighborhood. One in the North Waterfront-Jackson Square area, built in the 1980s, fetched $279 per square foot, while a smaller structure built in 1919 sold for $446 per square foot, or $11.1 million — less than double its $5.7 million appraised value. Assuming Ive and LoveFrom purchased the Little Fox Theatre building, the deal would be their biggest in the area and add to the $78 million they’ve already spent since 2020. Over that time, LoveFrom has purchased five properties in the Jackson Square block bordered by Columbus and Pacific avenues and Montgomery and Jackson streets, according to the real-estate database Reonomy and records filed with the San Francisco Assessor-Recorder’s Office. Those purchases include: A former employee of the university’s compliance office claims the college prioritized its image over adequately addressing complaints The Examiner's Ben Kaplan sits down with mayoral hopeful Ahsha Safai to talk about his relationship with the mayor, the race and upcoming labor negotiations The Golden Gate Bridge, Highway & Transportation District said its five-year toll hikes will raise $139 million of a projected $220 million shortfall Ive, the design guru behind the iPhone, iPod and iMac, founded LoveFrom in 2019, the same year he left Apple. His design firm has since worked with Apple, Airbnb and Ferrari, among other companies, according to published reports. Last year, Ive and Sam Altman and their respective companies, LoveFrom and OpenAI, began talking about collaborating to develop an AI-powered device that would be a kind of successor to a smartphone, according to multiple reports. The two companies have been in discussions to raise as much as $1 billion from SoftBank, the Japanese conglomerate that runs the two mega-sized Vision Funds, according to numerous reports. This month, Tang Tan, who previously headed up iPhone and watch design at Apple, is joining LoveFrom to lead hardware engineering of the new product, Bloomberg reported in December. By purchasing the Little Fox Theatre building — which dates to 1907, according to city records — Ive would add to his growing cluster of early 20th-century buildings in the Jackson Square Historic District. San Francisco’s “oldest remaining commercial area” is “a living reminder of Gold Rush days as well as the colorful period of the Barbary Coast,” according to a 1971 city report nominating the area for the National Register of Historic Places. The district contains The City’s “earliest and sole surviving buildings” from the 1850s and ’60s and is remarkable for the ornateness and refinement of its structures, according to the report. Ive, a British native, wrote a May 2022 essay for the Financial Times about falling in love with Jackson Square, North Beach and Chinatown when he first arrived in The City in 1989. He said he felt a debt of gratitude to the neighborhood, and LoveFrom, the creative collective he formed with Marc Newson, had made Jackson Square its home. “We have dreams and plans for our buildings and our studio, but that’s for another time,” he wrote. The City’s “ferocious, intoxicating history” was in the area where Gold Rush prospectors landed in their giddy scramble to make fortunes and ships were abandoned in the Bay, some of them subsequently buried in landfill beneath buildings, Ive wrote. Ive cited the lawlessness of the Barbary Coast days and the numerous writers who lived or visited the area.      Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Account processing issue - the email address may already exist Ben Pimentel’s new weekly newsletter covering the biggest technology stories in San Francisco, Silicon Valley and beyond. See what you missed during work. Receive our newspaper electronically with the e-edition email. Receive occasional local offers from our website and its advertisers. Sneak peek of the Examiner real estate section. We'll send breaking news and news alerts to you as they happen.  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}