{
    "title": null,
    "date": "1/23/2024",
    "url": "https://www.businessinsider.com/apple-maps-error-cost-a-restaurant-business-owner-says-2024-1",
    "text": "       A restaurant owner in Australia says a mishap with Apple Maps has cost him business. Chris Pyatt told ABC Australia that Apple Maps was displaying his Thai restaurant, Pum's Kitchen, as \"permanently closed.\" The restaurateur says he isn't sure when it started displaying the label. The owner said he's seen a \"significant downturn\" in the money it makes by about 12,000 Australian dollars ($7,900). \"But we have seen a sudden and drastic change in customer behaviour towards the end of November and all of December,\" he told ABC Australia. Pyatt said he spoke to an Apple customer service rep, who reportedly told him they couldn't assist with his inquiry because he's not an Apple customer. He said he was told to submit feedback online and later managed to update the restaurant's open status on Google Chrome. However, he said that the changes weren't reflected in the Maps app days after that. Related stories Business owners can use Apple's Business Connect free tool to add information to its Maps so customers can locate them, according to its support website. The Maps app was later updated to reflect that it's not permanently closed after ABC Australia contacted Apple for comment. Pyatt is not alone in his plight. Other business owners have been grappling with incorrect labels showing that their stores are permanently closed in recent years, according to multiple forum discussions seen by Business Insider on Apple Support Community. Soon after Apple first launched Maps in 2012, CEO Tim Cook apologized for some flaws it had, such as missing information and geographical mistakes. Cook said it was taking action \"to make Maps better.\" The tech giant has made a series of changes to improve it over more than a decade, including adding new features and doing a complete redesign of the app. Apple didn't immediately respond to Business Insider's request for comment, made outside of normal working hours.  Read next Jump to "
}