{
    "title": "Apple Music to Pay Higher Royalties for Spatial Audio Tracks",
    "date": "1/22/2024",
    "url": "https://www.billboard.com/business/streaming/apple-music-higher-royalties-spatial-audio-streams-1235586800/",
    "text": "In a letter Monday, the streaming service said Spatial Audio tracks will receive a royalty rate up to 10% higher than content not available in the format. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tChris Eggertsen Since unveiling Spatial Audio in June 2021, Apple Music has been pushing labels and artists to rework their music in the immersive format. Now, the platform is offering a financial incentive in the form of increased royalties. In a letter sent out by Apple Music to its partners on Monday (Jan. 22) and obtained by Billboard, the streamer revealed that beginning with month-end royalty payments in January, music available in Spatial Audio — which is supported by Dolby Atmos — will receive a royalty rate up to 10% higher than content not available in the format. “Pro-rata shares for Spatial Available plays will be calculated using a factor of 1.1 while Non-Spatial available plays will continue to use a factor of 1,” the letter reads. “This change is not only meant to reward higher quality content, but also to ensure that artists are being compensated for the time and investment they put into mixing in Spatial.”\n\n\n\n\n\t\t\tTrending on Billboard The letter offers an update on the format’s adoption by artists and users, including a claim that more than 90% of Apple Music listeners have experienced the format and that “plays for music available in Spatial Audio have more than tripled in the last two years.” It additionally states that the number of songs available in the format has increased nearly 5,000% since launch and more than doubled over the last year alone. The company further claims that more than 80% of songs to have charted on the platform’s Global Daily Top 100 in the past year are available in Spatial Audio. Seemingly to deter bad actors, the letter includes a mention of Apple Music’s “zero-tolerance policy against deceptive or manipulative content,” noting the service has a “quality control process that includes flagging content not delivered in accordance with Apple Music’s Spatial Audio specifications and standards of quality.” Spatial Audio officially rolled out on June 7, 2021. The format, which provides a surround sound experience in users’ headphones, is offered at no additional cost for Apple Music users, seemingly to speed adoption. As part of this effort, Spatial Audio tracks also enjoy enhanced visibility on the app’s home page, sitting higher than even new music releases. Early adopters of the format included Taylor Swift, Katy Perry, The Weeknd, Billie Eilish, J. Cole and Post Malone. In a June 2021 interview with Billboard, Eddy Cue, Apple’s senior vp of internet software and services, conceded that encouraging artists to mix their tracks for Spatial Audio would be a challenge given the time, work and financial investment required. “This is not a simple ‘take-the-file that you have in stereo, processes through this software application and out comes Dolby Atmos,'” Cue said at the time. “This requires somebody who’s a sound engineer, and the artist to sit back and listen, and really make the right calls and what the right things to do are. It’s a process that takes time, but it’s worth it.” Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2024 Billboard Media, LLC. All Rights Reserved. "
}