{
    "title": "What Apple's adoption of RCS for iPhones could mean for marketers",
    "date": "1/25/2024",
    "url": "https://finance.yahoo.com/news/apple-adoption-rcs-iphones-could-105600016.html",
    "text": "After years of resistance, Apple will be adopting the RCS (Rich Communication Services) standard on iOS later this year, according to multiple media reports. The move will bring better text messaging interoperability between iPhones and Android smartphones. For mobile marketers, this could provide a compelling reason to graduate from tried-and-true SMS messaging as a way of reaching consumers. Largely viewed as a more robust version of SMS messaging, RCS for a long time has been supported by Google (Android) and a number of phone carriers, including Verizon, AT&T and T-Mobile. The standard allows for richer communication than the decades-old SMS, notably through stronger media-sharing capabilities. However, because Apple hasn’t adopted the standard, an RCS message sent to an iPhone would default to the SMS format and be marked with a green text bubble versus the blue bubbles used within iMessage, a long-debated tension between loyalists to iOS and Android. Apple’s adoption of the standard could give mobile marketers more reason to utilize RCS for business messaging (known as RBM) and tap into perks like the ability to appear as a verified sender and send high-quality media and longer, more interactive messages. RCS is also different from SMS in that it doesn’t rely on a cellular signal connection. By 2025, the number of active RCS users is expected to reach 2.1 billion globally, according to Juniper Research. “Marketers will be able to make communications more visually appealing with rich messaging capabilities of RCS, such as images, video and call to action buttons which can be added to messaging campaigns,” said Molly Gatford, research analyst at Juniper Research, in emailed comments. “This is expected to increase consumer engagement with marketing messages and therefore make the use of RCS more attractive to marketers.” Global operator revenue from RCS business messaging traffic is expected to grow from $1.3 billion in 2023 to $8 billion in 2025 due largely to Apple’s adoption of RCS, per Juniper’s findings. Among its perks, RCS marketing can help brands boost their value exchange through added “moments of magic,” explained Vartika Verma, senior director of global marketing for Gupshup, a conversational messaging platform. For instance, an airline using SMS to message a consumer could send basic flight information, like a booking number, but with RCS, it could additionally help consumers easily select their seat or pre-plan meals for the flight. “A lot more of those two-way interactions are now possible [with RCS] within the message window,” Verma said. “SMS can definitely send you a short link, but it's not rich. You get hungry when you see a picture of food — now airlines can do that.” Among clients using RCS marketing, some have seen engagement rates about 30-35% higher than for messages sent using SMS, the executive said. The standard could also be valuable over other channels, like email, with one Gupshup client, a travel brand, observing a 2.7-times increase in conversion rate and a 7% higher open rate when using RCS business messaging compared to email, per data shared by the company. Apple has confirmed that its adoption of RCS will arrive via a software update later this year, according to 9to5Mac, though many details are yet to be revealed. The adoption will bring a number of iMessage-like features to messages between Android and iOS, like read receipts and typing indicators, though the company has stated that RCS messages will still show up with green bubbles on iPhones. Since Apple’s announcement, a number of Gupshup clients have expressed a desire to better understand RCS, Verma said, noting that cost efficiency could be one factor driving interest. “The excitement and the prep is there,” Verma said. Though Android currently commands a much larger share of the global mobile market than iOS, Apple smartphone users account for significantly more mobile value in some aspects, which could make the company’s adoption of RCS even more appealing to marketers. Specifically, iPhone users engage with apps on their smartphone for nine hours more in a given month than Android users, and spend more on in-app purchases. However, iOS users are around 10% less likely than Android users to open a push notification. The RCS standard has been in the works for over a decade, having been chosen for adoption by the GSM Association (GSMA) in 2008 and intended to replace SMS, which celebrated its 30th birthday in 2022. Google has been a major advocate for the standard — even having offered back-end services to carriers looking to adopt it — offering it through Google Messages (the default messaging app on Android) while pressuring Apple to adopt RCS through cheeky campaigns. Despite the benefits of RCS, Apple has in the past refused to adopt it, instead putting its muscle behind iMessage, which it doubled down on in its announcement as the “best and most secure messaging experience.” In 2022, Apple Chief Executive Tim Cook even suggested to one individual asking about RCS to instead buy their mom an iPhone. The company’s decision to adopt RCS, which came in November, follows pressures placed on it to designate iMessage as a “core” service under the European Union’s Digital Markets Act. While Apple’s adoption of RCS is expected to help usher the standard into the mainstream, SMS is expected to remain dominant, with 9.3 billion subscribers forecasted for 2024, per Juniper Research. Some brands have also been upping their bets on SMS marketing, and over half of marketers last year planned to increase their spend on the channel. Still, while SMS isn’t expected to go away anytime soon, its one-way nature could be a reason for some marketers to pull back. “SMS overall, in terms of its delivery, in terms of its architecture, global appeal — it’s still winning,” Verma said. “But I don’t see it as a channel to converse, it’s more of a channel to communicate … if you’re expecting responses on SMS, I think that time is gone.” Compared to SMS, RCS offers features that could build consumer trust, like a verified sender badge to help distinguish against fraudulent activity. End-to-end encryption has been a concern as conversations around consumer privacy intensify, though Apple has said it will not use any proprietary end-to-end encryption on RCS messages. For reference, Google’s use of end-to-end encryption is through Messages, not RCS itself, according to 9to5Mac. RCS marketing could become a solid alternative as marketers navigate the global rising cost of SMS, a trend that is expected to slow the growth of SMS traffic over the next five years, Gatford said. Because of the higher costs, RCS traffic has been expected to grow regardless of Apple’s adoption of the standard, the exec added. “SMS pricing is already a significant problem for many businesses, and therefore, in order to ensure the success of RCS as a go-to messaging channel, it must be deployed with an attractive yet justified pricing model,” said Gatford in emailed comments. One challenge for brands integrating RCS into their strategy is the ability for consumers to respond to messages through quick-reply features, tasking marketers to be prepared to manage the volume and scale of replies and ensure consumers receive a response in a timely manner, Verma said. In such cases, the use of generative AI could help to alleviate tension, she said. However, the channel shouldn’t be seen as a means for endless conversation. Instead, brands should ensure consumer behavior stays front of mind, the exec said. “All things said and done, this is the same space that they use to interact with their friends and family as well. So it's good to have some boundaries, some distinction and have a lot more empathy,” Verma said. This story was originally published on Marketing Dive. To receive daily news and insights, subscribe to our free daily Marketing Dive newsletter. Related Quotes "
}