{
    "title": "Apple’s iPhone China shipments down 2.1% in the final quarter of last year",
    "date": "1/26/2024",
    "url": "https://www.taipeitimes.com/News/biz/archives/2024/01/26/2003812622",
    "text": "Apple’s smartphone shipments in China shrank 2.1 percent in the final quarter of last year from the same period in the previous year, hurt by intensifying competition from local rivals led by Huawei Technologies Co (華為), data from research firm IDC showed yesterday. The drop underscores the challenges facing the US firm in its third-biggest market, as some Chinese companies and government agencies limit employees’ use of Apple devices, a measure that mirrors US government restrictions on Chinese apps on security grounds. Huawei, whose smartphone business was stymied by US sanctions, also made a comeback last year with new launches, intensifying competition in the world’s biggest smartphone market, which grew just 1.2 percent in the final quarter of last year. Photo: AP Huawei’s shipments increased 36.2 percent last quarter, the IDC figures showed. The company became the fourth largest smartphone vendor in China in the period with a 13.9 percent market share, up from 10.3 percent in the same year-ago quarter. However, for the full year last year, Apple overtook Vivo to become the top smartphone seller with a 17.3 percent market share, the IDC data showed. This marked the first time Apple became the top seller in China, but analysts predicted its sales would come under pressure again this year. IDC said Apple’s high-end market share in China has been impacted by rival products and limited product upgrades by Apple, which reduced the overall attractiveness of iPhones. It said Apple still attracted demand from many consumers through substantial discounts and promotions carried out through third-party distribution channels. Earlier this month, Apple offered rare discounts on its iPhones, cutting retail prices by as much as 500 yuan (US$70) amid growing competitive pressure. Jefferies analysts earlier this month predicted that Apple’s shipment volumes would continue declining by double-digit percentages this year, while Huawei is seen bolstering its market share. They estimate Huawei would ship about 64 million smartphones worldwide this year, a significant rise from fewer than 35 million units projected for last year. Overall, shipment volume in China’s smartphone market was 73.63 million units in the fourth quarter. For the full year, shipment volume was 271 million units, down 5 percent, IDC said. DECOUPLING?\n                                         In a sign of deeper US-China technology decoupling, Apple has held initial talks about using Baidu’s generative AI technology in its iPhones, the Wall Street Journal said                                        China has introduced guidelines to phase out US microprocessors from Intel Corp and Advanced Micro Devices Inc (AMD) from government PCs and servers, the Financial Times reported yesterday.\r\nThe procurement guidance also seeks to sideline Microsoft Corp’s Windows operating system and foreign-made database software in favor of domestic options, the report said.\r\nChinese officials have begun following the guidelines, which were unveiled in December last year, the report said. \r\nThey order government agencies above the township level to include criteria requiring “safe and reliable” processors and operating systems when making purchases, the newspaper said.\r\nThe US has been aiming to boost domestic semiconductor Hon Hai Technology Group (鴻海科技集團) yesterday showcased its latest liquid-cooled server racks at Nvidia Corp’s developers’ conference in San Jose, California, with the products aimed at helping customers build artificial intelligence (AI) data centers.\r\nThe racks are developed by Hon Hai subsidiary Ingrasys Technology Inc (鴻佰科技) and support Nvidia’s new GB200 flagship chip, Hon Hai said in a statement.\r\nTo fuel a new wave of generative AI applications, Ingrasys is leveraging the Nvidia GB200 NVL72, a next-generation AI liquid-cooled rack solution, Hon Hai said. \r\n“Our collaboration with Nvidia helps us deliver the latest accelerated computing technologies to our customers so they can ENERGY IMPACT: \n                                        The electricity rate hike is expected to add about NT$4 billion to TSMC’s electricity bill a year and cut its annual earnings per share by about NT$0.154                                        Taiwan Semiconductor Manufacturing Co (TSMC, 台積電) has left its long-term gross margin target unchanged despite the government deciding on Friday to raise electricity rates.\r\nOne of the heaviest power consuming manufacturers in Taiwan, TSMC said it always respects the government’s energy policy and would continue to operate its fabs by making efforts in energy conservation.\r\nThe chipmaker said it has left a long-term goal of more than 53 percent in gross margin unchanged.\r\nThe Ministry of Economic Affairs concluded a power rate evaluation meeting on Friday, announcing electricity tariffs would go up by 11 percent on average to about NT$3.4518 per kilowatt-hour (kWh) The US is to award Intel Corp US$8.5 billion in grants and as much as US$11 billion in loans to help fund an expansion of its semiconductor fabs, the US Department of Commerce announced yesterday, marking the largest award from a program designed to reinvigorate the nation’s chip industry.\r\nThe package would support more than US$100 billion in US investments from Intel, including efforts to produce cutting-edge semiconductors at large-scale plants in Arizona and Ohio, the department said.\r\nThe money would also help pay for equipment research and development, and advanced packaging projects at smaller facilities in Oregon and New Mexico.\r\nIn addition, "
}