{
    "title": "Apple CEO Tim Cook's annual salary dropped by Rs 300 crore in 2023 due to...",
    "date": "1/13/2024",
    "url": "https://www.dnaindia.com/business/report-iphone-maker-apple-ceo-tim-cook-s-annual-salary-dropped-by-rs-300-crore-in-2023-due-to-3074402",
    "text": "Sriram Raghavan opens up on mixed response to Katrina Kaif, Vijay Sethupathi-starrer Merry Christmas: 'If I tried to...' This National Awardee used to sing in trains, worked as RJ, gave several flops, one film changed career, now owns... Seeing Is Believing: How Expert Merge Hardware And Software For Better Vision CUET UG 2024 registration deadline extended: Check last date to apply IND vs AUS Test series 2024-25 schedule out: Check dates, venue, first match to be played in… Business Cook has been at the helm of affairs of the company since its founder Steve Jobs' demise in 2011. Prashant Tamta Updated : Jan 13, 2024, 07:28 PM IST | Edited by : Prashant Tamta iPhone maker Apple is one the largest companies in the world. The Cupertino-based technology giant, headed by CEO Tim Cook, has a market cap of USD 2.89 trillion. The company has recently revealed the annual salary package of the CEO. In its proxy filing with the US Securities Exchange Commission, the company revealed that the 63-year-old earned Rs 300 crore less than what he got in 2022. Apple stated Tim Cook earned USD 63.21 million as compensation in 2023. This is around Rs 523.83 crore. However, in 2022, he got USD 99.42 million which is around Rs 823.91 crore. The decrease in his annual salary was due to a planned decrease. The company planned a decrease of 40% from the 2022 target, but Cook's salary exceeded his targeted compensation for 2023. As per the statement, Cook surpassed the USD 49 million goal by approximately 28%. This comes after Cook's 2022 target of $84 million, which he exceeded with a total compensation of USD 99.4 million. In its proxy filing, Apple said that Cook earned USD 3 million (nearly Rs 25 crore) as a salary in 2023. It was the same salary as in 2022 and 2021. Cook has been at the helm of affairs of the company since its founder Steve Jobs' demise in 2011. Cook was awarded stocks worth USD 46,970,283 (Rs389.25 crore) in the past year. Cook was paid non-equity incentive plan compensation to the tune of $10,713,450 (Rs 88.78 crore). His other compensation totalled USD 2,526,112 (Rs 20.93 crore). Therefore, the Apple CEO's total salary in 2023 stood at USD 63,209,845 (Rs 523.83 crore). READ | Meet man whose company was once of Rs 183000 crore, it's now worth Rs 8290 crore due to...  Controversy: Why So Much Hate Towards Hardik? Fan War Explained | Hardik Pandya Vs Shivam Dube | IPL Virat Kohli Scripts History, Wins 4th ICC Men's ODI Cricketer Of The Year Award | ICC Awards 2023 A Message For Fans | Team India's Losses In Last 10 years | U19 World Cup 2024 | T20 World Cup 2024 IND vs ENG Test Series 2024 Highlights | India Lead Series By 2-1 Against England | IND v ENG Recap "
}