{
    "title": "As Wall Street Worries About PayPal Stock, You Should Be Buying!",
    "date": "1/3/2024",
    "url": "https://investorplace.com/2024/01/as-wall-street-worries-about-paypal-stock-you-should-be-buying/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. The Street's worries about PYPL stock are way overdone Advertisement Source: JHVEPhoto / Shutterstock.com The Street’s worries about PayPal (NASDAQ:PYPL) stock are way overdone. Eventually, these concerns, pushing the shares down 80% from their August 2021 high of $289, will become much less intense, enabling PYPL stock to soar far above its current levels. Specifically, investors’ trepidation about PayPal’s falling profit margins and its competition from Apple (NASDAQ:AAPL) will eventually be unfounded. As a result, I view PYPL as a strong buy at its current levels. Also importantly, the company’s new CEO is likely to boost the firm’s bottom line, while the valuation of PYPL stock remains extremely attractive. In July, research firm MoffettNathanson issued a negative note on PYPL stock, citing increasing competition from Apple’s Apple Pay. According to Barron’s, the bank reported that “Apple Pay is available on 80% of iOS apps, compared with 44% for PayPal. That could be a problem for PayPal given the ubiquity of Apple devices.” But globally, iPhone users spend an average of only $10.40 monthly on their apps, representing a small percentage of their total spending. And, of course, most of the world’s consumers actually have Android phones, not iPhone devices. Specifically, “Apple claims 650 million active App Store users while Google claims 2.5 billion active users.” Moreover, MoneyTransfers.com estimated in October that “Apple Pay’s market share of online payments is 6.21%.” Given that Apple Pay has been available for several years, the data point suggests that the service hardly represents a huge threat to PayPal, which had a 40% share as of last July. The Street, which has tremendous reverence for Apple, tends to greatly estimate how much the firm’s offerings will grow and cause headaches for its competitors. For example, before Apple TV launched, many analysts were convinced that the service would dominate the streaming space. In fact, by my predictions at the time, it became barely more than a blip in the sector. The Street has also been very concerned about a slight decline in PayPal’s margins, as its operating margin shrank from about 23% in Q2 2019 to 22.2% in Q3 2023. During the coronavirus pandemic, the company’s operating margin reached a high of 28%. Large investors sometimes get obsessed with profit margins, causing the shares of companies whose margins are dropping to sink sharply. Eventually, however, increases in total profits usually cause stocks to climb. For evidence of that assertion, consider large oil companies, which have notoriously low margins but have generally managed to keep their stocks moving higher over the years. And PayPal’s profits have generally continued to climb meaningfully, jumping to $3.76 billion in the 12 months that ended in September 2023 from $2.42 billion in the 12 months that ended in September 2022. As I noted in a previous column, PayPal’s new CEO, Alex Chriss, said on Nov. 1, “Simply put, our cost base remains too high, it is actually slowing us down.” The CEO indicated he would sharply cut the firm’s costs going forward. As PayPal reduces its spending, its margins will likely increase, making the Street more bullish on PYPL stock. Finally, PYPL stock has a very low, attractive forward price-earnings ratio of 11 times. On the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. Financial, Fintech   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/as-wall-street-worries-about-paypal-stock-you-should-be-buying/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}