{
    "title": "Zacks Investment Ideas feature highlights: Apple",
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-133100864.html",
    "text": "Chicago, IL – January 30, 2024 – Today, Zacks Investment Ideas feature highlights Apple AAPL. It's a highly critical week for earnings, with several mega-cap technology companies slated to reveal quarterly results. The strength of these mega-cap names has been admired by all, with many expecting positive results to keep overall market momentum flowing. Perhaps the most popular of the bunch, market leader Apple will reveal quarterly results on February 1st after the market's close. The company has been on a solid earnings streak as of late, exceeding our consensus earnings and revenue expectations in three consecutive quarters. Shares got a nice boost following its latest set of results, sparking a strong rally. How do expectations stack up heading into the release? Let's take a quick look at headline estimates and a few key other metrics to keep an eye on within the release. Analysts have been bullish regarding the bottom line, with the $2.09 Zacks Consensus EPS Estimate up a modest 1.5% since November and suggesting growth of roughly 11% year-over-year. Revenue expectations have been revised modestly lower, as the $117 billion quarterly sales estimate has been taken 1.4% lower over the same period. Apple's services portfolio has also been a great source of growth over the last several years. It includes Apple Music, Apple TV+, Apple Arcade, Apple Pay, and more. For the quarter, we expect the company to post $23.3 billion in revenue from Services, nicely above the year-ago mark of $20.7 billion, reflecting 12.5% growth. Apple has consistently positively surprised on this metric as of late. As expected, iPhone revenue will also be a big focus, particularly as the company continues to face competition in other markets. For the quarter, we expect Apple to post $68.6 billion in iPhone revenue, suggesting an increase of roughly 4% year-over-year. iPhone results have been primarily mixed as of late, with the company falling short of consensus expectations in back-to-back releases. Shares are trading at a premium relative to historical levels, with the current 28.4X forward 12-month earnings multiple sitting above the 25.2X five-year median. The forward 12-month price-to-sales ratio sits at 7.4X, near five-year highs and above the 6.0X five-year median. Still, investors have had little issue forking up the premium given the company's dominant stance, as reflected by the share performance. We've got a loaded slate of earnings this week, with belovedApple a part of the reporting docket. Earnings estimates have been taken higher whereas revenue expectations have fallen modestly, with both items expected to be higher than the year-ago period. Investors will closely watch the company's Services results as well as iPhone sales, two key growth drivers for Apple. Heading into the release, the stock is presently a Zacks Rank #3 (Hold). Why Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}