{
    "title": "Apple to launch Vision Pro headset in US on Feb. 2",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/video/apple-launch-vision-pro-headset-162213700.html",
    "text": "Following two analyst downgrades on Apple (AAPL) stock last week, bullish sentiments on the iPhone maker is lagging behind that of its Magnificent Seven counterparts. After facing various challenges on the tail-end of 2023 — including a domestic ban on Apple Watch models and waning iPhone demand in China — the tech giant is coming out swinging in 2024. Apple is set to launch its Vision Pro mixed reality headset in the US on February 2 with pre-orders starting January 19. Yahoo Finance Executive Editor Dan Howley breaks down the announcement. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim. RACHELLE AKUFFO: Well, Apple's Vision Pro augmented reality headset will be available in the US starting February 2 for more than triple the price of Meta's most expensive headset. Now, will this device give the tech giant the comeback it needs? To break this down for us, Yahoo Finance reporter Dan Howley is here. Dan, I know we've been waiting for this one. So what are your thoughts here? DAN HOWLEY: Yeah, Rachelle, this is a big announcement coming on Groundhogs Day. I just think that's a funny time for it to launch. It'll be $3,499 when it hits the market February 2. Preorders start January 19 at 8:00 AM Eastern, that's 5:00 AM Pacific time for people who have $3,400 to-- or $3,500 to go out and spend right away. And, you know, just a few other kind of points to mention. The base storage for this is going to be 256 gigabytes. So you'll have, you know, enough on there for photos, things along those lines. There's going to be a pair of readers in there, so, like, reader lenses. They're going to be $99 extra if you need those. And then if you need prescription optics, those are coming from Zeiss, and they're going to be $149. So that's an addition to the $3,500 that you would spend on the headset itself. You would get these prescription lenses. You would go into an Apple store. They would kind of have you set up. Yeah, I had previously tried these back in June at the WWDC event. You use the kind of FaceTime camera on your iPhone to look at your eyes, take measurements of your face. And that's kind of how you figure out the kind of light block that you're going to need that goes around your eyes and ensures that you're basically sealed off from the rest of the world. So there's a lot that goes into this. It's not just walking in and picking up an iPhone or even, you know, trying out a pair of AirPods to see if you like them in-store or not, something you can do, by the way. This is going to be a very delicate kind of setup process for Apple. The fact that they're offering online and in-store at the same time is really interesting. But, you know, for Apple overall, this is their first major product category that they're getting into since the Apple Watch. So this is a long time coming. It's still an unproven market. The smartphone market globally sells billions of devices a year. The headset market sells millions. So a huge difference in the amount of demand. We have to see if Apple then can ramp those numbers up. But $3,500, it's a lot to ask. RACHELLE AKUFFO: Indeed. But chatting with some of the Yahoo Finance crew here, we're seeing at least they're thinking of those of us who have eye issues who need to wear glasses or contact lenses. But that price tag, yeah, that's hefty, but, I mean, it looks cool. The cool factor is tough, especially if you want to be an early adopter. Appreciate you always giving us the latest. Yahoo Finance reporter Dan Howley, thanks so much. Related Quotes "
}