{
    "title": "Apple tops China’s phone market for the first time",
    "date": "1/28/2024",
    "url": "https://borneobulletin.com.bn/apple-tops-chinas-phone-market-for-the-first-time/",
    "text": "BEIJING (AFP) – Apple last year took the largest share of smartphone shipments in the Chinese market for the first time, new data showed on Friday, despite stiffening competition from local players that included a resurgent Huawei. The United States (US) tech giant’s market share in the world’s second-largest economy came in at 19 per cent, industry data provider Canalys said. Apple’s strong performance in China last year came after 2022 sales were hit by curtailed production at factories as a result of the country’s zero-COVID policy. Its showing also follows a hardening stance towards the firm by Beijing as competition heightens between the US and China in the technology sector. Media reports last year said that employees at certain Chinese government agencies were instructed not to use iPhones for work, due to concerns about data security. The Foreign Ministry insisted in September that there was no such ban, but said that reports had exposed “security incidents relating to Apple mobile phones”. During a visit to Beijing in March, Apple chief executive officer Tim Cook said his company enjoyed a “symbiotic” relationship with China. Coming in behind Apple last year – with annual smartphone shipment market shares in China of 16 per cent each – were three local manufacturers: Vivo, Oppo and Honor. Last year also saw the resurgence of Huawei, a Shenzhen-based tech giant that was once the target of tough sanctions imposed by Washington. “Huawei has become the biggest dark horse (in the fourth quarter), returning to the top five league table of Mainland China’s smartphone market after 10 quarters,” said research analyst at Canalys Lucas Zhong. Borneo Bulletin is the leading English daily in the country. It was first published by Brunei Press. Today, Borneo Bulletin has become the foremost source of information on local and foreign affairs, and the region’s business news. © 2013 Borneo Bulletin Online - The Independent Newspaper in Brunei Darussalam, Sabah and Sarawak "
}