{
    "title": "iPad Will Miss Out On These Major Features Imposed By The EU, Will Be \nExclusively Available On The iPhone With iOS 17.4",
    "date": "1/29/2024",
    "url": "https://wccftech.com/ipad-will-miss-out-on-eu-features-as-iphone-remains-an-exclusive-candidate/",
    "text": "Apple has until March 6 to comply with the EU's regulations under the Digital Markets Act. The company is forced to allow app sideloading on the iPhone and offer third-party app stores. Furthermore, Apple's latest iOS 17.4 beta update details numerous changes coming to the platform. While the iPhone is expected to bring all the aforementioned changes, Apple is reluctant to bring them to the iPad. For your ease, we have curated the changes and features that will not be part of the iPadOS 17.4 update for the iPad. iOS and iPadOS have been tied together for a long time, with some differences for the bigger display. However, the company plans to differentiate the two platforms further with its forthcoming iOS 17.4 and iPadOS 17.4 update. Apple recently announced some significant changes coming to its devices. While some features are coming to all Apple devices, others are only oriented toward the iPhone, but the iPad will miss out. There is a reason Apple is bringing changes imposed by the EU to the iPhone and not the iPad. The EU classifies iOS as a gatekeeper platform under the Digital Markets Act. However, iPadOS is an altogether different platform for the EU, which means that the company is not bound to bring the same changes to the iPad. However, all App Stores on Apple devices are classified as gatekeeper services. This means that the changes imposed by the EU for the app stores are bound to launch on all devices, including iPad, Mac, Apple Watch, and Apple TV. We have created a list of features that will be available on the iPhone but not on the iPad with the release of iOS 17.4 and iPadOS 17.4. As mentioned, Apple will release iOS 17.4 before March 6 to comply with the EU regulations: iOS 17.4 and iPadOS 17.4 are currently in the testing phase, as the company seeded the first developer beta last week. We expect the company to release the second developer beta this week, which will house additional changes. Apple is also working on the iOS 18 update, which is expected to be the biggest update the iPhone has ever received. The company will announce the platform at its WWDC 2024 event in June. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}