{
    "title": "Redesign approved for Apple Watch to overcome import ban",
    "date": "1/16/2024",
    "url": "https://abc11.com/apple-watch-new-design-pulse-oximeter-import-ban/14329564/",
    "text": "WATCH LIVE According to a court filing, Apple successfully proposed redesigning the watch so they don't contain a pulse oximeter function. NEW YORK -- Apple has received approval to change the way its smartwatches function so the company can overcome the Apple Watch ban imposed by a US court. The fix would eliminate a feature Apple has marketed as a way for customers to monitor their health. According to a federal court filing Monday, Apple successfully proposed redesigning the Apple Watch so the watches do not contain a pulse oximeter function, a medical scanner that measures the oxygen concentration in the blood stream. The revelation of the redesign approval came from Joseph R. Re, an attorney for Masimo, the Irvine, California-based technology company that successfully sued Apple for patent infringement. The filing said the enforcement branch of US Customs and Border Protection determined that Apple's proposed redesign of the Apple Watch would allow the company to continue importing the smartwatches to the United States. Masimo's attorney said that although the proceeding itself is confidential, he confirmed that the government had no objection to Apple importing the Apple Watch as long as it did not contain that pulse oximeter functionality. \"Apple's claim that its redesigned watch does not contain pulse oximetry is a positive step toward accountability,\" a Masimo spokesperson said in a statement Monday. Apple had successfully sued to temporarily block a US International Trade Commission ruling that prevents Apple from importing the Apple Watch Series 9 and Apple Watch Ultra 2, among other newer models, because they violate Masimo's patents. The ban went into effect December 26, but a federal appeals court on December 27 temporarily blocked that sweeping import ban. For now, the Apple Watch Series 9 and Ultra 2 remain available for sale in the United States with the pulse oximeter feature, according to the company. Apple said it expects the appeals court to rule on its motion to block the ban as the appeals process plays out as early as this week. After the ban took effect last month, Apple said it was pursuing legal and technical options to resume imports of the most advanced watches, including submitting a redesign of the Series 9 and Ultra 2 watches for US Customs approval. Apple had said it \"strongly disagrees\" with the ban and pledged to \"take all measures\" to bring the Apple Watch back to US customers soon. Apple, in its appeal of the ban, had claimed that it could \"suffer irreparable harm\" if the ban was kept in place while its appeal was ongoing. But Re on Monday argued that Apple could no longer claim irreparable harm from the import ban, because a workaround was approved. Apple has routinely marketed its smartwatch as a life-saving device, which has helped launch the Apple Watch into the stratosphere, making it the most popular watch sold around the world. But its skirmish with Masimo threatens to undermine that. On December 18, Apple opted to preemptively begin taking the Series 9 and Ultra 2 versions of the Apple Watch out of stock in anticipation of the ruling kicking in. Sales resumed, however, shortly after the December 27 injunction. The-CNN-Wire &  2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved. Domestic violence center opens in Durham: 'A home for healing' Biden, Harris visiting Raleigh with health care, polling data in mind Catawba County collector spread joy with Pez dispensers "
}