{
    "title": "Four Tech Stocks To Consider Amid The New Bull Market",
    "date": "2/23/2024",
    "url": "https://finance.yahoo.com/news/four-tech-stocks-consider-amid-120602421.html",
    "text": "The stock market continues to deliver one surprise after another for investors. Most major indices opened the new year with record highs, setting the momentum for the year ahead and crossing over into the bull market territory. A businessperson contemplating modern technology while using the BrandGraph Platform. By the end of January 2024, the S&P 500 climbed towards its fourth consecutive record high, with investors riding on the surge following blowout performance by consumer and technology stocks. Throughout much of the month, the S&P remained steady, gaining around 2.17%. The tech-heavy Nasdaq continues to leave much of Wall Street on the edge of their seats. At the close of January, the Nasdaq advanced 1.0%, with large-cap stocks faring better than small-cap shares. The communications sector remained the saving grace for the Nasdaq and investors, with communication stocks adding 4.4% during the month, and being the index’s best-performing sector alongside financials which gained 3.1%. Elsewhere, the Wall Street Journal reported that the Dow Jones Industrial Average started the year on somewhat rocky territory, but the index quickly made up near the end of the first trading month of the year. On January 22, the index advanced 0.4% adding 138 points, and ended above 38000 for the first time. Overall, Wall Street continues to ride on this momentum, taking leaps and bounds, and hoping to keep the fire burning for longer despite economic headwinds and several sore spots that could leave the market bruised and investors out in the cold. Analysts are ready to jump back into the market, pulling together some of the most rewarding stock picks investors should add to their portfolios before the market begins to advance full steam ahead. There’s a lot that can be said about Apple (NASDAQ: AAPL), however, the company remains a market leader mostly due to the popularity of its products, including the iPhone and Mac computers. While the company has gained a massive market share in recent years due to the advancement of technology and the widespread availability of its products, there’s still a lot of steam left in the company. For starters, Apple has generated a lot of attention surrounding their Apple ecosystem, which sees consumers using mostly Apple devices, including phones, computers, headsets and earphones, smart watches, and even banking. The company continues to elevate the user experience with cutting-edge software and user interface, while simultaneously looking to churn out record-setting profits for most of its business segments, including services, which recently hit record profits. The company posted its first quarterly earnings for the fiscal year 2024 at the beginning of February. In total, the company posted quarterly revenue of $119.6 billion, an increase of 2 percent year over year. Elsewhere, quarterly earnings per diluted share was up 16% year over year, ending the quarter at $2.18. Apple's services, including iTunes, AppleCare, Apple Pay, and licensing, hit a record of $23.12 billion for Q1 2024. The digital content and software segment continues to witness positive growth on the back of customer demand and advancements in software capabilities in a highly competitive market. Last year, AAPL shares gained nearly 25 percent throughout the 12 months, and during the first few trading weeks of 2024, shares were already up by 2 percent. There’s one thing, if not many, that Apply continues to do right, and that’s retaining customers, boasting customer loyalty, and providing a rounded service, including their product line-ups. 2024 will be yet another massive year for artificial intelligence (AI), with companies such as Advanced Micro Devices (NASDAQ: AMD) looking to spearhead the industry and gain traction in the race towards innovation. Consumer demand coupled with industry competition always brings out the most competitive side of any company, and this has perhaps worked mostly in AMD’s favor last year. The company ended 2023 on a high note following its Q4 2023 earnings results. The company posted $6.2 billion in revenue, with a gross margin of 47%. Total operating income and net income were $342 million and $667 million, respectively for the reported period. Earnings per share were slightly below expectations, although that depends on who you might ask, with EPS for Q4 2023 ending at $0.42 per share. Now, looking at the full-year performance, there’s a lot to be excited about. Total reported revenue for the full fiscal year of 2023 ended at $22.7 billion, with the gross margin standing at 46%. On a non-GAAP basis, earnings per share was roughly $2.65, while gross margin was around 50%. AMD is witnessing staggering support from large-scale customers, something which is helping their bottom-line performance. Most of their business segments, including data services such as data centers, clients, gaming, and embedded technology have reported a positive year of growth. Elsewhere, the company is hoping to further invest in the advancement of its artificial intelligence segment and has already gone to partner with major players such as Microsoft in recent months to deliver high-end AI-powered hardware engines. The company expects to report Q1 2024 revenue of roughly $5.4 billion and a non-GAAP profit margin of approximately 52 percent. Microsoft (MSFT) isn’t taking the backseat anytime soon, and neither are they planning to back down from other major contenders such as Nvidia (NVDA); Amazon (AMZN), or Google (GOOG). The company continues to generate substantial profit from its line of consumer and commercial products, however, they’re seemingly far past those early days of doing business by selling computer software. Like their contenders, Microsoft is now in the business of AI. The company has both the resources and know-how to develop some of the most advanced and highly sophisticated AI-powered tools and software - and that’s exactly what they’re doing. The company continues to pursue innovations in the artificial technology front, with AI-powered Bing and Microsoft 365 Copilot being their most coveted headlines last year. Not only this, but the partnership with ChatGPT creators, OpenAI has given them another edge above their competitors. Other segments such as cloud computing, which falls under Microsoft's dynamic products and services segment are witnessing a strong performance, with the company reporting a revenue increase of 21%, while Dynamics 365 revenue growth increased 27 %. Yet, this success hasn’t come without shedding some fat. Last year the company announced layoffs for its HoloLens and GitHub teams, among others. This has enabled the company to rather focus its attention and resources on service and product segments that are more driven towards AI-powered capabilities. On the financial side, Microsoft reported Q2 2024 revenue of $62 billion, an increase of roughly 18 percent and up 16 percent in constant currency. Business segments such as Office commercial products and Office consumer products grew 15% and 5%, respectively. Investors who managed to scoop up MSFT shares during the company’s post-pandemic slump saw stocks skyrocket by roughly 55% last year. On a year-to-date basis, MSFT is up close to 12%, with many analysts expecting shares to continue on this pace in the remainder of the year. Then there’s Snowflake (SNOW) a cloud and data company that integrates third-party applications to help companies make better sense of their data. Just as the case may be with AI, data is perhaps the second-best powerhouse for investors this year, and there are many reasons why investors can get excited about the data-driven future. For starters, experts suggest that roughly 90 percent of all data currently available were generated in the last two to three years. This only shows that there is seemingly endless opportunity for companies such as Snowflake. What’s more, Snowflake currently has around 9,000 commercial and corporate customers. This is only a drop in the ocean considering that there are close to more than 300 million businesses worldwide. The limit to which Snowflake can expand is perhaps unknown, at least for now. Yet, investors aren’t sleeping on Snowflake. Warren Buffet’s Berkshire Hathaway (NYSE: BRK) holds more than $1.2 billion worth of SNOW stocks as of last year. Outside of Berkshire's portfolio, Buffet owns a staggering 6.12 million SNOW shares. When you begin to follow the money, you understand why the Oman of Omaha is dead set on holding as many SNOW shares as possible for the remaining future. For the third quarter of the fiscal 2024 financial year, the company reported product revenue of $698 million, translating into 34 percent year-over-year growth. Outside of technology, the company reported a net revenue retention rate of 135% and continues to hold its performance obligations of $3.7 billion, representing a total 23% year-over-year growth. SNOW shares have close to double their value over the last 12 months, with stock performance up 15.39% year to date. Analysts are positive that the company could be bringing a new set of eyes to the stock market in the coming months due to soaring performance and the long-term positive turnaround SNOW can provide investors. Looking around, there are countless new opportunities for investors to take advantage of the new bull market, and getting a head start is better than holding out until stock prices come down. While the market continues to remain volatile due to economic headwinds, and Wall Street uncertain of when the Federal Reserve will begin loosening its monetary policy in the coming months, investors are instead riding out the momentum of the current bull market, keeping their losses at a minimum and exposing their portfolios to high-yielding winners. Suggested Articles: 20 Fastest Growing Biotech Companies in the US 16 States with No or Lowest Sales Tax Jim Cramer's 2024 Portfolio: 10 New Picks Disclaimer: Not investment advice, speak to an investment professional before making decisions. Disclosure: No positions in any securities mentioned Related Quotes "
}