{
    "title": "Globalstar: Stock's 'Apple' Surge Is Fading (NYSE:GSAT)",
    "date": "2/6/2024",
    "url": "https://seekingalpha.com/article/4667974-globalstar-stocks-apple-surge-is-fading",
    "text": "Yuichiro Chino/Moment via Getty Images Yuichiro Chino/Moment via Getty Images Earth is a small town with many neighborhoods in a very big universe.\"― Ron Garan. Shares of telecommunications infrastructure provider Globalstar, Inc. (NYSE:GSAT) surged dramatically since May 2023 as the company's agreement with Apple Inc. (AAPL) nudged it towards breakeven. Owing to that arrangement, FY23 revenue is slated to increase ~50% over FY2022 (Q4 earnings expected February 23rd). The stock has come back down off that big rally in recent trading, however. With rich valuation metrics but significant excess capacity on its satellites in the 5G sweet spot, the recent beneficial owner buying merited a deeper dive. An analysis follows below. Yahoo! Finance Yahoo! Finance Globalstar, Inc. is a Covington, Louisiana-based provider of satellite and terrestrial connectivity services (voice and communications) - through its constellation of low Earth orbit satellites - as well as asset-tracking products. As of September 30, 2023, the company had 773,000 subscribers to its mobile satellite services, including consumers, businesses, and government agencies. Originally a 1991 joint venture between defense contractor Loral Space & Communications and QUALCOMM Incorporated (QCOM), Globalstar launched in first satellites in 1998, filed for bankruptcy in 2002, emerged from it in 2004, and went public in 2006, raising net proceeds of $116.6 million at $17 per share. The stock trades around $1.60 a share, translating to an approximate market cap of $3 billion. 2022 Investor Day Presentation 2022 Investor Day Presentation The company provides mobile satellite services [MSS] that can connect to ~99% of the world's population, communicating through a network of terrestrial gateways, each with coverage of 700,000 to 1,000,000 square miles. Once a signal from a user has been authenticated, Globalstar's system establishes the voice or data channel to complete the communication via a gateway to a public switched telephone network, cellular or other wireless network, or the internet. The company's satellite system also communicates with terrestrial tracking devices, which includes the Internet of Things (IoT). November Company Presentation November Company Presentation Even though Globalstar has one reporting segment, it has four business lines: Wholesale satellite capacity; Terrestrial wireless; Commercial IoT; and Legacy services. Wholesale satellite capacity includes the leasing of the company's excess satellite capacity (bandwidth), which has the ability to support a 50-fold increase in its customer base. It is the operator for certain satellite-enabled services offered by Apple, a deal that was inked in September 2022. As part of that agreement, Globalstar will launch a whole new constellation of satellites through SpaceX (SPACE) to support Apple's services in 2025 with the latter picking up 95% of the tab through $252 million in pre-payments for the former's services, which includes the ability of iPhone 14 Pro and Pro Max owners to send emergency messages without cellular coverage. Owing to that arrangement, Wholesale satellite capacity generated revenue of $83.4 million in the first nine months of 2023 (YTD23), up 268% from $22.6 million in YTD22. Terrestrial wireless is a big part of Globalstar's future. The company acquired FCC authorization to provide broadband services over 11.5 MHz of its licensed 2.4 GHz MSS spectrum (a.k.a. Band 53) in 2016 and has now received approval in 11 countries. The advantage of this authorization is that it is exclusive, meaning no sharing obligations and little congestion or interference that menaces unlicensed spectrum bands for satellite communications - as well as integration into the cellular ecosystem for satellite-augmented LTE (long-term evolution) and 5G services. It is already integrated into technologies from Nokia Oyj (NOK) (radio support) and Qualcomm (chipset), which will drive Band 53 towards commercialization. Furthermore, Globalstar onboarded privately held XCOM Labs' technology while adding its founder and former Qualcomm CEO (Dr. Paul Jacobs) as its new leader in August 2023. Several other XCOM engineering executives were also brought aboard. Commercial IoT will leverage the company's satellite and wireless technologies to launch two-way direct-to-device modules with non-terrestrial network (NTN) standardization. Put in laymen's language, its current best use case is the monitoring of connected cars (fleets), electrical grids, and oil fields, which will drive a $10.4 billion opportunity by 2035, according to GMSA Intelligence. Between subscription services (472,812 as of September 30, 2023) and equipment, IoT generated YTD23 revenue of $26.9 million, representing a 29% improvement over YTD22. The final business is Globalstar's Legacy services, which houses its now phased-out but still supported Duplex service - the company's satellite phones - and its SPOT services and equipment sales, designed to connect people and assets in remote locations around the world. These legacy products and services contributed YTD23 revenue of $60.0 million, down 2% from YTD22. Remarkably, Globalstar hasn't delisted despite not trading above $5 a share since 2008. This oddity has been made possible by a share count that has risen from 74.9 million in 2007 to ~1.9 billion today, thanks in large measure to various financing arrangements with Thermo Capital Partners, which became the company's largest shareholder after it emerged from bankruptcy in 2004. Currently, its ownership interest is just shy of 60%. Shares of GSAT have not traded meaningfully above $2 since 2017, save three brief forays after news releases in February 2021 (Qualcomm including Band n53 into its new 5G modem), August-September 2021 (iPhone 13 to use satellite connectivity), and September 2022 (the aforementioned iPhone 14 emergency connectivity announcement). That said, Globalstar stock has nearly doubled (even after the recent pullback in the shares) off the 2023 low of $0.85 set in May as the company moves towards breakeven on a GAAP basis on a 60% surge in YTD23 revenue due to the Apple collaboration. Globalstar's Q3 2023 metrics were somewhat consistent with its YTD23 numbers, posting breakeven net income on a GAAP basis and Adj. EBITDA of $32.0 million on revenue of $57.7 million versus a loss of $0.11 a share and Adj. EBITDA of positive $12.2 million on revenue of $37.6 million in Q3 2022, representing a 53% surge at the top line. As for Street consensus, it was an in line quarter at the bottom line, with the top line beating by $4.0 million. Based on range midpoints, the new management team stated that it expected to generate Adj. EBITDA of $122.4 million on revenue of $222.5 million for FY23, up 113% and 50% (respectively) from FY22. The top line forecast was suggestive of a meaningful deceleration (to 40%) in the company's 4Q as the Apple agreement cycles through. With the spike in its Adj. EBITDA, the company's net leverage is in solid stead at 2.2, based on management's FY23 outlook. However, it should be noted that $200 million of its $339.3 million of obligations is at 13% interest (due 2029), where 4% must be paid in cash with the other 9% can be paid in-kind (or cash). Street analysts currently have three buy ratings and one hold rating on the stock. B.Riley Financial ($3.75 a share price target) is the only buy-rated firm with a price target proffered on the shares currently. On average, they expect Globalstar to lose $0.01 a share (GAAP) on revenue of $226.1 million in FY23, followed by a loss of $0.01 a share [GAAP] on revenue of $251.5 million in FY24, representing only an 11% increase at the top line. Board member James Lynch remains steadfastly bullish, purchasing 1.75 million shares of GSAT at an average price of $1.77 on behalf of Thermo Capital on December 18-29, 2023. From a P/E or price-to-sales basis, there is no reason to invest in Globalstar, Inc. The enticing aspect of Globalstar is its excess spectrum that can handle a 50-fold increase over its current customer base. In 2017, Straight Path was purchased by Verizon Communications Inc. (VZ) for $3.1 billion after a bidding war with AT&T Inc. (T), simply for access to its spectrum. This same dynamic may eventually seduce a concern like Apple into paying a significant premium for access to the space Globalstar is trying to rent out. It does operate in the 2.4 GHz band, which is somewhat ideal for 5G since the mid-band frequencies can carry plenty of data over long distances. That said, save that speculative aspect, the stock still feels too rich for investment. I see nothing in space as promising as the view from a Ferris wheel.\"― E.B. White. Author's note: I present an update my best small and mid-cap stock ideas that insiders are buying only to subscribers of my exclusive marketplace, The Insiders Forum. Our model portfolio has nearly tripled the return of its benchmark, the Russell 2000, since its launch.  To join our community and gain access to our market beating returns, just click on our logo below.  This article was written by We are a team of analysts led by Bret Jensen, Chief Investment Strategist at Simplified Asset Management. We run the investing group The Insiders Forum where we specialize in small and mid-cap stocks that insiders are buying. The Insiders Forum portfolio managed by Bret Jensen consists of 12-25 top stocks in different sectors of the market that are attractively valued and have had some significant and recent insider purchases. Our goal is to outperform the Russell 2000 (the benchmark) over time. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}