{
    "title": "What is Apple Vision Pro? Price, what to know about headset on its release \ndate",
    "date": "2/2/2024",
    "url": "https://ca.finance.yahoo.com/news/apple-vision-pro-price-know-182640597.html",
    "text": "Wall Street took a break from rally on Monday, with all three major indexes dipping slightly Apple's mixed reality headset is now a reality. The company officially launched Apple Vision Pro on Friday, with the headset now available in stores and on Apple's website. Apple said in a news release Thursday the headset is launching with more than 600 apps and games \"designed to take full advantage of the unique and powerful capabilities of Apple Pro Vision.\" The company said Vision Pro has an \"infinite canvas\" where apps can scale beyond a traditional display and introduces a \"powerful three-dimensional user interface that users navigate with their eyes, hands, and voice.\" Apple officially announced the Vision Pro's release date last month, with CEO Tim Cook calling it \"the most advanced consumer electronics device ever created.\" The headset was first unveiled at the Worldwide Developer Conference in June as a device that incorporates augmented and virtual reality. Users can control the device's interface using their eyes, hands and voice. To get a sense of what it might look like to wear a Vision Pro, Apple released a commercial in January that pans to the point of view of a user putting on the device, who then sees an array of apps overlaying her surroundings. Apple said the Vision Pro will allow users to immerse themselves into the company's visionOS operating system, supporting spatial Facetime video, photos and apps. “With more than 600 new spatial experiences to explore in the all-new App Store, alongside more than 1 million compatible apps across iOS and iPadOS, users can discover a wide array of apps that expand the boundaries of what’s possible,\" said Susan Prescott, Apple's vice president of worldwide developer relations in the Thursday news release. The headset starts at $3,499. Cook told CNBC's Jim Cramer he thinks the company \"priced it at the right level considering the value of it,\" calling it \"tomorrow's technology today.\" Cook also said people can spread payments for the Vision Pro out over time. Apple held a launch party at the company's flagship store on Fifth Avenue in New York City on Friday morning, according to a social media post. \"What a thrilling morning celebrating the launch of Apple Vision Pro at Apple Fifth Avenue! The era of spatial computing has arrived!\" Cook said on X, the platform formerly known as Twitter. What a thrilling morning celebrating the launch of Apple Vision Pro at Apple Fifth Avenue! The era of spatial computing has arrived! pic.twitter.com/SORkEO87d6 — Tim Cook (@tim_cook) February 2, 2024 Contributing: James Powel and Brett Molina, USA TODAY This article originally appeared on USA TODAY: What is Apple Vision Pro? Price, what to know on its release date The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein Trade 24 hours a day on the world's most popular platform. Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises.  Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr.,  (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach  “The Daily Show” host tears into the former president’s claim ― and shows why the case matters. New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit. 連續13日的閃購活動，產品低至 HK$11，記住準時搶購！友和同時提供豐富支付優惠，Mastercard、BoC Pay、AlipayHK、X Pay用戶享折上折優惠高達HK$500，閃購都用得！ The Ohio lawmaker was asked about Donald Trump’s debunked claims about the 2020 election. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Anne Hathaway told Vanity Fair during a cover story interview that Christopher Nolan more or less saved her career when public opinion turned against her in the lead up to and the aftermath of her winning the Oscar for “Les Miserables.” Hathaway was widely mocked online at this time, and she once remembered googling herself …  The president has been going after his presumptive 2024 opponent with a little more venom than usual President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… The rapper was caught off guard when her \"whole boob\" fell out of her top on stage "
}