{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.benzinga.com/general/entertainment/24/02/37118665/apple-vision-pro-why-some-users-have-decided-to-return-the-headset-while-others-cant-imagin",
    "text": "Despite the initial excitement surrounding the launch of the Apple Inc. AAPL Vision Pro, some buyers are now returning the $3,500 mixed-reality headset, citing various issues. What Happened: The Apple Vision Pro, which was released on Feb. 2, has been met with mixed reviews. While some users are impressed with its spatial computing capabilities, others are returning the device due to its design and performance issues. One of the main reasons for the returns is the headset’s design, which some users find to be cumbersome. They say that wearing the device for extended periods is uncomfortable and that its weight is noticeable enough to be a burden. Users have also expressed disappointment with the headset’s vision quality, with some saying that the device’s ability to overlay virtual apps on top of a user’s vision is not good when clearly observing their surroundings, reported Business Insider. Some customers believe that the Vision Pro doesn’t offer enough unique experiences to justify its hefty price, even though Apple has built more than 600 new apps. See Also: Meta, Apple The Most Underappreciated AI Plays In The Market? Gene Munster Sees Path To ‘A Whole Different Atmosphere' “There just aren’t enough diverse experiences today and diverse content to warrant using this for like two hours a week, which is what I feel like you need to justify a purchase at this price,” said Kane Sutter, a YouTuber, who shared a video detailing his reasoning behind returning the headset. Another YouTuber, Roger Seng, has decided to return his Vision Pro after using it for a week. He says he bought a 1TB model, and since he wanted to protect his investment, he also got an Apple Care Plus with it. \"That bumped everything up to roughly about right under $5,000.\" Seng went on to say that while the device is a great first-generation product, it is only good at this price for those who use it frequently. \"My life has been crazy busy as always and I’ve probably used it four times for maybe 30-45 minutes each. If you look at the time and you put it together there it’s like you know if that’s what it averages to be or even less is it worth keeping?\" Another user who goes by the name Farzad on X, formerly Twitter, spoke about the pros and cons of the device while explaining the reason behind his decision to return the headset. \"The app ecosystem, predictably so, is nonexistent. I don’t know what to use this thing for that I could already do with my computer/iPhone/iPad/Laptop. At $3,500, even with the super impressive set of technologies, is way too steep for what it offers for my use case. The cost/benefit analysis on Vision Pro is impossible to justify for 99.9% of the population, unless you are a 3D movie addict,\" he mentioned as one of the cons. Despite these critiques, some users are still enthusiastic about Apple’s forward-looking vision and the headset’s cutting-edge capabilities. They say they’re open to potentially revisiting the device in the future once the technology advances. On the other hand, some users have acknowledged the shortcomings but have decided to stick with the Apple Vision Pro. Why It Matters: The Apple Vision Pro has been a topic of discussion in the tech world. Meta CEO Mark Zuckerberg compared the Vision Pro to Quest 3 and declared the latter as the better product. This comparison has added to the ongoing debate about Vision Pro’s value and performance. Meanwhile, popular tech YouTuber Marques Brownlee has also pointed out the limitations of the Vision Pro, highlighting the things that the Quest 3 does that, if the Vision Pro did, would feel like a revolutionary change to the device. If you are also an Apple Vision Pro user and have decided to return the device, remember to initiate returns within 10 business days of receiving the product. Moreover, the device must be in a satisfactory condition. Apple requires that all returned items exhibit no signs of excessive wear or damage beyond what is expected from regular use and handling. Any accessories included with the Apple Vision Pro must also be returned to the Apple Store or through an authorized carrier. Photo courtesy: Shutterstock Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Tim Cook's AI Efforts Have Wedbush's Dan Ives Excited: ‘We View Apple Like Meta 18 Months Ago' Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}