{
    "title": "What To Make Of Apple Card’s Latest Numbers",
    "date": "2/16/2024",
    "url": "https://www.forbes.com/sites/katedrew/2024/02/16/what-to-make-of-apple-cards-latest-numbers/",
    "text": "NEW YORK, NY - JANUARY 29: A man checks his phone in an Apple retail store in Grand Central ... [+] Terminal, January 29, 2019 in New York City. Apple is set to report first-quarter earnings results after U.S. markets close on Tuesday. (Photo by Drew Angerer/Getty Images) Apple announced in late January that Apple Card users had topped 12 million since its 2019 launch, with those users earning $1 billion in Daily Cash back last year. Fintech observers were quick to debate whether the news was good or bad, with many opinions in between. But the real story is about Apple’s wider financial services strategy, which is designed to keep us entrenched in its ecosystem. To determine whether the Apple Card is achieving success or not, we need to understand how it plays into that goal. First, let’s look at some basic math:   Depending on how you look at it, Apple is either lagging behind on spend, or it is doing quite fine for how old it is — Delta’s cobrand relationship with Amex dates back to 1996. When it comes to adoption, however, it is represented fairly well among Apple Pay users in the US. And that’s really the statistic that matters; Apple is looking to center itself at the heart of consumers’ financial lives, and Apple Pay is its core vehicle to do that. Really, Apple Card is a foundational tool in that engine. Apple’s release illustrates this in the company’s own words:   Based on these statements, it’s clear that Apple’s ambitions are far more complex than driving credit card spend. (In fact, this could be one of the sticking points in its troubled relationship with its bank partner on the project, Goldman Sachs.) As such, a better way to look at Apple Card and its performance might be to what extent it (and the suite of tools around it) can grow more embedded with Apple Pay users, and critically, to what degree that ecosystem becomes rich enough drive adoption of Apple Pay itself. In that sense, it appears on the right track. It’s still got runway with the Apple Pay user base, but at about a quarter of the way there, it’s made serious strides in just a few years. Moreover, the Apple Card is already demonstrating signs that it can serve as an anchor to the wider environment, as exhibited by uptake and user behavior around the Savings product. Headwinds do persist: In particular, Apple’s relationship with Goldman casts a cloud, and regardless of wider aspirations, the card will eventually need to show financial viability. However, if it can continue to drive deeper financial relationships, especially in the next few years, it should satisfy a major objective for Apple.  "
}