{
    "title": "Netflix removes grandfathered accounts' access to Apple iTunes billing",
    "date": "2/26/2024",
    "url": "https://au.finance.yahoo.com/news/netflix-removes-grandfathered-accounts-access-to-apple-itunes-billing-055305616.html",
    "text": "Those who've been paying Netflix through iTunes over the past years will soon have to say to goodbye to their lower, discounted rates. The company has confirmed to The Verge that it has started removing users' access to their iTunes billing plan for the streaming service. \"Members on the basic plan who were using an iTunes method of payment\" will now have to pay the company directly using a credit or a debit card, Netflix representative Momo Zhao told the publication. Netflix stopped letting new customers sign up for in-app subscriptions on Apple devices way back in 2018 to avoid giving the latter a commission. It allowed those who've already been paying through Apple to keep their payment preference, though, and at least one person said they were still enjoying the service's $10-a-month price until they got booted off their grandfathered pricing. The company killed its $10 basic plan in the US and the UK last year, which used to be its cheapest ad-free option in the regions. After a price increase a few months following that event, new customers have had to pay at least $15.49 to get a viewing experience that's not interrupted by ads. The ad-supported option now sets them back $7 a month, while the Premium tier that comes with support for four devices and Ultra HD now costs subscribers $23. Customers who used to pay through iTunes will now have to pay these prices — that is, if they still want to keep their subscriptions active. (Bloomberg) -- Intel Corp. and Advanced Micro Devices Inc. shares fell Monday after a report that China has adopted new guidance to limit the use of US-made microprocessors and servers in government computers.Most Read from BloombergTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionVital Baltimore Bridge Collapses After Being Struck by ShipAfter Exposing Realtors, Eliminate the Mortgage Interest Deduction The European Union launched investigations into Meta, Google and Apple to review if the three U.S.-based tech giants’ recently announced measures comply with the EU’s new tech regulations, the European Commission announced Monday. The investigations will focus on whether the companies’ new policies regarding app store rules, display of options to users and subscription… Trade 24 hours a day on the world's most popular platform. The European Union on Monday launched investigations into Alphabet, Apple and Meta for potentially breaching a landmark new law designed to prevent Big Tech having an unfair advantage over competitors.  Last year, Brussels designated six companies as \"gatekeepers\" under the Digital Markets Act (DMA), meaning they were big and powerful enough to warrant extra regulation: Alphabet, Amazon, Apple, Meta, Microsoft and TikTok owner ByteDance.  The EU Commission hopes to wrap up the probes within a year. Officials in Britain and the US on Monday filed charges and imposed sanctions on alleged spies linked to the APT31 hacking group. European Union regulators opened investigations into Apple, Google and Meta on Monday, the first cases under a sweeping new law designed to stop Big Tech companies from cornering digital markets.  The European Commission, the 27-nation bloc's executive arm, said it was investigating the companies for “non-compliance” with the Digital Markets Act.  The Digital Markets Act that took full effect earlier this month is a broad rulebook that targets Big Tech “gatekeeper” companies providing “core platform services.” 我們致力透過體育推動全民運動，作為官方社區合作夥伴，讓逾一萬名巿民有機會體驗七欖。 The European Union has launched investigations into Apple, Google and Facebook parent Meta on suspicion that they are failing to comply with a new landmark European law designed to promote competition in digital services. China remains a \"very good friend\", New Zealand's intelligence minister says, despite a Beijing-backed cyber attack on the NZ parliament and MPs. But President Joe Biden has said he intends to sign the bill if it passes in the Senate. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 In this article, we discuss the 11 stocks that will profit from AI evolution. If you want to skip our detailed analysis of these stocks, go directly to 5 Stocks That Will Profit From AI Evolution. Artificial intelligence products like automated assistants, chatbots, robotics, and even self-driving vehicles have become all the rage in the […] The Coles shopper said they'd visited the branch 'for the thousandth time' - but was left in shock by what they said was a new protocol. Latrell Mitchell and the Rabbitohs are under immense pressure. Find out more here.  Lisa Wilkinson’s husband has been dragged into the Bruce Lehrmann saga, asking the court to order the former political staffer to pay his legal costs. Sunday night's episode finally revealed that Jono McCullough had been texting Ellie Dix behind his partner Lauren Dunn’s back. Read more. They're only as big as a deck of cards, but these boxes serve one important purpose.  The mum with two young kids said she was intrigued by the plant's bizarre 'sweet-smelling' fruit. Locals say she made a dangerous error. Find out why. It's the latest in a string of number plate offences that have taken place all over Australia in recent times. Trump and his MAGA allies have been working for years to pre-rig the 2024 election. Here’s how Team Biden is planning to fight them  The “Super Bass” rapper later scolded concertgoers for not warning her about the nip slip. The homeowners said they had 'no idea' about the hidden feature on their property. The distressing moment a Perth woman was run over by a three-tonne ute, leaving her with severe injuries, has been caught on CCTV. "
}