{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.pymnts.com/apple/2024/report-apple-acoustics-vp-gary-geaves-shifting-to-advisory-role/",
    "text": "Apple’s hardware team responsible for audio features on AirPods and other products has reportedly undergone some leadership changes. Gary Geaves, who has been crucial in the development of products like AirPods and HomePod, is stepping down from his role as the company’s vice president in charge of acoustics in what is said to be a step toward retirement, Bloomberg reported Tuesday (Feb. 20), citing unnamed sources. Geaves will be replaced by Ruchir Davé, who is currently a top deputy in the team, according to the report. Apple did not immediately reply to PYMNTS’ request for comment. The hardware team, consisting of about 300 employees, plays a significant role in Apple’s audio products like AirPods and speakers, the report said. They work on sound and microphone technologies, as well as software features such as spatial audio, which have become popular selling points for Apple devices. The group is also involved in developing new products like wall-mounted smart displays and combined iPad and HomePod devices. This leadership change comes amidst other shifts within Apple’s hardware engineering group, led by John Ternus, per the report. For example, Tang Tan, who was responsible for product design of iPhone, Apple Watch and AirPods, recently left the company. It was reported in December that Tan would join iPhone designer Jony Ive’s firm LoveFrom to design an artificial intelligence (AI) hardware device for OpenAI. In preparation for Tan’s departure, Geaves’ team was reassigned to report to Matt Costello, who oversees Beats headphones and HomePod, according to the report. Geaves, who joined Apple in 2011 after working at Bowers & Wilkins, will remain at Apple as an advisor to Costello. Geaves had been planning to retire for a few years, and his move to an advisory role is seen as a step toward that, the report said. Under Geaves’ leadership, products like AirPods have become top sellers, bringing in over $15 billion a year for the company, per the report. Geaves was also instrumental in the development of HomePod, which has gained momentum in recent years. The acoustics team at Apple has been working on revamping their product lineup, and consumers can expect new models in the coming months, the report said. This news comes about three weeks after it was reported that DJ Novotney, a vice president of hardware engineering at Apple, was leaving to join electric vehicle maker Rivian Automotive. We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}