{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.tradingview.com/news/benzinga:990776e46094b:0-apple-s-longest-serving-designer-bart-andre-to-retire-marking-end-of-jony-ive-era/",
    "text": "Apple Inc.'s AAPL longest-serving senior industrial designer, Bart Andre, has reportedly decided to retire, marking the near-complete turnover of a team formerly guided by Jony Ive. What Happened: Andre, who has been with Apple since 1992, told colleagues this month about his decision to step down, reported Bloomberg, citing people familiar with the matter. He was a key figure in shaping the aesthetic of Apple products over the past three decades, even before the return of Steve Jobs in the late 1990s. Andre was a close associate of former design chief Ive and played a pivotal role in leading the team after the departure of Evans Hankey, Ive’s successor, last year. He is also known for holding a significant number of Apple patents. His departure adds to the recent exodus of top designers from the company. Colin Burns, Shota Aoyagi, and Peter Russell-Clarke all left around the end of last year. Several long-time designers from Apple’s software design team have also indicated their intention to leave soon, the report noted. See Also: Life Coach Tony Robbins Recommends Investing In Apple Stock Instead Of Regular iPhone Upgrades To Push Ownership Over Consumerism: ‘The Whole Game Changes’ Why It Matters: The reported departure of Andre comes at a time when Apple is undergoing significant changes in its design and innovation leadership. Following Ive’s departure in 2019, the design team has seen a steady exodus of senior designers. This has led to a significant shift in the team’s composition, with new outside talent being brought in to replenish the industrial design team. However, few long-time members who worked under Ive and contributed to the creation of iconic products like the iPhone, iPad, and Apple Watch remain. Under the leadership of Jeff Williams, the company’s chief operating officer, the design team has also seen cost-cutting measures and a shift in focus toward projects with immediate payoffs. This shift in strategy has reportedly caused unrest among the staff. Apple’s latest financial performance has been strong, with the company beating first-quarter earnings and revenue expectations, and CEO Tim Cook hinting at significant investments in innovative technologies like artificial intelligence. Photo courtesy: Apple Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Buy Now Or Wait? Apple's Vision Pro Craze Sends Resale Prices Soaring To $5000 In Overseas Markets Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @lewicz.michal @hiramedina @mytradingsetup @Cenobar @mytradingsetup @horibuful @fx_papi @setupstrading @olka_gadzieva GMS @globalsignals_ @TradingView @rajpalgore @mytradingsetup @neo_inversion @chartfeed @captainkolbaska @mytradingsetup @life_of_lorena.fx Whatever the trade "
}