{
    "title": "Apple Is Working Multiple Foldable Phone Prototypes: Report",
    "date": "2/8/2024",
    "url": "https://www.entrepreneur.com/business-news/apple-is-working-multiple-foldable-phone-prototypes-report/469489",
    "text": "Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            Sarah Jackson\n          \n                                                    •\n            \n            \n              Feb 8, 2024 Share This article originally appeared on Business Insider. Apple is reportedly working on prototypes of foldable devices. The company is making prototypes of at least two iPhones that would fold widthwise and has reached out to at least one manufacturer regarding parts for foldable phones of different sizes, The Information reported Wednesday, citing a person with direct knowledge of the matter. The phones are still in the early development stage and there's no guarantee they ever become available to consumers, the person told the publication. Apple has also been considering a foldable iPad and has been working with LG and Samsung on displays for foldable iPad prototypes, The Information reported, citing former Apple employees. Apple has been looking into foldable devices for years. In 2016, the company received a patent for a phone that could fold down the middle. In 2020, Apple filed a patent for a foldable electronic device that, when folded, would leave a small portion of the display still exposed so the user could continue to see notifications even with their phone closed. A patent application from Apple last year detailed a foldable iPhone could close itself if dropped to protect the screen from serious damage. In 2022, supply-chain analyst Ming-Chi Kuo predicted Apple could launch its first foldable device in 2025 at the earliest and anticipated it could be \"a foldable iPad or a hybrid of iPad & iPhone.\" Last year, Bloomberg reporter Mark Gurman said of foldable iPhones that he \"wouldn't anticipate one launching in the near future,\" adding that the company is more \"focused on larger foldable devices.\" In a resurgence for foldable phones, competitors like Google, Samsung, and Motorola have released their own versions in recent years.  Samsung Galaxy Z Flip 5 (left) and Motorola Razr (right). Best Buy / Motorola via BI The head of Samsung's mobile experience division, TM Roh, told CNET last year that the company's foldable phones were \"on par\" with the also-foldable Galaxy Note in sales. The company has a goal of selling 20 million foldable smartphones this year, according to a report from Korean media outlet The Elec. Apple did not immediately respond to a request for comment ahead of publication. Want to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join. Sarah Michelle Boes knew there had to be a better way to prepare for her stress-inducing nurse practitioner's exam — so she created it. We put together a list of the best, most profitable small business ideas for entrepreneurs to pursue in 2024. The winning applicants span 38 states, Washington, D.C., and Puerto Rico. Legacy users didn't have to input their real names when accessing Glassdoor — only an email address. Now, all of that has changed. Here are three value-add products and services that can help your business scale. At 41, Josh Grinstead knew he was at a crossroads. Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  "
}