{
    "title": "Apple, Won’t Such Thin IPads Bend “in The Air”? The Thickness Of The New \nIPad Pro OLED Will Be A Record For The ...",
    "date": "3/1/2024",
    "url": "https://gadgettendency.com/apple-wont-such-thin-ipads-bend-in-the-air-the-thickness-of-the-new-ipad-pro-oled-will-be-a-record-for-the-company/",
    "text": "Published on By Already in March, Apple is expected to introduce new iPad Pro tablets.  The update will be the largest since the launch of the line, as the tablets will receive OLED screens.  According to recent data, the new items will also be ultra-thin. photo: AppleCAD drawings published by MacRumors suggest that the thickness of the 11-inch iPad Pro will decrease from the current 5.9 to 5.1 mm, and the thickness of the 13-inch will be only 5 mm versus 6.4 mm for the current version . \nThese will be one of the thinnest tablets on the market, not only at the time of release, but in general for all time.  And there were very few smartphones thinner than 5 mm. \nHowever, given the size of the iPad Pro, this thickness makes you think about the bending strength of the cases. CAD drawings published by MacRumors suggest that the thickness of the 11-inch iPad Pro will decrease from the current 5.9 to 5.1 mm, and the thickness of the 13-inch will be only 5 mm versus 6.4 mm for the current version . These will be one of the thinnest tablets on the market, not only at the time of release, but in general for all time.  And there were very few smartphones thinner than 5 mm. \nHowever, given the size of the iPad Pro, this thickness makes you think about the bending strength of the cases. These will be one of the thinnest tablets on the market, not only at the time of release, but in general for all time.  And there were very few smartphones thinner than 5 mm. However, given the size of the iPad Pro, this thickness makes you think about the bending strength of the cases. First AMD and Qualcomm, then Intel, and Apple will be the last.  A roadmap has appeared describing the release schedule of new processors from all companies New Apple magic: Presto allows you to update your iPhone without opening the box iPhone 16 Pro will receive an Apple A18 Pro chip, improved specifically for artificial intelligence Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  Published on By The Samsung Galaxy Tab S6 Lite tablet turned out to be so successful that Samsung is releasing variations of it for the third time.  The original was released in 2020, then there was a re-release in 2022 with minor changes (mainly SoC), and now the 2024 model will be on sale.  The first region where the Samsung Galaxy Tab S6 Lite (2024) is available is Romania.  Samsung Galaxy Tab S6 Lite (2024) is available in mint and gray colors, in a 4/64 GB configuration, prices are not yet listed on the manufacturer’s website.  The basics remain the same – 10.4-inch LCD display (200 x 1200 pixels, 15:9), S Pen included, 7040 mAh battery.  There are both Wi-Fi and LTE versions for those who need connectivity on the go.  The Samsung Galaxy Tab S6 Lite (2024) has a new SoC installed, but Samsung does not say which one.  The listing specifies an octa-core SoC with 2.4GHz and 2.0GHz cores, while the 2022 model (with Snapdragon 732G or 720G) had 2.3GHz and 1.8GHz cores.  Presumably, the new product uses Exynos 1280.  The tablet immediately runs Android 14 with One UI 6.1 shell.  The 2022 model came with Android 12 and One UI 4.0, and was recently updated to One UI 6.0.  The 7040 mAh battery provides up to 14 hours of battery life.   Published on By Xiaomi Pad 5 was released in August 2021 with Android 11 and was supposed to eventually receive Android 13 with the MIUI 14 interface. But MIUI 14 will no longer be available for this model – the latest HyperOS system has been released instead.  Moreover, this time we are not talking about the Chinese version of the tablet, but about the global one. Xiaomi Pad 5 users outside of China have started receiving the HyperOS beta version number 1.0.1.0.TKXMIXM.  For now, it is only available to Mi Pilot program members.  If no critical bugs are found, the system will be released as an over-the-air update for all device users.  The update size is 1.6 GB.\nHyperOS version 1 will be the last official software for Xiaomi Pad 5; there will be no more global updates for this model. Xiaomi Pad 5 users outside of China have started receiving the HyperOS beta version number 1.0.1.0.TKXMIXM.  For now, it is only available to Mi Pilot program members.  If no critical bugs are found, the system will be released as an over-the-air update for all device users.  The update size is 1.6 GB. HyperOS version 1 will be the last official software for Xiaomi Pad 5; there will be no more global updates for this model. Published on By Samsung now offers one of the longest supports on the market for a number of its latest smartphones: up to 7 years of software updates, and this includes the operating system.  But the company went further and increased this period to 8 years!  True, not for smartphones. Tablets will receive updates for 8 years, but not all, but only those aimed at the corporate market.  Smartphones for the same market will have 7 years of updates.  So far, the only tablet for which 8 years of support has already been confirmed is the Galaxy Tab Active5.  The Galaxy Xcover7 smartphone offers 7 years.  At the same time, at the launch of these devices they announced 5 years of support. \nFor the enterprise market, software support is often much more important than for the consumer market.  As for tablets, they are replaced less often than smartphones, so Samsung’s actions here are quite logical. Tablets will receive updates for 8 years, but not all, but only those aimed at the corporate market.  Smartphones for the same market will have 7 years of updates.  So far, the only tablet for which 8 years of support has already been confirmed is the Galaxy Tab Active5.  The Galaxy Xcover7 smartphone offers 7 years.  At the same time, at the launch of these devices they announced 5 years of support. For the enterprise market, software support is often much more important than for the consumer market.  As for tablets, they are replaced less often than smartphones, so Samsung’s actions here are quite logical. Space meteorologists have issued a forecast for this week warning of a possible geomagnetic storm caused by the release of... BYD is going to beat Toyota and Volkswagen by offering modern cars at very low prices. According to Bloomberg, the... Samsung promised to release the latest One UI 6.1 firmware for Galaxy S23 series smartphones at the end of March,... Sales of the latest Xiaomi TV S65 Mini LED and Xiaomi TV S55 Mini LED TVs started today. The devices... Toyota Corolla lost the title of best-selling car in the world for the first time in 20 years.  Tesla Model Y is the new king While Intel is abandoning Hyper-Threading, AMD is creating mobile monsters.  The company has confirmed the main parameters of the new Ryzen Strix Point APUs Scientists have created a quantum tornado in superfluid helium: a new step towards understanding the physics of black hole accretion At the intersection of avant-garde and futurism.  Kia surprised with the design of the new generation Kia K4 (Cerato) sedan © 2024 Gadget Tendency. All Rights Reserved "
}