{
    "title": "3 Blue-Chip Stocks to Buy as the Dow Breezes Past 38,000",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/news/3-blue-chip-stocks-buy-131200212.html",
    "text": "After experiencing a remarkable December, the Dow continued its upward momentum and closed above the coveted 38,000 mark for the first time on Jan 22. The 30-stock blue-chip index took only 25 trading sessions to jump 1,000 points to set a record close. The index surpassed the 37,000 milestone on Dec 13. It’s the shortest time the Dow has taken to add 1000 points since the period between 33,000 and 34,000, per Dow Jones Market Data. Also, the move between 37,000 to 38,000 represented an increase of 2.7% for the 30-stock benchmark. Despite stretched valuation, the blue-chip stocks are climbing northward and have more room to rise due to the Federal Reserve’s dovish outlook and the rising optimism that the economy would avoid a recession this year. The Fed has kept its interest rates unchanged at 5.25% to 5.5% and has hinted at rate cuts this year as inflationary pressure has begun to show signs of cooling down. The Fed’s intention to curb monetary tightening bodes well for the economy and, in turn, the stock market. This is because rate cuts boost consumer spending and reduce the cost of borrowing. The U.S. economy, anyhow, is showing immense strength as consumers remain confident about their well-being amid a sturdy labor market. The University of Michigan stated that its consumer sentiment index had hit its highest level in January since July 2021. Americans are feeling optimistic about the economic scenario as jobs are being added at a steady clip and the unemployment rate remains low. Meanwhile, the National Association of Business Economics stated that almost 91% of the respondents have said that there is a 50% or less chance of the U.S. economy entering a recession in the next 12-month period. Many of them believe that corporate profits will rise this year as inflation is falling at a faster-than-expected pace, supply-chain bottlenecks ebb, and labor shortages ease. Amid such positives, it’s prudent for investors to place bets on fundamentally sound blue-chip stocks such as Microsoft Corporation MSFT, Salesforce, Inc. CRM and Apple Inc. AAPL that are well-positioned to capitalize on the broader market uptrend. These stocks have solid balance sheets, a steady stream of cash flows, and large market capitalization. They currently carry a Zacks Rank #2 (Buy) each. You can see the complete list of today’s Zacks Rank #1 (Strong Buy) stocks here. Microsoft is one of the largest broad-based technology providers in the world. Revenues from the intelligent cloud business, primarily driven by growth in Azure, are aiding Microsoft. The Zacks Consensus Estimate for its current-year earnings has moved up 0.1% over the past 60 days. MSFT’s expected earnings growth rate for the current year is 13.6%. Its projected earnings growth rate for the next five-year period is 15.5%. Salesforce is the leading provider of on-demand Customer Relationship Management (CRM) software. Strong clientele and diverse products are benefiting Salesforce. The Zacks Consensus Estimate for its current-year earnings has moved up 1.7% over the past 60 days. CRM’s expected earnings growth rate for the current year is 56.5%. Its projected earnings growth rate for the next five-year period is 21.5%. Apple's business primarily runs around its flagship iPhone. Apple is gaining from its growing services and wearable businesses. The Zacks Consensus Estimate for its current-year earnings has moved up 0.6% over the past 60 days. AAPL’s expected earnings growth rate for the current year is 7.8%. Its projected earnings growth rate for the next five-year period is 11%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Salesforce Inc. (CRM) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}