{
    "title": "Today in Apple history: Sun Microsystems almost buys Apple",
    "date": "1/25/2024",
    "url": "https://www.cultofmac.com/463947/today-in-apple-history-sun-microsystems-almost-buys-apple/",
    "text": "By Luke Dormehl • 8:50 am, January 25, 2024 January 25, 1996: Rumors circulate that Sun Microsystems is in talks to acquire Apple. With Sun at the peak of its power, and Cupertino struggling, the rumored $3.89 billion deal would see Apple snapped up for between $5 and $6 a share. This post contains affiliate links. Cult of Mac may earn a commission when you use our links to buy items. If you’re a tech fan in your mid-20s or younger, there’s a good chance the name Sun Microsystems means very little to you. One of the most notable companies to collapse when the late-’90s tech bubble burst, Sun sold computers, components, services and software. (It created the Java programming language and the Solaris operating system.) Founded in 1982, Sun Microsystems became a big player in Silicon Valley before eventually being acquired by Oracle in 2009. Today, its iconic former campus is the main HQ of Facebook. (And, as seen in this video, Sun’s logo remains on the reverse of Facebook’s sign! It’s all about motivation.) Sun made workstations and crossed over with Apple in various ways. As a result, people talked about a merger of the two companies as far back as 1988. As Owen Linzmayer notes in his tremendous (and in great need of an update) book, Apple Confidential 2.0, the deal almost happened by the fall of 1990. The idea was that Sun CEO Scott McNealy would become COO of both companies. Apple backed out at the last minute. The possibility of Apple and Sun merging arose again in December 1995, prompted by fear of a post-Windows 95 Microsoft. With Microsoft still years away from hitting its zenith, both Sun and Apple had good reason to be afraid for their futures.  Even without Microsoft, Apple was doing plenty to hurt itself. The company put out digital cameras and games consoles instead of focusing on core products. Cupertino also made a disastrous clone Mac deal that cost the company money and watered down its brand. McNealy met with Apple’s board at The St. Regis hotel in New York City to begin working out details of a stock swap that would, as with the previous deal, put the Sun CEO in charge. Ultimately, negotiations fell apart as Apple announced massive losses of $69 million. By the end of 1996, everything had changed. Steve Jobs was back at Apple, then-CEO Gil Amelio was on the rocks, and Apple was primed for a comeback. But things could have been very, very different.   Daily round-ups or a weekly refresher, straight from Cult of Mac to your inbox. Our daily roundup of Apple news, reviews and how-tos. Plus the best Apple tweets, fun polls and inspiring Steve Jobs bons mots. Our readers say: \"Love what you do\" -- Christi Cardenas. \"Absolutely love the content!\" -- Harshita Arora. \"Genuinely one of the highlights of my inbox\" -- Lee Barnett. The week's best Apple news, reviews and how-tos from Cult of Mac, every Saturday morning. Our readers say: \"Thank you guys for always posting cool stuff\" -- Vaughn Nevins. \"Very informative\" -- Kenly Xavier. "
}