{
    "title": "Will an antitrust suit end Apple's 'most valuable' status?",
    "date": "1/7/2024",
    "url": "https://interestingengineering.com/culture/apple-sees-worst-ever-start-to-the-year-177-billion-in-valuation-lost-so-far",
    "text": "It’s Apple’s worst-ever start to the year. Daniel El Lu / Wikipedia By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time. Apple Inc., the tech behemoth, long-standing leader of the stock market, and large chunk of Warren Buffet’s portfolio, is grappling with its worst start to the year in recent history. Shares of the Cupertino-based company plunged 0.4% on Friday, closing at approximately $181, marking a fifth consecutive day of losses. The drop follows reports by The New York Times hinting the Justice Department is moving closer to filing an antitrust case against Apple. This potential legal battle adds to the mounting challenges facing Apple, ranging from dwindling iPhone sales to patent disputes over its innovative Watch. The International Trade Commission (ITC) found Apple to be guilty of infringing on a patent held by blood pulse oximeter maker Masimo, in October. “The suit could attack Apple’s business model of tightly integrating its devices and service,” noted Bloomberg Intelligence analyst Anurag Rana. The downturn began earlier in the week, triggered by two consecutive ratings downgrades and analysts “flagging a weak macro environment in China pressuring demand for iPhones,” reported Bloomberg. Despite fluctuating between gains and losses in Friday’s trading session, the losses incurred mark Apple’s most significant market value destruction at the start of any year on record. Analysts are grappling with the rarity of two consecutive downgrades, a phenomenon that has not been witnessed before an earnings report in the company’s history. “Investors realize how rare it is to have two people go negative,” managing partner of Deepwater Asset Management, Gene Munster, told Fortune. “I’ve been covering this company for a long time and I’ve never seen two downgrades before an earnings report,” he added. “Everybody’s selling their winners and buying losers. There’s a big rebalance going on,” said Brian Mulberry, client portfolio manager at Zacks Investment Management, hinting at the rotation of portfolios investors typically do at the beginning of the year. Apple, which has held the title of the world’s most valuable publicly-listed company since July 2022, has already seen a staggering $177 billion wiped off its market value this year. This dip in fortunes has also narrowed the company’s lead over Microsoft, its tech rival, to less than $100 billion. Mounting concerns about iPhone sales have triggered a second analyst downgrade this week, intensifying the scrutiny on Apple’s stock price. The tech giant’s value has tumbled by a staggering $155 billion, more than three times the value of Ford, in a single week. While Apple still holds the crown as the world’s most valuable company at $2.83 trillion, Microsoft, with a current valuation of $2.73 trillion, is closing the gap. At a time when Apple’s latest iPhone was dubbed the “biggest flop in Apple’s history,” Microsoft has benefitted from its artificial intelligence ventures, particularly from its $13 billion investment into OpenAI and ChatGPT. Beyond the immediate market dynamics, Apple faces further challenges in China in the form of competitors like Huawei who are gaining market share, and government restrictions on iPhone use further impede growth. "
}