{
    "title": "Apple Insiders Share the Story of the Birth of the Macintosh",
    "date": "2/24/2024",
    "url": "https://thenewstack.io/apple-insiders-share-the-story-of-the-birth-of-the-macintosh/",
    "text": "We’re so glad you’re here. You can expect all the best TNS content to arrive\nMonday through Friday to keep you on top of the news and at the top of your game. Check your inbox for a confirmation email where you can adjust your preferences\nand even join additional groups. Follow TNS on your favorite social media networks. Become a TNS follower on LinkedIn. Check out the latest featured and trending stories while you wait for your\nfirst TNS newsletter. It was 69 years ago today that Steve Jobs was born, on Feb. 24, 1955. And last month saw the 40th anniversary of the day Apple launched its Macintosh computer — Jan. 24, 1984. So this Jan. 24, Apple co-founder Steve Wozniak and other luminaries attended a special presentation at Silicon Valley’s Computer History Museum, where long-time tech journalist David Pogue heard the Mac’s origin story from the people who were there. Tales were shared by three different panels of “original Mac team members and Apple insiders,” according to the museum’s blog post. The final panel even included Steven Levy, who famously chronicled his pre-launch meeting with the Macintosh team in his 1994 book Insanely Great: The Life and Times of the Macintosh, the Computer that Changed Everything. “Insanely great” was Jobs’ description for what they were trying to do — along with “put a dent in the universe.” Levy told me that the panels were “a joyous gathering.” 40 years down the road, “It was great seeing them! Some of them have become friends, and others I hadn’t seen for a long time.”  Back in 1984, Macintosh engineer Andy Hertzfeld had told Levy “We’re all maniacs. People want to be computer scientists, but we are also hackers, trying to make Macintosh incredibly small and tight and fast.” And Levy’s book cites CEO John Sculley’s observation that the Mac team almost exuded “some spiritual force, mesmerizing people… Excitement showed on everyone’s face.” Andy_Hertzfeld_1985_(cropped) – photo by Tony Wills – Creative Commons via Wikipedi But Levy makes a counterpoint. “Day by day the evidence accumulated that they had it within their power to create something a quantum leap better than anything the industry, indeed the world, had ever witnessed. They believed they could make a dent in the universe.” And whatever scale of reverberations might lay ahead, Levy had already heard this particularly far-reaching pronouncement from a 28-year-old Steve Jobs. “Computers and society are out on a first date in this decade and for some crazy reason we’re just in the right place at the right time to make that romance blossom…” Dan’l Lewin, the Computer History museum’s president and CEO, warmly opened the event — and then told the audience, “This one is special,” since Lewin had also led the initial launch of the Macintosh during his time at Apple. Lewin believes history is about the present as much as the past — a conversation between both eras, he said, bringing a chance to “reflect forward… and ideally make the world a better place.” And then Lewin added, almost as an aside, that changing the world had been Douglas Engelbart’s intent from the very beginning… Working over at Xerox’s legendary PARC R&D center, Engelbart had engineered (and eventually demoed) the ideas which “begot all of these things” — including the idea of the mouse, and of overlapping application windows. In 1994 Levy wrote that Engelbart remained at least somewhat overlooked, while “His vision was at the mercy of those he inspired.” Specifically, Levy recounted the tale of Engelbart’s legendary demonstration for eight people from Apple, where an excited Steve Jobs “nearly exploded” when he said… “Why aren’t you doing anything with this? This is the greatest thing! This is revolutionary!” The first panel included Susan Kare, creator of all the Mac’s icons and fonts, as well as three development team members. Macintosh engineer Bill Atkinson remembered demonstrating the Mac’s predecessor, the Lisa, to Engelbart, and getting some impactful advice: “In your quest to make something user-friendly, be sure you don’t lock out the power user who wants to go fast later.” That very night, Atkinson added a feature still in use today. “The fact that there are keyboard shortcuts, I credit a little goading from Doug Engelbart.” The panel also remembered how the Macintosh project had originally been started in 1979 (and supervised for its first year) by Jef Raskin, who had written the manuals for the Apple II. But while Rafkin started the project, he told Levy that “It was clear that Macintosh was the most interesting thing at Apple — and Steve Jobs took it over.” Speaking in January, Macintosh engineer Andy Hertzfeld said Rafkin deserved a lot of credit “for putting together the vision of the Macintosh, which was if we could make a computer that was inexpensive and easy to use, we could sell computers by the millions.” Hertzfeld says that even though Rafkin left the team, his original vision stuck with the project throughout its development. Steve Capps added that “the whole team — from manufacturing manuals to software to hardware — was 100 people. And that’s just unheard of today.” Levy’s book says the team started as “a scrappy assortment of outcasts and mutts…” The audience applauded when Susan Kare remembered the positivity and encouragement she’d experienced from Steve Jobs. Levy’s book also notes that in January of 1983, Steve Jobs scrawled three words onto an easel. “Real artists ship.”  But Bill Atkinson remembered another way Jobs motivated them. “He said, ‘Real artists sign their work.’ And he brought around a piece of white paper and sharpies, and all of us got to sign on them — and then he had those engraved on the hard tooling for the case. So if you take off the back of an original Mac, all of us have signed it. He wanted us to take pride in our work.” Levy captured more of that sentiment in his book — remembering his 1984 interview with Steve Jobs. “I look at most of the people I get to work with as artists,” Jobs had said. “I look at myself as an artist if anything.” And when Levy said “Really?” Jobs had joked, “Sort of a trapeze artist.” “With or without a net?” “Without.” But then Jobs said seriously “It’s a way of expressing feelings. Wanting to put something back into the world.” While we spend our lives eating the food that others have grown, “It’s a wonderful, ecstatic feeling to create something that puts it back in the pool of human experience and knowledge… “I’m one of those people who think that Thomas Edison and the light bulb changed the world a lot more than Karl Marx ever did.” Levy himself appeared on the final panel, along with Chris Espinosa, Apple’s longest-serving employee, and former Apple Chief Evangelist Guy Kawasaki. And Levy remembered that using computers at that time “was like throwing messages over a fence” — whereas opening folders on a Mac or using a cursor felt like finally interacting with the digital world. “That was the inflection point that I was seeing, right at that moment.” The museum also held a panel with the marketing team — Andy Cunningham, Dan’l Lewin, and Mike Murray — who remembered how Apple’s Board of Directors had originally demanded that they not broadcast their soon-to-be-famous Super Bowl ad. Murray said even after their eventual triumph, he continued feeling a pressure to succeed. “The technical team was just so brilliant, and the work they had done — it was just so extraordinary, taking from Lisa and taking from PARC and putting it all in this small box. They had worked so hard — and we couldn’t fail them… Though it was imperfect for the marketplace at the time, we had to get it out there, and we had to make it stick.”  Levy spoke to Jobs before the launch, who insisted his motivation was a love for the users, the product, and the company that Apple could become. “If we fail, that will mean my entire worldview is all wrong.” And Jobs went on to predict they’d sell two million by the end of the next year. He was wrong. Levy’s book notes that even in its first five years, barely one million Macs were sold. (“It almost failed…” Levy writes. “The Macintosh factory kept churning out gorgeous boxes that gathered dust in dealerships… Apple would experience months where it moved no more than five thousand Macs.”) Apple showed a quarterly loss; it laid off 20% of its workforce, and “The board decided finally that Jobs was the problem.” Just 16 months after the launch, Steve Jobs left Apple — not to return until 1997. In Levy’s book, the Mac ultimately makes inroads with the arrival of serious business applications like the desktop publishing software PageMaker. The Macintosh was upgraded with more memory and a second plug-in floppy drive — and, crucially, a redesigned “Mac Classic” was released for under $1,000. So in its second five years, from 1989 to 1994, Apple sold roughly 10 million Macintoshes. In his book Levy called the Mac “but a step in a path that was probably inevitable, the trail leading to a Digital Nirvana where all information, all music, all pictures, all transactions and all mental activity gets parsed into seething bits of ones and zeros.” But, still — it was “the crucial step, the turning point…” Pogue told the audience at the Computer History Museum that the Macintosh was the result of people who’d worked for “insanely long hours, for insanely low pay — because they believed in their mission…” And when he asked his audience to stand if they’d ever worked on the Macintosh —  dozens did. At the end of the night, Lewin also acknowledged all of the people who’d worked on the hardware — “the manufacturing infrastructure, and everything else. Because software’s pretty, and there’s a lot of good stories about marketing and everything else, but those who had anything to do with hardware — associated with any of these products — I just want to acknowledge the fact that we weren’t able to put it all on stage.” And the audience applauded loudly. At the end of the night the museum invited anyone who’d worked in the Mac division to join a group photo for the museum’s collection (Computer History Museum). Community created roadmaps, articles, resources and journeys for\ndevelopers to help you choose your path and grow in your career. "
}