{
    "title": "Apple Pay Later: 2024 Review",
    "date": "2/26/2024",
    "url": "https://www.nerdwallet.com/reviews/loans/personal-loans/apple-pay-later-buy-now-pay-later",
    "text": "Many or all of the products featured here are from our partners who compensate us. This may influence which products we write about and where and how the product appears on a page. However, this does not influence our evaluations. Our opinions are our own. Here is a list of our partners and here's how we make money. 4.5 For Apple users, Apple Pay Later may be an especially convenient way to delay full payment on a purchase without incurring interest or fees. Apple is the newest entrant into the “buy now, pay later” space. Its classic pay-in-four plan, known as Apple Pay Later, is similar to other BNPL plans but promises no interest or fees, making it a particularly affordable credit option for borrowers. You can use Apple Pay Later to make online and in-app purchases up to $1,000, and eligible users can apply in the Apple Wallet mobile app. » COMPARE: The best buy now, pay later apps Loan amount $75-$1,000. Payment structure Pay-in-four plan. Interest 0%. Availability Available online and in-app. Conducts soft credit check Yes. Minimum credit score None. Late fee No late fee. Other fees No other fees. Option to reschedule a payment No. Pauses account when payment is missed Yes. Apple Pay Later divides your purchase into four equal installments, with the first installment due at checkout and the remaining three installments due every two weeks until the loan is paid off. For example, if you use Apple Pay Later to make a $400 purchase, you’ll pay $100 at checkout. You’ll then have three remaining installments — each $100 — spread out over six weeks. The first payment is taken from the debit card you use to check out. Future payments are managed in the Apple Wallet mobile app, where you can change your payment method, make payments early, make extra payments or pay off the loan entirely. You can also view the total amount due for Pay Later loans in the next 30 days. Apple Pay Later is available for online and in-app purchases, but the merchant must accept Apple Pay. » MORE: Apple announces BNPL feature, Apple Pay Later Whether you should use Apple Pay Later depends on your financial situation. Weigh the pros and cons below to decide whether it’s the right fit for you. No interest or fees: Apple Pay Later charges zero interest or fees, which makes this a particularly affordable way to access credit, especially compared with other financing options like a credit card, where you can accrue interest and fees each month, depending on your repayment behavior. Convenient application and approval: If you already have an iPhone or iPad with access to Apple Pay Later, you can apply for a Pay Later loan directly from your device with no hit to your credit score. For Apple users, this may be a more convenient option than setting up an account with a different BNPL provider. Consumer-friendly features: Apple Pay Later has several built-in features that help protect users. For example, if you miss a payment, Apple won’t approve you for additional Pay Later loans until you’ve caught up, which can help you avoid overextending yourself. You also can only check out with a debit card. Many BNPL providers let you tie your account to a credit card, which means you’re paying for credit with credit. Autopay flexibility: You aren’t required to opt in to autopay to check out with Apple Pay Later. Though autopay can be a convenient way to make payments, it can also lead you to overdraft your bank account if you don’t have enough money on your debit card to cover an installment. If you do check out with autopay, you can turn it off at any time. Also, if your payment is declined while autopay is enabled, Apple will automatically turn off autopay to prevent overdrafts. Credit reporting: Apple reports payment history for Apple Pay Later loans to the credit bureau Experian. That means other lenders can see your Apple Pay Later loan information if they pull your Experian credit report, which could help prevent overextension across credit products. According to Experian, this reporting isn't currently factored into credit scores but may be in the future. Small loan amounts: Apple Pay Later offers loans only up to $1,000, which is smaller than those of some BNPL providers. If you want to break up a large purchase, like a new computer or furniture, you may not be able to use Apple Pay Later. Only one type of payment plan available: Apple doesn’t offer a monthly financing option, which other BNPL providers do. Monthly plans let you break up payments over a longer period — think three months to five years — which can help you finance a larger purchase. These plans can come with interest, though, and are not always a good fit for borrowers. Not available for in-store use: Apple Pay Later is available only for online and in-app purchases, which means you can’t use Apple Pay Later to shop in stores, unlike most other BNPL providers. You can now use “buy now, pay later” to check out at most retailers. The type of payment plan — and whether it charges interest or fees — depends on the BNPL provider, so it’s important to pay close attention to the loan terms you’re offered at checkout. For some users, BNPL is a smart way to break up a purchase, especially if you get a zero-interest offer and are positive you can afford the installments. Getting approved may also be easier compared with credit cards or loans because there’s no minimum credit score requirement. But BNPL is still a form of debt, and there are risks. The Consumer Financial Protection Bureau released a study in September 2022 raising concerns about inconsistent consumer protections, the ease of debt accumulation and overspending, and data harvesting and monetization. Another CFPB study from March 2023 identified BNPL users as more likely to show signs of financial distress. BNPL pros BNPL cons Zero-interest plans available. No minimum credit score required. Available at most major retailers during checkout. Some plans may charge interest. Some plans may charge fees. Payments may not be reported to the three main credit bureaus. Easy to overspend. Disputes and returns can be challenging. NerdWallet recommends using BNPL only for necessary expenses. Though BNPL can be a convenient and low-cost payment option, you’re still taking on debt, and it’s rarely a good idea to go into debt for a nonessential purchase. Approval for Apple Pay Later is based on your credit report, details about your purchase and any previous payment history you may have with Apple Pay Later. Every purchase you make is a separate loan and requires individual approval. To get approved, you’ll need to be at least 18 years old and be a U.S. citizen or a lawful resident with a valid U.S. address that's not a P.O. Box. You might need to verify your identity with a driver’s license or other state-issued ID. You’ll also need to update your iPhone or iPad to the latest version of iOS or iPadOS and set up two-factor authentication. A valid debit card is required to check out with Apple Pay Later. Apple may conduct a soft credit pull when you apply for Apple Pay Later. This won’t affect your credit score. Though there’s no minimum credit score required, users with a 610 FICO score or lower may have a harder time getting approved, according to Apple’s website. Apple Pay Later is similar to pay-in-four plans offered by Affirm and PayPal, which also come with no interest or fees. But Affirm and PayPal offer monthly payment options with larger loan amounts, and Affirm is available for in-store purchases. Interest Terms Fees Affirm 0% for pay-in-four. 0%-36% for monthly financing. Pay in four installments, due every two weeks. Pay monthly, with terms of 3-60 months. No fees. Afterpay 0% for pay-in-four. 6.99%-35.99% for monthly financing. Pay in four installments, due every two weeks. Pay monthly, with terms of 6 or 12 months. Late fee: Up to $8. Apple Pay Later 0%. Pay in four installments, due every two weeks. No fees. Klarna 0% for pay-in-four. 0% for pay in full in 30 days. 7.99%-33.99% for monthly financing. Pay in four installments, due every two weeks. Pay in full in 30 days. Pay monthly, with terms up to 24 months. Late fee: Up to $7. May charge a service fee when you use a one-time card at a nonpartner retailer. PayPal 0% for pay-in-four. 9.99%-35.99% for monthly financing. Pay in four installments, due every two weeks. Pay monthly, with terms of 6, 12 or 24 months. No fees. Sezzle 0% for pay-in-four. 0% for pay-in-two. 5.99%-34.99% for monthly financing. Pay in four installments, due every two weeks. Pay in two installments, due two weeks apart. Pay monthly, with terms of 3-48 months. Late fee: Up to $15. Convenience fee: Up to $1.50. Payment rescheduling fee: Up to $7.50. Zip 0%. Pay in four installments, due every two weeks. Installment fee: Up to $7.50. Late fee: $5, $7 or $10. Payment rescheduling fee: $2. You can apply for Apple Pay Later in the Apple Wallet mobile app. If it’s your first time setting up Apple Pay Later, you’ll need to enter the amount you plan to spend and fill out a short application. Approval decisions are instantaneous. If approved, you can review your payment plan information, including the loan agreement, and then add it to your Apple Wallet. You can also apply for Apple Pay Later during checkout. When you select Apple Pay, you’ll see a Pay Later option. You’ll need to apply for the loan and confirm your personal information. If approved, you can review your payment plan information, including the loan agreement. You’ll then select or add a debit card and confirm payment. If you have good or excellent credit (690 credit score or higher), you may consider a 0% APR credit card. These cards offer introductory periods of up to 21 months and charge no interest during that period. You may also receive a sign-up bonus or access to a rewards program. If you’re looking to fund a large, essential purchase, you could apply for a personal loan. Personal loans have fixed interest rates and longer repayment terms, and there are options for borrowers with fair or bad credit (689 credit score or lower). You can pre-qualify with NerdWallet below to see your loan options. Pre-qualifying doesn’t affect your credit score. NerdWallet’s review process evaluates and rates “buy now, pay later” loan products from the top financial technology providers. We collect over 40 data points from each lender, verify the information with company representatives and compare the lender with others that seek the same customer or offer a similar BNPL product. NerdWallet writers and editors conduct a full fact check and update annually, but also make updates throughout the year as necessary. Our star ratings award points to BNPL providers that offer consumer-friendly features, including: soft credit checks to pre-qualify, zero interest and minimal fees, transparency of rates and terms, flexible payment options, accessible customer service and built-in borrower protections. We also consider regulatory actions filed by agencies like the Consumer Financial Protection Bureau. We weigh these factors based on our assessment of which are the most important to consumers and how meaningfully they impact consumers’ experiences. This methodology applies to classic BNPL loans, which divide payment into four equal installments, typically due over six weeks. Some providers offer other loan products with longer terms, which is factored into the rating process. NerdWallet does not receive compensation for our star ratings. Read more about our ratings methodologies for buy now, pay later and our editorial guidelines. Jackie Veling covers personal loans for NerdWallet. Read more about the author Disclaimer:NerdWallet strives to keep its information accurate and up to date. This information may be different than what you see when you visit a financial institution, service provider or specific product’s site. All financial products, shopping products and services are presented without warranty. When evaluating offers, please review the financial institution’s Terms and Conditions. Pre-qualified offers are not binding. If you find discrepancies with your credit score or information from your credit report, please contact TransUnion® directly. NerdUp by NerdWallet credit card: Bank services offered by Evolve Bank & Trust, Member FDIC. The NerdUp by NerdWallet Credit Card is issued by Evolve Bank & Trust pursuant to a license from Mastercard International, Inc. NerdWallet Compare, Inc.NMLS ID# 1617539 NMLS Consumer Access|Licenses and Disclosures California: California Finance Lender loans arranged pursuant to Department of Financial Protection and Innovation Finance Lenders License #60DBO-74812 Insurance Services offered through NerdWallet Insurance Services, Inc. (CA resident license no.OK92033)Insurance Licenses NerdWallet™ | 55 Hawthorne St. - 10th Floor, San Francisco, CA 94105 "
}