{
    "title": "Vision Pro quick review: After Mark Zuckerberg, Meta CTO shares thoughts \nabout $3,500 Apple headset",
    "date": "2/18/2024",
    "url": "https://www.financialexpress.com/web-stories/technology/vision-pro-quick-review-after-mark-zuckerberg-meta-cto-shares-thoughts-about-3500-apple-headset/",
    "text": "Days after Meta chief Mark Zuckerberg ripped apart the Vision Pro on  social media, company CTO Andrew Bosworth has joined the bandwagon to  review the $3,500 Apple headset. (Photo Credits: Apple) Like Zuckerberg, Bosworth also has some good things and some bad things to say about the iPhone maker’s debut “spatial computer.\" (Photo Credits: Apple) Bosworth mentions that Apple’s choice of build materials for the Vision  Pro are questionable accounting for the “poor” weight distribution. (Photo Credits: Apple) “As soon as I put the headset on, I can see what trade-offs they made and why they made them. And, perhaps definitionally, those aren’t the trade-offs I would have made,” he said. (Photo Credits: Apple) “It’s part of their design language, the metal and the glass. But metal and glass are not premium materials when they’re on your face. When  they’re in your hand, they feel nice and they react nicely. But on your face, lightness is the premium material,\" he added. (Photo Credits: Apple) While the Vision Pro has some “tremendously great things” to offer  including a super-high resolution screen (with little to no latency), Bosworth  isn’t very impressed with how it handles motion blur. (Photo Credits: Apple) Bosworth noted that motion blur in Vision Pro could be distracting, particularly if you tend to look around a lot. (Photo Credits: Apple) The Meta CTO also took a dig at Apple’s exorbitant pricing urging people to “Save yourself $3,000.” (Photo Credits: Apple) “Am I being totally fair? I don’t know. I am not here to be fair. I am being honest with you,\" he said, (Photo Credits: Apple) Zuckerberg recently released an almost three and a half minute long video review of Apple’s Vision Pro headset. (Photo Credits: Apple) “I don’t just think that Quest is the better value, I think Quest is the better product, period,\" Zuckerberg said. (Photo Credits: Apple) "
}