{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37151071/warren-buffetts-apple-appetite-waning-berkshire-trims-top-holding-ditches-big-homebuilder-bulks-",
    "text": "Billionaire investor Warren Buffett-led Berkshire Hathaway, Inc.‘s BRK BRK latest 13F report, filed with the SEC, surprised some by not revealing any new major positions in the fourth quarter. However, the report did disclose some interesting changes within the existing portfolio: Apple Adjustments: Despite remaining the top holding, Berkshire trimmed its Apple Inc. AAPL shares by over 10 million, suggesting a cautious outlook despite the stock’s continued appreciation and dividend payments. At the end of the quarter, the firm held 905.56 million Apple shares. Berkshire stands to receive $217 million in dividend income alone from its Apple investment, assuming it hasn’t tinkered with its holdings in the quarter-to-date period. The move comes on the heels of the company’s fundamentals faltering slightly amid soft demand for its flagship hardware product, the iPhone. Despite the cutback, the value of Berkshire’s Apple holding rose from $156.75 billion at the end of the third quarter to $174.35 billion at the end of the fourth quarter, reflecting the tech giant’s 12.6% rally during that period. See Also: How To Buy Stocks Chevron Acquisition: The firm added 15.9 million worth of Chevron Corp. CVX shares, taking its total holding in the oil giant to 126.09 million and highlighting a potential shift towards the energy sector amid current economic uncertainties. Other Core Holdings: Positions in Bank of America, American Express, and Coca-Cola remained unchanged, showcasing continued confidence in these long-term bets. Along with Apple and Chevron, these stocks make up roughly 75% of the aggregate fair value of its equity portfolio. Strategic Stock Picks: Berkshire increased its stake in favored energy company Occidental Petroleum Corp. OXY by 19.59 million to 243.72 million and boosted its stake in Sirius XM Holdings Inc. SIRI from 9.7 million to 40.24 million shares. Portfolio Trimming: However, the firm reduced its position in Paramount Global Class B shares PARA by over 30 million to 63.32 million shares, as the troubled media conglomerate explores merger-and-acquisition options. Amid rumors of a potential sale, reports earlier this week suggested Paramount — which owns media properties such as ABC News, MTV and Comedy Central — is cutting roughly 3% of its workforce. Shari Redstone, the chairman of privately-held National Amusement, which owns Paramount, is rumored to have discussed the sale of Paramount to Warner Bros. Discovery. Buffett also reduced Berkshire’s stake in computer and peripheral device manufacturer HP Inc. HPQ by 79.67 million to 22.85 million. Portfolio Exits: The firm exited positions in D.R. Horton, Inc. DHI, while maintaining its stake in Lennar Corp. LEN at 152,572 shares, paring back on big bets made last year when the housing market was under tremendous pressure. It also cashed out of Globe Life Inc. GL, Markel Group Inc. MKL, and StoneCo Ltd. STNE. Price Action: Berkshire’s Class A shares ended Wednesday’s session up 1.20% at $601,000  and Class B shares rose 0.98% to $398.68, according to Benzinga Pro data. Apple slipped 0.48% to $184.15. Read Next: What Warren Buffett Considers As His ‘Secret Sauce’ After 58 Years Of Managing Berkshire Hathaway © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}