{
    "title": "Apple Captures the Top Spot in the China Smartphone Market in 2023 for the \nFirst Time Ever, Despite the Overall ...",
    "date": "1/24/2024",
    "url": "https://www.idc.com/getdoc.jsp?containerId=prAP51817224",
    "text": "IDC Global Solutions Share Publication date: 24 Jan 2024 BEIJING and NEEDHAM, Mass., January 25, 2024 – A shift of power that we saw on the worldwide stage also happened in China, the largest smartphone market globally. Apple became the leading smartphone company in China for the first time with record high market share of 17.3% in 2023. According to preliminary data from the International Data Corporation (IDC) Worldwide Quarterly Mobile Phone Tracker, China smartphone shipments totaled 271.3 million units in 2023, which was a decline of 5.0% compared to 2022. This was the lowest volume in a decade, stemming from a soft economic recovery and weak consumer sentiment. While the Chinese smartphone market remains challenged, it is moving towards recovery with the fourth quarter of 2023 (4Q23) delivering year-over-year growth of 1.2% on shipments of 73.6 million units, marking the end of ten consecutive quarters of year-over-year decline. The resilient high-end consumers in the tier 1-3 cities were the key drivers, fueling demand for flagship products. Meanwhile, demand for low- to mid-range devices remained weak, impeding the overall growth of the market as they represent over half the smartphone market in China. \"Apple's climb to the top spot in 2023, especially in light of renewed competition from Huawei and the soft spending sentiment, marks a tremendous success for Apple,\" said Arthur Guo, senior research analyst in Client System Research for IDC China. \"Apple achieved this thanks to timely price promotions in its third-party channels, which stimulated demand. Meanwhile, Honor maintained its number 2 position thanks to improvement in its channel partnerships and a well-rounded product strategy, capturing the high end with its successful foldable lineup and the low-to-mid range with several popular models.\" \"One key highlight we shouldn't miss in 4Q23 was the return of Huawei to the Top 5 ranking after more than two years,\" said Will Wong, senior research manager for Client Devices at IDC Asia/Pacific. \"This will only intensify the competition as no vendors will want to lose a top 5 position in the world's largest smartphone market.\" China Smartphone Market, Top 5 Companies, 2023 and 2022 Market Share and Year-Over-Year Growth Company 2023 Market Share 2022 Market Share 2023/2022 Growth 1. Apple 17.3% 16.8% -2.2% 2. Honor 17.1% 18.1% -10.3% 3. OPPO 16.7% 17.5% -9.4% 4. vivo 16.5% 18.6% -15.5% 5. Xiaomi 13.2% 13.6% -8.5% Others 19.1% 15.3% +19.0% Total 100.0% 100.0% -5.0% Source:  IDC Worldwide Quarterly Mobile Phone Tracker, Q4 2023  China Smartphone Market, Top 5 Companies, Q4 2023 and Q4 2022 Market Share and Year-Over-Year Growth Company 4Q23 Market Share 4Q22 Market Share 4Q23/4Q22 Growth 1. Apple 20.0% 20.6% -2.1% 2. Honor 16.8% 17.1% -0.9% 3. vivo 15.7% 17.4% -8.4% 4. Huawei 13.9% 10.3% +36.2% 5. OPPO 13.7% 16.5% -16.1% Others 20.0% 18.1% +11.9% Total 100.0% 100.0% +1.2% Source:  IDC Worldwide Quarterly Mobile Phone Tracker, Q4 2023 Notes: About IDC Trackers IDC Tracker products provide accurate and timely market size, vendor share, and forecasts for hundreds of technology markets from more than 100 countries around the globe. Using proprietary tools and research processes, IDC's Trackers are updated on a semiannual, quarterly, and monthly basis. Tracker results are delivered to clients in user-friendly Excel deliverables and on-line query tools. For more information about IDC's Worldwide Quarterly Mobile Phone Tracker, please contact Jackie Kliem at 508-988-7984 and jkliem@idc.com. Click here to learn about IDC's full suite of data products and how you can leverage them to grow your business. About IDC International Data Corporation (IDC) is the premier global provider of market intelligence, advisory services, and events for the information technology, telecommunications, and consumer technology markets. With more than 1,300 analysts worldwide, IDC offers global, regional, and local expertise on technology, IT benchmarking and sourcing, and industry opportunities and trends in over 110 countries. IDC's analysis and insight helps IT professionals, business executives, and the investment community to make fact-based technology decisions and to achieve their key business objectives. Founded in 1964, IDC is a wholly owned subsidiary of International Data Group (IDG), the world's leading tech media, data, and marketing services company. To learn more about IDC, please visit www.idc.com. Follow IDC on Twitter at @IDC and LinkedIn. Subscribe to the IDC Blog for industry news and insights. -###- All product and company names may be trademarks or registered trademarks of their respective holders. Copy the following code into your site China Smartphone "
}