{
    "title": "Apple shares video highlighting Apple Music collaborative playlists",
    "date": "1/22/2024",
    "url": "https://9to5mac.com/2024/01/22/apple-music-collaborative-playlists/",
    "text": "Apple on Monday released iOS 17.3 along with other software updates that come with new features, including collaborative playlists for Apple Music subscribers. The feature lets you team up with other people to create shared playlists where everyone can contribute songs. And to promote the update, Apple has shared a new video about it with the hosts of Rap Life Review. The 3-minute video published on Apple Music’s YouTube channel features Ebro Darden, Nadeska Alexis, and Lowkey. They show users how to invite friends to collaborate on Apple Music playlists using the latest version of iOS. During the video, the presenters also demonstrate how to react to specific songs in an Apple Music playlist using emoji. It’s worth noting that collaborative playlists were first added in the iOS 17.2 beta, but then removed before the final release. Now both collaborative playlists and emoji reactions are available to everyone with iOS 17.3. Another Apple Music feature promoted in the video is SharePlay with CarPlay, which is also part of iOS 17. This lets passengers in a CarPlay-enabled vehicle control the music from their own device, even if they don’t subscribe to Apple Music. Nadeska, Ebro and Lowkey break down two new features available in Apple Music. First, it’s easier than ever to curate and share music with friends. Apple Music has added a host of new features to playlists, including the ability to collaborate with other subscribers in real time. It’s a whole new way to listen to, and discover, great music. Second, the newest feature in SharePlay gives passengers control of the music from their own device. Now everyone along for the ride can play DJ on Apple Music. You can watch the full video below, or directly on YouTube’s website or app: FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Apple Music is a streaming service that includes… Filipe Espósito is a Brazilian tech Journalist who started covering Apple news on iHelp BR with some exclusive scoops — including the reveal of the new Apple Watch Series 5 models in titanium and ceramic. He joined 9to5Mac to share even more tech news around the world. "
}