{
    "title": "Apple and Tesla may no longer be ‘safe investments’ as China’s troubles grow",
    "date": "1/17/2024",
    "url": "https://www.marketwatch.com/story/apple-and-tesla-may-no-longer-be-safe-investments-as-chinas-troubles-grow-b05905db",
    "text": "Another tough day for Wall Street is in the making after China growth numbers disappointed, hitting oil and a bunch of U.S.-listed Chinese stocks. That brings us to our call of the day, where market observers say China-related trouble continues to build for Tesla \n        TSLA\n       and Apple \n        AAPL\n       and their investors. In a note to clients, Mike O’Rourke, chief technical strategist at JonesTrading, observes how Magnificent Seven stocks have been under pressure to shore up the S&P 500 \n        \n       in a bumpy 2024. “Key leaders Apple and Tesla continue to be bombarded by daily negative headlines regarding their fundamental businesses. While it barely draws much attention, it does not help that they are also the two most China exposed companies,” says the strategist. Apple and Tesla have lost 4% and 11% respectively this year, the worst performers of the seven. So is China a common denominator for the pair’s woes? Apple recently cut handset prices in the China where it battles competitors like Huawei.  Tesla also reduced EV prices in the country where Berkshire Hathaway-owned BYD \n        CN:002594\n       rules. Wednesday brought news of Tesla price cuts in Germany, where it faces production disruptions due to Red Sea ship attacks. China represented a 19% chunk of Apple’s revenue in 2023, and roughly 22% for Tesla in the first nine months of last year. Jenny Hardy, portfolio manager on the GP Bullhound Global Technology Fund, tells MarketWatch that for Apple and Tesla, “it’s much more about the competitive environment that could hurt them rather than their underlying markets.” She notes that in a gloomy China market, EVs and smartphone sales were strong into end 2023. Hardy notes a number of new launches in China have been competing with Tesla at the higher end, such as Huawei’s luxury Aito M9 model, rumored to have hit weekly sales of more than 20,000. “At the very least for Tesla it means the aggressive price war it is facing in China continues,” she says. And Huawai has also been taking “significant share” where Apple is concerned. That company had a 16% smartphone share in China that fell to around 2% by 2022 after the U.S. blacklist, she notes. “For us in the portfolio, we continue to be exposed to China EV through the semiconductor component companies who supply into the Chinese market (Infineon \n        XE:IFX\n       and NXP \n        NXPI\n      ) – who are less vulnerable to pricing pressure than the OEMs. We remain cautious around broader consumer electronics exposure, where the Chinese demand recovery remains uncertain,” Hardy says. More food for thought comes from Peter Navarro, former White House trade adviser under President Donald Trump, whose recent op/ed — “The eve of Apple and Tesla’s destruction in China” — has been making the rounds. Navarro, it should be noted, is due to be sentenced later this month after being found guilty of contempt of Congress for not cooperating with a probe into the U.S. Capitol attack two year ago. “Like GE before it, Apple and Tesla now have this grim mercantilist reality. Because Mr. Cook and Mr. Musk each directed the offshoring of the vast bulk of Apple’s and Tesla’s production to China , the companies are at the mercy of a merciless dictator in Xi Jinping,” he writes. “Arrogance and hubris are common threads that run from Mr. Immelt  [Jeffrey, former CEO] in the 2000s through Mr. Cook and Mr. Musk today,” said Navarro, adding that the companies’ products face a “xenophobic ban” in the country. The food-for-thought kicker from Navarro? “Whether you are a big hedge-fund manager or a small retail investor, you have to wonder whether Apple or Tesla are still safe investments — at least on the long side, if you get my drift.” Read: Is AI hype starting to fade? Companies are poised to turn the talk into action in 2024, says Deutsche Bank. U.S. stocks \n        \n\n       are in the red, with tech \n        \n       out in front after retail sales data. The action was in bonds: the yield on the 2-year Treasury \n        \n       shot 14 basis points higher. Retail sales came in surprisingly strong — up 0.6% at the headline level, or up by 0.4% excluding autos. Separately, import prices were steady in December. Industrial production rose 0.1%, beating estimates for a fall of that magnitude, and a home builders confidence index is coming at 10 a.m. Data showed weekly mortgage demand surging as rates fell across the board. Fed Vice Chair for Supervision Michael Barr and Fed Gov. Michelle Bowman will both speak at 9 a.m. The Fed’s Beige Book of economic conditions is due at 2 p.m. Charles Schwab stock \n        SCHW\n       is down after its fourth-quarter profit was halved, though adjusted earnings topped estimates. Spirit Airlines shares \n        SAVE\n       remain under pressure after a federal judge blocked JetBlue’s proposed $3.8 billion acquisition of the airline. A JPMorgan analyst said JetBlue dodged a bullet. China’s economy grew 5.2% in 2023, but data showed an uneven recovery and some analysts were looking for growth of 5.3%. Read: Government shutdown: Congress has four days to act. Here’s what’s at risk. Japan’s market roars back to life—with old-timers leading the way The downside of a longer life: More time spent sick Former Australian prime minister dismisses peak China narrative The rocky start to 2024 is a sign the “easy money” has been made and to expect a challenging year, says Tom Lee, head of Fundstrat. “But the reason we see the ‘easy money’ made is we are now overbought. So, even with new highs likely at the end of January, this is not a full ‘risk-on’ market,” says Lee, who adds the bulk of gains will be seen in the second half. These were the top-searched tickers on MarketWatch as of 6 a.m.:  U.K. space minister mocked after confusing the Sun and Mars, A 524.7 pound bluefin tuna sold for $789,000 in Tokyo. Pizza may be a healthy food — sort of. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern. Goldman Sachs lays out a scenario for the S&P 500 to hit 6,000 by the end of the year thanks to Big Tech. Barbara Kollmeyer is based in Madrid, where she leads MarketWatch's pre-markets coverage of financial markets and writes the Need to Know column. She has worked in London and Los Angeles for MarketWatch previously. Follow her on Twitter @bkollmeyer. Barbara Kollmeyer is based in Madrid, where she leads MarketWatch's pre-markets coverage of financial markets and writes the Need to Know column. She has worked in London and Los Angeles for MarketWatch previously. Follow her on Twitter @bkollmeyer. Visit a quote page and your recently viewed tickers will be displayed here. "
}