{
    "title": "Apple Makes Another Breakthrough, Unveils New AI Model That Can Manipulate \nImages With Natural Language Commands",
    "date": "2/8/2024",
    "url": "https://wccftech.com/apple-new-ai-model-with-natural-language-input/",
    "text": "Apple is lagging behind the likes of ChatGPT and Google's Gemini in a lot of aspects. However, the company has invested heavily in AI as it aims to bring the technology to the iPhone 16 lineup later this year with the release of iOS 18. It is now being reported that Apple researchers have released a new AI model that can edit images based natural language commands by the user. The technology will possibly be showcased at the company's WWDC 2024 event in June. Apple's new AI model, called \"MGIE,\" or MLLM-Guided Image Editing, is a multimodal large language model that can interpret and execute user commands on a pixel level (via VentureBeat). The tool can manipulate and edit a plethora of areas of an image, including brightness, sharpness, contrast, and much more. It can also manipulate an image to add artistic effects. Other than this, local editing could alter the subject's shape, color, size, and texture in a photo. Photoshop-like editing includes resizing the image or cropping, rotating, and adding filters. Users can also change the background of the image. Apple's new AI model understands context and common reasoning. For instance, you can add an image of a pizza and a prompt to make it healthier. The AI model will automatically add vegetables to the image, understanding that health is associated with vegetables in the food. Using the global optimization requests, the tool can manipulate the lighting and contrast of an image. Furthermore, Photoshop-like editing can also eliminate objects from the background upon request from the user. You can see Apple's AI model in action in the image added below. The company has partnered with the University of California researchers to create MGIE, and once the technology is ready, the company will create various applications for its devices. The paper was presented at the International Conference on Learning Representations (ICLR) 2024. If you are interested in checking out the AI model, the code and data with pre-trained models are available on GitHub. Apple has been working on AI for quite a while now, and even though it is late to implement, the features could be different from the industry. Last year in December, the company invented the flash memory utilization technique in December, allowing large language models to work on the iPhone and other Apple products. Apple will announce some AI features later this year, potentially at the WWDC 2024 event alongside iOS 18 and other software updates. Previous reports have mentioned that Apple will deploy generative AI features with the launch of the new iPhone models later this year. iOS 18 will use AI to put Siri on steroids as it currently falls behind the likes of Google Assistant and Amazon's Alexa. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}