{
    "title": "A premium-only airline says it will give some passengers Apple Vision Pros \ninstead of regular in-flight entertainment",
    "date": "2/16/2024",
    "url": "https://ca.finance.yahoo.com/news/premium-only-airline-start-giving-111123927.html",
    "text": "Wall Street took a break from rally on Monday, with all three major indexes dipping slightly Beond announced it would give the Apple Vision Pro to select passengers on its flights. It bills itself as the world's first premium-leisure airline, where every seat can lie flat. But Beond's shortest route is still double the length of the Vision Pro's battery life. An airline operating only business-class services has announced plans to give an Apple Vision Pro to \"select passengers\" on some of its flights. Beond describes itself as the world's first premium-leisure airline, with every seat able to turn into a lie-flat bed. It began operating its first three routes last November. They all go to or from the Maldives. Beond CEO Tero Taskila said as well as movies and games, it was working on \"truly amazing footage\" to \"showcase stunning resort destinations and activities in the Maldives.\" \"The inflight experience will build anticipation for passengers before they arrive in the Maldives,\" he added. \"Offering the Apple Vision Pro is another step in our vision of delivering a premium travel experience to our customers, from the start to finish of their journey.\" It makes sense that the budding startup — which last week took delivery of its second plane — would be the first carrier to embrace the Vision Pro. When Apple first announced its virtual-reality headset, the showcase featured a scene using it on an airplane. And Marques Brownlee, a tech-review YouTuber, said using the Vision Pro on a plane was the aspect he was most excited about. But some users have encountered problems when trying to use it in the air — such as motion sickness and tracking glitches. The Vision Pro's battery life is also only about 2 ½ hours, while Beond's shortest route is double that. Beond's aircraft use iPads for their in-flight entertainment systems rather than the typical seatback layout. From July, it's launching a route from Dubai to the Maldives — competing with Emirates. As it's going up against airlines that offer first-class seats with enormous screens, the Vision Pro is something that could give it an edge. Read the original article on Business Insider The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein  Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises.  Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr.,  (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach  “The Daily Show” host tears into the former president’s claim ― and shows why the case matters. New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit.  The Ohio lawmaker was asked about Donald Trump’s debunked claims about the 2020 election. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Anne Hathaway told Vanity Fair during a cover story interview that Christopher Nolan more or less saved her career when public opinion turned against her in the lead up to and the aftermath of her winning the Oscar for “Les Miserables.” Hathaway was widely mocked online at this time, and she once remembered googling herself …  The president has been going after his presumptive 2024 opponent with a little more venom than usual President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… The rapper was caught off guard when her \"whole boob\" fell out of her top on stage "
}