{
    "title": "The Super Bowl, Disney’s blowout and Microsoft topples Apple as credit card \nhits record",
    "date": "2/10/2024",
    "url": "https://www.foxbusiness.com/markets/super-bowl-disneys-blowout-microsoft-topples-apple-as-credit-card-hits-record",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy FanDuel CEO Amy Howe previews gambling expectations and obscure wagers ahead of Sunday’s Super Bowl. — Super Bowl mania is underway as Taylor Swift scores for the NFL — Disney CEO Bob Iger pulled a few rabbits out of his hat, sending shares soaring — Microsoft leapfrogged Apple to become the world's most valuable company — S&P 500 surpasses 5,000 for first time ever despite mixed economic data — President Biden's mental health under fire — Credit card debt hits fresh record as consumers drown in debt — McDonald's CEO understands prices are starving customers TOP STORY: SUPER BOWL LVII: Taylor Swift and Travis and Mama Kelce will take the spotlight Sunday in Las Vegas as the Kansas City Chiefs take on the San Francisco 49ers for the NFL's biggest night, and Americans are expected to gamble billions for not only the game but the players on and off the field…continue reading here. FULL COVERAGE: THE SUPER BOWL IS BIG BUSINESS VIDEO: BetMGM CEO is gambling on his company for the win. Taylor Swift reacts during a game between the Buffalo Bills and the Kansas City Chiefs at GEHA Field at Arrowhead Stadium Dec. 10, 2023, in Kansas City, Mo. (Jamie Squire/Getty Images / Getty Images) DISNEY CEO DELIVERS: Bob Iger worked his magic, outlining a plan to drive growth at the media giant in the coming year; those include a Taylor Swift deal, a new movie, a legendary ESPN hire and a dive into gaming…continue reading here. VIDEO: Top media analyst Jessica Reif Ehrlich weighs in on Disney, whose shares jumped over 11% this week. DISNEY STOCK THIS WEEK: +11% (FOXBusiness.com) MICROSOFT TROUNCES APPLE: Helping drive the S&P 500 above 5,000 for the first time, Microsoft knocked Apple off its perch to become the most valuable company Friday with a market cap of $3.1 trillion…continue reading here. VIDEO: Billionaire Ken Fischer gives his take on tech's dominance and U.S. stocks. Microsoft versus Apple  (Dow Jones Market Data Group ) PRESIDENT BIDEN UNDER FIRE: Following the release of special counsel Robert Hur's damning report that fueled more questions about Biden's mental acuity, pressure mounts for the Democrats with the 2024 election…continue reading here. VIDEO: Biden's team is doing more harm than good, says Fox's Tomi Lahren. FOLLOW THE FOX BUSINESS DEBT TRACKER: HERE DANGER ZONE: Credit card debt climbed to another fresh record with many Americans paying north of 21% on balances, squeezing household budgets…continue reading here. VIDEO: How credit card debt is making us broke. MICKEY'S D'S IS PRICEY: McDonald’s CEO Chris Kempczinski admitted prices at the fast-food giant are becoming unaffordable for some, and he's hoping to make some changes…continue reading here. A tray with a Big Mac, French fries and Coca-Cola on a table in an illustration photo taken in a McDonald's restaurant in Krakow, Poland, Nov. 9, 2022.  (Jakub Porzycki/NurPhoto via Getty Images) / Getty Images) UP NEXT: -Looking for more business and market-moving headlines? Find more from FOX Business here. -Want live updates? Get the FOX Business app here. -Did someone forward you this email? Subscribe to additional newsletters from Fox News and FOX Business here. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}