{
    "title": "Apple engineers reportedly explored working on a smart ring",
    "date": "2/25/2024",
    "url": "https://www.cultofmac.com/847487/apple-engineers-reportedly-explored-working-on-smart-ring/",
    "text": "By Rajesh Pandey • 8:45 am, February 25, 2024 Apple’s industrial design team reportedly proposed working on a smart ring a few years ago. The ring would have apparently packed all the health-tracking features of the Apple Watch. Additionally, Apple engineers recently discussed working on smart glasses like the Meta Ray-Bans. In both cases, though, the devices are just an idea, with the company not actively working on them.  Apple’s wearable business now accounts for 10% of its revenue. That’s a 50% increase from less than a decade ago. This business includes AirPods and Apple Watch, with the Vision Pro being the latest inclusion. Given the wearable’s business growth, the company will likely keep exploring new form factors for growth and acquiring new customers. Interestingly, Samsung officially teased its smart ring in January this year. The Korean giant’s new health wearable will launch later this year, presumably in Q3 2024. Oura is another major player in the smart ring market that has made a name for itself. In the latest Power On newsletter, Bloomberg‘s Mark Gurman reveals two new wearable devices proposed by Apple engineers. The industrial design group suggested the smart ring idea a few years ago. And while some people within Apple are backing the device, it is not under active development. Apple was granted a patent for a smart ring in 2020, which indicated you could use predefined hand gestures to control other smart home devices. The patent claimed the ring would have a touch-sensitive surface, with the wearer using it to input gestures. These additional features could set Apple’s smart ring apart from the competition, provided it ever sees the light of the day. Given its compact form factor, an Apple Ring could become a great low-cost alternative to the Apple Watch, especially if it can pack all the health features of the latter. Cult of Mac‘s Ed Hardy believes the Apple Ring is the health accessory we need, as its compact size and potentially long battery would make it a great Apple Watch alternative for many. As for smart glasses, Gurman reports Apple has had talks to build them as an AirPods replacement. They would ship with bigger batteries and sensors to deliver a better user experience. And they won’t cost $3,500 like the Vision Pro; instead, the glasses would be cheaper than the headset. Over the years, several major companies have entered the smart glasses segment. However, the Meta Ray-Bans seems to have worked with consumers, with its popularity growing with time. Apple has reportedly also considered putting cameras on AirPods and other advanced health sensors. But like the smart ring and the glasses, the company is not actively on such earbuds.   Daily round-ups or a weekly refresher, straight from Cult of Mac to your inbox. Our daily roundup of Apple news, reviews and how-tos. Plus the best Apple tweets, fun polls and inspiring Steve Jobs bons mots. Our readers say: \"Love what you do\" -- Christi Cardenas. \"Absolutely love the content!\" -- Harshita Arora. \"Genuinely one of the highlights of my inbox\" -- Lee Barnett. The week's best Apple news, reviews and how-tos from Cult of Mac, every Saturday morning. Our readers say: \"Thank you guys for always posting cool stuff\" -- Vaughn Nevins. \"Very informative\" -- Kenly Xavier. "
}