{
    "title": null,
    "date": "2/17/2024",
    "url": "https://finance.yahoo.com/news/chinese-start-emdoorvr-counts-apple-093000566.html",
    "text": "People in most parts of the world have yet to get their hands on Apple's Vision Pro, the tech giant's first mixed-reality headset that launched exclusively in the US earlier this month. But in the southern Chinese tech hub of Shenzhen, sellers are already offering much cheaper alternatives. One of them is the Vision SE, made by Shenzhen-based headset maker EmdoorVR. CEO Shi Qing said the company was hoping to leverage the interest around Apple's Vision Pro to survive a slowdown in the virtual reality (VR) and augmented reality (AR) industry. \"We did not want to miss the Apple Vision Pro opportunity, so we rode the wave and made something similar,\" he said. Do you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. From its white straps and curved front screen down to its name, the Vision SE shows remarkable similarities with Apple's headset. Yet, their functionality and prices are starkly different. A customer tests a Vision Pro headset at an Apple store in Palo Alto, California. Photo: Bloomberg alt=A customer tests a Vision Pro headset at an Apple store in Palo Alto, California. Photo: Bloomberg> For less than 2,000 yuan (US$280), the Vision SE lets users view videos, web pages and workplace apps in a VR and AR environment through its 5.5-inch LCD display that has 3664 x 1920 pixels combined. But the device, powered by Qualcomm's entry-level AR and VR processor Snapdragon XR1, lacks the eye tracking and hand-gesture interaction experience offered by the Apple Vision Pro, which has a starting price of US$3,499 and costs twice as much in China's grey market. While Apple's device dives into the new concept of spatial computing, Emdoor's Vision SE focuses more on providing an entertainment experience, according to Shi. Shi said he recognised the two devices' resemblance, which has earned the Vision SE the nickname \"Huaqiangbei Vision Pro\" on social media, after the famed consumer electronics market in Shenzhen that is known for selling knock-off gadgets. Shi stressed that the company had filed for relevant patents and undergone auditing to avoid legal risks. The devices from EmdoorVR and Apple arrived after a rocky year for the AR and VR industry, which saw global shipments decline 8.3 per cent to 8.1 million units in 2023, research firm IDC estimated in December. Demand was curtailed by macroeconomic pressures on both consumers and businesses, according to that report. In China, Pico, the world's second-largest VR brand and a subsidiary of TikTok owner ByteDance, conducted at least two rounds of lay-offs last year, affecting hundreds of employees. The VR arm of video-streaming site iQiyi delayed salary payments and reduced headcount, according to a report by Chinese media outlet Caixin last April. Visitors tried out the EmdoorVR Vision SE headset at the CES electronics expo in Las Vegas last month. Photo: Handout alt=Visitors tried out the EmdoorVR Vision SE headset at the CES electronics expo in Las Vegas last month. Photo: Handout> 2024 is going to be different, according to IDC. The global AR and VR market is expected to grow more than 46 per cent thanks to the launch of Apple's Vision Pro, as well as the availability of the Facebook owner's Meta Quest 3, released last October. The sector is \"at a critical point in its short history,\" said Ramon Llamas, IDC research director for mobile devices and AR/VR. \"Apple's entry [in 2024] will bring much needed attention to a small market, but it will also force other companies to compete in different ways.\" Established in 2015, EmdoorVR started as a contract manufacturer of VR devices for Chinese tech firms including iQiyi and ZTE, as well as other industry and government clients. EmdoorVR's enterprise-facing business contributes around 90 per cent of the firm's total revenue, according to Shi. The company has shipped 200,000 units of its AX161 headset, an enterprise product with the same specifications as Vision SE, since its launch last year. Vision SE is EmdoorVR's shot at the consumer segment, and the company is counting on Apple to pave the way. The device's marketing and launch schedule follows closely that of the Californian giant: Vision SE hit the market in October, just months after Apple unveiled the Vision Pro in June. EmdoorVR then showcased its headset at CES, one of the world's leading consumer electronics expos, which took place in Las Vegas last month, right before the Vision Pro shipped on February 2. A person tried out a Meta Quest 3 headset at the Facebook owner's headquarters in Menlo Park, California. Photo: AFP alt=A person tried out a Meta Quest 3 headset at the Facebook owner's headquarters in Menlo Park, California. Photo: AFP> Apple's entry into the VR and AR market has already drawn the interest of Chinese app developers. DingTalk, the work collaboration platform run by e-commerce giant Alibaba Group Holding, recently launched a native app for the Vision Pro, allowing users to send messages and hold video meetings in a three-dimensional virtual environment. Alibaba is the owner of the South China Morning Post. Shanghai-based online travel service provider Trip.com Group - which also operates Ctrip, Qunar and Skyscanner - has also introduced an app for the Vision Pro, letting users watch panoramic videos of travel destinations, such as Mount Everest and the Sahara. Emdoor's Shi said he saw the Apple Vision Pro as a major opportunity to educate the market and bring substantial changes to the content ecosystem and supply chain, which would eventually make similar headsets more popular and affordable. But for now, his top goal is just to stay afloat after a challenging year. \"2023 has been tough for the VR industry, which saw tech giants downsize their investment and manpower in these projects,\" Shi said. \"My priority for my team is to survive and ship products.\" This article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2024 South China Morning Post Publishers Ltd. All rights reserved. Copyright (c) 2024. South China Morning Post Publishers Ltd. All rights reserved. Related Quotes "
}