{
    "title": "‘A Kodak déjà vu’: Apple’s Vision Pro is yet to find its killer app–and it \ncould spell trouble for Tim Cook’s risky bet",
    "date": "2/9/2024",
    "url": "https://fortune.com/2024/02/09/a-kodak-deja-vu-apples-vision-pro-killer-app-tim-cook-tech-retail/",
    "text": "Apple has started shipping its Apple Vision Pro, its take on a headset that combines Virtual Reality (VR) and Augmented Reality (AR). While the product is an amazing technical tour de force, I believe the product-market fit of this first iteration is a swing and a miss. I’ve watched other world-class consumer product companies make the same mistakes over and over again: I lived through the equivalent of this when Kodak (remember them?) launched a product in 1990 called PhotoCD. Kodak wanted consumers to put their film photos on their home CDROM drives and then display them on their televisions. You dropped off your film at a film processor and instead of just getting physical prints of your pictures they would scan the film and burn them onto a Compact Disc. You’d go home with a Compact Disc with your pictures on it. I got a preview of PhotoCD when I was the head of marketing at SuperMac, a supplier of hardware and software for graphics professionals. The moment I saw the product I knew every one of my professional graphics customers (ad agencies, freelancers, photo studios, etc.) would want to use it. In fact, they would have paid a premium for it. I was floored when Kodak told me they were launching PhotoCD as a consumer product. The problem was that in 1990, consumers did not have CDROM drives to display the pictures. At the time, even most personal computers lacked them. Meanwhile, every graphics professional did own a CDROM drive but most didn’t own a high-resolution film scanner. They would have been the perfect launch customers for PhotoCD. To this day, I remember being lectured by a senior Kodak executive, “Steve you don’t get it, we’re experts at selling to consumers. We’ll sell them the CDROM drives as well.” Except the Kodak CDROM drives were the size of professional audio equipment and depending on the model, cost $600 to $1000 in today’s dollars. And when consumer CDROM drives became available they couldn’t play the PhotoCD disks as they were encoded in a proprietary Kodak standard to lock you into their drives! The result? PhotoCD failed miserably as a consumer product. Subsequent pivots to professional graphics users (a segment they knew well) came too late, as low-cost scanners and non-proprietary standards (JPEG) prevailed. Similarly, Apple is trying to push Vision Pro onto their existing consumer customers. All the demos and existing applications are tailored to the consumer market. Additionally, Apple did not create demos for how the Vision Pro could be used in new markets where users would jump at the opportunity to buy a Vision Pro. For example, the internet is rife with proof of demand in an adjacent mass market: helping millions of homeowners repair things around their property. There is also proven demand for Industrial applications outside of the consumer space. Every company that has complex machinery has been experimenting with AR for years. Imagine car repair with a Vision Pro AR tutorial. Or jet engine maintenance. Or the entire gamut of complex machinery. All of these would have been great Vision Pro demos for training and repair. It’s hard to understand why Apple ignored these easy wins. Apple’s entry into new markets by creating new product categories–iPods, iPads, iPhones–is unprecedented in the history of modern corporations. $300 billion (75% of their revenue) is from non-computer hardware. In addition, they’ve created an entirely new $85+ billion subscription business model with the App Store, iTunes, Apple Care, Apple Pay, Apple Cash, Apple Arcade, Apple Music, and Apple TV. It’s hard to remember, but the first versions of these products launched with serious limitations that follow-on versions remedied. The first version of the iPhone only ran Apple software, it had no app store. It was a closed system. It had no copy-and-paste function, and couldn’t record video, among other limitations. The original Apple Watch was positioned as a fashion accessory. It wasn’t until later that Apple realized the Watch’s killer apps were fitness and health. Fixing the technical flaws while finding the right markets took time and commitment. The same will likely be true for the Vision Pro. Apple’s model is to provide the hardware and then let their developer community come up with the kind of applications. However, all of the applications on this first release are in their current markets (entertainment, music, etc.). None of these are killer apps for the product. Apple marketers will realize that adjacent spaces they are less familiar with will provide the first “got to have it” beachhead markets. Newer iterations will ride the technology wave of lighter and cheaper versions. Apple’s CEO Tim Cook has made a personal bet on the Vision Pro. More than any other company, they have sufficient resources (cash on hand and engineering talent) to pivot–and ensure the Vision Pro’s product-market fit in the real markets that need it. Here’s to hoping they find it. Steve Blank is an adjunct professor at Stanford and co-founder of the Gordian Knot Center for National Security Innovation. The opinions expressed in Fortune.com commentary pieces are solely the views of their authors and do not necessarily reflect the opinions and beliefs of Fortune. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}