{
    "title": "Apple to Sell Watches With Blood-Oxygen Feature Disabled",
    "date": "1/15/2024",
    "url": "https://time.com/6555701/apple-remove-blood-oxygen-tool-watches/",
    "text": "Apple Inc. will begin selling versions of its Series 9 and Ultra 2 watches without a blood oxygen feature in the U.S., following a legal setback in its patent dispute with Masimo Corp. The company said Wednesday that the tweaked models will go on sale Thursday at its retail outlets and online store. The new models will still include the blood oxygen monitoring tool, but it won’t function. Earlier in the day, the U.S. Court of Appeals for the Federal Circuit declined to grant Apple a longer pause on an import ban of the devices imposed by the U.S. International Trade Commission. The ruling means the company has to stop selling the watches with the oxygen measurement feature while an appeal of the ban plays out — a period that Apple believes could last a year or more. That led Apple to take the unusual step of removing a key feature from its devices. Last week, the U.S. Customs and Border Protection agency approved redesigned versions of the watches that didn’t have the capability. “Pending the appeal, Apple is taking steps to comply with the ruling while ensuring customers have access to Apple Watch with limited disruption,” the company said in a statement. “Apple’s appeal is ongoing, and we believe the U.S. Court of Appeals for the Federal Circuit should reverse the USITC’s decision. We strongly disagree with the USITC decision and resulting orders.” The company added that the feature remains available on models sold outside the U.S. Previously purchased watches also will retain the ability to check blood oxygen levels. Masimo shares jumped 2.1% to $122.57 following the decision, reaching their highest level since August. Chief Executive Officer Joe Kiani said in a statement that the development is a “victory for the integrity of the American patent system.” Kiani added that the decision “affirms that even the largest and most powerful companies must respect the intellectual rights of American inventors and must deal with the consequences when they are caught infringing others’ patents.” The court battle has threatened one of Apple’s biggest moneymakers in its home market, an unprecedented situation for the tech giant. The watches are a central piece of the company’s wearables, home and accessories division, a business that generated more than 10% of revenue last year, or nearly $40 billion. The ITC ruled in October that Apple’s latest watches violate patents related to blood oxygen measurement, an area known as pulse oximetry. That led Apple to pause sales of the smartwatches just ahead of Christmas, though an interim stay allowed the company to bring the products back late last month. According to the ITC, the harm Apple said it would face from the ban “is not unquantifiable, but rather speculative.” Apple maintains that the ruling from the ITC is erroneous and should be reversed. Masimo had urged the Federal Circuit to reject the request for an extended delay, arguing Apple had almost three years to anticipate a ban and “cannot complain about the consequences of its own failure to prepare for exclusion.” Apple pushed back on the ITC’s and Masimo’s arguments that its ability to continue selling the noninfringing Apple Watch SE means any reputational harm from the ban can’t be truly irreparable. It also criticized the product that the trade dispute was launched to protect, Masimo’s W1 watch, saying it didn’t exist when Masimo filed its complaint, wasn’t placed in the consumer channel and is sold only in negligible quantities “well over two years after this investigation began on the false premise that Masimo had an established domestic industry.” The appeals court said in a brief order Wednesday, “We reach no conclusion on the merits of the appeal.” The panel said the temporary stay will expire at 5 p.m. Eastern time on Thursday. Apple, based in Cupertino, California, added the blood oxygen sensor to its watches in 2020 with the Series 6. Masimo, a medical device company, sued Apple that year, alleging that the iPhone maker violated several of its health technology patents and stole its trade secrets. The case is Apple Inc. v. ITC, 24-1285, US Court of Appeals for the Federal Circuit. Contact us at letters@time.com "
}