{
    "title": "Tim Cook's salary dipped by ₹300 crore in 2023. How much did he earn?",
    "date": "1/13/2024",
    "url": "https://www.hindustantimes.com/business/apple-ceo-tim-cooks-salary-dropped-by-rs-300-crore-in-2023-how-much-did-he-earn-101705146553569.html",
    "text": "Subscribe Now! Get features like Apple chief executive officer Tim Cook earned $63.21 million dollars as compensation in 2023, less than what he got in 2022, the iPhone maker stated in its proxy filing with the US Securities Exchange Commission. In its proxy filing, Apple said that Cook earned $3 million (nearly ₹25 crore) as a salary in 2023. It was the same salary as in 2022 and 2021. The 63-year-old tech boss, who has been at the helm of affairs of the company since its founder Steve Jobs' demise, was awarded stocks worth $46,970,283 ( ₹389.25 crore) in the past year. ALSO READ: Aspire to work for Apple? Tim Cook lists ‘must-have’ traits for employeesCook was paid non-equity incentive plan compensation to the tune of $10,713,450 ( ₹88.78 crore) while the other compensation totalled $2,526,112 ( ₹20.93 crore). Hence, the Apple CEO's total salary in 2023 stood at $63,209,845 ( ₹523.83 crore). It was lesser than his 2022 salary of $99,420,097 ( ₹823.91 crore). ALSO READ: ‘Want someone from within company’: Apple CEO Tim Cook on future successorApple is gearing up for the launch of its mixed reality headset, the Apple Vision Pro, that goes on sale in the United States on February 2. The headset has been priced at $3,499 ( ₹2.89 lakh), Reuters reported.The Apple Vision Pro, according to the Cupertino-based technology giant, is designed for more immersive FaceTime chats, gaming, video and productivity apps. The Vision Pro, first unveiled in June, marks the first new hardware category for Apple since the company introduced its smartwatch in 2015. “It’s been a remarkable year. In 2023, we made history by introducing the world to Apple’s first spatial computer, Apple Vision Pro — a revolutionary product that seamlessly blends digital content with the physical world, opening a whole new dimension for our users,” Cook said in the regulatory filing. With the launch of Vision Pro, Apple enters into competition with Meta Platforms Inc. and other makers of augmented and virtual reality headsets. Multimedia journalist with over nine years of experience in print, television and digital media. Books, politics and cinema are an inseparable part of life. ...view detail   "
}