{
    "title": "‘Fortnite’ maker Epic Games to contest Apple’s ‘27% tax’ on outside \npayments and its ‘bad faith compliance’ with court ruling",
    "date": "1/17/2024",
    "url": "https://fortune.com/2024/01/17/epic-games-apple-app-store-payments-supreme-court/",
    "text": "Apple Inc. is opening its US App Store to allow outside payment options after the Supreme Court refused to consider the company’s appeal in an antitrust suit challenging its practices. The company plans to let all third-party apps sold in the US include an outside link to a developer website to process payments for in-app purchases. That will bypass Apple’s own payment system, which charges developers a commission of either 15% or 30%. Still, the iPhone maker said it would attempt to collect a 12% or 27% revenue share from developers that opt out of the Apple system. The Supreme Court decision let stand a 2023 appeals court ruling that found Apple’s business model didn’t violate antitrust laws, but that it did flout California’s Unfair Competition Law by limiting the developers ability to communicate about alternate payment systems that may cost less. Both Apple and Fortnite maker Epic Games Inc. had asked the court to hear an appeal related to the case. The justices turned down the appeals without explanation. Apple shares slid as much as 2.7% after the court’s announcement before paring their decline. The stock was down 1.2% to $183.63 at the close in New York. Developers will need to apply for an “entitlement” to be able to use outside payments systems. Apple previously allowed reader apps — a category that includes video streaming and book reading applications — to point users to the web to sign up for subscriptions. Apple will warn customers when they press a link to conduct purchases outside the App Store before letting them proceed. “As of today, developers can begin exercising their court-established right to tell US customers about better prices on the web,” Epic Chief Executive Officer Tim Sweeney said in a thread on the social media site X, formerly known as Twitter. But he took issue with Apple’s plan to charge what he called a “27% tax” on web transactions. If app developers have to pay that fee to Apple and a cut of 3% to 6% to third-party payment processors, they can’t afford to offer lower costs to consumers, he said. Sweeney also described Apple’s planned warning to customers as a “scare screen.” “Epic will contest Apple’s bad-faith compliance plan in District Court,” he said. Billions of dollars are at stake. In app spending is forecast to reach $182 billion this year and $207 billion in 2025, according to research firm Sensor Tower. And competitors are ready to steal a piece of it: Microsoft Corp. has said that it’s already in talks to launch a mobile app store focused on gaming. The 9th US Circuit Court of Appeals last year largely affirmed a lower-court judge’s 2021 decision largely rejecting claims by Epic that Apple’s online marketplace policies violated federal antitrust law because they ban third-party app marketplaces on its operating system. The appeals court also upheld a federal judge’s ruling that the iPhone maker’s practices don’t violate federal antitrust law, rejecting the bulk of Epic’s case against Apple’s App Store. That decision had been on hold while the Supreme Court appeals were pending. The high court’s decision ended a temporary stay in the case. The Epic case was the first to challenge Apple’s lucrative App Store system, which rakes in billions of dollars each year. In the interim, the company has come under serious pressure around the world, including in Europe where competition enforcers have two antitrust cases pending against the tech giant. EU authorities are expected to fine the company later this year for allegedly using its App Store rules to thwart music-streaming rivals like Spotify Technology SA. In a separate Epic suit in December, a jury found that Alphabet Inc.’s Google unfairly wields monopoly power in its Android app store. Google has said it plans to appeal, but key legislation in Europe — as well as investigations in the US and UK and an expected wave of follow-on lawsuits — will keep pressure on the tech giants’ app store duopoly. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}