{
    "title": null,
    "date": "1/20/2024",
    "url": "https://finance.yahoo.com/video/apple-vision-pros-long-term-130025952.html",
    "text": "Apple's (AAPL) latest piece of consumer tech, its Vision Pro mixed reality headset, is set to launch in the United States on February 2. At a starting price of $3,499, Bank of America Securities Senior IT Hardware Analyst Wamsi Mohan comments on future price points that may be more encouraging for Apple customers to purchase the augmented/virtual reality device. \"When you think about the size of the VR market, it's about 8.5 million units a year, it's about $4.5 billion,\" Mohan says. \"So Apple's already making a dent in its own category in year one.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. - At Apple's next big product, Wamsi, so the mixed reality headset, the Vision Pro. We've had some analysts, Wamsi, come on they say listen, near term, they don't think it's going to be financially material. But longer term, they're more optimistic. Where are you at? WAMSI MOHAN: Yeah, so it's funny to talk about financial immateriality when you can do $700, $800 million in revenue, right? Like 200,000 units at 3,500 to 4,000, that's the kind of number we're looking at. And yes, in the context of a $400 billion revenue company it's not a big number, but in isolation it really is. When you think about the size of the VR market, right, it's about eight million units a year, it's about $4 and 1/2 billion. So Apple's already making a dent in its own category, right, in year one. We think over time this is going to be a real game changer. The way we think about it is really, anyone who has a Mac is potentially someone who could own the Vision Pro at $1,500 to $2,000 price point. We think we get to that price point in a couple of years. It's not immediate. It takes a little time. It gives time for development of apps for a lot of the app ecosystem around Vision Pro to get a lot more better. But the place where we see the most opportunity is if we can build out an install base of several tens of millions of the Vision Pro. You can get very unique experiences of content, whether it be a concert very immersive experience of that, or sports, which other people have tried and failed, but we would give Apple the benefit of the doubt in doing something like that, and then being able to monetize. It you can pay $20, $30, $40. I was in Vegas for the CES show, and I looked up how much U2 tickets were going for the Sphere, $750 at the Sphere in Las Vegas. So $20, $30, $40 for an immersive experience, I think absolutely consumers would pay that. When you layer that on a tens of millions install base, it's a huge opportunity for Apple. Related Quotes "
}