{
    "title": null,
    "date": "1/6/2024",
    "url": "https://finance.yahoo.com/news/apple-supplier-foxconn-sees-revenue-093000124.html",
    "text": "Foxconn Technology Group, the world's biggest iPhone assembler, expects revenue to decline in the first quarter of 2024 amid weak global consumer electronics demand, extending a decrease in sales in the past three months. Taiwan-based Foxconn, formally known as Hon Hai Precision Industry, did not provide an estimate on the drop in quarterly revenue, but said the first three months will be compared to a high base in the same period last year, when its factories in mainland China resumed normal operations after disruptive pandemic controls were relaxed by the government, according to the company's statement on Friday. The world's largest electronics contract manufacturer also indicated that the year's first quarter is typically an off-peak season for the industry. Do you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. Revenue for the company's December quarter fell 5.4 per cent year on year to NT$1.85 trillion (US$60 billion), but was up by 20 per cent from the previous quarter. Total 2023 revenue was US$198.9 billion, down 7 per cent from 2022. People check out the iPhone 15 models on display at the Apple Store inside the IFC Mall in Central on September 22, 2023. Photo: Xiaomei Chen alt=People check out the iPhone 15 models on display at the Apple Store inside the IFC Mall in Central on September 22, 2023. Photo: Xiaomei Chen> Foxconn on Friday blamed slow market demand for its static consumer electronics product business in the fourth quarter, even though the company went through a bumpy period a year ago when its biggest iPhone plant in Zhengzhou, capital of central Henan province was rocked by an exodus of tens of thousands of employees and violent workers' protests amid a Covid-19 outbreak that began in late October. The company's dim first-quarter outlook reflects concerns raised by investors of major client Apple about sluggish iPhone sales, which prompted the US tech giant to be hit by two ratings downgrades this week. \"The iPhone 15 has been lacklustre and we believe iPhone 16 should be the same,\" Barclays analyst Tim Long said in a client note, which pointed to weakness in China and subdued demand in developed markets. Shares of the technology giant fell 0.4 per cent on Friday to close at about US$181 after The New York Times reported that the US Justice Department is closer to filing an antitrust case against the company. Apple, which has been the world's most valuable publicly-listed company since July 2022, has seen about US$177 billion in market value erased so far this year, according to data compiled by Bloomberg. The company's iPhones also face intense competition on the mainland against a resurgent Huawei Technologies, which is seeing strong demand for its new 5G handsets in the world's largest smartphone market. While Apple continues to lead the global premium smartphone market, where handsets are priced from US$600, Huawei has gained ground in this segment on the back of its new Mate 60 series. Foxconn is also offering higher rates for workers that make Huawei's handsets in southern tech hub Shenzhen than those that make iPhones, according to a South China Morning Post report last September. Still, Foxconn has stepped up efforts to diversify its manufacturing supply chain for Apple and other clients amid the weak post-pandemic economic recovery in mainland China and rising geopolitical tensions between Beijing and Washington. Foxconn won approval to invest at least US$1 billion more in a plant it is building in India that will make Apple products, on top of the US$1.6 billion it earlier pledged, according to a report by Bloomberg last month. On the mainland, Foxconn continues to invest in central Henan province, where it employs 200,000 workers in the firm's Zhengzhou manufacturing complex. The Taiwanese firm, which was put under investigation in October by mainland regulators, this year plans to start building new factories for smartphones and other electronics products in the cities of Zhoukou, Kaifeng and Jiyuan in Henan, according to a list of 520 major construction projects for 2024 released this week by the province's Development and Reform Commission. This article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2024 South China Morning Post Publishers Ltd. All rights reserved. Copyright (c) 2024. South China Morning Post Publishers Ltd. All rights reserved. Related Quotes "
}