{
    "title": null,
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/steve-jobs-sold-volkswagen-bus-160439606.html",
    "text": "In April 1976, Steve Jobs and Steve Wozniak launched the first Apple computer, marking the beginning of what would become a technology powerhouse. At age 21, Jobs sold his Volkswagen bus for $1,500, while Wozniak sold his Hewlett-Packard calculator for $500. Together, the sales provided the funds for their initial venture​​. With this capital, Jobs and Wozniak embarked on producing the Apple I, introduced on April Fools Day in 1976. Their innovative approach soon paid off. A local computer dealer placed a substantial order for 100 units for $50,000, a significant milestone for the fledgling company. To meet this demand, they purchased parts on credit, giving them a tight timeframe of one month to fulfill the order. Leveraging the support of family and friends, they completed the order, earning their first revenue and narrowly managing to pay off the parts suppliers with just a day to spare. Don't Miss: Copy and paste Mark Cuban’s startup investment strategy according to his colorful portfolio. Airbnb was worth $47 billion at IPO. This startup is automating the trillion-dollar hospitality market. Jobs and Wozniak's ingenuity continued to fuel Apple Inc.’s growth. They later met Armas Clifford \"Mike\" Markkula, a former manager at Fairchild Semiconductor International Inc. and Intel Corp., who played a crucial role in the company’s development. Markkula assisted in crafting a business plan and invested $92,000, in addition to helping arrange a $250,000 credit line. This financial support was instrumental in Apple’s first hit product. The Apple I, marketed for $666.66 each, earned the company around $774,000. Following the launch of the Apple II, Apple’s sales skyrocketed to $139 million, three years after its release. The pivotal moment for Apple came in 1980 when it became a publicly traded company. On its first day of trading, Apple’s market value reached $1.2 billion. By the end of the day, the market capitalization stood at $1.8 billion, a remarkable achievement considering the company started in Jobs' garage. Trending: Here is where your most successful angel investment may be hidden. However, the journey was not without its challenges. Apple faced significant design flaws in its subsequent products, leading to recalls and consumer disappointment. This period saw IBM surpass Apple in sales, compelling Apple to compete in an IBM/PC-dominated market. In 1983, Jobs recruited John Sculley from Pepsi-Cola to be CEO of Apple. The following year, they released the Macintosh, marketing it as part of a counterculture lifestyle. Despite its positive sales and superior performance to IBM's PCs, the Macintosh struggled with compatibility issues with IBM systems. Because of internal disagreements and strategic differences, Jobs was eventually phased out of the company he co-founded and left Apple in 1985. Jobs returned to Apple as CEO in 1997. He played a pivotal role in reviving the company, which was facing financial turmoil and was said to be on the verge of bankruptcy. Over the years, Apple transformed from a personal computer company to a leader in cutting-edge digital products. By the time of Jobs’ death in 2011, Apple had achieved a market value of $391 billion, a testament to his vision, innovation and entrepreneurial spirit. Read Next: Hedge funds intend to snatch all pre-IPO shares of future AI unicorns before you can. But there is one venture product investing on your behalf. Funders on this alternative asset platform are earning more than 14% annualized consignment profit funding Pro consignment opportunities. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article Steve Jobs Sold His Volkswagen Bus For $1,500 So He Could Create The First Apple Computer — Just 4 Years Later, The Company Was Valued At $1.8 Billion originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}