{
    "title": "Apple quarterly profit, revenue top Wall Street targets but China lags",
    "date": "2/1/2024",
    "url": "https://www.bworldonline.com/technology/2024/02/02/573204/apple-quarterly-profit-revenue-top-wall-street-targets-but-china-lags/",
    "text": " Apple on Thursday reported sales and profit that beat Wall Street estimates, powered by growth in its iPhone business. But China sales missed analysts’ targets. The 2% rise in overall fiscal first-quarter sales for the company ended four straight quarters of sales declines on the strength of its iPhone 15 lineup, which includes devices capable of capturing three-dimensional video for the Vision Pro headset being released this week. Apple’s total installed base of devices hit 2.2 billion, up from 2 billion a year ago. “We did feel good about the plus 6% (revenue growth) for iPhone,” Apple Chief Executive Tim Cook told Reuters in an interview. “We had particularly strong double-digit growth on iPhone in emerging markets outside of China. The iPhone is doing well in those markets.” He added: “China is the most competitive smartphone market in the world, and that hasn’t changed.” For its fiscal first quarter ended Dec. 30, Apple reported sales of $119.58 billion and profit of $2.18 per share, both above analyst expectations of $117.91 billion and $2.10 per share, according to data from LSEG. Sales of iPhones hit $69.70 billion, growing 6% to beat analyst expectations of $67.82 billion, according to LSEG data. Microsoft in January eclipsed Apple as the world’s most valuable company, with investors viewing Apple as lagging in the artificial-intelligence race between Wall Street’s tech heavyweights. Apple’s stock has dropped more than 3% in 2024, compared with the S&P 500’s .SPX 2% increase. Apple has said it is researching generative AI but has instead focused on its Vision Pro headset, which analysts do not expect to bring meaningful revenue for several years. In the shorter term, analysts are increasingly worrying about sales of Apple’s signature device in China, whose economy is navigating the burst of a real estate bubble. The iPhone also faces increasing competition in China and has fallen out of favor in government offices. Apple said sales in China were $20.82 billion, missing analyst estimates of $23.53 billion, according to LSEG data. Cook told Reuters that, when accounting for currency exchange rates, iPhone sales in mainland China were down “mid-single digits” in the quarter but said the company’s installed base of iPhones in China is at an all-time high. Counterpoint Research reported China iPhone unit shipments fell during the quarter, with Chinese consumers looking to novel folding phones and homegrown rival Huawei, which re-entered the market with a flagship phone powered by a Chinese-made chip. In the rest of Asia beyond China and Japan, Apple’s sales hit $10.16 billion, above analyst estimates of $9.75 billion, according to LSEG data. Cook said that iPhone sales hit an all-time high in South Korea, home to Apple’s longtime rival Samsung Electronics 005930.KS. Investors will be listening closely for the Cupertino, California-based company’s forecast for the fiscal second quarter on a conference call at 5 p.m. EST (2200 GMT). The biggest growth area for Apple during its fiscal first quarter was its services business, which includes the Apple TV+ service as well as music, iCloud storage and the App Store, and which rose 11% to $23.12 billion in sales. The results were slightly below analyst expectations of $23.35 billion, according to LSEG data. But Apple’s App Store faces a challenge in Europe, where a new law that takes effect in March will allow developers to skip paying commissions to Apple and place alternative app stores on the iPhone. Apple’s first-quarter Mac sales were up slightly to $7.78 billion, in line with analyst expectations of $7.73 billion, according to LSEG data. Sales of iPads were down 25% to $7.02 billion, missing expectations of $7.33 billion, according to LSEG data. Apple’s wearables segment, which includes its AirPods and Apple Watch sales, fell to $11.95 billion after company executives had warned of weak demand. The results were just above expectations of $11.56 billion, according to LSEG data. Several Apple Watch models have been at the center of a legal dispute with medical device maker Masimo and were briefly pulled from shelves before Apple removed a blood-oxygen monitoring features to comply with legal rulings and keep selling the devices. – Reuters "
}