{
    "title": "TSMC Reportedly Increasing 3nm Wafer Production To 100,000 Monthly Units As \nIt Is Receiving A Flood Of Orders From Clients, Including Apple",
    "date": "2/9/2024",
    "url": "https://wccftech.com/tsmc-increasing-3nm-wafer-production-to-100000-monthly-units-in-2024/",
    "text": "In 2023, TSMC only had one 3nm customer, which was Apple, but as it takes on more clients this year, it needs to address its production capabilities to cater to additional orders. According to one report, the Taiwanese giant intends to increase production to 100,000 monthly wafers in 2024 while also focusing on increasing yields by 3nm. In total, TSMC is said to receive a boatload of orders from Apple, Qualcomm, MediaTek, NVIDIA, Intel, and Qualcomm. Though the report on Naver does not specify which client has secured the most orders, it is likely Apple because the latter requires a large shipment of its A18 chips meant for the iPhone 16 family. TSMC will likely ramp up production of its second-generation 3nm wafers, also known as ‘N3E.’ Last year’s N3B process was reported to have yield issues and was said to be inappropriately priced. Additionally, just the tape-out costs for the M3, M3 Pro, and M3 Max were estimated to have cost Apple $1 billion, so the California-based giant must have shelled out a massive sum to be the first company in the world to launch chips on TSMC’s N3B node. The high price might also have discouraged companies such as Qualcomm and MediaTek from adopting the cutting-edge process for their own SoCs, but later this year, both will unveil their first 3nm products; the Snapdragon 8 Gen 4 and Dimensity 9400. TSMC is said to take monthly production from 60,000 to 100,000 monthly wafers, though it is also mentioned that yields will reach 80 percent, making it an impressive feat by the company if these figures are true. Previously, the wafer manufacturer stated in its last earnings report that 3nm chip orders that went into mass production during the second half of last year already accounted for 6 percent of total 2023 sales. This year, that figure is expected to climb up to 14-16 percent. It should be mentioned that TSMC has been reported to take its 3nm wafer production to 100,000 monthly units before, with this growth accelerated by the aforementioned companies. In short, it will be an exciting year as these firms will be on the same playing field, and the chip design prowess will decide which one takes the crown in the third and fourth quarters. News Source: Naver Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}