{
    "title": "Apple Vision Pro Is A Scratch Magnet, But It's The Repair Costs That Should \nWorry You - Apple (NASDAQ:AAP",
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/news/24/02/36955449/apple-vision-pro-is-a-scratch-magnet-but-its-the-repair-costs-that-should-worry-you",
    "text": "If you are impressed by all the things that the Apple Vision Pro is capable of and want to grab one, you need first to find out an important truth about it. What Happened: An all-important scratch test by JerryRigEverything has revealed that Apple Inc.'s AAPL Vision Pro gets scratched very easily. This is despite Apple saying that the Vision Pro comes with a \"laminated glass\" on top. Although the Vision Pro’s front glass is resistant to accidental damage, it was found to be highly susceptible to scratches. The YouTuber’s experiments revealed that the Vision Pro’s laminated glass has a plastic layer on top, making it extremely easy to scratch. Tests based on the Mohs scale of mineral hardness showed that the front glass of the Vision Pro gets slightly scratched at level two, with deeper scratches at level three. In comparison, most smartphone glasses scratch at levels six and seven. See Also: If You Invested $1000 In Apple When Steve Jobs Returned To Apple 28 Years Ago, Here’s How Much You’d Have Objects like keys, coins, and even dust can leave permanent scratches on the glass. Apple charges $799 to replace the front glass of the Vision Pro. With an AppleCare+ plan, the glass replacement will cost $299. Why It Matters: The Vision Pro, Apple’s first-generation mixed-reality headset, was previously found to be sturdier than expected in durability tests, even after being dropped from a height of six feet onto a wooden floor. However, the latest tests revealing its vulnerability to scratches could be a concern for users. This comes at a time when buyers have started getting their hands on Apple Vision Pro, showcasing its revolutionary capabilities. Despite the mixed reviews, Apple’s ambitious bet on the Vision Pro has attracted attention from industry leaders, including billionaire Elon Musk, who expressed his desire to try it out. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Apple’s Phil Schiller Warns Of Privacy Threats From New EU App Stores: ‘There’s No Getting Around That’ Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Apple © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}