{
    "title": "Apple's First Foldable Screen Likely To Debut On iPad Or MacBook, Not \niPhone: Report",
    "date": "2/23/2024",
    "url": "https://www.tradingview.com/news/benzinga:1ae8e0526094b:0-apple-s-first-foldable-screen-likely-to-debut-on-ipad-or-macbook-not-iphone-report/",
    "text": "Apple Inc. AAPL has reportedly been working on a foldable iPad or MacBook, with the device expected to feature a folding screen by 2025 or later. What Happened: A supply chain report by Digitimes has refuted the notion of Apple abandoning foldable devices. Instead, the company is said to be focusing on a foldable iPad or MacBook, with a folding screen expected to be ready by 2025 or later, reported AppleInsider. While the report does not confirm the abandonment of the iPhone fold prototypes, it does state that work on foldable devices has not been discontinued. The report also suggests that the folding device will not be an iPhone, but rather an iPad or a MacBook Pro. See Also: Apple Accuses Spotify Of Seeking ‘Limitless Access’ To Tools For Free As $500M Fine Looms This development aligns with a previous report, which indicated that Apple was considering a foldable MacBook, possibly launching in 2026. Digitimes cited insider information from the supply chain sources, indicating that various design elements are coming together for the new device. It is not clear at what stage the design is, but the report suggests that it is nearing completion, with plans for mass production already underway. While Digitimes is well-regarded for its connections within the supply chain, its track record in accurately predicting Apple’s intentions or timelines is notably lacking. In this particular case, it suggests that a folding device may not debut until at least 2025, the report noted. Why It Matters: There have been ongoing rumors about an iPhone Fold, especially since Samsung Electronics Ltd Co. introduced its foldable range. In fact, Samsung has introduced five iterations of foldable phones to date. Previously, some reports suggested that Apple may have two prototypes, others said that the tech giant could opt for a folding iPad instead, or may have scrapped the idea altogether. On the other hand, earlier this week, it was reported that the Cupertino, California-based tech giant is planning to launch a foldable iPhone in 2026. Despite the ongoing battle for market share in the foldable phone industry, with Samsung leading the charge, Apple’s potential decision to focus on a foldable iPad or MacBook could signal a new direction for the company in the foldable device market. A December 2023 report indicated that foldable phones represent merely 1% of the total smartphone market worldwide, indicating that this sector is still in its early stages. Therefore, Apple may still have ample opportunity to enter this market. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: US Supreme Court Just Saved Apple $503M After Putting An End To A 14-Year-Long Legal Battle Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @lewicz.michal @hiramedina @mytradingsetup @Cenobar @mytradingsetup @horibuful @fx_papi @setupstrading @olka_gadzieva GMS @globalsignals_ @TradingView @rajpalgore @mytradingsetup @neo_inversion @chartfeed @captainkolbaska @mytradingsetup @life_of_lorena.fx Whatever the trade "
}