{
    "title": "'Apple Has Said It'll Double Its Production In India Every Year', Says \nPiyush Goyal",
    "date": "2/7/2024",
    "url": "https://www.businesstoday.in/bt-tv/video/apple-has-said-itll-double-its-production-in-india-every-year-says-piyush-goyal-416596-2024-02-07",
    "text": "Feedback Consumer Affairs Minister Piyush Goyal offers a comparative analysis of the telecom sector during the 10-year periods of the NDA and UPA governments. Goyal outlines key aspects including the import of mobile phones and Chinese components, emphasizing the transition from complete import dependency to a thriving domestic manufacturing ecosystem. He credits the \"Make in India\" initiative, endorsed by the Prime Minister, for catalyzing this transformation. Notably, mobile telephone manufacturing emerges as a significant success story, with major companies like Apple rapidly expanding their production capacities within India. Goyal predicts that a quarter of the total production will soon be locally manufactured, attracting investments from American, Korean, and Japanese companies. This analysis underscores the evolving landscape of the telecom sector, with India emerging as a global hub for both manufacturing and component ecosystems.  Consumer Affairs Minister Piyush Goyal offers a comparative analysis of the telecom sector during the 10-year periods of the NDA and UPA governments. Goyal outlines key aspects including the import of mobile phones and Chinese components, emphasizing the transition from complete import dependency to a thriving domestic manufacturing ecosystem. He credits the \"Make in India\" initiative, endorsed by the Prime Minister, for catalyzing this transformation. Notably, mobile telephone manufacturing emerges as a significant success story, with major companies like Apple rapidly expanding their production capacities within India. Goyal predicts that a quarter of the total production will soon be locally manufactured, attracting investments from American, Korean, and Japanese companies. This analysis underscores the evolving landscape of the telecom sector, with India emerging as a global hub for both manufacturing and component ecosystems. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}