{
    "title": null,
    "date": "2/14/2024",
    "url": "https://bgr.com/tech/oled-macbook-pro-launch-possibly-delayed-to-2027/",
    "text": "Sign up for our daily newsletter If you buy through a BGR link, we may earn an affiliate commission, helping support our expert product labs. The next big revamp for the MacBook Pro is an OLED version, possibly launching in 2027. While early rumors expected this transition to happen a year after Apple introduced an OLED iPad Pro – scheduled to be announced in the coming months – it was later delayed to 2026, and it seems 2027 is the best timeframe for this change. The most important thing to understand about this transition to OLED in both iPad and Mac is the different display specs. The OLED iPad Pro will use the 6th generation technology, while the Mac will have the 8th generation, which is in the early days of development. One of Apple’s partners for this technology is Samsung Display. Last year, the South Korean company announced a $3.1B investment in this technology. Now, the timeline for the OLED MacBook Pro to launch is a bit clear thanks to a new report by the Korean version of The Elec. According to the publication, Samsung plans to bring its first IT 8th-generation OLED deposition machine in March. Its evaporator is manufactured by Canon Toki of Japan. Still, considering the time for the South Korean company to install and set process conditions, all machines are expected to be operational in the second half of 2025. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. While this might sound like good news, Samsung won’t make the 8th generation OLED panels exclusive to Apple, and it will also focus on producing panels for other vendors. For this reason, the first supply panels made with the 8th generation won’t be for the upcoming OLED MacBook Pro but for HP and Dell. That said, Samsung could only make OLED panels for Apple in 2027. Despite Samsung, LG and BOE also want to work with this technology, although BOE doesn’t have an evaporator machine just yet, and LG is still trying to secure investment resources. With that, if you’re holding up to upgrade to a new MacBook because you want the next design change, you might want to switch your strategy, if you don’t think your laptop can last that long. José is a Tech News Reporter at BGR. He has previously covered Apple and iPhone news for 9to5Mac, and was a producer and web editor for Latin America broadcaster TV Globo. He is based out of Brazil. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. -\n\t\t\t\t\t\tJonathan S. Geller, Founder BGR is a part of Penske Media Corporation.\n© 2024 BGR Media, LLC. All Rights Reserved. "
}