{
    "title": "How to connect two AirPods to one phone",
    "date": "2/11/2024",
    "url": "https://www.soundguys.com/how-to-connect-two-airpods-to-one-phone-110224/",
    "text": "All products featured are independently chosen by us. However, SoundGuys may receive a commission on orders placed through its retail links. See our ethics statement. Before wireless earbuds became mainstream, you could share audio with friends by sitting side-by-side and taking one bud each. Wireless earbuds made it even easier since you didn’t need to sit next to each other. But with improving technology, there are even better ways to share audio. If your friend has an AirPod pair of their own, you can both connect to and listen from the same Apple device. We’ll show you how to connect two AirPods to one phone. QUICK ANSWER Connect the first pair of AirPods to your device via Bluetooth, tap the AirPlay icon in the Control Center, select Share Audio, bring the second pair of AirPods close to your phone, and tap Share Audio again when they appear on the screen. JUMP TO KEY SECTIONS  Apple’s audio-sharing feature allows you to connect two AirPods to your iPhone or iPad, but it only works on devices running iOS 13 or later. These include: Even if your phone supports audio sharing, your earbuds need to be compatible. The feature is available on the following Apple headphones: Here’s how to connect two AirPods to one phone, whether it’s an iPhone or iPad: The audio quality remains the same on both sets of AirPods. However, you may notice a slight audio lag on the second pair of AirPods. The Spatial Audio’s head tracking feature also doesn’t function when using this feature. The process is a little more intricate if you want to pair two AirPods to your Mac. Navigate to Finder > Utilities > Audio MIDI Setup, click the plus button, and create a new multi-output device with both pairs of AirPods. After connecting two headphones to your device, you can control volume and playback. You can change the volume by: The first two options adjust the AirPods volumes separately, while the third controls both at the same time. Note that you can also pause, play, or stop playback on your iPhone’s lock screen or Control Center. You’ve learned how to connect two AirPods to one phone, but how do you disconnect them? Follow these steps: Apple’s Audio Sharing lets you share audio with two pairs of AirPods from one device. For a larger group, use a high-quality Bluetooth speaker. You can connect two pairs of AirPods to an iPad simultaneously using Apple’s Audio Sharing feature. It works just like the iPhone. Apple’s Audio Sharing feature only works when listening to audio from music applications, videos, and similar media. However, It doesn’t support phone calls.  "
}