{
    "title": "Hold Up! Why It's Too Early to Take a Bite of Apple Stock Right Now.",
    "date": "2/18/2024",
    "url": "https://investorplace.com/2024/02/hold-up-why-its-too-early-to-take-a-bite-of-apple-stock-right-now/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. It's too early to buy AAPL stock at this point Advertisement Source: Yalcin Sonat / Shutterstock.com I believe that Apple (NASDAQ:AAPL) and AAPL stock have two core problems. First, excitement about the company’s flagship product, the iPhone, has largely evaporated. And second, the company’s efforts to create “the next big thing” to supplement the iPhone have largely failed. The Vision Pro won’t change this pattern. On the other hand, I think there’s a chance that the firm’s upcoming iPhone can bring back the long, persistent lines of iPhone fans eager to buy the newest version of the device. However, until we learn more about the upcoming offering, I advise investors to avoid the name. For the first five years or so after the iPhone was launched, many if not most consumers viewed the newest versions of the devices as “must haves.” And a multitude of other fans would get new iPhones every two years. Currently, devices are seen as similar to cars. Many consumers hold on to their iPhones for several years, and some wait until their phones aren’t working anymore to buy new ones. Indeed, the tech website Zdnet reported last year that “61% of iPhone users keep their previous iPhones for two years or more.” This factor has played a key role in Apple’s lackluster revenue growth. Over the last five years, it was only during the pandemic, when the tech giant’s results were boosted by the work-from-home trend, that Apple really delivered strong revenue increase. For example, last year, the firm’s top line actually fell slightly, dropping to $383 billion from $394 billion, and the same phenomenon occurred in fiscal 2019, when its sales came in at $260 billion, compared with $265.5 billion in fiscal 2018. And last quarter, the firm’s top line only rose about 2% versus the same period a year earlier. Moreover, the numbers  would have been much worse if Chinese consumers had not become enthralled with the iPhone. In fact, the iPhone became the best-selling smartphone in China in 2023. But the device’s popularity in the Asian country appears to be waning, as deliveries of the device in China dropped 2% last quarter versus the same period a year earlier. Apple TV+ has largely been a failure, as Barron’s reported in 2023 that the offering “will lose billions of dollars…for years to come.” There has been much talk over the years about the conglomerate’s efforts to develop an Apple-influenced vehicle, but of course, such a product has never emerged. The firm’s watch and its Services have been mid-level successes, but haven’t really moved the top-line needle for the tech giant. And I’d bet against the firm’s new 3D headset, the Vision Pro, making a positive impact on the firm’s financial results. Both Alphabet  (NASDAQ:GOOG)and Meta (NASDAQ:META) have tried and failed to get consumers excited about high-tech headsets. The New York Post recently reported that the devices cause “extreme headaches” and “motion sickness.” The next update to Apple’s operating system, iOS, will reportedly boost its AI capabilities. There are rumors that the next iPhone, iPhone 16, will feature new hardware which will enable users to exploit these capabilities. According to one report, Siri’s intelligence will be boosted by the upgrades and will help “users… field complex questions and auto-complete sentences more effectively.” Developers will create apps for the device more quickly. The latter change could result in huge increases in the quantity and quality of apps available for the platform. Apple’s growth is anemic, while its forward price-earnings ratio of 28.2 is not exactly low. Therefore, I don’t expect the shares to outperform the market soon.And while the AI upgrades of the next version of the iPhone may be a positive game changer, I think it’s too early to tell if that will indeed be the case. On the date of publication, Larry Ramer did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. Consumer Discretionary, Retail, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/hold-up-why-its-too-early-to-take-a-bite-of-apple-stock-right-now/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}