{
    "title": "Is Apple Set to Outshine Microsoft in the 2024 Tech Showdown?",
    "date": "1/17/2024",
    "url": "https://investorplace.com/2024/01/is-apple-set-to-outshine-microsoft-in-the-2024-tech-showdown/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Here are three reasons Apple stock won’t be in the second spot for long Advertisement Source: Yalcin Sonat / Shutterstock.com Many investors know that Microsoft (NASDAQ:MSFT) passed Apple (NASDAQ:AAPL) on Jan. 12 as the world’s most valuable public company. Apple stock is trading just below $182, valuing the iPhone maker at around $2.83 billion. Microsoft is trading around $389, good for a $2.90 billion market capitalization, $70 billion higher. Will the next year see Apple fall further behind Satya Nadella’s baby because of Cupertino’s reluctance to embrace AI publicly? Or is this a temporary position switch that Apple will rectify with future product launches that meet the consumers’ insatiable need for all things Apple? That’s the million-dollar question. In the meantime, I believe Apple’s valuation remains choked by keeping its cards close to the vest regarding AI. Soon enough, investors will understand what Tim Cook’s battle plan is. When that day comes, you’ll be glad you bought AAPL stock beforehand. “It was inevitable that Microsoft would overtake Apple since Microsoft is growing faster and has more to benefit from the generative AI revolution,” Reuters reported D.A. Davidson analyst Gil Luria’s comments about the horse race. “Microsoft and Apple have been trading places for the title of the most valuable public company for several years now. Microsoft surpassed Apple’s market cap in 2021, 2020, and 2018 before Apple once again regained its place at the top,” Munich-based Nermin S. commented about the latest switch on LinkedIn. He’s not wrong. This dance has been ongoing. It’s unlikely to be settled for many more years unless one of the two companies stumbles badly or hits a home run. In baseball vocabulary, we’re in the early innings of an extra-inning game. While Apple hasn’t delivered a new-new product since the iPhone in 2007 (by that, I mean something entirely different from existing products available at the time) it routinely upgrades its existing lineup to keep Apple lovers from moving to another ecosystem. I suppose you could say that the Apple Vision Pro mixed-reality headset is a new-new product, but there isn’t much for consumers to compare it with, so we’re all somewhat in the dark about why we should spend nearly $3,500 for one of these bad boys. Five years ago, many would have said that $1,000 was too expensive for a phone, but I’m not sure how many feel that way today. Yes, they’ve turned us into walking zombies, unable to carry on conversations without looking at our phones every few seconds, but for many, they are indispensable. So, it’s very possible that five years from now, many of us will wonder if we could live without our Vision Pro. If that is the case, a $3,500 price tag won’t be an issue for Apple. And that’s where I think Warren Buffett got it right. He bought Apple stock because he realized people wouldn’t give up their phones, even if offered $10,000. “If you’re an Apple user and somebody offers you $10,000, but the only proviso is they’ll take away your iPhone and you’ll never be able to buy another, you’re not going to take it. If they tell you if you buy another Ford car, they’ll give you $10,000 not to do that, you’ll take the $10,000 and you’ll buy a Chevy instead,” Buffett told CNBC in April 2023. Maybe I’m wrong, but as much as I respect Satya Nadella’s job as Microsoft CEO, I just don’t see it having a product that its customers can’t live without. AI aside, Microsoft’s bevy of products can’t hold a candle to Apple’s when it comes to consumer excitement. Microsoft stock trades at 13.29x sales, about 30% higher than its 5-year average. Meanwhile, Apple stock trades at 7.67x sales, 22% higher than its five-year average. Apple’s earnings yield is 3.30%, compared to 2.66% for Microsoft. From where I sit, Microsoft’s out-performance over the past year has everything to do with AI and very little to do with consumer excitement about CoPilot or ChatGPT. Don’t get me wrong, these are significant advances in software technology, but the market is pricing in that AI will bring all sorts of revenue to Microsoft. Still, ignoring the possibility that Apple’s refrain from discussing AI publicly to a large extent isn’t because they don’t have any plans for it; it’s because they don’t want to take away from the Vision Pro launch in February. As far as I can tell, AI is naturally suited for use with the Vision Pro mixed reality headset, but I’m far from a tech expert. One way, for example, that businesses could use it is to put out augmented reality content through their investor relations people that gives a user an immersive experience of a plant or facility. It’s like a plant tour but in the privacy of your own home. AI could determine what shareholders and potential investors want to see and experience. So, I’ve said in the past that if you can afford to buy both Apple and Microsoft, you absolutely should. That hasn’t changed. Could Apple stock play second fiddle to Microsoft for the rest of 2024? Absolutely. That said, Tim Cook is a bright fellow. I’m sure his AI plan is more substantive than investors are giving the company credit for. Either way, I don’t see Warren Buffett selling anytime soon. Second fiddle or not. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. Consumer Discretionary, Retail, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/is-apple-set-to-outshine-microsoft-in-the-2024-tech-showdown/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}