{
    "title": "Apple executives unveil Vision Pro's future in surgery, aircraft repair, \nand education | Mint",
    "date": "1/22/2024",
    "url": "https://www.livemint.com/technology/gadgets/apple-executives-unveil-vision-pros-future-in-surgery-aircraft-repair-and-education-11705902623199.html",
    "text": "In an exclusive video sent to Apple employees this week, company executives Mike Rockwell and Alan Dye shed light on the development and future applications of the highly anticipated Vision Pro mixed-reality headset, set to launch on February 2. The executives discussed potential applications beyond the consumer-focused features that have been promoted thus far, hinting at groundbreaking uses in medical procedures, aircraft repair, and education. As per the transcript of the video conversation by Bloomberg, Rockwell, the vice president overseeing the device, highlighted the potential for the Vision Pro in surgical settings. He explained that surgeons often face challenges in accessing scattered information during procedures. The mixed-reality headset could consolidate this data, providing a comprehensive and streamlined interface to potentially enhance patient outcomes. Reportedly, the company is already envisioning applications beyond the consumer market, with Rockwell expressing excitement about the headset's potential in learning and education. Technicians and aircraft mechanics, for instance, could leverage the device for high-quality training experiences previously unattainable. To encourage employee adoption, Apple announced a 25% discount on the Vision Pro for its staff, along with additional perks. While this discount is less generous than those offered for previous product launches like the smartwatch and HomePod smart speaker, it still significantly reduces the headset's cost for employees. In a memo to employees, Apple outlined additional benefits, including a $500 credit for a Mac every three years, which can be applied toward the purchase of the Vision Pro. The company also pledged to reimburse the cost of prescription lenses for the headset, making it more accessible for employees with vision correction needs. To explore diverse applications, two of Rockwell's key team members, Dave Scott and Yaniv Gur, are actively investigating enterprise and education opportunities for the Vision Pro. Scott, formerly part of Apple's car team, is focusing on potential uses in enterprises, while Gur, who previously led engineering for Apple's productivity apps, is exploring educational applications for the innovative mixed-reality headset.   Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}