{
    "title": "Apple's durability test! iPhone survives 16,000-foot fall from Alaskan \nAirlines flight: Here's what happened | Mint",
    "date": "1/8/2024",
    "url": "https://www.livemint.com/technology/tech-news/apples-durability-test-iphone-survives-16-000-foot-fall-from-alaskan-airlines-flight-heres-what-happened-11704706566896.html",
    "text": "In a remarkable testament to the durability of Apple's iPhones, an incident in Portland has surfaced, showcasing the survival of one such device after a staggering 16,000 feet fall from an Alaska Airlines flight. The incident has occurred during Alaska Airlines ASA 1282's journey from Portland, Oregon, to Ontario, California, when the airplane's window shattered, causing phones and other small items to be sucked out mid-air, reported India.com. The National Transportation Safety Board (NTSB) confirmed the incident and revealed that they discovered an iPhone in working condition after the significant fall. However, the specific model of the iPhone remains unconfirmed, with speculations suggesting it could be either the iPhone 14 Pro or iPhone 15 Pro. The smartphone was found equipped with a hard case for added protection. Sharing the discovery on social media platform X (formerly Twitter), Seanathan Bates posted photos of the miraculously intact iPhone. Bates expressed his surprise, stating, \"Found an iPhone on the side of the road… Still in airplane mode with half a battery and open to a baggage claim for #AlaskaAirlines ASA1282. Survived a 16,000 foot drop perfectly intact! When I called it in, Zoe at @NTSB said it was the SECOND phone to be found. No door yet.\" The iPhone, which was found on the Barnes Road, has actually displayed resilience as it remained in perfect condition despite the extreme fall. The device was not only functional but still had half its battery life, with in-flight mode activated and SOS mode engaged. In response to the alarming midair incident, Alaska Airlines temporarily suspended the operation of its 65 Boeing 737-9 aircraft. The incident involved the blowing out of a window and part of the fuselage, leading to an emergency landing in Oregon. Fortunately, the flight landed safely with 174 passengers and six crew members on board.   Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}