{
    "title": null,
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/video/apple-vision-pro-pre-orders-171259060.html",
    "text": "Apple (AAPL) will begin taking pre-orders for its latest wearable technology: the Vision Pro mixed reality headset. The price tag for the device comes in at $3,499, or $291.58 per month over 12 months. With such a high price tag and several augmented/virtual reality competitors already on the market, is the device even worth it for consumers? The Verge Senior Wearables Reviewer Victoria Song joins Yahoo Finance to discuss Apple's AR-VR device and what it could mean for the company going forward. When asked if the device will be worth it for Apple, Song points out: \"This is a new category. Any time... people like myself have looked at a new Apple category when it launches, there's a tendency to go, 'Oh, who's going to use that?'\" Uncertain about the Vision Pro's starting price, Song believes \"it's going to take a while\" for Apple to reach a reasonable sales price and use case for average consumers. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino SEANA SMITH: Victoria, in terms of priority that this is going to be for Apple down the line, and the fact that this could potentially-- Bank of America making the argument that it could potentially boost sales of iPhone over the next couple of years, given the fact that people are going to be upgrading their phones to better be able to use some of this latest AR and VR, AI type of capability here. When it comes to that demand and how big of a driver this could be for Apple's revenue down the line, what are you hearing? Or what are you expecting? VICTORIA SONG: Yeah. That's really hard to say just because this is a new category. Anytime people like myself have looked at a new Apple category when it launches, there's a tendency to go like, oh, who's going to use that? There were people who were skeptic of the iPhone. There were people who were skeptics of the Apple Watch and for the iPad. And largely, they were proven wrong. But sometimes, it takes a while to get there. This is a very emerging category. It's extremely nascent. The price tag is pretty big. And from what I saw of the spatial videos, and the spatial photos, I don't think we necessarily, as a culture, know what we want from those things. So it's going to be a matter of early adopters glomming on first and seeing what they have to say. But as for the average person, I think it's going to take a while. I think it's going to take Apple a while to figure out how they want the average person to view this device and how they want to use it. App developers are going to have to get on board en masse. And while there's going to be a lot of apps available at launch, there's a question as to how much are going to be natively available for Vision OS. So this is a wait and see type of thing. And it's a lot of, how much do you want to bet against Apple given their track record? And then how much do you believe in VR? So it's a wishy-washy answer. But I wouldn't bet against Apple. But this is the most far out of left field that they've gone in a long time. Related Quotes "
}