{
    "title": "Apple to shut down 121-person AI team, employees who can’t relocate or find \nother jobs to be let go",
    "date": "1/15/2024",
    "url": "https://www.firstpost.com/tech/apple-to-shutdown-121-person-ai-team-employees-who-cant-relocate-or-find-other-jobs-to-be-let-go-13615902.html",
    "text": "Apple is consolidating its AI team in one single campus, at Austin Texas. As a result the current 121-person team at San Diego, California has been asked to either relocate, find a new role in the company, or prepare to get laidoff In a significant development Apple is set to close its 121-person strong Data Operations Annotations team, dedicated to Apple’s artificial intelligence operations in San Diego. Sources familiar with the matter reveal that employees face potential termination if they choose not to relocate to Austin, Texas, where the team will merge with its Texan counterpart, said a Bloomberg report Apple notified the affected team, responsible for enhancing Siri functionality by assessing the accuracy of voice service queries, on Wednesday. Individuals familiar with the situation, requesting anonymity, disclosed that the employees have until the end of February to decide on relocation. Failure to relocate will result in termination on April 26. The unexpected move has left San Diego staff surprised, as they were initially informed of a relocation within the city, specifically to a new Apple campus at the end of January. Instead, they are now required to move to Austin, a prospect that a majority of affected workers are reportedly unwilling to consider. An Apple spokesperson confirmed the decision to relocate, stating, “We are bringing our Data Operations Annotations teams in the US together at our campus in Austin, where a majority of the team is already based.” She reassured that all current employees would have the opportunity to continue their roles with Apple in Austin. However, some employees express concerns about eligibility for other roles within the company due to the lack of engineering backgrounds. The San Diego team focuses on Siri use in various languages, including Hebrew, English, multiple dialects of Spanish, Portuguese, Arabic, and French. Apple emphasized its commitment to San Diego, where it has witnessed significant growth, and asserted ongoing hiring efforts as part of its engineering team expansion. The company offered affected employees the option to apply for other positions but acknowledged the potential reluctance to relocate. For those willing to move to Austin by the end of June, Apple is providing a $7,000 relocation stipend. Departing employees will face elimination, accompanied by four weeks of severance pay, with an additional week for each year worked, and six months of health insurance. The AI team’s history at Apple dates back to its contractor-dominated early days, where privacy concerns led to changes in Siri query monitoring practices in 2019. The team, now comprised of full-time employees, is actively involved in assisting Apple’s shift towards AI products based on large language models (LLMs). Apple plans to unveil its LLM strategy in June 2024, according to previous reports by Bloomberg News. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}