{
    "title": "I learned I held my iPhone wrong with Apple's screen distance",
    "date": "1/7/2024",
    "url": "https://www.businessinsider.com/how-to-turn-on-off-screen-distance-iphone-ios-17-2023-9",
    "text": "       I've lived with terrible vision — specifically nearsightedness, or myopia — for as long as I can remember. And it's not news that we have a myopia crisis. Cases of myopia have nearly doubled in the US since 1971, and nearly 90% of teens and adults in Asia are nearsighted. So when Apple announced a new \"screen distance\" feature for iPhones last fall, I was immediately intrigued. It's supposed to help combat eye strain and promote healthier viewing habits, alerting you when you're holding your device too close to your face. I decided to try it, and while I don't have a fancy new iPhone 15, I learned it's not a requirement — all you need is the latest iPhone software, iOS 17, and an iPhone with a TrueDepth camera, the same camera used for Face ID. Related stories To turn the feature on, simply: Many scientists attribute the rise in rates of nearsightedness in part to increased use of screens and less time spent outside in daylight. Excess screen time and prolonged close-up activities, like reading or looking at a screen up close, are associated with an increased risk of developing nearsightedness, according to the Mayo Clinic. The American Academy of Ophthalmology suggests keeping computers about 25 inches, or about an arm's length away. After first turning on the feature, I purposely held my phone too close to my face while scrolling through my Instagram feed to see if the notification would pop up. After about 3-4 minutes, a new screen interrupted my scroll, reading \"iPhone may be too close.\" After moving my phone further away from my face to an arm's length away, a checkmark appeared, the text changed to read \"your iPhone is now at a recommended screen distance,\" and a blue \"continue\" button popped up, letting me get back to my feed. I went back to using my phone as normal, forgetting that I had the feature turned on. Then the screen popped up again. And again. And again. It turns out I've been consistently holding my phone too close to my face. After using the feature for a couple of weeks, I noticed that I now get the notification less and less throughout the day. I feel like I've become more conscious about holding my phone at arm's length. The screen-distance notifications — or just the nagging feeling I get now when I catch myself getting sucked into my device too closely — have also just made me more aware of my own habits and screen use. I spend at least eight hours a day working on a laptop. During my mornings, evenings, late nights, and breaks, I'm often tempted to just pick up my phone and start scrolling — sometimes while also watching TV. It's helpful having a reminder sometimes to just take a break from looking at all my screens. After talking to my eye doctor of more than a decade, it seems like this might be the most important part of the outcome. While the iOS 17 feature might reduce eye strain and may be a helpful reminder to maintain healthier habits, simply holding our phones further away is unlikely to solve the myopia problem. \"I think this is better than nothing, but I do feel that it might be simplifying a much broader problem,\" said Dr. Nicholas Despotidis, a fellow in the American Academy of Optometry and American Academy of Orthokeratology and Myopia Control. One of his focuses is on the rise in cases of myopia among children. Despotidis emphasized that it's more important to make sure you — and if you're a parent, your children — limit screen time and spend enough time outside, in natural light, which has been shown to decrease the risk of developing myopia significantly. \"The bottom line is that if you're staring at your screen for hours, it'll give you eye strain whether you're holding it two inches or 18 inches away from your face,\" Despotidis said. \"I worry it might give parents or consumers a false sense of security.\" Read next Jump to "
}