{
    "title": "Epic Games CEO calls out Apple’s DMA rules as ‘malicious compliance’ and \nfull of ‘junk fees’",
    "date": "1/25/2024",
    "url": "https://techcrunch.com/2024/01/25/epic-games-ceo-calls-out-apples-dma-rules-as-malicious-compliance-and-full-of-junk-fees/",
    "text": "Epic Games CEO Tim Sweeney is none too pleased with Apple’s new App Store rules, dubbing them once again a case of “malicious compliance” and filled with “junk fees.” As reported earlier this week, Apple today announced it will charge additional fees on apps in the EU, including apps and games downloaded from outside its own App Store, like those Epic plans to offer. Apple’s new rules, which go into effect in the EU as part of the tech giant’s compliance with the bloc’s Digital Markets Act (DMA), target larger developers, like Epic, who have to pay €0.50 for each install per year over a 1 million threshold as part of a new “core technology fee.” This fee could help Apple to make up for the losses that came from no longer hosting the apps directly on its App Store, where today it enjoys a 15% to 30% commission, depending on the developer size and type. In the EU, Apple said it will lower its App Store commissions to either 17% for digital goods and services or as low as 10% for subscriptions in their second year and small business developers who qualify. If the apps choose to use Apple’s payment processing technology, they’ll be charged an additional 3% fee, as well. Or, developers can opt to stay on Apple’s existing terms — the standard 30% commission, or 15% for small businesses and subscription in their second year, if they choose. The company is providing a fee calculator tool that will help them to decide. In response to the new rules, Epic Games CEO Tim Sweeney calls out Apple’s terms as “anti-competitive.” In a post on X, Sweeney writes, that Apple is “forcing developers to choose between App Store exclusivity and the store terms, which will be illegal under DMA, or accept a new also-illegal anticompetitive scheme rife with new Junk Fees on downloads and new Apple taxes on payments they don’t process.” Apple's plan to thwart Europe's new Digital Markets Act law is a devious new instance of Malicious Compliance. They are forcing developers to choose between App Store exclusivity and the store terms, which will be illegal under DMA, or accept a new also-illegal anticompetitive… — Tim Sweeney (@TimSweeneyEpic) January 25, 2024  The “junk fees” are a reference to the new “core technology fee” that covers apps that are downloaded to users’ devices outside the App Store and Apple’s own payment processing systems. It seems that Apple’s stance is that it’s entitled to a commission, no matter how apps are discovered and downloaded, because the App Store is not the platform that makes these app-sized businesses possible — rather all of iOS is. Arguably, iOS offers a sizable platform for developers, thanks to Apple’s ability to continually ship new iPhones in response to consumer demand. However, claiming that Apple is entitled to anything installed on its proprietary hardware/software combination is pushing up against the regulation’s purpose. The DMA was meant to encourage more competition by lessening the App Store’s grip on the app ecosystem. Apple responded by widening its grip to include the entirety of the iPhone and iOS more broadly. This surely puts a dent in Sweeney’s plans to run a profitable games store in the market, as Epic Games would still have to pay Apple for sideloaded app installs over the first million. At €0.50 per install, the number could add up for larger apps with millions of users. (Nevertheless, Epic said Fortnite will return to iOS in Europe this year, details to come.) Fortnite will return to iOS in Europe in 2024, distributed by the upcoming @EpicGames Store for iOS. Stay tuned for details as we figure out the regulatory timeline. We'll continue to argue to the courts and regulators that Apple is breaking the law. https://t.co/MHh6EGVinC — Epic Games Newsroom (@EpicNewsroom) January 25, 2024  Sweeney also rails against the idea that Apple can choose which stores are allowed to compete with its App Store, a seeming reference to Apple’s new “Notarization” requirements, which Apple claims are necessary to protect its users from malware and other security checks. Though Sweeney says Epic has supported the idea of Notarization, the company rejects Apple’s use of this process “to undermine competition and continue imposing Apple taxes on transactions they’re not involved in.” Notarization requirements put Apple in control of apps that end up on users’ iPhones and iPads by way of third-party marketplaces. Apple says it plans to encrypt and sign all iOS apps intended for alternative distribution so users can trust they’re getting apps from known parties. Another surprising requirement related to alternative app stores is Apple’s rule that providers must show the company a stand-by letter of credit of €1,000,000 from an “A-rated” financial institution before developers can receive the entitlement (an exception to its normal rules), to open up their third-party app marketplace. This won’t likely stand in Epic’s way but could prevent smaller developers from innovating in this space. Sweeney’s comments come fresh off the rulings of two lawsuits where the Fortnite game maker sued both Apple and Google over antitrust concerns. Apple won its case, as the court declared it was not a monopolist, but said that Apple had to allow app developers to link to their own websites, if they chose. Oddly, Epic won the Google case, even though Google today already permits sideloading, likely because the latter was a jury trial, which meant regular people, not judges, got to make the decisions. Apple responded to that ruling much as it did with the DMA, by “legally” complying with the guidelines while also imposing its own system of rules, fees, and caveats, as it deemed necessary. Sweeney said he planned to contest Apple’s “bad-faith” compliance with the U.S. District Court’s ruling. As for the DMA, the statement reads as follows: Apple’s plan to thwart Europe’s new Digital Markets Act law is a devious new instance of Malicious Compliance. They are forcing developers to choose between App Store exclusivity and the store terms, which will be illegal under DMA, or accept a new also-illegal anticompetitive scheme rife with new Junk Fees on downloads and new Apple taxes on payments they don’t process. Apple proposes that it can choose which stores are allowed to compete with their App Store. They could block Epic from launching the Epic Games Store and distributing Fortnite through it, for example, or block Microsoft, Valve, Good Old Games, or new entrants. The Epic Games Store is the #7 software store in the world (behind the 3 console stores, 2 mobile stores, and Steam on PC). We’re determined to launch on iOS and Android and enter the competition to become the #1 multi-platform software store, on the foundation of payment competition, 0%-12% fees, and exclusive games like Fortnite. Epic has always supported the notion of Apple notarization and malware scanning for apps, but we strongly reject Apple’s twisting this process to undermine competition and continue imposing Apple taxes on transactions they’re not involved in. There’s a lot more hot garbage in Apple’s announcement. It will take more time to parse both the written and unwritten parts of this new horror show, so stay tuned. Apple’s answer to EU’s gatekeeper rules is new ‘core tech’ fee for apps  "
}