{
    "title": "Apple CEO Tim Cook’s earnings fell by $36M in 2023",
    "date": "1/11/2024",
    "url": "https://www.digitaltrends.com/news/apple-ceo-tim-cook-earned-36m-less-in-2023/",
    "text": "Apple compensated its CEO to the tune of $63.2 million in 2023, down from $99.4 million a year earlier. The data was revealed in an Apple proxy statement released on Thursday. Cook’s total earnings for 2023 comprised a base salary of $3 million, stock awards worth $47 million, performance-based bonus awards totaling $10.7 million, and additional compensation worth $2.5 million covering things such as 401(k) contributions, term life insurance premiums, vacation cash-out, security costs, and personal air travel expenses. The drop of $33 million in his 2022 compensation was mainly due to the diminished value of Cook’s stock awards, valued at $47 million last year compared to $83 in the previous year. Other senior executives at Apple — among them Luca Maestri, Kate Adams, Deirdre O’Brien, and Jeff Williams — were each compensated around $27 million, with most of that coming via stock awards. Considering Apple’s huge success in persuading people to buy its iPhones, Macs, iPads, and other devices, and also to sign up for subscription services like Apple Music and Apple TV+, it’s little surprise that members of its top team are earning tens of millions of dollars annually. In its most recently reported quarter ending September 30, Apple posted revenue of $89.5 billion and a net quarterly profit of $23 billion. “Today Apple is pleased to report a September quarter revenue record for iPhone and an all-time revenue record in Services,” Cook said at the time. For the full fiscal year covering most of 2023, the tech giant saw $383.3 billion worth of sales and $97 billion in net income, slightly down on the $394.3 billion in sales and $99.8 billion in net income it achieved during the preceding year. Apple's M2 chip found in the 13-inch MacBook Pro might struggle under pressure, found Vadim Yuryev of Max Tech on YouTube. The YouTuber tested the new MacBook Pro in order to see how it deals with extremely resource-heavy tasks. This resulted in severe throttling upon hitting high temperatures, highlighting that Apple's design choices for the laptop might not be ideal in terms of cooling. But is this really a big deal for the intended userbase of the new MacBook Pro? Apple's new M2 chip appeared in a leaked Geekbench 5 test today. Found inside the upcoming 13-inch MacBook Pro, the latest iteration of Apple silicon certainly did a good job -- so much so that when compared to the Intel-based $6,000 Mac Pro, the M2 chip is actually the winner. Based on the leaked benchmark, the M2 has proven itself to be up to 20% faster than the M1, thus surpassing Apple's own expectations for the chip. Aside from beating the high-end Mac Pro, the M2 also wins against the M1 MacBook Pro. WWDC 2022 starts next week, and for months, rumors have been circulating about Apple announcing its M2 chip for new MacBooks. There's a solid chance Apple will release new MacBooks with updated silicon at WWDC, but it won't be the full generational jump fans have hoped for. The issue comes down to what wafer Apple will base the M2 on. The M1 is built on chipmaker TSMC's 5nm manufacturing process, and rumors have pointed to Apple using the 4nm manufacturing process for the M2. According to Apple analyst Ming-Chi Kuo and leaker ShrimpApplePro, that won't be possible if Apple plans on releasing new MacBooks in the second half of the year. Upgrade your lifestyleDigital Trends helps readers keep tabs on the fast-paced world of tech with all the latest news, fun product reviews, insightful editorials, and one-of-a-kind sneak peeks. "
}