{
    "title": null,
    "date": "2/13/2024",
    "url": "https://tech.hindustantimes.com/tech/news/apple-leads-india-tablet-pc-market-with-25-pc-share-in-2023-71707760591834.html",
    "text": "Copyright © HT Media Limited  All rights reserved. Apple leads India tablet PC market with 25 pc share in 2023 as well as in the December quarter with a 25 per cent share notwithstanding a decline in its shipments, according to a report. Samsung was at the second spot with a 23 per cent market share in 2023, market research firm CyberMedia Research said on Monday. \"In CY (in calendar year) 2023, Apple led the tablet market with a 25 per cent market share, followed by Samsung at 23 per cent in CY 2023,\" CyberMedia Research (CMR) India Quarterly Tablet PC Market Review report said. Apple tablet PC shipments declined by 17 per cent on a year-over-year (YoY) basis. Lenovo occupied the second slot in the December quarter with a 24 per cent market share even as its shipments declined by 3 per cent. Samsung tablet PC shipments grew by 36 per cent on YoY basis, the report stated. \"There is a rising consumer demand for diverse tablet options in India, including premium, 5G and value-for-money tablet offerings. This growth is particularly noticeable in the B2B sector and online purchases,\" CMR, Analyst – Industry Intelligence Group (IIG), Menka Kumari said. We are on WhatsApp Channels. Click to join. The market witnessed a robust 21 per cent quarter-on-quarter (QoQ) growth in Q4 2023, driven by strong demand for 5G tablets. \"5G tablet shipments soared by 43 per cent YoY, accounting for a significant share of the market. Wi-Fi tablets also performed well, recording a 13 per cent YoY increase and claiming 52 per cent of overall shipments,\" the report said. The premium tablet segment, priced between  ₹20,000-30,000 apiece experienced a 95 per cent QoQ jump, indicating a clear shift towards high-end devices, the report said. CMR estimates that the tablet market is poised for a steady 5-10 per cent growth in 2024 driven by factors like technological advancements, diverse product offerings, and evolving consumer preferences. Facebook a mess? Facebook can't copy or acquire its way to another two decades of prosperity. Is the CEO Mark Zuckerberg up to it? Facebook is like an abandoned amusement park of badly executed ideas, says analyst. Interesting? Check it out here. Elon Musk's Purchase of Twitter Is Still in Court! A court wants Elon Musk to testify before the US SEC regarding potential violations of laws in connection with his purchase of Twitter. Know where things stand here. Does Tesla lacks AI Play? Analysts highlight this aspect and for Tesla, that is trouble. Some interesting details in this article. Check it out. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71707760591834 "
}