{
    "title": "Apple Finally Follows Samsung's Lead by Folding iPhone in Two",
    "date": "2/9/2024",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=211139",
    "text": "Apple is accelerating the development of a “foldable iPhone,” entering the foldable phone market pioneered by Samsung Electronics with its Galaxy Fold five years ago. The Information, a specialist IT media outlet, reported on Feb. 7 (local time) that Apple is developing prototypes of a clamshell-shaped iPhone, which opens and closes top-down. According to the report, Apple is working on at least two prototype models that fold horizontally and has recently inquired about parts from a manufacturer in Asia. Samsung Electronics leads the foldable phone market, having launched its first product in 2019. As of November last year, Samsung’s market share in the global foldable phone market was 68%, according to market research firm Statista. The market for foldable phones continues to grow, with Chinese companies like Huawei, OPPO, Vivo, and Xiaomi also entering the fray. Last year, Huawei launched its Mate X3 foldable phone at a price higher than Samsung’s Galaxy Z Fold4, in the 3 million won range. Vivo and OPPO also released products in both fold and flip models, following Galaxy’s lead. The foldable phone market in China expanded by 106% in the third quarter of last year compared to the same period the previous year. Google has also entered the foldable phone market with its Pixel Fold, leaving Apple as one of the few major smartphone companies not yet in the market. Counterpoint Research predicts that by 2026, when Apple is expected to enter the market, the annual global shipment of foldable phones will reach 78.6 million units, more than four times the figure from last year’s 18.6 million units. The shipment is expected to surpass 100 million units by 2027. However, it remains uncertain whether Apple will be able to launch a foldable iPhone. The Information reported that Apple has encountered challenges in the development process. The company needs to develop a product as thin as the currently selling iPhones, but the display’s susceptibility to breaking is a challenge that needs to be addressed. The battery size is also a concern, as foldable smartphones have less space for a battery due to their horizontal folding design. Signs of Apple’s shift were detected early on. Choi Won-joon, executive vice president of Samsung Electronics MX Business Unit’s Development Division, welcomed Apple’s potential entry into the foldable phone market at a press conference held in Barcelona, Spain, in February last year during MWC2023. He stated, “It would be very welcome if Apple entered the foldable phone market,” adding, “It means that Apple, following China, recognizes the value of the market we pioneered.” Never miss another article! Enter your email address below to receive our free daily newsletter: "
}