{
    "title": "5% Cash Yields Pulling Investors From Slow-Growth Names Like Apple \n(NASDAQ:AAPL)",
    "date": "2/21/2024",
    "url": "https://seekingalpha.com/article/4672012-5-percent-cash-yields-pulling-investors-from-slow-growth-names-like-apple",
    "text": "tumsasedgars/iStock via Getty Images  tumsasedgars/iStock via Getty Images I don't know if Apple (NASDAQ:AAPL) investors fully appreciate the sell decision just made by Berkshire Hathaway (BRK.A) (BRK.B) asset managers, including the esteemed CEO Warren Buffett. I believe liquidating 10 million shares in Q4 (13-G filing) from its massive Apple stake (6% interest in the tech giant) for the first time since 2020 is really a huge red-flag warning that Apple's best days for shareholder value creation may be behind it. Why? Sliding company sales in 2023 were a clear bummer, after years of above-average results. The whole China/Taiwan political mess of having most all of its products and high-tech parts manufactured in this area of the world is not remotely a long-term positive for future supply-chain deliveries and net manufacturing costs. And, as I explained in previous articles during 2023, the high stock valuation on slow to no business growth makes little sense to own vs. 5% \"risk-free\" cash yields as alternatives. That's the background setup Berkshire has decided to sell into. Berkshire likely doesn't need extra liquidity or money with $157 billion in cash already held on the balance sheet at the end of September, patiently looking for a new home. My conclusion is selling Apple shares was a reason-based decision weighing downside share price risk vs. weakening potential long-term rewards, where managers now believe earning 5% in guaranteed cash-investment income is a stronger investment proposition than holding Apple the next couple of years. When you logically review all of the possible inputs for their decision, in my opinion, higher interest rates appear to be radically changing the calculus for owning Apple (and soon other Big Tech winners). For long-term shareholders of Apple, this is a seminal turning point regarding the relative attractiveness of the stock, in my view. The problem for Berkshire is it is next to impossible to liquidate a monster-sized position in Apple ($170+ billion in value remaining on 905 million shares) without cratering the stock quote, simply for share supply/demand reasons. Not only would aggressive selling overwhelm daily trading buying interest, but follow-the-leader bearish sentiment by Wall Street would dramatically downshift bullish enthusiasm on the other side of each transaction. If Buffett's excitement to own Apple was a positive catalyst for the share price since 2016, won't his selling potentially have the opposite chilling effect starting in 2024? The crux of the valuation problem for Apple (and Big Tech generally in early 2024) is the company is priced near a peak valuation on fundamental business results, measured over the last several decades, despite very high interest rates. Typically, over the previous century of Wall Street trading, stocks have typically traded at very low valuations when rates are high. Not today. The closest cousin for the current market valuation setup is 1999-2000, if a recession is next in America. Basically, Apple investors are paying an extended valuation for a business that could see operating results actually decline on recessionary demand soon. The easiest way to highlight Buffett's decision process to sell Apple is represented below. I believe Berkshire is getting out of the equity price risk and relatively low earnings yield provided by Apple shares in exchange for the 100% guaranteed return of capital and annual 5% guaranteed yield from Treasury Bills. The \"relative\" business return on investment vs. safe cash gains using today's $183 Apple price is a NEGATIVE -1.44%, with only 3.54% for a trailing earnings yield stacked against 5% in cash distributions available from 1-year Treasury securities. This is the worst relative yield situation since 2007. Why not bypass the risk of recession, including a lower Apple valuation on falling business trends, and just grab the higher cash yield? YCharts - Apple, Earnings Yield vs. T-Bill Yield Alternative, Recessions Shaded, Since 1999 YCharts - Apple, Earnings Yield vs. T-Bill Yield Alternative, Recessions Shaded, Since 1999 Below is a table of consensus analyst estimates for Apple EPS and sales during 2024-26. To me, this is a best-case scenario for shareholders, as a recession is generally not projected by Wall Street today. Even using bullish assumptions, the glory days of 20% and 30% growth rates are long gone for Apple in my opinion. Seeking Alpha Table - Apple, Analyst Estimates for 2024-26, Made February 19th, 2024 Seeking Alpha Table - Apple, Analyst Estimates for 2024-26, Made February 19th, 2024 Other valuation statistics point to a real disconnect with the weakening business growth position. Today, price to sales, cash flow, and book value are the same or higher than years past, when growth was truly dynamic. It's as if investors have not gotten the memo that slow growth rates are the future on Apple's almost $2.9 trillion in equity market capitalization. It's the law of large numbers at work. YCharts - Apple, Price to Trailing Sales, Cash Flow and Book Value, Recessions Shaded, Since 1999 YCharts - Apple, Price to Trailing Sales, Cash Flow and Book Value, Recessions Shaded, Since 1999 Seeking Alpha's Quant Valuation Grade remains an \"F\" score, one of the worst readings in the U.S. blue-chip universe currently. This summation rating looks back at 5-year valuations for Apple and gauges today's multiples vs. prevailing industry averages. Seeking Alpha Table - Apple, Quant Valuation Grade, February 19th, 2024 Seeking Alpha Table - Apple, Quant Valuation Grade, February 19th, 2024 I do believe upside potential in Apple is limited to the \"goldilocks\" scenario of a better economy with far lower interest/inflation rates. My personal view is odds of a recession hitting in 2024 are 75%, with a 25% chance of a soft landing or no landing (decent economic growth), using my 37 years of trading experience through 4 previous economic contractions in GDP. Ever-tightening credit conditions in the U.S. banking system since late 2022 (inverted Treasury yield curve and contracting total bank credit as signals), another bump higher in inflation as an excuse to raise interest rates and slash consumer spending further (perhaps led by rising crude oil quotes), on top of a clearly overvalued U.S. stock market (priced richly on peaking cycle earnings), all point to serious risk of a wealth and employment recession this year. Goldilocks has negligible odds of 10%-15% to play out later in 2024, in my view, and almost ZERO chance if the U.S. dollar value rolls over or crude oil spikes soon (pushing headline inflation rates back above 4% YoY). My best-case scenario, target price range for Apple is $200-$220 over the next 12 months, assuming the Big Tech bubble continues to expand, which would push the valuation story into an even more expensive position. Already, Apple's chart pattern momentum is fading fast from November-December highs. Believe it or not, Apple has been the second worst of the Magnificent 7 names to own over the last 12 months, next to Tesla (TSLA), underperforming the NASDAQ 100 by -16.5% over this span. And, with price moving under the 200-day moving average this week (which often provides support), a meaningful drop under $175 would be quite out of character. On Balance Volume trends, which are usually highlighting steady accumulation patterns in Apple, have reversed lower since December, indicating net-net money is leaving shares. Plus, the 20-day Chaikin Money Flow indicator is about to turn negative for the first time since September. The last two CMF swings into negative territory presaged weaker stock pricing over the next 4-5 weeks (red arrows on the chart). StockCharts.com - Apple, 12 Months of Daily Price & Volume Changes, Author Reference Points StockCharts.com - Apple, 12 Months of Daily Price & Volume Changes, Author Reference Points What kind of downside risk is possible for investors in Apple? Given a normalized long-term valuation over 15-years (using price to earnings, sales, cash flow, and book value) on rosy analyst estimates for 2024, I come up with $120 to $140 a share for bear targets. If we experience a recession with lower than now-estimated earnings, sales, and cash flow, a -45% price drop to $100 a share is not out of the question, for a worst-case scenario (15-year average 17x EPS, 4x sales, and 14x cash flow on slightly lower results vs. 2023). In my opinion, that's why Buffett is selling. I think he would rather sidestep some of the coming downdraft in Apple and capture a guaranteed 5% annual yield, with the almost 100% sure return of his (Berkshire's) upfront capital. In my view, Apple owners are holding incredible price risk today. Will Apple be a positive long-term compounder at 5% to 10% yearly rates over time? Probably. But if you can wait to buy shares at far lower quotes, your compounded gains will be significantly better. I will continue with my Sell rating for a 12-month outlook, projecting a price below $150 for Apple by the second half of 2024. Thanks for reading. Please consider this article a first step in your due diligence process. Consulting with a registered and experienced investment advisor is recommended before making any trade. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. This writing is for educational and informational purposes only. All opinions expressed herein are not investment recommendations and are not meant to be relied upon in investment decisions. The author is not acting in an investment advisor capacity and is not a registered investment advisor. The author recommends investors consult a qualified investment advisor before making any trade. Any projections, market outlooks, or estimates herein are forward-looking statements based upon certain assumptions that should not be construed as indicative of actual events that will occur. This article is not an investment research report, but an opinion written at a point in time. The author's opinions expressed herein address only a small cross-section of data related to an investment in securities mentioned. Any analysis presented is based on incomplete information and is limited in scope and accuracy. The information and data in this article are obtained from sources believed to be reliable, but their accuracy and completeness are not guaranteed. The author expressly disclaims all liability for errors and omissions in the service and for the use or interpretation by others of information contained herein. Any and all opinions, estimates, and conclusions are based on the author's best judgment at the time of publication and are subject to change without notice. The author undertakes no obligation to correct, update or revise the information in this document or to otherwise provide any additional materials. Past performance is no guarantee of future returns. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}