{
    "title": null,
    "date": "2/14/2024",
    "url": "https://wccftech.com/new-apple-ai-tool-can-animate-images-with-prompts/",
    "text": "Apple is lagging far behind the likes of Google and OpenAI when it comes to offering AI in its products. The company is heavily invested in bringing unique utilities to the iPhone and additional products later this year. We have previously reported that Apple made various breakthroughs in offering AI features based on the company's forthcoming large language models. Now, Apple has made another addition to its AI repository, which allows users to animate an image through commands and prompts. Earlier this month, we reported that Apple made a major breakthrough in its AI efforts, which can allow users to edit and manipulate an image based on natural language prompts. Now, the company is taking another step forward with its new tool titled \"Keyframer: Empowering Animation Design Using Large Language Models.\" The feature works similarly to the earlier tool that caters to images. With Keyframer, users can animate images based on description using Apple's large language models. \"While one-shot prompting interfaces are common in commercial text-to-image systems like Dall·E and Midjourney, we argue that animations require a more complex set of user considerations, such as timing and coordination, that are difficult to fully specify in a single prompt—thus, alternative approaches that enable users to iteratively construct and refine generated designs may be needed especially for animations. \"We combined emerging design principles for language-based prompting of design artifacts with code-generation capabilities of LLMs to build a new AI-powered animation tool called Keyframer. With Keyframer, users can create animated illustrations from static 2D images via natural language prompting. Using GPT-4 3, Keyframer generates CSS animation code to animate an input Scalable Vector Graphic (SVG).\" As you can see in the image embedded below, users can create an animation by uploading an SVG format image, a rocket in this case. Using prompts like \"generate three designs where the sky fades into different colors and the stars twinkle.\" The tool will generate a CSS code that can be further edited by the user or extended through further prompts. The authors explained that sequential prompts allowed users to refine their designs. The approach is pretty similar to how we use prompts in ChatGPT to get relevant answers. The process is seamless according to the paper and much faster than creating animations in a traditional way. Apple's new AI tool could prove to be an inspiring addition for future creators. The latest innovation is part of Apple's efforts to develop AI for its future devices. Apple could showcase some of these tools at its WWDC 2024 event in June. We have previously noted that iOS 18 will bring various AI additions to the table, which will operate at a system level. Furthermore, the iPhone 16 lineup will offer AI tools as well, but major additions will be evident in future devices. Apple is also looking to make Siri more advanced with AI integration, allowing it to better compete against the likes of Google Assistant and Amazon Alexa. We will keep you guys posted on Apple's AI efforts, so be sure to stick around. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}