{
    "title": "Apple sales stable due to emerging markets like India, Middle East & Africa",
    "date": "2/22/2024",
    "url": "https://www.newindianexpress.com/business/2024/Feb/22/apple-sales-stable-due-to-emerging-markets-like-india-middle-east-africa",
    "text": "NEW DELHI:  Apple’s sales remained stable in 2023, thanks to a significant boost from emerging markets such as India, the Middle East, and Africa, says Counterpoint Research in its monthly report. The report noted that in 2023, India became the fifth smartphone market to exceed 10 million iPhone unit sales in a single year, highlighting the market’s growing importance for Apple. “Apple’s total sales remained flat in 2023 even as major competitors declined. This stability was partly due to a significant boost from emerging markets like India and the Middle East and Africa (MEA). These factors contributed to the iPhone 15 series sales matching the performance of the iPhone 14 series in 2022,” reads the report. According to Counterpoint Research’s Global Monthly Handset Model Sales Tracker, the American tech giant Apple, for the first time, captured the top seven position in the global list of best selling smartphones in 2023. While the South Korean Technology brand secured the remaining three places in the list, marking an increase of one spot from the 2022 list. Interestingly, other than these two, there have been no other brands on the list since 2021. Their combined market share of the top 10 smartphones reached the highest ever at 20% in 2023, up from 19% in 2022. Apple’s iPhone 14 was the best-selling smartphone of 2023, with the US and China making up half of its sales. Further, the model contributed 19% of the total iPhone sales for 2023, down from the 2022 bestseller iPhone 13’s 28% share. The iPhone 15 series took the top three spots on the global bestseller list for Q4 2023, with the iPhone 15 Pro Max becoming the best-selling smartphone. Samsung’s budget A series captured three spots in the top-10 list due to its strong value proposition and presence across various geographies and customer categories. The Samsung Galaxy A14 5G secured eighth place, driven by high sales in the US and India. Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest  Copyright - newindianexpress.com 2024. All rights reserved. "
}