{
    "title": "Apple Stock: Vision Pro Sucess May Just Move The Furniture Around \n(NASDAQ:AAPL)",
    "date": "2/6/2024",
    "url": "https://seekingalpha.com/article/4667770-apple-stock-vision-pro-sucess-may-just-move-furniture-around",
    "text": "ANGELA WEISS/AFP via Getty Images ANGELA WEISS/AFP via Getty Images Apple Inc. (NASDAQ:AAPL) reported its latest quarterly result with EPS and revenue beating estimates. Despite weakness in China, the company benefited from resilient conditions in other regions and continued momentum from services while softer guidance retained a layer of uncertainty. Maybe the bigger story was the launch of the Vision Pro, Apple's version of a VR headset it refers to as a \"spatial computer\". Early reviews have been very positive, with a sense that this first-generation device marks a preview for the company as the next big growth driver. We're impressed by the technology, which appears to be well ahead of what other companies are doing. At the same time, we believe that potential success could be too much of a good thing, thinking about platform cannibalization. If the Vision Pro truly represents a revolution in consumer electronics, that would have some consequences for Apple's ecosystem including the Mac, iPad, and wearables. We last covered AAPL back in September, calling it our \"least favorite among the Magnificent 7\". While Tesla Inc. (TSLA) is in strong contention for that title today, we remain on the sidelines with Apple eyeing valuation headwinds amid what we believe to be structural growth challenges. Ultimately, we still see risks for the stock as tilted to the downside and expect volatility going forward. Seeking Alpha Seeking Alpha AAPL reported Q1 EPS of $2.18, coming in $0.07 above consensus, and up 16% from the period last year. Revenue of $119.6 billion was slightly above estimates, but still only representing an increase of 2.1% year-over-year. The gross margin reached 45.9% from 42.9% in Q1 fiscal 2023, reflecting the strength in services and the rebound of iPhone sales. Apple has also made an effort to control costs, with total operating expenses, up 1% y/y. We mentioned the weakness in China, where sales declined by -13% y/y to $20.8 billion, also missing the segment consensus forecast closer to $23.5 billion. This was balanced by otherwise stronger-than-expected trends in the Americas and particularly from Europe, where sales increased by 10% y/y. During the earnings conference call, management pointed out the success of the iPhone 15 which contributed to the best quarter for segment sales since the launch of the iPhone 13 two years ago. On the other hand, nearly flat Mac sales and the -25% decline from iPad were about in line with expectations. source: company IR (author annotation) source: company IR (author annotation) Beyond the nuances, it is fair to say Apple remains an operating cash flow juggernaut, with the metric reaching $39.9 billion, up from $34.0 billion in the period last year. The company repurchased $21 billion in stock this quarter, incremental to the $3.8 billion in the regular dividend. In terms of guidance, while not providing financial targets for the current Q2, management suggested total revenue to be in line with last year's $95 billion, adjusted for the timing of supply chain disruptions that skewed the results in early 2023. Services are expected to be similar to this prior quarter, with growth above double digits. The setup for Apple into 2024 remains centered on the macro picture. The good news here is that the data from the U.S. has come in stronger than expected with a sense that consumer spending remains strong and a path for lower interest rates could provide a rebound of underlying demand. There is a sense that sales in segments like the Mac and wearables could stabilize and begin to climb as a replacement cycle kicks in, nearly three years removed from the pandemic era boom. The company now claims a record installed base of 2.2 billion devices globally, and the impact there moves the flywheel into services with users more engaged across the ecosystem. According to consensus, the market is forecasting 1.4% revenue growth this year that should re-accelerate into fiscal 2025 above 6%. Higher margins can support room for EPS to climb a bit higher into the high-single digits over the next few years. We believe these figures are reasonable, even if it is our opinion there is a risk of underperforming. For a company on track to generate $400 billion in annual sales, it takes a lot to move the needle, which is what Apple is attempting to accomplish. Seeking Alpha Seeking Alpha The wildcard in the conversation over the next several years has become the Vision Pro headset. The understanding is that the company is on track to sell above 400k units this calendar year, with the only limitation being supplier manufacturing constraints. Still, even with the retail price of $3,500, that full sales amount of around $1.4 billion represents less than 0.5% in the annual top line. A small drop for the company in the grand scheme. That said, the expectation is for a significant ramp-up over the next few years with Bank of America Global Research forecasting units sold could reach 12 million and contribute $18 billion in revenue by calendar year 2028. The group believes the business could add upwards of $0.46 to firm-wide EPS over the period, generating more than $1 billion in profits as soon as 2026. We won't argue with these forecasts, considering the strong launch reports and our initial positive impressions of the device. The idea here is that Apple has entered a new hardware category that could work as a separate channel into its apps ecosystem. Users can experience both entertainment and productivity tools through a novel format but with the familiar Apple design language. source: BoA Research, shared via X source: BoA Research, shared via X As we see it, the $3,500 price tag is steep for a first-generation product but it's easy to envision a roadmap where improvements to the technology eventually reach a mass market-accessible price point. An effort to make the headset more mobile while improving the graphical performance seems like the logical next step. The same BofA research from above suggests the device's average sales price could drop to $1,500 over the next five years. The problem we have is in consideration of what Vision Pro means for the rest of the Apple catalog. Just as the iPhone launch in 2007 marked the eventual retirement of the iPod, the Vision Pro could ultimately make the iPad obsolete over the next decade while also competing with the Mac and iPhone to some extent. The difference here is that these categories are already mature with the low-hanging fruit of global adoption already captured. The point we're getting at here is that Vision Pro doesn't necessarily expand the pie for Apple's addressable market but simply shifts sales from existing devices. Going back to the latest earnings report, sales of iPads and wearables have been in decline, with the base case of Vision Pro likely replacing some of those sales from here. We're not the first to suggest this concept of the Vision Pro cannibalizing sales of other Apple products, but the discussion gains a new light as the device is now on sale. We believe the following dynamics are at play: We'll agree that there is some speculation here, and we're sure Apple's strategy takes these factors into account in terms of pricing and future development. If anything, our effort here is simply to roll back expectations that Vision Pro is a \"game changer\" or will lead to a new growth renaissance for Apple. We don't believe so. Looking at AAPL, our take is that the company is \"fine\" but still faces headwinds to drive long-term growth. China's macro data hasn't helped, but we can also bring up the legitimate competition to the iPhone where its differentiated aspects have been diluted over the last several years with alternatives from premium Android devices. On the upside, we'd like to see strong organic growth and we're skeptical that the Vision Pro is the answer. Other services like advertising, payments, and the cloud business are still small and only work to supplement the core hardware business. With the stock trading around 28x free cash flow, or 29x forward earnings, we haven't seen enough to justify a significant expansion of multiples from here. The company is \"great\" but shares remain pricey and would face a deeper correction with exposure to cyclical trends. At the end of the day, Apple remains a hardware-first company which warrants a more grounded growth premium relative to software tech names. source: yCharts source: yCharts We rate AAPL as a hold, implying a neutral view on the direction of price from the current level. $190 per share seems fair with the market continuing to assign the company a quality and leadership premium. On the other hand, a sustained rally above $200, in our opinion, needs a string of quarterly reports that materially exceed expectations. To the downside, a break in shares under $180 would open the door for a reset of the 2023 Q4 lows around $165. Monitoring points through 2024 include tracking iPhone sales trends, Vision Pro momentum, and high-level economic indicators. Add some conviction to your trading! Take a look at our exclusive stock picks. Join a winning team that gets it right. 2023 Seeking Alpha Market Prediction Contest Winner. Click for a two-week free trial.  This article was written by Dan Victor, CFA is President of Posto Asset Management LLC, a registered investment advisor based in Miami Beach, Florida. Recognized as the 2023 Seeking Alpha Market Prediction Contest winner, Dan forecasted the 24% rally in the S&P 500 to within 8 points. Dan brings 15 years of investment management experience across major financial institutions in research, strategy, and trading roles. Dan also leads the investing group Conviction Dossier, where his focus is on helping investors get the big picture right and stay ahead of the curve. He shares model portfolios, and exclusive trade ideas to help investors make better decisions. The group also features an active chat room. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}