{
    "title": "Apple could have a new problem: Uncle Sam",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/apple-could-have-a-new-problem-uncle-sam-115650004.html",
    "text": "Apple (AAPL) has long avoided the government-induced antitrust headaches now plaguing Big Tech rivals like Amazon (AMZN), Google (GOOG, GOOGL), and Meta (META). Until now. The Justice Department is reportedly in the final stages of deciding whether to wage a sweeping legal attack on Apple that could compound headwinds already picking up steam for the world's most valuable company in a rough start to the new year. According to the New York Times, US antitrust investigators are wrapping up a two-year probe into Apple’s closely guarded ecosystem. Investigators are looking into whether the integration between the company’s suite of products — including iPhones, the App Store, Apple Watch, iMessage, and AirTags — blocks competition. \"You don't ramp up unless you find that there's something significant there that you want to investigate,\" adjunct Columbia University Law School professor Martin Edel said about the reported probe. The multiyear probe, he said, tends to serve as a harbinger that the department found something it wants to pursue. Still, he cautioned, it's possible that the DOJ's investigation doesn't turn up any wrongdoing on Apple's part. Apple's antitrust worries come as the company faces a trio of downgrades from Wall Street analysts amid fears of weak demand for iPhones in China, where it has offered a rare discount, as that country's economy continues to sputter. On Friday, Microsoft surpassed Apple as the world's most valuable publicly traded company at the close of the trading day. Apple is also preparing to launch its most ambitious product yet, the Vision Pro spatial computer. The AR/VR headset, which goes on sale Feb. 2, is Apple's first new device category since it launched the Apple Watch in 2015 and could serve as the company's successor to the iPhone. But the AR/VR market is still incredibly small compared to the smartphone space, and consumers have tended to tire of the devices after a few months of use. A DOJ lawsuit seeking to dismantle Apple’s \"walled garden\" ecosystem would pose a major threat to the company's various revenue streams. Apple generates the bulk of its cash through the sale of its wildly popular iPhone, which accounted for $200.6 billion of the company's $383.3 billion in total revenue in 2023. But Apple's services and hardware that tie into the iPhone are also incredibly lucrative. The company's wearables, home, and accessories business, which includes its Apple Watch and AirPods sales, generated $39.8 billion last year, while its growing services business, which includes subscriptions for things like Apple Music+ and App Store sales, brought in $85.2 billion. Edel said he expects any DOJ antitrust action against Apple to look at how the company maintains its dominant position in a particular market where it holds an alleged monopoly, and not how it established prominent market position. Apple may be particularly vulnerable to a government-led antitrust challenge in the final months of the Biden administration, which has kept up an aggressive push to rein in Big Tech. \"The department has been fairly aggressive after companies that it thinks has maintained a monopoly position through illegal means,\" Edel said. University of Miami School of Law professor John Newman told Yahoo Finance that while no antitrust case is easy, and monopolization cases are among the hardest, the DOJ brings a lot of strengths to the table. For one, he said, prosecutors can gain access to company documents and data before filing a complaint. \"If I were Apple, I’d be pretty worried about this,\" Newman said, adding that the DOJ has some of the world’s top antitrust litigators in-house. Critics say that Apple abuses its market position in a number of ways, including by charging app developers a 15% to 30% fee on app store sales. The company has also been accused of locking out competitors from using Apple services like Find My and the tech giant's payment technology. Interoperability between Apple and third-party services is also a sticking point, as app developers and hardware makers accuse Apple of purposely cutting off access to certain features that Apple's devices and services can use. There are currently two separate antitrust cases that could impact how the DOJ approaches claims against Apple. One is a federal antitrust case heard by the Ninth Circuit Court of Appeals in October. Justice Department lawyers were permitted to present arguments in a high-stakes dispute between popular app developer Epic Games and Apple. In that case, the appeals court upheld a California trial court's ruling that said Apple did not hold a monopoly in the market for mobile app stores. However, in a minor win for Epic, the appeals court also upheld the trial court's ruling that said under anti-steering laws Apple must allow app developers to offer more ways for app users to pay for purchases. Apple and Epic are now appealing the decision to the Supreme Court, which has yet to say whether it will hear the case. What impact the case would have on a DOJ-led antitrust suit, Newman said, would depend on where the department chose to file its case. \"They could take the fight to Apple’s doorstep, but that would cause the Epic case to loom larger over a DOJ case,\" Newman said. \"DOJ may want to stay out of the Ninth Circuit altogether and write on a clean slate.\" The second case that could that could impact how the DOJ approaches Apple is a pending antitrust suit against Google over its dominance of the search engine market. Closing arguments for the case are scheduled to take place in March. Apple plays into the conversation because in 2021 Google paid mobile phone manufactures, including Apple, a combined $26 billion to serve as their default search engines. The lion's share of those payments went to Apple. Analysts at Bernstein say the figure likely nets Apple between $18 billion and $20 billion per year. At $20 billion, the payments would represent somewhere between 5.5% and 7% of Apple's annual revenue over the last three years. If the DOJ's investigation of Apple is in fact near its end, Edel said talks are probably already underway between its attorneys and Apple. Those talks and negotiations, he said, could potentially also resolve any DOJ competition concerns without the need for litigation. Alexis Keenan is a legal reporter for Yahoo Finance. Follow Alexis on Twitter @alexiskweed. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Related Quotes "
}