{
    "title": "Apple Maps wrongly lists restaurant 'permanently closed' which owner says \nhas cost him thousands",
    "date": "1/22/2024",
    "url": "https://www.abc.net.au/news/2024-01-23/apple-maps-error-costs-local-business-pums-kitchen/103364008",
    "text": " Apple Maps wrongly lists restaurant 'permanently closed' which owner says has cost him thousands It was only when a regular customer called to ask why he had shut his restaurant that Chris Pyatt found out his small business had been listed as \"permanently closed\" on Apple Maps, leaving him with a costly problem. \"We have no idea when this change went through,\" Mr Pyatt said. \"But we have seen a sudden and drastic change in customer behaviour towards the end of November and all of December. \"We've noted a significant downturn, of around $12,000. \"This is our livelihood.\" Mr Pyatt and his wife Pum have been running Thai restaurant Pum's Kitchen on Queensland's Sunshine Coast for nearly a decade. Neither of them own an Apple product, which made fixing the error a challenge. \"I use the Android system on the phone and I use the Microsoft system at home, which means I cannot see anything that's on the Apple system at all,\" he said. Mr Pyatt called the tech company and spoke to a customer service representative. He said he was told they could not help him because he was not an Apple customer. Instead, he was told to submit feedback online and in response he received an automated message. According to Apple, people can use any web browser to claim their business and update the details. Mr Pyatt said he had tried but was unsuccessful when using Microsoft Edge. Google Chrome did allow him to make the changes, but days later they still had not been updated on the app. Last week, the ABC reached out to Apple for comment. The restaurant's opening hours were fixed two hours later, but there was still a major problem. \"The pin drop on the map is wrong,\" Mr Pyatt said. \"We lost one customer [this week] because they called us to check the location, then stated they were using Apple Maps and didn't turn up. \"I personally put the pin drop onto their map, but it hasn't been updated and is navigating people to a place where we have never had our restaurant.\" Tech expert Erica Mealy from the University of the Sunshine Coast said there were hundreds of posts on Apple Forums, as well as sites like Reddit and Quora, from business owners experiencing similar issues. \"There's a lot of 'my hours are incorrectly reported', or 'my location is not right', 'my phone number is not right',\" she said. \"The challenge is there's no information that I could find about how they build the information for Apple Maps. \"Everyone consistently points back to getting an Apple business account, which is free, and set up your own details. \"However, there's equal numbers of people who've said 'I've done that and it's still not right'. \"There may have been some kind of technical issue going on in their back end, but they haven't disclosed one.\" Dr Mealy said it was getting tougher for small businesses to navigate their listings on various platforms across the internet. \"It's the businesses' job to regularly check their information and the number of places they have to check is increasing,\" she said. Mr Pyatt said he found dealing with the internet difficult and believes Apple should have checked before listing his business as closed. \"It's not right to close any online presence,\" he said. \"If you have a particular company which is precluding you from being able to access information about yourself, or your business, that's quite a scary situation to me.\" Dr Mealy said consumers were also finding it more challenging to rely on information listed online. \"If I look up and see something permanently closed on Google Maps then perhaps actually look up and see if there's another website,\" she said. \"If you're looking at businesses in your local area I would say the best place to go would be your local Facebook groups or your local notice boards. They're always going to be more authentically local.\" If you're unable to load the form, click here. We acknowledge Aboriginal and Torres Strait Islander peoples as the First Australians and Traditional Custodians of the lands where we live, learn, and work. This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced. AEST = Australian Eastern Standard Time which is 10 hours ahead of GMT (Greenwich Mean Time) "
}