{
    "title": "Apple overtaken as the world's most valuable company by one of its closest \nrivals — Microsoft takes top spot in early ...",
    "date": "1/11/2024",
    "url": "https://www.imore.com/apple/apple-overtaken-as-the-worlds-most-valuable-company-by-one-of-its-closest-rivals-microsoft-takes-top-spot-in-early-trading",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Microsoft is king now. Apple was briefly overtaken as the world’s most valuable company by Microsoft in the early trading on Thursday, as the two battle for the number one market capitalization spot. As reported by Reuters, Microsoft overtook Apple early Thursday when its shares rose 1.5%, elevating its market cap up to $2.888 trillion. By contrast, Apple’s shares fell 0.3%, bringing its market cap down to $2.887 trillion, “ the first time since 2021 that its valuation has fallen below that of Microsoft.” Since then, Microsoft’s shares have settled slightly and are now trading just 0.85% up at a market cap of $2.87 trillion. However, Apple’s shares have fallen further down nearly 0.7%. As it stands, it’s going to be very tight at the closing bell, with both companies in with a chance of taking the top spot by the end of Thursday. While it’s possible Apple could retain the title today, the power shift seems inevitable at this point after a tough start to Apple’s year and rising fortunes in Redmond. Apple’s share price is down 1.27% year-to-date, off the back of a sharp tumble in December precipitated by a ban on the Apple Watch Series 9 and Ultra 2. Currently suspended pending the legal case, it remains to be seen whether Apple will be able to circumvent the ban or come to any kind of legal settlement, but it was a big blow to finish out the year that spooked investors. By contrast, Microsoft’s shares are up 16% in the past six months as the company continues its fervent investment in AI. Apple is expected to unveil its own forway into LLM and AI later this year but is definitely behind the curve compared to rivals. Apple has also seen its stock downgraded by several analysts. Barclays, Piper Sandlers, and now Redburn-Atlantic have all downgraded their rating of Apple’s share price based on factors including limited growth for iPhone. Apple continues to struggle with iPhone sales in China and will be looking to several high-profile releases in 2024 to change its fortunes. That includes Apple Vision Pro, which will have limited appeal given its price tag, a new OLED iPad Pro, a new M3 MacBook Air, and of course the iPhone 16. iMore offers spot-on advice and guidance from our team of experts, with decades of Apple device experience to lean on. Learn more with iMore! Stephen Warwick has written about Apple for five years at iMore and previously elsewhere. He covers all of iMore's latest breaking news regarding all of Apple's products and services, both hardware and software. Stephen has interviewed industry experts in a range of fields including finance, litigation, security, and more. He also specializes in curating and reviewing audio hardware and has experience beyond journalism in sound engineering, production, and design.\n\nBefore becoming a writer Stephen studied Ancient History at University and also worked at Apple for more than two years. Stephen is also a host on the iMore show, a weekly podcast recorded live that discusses the latest in breaking Apple news, as well as featuring fun trivia about all things Apple. Follow him on Twitter @stephenwarwick9 Steve Jobs' signed business card sold at auction for over $180k The five iPhone changes Apple might have to make if the DOJ has its way Apple 'accidentally' updates every AirTag in the world at the same time - here's why By Stephen WarwickMarch 22, 2024 By James BentleyMarch 22, 2024 By Connor JewissMarch 21, 2024 By Connor JewissMarch 21, 2024 By Oliver HaslamMarch 21, 2024 By Connor JewissMarch 21, 2024 By Oliver HaslamMarch 21, 2024 By John-Anthony DisottoMarch 21, 2024 By Oliver HaslamMarch 21, 2024 By Oliver HaslamMarch 21, 2024 By James BentleyMarch 21, 2024 iMore is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}