{
    "title": "Apple Car Could Debut in 2028, but With Reduced Autonomy",
    "date": "1/26/2024",
    "url": "https://hypebeast.com/2024/1/apple-car-possible-2028-debut-reduced-autonomy-news",
    "text": "  While not much news has been heard from Apple regarding its futuristic Apple Car, the tech company does want you to know that they are still working on it. In a recent report from Bloomberg‘s Mark Gurman, Project Titan, the company’s decade-old vehicle project has gone through many stages of pivoting. Originally starting out as a fully self-driving car to an electric vehicle that matches that of the Tesla‘s, the highly-anticipated vehicle is said to launch no later than 2028, which is already two years after what the company last reported. The vehicle sees reduced autonomy, downgrading from a Level 5 system which is full automation, to a level four system which is full automation in some circumstances. However, it appears that it will now actually only be a Level 2+ which offers partial automation meaning there will only be limited self-driving features like for lane centering, braking and acceleration support. The driver will still have to give the car its undivided attention. This puts them in the market to compete against Tesla’s Autopilot, also categorized as a Level 2. In renderings, Apple’s car does not have a steering wheel or pedals, but instead, appears to have a remote command center. Now, the previously envisioned aesthetic seems to feature more of the standard features needed to control a car. Gurman reports that those close to the project think that by delivering reduced function Apple Car with diminished expectations could make or break the entire project, “Either the company is finally able to deliver this product with reduced expectations or top executives may seriously reconsider the project’s existence.” The company still does want to offer a Level 4 autonomous system down the line, but it is uncertain when that will be. While rumors of Apple’s Project Titan has been ongoing since the mid-2010s, the company has spent hundreds of millions of dollars to uphold the project.\n\n                                                \n                                                                                                    \n\n                                                            Read Full Article    "
}