{
    "title": "The iPhone 15 series, which was believed, is also selling below \nexpectations amid a sharp drop in de.. - MK",
    "date": "2/21/2024",
    "url": "https://www.mk.co.kr/en/stock/10947585",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share The iPhone 15 series, which was believed, is also selling below expectations amid a sharp drop in demand for IT devices worldwide due to inflation and a slowdown in the economy. Apple customers are very loyal, and optimism that iPhone change is a global trend on Android is being overshadowed. Investor sentiment in domestic iPhone parts makers is also cooling down. As of 1 p.m. on the 21st, LG Innotek is trading at 202,500 won, up 5,200 won (2.64%) from the previous day. It fell 15.45 percent in two months from 239,500 won at the end of last year. Considering that the KOSPI fell only 0.32 percent during this period, the fall is very large. Compared to the previous high of 321,000 won in June last year, it fell 36.9 percent. Until the second half of last year, the stock price was expected to rebound when the iPhone 15 series was released, but the stock price has been steadily declining since mid-November last year. LG Innotek is considered one of the leading iPhone parts makers in the Korean stock market. LG Innotek is supplying camera modules for iPhones to Apple. Apple is known to account for more than 70% of total sales. The same is true of the stock price of another iPhone component owner, BH. BH has lost 17.30% this year. Compared to 29,350 won in July last year, it is down 40.4%. Apple's stock price weakness is also noticeable in the New York Stock Exchange. Apple shares are down 5.66% while the Nasdaq Composite is up 4.13% this year. Apple also gave up its No. 1 position in market capitalization to Microsoft. This is because the expected sales of the iPhone 15 series are below expectations. iPhone sales in the fourth quarter of last year increased 6% year-on-year. However, this is not due to strong sales of the iPhone 15 series. This is due to the exchange rate correction effect. Sales of the iPhone 15 series, which was released in September last year, fell by 2 million units compared to its predecessor, while sales of older iPhones increased by 8 million units. What the stock market pays attention to is the sluggish Chinese market. China is a very important market, accounting for 20% of Apple's total sales. When looking at the sales growth rate by region, it was 2% in the United States, 10% in Europe, and 15% in Japan, but China recorded negative growth of -13%. iPhone is losing ground to Chinese manufacturers Huawei, Xiaomi, Oppo, and Vivo. On top of that, concerns are spreading that iPhone's position in the Chinese market will become narrower as Chinese manufacturers have also jumped into the on-device AI competition that started with the Galaxy S24 series. Due to Apple's inventory adjustment, shipments of iPhone parts are expected to decrease by 15-20% in the first half of this year compared to the previous year. In fact, Taiwan's Foxconn, which produces iPhones, also saw its sales plunge 21% year-on-year in January. LG Innotek and BH are also expected to see their earnings deteriorate due to sluggish iPhone sales. BH already recorded an earnings shock in the fourth quarter of last year with an operating profit of 16.1 billion won. This amount is less than half of the market forecast of 46.4 billion won. In the first quarter of this year, LG Innotek's operating profit estimate is 103.5 billion won. The amount is down nearly 30% from 145 billion won in the first quarter of last year. BH is also expected to be 9.8 billion won, below 10 billion won. Ko Go-young, a researcher at Hi Investment & Securities, said, \"A lot of concerns about Apple, which seems to have no clear direction for AI strategies beyond just sluggish iPhone sales, are reflected in the stock price. Just as expectations for strong sales have grown with the Galaxy S24 showing outstanding AI functions, the next opportunity will be for iOS vendors.\" 2024-03-25 13:53:34 2024-03-26 06:15:52 2024-03-24 15:26:58 2024-03-25 17:22:19 2024-03-25 08:57:22 2024-03-24 14:09:45 2024-03-25 14:47:31 2024-03-26 09:40:53 2024-03-26 06:07:05 2024-03-26 11:02:29 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}