{
    "title": "This Is Everything You Can Tell Siri to Do",
    "date": "2/7/2024",
    "url": "https://lifehacker.com/tech/everything-you-can-tell-siri-to-do",
    "text": "Using Siri, your iPhone's voice assistant, can be a quick and easy way to accomplish a variety of tasks—if you know how to use it. Many Siri features aren't as well-known as they should be, which gives me the chance to tell you about some of the more useful commands you probably haven't used yet. There's a more exhaustive list of Siri commands over on GitHub, but I've highlighted a few of the most useful and interesting commands below. Siri can control quite a few useful iPhone settings. You can use it to toggle features such as brightness levels, flashlight, dark mode, Night Shift, wifi, Bluetooth, and many others. You can even ask Siri to change the volume or to quickly take a selfie. Want to flip a coin to decide who does the dishes, but too lazy to actually fetch a coin? Ask Siri to toss a coin and it'll do the honors. Siri can also roll dice for you, which can be great when you're at a board game night but someone lost the die. Siri can be a good stock market companion. You can ask it for information such as the current price, P/E ratio, or market cap for any stock. You'll need to do more research to make informed investing decisions, of course, but Siri can be a good starting point. When you're out with friends and want to calculate how much to tip, Siri can help. You can ask Siri to calculate 20% of any dollar amount and it'll do the job. It's also great at basic math problems, so feel free to throw arithmetic at it when a calculator is out of reach. You probably know that Siri can be used to control music playback, but it's also great for precise control forward or backward. When you're playing a song, ask Siri to find a timestamp of your choice and it'll do this instantly. If you don't know the timestamp, you can ask Siri to rewind 15 seconds, for example, or forward a minute. Those who listen to podcasts using Apple Podcasts should try using Siri to play their favorites. You can also ask Siri to tweak playback speed when you're listening. With iOS 17, Siri got a useful new feature, which enables it to read articles out loud. As long as the webpage is open in Safari and supports Reader Mode, you'll be able to ask Siri to read out the entire article for you. There are some people who have just a couple of alarms set up on their iPhones, but there are many others who have set up several alarms in the Clock app. If you want to trim the list, it's a huge task without Siri. You can ask Siri to delete all alarms or even disable or enable all of them. Siri is also the fastest way to ping your Apple devices. You can ask Siri to ping your Apple Watch, MacBook, or other Apple devices listed in the Find My app. Siri won't make you a powerful magician, but it'll let you pretend to be one. You can use it to cast some Harry Potter spells, which effectively allow you to open apps or toggle the flashlight. \"Hey Siri, show my wallet\" is the command you need to quickly open the Apple Wallet app on your iPhone. This is faster than opening the app manually and is handy when you want to quickly access your boarding passes or concert tickets. When you know five different people called Jim and one of them is your significant other, it can be a bit of a hassle when you call or text them using Siri. To fix this problem, you can say something like, \"Hey Siri, Jim Smith is my boyfriend.\" The next time you want to contact these people, you can ask Siri to call your boyfriend, and it'll reach out to the right person. Similarly, you can tell the voice assistant that certain contacts are your relatives, or other types of professionals that you contact regularly. Siri can play the calls of various animals, birds, and the sounds of vehicles. If you're unsure what a fox sounds like, you can ask Siri to tell you. It will play an audio file of the bird's call or the vehicle's noise. When you want to say something in a different language, Siri can speak it for you. You can ask Siri to \"say hello in French,\" or replace hello with any other phrase you can think of. As long as Siri supports the language you're seeking, it'll translate and play the audio. You can use this to communicate with people who don't speak your language. Not all Siri commands have to be useful. Sometimes, you can chat with Siri and have fun. These are a few examples of funny Siri commands: Tell me a joke Rock, paper, scissors I love you Tell me a riddle Beatbox for me Sing me a song Dance for me Tell me a haiku This is just a glimpse at what Siri can do for you. There are many more features, such as controlling your Tesla, that are equally useful. This GitHub page, mentioned at the top of this post, has an exhaustive list of even more useful Siri voice commands that we won't go over here. Be aware though, the list is four years old, so some commands may not work as expected. Pranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features. Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better. © 2001-2024 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED. Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the\nendorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. Lifehacker supports Group Black and its mission to increase\ngreater\ndiversity in media voices and media ownerships. "
}