{
    "title": "Martin Lewis' MSE shares genius way you can save on a brand new Apple \niPhone 15",
    "date": "2/22/2024",
    "url": "https://www.mirror.co.uk/tech/martin-lewis-mse-shares-genius-32170172",
    "text": "The Money Saving Experts' advice is the ultimate tech buying 'life hack' - as Apple fans will be able to get the newest upgrade each year while saving hundreds Apple's iPhone 15 range is a popular handset for eager 2024 shoppers thanks to its latest software and modern titanium design, although getting your hands on a shiny new model can cost as much as £1,599. Martin Lewis' team of experts has shared an eye-raising way eager iPhone owners can cut the price and get the newest upgrade each year while saving a huge chunk of cash. On par with Samsung's rival new 2024 phones, a standard 128GB iPhone 15 from Apple would set shoppers back a minimum of £799 while picking its most expensive 1TB iPhone 15 Pro Max will cost a hefty £1,599 - so it's safe to say upgrading to the latest software, design, features, and trend doesn't come cheap. Latest iPhone 15 deal: Here at Mirror Tech we often share the ins and outs of Apple's Upgrade programme as a way of splitting the costly price, an alternative for shoppers who don't want to commit to an inflated mobile data contract. But one tech-savvy reporter at MSE has found a much better way to cut the price of buying the latest iPhone - by ditching Apple's programme and creating your own. READ MORE: Apple 2024 Spring Event: New iPad Air and iPad Pro models with upgraded iPhone 15 colourway READ MORE: 'I bought an Apple iPhone 14 Pro for £200 cheaper thanks to little-known site' A tip that'll help shoppers ditch the upfront costs and pricey Apple Care insurance that's thrown into the T&C's of the Apple Upgrade Programme, as MSE's Nick Durrant found. By ditching the programme and opting for an Apple pay monthly plan on a new iPhone and simply selling it yourself when you want a new upgrade, instead of giving it back to Apple for free, he proved how shoppers can save hundreds. He said: \"Well, you can make your own DIY upgrade programme – simply buy a new iPhone each year (either paying upfront or monthly via iPhone Payments), then sell it when you upgrade. This beats the Upgrade Programme for two reasons – you get paid for your old phone, and you don’t have to splash out for AppleCare+.\" Apple's official upgrade programme includes an upfront fee, followed by 11 months of payment instalments and a hefty extra amount for Apple care insurance. After the monthly payments, users can then hand in their phone and upgrade (hence the name) to the newer launched device - although you never get any money back for it. Taking inspiration from Nick's cost crunching on the difference on a new iPhone 7, I've added up the savings you could make if you adopted your own upgrade system on the newest iPhone 15 - it's a huge £600. To lock into Apple's Upgrade programme in 2024 you'll need to pay £69 upfront, followed by monthly payments of £42.95 at month 11 you'll be able to upgrade to the newest phone but you have to then commit to a further 20 months of instalments. - that's 32 months of £42.95 overall - with the upfront fee included that's £1,400.45. Where as shoppers could simply opt for the split monthly payments of £32.29 for the iPhone 15 (or pay £799 upfront), avoid locking into a lengthy contract, and simply sell their old phone when they want the newer upgrade. More 2024 Apple deals rounded up by Mirror Tech: Get the Apple Watch Series 9 for a cheaper price £130 price drop on the 2023 Macbook Air M2 Chip "
}