{
    "title": "I used Apple Vision Pro for the day, it helped my productivity",
    "date": "2/11/2024",
    "url": "https://www.businessinsider.com/using-apple-vision-pro-for-the-day-productivity-2024-2",
    "text": "       Whether we want to admit it to our bosses or not, working from home has some hidden perks: you can leave your favorite show on as background noise or check your phone free of guilt. And it turns out the Apple Vision Pro is perfect for remote workers like me who like to multitask. I used the Vision Pro for a full work day after unboxing it on Tuesday — and it combined all of my work-from-home guilty pleasures into one hub of work and play. When I connected my MacBook to the Vision Pro, the device turned into a mixed reality productivity wonderland: work tabs in one window, my comfort show playing off to the side in another, and a text thread of my friends' group chat floating near my head. Although the laptop screen was projected through the headset, I could only operate it with my mouse and keyboard — not with the hand gestures used to control the Vision Pro windows. Related stories It was a bit awkward when I found myself pinching to click and open a message that required a mouse click. Essentially, my MacBook became a wireless keyboard-mouse combo that I could use to navigate all of my Vision Pro (That was a major improvement from Vision Pro's floating keyboard which I thought was harder to use). The first few hours were fun — I was the star of a few meetings where my coworkers saw me with a distracting headset on. But staring at screens projecting directly in front of your face takes its toll. The eye strain is real. I couldn't last more than 4 hours in the Vision Pro, and by lunchtime, I needed a break from screens. By the time I was off, I just wanted to rest my fatigued eyes with a nap. Still, the headset could be a game changer for remote workers. I still don't see myself taking the Vision Pro out in public to work while at the gym or on the train like others seem to be doing and the eye fatigue and the weight of the Vision Pro remain a concern. But having my home office in a headset is pretty sweet. Read next Jump to "
}