{
    "title": "The world is obsessed with soccer. Can Apple make Americans love it too?",
    "date": "2/24/2024",
    "url": "https://www.cnn.com/2024/02/24/business/apple-tv-mls-season-pass/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Follow: Football is back in full force this weekend. Sorry, the other one. Saturday marks the beginning of Apple’s second year of streaming Major League Soccer matches, a decade-long, $2.5 billion deal that’s part of an ambitious effort to attract more fans and money to the 28-year-old league, which has long struggled for relevancy in the shadows of other North American sports. A centerpiece of that plan is “MLS Season Pass,” a sleekly designed streaming package that ditches the fragmentation other sports suffer from and lets fans stream globally every game — without blackouts — in the Apple TV app. The package costs $14.99 per month or $99 for the season and slightly less ($12.99 per month or $79 for the year) for existing Apple TV+ subscribers. Besides every regular season game, it also includes the playoffs and final, plus the Leagues Cup and lower-level MLS Next Pro and MLS Next matches. “We’re creating something new,” Sacha Kljestan, a former MLS player and now a broadcast personality, told CNN. “Something from nothing that, I think, 10 years from now, people will look back and this might be a game changer in modern television media.” Kljestan co-hosts “MLS 360,” which airs at 7:30 pm ET on Saturdays when a majority of the weekly MLS slate is played. Think of “360” as “NFL RedZone” for soccer junkies, with lead anchor Kevin Egan, analyst Andrew Wiebe and former soccer players Kaylyn Kyle and Bradley Wright-Phillips whipping viewers around as many as 10 games simultaneously happening, showing highlights and providing analysis. Similar to how NBC or CBS treats the NFL, Apple streams pregame and postgame coverage programs expanded to an hour this year, with the latter now beginning at a consistent time (12:30 am ET mostly following the finish of the Saturday games). Also, new this season is a Spanish-language version of “360” airing at the same time as the English-language edition. The glossy studio shows with sleek graphics and coverage changes to make games easier to find﻿ and watch, especially compared to previous MLS coverage deals when games were shown on a hodgepodge of TV networks and local affiliates, have worked. “Once people tuned into the product, they were watching longer than our linear versions in past years,” Camilo Durana, executive vice president of MLS’ Apple partnership, properties and events, told CNN. “We know that consumers have responded well to the high-quality production and the care we’ve taken with Apple to produce something that looks the part, feels premium and is produced in the best possible way,” he added. A small number of matches are still shown on broadcast networks, like FOX in the US and TSN and French-language RDS in Canada, with their own commentators. Under the Apple deal, games are no longer shown on local broadcast partners. Apple is also helping the MLS expand its presence in other products it owns, practically making soccer impossible to escape. On Wednesday, Apple released a new Sports app that shows live MLS scores and pushes people to watch them on “MLS Season Pass” on the Apple TV app. (It was likely not a coincidence that it rolled out the same day that soccer superstar Lionel Messi made his first full-season debut for Inter Miami that streamed exclusively on Apple TV.) MLS content will also be shown in Apple News, Maps and Music apps, plus the matches can be watched on the new $3,499 Vision Pro headset. The league also released team-branded Beats by Dre (also owned by Apple) headphones this year with player-curated playlists streaming on, where else, Apple Music. The idea, according to Durana, are “more expansive integrations within Apple’s ecosystem of products and services to just make the experience better,” thus satisfying existing fans and ideally attracting new ones to the MLS. Of course, all of this promotion is meaningless if no one is watching or paying. Apple doesn’t release viewership or subscriber numbers. Sports Business Journal recently reported that the package has “surpassed” two million subscribers, however it’s unclear how many are actually paying for it since the service was made free to T-Mobile subscribers and MLS season ticket holders. Durana also didn’t reveal any numbers but said the company saw a “massive and very strong wave of subscribers mid-year” in 2023 after Messi signed with Inter Miami. That matches a third-party report from analytics firm Antenna showing that “MLS Season Pass” was getting 6,000 new signups a day before Messi arrived but soared to 110,000 signups a day after he signed. Antenna said that the “Messi Effect” on a year-old streaming package was “unique and profound.” Even if the actual viewership is low, the $250 million yearly cost for Apple is a practically a “rounding error” for a company worth about $3 trillion. It’s also a “good investment because it’s another sticky offering to pull people into its ecosystem,” Santosh Rao, partner and head of research for Manhattan Venture Partners, told CNN. Soccer’s global popularity and the young demographic MLS predominately attracts makes the “whole deal a success,” even if its US ratings, he admitted, doesn’t reach the levels of other leagues like the NFL or NBA. “There’s nothing like live sports. It’s the best thing you can offer,” Rao said. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}