{
    "title": null,
    "date": "2/15/2024",
    "url": "https://www.streetinsider.com/Hot+List/EXCLUSIVE%3A+Buffett+still+considers+Apple+%28AAPL%29+stock+a+core+holding+despite+stake+sale+-+analyst/22787258.html",
    "text": "FREE Breaking News Alerts from StreetInsider.com! StreetInsider.com Top Tickers, 3/26/2024 Warren Buffett's Berkshire Hathaway revealed on Wednesday that it has trimmed its significant stake in Apple (NASDAQ: AAPL). The firm revealed in a filing that it sold 10 million Apple shares in the fourth quarter. However, it still owns more than 905 million shares. Apple shares are down around 1% Thursday following the news, adding to its recent pullback. The stock has fallen 3.5% in the last three months as investors have worried about iPhone demand. While Berkshire's decision to reduce its Apple stake has fueled further concerns about the iPhone maker's shares, one analyst believes Buffett still considers the tech giant to be a core holding. James Shanahan, a senior analyst at EdwardJones, told Investing.com that context is helpful when assessing the situation. He explained that BRK held over 915 million AAPL shares from June 30, 2022, through September 30, 2023. Meanwhile, as of the end of 2023, BRK owned 905.6 million AAPL shares (5.8% of outstanding shares). \"Relative to September 30, BRK's holdings declined by 10.0 million shares or 1.1%. I do not view this reduction to be significant,\" said Shanahan. \"BRK has trimmed AAPL holdings in the past.\" \"AAPL represents about half of BRK's equity portfolio (excl. equity method investments KHC & OXY). While BRK could trim this position further, I believe that Mr. Buffett considers AAPL to be a core holding,\" he added. Furthermore, a note from Bernstein in September 2023 told investors to \"Be like Buffett,\" acknowledging that the legendary investor buys Apple shares on dips/closer to 20x earnings. By Sam Boughedda Receive full access to all new and archived articles, unlimited portfolio tracking, e-mail alerts, custom newswires and RSS feeds - and more! "
}