{
    "title": "Iran has been turned upside down by the",
    "date": "2/26/2024",
    "url": "https://www.mk.co.kr/en/world/10950703",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share Iran has been turned upside down by the \"half-price iPhone\" scam. The Financial Times (FT) reported on the 25th (local time) that the fraud occurred through a report that \"Iranians angry at cheap iPhone fraud.\" The FT reported that thousands of Iranians were damaged, with an estimated damage of $35 million (about 46.6 billion won). In the past few months, Qurosh Company, which sells iPhones for $700, has appeared in Iran. It was an advertisement that eliminated intermediaries and secured iPhones themselves and sold them at half the price. The company used Iranian sports stars and celebrities to market and entice young customers who are iPhone users. Countless buyers deposited money, but the \"iPhone\" was not delivered for more than 45 days, and the advertisement turned out to be a scam. Buyers even picked up a protest in front of the police headquarters in the capital Tehran, but Amir Hossein Sharifian, the boss of the vendor Kurosh Company, was found to have already left Iran months ago. Iranian police said they planned to arrest Sharifian through Interpol, but did not disclose his location. iPhones can be purchased in Iran, but due to international sanctions, Apple has not opened a direct store and is sold on the market through imports from countries near the Middle East. According to local media, iPhones are so popular that they have sold more than $1 billion in the past 10 months. According to the FT, Iranian national soccer players and famous influencers who appeared as models for the Kurosh Company have been criticized for their alleged involvement in the scam. In Iran, 32 large-scale fraud cases have occurred, including the recent embezzlement of $3 billion from imported car companies as well as iPhone fraud. 2024-03-25 13:53:34 2024-03-26 06:15:52 2024-03-24 15:26:58 2024-03-25 17:22:19 2024-03-25 08:57:22 2024-03-24 14:09:45 2024-03-25 14:47:31 2024-03-26 09:40:53 2024-03-26 06:07:05 2024-03-26 11:02:29 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}