{
    "title": null,
    "date": "2/20/2024",
    "url": "https://ca.news.yahoo.com/one-reason-vision-pro-might-213227331.html",
    "text": "The Apple Vision Pro's $3,499 price tag may be part of the company's marketing plan. Some claim the headset's price is an example of Apple using 'mimetic desire' to stir up interest. Public figures with a Vision Pro may, in theory, inspire their followers to buy it if it's cheaper. The Vision Pro's whopping $3,499 price tag may be part of Apple's marketing ploy to entice more customers to purchase the mixed-reality headset in the future. At least that's what some members of the business community think. In a post on X, formerly Twitter, Jason Levin, a marketing strategist who writes about spatial computing, characterized Apple's so-called promotional tactic as a concept known as \"mimetic desire.\" Rooted in philosophical thought, mimetic desire refers to the notion that people desire the same things that their role models want. In the context of the Vision Pro, that theory could mean consumers may be more likely to purchase the device because celebrities or influencers they admire own it. \"When consumers see high-status people rocking Vision Pros in public, it becomes a status symbol to have one,\" Levin told Business Insider. \"If these people are models to you—which they are for many young people—mimetic desire kicks in and you subconsciously want a Vision Pro too.\" Some public figures who've been open about their experiences with the Vision Pro on the internet include YouTubers Logan Paul and Casey Neistat, rappers like T-Pain and Kid Cudi, and tech leaders like former Microsoft strategist Robert Scoble, according to Levin. Sam Altman, the CEO behind OpenAI, even said on X that the Vision Pro is the \"second most impressive tech since the iPhone.\" I just went on my walk again. This time on my couch.If you have an Apple Vision Pro, some photography tips. More in a couple videos I am uploading.1. The camera can focus close. Get very close to things. Move quickly around them. When you see it later in the headset it is… pic.twitter.com/bB0XTzJ291 — Robert Scoble (@Scobleizer) February 7, 2024 To support his point on mimetic desire, Levin linked a clip on his X post from an interview with Palmer Luckey, the founder of the Oculus VR headset that's now Meta's Quest, from last July. In it, Luckey shared his thoughts on how the Vision Pro's multi-thousand dollar price is aligned with Apple's plans to attract people to the product. \"The price just doesn't matter for the group of early adopters that they're targeting,\" he said in the interview referring to Apple. \"But what they're going to do is to inspire lust in a much larger group of people.\" After all, the Oculus founder, who did not respond to BI's request for comment, said he believes the Vision Pro will eventually be cheaper for the masses. During its initial phase after launch, the headset, he said, was purposefully designed with cutting-edge screen resolution, display quality, and ergonomics to target a wealthier customer base. Those with more disposable income would have no problem dishing out thousands of dollars for the glossy device compared to those who don't, he said. This wealthier customer base who buy and flaunt their headset out in the open may eventually stir up greater consumer interest in the product once its price drops. \"If Apple had tried to go to the low end of the market, that would've been a mistake,\" Luckey said in the interview. It's not just Apple trying to lure future customers to expensive shiny new objects. Levin said that Tesla, the electrical vehicle company run by CEO Elon Musk, has used mimetic desire by putting an expensive price tag on the company's first model to make \"owning an electric car cool.\" As a result, those who see people they respect purchase an expensive Tesla would, in theory, increase their desire for one. Apple didn't immediately respond to BI's request for comment. Read the original article on Business Insider The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein  Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises.  Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr., 我們致力透過體育推動全民運動，作為官方社區合作夥伴，讓逾一萬名巿民有機會體驗七欖。 (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer “The Daily Show” host tears into the former president’s claim ― and shows why the case matters.  The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit.  The Ohio lawmaker was asked about Donald Trump’s debunked claims about the 2020 election. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Anne Hathaway told Vanity Fair during a cover story interview that Christopher Nolan more or less saved her career when public opinion turned against her in the lead up to and the aftermath of her winning the Oscar for “Les Miserables.” Hathaway was widely mocked online at this time, and she once remembered googling herself …  The president has been going after his presumptive 2024 opponent with a little more venom than usual President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… The rapper was caught off guard when her \"whole boob\" fell out of her top on stage "
}