{
    "title": "Apple Card Users Hit a Milestone, Earning Over $1 Billion in Daily Cash \nRewards in 2023",
    "date": "1/30/2024",
    "url": "https://www.gizmochina.com/2024/01/30/apple-card-users-earned-1-billion-daily-cash-2023/",
    "text": "iPhone, MacBook, AirPods, iPad, Vision Pro, and much more. The number of products and services that Apple has integrated into our daily lives is increasing almost every day. One of these is the Apple Card, which the company introduced a few years ago in a limited number of regions. This credit card, usable for all kinds of purchases, including Apple products, gained significant popularity, especially among users in the United States. In fact, the card became so popular that Apple Card users earned more than $1 billion in Daily Cash in 2023. Here are the details… The popularity of the Apple Card in the United States is increasing almost every day. According to the company’s statements, there are more than 12 million users in the U.S. However, this number is not sufficient for the American tech giant. Therefore, a while ago they launched a reward program called Daily Cash. With this program, users started receiving 2% of their spending with Apple Pay back in cash instantly. The campaign was so successful that Apple Card users earned more than $1 billion in Daily Cash in 2023. “We created Apple Card with the aim of promoting users’ financial well-being. It’s gratifying to witness over 12 million customers leveraging its features to make sounder financial choices,” stated Jennifer Bailey, Apple’s VP of Apple Pay and Apple Wallet. “In just five years, we take pride in what we’ve achieved for Apple users. Looking ahead, we’re enthusiastic about ongoing innovation, investment, and enhancing the award-winning experience. Our goal is to offer users more tools and features to support them in leading healthier financial lives.” Unfortunately, you can’t use the Apple Card if you’re outside the United States. Even within the U.S., Goldman Sachs is the company handling this service. The main challenge lies in securing permissions from different countries and forming partnerships. Despite these obstacles, there’s still potential for positive developments in the future. RELATED: "
}