{
    "title": "3 Warren Buffett Stocks to Hold Forever",
    "date": "2/24/2024",
    "url": "https://www.fool.ca/2024/02/24/3-warren-buffett-stocks-to-hold-forever/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Warren Buffett sold some shares in Apple (NASDAQ:AAPL), and the market had questions. Image source: Getty Images There was a lot of discussion last week as Warren Buffett‘s investment company Berkshire Hathaway put out its 13F filing. Here, the company detailed what it bought, what it held, and what it sold. One area where we saw a sale was in Apple (NASDAQ:AAPL) stock, and investors were in an uproar. Was Buffett getting out of Apple stock? And where should we invest now? This is why today we’re going to look at the best options for those looking to invest in Warren Buffett stocks. And these three are at the top of the list. Buffett began investing in Apple stock back in 2016. Over time has bought the tech stock again and again. Since then, the company has become the largest holding in Berkshire Hathaway stock, making up over 40%! So, why did Buffett sell off about 10 million shares for almost US$2 billion? In short, to make up for other losses in other companies. It was a good time to get some returns from Apple stock and take advantage of the losses. Buffett still loves the stock, stating, “Apple is probably the best business I know in the world.” Buffett continues to love Apple stock for its strong brand, loyal customer base, consistent profitability, strong ecosystem and share buybacks. The company has now cemented a long-term position at the top of the leaderboard in tech stocks. And that could only expand as it finds new areas to invest in. Apple stock seems to know how to convince its loyal base that they need its products every day. And that looks likely to continue in the near and distant future. Beyond Apple stock, Bank of America (NYSE:BAC) is another stock that Warren Buffett loves. While nowhere near Apple, Buffett holds about 8% of the shares, making it the largest shareholder. And why does he like it so much? It’s proven time and again that it can weather any bad storm. Take the financial crisis of 2008. Bank of America stock emerged as one of the best banking franchises in the United States. Moreover, it still holds the potential for long-term growth in the banking industry — especially when improved market conditions return. That’s why lately, Buffett has been increasing his positions in banks like Bank of America stock. They provide value for future growth, and that’s what Buffett likes to see. Plus, as the largest shareholder, he gets to influence some decisions! As he’s said in the past, “We believe Bank of America is very well-positioned for the future.” Finally, there are very few consumer products out there that weather any economic downturn with ease. That includes The Coca-Cola Company (NYSE:KO), which Buffett has held since 1988. It now takes up 6% of the Berkshire Hathaway portfolio, and it doesn’t look like it will decrease any time soon. Buffett loves the stock for its iconic brand and global reach. No matter where you are, you can grab a Coke. And no matter what you’re making, it’s something you’ll likely always be able to purchase. It continues to have a huge competitive advantage with a recession-resistant product. Add in the fact that the company is a Dividend King, with over 50 years of dividend increases, and it’s hard to argue this as a Buffett favourite. KO stock will continue to provide strong passive income thanks to its strong business model. This is likely why he’s said in the past, “If you are looking for a long-term investment, this is one of the best because the world drinks a lot of soda.” This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 17, 2024 | Amy Legate-Wolfe Married Canadians, make sure you consider all your options before filing your tax returns! You could be missing out on… Read more » March 15, 2024 | Amy Legate-Wolfe This dividend stock has a solid present, and a strong future for investors looking to gain monthly passive income while… Read more » March 15, 2024 | Amy Legate-Wolfe If you have $40,000 sitting around, here is exactly how you can put it away and gain at least $1,560… Read more » March 15, 2024 | Amy Legate-Wolfe These growth stocks have already proven their worth this year, but are solid investments for long-term holders as well. Read more » March 15, 2024 | Tony Dong, MSc, CETF® Time in the market always beats timing the market. Read more » March 15, 2024 | Amy Legate-Wolfe TELUS (TSX:T) stock has a lot of competition ahead of it, so even with strong free cash flow and a… Read more » March 14, 2024 | Amy Legate-Wolfe Banks are great, but these three insurance stocks offer huge dividends, more diversification, and growth exposure. Read more » March 14, 2024 | Amy Legate-Wolfe FTT stock (TSX:FTT) recently saw a drop that could be a great opportunity for investors looking for growth over the… Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}