{
    "title": "Apple: Autonomous Driving Laggard (NASDAQ:AAPL)",
    "date": "2/6/2024",
    "url": "https://seekingalpha.com/article/4667785-apple-autonomous-driving-laggard",
    "text": "ozgurdonmaz  ozgurdonmaz A recent report has indicated yet another setback in the Apple Inc. (NASDAQ:AAPL) Car project. The project is further delayed and has seen a reduction in technological capabilities. Overall, what was once an aspiring new potentially large market opportunity, sparking investments across the tech and automotive industry, including notable companies such as Google (GOOG, GOOGL), Nvidia (NVDA), Intel (INTC) and Apple, in reality has proved to be a much more challenging endeavor than expected. My initial coverage was quite bullish on the project, as it could drive competition as legacy OEMs would have to avoid becoming like Nokia (NOK), similar to how the iPhone had transformed the phone. According to the latest news, Project Titan as it has been called since 2014, has been scaled back from L4 (basically fully autonomous) to L2+, which is a term that Mobileye Global (MBLY) has coined for its advanced SuperVision system capable of hands-off but eyes-on autonomous driving, similar to Tesla (TSLA) FSD. The launch date has purportedly been delayed as well, from 2025 to 2028. Overall, this is a massive setback. If Apple launches an L2+ vehicle in 2028, then it would be just another one of many vehicles (in an already highly saturated market) with such a capability. It would be just a car with an Apple logo. For comparison, based on current design wins, Mobileye already expects a surge in L2+ vehicles by 2026, with around 10 models by 2025 and another 20 in 2026 (although 17 of those are from one western OEM). Moreover, for Mobileye its L2+ SuperVision system is just a stepping stone towards its actual L4 fully autonomous Chauffeur system. The number of models included in all our design wins are now projected at 30 models as compared to nine models at the beginning of 2023. Our portfolio strategy where SuperVision serves as a bridge to Chauffeur is being proven out as Polestar, FAW and a multi-brand major western OEM, all awarded production programs on the Chauffeur platform during 2023. So with the initial marquee design wins from the likes of Porsche and the “western OEM,” Mobileye is finding that the due diligence period is shortening as instead competition among OEMs is intensifying for including advanced driving capabilities in their models: Mobileye said potential SuperVision customers are using the due diligence already done by these existing customers as proof for the system's capability, leading to shorter sales cycles. To that end, OEMs are finding out that developing their own systems from scratch is infeasible (ending up with a worse system at a higher price and later time to market), and hence instead they are turning to the industry leader, Mobileye, even if they have or had their own in-house projects. As such, it isn’t just Apple that has seen setbacks in its developments. Others include Tesla, General Motors (GM) Cruise, and Ford (F). It turns out that developing an autonomous driving system isn’t the same as developing any other consumer or even enterprise-grade software where bugs are patched as they are found. One such example is the difficulty of mapping. Maps are pretty much required to develop a reliable AV. However, regular GPS maps are not suitable, lacking precision. This has required existing robotaxi players such as Waymo to manually craft maps, a process which is unscalable. In contrast, Mobileye has developed its own crowdsourced REM mapping system that it first launched as part of its “cloud-enhanced” ADAS systems (and even some models before that to start collecting data). It is already in millions of vehicles, collecting billions of kilometers of road data. In its fiscal Q1, Apple reported less than 2% revenue growth. Except for its services segment, all its other major reported businesses (iPhone, Mac, iPad and other hardware such as wearables) are quite mature, with little long-term potential for future growth, unless perhaps by raising prices. Although the earnings were up low double digits, this was mainly driven by lower cost of goods sold. So, while the Apple Car rumor has mixed reception among investors, major product launches are nevertheless one of the few ways for Apple to drive growth. However, given the size of its business, even a product such as the $3500 Vision Pro is unlikely to contribute more than single digits to its overall revenue, which amounted to about $120B in fiscal Q1. Hence, Apple's premium valuation of nearly 30x P/E clearly isn't based on its growth performance. Nevertheless, for investors to see compelling returns from the current stock price, or even just to continue justifying the current valuation, exactly such growth is lacking that an Apple Car might deliver. Looking at Tesla, Apple Inc. has arguably missed an opportunity to add another trillion dollars to its market cap by missing the rise of the electric vehicle, or EV. In addition, Apple may hence have missed the opportunity to add another trillion or so to its market cap as it is now also missing the rise of the autonomous vehicle, or AV. Taken together, these developments are turning the car into the next computing platform. In its currently rumored form, the Apple Car would have a non-differentiated feature set being an L2+ system, which is technological level of which there are already vehicles on the road, and many more are expected in the next three years, most notably based on Mobileye’s SuperVision system. On the surface it might have seen that developing an AV would play to Apple’s strengths: sensors, highly capable chips and advanced software and AI. However, in reality, developing an AV has turned out to be more like designing a mission-critical system like airplanes’ autopilot, while having the requirement of nevertheless scaling this globally to millions of consumers potentially. Mobileye in that regard remains pretty much the only company to have solved the for newcomers almost insurmountable challenge of creating global HD maps. Nevertheless, taking a long-term outlook, despite a lot of frenzy over the last decade, today L2+ in consumers vehicles and L4 in robotaxis (never mind in consumer vehicles) remain at the very initial stages of small-scale adoption. This could mean that even in 2028, Apple could make quite some headlines with an Apple Car, even if it was just for being one of the most notable companies having a very large fan and installed base to sell into. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}