{
    "title": "Dropbox stock drop may be worth the risk",
    "date": "2/23/2024",
    "url": "https://www.marketbeat.com/originals/dropboxs-stock-is-a-falling-knife-worth-catching/",
    "text": " When does a falling knife become just too tempting not to try and catch? With the broader equity market surging to record highs on the back of a risk-on sentiment that keeps getting stronger, there are only a handful of stocks out there that are plummeting right now. One such stock is Dropbox, Inc. NASDAQ: DBX, whose shares were, as recently as two weeks ago, trading at a multi-year high but have since fallen some 30%. It will be a bitter pill to swallow for Dropbox investors, who’ll be forgiven for wondering why it’s their stock, out of the hundreds of tech companies out there, that’s bucking the wider trend. It all started going wrong for the cloud storage giant around St. Valentine’s Day when they released their Q4 earnings. In a sign of just how fickle investors can be, the stock sank despite Dropbox landing a solid beat on expectations for both the headline revenue and bottom-line earnings. Further bright spots in the report included the company’s expansion into artificial intelligence (AI) opportunities and the solid increase in average revenue per paying user year on year. Operating margins were also much improved, but the slowing growth, especially with Dropbox’s revenue seems to outweigh all of these bullish signs. For the fourth straight quarter, Dropbox’s ARR was down a pattern that would give even the most bullish investor something to worry about. Dropbox’s shares gapped down at the open and haven’t really paused for breath since. Yesterday’s 2.5% drop put the stock back at 2018 levels. On the same day, NVIDIA Corp’s NASDAQ: NVDA earnings sent the rest of the market soaring. So, what’s the angle here? Are we looking at a serious entry opportunity that’s going to start soon emerging as Dropbox’s fall levels out, or is this one of the few tech stocks that should be steered clear of? Before diving in, it’s important to note that even with the preceding quarters showing slowing revenue growth, Dropbox shares still had no trouble rallying through last year. Indeed, through the start of this month, they’d gained almost 80% since March of last year, with much of those gains coming since last November. However, it’s looking like the report from the other week was the final straw for any of the remaining bulls who’d been happy to overlook the warning signs from last year. In the two weeks since the report, the commentary from the analysts has all been one way down. Bank of America and JPMorgan Chase are just two of the heavyweights who moved their rating on Dropbox shares down from a Buy. However, what’s interesting here is the velocity of the stock’s current drop, both the refreshed and lowered price targets from those analysts' teams above where Dropbox shares are trading today. Bank of America lowered its price target from $34 to $28, while JPMorgan Chase lowered it from $33 to $33. With Dropbox shares set to go into the weekend well beyond the $24 mark, you can’t help but get the sense there’s a serious entry opportunity opening up here. Taking the more optimistic of those price targets, we’re looking at a targeted upside of at least 35%, a potential return that should tempt even the more cautious investor. Backing up the entry opportunity thesis is the stock’s relative strength index (RSI) reading, which, at 19, is screaming oversold conditions. Rarely does a stock maintain its downward pressure when the RSI is so extreme, and were Dropbox shares to show any signs of stabilizing in Friday’s session, they’d be very good value to pop higher into next week. The company will need to deliver a strong report next quarter that shows plenty of revenue growth to truly turn things around, but that doesn’t mean there’s not an opportunity to capitalize on a potential overreaction in the meantime. Before you consider Dropbox, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Dropbox wasn't on the list. While Dropbox currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering where to start (or end) with AI stocks? These 10 simple stocks can help investors build long-term wealth as artificial intelligence continues to grow into the future. Technical Analysis Sam Quirke has been a contributing writer for MarketBeat since 2019. Technical and fundamental analysis, tech stocks, large caps, timing entries and exits Trinity College, Dublin, Ireland Professional futures trader, start-up fund manager Because Nvidia already commands about 80% of the market, is advancing technology today, and is raising prices, it should continue to grow and outperform expectations for the foreseeable future. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}