{
    "title": null,
    "date": "2/15/2024",
    "url": "https://247wallst.com/investing/2024/02/15/buffett-dumps-apple-shares/",
    "text": "Apple Inc.’s (NASDAQ: AAPL) share price is down just over 4% this year, while the S&P 500 is roughly flat. Apple’s shareholders are used to a stock that keeps rising. That has not been the case this year. World famous investor Warren Buffett, CEO of Berkshire Hathaway Inc. (NYSE: BRK-A), dumped a bunch of shares last quarter in a sign he thinks Apple stock’s run is over. Buffett sold 10 million shares of Apple in the final quarter of 2023. According to the Financial Times, Apple stock is about 20% of Berkshire’s market cap. Buying Apple was a stroke of genius, some people say. The stock is up 367% since late 2018, when Buffett began to take a large position. (Warren Buffett can’t get enough of these seven dividend monsters.) While the sell-off of the Apple shares in Berkshire’s portfolio is modest, Buffett may see what some analysts who downgraded the stock have seen. That is, iPhone sales in the largest smartphone market in the world have been weak. There have been worries for at least a year that the iPhone 15 might sell poorly compared to recent generations. It may not have sufficient upgrades from the iPhone 14 to tempt owners to upgrade. It could be too expensive. Perhaps competing models like the Galaxy Z Flip5 from archrival Samsung had attracted Apple customers. The iPhone had a modest sales increase, based on the company’s most recent earnings report. Apple’s revenue rose only 2% overall to $119.6 billion. iPhone revenue worldwide grew faster, but not by much. The increase for the quarter was from $65.8 billion to $69.7 billion. The earnings report also shows that Apple’s wheels fell off in China. Revenue for what Apple calls Greater China dropped from $23.9 billion in the year-ago quarter to $20.8 billion. With over 900 million users, China is the largest smartphone market in the world by far. Apple competes with local manufacturers in China, which is not a challenge in any other large country. China-based Huawei has about a third of the market, as does Apple. Xiaomi and Honor each have slightly less than 10%. Samsung has a presence in the market. Apple stock has been downgraded recently because of worries about China. The competition is fierce, unlike in the United States and much of Europe. Without healthy growth in China, Apple’s prospects are mediocre. The Modern Investment App For a Richer Tomorrow (Sponsored) Robinhood set out to democratize investing to individuals, and it’s not slowing down. The app makes it possible to buy and sell stocks, mutual funds, trade options, and even cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH). With FDIC insurance ,an award winning design, and benefits like IRAs and more, Robinhood could be your path to a richer tomorrow. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}