{
    "title": "Security Bite: Jamf warns cyber hygiene among many Apple-using businesses \nis 'abysmal'",
    "date": "2/25/2024",
    "url": "https://9to5mac.com/2024/02/25/security-bite-jamf-warns-cyber-hygiene-among-many-apple-using-businesses-is-abysmal/",
    "text": "Hey, Arin here. Last week was the busiest for security so far this year. We saw an unprecedented offensive on the LockBit ransomware gang; Apple moved to make iMessage future-proof with quantum computer protection, and the topic of this week, Jamf’s new report highlighting some alarming statistics around Apple-using businesses. So, grab your drink of choice. Let’s get into it… 9to5Mac Security Bite is exclusively brought to you by Mosyle, the only Apple Unified Platform. Making Apple devices work-ready and enterprise-safe is all we do. Our unique integrated approach to management and security combines state-of-the-art Apple-specific security solutions for fully automated Hardening & Compliance, Next Generation EDR, AI-powered Zero Trust, and exclusive Privilege Management with the most powerful and modern Apple MDM on the market. The result is a totally automated Apple Unified Platform currently trusted by over 45,000 organizations to make millions of Apple devices work-ready with no effort and at an affordable cost. Request your EXTENDED TRIAL today and understand why Mosyle is everything you need to work with Apple. This is Security Bite, your weekly security-focused column on 9to5Mac. Every Sunday, Arin Waichulis delivers insights on data privacy, uncovers vulnerabilities, and sheds light on emerging threats within Apple’s vast ecosystem of over 2 billion active devices. Stay secure, stay safe. Jamf, the popular Apple device management platform, is out with its annual security trends report for 2023. The analysis looks at anonymized real-world customer data collected from over 15 million devices using Jamf across multiple platforms (macOS, iOS, iPadOS, Windows, and Android), as well as threat research and industry events, to depict the threat landscape as it affects businesses and employees. Some of these stats are indeed alarming but may not come as a total surprise. Earlier this month, 9to5Mac reported that the adoption of iOS 17 is moving at a much slower rate than iOS 16, which contains at least two major vulnerabilities that have been exploited in Operation Triangulation patched in 16.2 and a second zero-click used by attackers to inject Pegasus spyware that was fixed with iOS 16.6.1. Lack of next-gen software adoption could be a driving factor behind such a large amount of mobile users running a device with known vulnerabilities. Of course, this is just iPhone. Jamf’s data lumped all mobile operating systems together for this particular analysis, so we can’t see how much Android is contributing to the 40%. It’s a long-running misconception that Mac can’t get malware. This is certainly not true. Without getting too much in the weeds, the increase in malware targeting Mac computers is evident. Jamf reports an additional 21 new families were detected in 2023, which would be a 50% increase YoY. What is true is as Mac continues to rise in popularity, it’ll lose its strength in low numbers and become a more attractive target for cybercriminals. But the fact remains that Mac continues to be intrinsically more secure than Windows at the moment. “The analysis, carried out in Q4 2023 and revisiting the prior 12-month period, revealed many key themes, chief among them that organizations’ cyber hygiene is abysmal and threat actors are ready to strike with the most sophisticated attacks yet,” Jamf states. Jamf has the entire report available for download here. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Privacy is a growing concern in today's world. F… Jamf is a popular mobile device management syste… My laptop! Lightweight. Fast. Seemingly indestructible. My current and favorite electric stand-up desk I've tested. The quality is great and the price even more so. "
}