{
    "title": "World Street | China tightens the noose on securities, Apple's lawsuit win, \nDuPont's mega buyback plans...",
    "date": "2/7/2024",
    "url": "https://www.moneycontrol.com/news/business/markets/world-street-china-tightens-the-noose-on-securities-apples-lawsuit-win-duponts-mega-buyback-plans-and-more-12207911.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Chinese regulators have rolled out a raft of intense measures to crack down on short-selling as it works to lift its stock market from the rout seen last week. US miner Piedmont Lithium has become another company to cut jobs to save costs. Apple won a lawsuit against a Silicon Valley startup. All this and much more on World Street. Watchdog in Action China's securities regulator said on Tuesday it would suspend brokerages from borrowing shares for lending and cap the size of so-called securities refinancing, as part of further efforts to curb short-selling. The watchdog will also ban securities lending to investors who sell stocks on the same day of purchase, and vowed to crack down on illegal arbitrage using short-selling. Fault in Our Cars Honda Motor Co is recalling more than 750,000 vehicles in the United States due to an airbag that may deploy unintentionally during a crash, the National Highway Traffic Safety Administration (NHTSA) said. The front passenger seat weight sensor may crack and short circuit, failing to suppress the air bag as intended, NHTSA said. Human Intervention Meta Platforms will begin detecting and labelling images generated by other companies' artificial intelligence services in the coming months. Meta will apply the labels to any content carrying the markers that is posted to its Facebook, Instagram and Threads services in an effort to signal to users that the images - which in many cases resemble real photos - are actually digital creations, the company's president of global affairs, Nick Clegg, wrote in a blog post. WeBack? WeWork founder Adam Neumann is trying to buy back the flexible workspace provider after it filed for bankruptcy in November, CNBC reported. Neumann's new realty venture, Flow Global, has sought to buy WeWork or its assets, as well as provide bankruptcy financing to keep it afloat. Transition Troubles Europe's green energy transition is stuck between a rock and a hard place, reports Reuters. A flood of cheap Chinese solar panel imports is driving record solar energy installations. But those same imports are crushing Europe's few local solar manufacturers. Europe just had a bumper year for green energy. The European Union countries installed record levels of solar capacity, 40 percent more than in 2022. The vast majority of those panels and parts came from China – in some cases, 95 percent, International Energy Agency data show. Richie Rich Ford Motor announced that it will give more cash to shareholders, beginning with an extra 18-cents-per-share dividend in the first quarter. With this, the company is following the footsteps of rival General Motors in deploying more cash spinning from its North American combustion trucks business. Ford also estimates $10 billion to $12 billion in pretax profit for 2024, after earning $10.4 billion before taxes last year. Letting It Go US miner Piedmont Lithium is the latest addition to the list of companies undertaking a workforce reduction drive in an attempt to cut costs. The company announced that it recently reduced its workforce by 27 percent as part of its cost-cutting plans amid a fall in prices of lithium. The US miner is likely to complete the majority of its cost-saving initiatives by the end of the first quarter and aims to achieve about $10 million in annual savings.  Last month, company rival Albemarle also announced its intention cut jobs and hold its expansion plans in the wake of declining lithium prices. Lawsuit Winner Apple won a lawsuit by a Silicon Valley startup, accusing the company of illegally monopolising the US heart rate monitoring apps market with its product Apple Watch. On Tuesday, US District Judge Jeffrey White in Oakland, California, delivered a ruling against AliveCor, the developer of an app designed to detect irregular heartbeats. AliveCor accused Apple of violating both the federal Sherman antitrust law and a California unfair competition law. Big Plans After posting a beat in its Q4 profit, specialty chemicals maker DuPont de Nemours announced a mega $1-billion stock buyback programme and a 6 percent increase in its quarterly dividend. The specialty-chemicals maker also anticipates a broad-based electronics materials recovery in 2024. Factoring that in, the company forecast annual sales between $11.9 billion and $12.3 billion, as against with analysts' average estimate of $12.3 billion. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}