{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.nexttv.com/news/former-apple-and-hulu-exec-pete-distad-reportedly-tops-the-short-list-to-lead-the-big-disney-fox-wbd-sports-streaming-venture",
    "text": "Distad ran the sports video business at Apple and was also on the launch team at Hulu Former Apple and Hulu executive Pete Distad is the \"top candidate\" to lead the new joint streaming venture announced last week by Disney, Fox and Warner Bros. Discovery, according to digital newsletter platform Puck. The Wall Street Journal, meanwhile reported that Distad, who ran video and sports businesses at Apple before departing last May, is \"among the top candidates\" for the job. In addition to serving on the launch team for Apple TV Plus, while also overseeing relationships for Apple with Major League Soccer and Major League Baseball, Distad was around at as a marketing and distribution executive at Hulu when NBC, Fox and Disney hoisted Hulu in 2007. Also read: Why ‘Re-Bundling Has To Happen’: Breaking Down the New ESPN, TNT Sports and Fox Sports Streaming JV Last week, Disney, Fox and WBD announced that they are going sell a joint live-streamed bundled of their pay TV sports channels. Leadership or the project is still unannounced, as is a price, launch date and name. None of the media companies involved in the joint venture are confirming Distad's status at this point. A consultant close to the companies only told us that Distad is only \"director level\" in terms of stature. Listing his own Apple title as \"Sr. Director, Video/Sports/TV+ Business, Operations, and Distribution,\" Distad does, however, seem to have the diversity on his resume that the JV partners are looking for: marketing, engineering, relationship-building, etc, etc. The smarter way to stay on top of the streaming and OTT industry. Sign up below. And as the masked consultant we spoke to suggested, none of the three CEOs who made this joint venture \"want a super independent person in that role.\" Daniel Frankel is the managing editor of Next TV, an internet publishing vertical focused on the business of video streaming. A Los Angeles-based writer and editor who has covered the media and technology industries for more than two decades, Daniel has worked on staff for publications including E! Online, Electronic Media, Mediaweek, Variety, paidContent and GigaOm. You can start living a healthier life with greater wealth and prosperity by following Daniel on Twitter today! ‘March Madness’ Takes Center Court: What’s on This Weekend in TV Sports (March 23-24) NFL’s Brian Rolapp on Spulu: \n‘For $20 more ... I Could Buy YouTube TV and Have All of the NFL’ Steve Harvey Takes Equity Partnership in  Merit Street Media By Michael MaloneMarch 21, 2024 By Daniel FrankelMarch 21, 2024 By Michael MaloneMarch 21, 2024 By Daniel FrankelMarch 21, 2024 By Daniel FrankelMarch 21, 2024 By Michael MaloneMarch 21, 2024 By Jon LafayetteMarch 21, 2024 By Michael MaloneMarch 21, 2024 By Daniel FrankelMarch 21, 2024 By Jon LafayetteMarch 21, 2024 By Jon LafayetteMarch 21, 2024 Next TV is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}