{
    "title": "Stock-Split Watch: Is Apple Next?",
    "date": "1/14/2024",
    "url": "https://finance.yahoo.com/news/stock-split-watch-apple-next-131000148.html?ref=biztoc.com",
    "text": "Apple (NASDAQ: AAPL) has split its stock five times since its IPO in 1980. It executed three 2-for-1 splits in 1987, 2000, and 2005, a 7-for-1 split in 2014, and a 4-for-1 split in 2020. Those splits would have turned 100 shares bought prior to the first one into 22,400 shares -- and anyone who bought 100 shares at its IPO price of $22 and held on would have seen their initial $2,200 investment turn into a holding worth more than $4.2 million today. Now, those stock splits didn't actually make Apple's shares more valuable. They simply carved its existing shares into smaller ownership slices of the company, which reduced their prices and made them easier to trade on the options market where a single contract needs to be tethered to 100 shares. The underlying valuation of the company, and of investors' positions in it, remained the same. Most brokerages now make it easy for retail investors to buy and sell fractional shares, so they won't be prevented from putting money into a company because it has too high a share price and stock splits don't matter as much as they used to. That said, stock splits still usually generate a lot of media buzz and attract the attention of retail investors who might be more inclined to purchase shares of a stock with a double-digit price tag instead of a triple-digit one. So could Apple split its stock, which currently trades at around $186 per share, in the near future? When Apple announced its last 4-for-1 split on July 30, 2020, its stock was trading at $385. When it announced its previous 7-for-1 split on April 23, 2014, it was trading at $525. Based on those two decisions, it doesn't seem likely that Apple will choose to split its stock at its current level of around $200 a share. It has also been just three and a half years since its last split, and the shortest period between its stock splits has been nearly five years (2000 to 2005) so far. Therefore, it will probably be at least a few more years before Apple's board approves another stock split. Apple is already worth almost $2.9 trillion, which makes it one of the two most valuable companies in the world alongside Microsoft. (Microsoft briefly moved ahead of Apple to take the No. 1 spot on Thursday.)  It could be difficult for Apple to grow its market cap meaningfully from there as its revenue growth and earnings growth cool off. Analysts expect Apple's revenue and earnings to only rise 4% and 8%, respectively, in its fiscal 2024 (which will end in September) as iPhone sales slow down. Its iPhone sales fell 2% in fiscal 2023 -- due to the end of the 5G upgrade cycle and macroeconomic challenges in China -- but the flagship smartphone still accounted for over half of the company's total revenue. Declining sales of Macs in the post-pandemic market and currency headwinds exacerbated that slowdown. Apple is trying to offset that pressure by expanding its services ecosystem, which now features more than a billion paid subscriptions, but it remains overwhelmingly dependent on the iPhone. A patent dispute also recently disrupted the sales of Apple Watches in the U.S., and the $3,500 price tag of the new Vision Pro headset will limit its mainstream appeal when it launches in early February. Considering all the challenges Apple faces, its stock doesn't look like a bargain at 28 times forward earnings. And its paltry dividend yield of 0.5% won't attract any serious income investors at a time when CDs and Treasuries offer risk-free yields of more than 5%. Instead of wondering when Apple might split its stock again, investors should focus on the company's cash flows and buybacks as it navigates the near-term headwinds. It generated $99.6 billion in free cash flow (FCF) over the past 12 months, and it spent $77.6 billion of that total on buybacks and $15 billion on dividends. It bought back 38% of its outstanding shares over the past 10 years, and it has raised its dividend every year since it reinstated the payout in 2012. Those moves indicate Apple is a shareholder-friendly company that would rather return its excess cash to its investors instead of \"di-worsifying\" itself with reckless investments or acquisitions. That might be why Warren Buffett's Berkshire Hathaway has allocated nearly half of its stock portfolio to Apple. But with $162 billion in cash and marketable securities on its books at the end of its latest quarter, Apple still has plenty of room to make big acquisitions to expand its ecosystem. That cash cushion also makes it a good safe haven stock to own during economic downturns. Apple's upside might be limited this year, but its core strengths should limit its downside potential until its next growth cycle starts. Therefore, it might still be a good time to accumulate this stock as the bears bemoan its lack of near-term catalysts. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Apple wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  Leo Sun has positions in Apple. The Motley Fool has positions in and recommends Apple, Berkshire Hathaway, and Microsoft. The Motley Fool has a disclosure policy. Stock-Split Watch: Is Apple Next? was originally published by The Motley Fool Related Quotes "
}