{
    "title": "Apple's 2024 is off to a rough start",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/apples-2024-is-off-to-a-rough-start-200355426.html",
    "text": "We’re less than a month into the new year, but it feels like it’s been a heck of a lot longer for Apple (AAPL) watchers. The tech giant has been making headlines left and right as it juggles a handful of downgrades to its stock price, faces required major changes to its App Store policies, and gears up for a potential antitrust lawsuit that could target large swaths of its business. All of this comes as Apple prepares to launch its $3,499 Vision Pro headset. Apple’s most ambitious product in years, the Vision Pro catapults the company into a product category that even established players like Meta (META) have struggled to turn into a hit. It’s a lot to say the least. But it’s not all doom and gloom for Apple. Generative AI-equipped iPhones and a reacceleration of the company’s services business should help goose growth in the years ahead. And if the Vision Pro takes off, it would provide an entirely new revenue stream across both Apple’s hardware and services segments. “I don't think Apple's in any way under any existential threat right now that didn't exist before,” Deepwater Asset Management managing partner Gene Munster told Yahoo Finance. “It's just that they're participating in markets that [have] slower growth and they're looking for ways to try to juice that growth.” China is Apple’s third-largest market, generating $72.6 billion of the company’s $383.3 billion in total revenue in 2023. North America, Apple’s biggest market, generated $162.6 billion, while Europe generated $94.3 billion. All this makes reports of a slowdown in iPhone sales in China perhaps Apple’s biggest and most pressing story. A sluggish economic recovery coupled with a resurgent Huawei, which despite US sanctions has managed to put out smartphones with modern processors and features, are expected to hurt Apple’s market share in the country. According to Counterpoint Research, the iPhone maker controlled 15% of the Chinese market in Q3 2023. That was slightly better than Huawei’s 14%, but behind Vivo’s 16% and Oppo’s 19%. Analysts at Barclays, Piper Sandler, and Redburn Atlantic each pointed to the region as a potential problem for Apple with Barclays’s Tim Long saying that the firm saw “incrementally worse” iPhone 15 data out of China. He also added that he doesn’t predict any “features or upgrades that are likely to make the iPhone 16 more compelling.” Redburn Atlantic’s James Cordwell also called out China in a Jan. 10 note, saying that he remains concerned about Apple’s competitive position in the country. Piper Sandler’s Harsh Kumar and Robert Aguanno said that the deteriorating macro environment in China could weigh on Apple’s handset business. “We highlight in our outlook that China is a key swing factor for sales next year,” Aguanno told Yahoo Finance. “Any recovery in expectations for iPhone growth will be fueled by either the reemergence of the Chinese consumer along with outsized growth in other emerging markets such as India.” Apple is also contending with reports that the Department of Justice is preparing to file an antitrust lawsuit against the company. According to the New York Times, the department could file the lawsuit, which would focus on Apple’s strategic hardware and software moats, as soon as March. Critics have long called on antitrust enforcers to take action against Apple for establishing policies that prevent users from accessing apps from third-party app stores or keep device and app makers from using certain hardware features of Apple’s iPhone, such as its mobile payment technology. The European Union is also attempting to force Apple to loosen restrictions on its App Store, including allowing third-party app stores on the iPhone. The company has also set up new App Store rules in the US that allow developers to advertise third-party links for making app purchases outside of the App Store. Apple will still charge a commission on those sales but will lower the amount from 15% or 30% to 12% or 27%. That drew a sharp rebuke from longtime rivals like Spotify who say Apple’s changes don’t go far enough. Apple’s new Vision Pro AR/VR headset is also a major part of its 2024 equation. The device, which is available for preorder and hits the market Feb. 2, is a huge gamble for Apple, as it looks to enter a completely new market. With a starting price of $3,499, the Vision Pro won’t reach the kind of sales volumes as the iPhone. And while early reports say preorders have sold out, there’s no guarantee that interest in the spatial computer will remain high. “Initial sales data upon the device launch is encouraging to us but we would still be cautious about the long-term prospects for the device,” Aguanno said. “It’s too early to tell here.” That said, Apple’s long-term prospects remain strong, the analysts said. Bank of America analyst Wamsi Mohan told Yahoo Finance Live that he has a high degree of conviction that Apple will continue to move higher in the coming years. “Primarily it’s about generative AI on iPhones,” he said. “We think that’s going to be a major catalyst.” Mohan further added that he believes the Vision Pro will have long-term potential on the hardware and services fronts. Aguanno offered a similar take on the company’s future outlook, saying Apple’s market positioning and product set is solid. We’ll get our first taste of Apple’s 2024 performance when it reports its earnings on Feb. 1. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}