{
    "title": "Apple risks losing its status as the world’s most valuable company after a \nstock plunge erased a stunning $164 billion",
    "date": "1/5/2024",
    "url": "https://fortune.com/2024/01/05/apple-stock-slump-2024-most-valuable-microsoft/",
    "text": "Apple is off to its weakest start to a year since 2019, putting its long-standing status as the world’s most valuable stock by market value in jeopardy The Cupertino, California-based company has been the most valuable publicly-listed company since July 2022, but the stock has fallen sharply this year after the technology giant was hit by two ratings downgrades, with analysts flagging weak macro environment in China pressuring demand for iPhones. That has shrunk its lead over fellow technology juggernaut Microsoft Corp. — whose shares have seen a less pronounced decline to begin the year — to less than $100 billion. Apple shares are fluctuating between gains and losses in the regular trading session Friday. If the stock ends the day higher, it will snap a four-day losing streak. Still, the company has seen $164 billion in market value erased so far this year, according to data compiled by Bloomberg. While the stock has suffered bigger percentage declines in the first week of January, the losses are the biggest market value destruction at the start of any year on record. “Investors realize how rare it is to have two people go negative,” said Gene Munster, managing partner of Deepwater Asset Management. “I’ve been covering this company for a long time and I’ve never seen two downgrades before an earnings report.” Apple is also likely under pressure as investors rotate their portfolios at the start of the year. “Everybody’s selling their winners and buying losers,” said Brian Mulberry, client portfolio manager at Zacks Investment Management. “There’s a big rebalance going on.” The losses have pushed Apple’s market value down to about $2.84 trillion, nearing Microsoft’s $2.76 trillion. Shares of Microsoft are up as much as 1% Friday. The Windows software maker has benefitted from the artificial intelligence trade that has mesmerized Wall Street over the past year. The software maker is OpenAI’s largest shareholder and has invested about $13 billion into the ChatGPT parent. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}