{
    "title": null,
    "date": "1/6/2024",
    "url": "https://finance.yahoo.com/news/apples-reign-worlds-most-valuable-093000048.html",
    "text": "Apple just had its worst start to the year by one measure, as investors react to mounting pressures on the company, putting its long-standing status as the world's most valuable stock by market value in jeopardy. Shares of the technology giant fell 0.4 per cent on Friday to close at about US$181 after The New York Times reported that the US Justice Department is closer to filing an antitrust case against the company. The decline notched the fifth consecutive negative day for Apple, its longest losing streak since October. Do you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. The potential antitrust case against Apple \"would add to the plethora of problems it faces, from slowing iPhone sales to Apple Watch patent issues\", Bloomberg Intelligence analyst Anurag Rana wrote in a note. \"The suit could attack Apple's business model of tightly integrating its devices and services.\" Shoppers inside an Apple Store in Walnut Creek, California, on December 20, 2023. Apple's stock was hit by two ratings downgrades ahead of the company's December-quarter earnings report. Photo: Bloomberg alt=Shoppers inside an Apple Store in Walnut Creek, California, on December 20, 2023. Apple's stock was hit by two ratings downgrades ahead of the company's December-quarter earnings report. Photo: Bloomberg> The Cupertino, California-based company has been the world's most valuable publicly-listed company since July 2022, but has seen about US$177 billion in market value erased so far this year, according to data compiled by Bloomberg. While the stock has suffered bigger percentage declines in the first week of January, the losses are the biggest market value destruction at the start of any year on record. The downturn began earlier in the week after the technology giant was hit by two ratings downgrades, with analysts flagging a weak macro environment in China pressuring demand for iPhones. That has shrunk its lead over fellow technology juggernaut Microsoft Corp - whose shares have seen a less pronounced decline to begin the year - to less than US$100 billion. \"Investors realise how rare it is to have two people go negative,\" said Gene Munster, managing partner of Deepwater Asset Management. \"I've been covering this company for a long time and I've never seen two downgrades before an earnings report.\" Apple is also likely under pressure as investors rotate their portfolios at the start of the year. \"Everybody's selling their winners and buying losers,\" said Brian Mulberry, client portfolio manager at Zacks Investment Management. \"There's a big rebalance going on.\" The losses have pushed Apple's market value down to about US$2.8 trillion, nearing Microsoft's US$2.7 trillion. Shares of Microsoft fell less than 0.1 per cent Friday to close at about US$368. The Windows software maker has benefited from the artificial intelligence trade that has mesmerised Wall Street over the past year. The company is OpenAI's largest shareholder and has invested about US$13 billion into the ChatGPT parent. This article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2024 South China Morning Post Publishers Ltd. All rights reserved. Copyright (c) 2024. South China Morning Post Publishers Ltd. All rights reserved. Related Quotes "
}