{
    "title": null,
    "date": "1/31/2024",
    "url": "https://9to5mac.com/2024/01/31/apple-deal-qualcomm-2027-5g-modem/",
    "text": "Apple announced last year that it would extend its agreement with Qualcomm to continue using the company’s 5G modems until 2026. However, as Apple’s plans to build its own modems have been thwarted, it will continue to use Qualcomm’s modems in the iPhone until 2027 at least. The news was confirmed by Qualcomm CEO Cristiano Amon during the company’s first fiscal quarter 2024 report. According to Amon, Qualcomm will continue to license its 5G modems to Apple until March 2027. Previously, the deal had already been extended until 2026. He also told CNBC that he’s “happy with the relationship with Apple.” Apple is yet to comment on the extended deal with Qualcomm. However, the news doesn’t come as a surprise. The company has been trying to develop its own 5G modems to replace Qualcomm’s for years. In 2019, Apple acquired Intel’s modem division in a $1 billion deal. The acquisition gave Apple more than 17,000 patents and more than 2,200 Intel employees. However, all these efforts were not enough to help the Cupertino-based company. A Bloomberg report last year revealed that the development of Apple’s 5G modems has been a “frustrating journey” for the company’s engineers and executives. According to people familiar with the matter, the prototypes have failed to outperform Qualcomm’s modems in terms of performance and efficiency. The initial goal was to ship the first devices with in-house 5G modems this year. However, the two renewals of the agreement with Qualcomm suggest that Apple is far from shipping its first 5G modem. It’s worth noting that Qualcomm is also the supplier of the satellite communication module used by iPhone 14 and iPhone 15 models. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Filipe Espósito is a Brazilian tech Journalist who started covering Apple news on iHelp BR with some exclusive scoops — including the reveal of the new Apple Watch Series 5 models in titanium and ceramic. He joined 9to5Mac to share even more tech news around the world. "
}