{
    "title": "Apple Stock Jumps After Bank of America Upgrade Citing Likely AI-Related \nBoost for iPhones",
    "date": "1/18/2024",
    "url": "https://www.investopedia.com/apple-stock-jumps-after-bank-of-america-upgrade-citing-likely-ai-related-boost-for-iphones-8431769",
    "text": " Josh Edelson / AFP / Getty Images Apple (AAPL) shares jumped during intraday trading Thursday, rebounding from losses earlier in the week, after Bank of America analysts raised their price target on the stock and said that the tech giant could gain from evolving artificial intelligence (AI) technology. Bank of America upgraded Apple to buy from neutral increasing its price objective to $225 from $208. Apple shares were up 3.4% at $188.92 at around 2:30 p.m. ET Thursday. Analysts at Bank of America expect a \"stronger multi-year iPhone upgrade cycle driven by [the] need for the latest hardware to enable Generative AI features to be introduced in 2024/2025.\" Bank of America said it \"expect[s] Apple to introduce AI driven features in iOS18 with monetization through better iPhone hardware and AI enabled third party apps.\" The firm added that the Vision Pro, which is set to launch on Feb. 2, \"could surpass iPad revs over time as spatial computing takes hold offering differentiated use cases driving services upside.\" The Bank of America analysts said that investor concerns around issues such as iPhone sales in China, an Apple Watch ban in the U.S., and ongoing legal action with various courts and other companies, among other challenges, may be overshadowing the prospect of long-term growth related to AI. The analysts said that \"China weakness is largely offset by strength in other countries,\" while the \"risk around legal issues is manageable.\" They added that Bank of America \"checks suggest higher iPhone production in Dec and potentially lower in March but no aggregate material order changes.\" Bank of America. \"AI/Vision Pro; end of negative EPS est revisions; upgrade to Buy; PO to $225.\" "
}