{
    "title": "TSMC: Major Apple Risk Persists But Stock Still Investible (NYSE:TSM)",
    "date": "1/1/2024",
    "url": "https://seekingalpha.com/article/4660614-tsmc-major-apple-risk-exposed",
    "text": "Annabelle Chih/Getty Images News Annabelle Chih/Getty Images News TSMC (NYSE:TSM) is and will likely remain for years to come a prudent choice to invest in the semiconductor industry, which has been and is expected to remain a growing market over time. As a (pure play) foundry, TSMC derives its revenue from hundreds of customers, including a dozen or so major ones. However, one key risk, for what would otherwise be a relatively low-risk company with a very digestible valuation (outside of perhaps some geopolitical concerns), that is becoming increasingly apparent is the rise in competition at the leading edge, which is both the largest and fastest-growing part of the market. This could ultimately result in market share and pricing power loss, or even the (almost) complete loss of customers in the case TSMC would be unable to provide them with the technology that allows them to be successful in their own markets (i.e., loss of process leadership). My prior coverage on the stock from over half a year remains relevant (as the thesis as described there continues to play out): TSMC: Losing Leadership. Apple (AAPL), as its largest customer, has been a major contributor to TSMC's success over time. Both in terms of revenue (perhaps on the order of 20-25% of total revenue), but also as primary adopter of basically all of TSMC's latest nodes for the last decade, which the companies do partner closely. According to this source, Apple accounted for $17.5B of TSMC's 2022 revenue. However, recently, Apple Silicon lead Johny Srouji, and John Ternus, Senior VP of hardware engineering, said some quite concerning things in an interview (emphasis mine). \"We do rely on TSMC for a good part of our internal chips…It's actually very complicated. Those transistor technologies are very advanced and complicated, but I distill it down to a few principles: We always want to deliver and build the best chips on the planet for the best products. So that's the North Star. And that means we need to have access to the best tools, including the best transistor technology. So that's extremely important.\" - Srouji Srouji said Apple \"needs\" the best process technology. The issue here, for TSMC, is that it is on a quick pace to lose the leadership it inherited due to Intel's (INTC) stumbles around 10/7nm, back to Intel (around 2nm). Coincidentally, Intel also started a foundry business. Some have already speculated the prepayment Intel received to accelerate the build-out of its 18A Arizona fab even was from Apple. Although I wouldn't go that far yet, altogether these developments do mean that the Apple foundry business is right open for grabbing for anyone who can deliver to Apple what it deems is its \"North Star\". Indeed, further in the interview, he confirmed that Apple is not religious about partnering with TSMC. 8/11 Srouji said that while diversification of the supply chain is important, his first principal is key: \"where can you get the best technology and where can you get the scale.\" \"...if some foundry has that and they meet our requirements, we are always exploring - including outside of Taiwan.\" Note that while Intel is new to the foundry business, there certainly shouldn't be any concerns about scale. As a (primarily) CPU company, most of Intel's manufacturing capacity has always been on the leading edge, and given its ambitions in foundry (and growth in general), Intel has been planning and building many new fabs, including in Arizona ($30B), Ohio ($20B initially), Germany ($30B initially), and Israel ($25B). As a further recent indication of how TSMC seems to be struggling to keep up in the upcoming gate-all-around transistor era, this recent TSMC roadmap shows how the A10 node is planned for 2030. On the surface, this seems to keep up with Moore's Law, which is slowing down from a 2-year towards a 3-year cadence, and indeed this roadmap has gaps of either 2 or 3 years between nodes. TSMC TSMC However, the target for a monolithic chip with over 200B transistors just seems low/unambitious, since even on N5 (2020) there are already monolithic chips with nearly 100B transistors. Even when noting that the introduction of high-NA lithography will reduce the (maximum) size of a monolithic chip by half, it remains to be seen if TSMC can re-accelerate its rate of shrinking from the slow rate at N3/N2 (similar to Intel at its 10/7nm nodes). For example, if 100B is the goal for N2 (despite this already being possible with N3, although TSMC has disclosed that N2 would be a very minor shrink), then A10 with 200B transistors on half the area would require a 4x shrink in two nodes, which is aligned with Moore's Law. Like many (including Intel), TSMC had been expecting a recovery in H2. However, Q3 revenue was down 15% to $17.3B. EPS was $1.29, marking a 25% decline. More in general, beyond the Apple risk, the importance of leading-edge nodes is shown in that 7nm and below nodes accounted for 59% of revenue. While TSMC already has a competitor in that segment with Samsung, the added competition from Intel Foundry Services only adds further pressure, especially given TSMC's expanded margins in recent years. This has indeed been acknowledged by Pat Gelsinger, who said TSMC's margins are so high that there is ample room to undercut TSMC on pricing and still end up with a lucrative business. Note that this contrasts with some popular comments one might have read. (The (leading edge) foundry industry is definitely large enough to support a few players, but also so advanced that no more players could compete, thereby securing the overall profitability for all competitors.) So in a few years, TSMC is on a path to both lose its (foundry) process leadership, as well as potentially becoming a more expensive foundry in general. At that point, there do not seem many (if any) reasons for TSMC to maintain such a market share, resulting in the loss of pricing power as well as market share. Nevertheless, contrary to the comment just referred to, there should not be any reason to expect a race-to-the-bottom price war, since both companies are very much focused on achieving high margins. Looking forward, even the top end of Q4 guidance would still see revenue decline by about $1B, marking the fourth consecutive quarter of decline. Note that this means the surge in GAI has not benefited TSMC very much, since most of the gross margin dollars have gone to Nvidia (NVDA), with the BOM (bill of materials) for the H100 silicon (a few hundred dollars at most assuming on the order of 75 chips per wafer and a $15k per wafer) being pretty much a rounding error compared to the actual sales price (well into the 5 digits). Despite the forward-looking uncertainty in TSMC's business as described, the company on the surface is actually very investible, which remains in line with my prior analysis. This is shown by the forward P/E of just 20x, despite trading at the high end of its one-year range. One could only guess why the stock doesn't have a higher valuation. Perhaps it is the Asia/China effect that has also affected stocks such as Alibaba (BABA). Perhaps it is the Taiwan effect, in particular the China invasion risk. Perhaps it is just the actual financial performance, with investors awaiting a new upcycle. The risk of literally losing a quarter of its business, while as described seems very real, in reality likely isn't considered yet by investors. Even if it were to happen, similar to the transition from Intel to Apple silicon, this would be a multiyear process even after it started, with the start itself in the first place likely still years away. By that time, the rest of the market might have grown so much that TSMC's financials could remain quite stable compared to the current level. Overall, while at least in principle the risk of TSMC losing its biggest customer is a real one, how to factor this into the valuation is quite tricky since the actual probability is unknown. Disregarding any black swan events, TSMC is an investible stock. At this point, perhaps even more so than its new competitor Intel, as the former's valuation hasn't increased much at all yet. As trends such as GAI show, the semiconductor industry remains a long-term growing market, so investing in a leading foundry such as TSMC, which is the definite leader in terms of market share with hundreds of (major and minor) customers, would be a prudent choice for investors. Of course, as described, one possible black swan event would be the rise of new competitor Intel. In fact, there already seems to be some initial, notable activity, shown by the prepayment Intel got from an undisclosed 18A customer to accelerate the build-out of the new Arizona fabs. The possibilities here range from customers looking for an alternative supplier for at least some of their chips, to even completely losing the business for their flagship, highest volume chips as they flock toward the best technology in the market. At the end of the day, at the leading edge, the only that matters for TSMC's customers is how their chips stack up against their competitors. Using a foundry/process that is further along the Moore's Law curve to that end has been a proven strategy for decades to outcompete competitors. So ultimately, as quoted, while Apple has not made any formal announcements, it did say that it is not religious about which foundry it uses. The company is only religious to the goal of creating the best possible chips. Since TSMC losing its process leadership is getting ever more guaranteed (with Intel already delivering the 0.9 PDK of 18A to customers), this is one key risk investors will have to face as at least a possibility. Beyond just Apple, these competitive dynamics, in general, could result in loss of market share and/or pricing power, putting downward pressure on revenue and earnings, which could balance out any general market growth, of which TSMC has been a prime beneficiary in the last several years (and decades). This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of INTC either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}