{
    "title": "Apple Stock Price Outlook: Vision Pro Sales to Top 1 Million Units in 2025",
    "date": "1/30/2024",
    "url": "https://markets.businessinsider.com/news/stocks/apple-stock-price-outlook-vision-pro-sales-1-million-units-2024-1",
    "text": "       The Friday release of Vision Pro is a \"historical moment\" for Apple and represents the company's first real push into artificial intelligence, according to Wedbush analyst Dan Ives. The $3,500 headset is Apple's first new product launch since the AirPods in 2016 and Apple's first new computing gadget since the launch of the Apple Watch in 2015, and is just the beginning of the company's foray into what it's calling \"spatial computing.\" \"We believe this is just the start for this new form factor with our industry checks showing the next version of Vision Pro 2 will have much lower price points in the sub $2k area code (could be 2-3 models released) as Apple looks to push more aggressively towards its golden installed base,\" Ives wrote in a note on Tuesday. The \"golden installed base\" Ives is referring to is Apple's more than 1 billion iPhone users, and Wall Street estimates suggest that if the company could convert just 1% of its iPhone base into Vision Pro users, it would generate enough revenue to have a substantial impact on the company's bottom line. Ives increased his sales estimate of the Vision Pro to more than 600,000 units in 2024 from his prior estimate of 460,000 units. Ives also expects the Vision Pro to sell more than one million units in 2025. \"We also believe future Vision Pro models will resemble form factors that look like sunglasses over the coming years and be a much broader reach/functionality for Apple users down the road with north of 1 million Vision Pro units our initial sales bogey for FY25,\" Ives wrote. A recent report suggests Apple sold 200,000 Vision Pro units after preorders began on January 19. But for Ives, the real allure of the Vision Pro is that it will serve as a platform for Apple's artificial intelligence ambitions, which should ultimately help boost Apple's stock price to $250, representing potential upside of 30% from current levels. \"This is the first step to Apple pushing into AI and eventually a separate AI App Store we expect Apple to discuss initially as WWDC this summer. For Apple the ultimate goal in our opinion is that Vision Pro will work alongside the iPhone and other Apple devices over the coming years with many consumer AI use cases set to explode across health, fitness, sports content, and autonomous,\" Ives explained. Ives reiterated his \"Outperform\" rating on Apple stock. The company is set to release its first-quarter earnings results after the market close on Thursday. Read next Indices Commodities Currencies Stocks Jump to "
}