{
    "title": "Apple to stop selling watches with disputed blood oxygen feature again",
    "date": "1/17/2024",
    "url": "https://www.businessinsider.com/apple-to-stop-selling-watches-blood-oxygen-monitoring-feature-masimo-2024-1",
    "text": "       There's more bad news for Apple this January. The tech giant, which has been in an ongoing patent dispute with the medtech company Masimo over its smartwatches' blood oxygen feature, will have to stop selling the Series 9 and Ultra 2 watches with the monitoring functionality — again — after a US court ruling. The company had already started pulling the watches from shelves in mid-December following a decision by the International Trade Commission last year, which found that the Ultra 2 and Series 9 violated Masimo's patent. The ruling, which the Biden administration decided not to veto, bars Apple from importing the watches from outside the US. The models are and will still be available to buyers outside the US. Related stories Apple had gotten a brief respite in late December when the US Court of Appeals for the Federal Circuit granted the company's emergency request to temporarily pause the import ban from going into effect — allowing it to sell the watches again. On Wednesday, however, that court denied Apple's request for a longer pause intended to last throughout the appeal period of the ITC ban. It will now, again, have to stop selling the two watch models that feature the contentious blood oxygen function until the appeal is resolved. \"We strongly disagree with the USITC decision and resulting orders,\" Apple told Business Insider. The company has argued that the import ban will cause \"irreparable harm\" to its business. The news doesn't mean Apple won't be able to sell modified versions of the watches. It has found a software workaround for the import ban, redesigning the Series 9 and Ultra 2 to remove any blood oxygen functionality features. \"Pending the appeal, Apple is taking steps to comply with the ruling while ensuring customers have access to Apple Watch with limited disruption,\" Apple said. \"These steps include introducing a version of Apple Watch Series 9 and Apple Watch Ultra 2 in the United States without the Blood Oxygen feature. There is no impact to Apple Watch units previously purchased that include the Blood Oxygen feature.\" The redesigned watches will be available to US customers starting January 18th. Owners of the redesigned smartwatches will still see the blood oxygen monitoring icon on their watch, Apple told BI. If they tap on it, though, they'll see a message telling them the app is no longer available. The company won't be able to sell its smartwatches with the blood oxygen feature in the US, at least until its appeal of the import ban is resolved, a period that Apple expects will last at least a year. Read next Jump to "
}