{
    "title": "Apple downgrade slammed semiconductor stocks- but do you know what you're \nselling?",
    "date": "1/3/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1037401/apple-downgrade-slammed-semiconductor-stocks-but-do-you-know-what-you-re-selling-1037401.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence William kickstarted his career as a researcher and reporter for a global legal publication, covering everything from public law to M&A. Before moving to Proactive Investors, he worked as a reporter for a major fintech company with a focus on cryptocurrency and blockchain technology.\r\n\r\nHarking from Queensland, Australia, William obtained first-class honours in journalism and media from Birkbeck University before going on to complete an MA in creative and critical writing. Other jobs have... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 16:30 03 Jan 2024 GMT  A knock-on effect was felt when Barclays downgraded Apple Inc (NASDAQ:AAPL, ETR:APC) on Wednesday over perceived weakness in demand for its devices. Guilty by association, shares in Taiwan Semiconductor Manufacturing Company (TSMC), AMD and, oddly enough, Nvidia Corporation (NASDAQ:NVDA), fell during Asia and pre-market US trades. Other suppliers of semiconductor (or microchip) technology that go into Apple and competing companies’ devices felt the pinch, exposing the binds that tie the cutting-edge tech world together in the age of semiconductors. These ripple effects also show that, despite being the blocks on which modern technology is built, the semiconductor industry is a fairly cyclical one. Perhaps this is unsurprising- customers are less inclined to upgrade their smartphones, or build out their top-spec gaming rigs, when money is tight. But does the market really know what it is buying and selling? Despite being a rarified industry of only a handful of major players, not all semiconductor firms are built the same. Getting to grips with the semiconductor industry, and the key players at each step of the production cycle, can be a head spinner. One saving grace is how the semiconductor industry is effectively a layer cake of oligopolies; it’s the bedrock of modern technology, but the sector is dominated by only a handful of big players. Let’s start at the end of the production line with the foundries. A semiconductor foundry is a facility that manufactures semiconductor chips for other companies based on their designs. These foundries specialise in the complex and capital-intensive process of semiconductor fabrication, allowing companies without their own manufacturing capabilities to access advanced chip-making technologies. Clients provide the foundry with the necessary designs, and the foundry produces the chips according to these specifications. Building a single foundry can cost as much as $20 billion. Little wonder then, why only a few massive companies have notable fabrication capabilities. These include: Taiwan Semiconductor Manufacturing Company (TSMC): The titular island’s largest company, TSMC is the world’s largest, most cutting-edge semiconductor manufacturing firm, comprising dozens of plants across Taiwan, Japan and the US. TSMC is heavily subsidised by the Taiwanese government and is regarded as the purest of semiconductor plays on the global stock market. Its customers are the who’s who of global tech, including Apple Inc (NASDAQ:AAPL, ETR:APC), Nvidia Corporation (NASDAQ:NVDA), Broadcom, Sony and AMD It has a market capitalisation of 15 trillion New Taiwan dollars ($483 billion) and a price-to-earnings ratio of 14.74. TSMC commands 59% of the global foundry market. Samsung Corporation: Alongside its smartphone division, South Korean tech company Samsung is the second-largest semiconductor manufacturer globally. Though Samsung Foundry shares a similar client portfolio to TSMC, it is used for producing lower-spec chips out of its South Korean and US-based foundries. Samsung Corporation, comprising all divisions, has a market cap of 510 trillion Korean won ($390 billion) and a P/E ratio of 13.18. Samsung Foundry commands 13% of the global semiconductor market. Other major foundries: Previously a part of Advanced Micro Devices Inc (NASDAQ:AMD, ETR:AMD), US firm GlobalFoundries has 6% of the foundry industry, roughly equivalent to Chinese partially state-owned pure play Semiconductor Manufacturing International Corporation (SMIC). If foundries are the industrial workhorses, fabless chipmakers are are brains. A fabless semiconductor designer refers to a company or entity that designs and develops semiconductor chips and circuits but does not have its own semiconductor fabrication plants. Instead, they outsource the manufacturing of their designs to TSMC et al. This model allows the designer to focus on the research, development, and design aspects of semiconductor technology, without the substantial investment and resources required for manufacturing. As you’ll see, they command higher valuations and tend to be more ‘household’ names. Nvidia: The titan of fabless chipmaking, Nvidia shot to the forefront of the global tech sector following a groundbreaking year as the spearhead of artificial intelligence-focused chipmaking technology. Its chips were used to train OpenAI’s landmark ChatGPT large-language model. Thus, Nvidia, alongside Microsoft, has emerged as a top stock stock for betting on the AI sector. Nvidia designs AI-based chips for Google, Microsoft, Amazon, Cisco Systems (NASDAQ:CSCO) and Meta, to name a few. Apple notably ditched Nvidia for AMD in the 2010 and the two tech titans have a fractured relationship. Nvidia became the latest one-trillion-dollar company in 2023, and its valuation reflects that. Nvidia has a market cap of $1.19 trillion and a PE ratio of 63. Advanced Micro Devices (AMD): AMD has long played second fiddle to Nvidia in the fabless chipmaking space, though, as stated above, the Silicon Valley grandee nabbed major client Apple from Nvidia in the 2010s. However, it’s AMD’s partnership with Sony Corporation to supply graphics processors for the PlayStation 5 that put AMD in a new light. AMD chips are also used to power the latest Xbox consoles Though Nvidia’s chip designs have taken centre stage in the AI space, there’s no doubt that AMD holds its weight in the gaming side of the industry. AMD’s market cap is $224 billion, but it is ridiculously overvalued with a PE ratio of 765. Arm Holdings: The crown jewel of the British tech sector (despite snubbing London for a Nasdaq listing in 2023), Cambridge-based, Softbank-owned Arm’s semiconductor designs are found in over 99% of smartphones globally. Arm is a slightly different beast from Nvidia and AMD, in that the group licenses out its designs to other chipmakers, who then pay Arm royalties for using its designs. Whereas Nvidia’s and AMD’s chips are used primarily for graphics-intensive, parallel processing needs, Arm’s CPU designs are lower-end and more versatile, making them ideal for both low-end and high-end smartphones. Since Arm’s clients are in effect every single smartphone maker in the world, every time a smartphone is sold, Arm gets a small cut of the profits. Arm has a market cap of $70.6 billion, with an approximate PE ratio of 65. IDMs design and manufacture chips in-house. They are rarer and typically for specialised. Intel Corporation (NASDAQ:INTC): Intel is one of the few US companies with fabrication capabilities, but its expertise is significantly behind TSMC or Samsung. However, Intel stands to gain from the US government’s $53 billion CHIPS and Science Act. According to recent reports, Intel is a frontrunner in a bid to secure a multibillion-dollar funding package from the US government to construct foundries to produce cutting-edge microchips for military and intelligence applications. IInside of an Intel foundry – Credit: Intel Intel has also received a $3.2 billion grant from the government of Israel to help fund a $25 billion chip factory in the country, according to an announcement Tuesday. Intel has a market cap of $201.5 billion but was a lossmaker in 2023 due to extensive operating and R&D expenses. Texas Instruments: Dallas-based Tex Instruments is an outlier in the semiconductor space in that it designs and manufactures analogue chipsets that go into personal electronics, communications equipment and enterprise systems. Sitting at the base of the semiconductor supply chain are the providers of equipment and materials that make the sector work. This scene includes Dutch lithography monopolist ASML ($288 billion market cap, 34 PE ratio). Lithography systems are crucial for the semiconductor manufacturing process, as they use a technique called photolithography to imprint intricate circuit patterns onto silicon wafers.  ASML lithography machine – Credit: ASML ASML's machines are known for their advanced technology, including extreme ultraviolet (EUV) lithography, which allows for the creation of circuits with extremely small features, essential for producing smaller, more powerful, and energy-efficient semiconductor chips. Cadence Design Systems ($75 billion market cap, 75 PE ratio) provides software, hardware, and IP to facilitate the design and verification of semiconductors, enabling engineers to create complex chips and electronic systems more efficiently and with higher performance. Entegris Inc ($17 billion market cap, 86 PE ratio) provides critical materials handling solutions and advanced materials that are essential for manufacturing semiconductors. Entegris provides the sector with filtration solutions, speciality chemicals, fluid management systems, and advanced materials handling containers Applied Materials ($128 billion market cap, 19 PE ratio) develops equipment, services, and software that are essential for the manufacturing of semiconductor chips. Its products are used in various stages of the semiconductor fabrication process, including deposition (adding layers of material onto a silicon wafer), etching (removing materials to create circuit patterns), ion implantation (altering the material properties of the wafer), and metrology and inspection (measuring and ensuring the quality of the wafers). Though only a cursory look at the valuations of companies across the semiconductor spectrum, it is clear that the fabless entities are extremely overpriced, some in the triple digits. They tend to be priced by the market as tech companies, while major foundry TSMC is priced as a manufacturing stock. This makes sense, though both sides of the coin are subject to the same cyclical headwinds, since they ultimately service the same end customers. There is a case to be made that the semiconductor equipment manufacturers present possible value plays. Though they are still exposed to the cyclicality of the semiconductor industry, they also benefit from recurring services and repair revenues. ASML and Applied Materials are potential stocks providing exposure to the industry with less exposure to cyclical headwinds. They also benefit from being relative monopolies, which is not to say they don’t come with their own certain risks. All share prices taken 1pm UK, 3 January.\r\nP/E ratios calculated on a trailing 12-month basis\r\nMarket share statistics taken from Counterpoint Research Sign up to receive alerts and news direct to your inbox Kodal Minerals PLC (AIM:KOD) CEO Bernard Aylward joins Proactive's Stephen Gunnion with details of the latest milestones at the Bougouni lithium project in southern Mali.\r\n\r\nAylward highlighted that the project has seen significant progress following the completion of a transaction last... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}