{
    "title": "Broadcom Stock: Broad Runway In Growth Providing Apple With FBAR Chips",
    "date": "2/21/2024",
    "url": "https://seekingalpha.com/article/4672029-broadcom-broad-runway-in-growth-providing-apple-with-fbar-chips",
    "text": "Bloomberg/Bloomberg via Getty Images  Bloomberg/Bloomberg via Getty Images Broadcom (NASDAQ:AVGO) is not just an average chipmaker. From a small chipmaker previously called Avago Technologies, it transformed itself into a massive tech titan through a combination of strategic acquisitions and organic growth. Today, it dominates the BAW filter market. This is a crucial component in most leading smartphone products. Recently, it even secured a multi-year deal with Apple for its cutting-edge FBAR chips. The company is a market leader in this FBAR filter market, the predecessor to the older SAW filters. FBAR is the future of RF filters for smartphones and other devices. Broadcom potentially owns 87% of the crucial market. For the benefit of consumers, FBAR brings to the table the advantage of clearer call experiences, faster data transfer, and better battery life. Moreover, their recent Apple deal further strengthens their already market-leading dominance. Broadcom's financials are impressive. Its revenue and free cash flow are climbing steadily, year after year. Their balance sheet is pristine, and its debt profile is under control. In my opinion, the company is also 11.91% undervalued. Investors should also note that China is a major source of AVGO's revenue. Hence, despite its impressive quality of business and financial profile, should there be a significant rise in trade tension, the macroeconomic tailwind could throw a wrench in the gears of the company's progression. So, while Broadcom shines bright right now, investors should keep an eye on this potential geopolitical storm. Overall, we think this tech powerhouse still deserves a place for investors looking for visibly profitable companies with clear competitive advantages. The ticker symbol of a company usually resembles its real name. In the case of Broadcom, this is not the case. The reason is that back in 2015, Broadcom was acquired by Avago Technologies Ltd for $37B, which took on the former’s name while retaining its ticker symbol of AVGO. With this deal, Broadcom was transformed from a small chipmaker into a combined $77B company. At that time, the combined company also becomes the third-largest U.S. semiconductor maker by revenue. Today, Broadcom isn't just a chipmaker, it's a master acquirer. Their history is peppered with strategic purchases, each carefully chosen to fill a gap or expand their reach. Broadcom has a proven track record of seamlessly integrating acquired technologies, maximizing their value and strengthening their overall market position. According to Wikipedia cited earlier: At this point, year 2015, the company officially became Broadcom Ltd before becoming the present name Broadcom Inc. Today, AVGO is one of the largest 10 companies in the United States. This is after the company acquired VMWare in late November 2023, causing its market capitalization to gain about $50B, solidifying its presence in enterprise software. VMware is expected to contribute $12 billion of its total FY24 revenue, which is expected to be $50B. This is 24% of its total revenue for FY24. According to this LinkedIn article, Broadcom is already one of the leading BAW (Bulk Acoustic Wave) Filter producers in the world and commands 87% of the global market share. Within BAW filters, it is one of the leading FBAR BAW filter producers. According to IEEE Spectrum, the FBAR BAW filter is superior to the older SAW filter in the following ways: FBAR Filter (IEEE Spectrum) FBAR Filter (IEEE Spectrum) To put it simply: According to the LinkedIn article cited earlier, FBAR forms the lion's share of smartphone's RF filters: In terms of product type, FBAR BAW Filters is the largest segment, occupied for a share of about 90%, and in terms of application, Smartphones has a share about 85 percent. Recently, Broadcom signed a multiyear deal with Apple to provide the latter with FBAR chips which should further strengthen its already market-leading position: Apple said it will tap Broadcom for what are known as film bulk acoustic resonator (FBAR) chips. This is not the first time Broadcom has provided FBAR chips to major leading smartphone producers. The company, under Avago, provided these chips for most of the leading smartphone makers back in 2014: In 2014, Avago’s Wireless Communications business generated $1.69 billion in revenue, nearly doubling in size from the previous year. FBAR-related products contributed the vast majority of this revenue. Avago filters appear in the Apple iPhone 6 and Samsung Galaxy S6, as well as flagship smartphones from HTC, Huawei, LG, Xiaomi, and others. Apple has an incentive to work with US partners like Broadcom for chip supplies due to its pledge made in 2019 to invest heavily in the US after \"Congress passed a measure lowering taxes on repatriated profits for American firms\". These should benefit US-based partners of Apple, including Broadcom. In my opinion, such a partnership is expected to be also more immune to global trade tensions and protectionism. AVGO has maintained a very favourable top and bottom line for the last 5 years that is increasing almost every year, including free cash flow: Top and Bottom lines (Seeking Alpha) Top and Bottom lines (Seeking Alpha) Its operating performance has been great as well for the last 5 years. When its income is denominated by its assets, equity and invested capital, the operating ratios increase almost every year. Operating Performance Ratios (MorningStar) Operating Performance Ratios (MorningStar) Its balance sheet is pristine on most years. Balance Sheet (Seeking Alpha) Balance Sheet (Seeking Alpha) Specifically: Overall, AVGO maintained a very strong financial profile that exhibits a consistent annual trend. Given that the Fed is likely to be cutting interest rates to the benefit of company earnings, investors can expect AVGO's finances to get even better. AVGO has a very clear unlevered free cash flow that is increasing year after year. Hence, we will calculate the intrinsic value using the Discounted (Unlevered Free) Cash Flow (DCF) model. Unlevered Free Cash Flow (Seeking Alpha) Unlevered Free Cash Flow (Seeking Alpha) Free cash flow per share is increasing at a high annual average rate of 37.8% for the last 10 years. In our DCF model, we will assume AVGO can continue growing at this rate starting from the unlevered FCF of $14466.80M for the next 5 years before tapering to a terminal growth of 3%. Cash Flow Growth (Calculated by Author) Cash Flow Growth (Calculated by Author) For the discount rate, we will use the WACC of 11.17% taken from Focus Guru in our calculation: WACC (Focus Guru) WACC (Focus Guru) We will also assume the total number of shares remains unchanged. Putting the numbers together, the intrinsic value is $1393.80 per share: Intrinsic Value (Calculated by Author) Intrinsic Value (Calculated by Author) The result implies the stock is 11.91% undervalued. AVGO's business has a significant exposure to the Chinese market. Specifically, as observed from Focus Guru's breakdown, almost one-third of its revenue is derived from this region. Revenue Breakdown (Focus Guru) Revenue Breakdown (Focus Guru) The company highlighted its risk in the annual report. According to the report: Sustained uncertainty about, or worsening of, current global economic conditions and further escalation of trade tensions between the U.S. and its trading partners, especially China, and possible decoupling of the U.S. and China economies, could result in a global economic slowdown and long-term changes to global trade. Such events may also (i) cause our customers and consumers to reduce, delay or forgo technology spending, (ii) result in customers sourcing products from other suppliers not subject to such restrictions or tariffs, (iii) lead to the insolvency or consolidation of key suppliers and customers, and (iv) intensify pricing pressures. While the company has no control over the possible worsening of the US-China trade tensions, investors should factor this risk into their investment decisions. Broadcom has come a long way since its days as Avago Technologies. From a small chipmaker, it morphed into a leader in 'semiconductor and infrastructure software solutions'. In terms of market share, it dominates the BAW filter market which is the predecessor to the older SAW filter. The newer FBAR filter provides clearer call experiences, faster data transfer, and better battery life. In my opinion, their recent deal with Apple should further strengthen their already leading market share. Broadcom's financials are generally pristine, with top and bottom lines rising consistently. Their balance sheet is asset-rich and low in debt. In my opinion, the company is also undervalued, providing a margin of safety of 11.91%. There is a small risk associated with Broadcom having 1/3 of its revenue coming from the Chinese market. Investors should consider this when making any investment decisions in AVGO. Overall, despite the recent price appreciating significantly, Broadcom is still a buy for long-term investors. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}