{
    "title": "“This is wild!” – Apple VR headset in Emirates business class",
    "date": "2/7/2024",
    "url": "https://www.executivetraveller.com/news/apple-vision-pro-emirates",
    "text": "Is this the next big thing in inflight entertainment? Fast track to Star Alliance Gold Status with the HSBC Star Alliance Credit Card and unlock a world of global travel benefits. Fee, charges, min spend, and T&C's apply. Australian Credit License 232595. Apply now Video screens in business and first class are already pushing the physical boundaries of what airlines can squeeze into these plush suites, but what if you could make the entire cabin into your personal screen?\nLess than a week after the global launch of Apple’s Vision Pro ‘spatial computing’ wearable, the high-tech headset has been tested inflight on an Emirates Boeing 777 from Seattle to Dubai.\nInstead of watching movies or TV shows on a 23” screen, the entire business class cabin was transformed into a canvas above the clouds.Using Apple's Visio Pro in Emirates business class.And the reaction? “This is wild!” exclaimed Omar Shahine, a high-flying Microsoft executive who hooked his new Vision Pro up to Emirates inflight WiFi service on flight EK230.\n\"I am watching movies and browsing the Web using the entire cabin as my screen,” Shahine shared on social media platform Threads.Using Apple's Visio Pro in Emirates business class.However, when it came to audio, Shahine favoured a pair of Apple AirPods earbuds rather than the larger AirPods Max, which he said “would be super hard to use” – presumably given how the chunky Vision Pro strap wraps around the ears.\n\nAsked by a follower about inflight mode, Shahine noted “it’s usable without it.”Apple's Vision Pro headset.Clearly the earliest of early adopters, Shahine also shared some screen captures from an airport lounge at Seattle, where he tried out the Vision Pro prior to his flight with an app to display nearby airports.Using Apple's Visio Pro in an airport lounge.First unveiled by Apple in June 2023, the device went on sale on Friday February 2, and the US$3,499 price tag is actually cheaper than a one-way Emirates business class ticket from Seattle to Dubai (around US$4,300).\nApple claims some 200,000 units have already been sold during the pre-order period, with CEO Tim Cook saying the Vision Pro represents a “tentpole moment in technology” similar to other Apple products such as the iMac, iPod, iPhone, iPad and Apple Watch.A bird's eye view from the Apple Vision Pro.The Vision Pro is a triple-play into virtual reality, augmented reality and mixed reality, with Apple describing the headset as a spatial computer which allows users to enjoy content, apps, movies, TV shows, images and videos in their own virtual space.The Apple Vision Pro 'spatial computer'.\n\nUsers navigate that space with their eyes, hands, and voice: just look at an element, “tap your fingers together to select, and use the virtual keyboard or dictation to type,” Apple explains.\n“Apps can fill the space around you, beyond the boundaries of a display. They can be moved anywhere, scaled to the perfect size, react to the lighting in your room, and even cast shadows.”\nQantas briefly – very, very briefly – trialled 3D VR headsets in partnership with Samsung and Tourism NT from January 2015, with a number of Samsung’s Gear VR headsets made available to first class passengers on the Airbus A380 superjumbo as well as in the Sydney and Melbourne first class lounges.Qantas and Samsung trialled VR headsets in January 2015.The program ran for three months to “assess customer feedback on how this kind of VR offering might add to their overall travel experience on long-haul flights,” with the aim of opening up “a new world of lounge and inflight entertainment for customers, as well as give Qantas a powerful way to preview destinations and experiences” such as the Northern Territory’s Kakadu National Park.\nThe VR headsets “will transport customers to an immersive virtual world at the click of a button and showcase the sights and delights of network destinations, new Qantas products and the latest inflight blockbuster movies.”\nWhile this initiative never moved beyond its headline-catching debut, airlines are now embracing the personal technology of travellers, such streaming the audio component of inflight movies and TV shows via Bluetooth to a passenger’s own headset or earbuds... so perhaps it won’t be too long before the plane’s video library  will let you take a direct feed to your VR headset? Video screens in business and first class are already pushing the physical boundaries of what airlines can squeeze into these plush suites, but what if you could make the entire cabin into your personal screen? Less than a week after the global launch of Apple’s Vision Pro ‘spatial computing’ wearable, the high-tech headset has been tested inflight on an Emirates Boeing 777 from Seattle to Dubai. Instead of watching movies or TV shows on a 23” screen, the entire business class cabin was transformed into a canvas above the clouds. And the reaction? “This is wild!” exclaimed Omar Shahine, a high-flying Microsoft executive who hooked his new Vision Pro up to Emirates inflight WiFi service on flight EK230. \"I am watching movies and browsing the Web using the entire cabin as my screen,” Shahine shared on social media platform Threads. However, when it came to audio, Shahine favoured a pair of Apple AirPods earbuds rather than the larger AirPods Max, which he said “would be super hard to use” – presumably given how the chunky Vision Pro strap wraps around the ears. Asked by a follower about inflight mode, Shahine noted “it’s usable without it.” Clearly the earliest of early adopters, Shahine also shared some screen captures from an airport lounge at Seattle, where he tried out the Vision Pro prior to his flight with an app to display nearby airports. First unveiled by Apple in June 2023, the device went on sale on Friday February 2, and the US$3,499 price tag is actually cheaper than a one-way Emirates business class ticket from Seattle to Dubai (around US$4,300). Apple claims some 200,000 units have already been sold during the pre-order period, with CEO Tim Cook saying the Vision Pro represents a “tentpole moment in technology” similar to other Apple products such as the iMac, iPod, iPhone, iPad and Apple Watch. The Vision Pro is a triple-play into virtual reality, augmented reality and mixed reality, with Apple describing the headset as a spatial computer which allows users to enjoy content, apps, movies, TV shows, images and videos in their own virtual space. Users navigate that space with their eyes, hands, and voice: just look at an element, “tap your fingers together to select, and use the virtual keyboard or dictation to type,” Apple explains.\n“Apps can fill the space around you, beyond the boundaries of a display. They can be moved anywhere, scaled to the perfect size, react to the lighting in your room, and even cast shadows.”\nQantas briefly – very, very briefly – trialled 3D VR headsets in partnership with Samsung and Tourism NT from January 2015, with a number of Samsung’s Gear VR headsets made available to first class passengers on the Airbus A380 superjumbo as well as in the Sydney and Melbourne first class lounges.Qantas and Samsung trialled VR headsets in January 2015.The program ran for three months to “assess customer feedback on how this kind of VR offering might add to their overall travel experience on long-haul flights,” with the aim of opening up “a new world of lounge and inflight entertainment for customers, as well as give Qantas a powerful way to preview destinations and experiences” such as the Northern Territory’s Kakadu National Park.\nThe VR headsets “will transport customers to an immersive virtual world at the click of a button and showcase the sights and delights of network destinations, new Qantas products and the latest inflight blockbuster movies.”\nWhile this initiative never moved beyond its headline-catching debut, airlines are now embracing the personal technology of travellers, such streaming the audio component of inflight movies and TV shows via Bluetooth to a passenger’s own headset or earbuds... so perhaps it won’t be too long before the plane’s video library  will let you take a direct feed to your VR headset? Users navigate that space with their eyes, hands, and voice: just look at an element, “tap your fingers together to select, and use the virtual keyboard or dictation to type,” Apple explains. “Apps can fill the space around you, beyond the boundaries of a display. They can be moved anywhere, scaled to the perfect size, react to the lighting in your room, and even cast shadows.” Qantas briefly – very, very briefly – trialled 3D VR headsets in partnership with Samsung and Tourism NT from January 2015, with a number of Samsung’s Gear VR headsets made available to first class passengers on the Airbus A380 superjumbo as well as in the Sydney and Melbourne first class lounges. The program ran for three months to “assess customer feedback on how this kind of VR offering might add to their overall travel experience on long-haul flights,” with the aim of opening up “a new world of lounge and inflight entertainment for customers, as well as give Qantas a powerful way to preview destinations and experiences” such as the Northern Territory’s Kakadu National Park. The VR headsets “will transport customers to an immersive virtual world at the click of a button and showcase the sights and delights of network destinations, new Qantas products and the latest inflight blockbuster movies.” While this initiative never moved beyond its headline-catching debut, airlines are now embracing the personal technology of travellers, such streaming the audio component of inflight movies and TV shows via Bluetooth to a passenger’s own headset or earbuds... so perhaps it won’t be too long before the plane’s video library  will let you take a direct feed to your VR headset?  24 Aug 2011 Total posts 1206 If you don't get airsick, you will now!!! Qantas - Qantas Frequent Flyer 11 Oct 2014 Total posts 693 \"Is this the next big thing in inflight entertainment ?\"Not by a long shot - for several reasons:If it were, this nascent technology has had 10+ years to develop. To whit, QF adopting the Samsung VR headset for trials in first class - back in 2015 ! Airlines are technically never leaders or visionaries when it comes down to front-line or emerging technology. Just look at the glacial rate of adoption of WiFi services on both international and domestic routes worldwide. Its only in the last 2 years that the likes of DL, AA and UAL have caught up with the likes of LCC JetBlue and Southwest in the provisioning of WiFi through the USA. And that's with land-based satellite networks overhead already.For this technology to work today to all its fantastic possibilities, it would require huge amounts of investments in bandwidth / storage, at a minimum. It also requires applications which embed VR / 3D / AI into software that distinguishes itself by being innovative, interesting, of 'perceived value' or even entertainment. In that last category, the major tech firms may run into the 'gate-keepers' of the entertainment industry. That would be the likes of Warner Bros, Sony, Paramount, CBS, Vivendi, Netflix etc. Oh, and lets not forget Apple, Amazon, Google / YouTube as digital pre-cursor owners. Each would (and do) have their own philosophies to push.The Apple Headset is horrendously expensive. At USD $3,500.00 each,  US reviewers are now estimating the ownership costs for the first 12 months add an additional USD $1,000.00 to the base costs of Apple's product.Hardware - Significant existing players already in the headset market include Facebook MetaQuest 2, Microsoft (Hololens), and devices from Occulus and Amazon. Each have the ability to release a technically superior product - and at a cheaper entry price level.Certainly, streaming a pre-produced video / digital film to a headset is no longer that challenging, for passive viewing. But adding 3D / Virtual Reality / immersive 'scenarios' and options will be complex.Technically, Apple is in an awkward position here. Apple is NOT a leader in either the VR or AI fields. Look to Meta / Microsoft / Alphabet (Google) / Amazon to lead in this area. Meta has a serious commitment to the 'metaverse', Microsoft has a USD $ 70 billion commitment in terms of its recent Activision takeover and desire to be 'No. 1' in gaming, not to mention the USD $ 10 billion that MSFT has pumped into AI via its investment options. Alphabet is similarly mirroring MSFT - and both companies, along with Amazon - are the 3 leaders in 'cloud computing' and storage. Apple is clearly starting from behind here.The question is not whether \"the next big thing\" for travellers. The real questions are whether travellers see any interest in the technology, and more importantly, can the technology market leaders adopt their commercial products to serve a niche market (aircraft & travellers) at a rate that is both reclaimable and profitable.Airlines have been traditionally 'slow' to adopt digital technology. How many airlines have loaded their in-flight magazine, menu system, drinks ordering, duty-free catalogues. in-flight exercise regimens etc up online to their IFE systems ? Not a great deal.Certainly, the 'potential' is there, for this to be a leading technology. But in the airline / travel industry, the denominator will be \"at what cost\" vs. the tangible benefit ? Not by a long shot - for several reasons: If it were, this nascent technology has had 10+ years to develop. To whit, QF adopting the Samsung VR headset for trials in first class - back in 2015 ! Airlines are technically never leaders or visionaries when it comes down to front-line or emerging technology. Just look at the glacial rate of adoption of WiFi services on both international and domestic routes worldwide. Its only in the last 2 years that the likes of DL, AA and UAL have caught up with the likes of LCC JetBlue and Southwest in the provisioning of WiFi through the USA. And that's with land-based satellite networks overhead already. For this technology to work today to all its fantastic possibilities, it would require huge amounts of investments in bandwidth / storage, at a minimum. It also requires applications which embed VR / 3D / AI into software that distinguishes itself by being innovative, interesting, of 'perceived value' or even entertainment. In that last category, the major tech firms may run into the 'gate-keepers' of the entertainment industry. That would be the likes of Warner Bros, Sony, Paramount, CBS, Vivendi, Netflix etc. Oh, and lets not forget Apple, Amazon, Google / YouTube as digital pre-cursor owners. Each would (and do) have their own philosophies to push.  Airlines have been traditionally 'slow' to adopt digital technology. How many airlines have loaded their in-flight magazine, menu system, drinks ordering, duty-free catalogues. in-flight exercise regimens etc up online to their IFE systems ? Not a great deal. Certainly, the 'potential' is there, for this to be a leading technology. But in the airline / travel industry, the denominator will be \"at what cost\" vs. the tangible benefit ? Hi Guest, join in the discussion on “This is wild!” – Apple’s VR headset in Emirates business class Leave this empty: Already have an ET account? Log in below. Don't have an account? Sign up here. Signing up with Executive Traveller only takes a second and lets you\ninteract with our community. It's completely free and we'll never pass your information on to\nthird\nparties. Didn’t receive an activation email? Resend one to yourself here. Already have an Executive Traveller account? Login now. If you’ve forgotten your password, simply enter your email address\nbelow, then click 'Submit'. We’ll send you an email to re-activate your account and enter a new password. Login If you have not received the activation email, simply enter your email address below, then click 'Submit'. We’ll send you an email containing the activation link. Login  "
}