{
    "title": "US technology giant Nvidia has surpassed Alphabet and Apple in market value",
    "date": "2/16/2024",
    "url": "https://www.agenzianova.com/en/news/il-colosso-tecnologico-usa-nvidia-ha-superato-alphabet-e-apple-per-valore-di-mercato/",
    "text": "The Santa Clara, California-based company's market capitalization reached $1.830 trillion on Wednesday, surpassing Alphabet's (Google) $1.820 trillion. © Agenzia Nova - Reproduction reserved The US technology giant Nvidia, leader in the production of microchips and motherboards, continues its ride supported by its position of near monopoly in the rapidly growing sector of computation for artificial intelligence (AI). The Santa Clara, California-based company's market capitalization reached $1.830 trillion on Wednesday, surpassing Alphabet's $1.820 trillion. (Google). Nvidia had also overtaken Amazon earlier in the week, closing Tuesday with a market value higher than that of the e-commerce and cloud computing giant for the first time since 2002.   In May 2023 Nvidia was the first semiconductor company to reach a market value of $2024 trillion. Since then, the US company's shares have continued to rise thanks to Wall Street's enthusiasm for the AI ​​sector. Since the beginning of 49, the value of Nvidia shares has grown by 239 percent, after a jump of 2023 percent in XNUMX. To date, few other companies boast a market value of over one trillion dollars: these include Apple, Alphabet, Amazon and Microsoft. Read also other news on Nova News Click here and receive updates on WhatsApp Follow us on the social channels of Nova News on Facebook, Twitter, LinkedIn, Instagram, Telegram  © Agenzia Nova - Reproduction reserved © Copyright 2020-2024 Nova Agency. All rights reserved\n\nDaily news agency. Registration with the Court of Rome n. 17/2010 of 19.1.2010\nResponsible director Riccardo Bormioli. Editorial office Via Parigi 11, 00185 Rome.\ne-mail commercial@agenzianova.com - Legal, Privacy & Cookie Policies\nAdvertising dealer: Newsonline 2000 - 2024 Nova Agency. All rights reserved "
}