{
    "title": "Apple Vision Pro 'taking us way out into the future': Analyst",
    "date": "2/3/2024",
    "url": "https://finance.yahoo.com/video/apple-vision-pro-taking-us-130027812.html",
    "text": "Apple's (AAPL) highly-anticipated Vision Pro headset finally hit store shelves. It came a day after the tech giant reported first quarter results that underwhelmed investors. D.A. Davidson Managing Director Gil Luria says the Vision Pro \"changes perceptions about Apple's ability to innovate,\" an issue that has arisen given the company hasn't launched a new product category for a few years. Luria thinks the device \"will change how we do computing\" and that \"it's Apple taking us way out into the future.\" Luria also explains that future devices will likely resemble glasses more than the large headsets consumers are contending with today. In the earnings report, one sore spot for investors was Apple's China sales. On that point, Luria says there is \"very little visibility\" into China sales, describing the outlook as \"murky.\" Luria argues there are a lot of factors that figure into Apple's business in China including the country's weakening economy, the competitive handset market, and a government that can be protectionist. Watch the video above to hear what Luria has to say about advancements with the iPhone and how Apple may use generative AI. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich JULIE HYMAN: Apple's Vision Pro hitting shelves today with CEO, Tim Cook, marking the launch at the company's flagship store right here in New York City on Fifth Avenue. It is Apple's first major new category since 2015, with a price tag of nearly $3,500. This coming on the heels of earnings, of course, last night, but the stock has been edging lower, really bouncing around due to weakness in China. It is well off its lows of the day. Let's bring in Gil Luria, DA Davidson managing director, to talk more about this. Hey, Gil. Good to see you. GIL LURIA: Good to see you. JULIE HYMAN: Let's start with the Vision Pro and then we can broaden it out to the earnings. $3,500, cool product by most of the reviewers, that's what they're saying. What does this-- what does the Vision Pro do for Apple? GIL LURIA: Well, the first thing it does is it changes perceptions about Apple's ability to innovate. We haven't had a new product category in a while and this is a very big, new innovation. It will change how we do computing. Spatial computing is very different than how we do it now, how we interact with applications, how we would view what we're seeing, where the battery is, where the display is. So it's Apple taking us way out into the future. For now, at a price point that most folks can't afford, but will give at least some people a perspective on where things are headed, especially so developers can develop the new applications and tools that are more appropriate for spatial computing. JARED BILKRE: Gil, maybe I'm just reading into this personally, but I see the pictures with Tim Cook and the new headset on. He doesn't look the happiest. And you know, I go back, Jony Ive, was really never into AR and VR. I'm not sure he would have endorsed this. In fact, he left Apple before this was really developed. I'm just wondering if there's something there. If you think people inside Apple are really gung-ho about this. GIL LURIA: Well, again, the point is, this isn't what we're going to have on our head in five years. Nobody is going to have this heavy, clunky device that has an external battery and weighs a pound, and has multiple straps that needs to be adjusted. That's not what it's going to look like in five years. In five years, it's just going to be glasses. We're just going to have glasses that we can see our surroundings, we can see multiple screens, and multiple applications at once, and that's how we're going to use this device. It's not going to look like the big ski goggles that they are today. JULIE HYMAN: Gil, can we assume even as this spatial computing innovation is happening, that like the iPhone is kind innovated out, right? It's got like the-- are we going to see any more leaps of innovation in smartphones, or, with the existing technologies, of pretty much as far as it's going to go? GIL LURIA: Well, I think there's a few more opportunities for innovation. So phones can still get lighter, thinner, maybe transparent, some other handset makers make them foldable. But what would really look out for is Apple is going to introduce new generative AI capabilities, most likely in the June WWDC event and they might tie it to the next iPhone cycle. So they may make the iPhone 16 be the only handset that can run these types of applications. And if that's the case, we'll have a major upgrade cycle. The last time we had a major upgrade cycle was the iPhone 12, that was the first phone that was capable of getting on a 5G network. If they make a phone that's the first and only phone that can operate something that consumers want, such as generative capabilities, that may drive another upgrade cycle. JARED BILKRE: I've got to ask you about China because that has been a sore spot, not only for Apple, but for the entire exporting world for that matter. What do you think the future is for Apple, specifically in China? GIL LURIA: We have very little visibility, the outlook is murky because there's so many factors that contribute to performance in China. First and foremost, the Chinese consumer, the economy there is weak, the market's weak, the real estate markets weak, the sources of wealth are dissipating for that high end Chinese consumer. Then you have-- it's the most competitive handset market with a local incumbent that is very price competitive, but also has some rich features that they're introducing. And then finally, you have the government deciding how protectionist they want to be. There's reports out of China that they're not allowing government backed agencies, for people that work in those types of agencies, to have iPhones. Possibly, as a retaliation around our measures in limiting AI chips. Possibly, as part of a bigger political statement. Either way, those are things that are going to be very hard for Apple to predict. It's going to continue to be in that market. In fact, they had the highest share in China last year still with all of this, but it's going to be very hard to predict what's going to happen to that going forward. JULIE HYMAN: Gil, you mentioned AI in passing, right? And Tim Cook sort of teased that something is coming from the company on the AI front. I mean, Apple does tend to leak a little bit. Maybe we'll get a little more insight into what it might be. But I mean, do you have any theories? And I guess, three-part question. Do you have any theories? When do you think we'll learn more? And what is that going to do for Apple? GIL LURIA: Well, so it's usually not Apple that's leaking, it's their-- they have such a broad supply chain that just-- that somebody, somewhere, a vendor of Apples is usually the person who's leaking it. Apple actually tries really hard not to front run its product, just so-- because there's so much speculation. And that's what they're doing here. All we know for now is that there are uses of AI already. When we use our text to-- and they autocomplete a text, that's the use of AI. You could expect that to expand from there. But based on the resources they have and the attention they're focused on, and how important it is for their future, I would expect some things that we're not thinking about yet to come out later this year, to make the experience better, to help us summarize experiences, pre-populate messages, and possibly help more with translation, either to language or to programming, or to application maneuvering. There's a lot of things they can do. And again, they have so many resources, so many smart people working in Cupertino, that I would expect them to do something that will impress us. JULIE HYMAN: Gil, thanks so much. Appreciate it. GIL LURIA: Thank you. Related Quotes "
}