{
    "title": null,
    "date": "2/28/2024",
    "url": "https://ca.news.yahoo.com/apple-car-dead-elon-musk-040330288.html",
    "text": " Apple is reportedly scrapping its electric-car project, and Elon Musk has something to say. The Tesla chief posted a saluting-face emoji before acknowledging the challenges of building cars. \"The natural state of a car company is dead,\" Musk wrote Tuesday on X. Apple is killing its electric-car project, and Elon Musk is here to deliver a eulogy. The tech giant is pulling the plug on its decadelong electric-car project, Bloomberg reported Tuesday, citing people familiar with the matter. In response to the news, the Tesla CEO posted a saluting face and cigarette emoji in an X post on Tuesday. 🫡 🚬 https://t.co/f5wn0y95gx — Elon Musk (@elonmusk) February 27, 2024 \"The natural state of a car company is dead,\" Musk wrote in another post. Many employees involved in the car project are set to be moved to the company's artificial-intelligence division, Bloomberg said, but there could be layoffs among Apple's engineers and car designers. The iPhone maker has been working on the electric car since 2014, but the vehicle's development has been plagued by leadership changes and launch delays. Musk, of course, is no stranger to the difficulties of producing an electric vehicle. The Tesla chief has battled funding shortages and production setbacks to get his cars made. Even though Apple is a trillion-dollar tech behemoth, Musk said in 2015 that he wasn't threatened by its interest in the electric-car market. \"It's good that Apple is moving and investing in this direction. But cars are very complex compared to phones or smartwatches,\" Musk told the German newspaper Handelsblatt. \"You can't just go to a supplier like Foxconn and say: 'Build me a car.'\" Musk even referred to Apple as a \"Tesla graveyard\" in the same interview. \"If you don't make it at Tesla, you go work at Apple. I'm not kidding,\" Musk said to Handelsblatt. Representatives for Apple and Musk did not immediately respond to requests for comment from Business Insider sent outside regular business hours. Read the original article on Business Insider The Singapore-flagged Dali, which is about 984 feet long, crashed into the Francis Scott Key Bridge on Tuesday, causing it to completely collapse. BALTIMORE (AP) — A container ship rammed into a major bridge in Baltimore early Tuesday, causing it to snap and plunge into the river below. Several vehicles fell into the chilly waters, and rescuers searched for survivors. It was also not clear what caused the cargo ship to crash into the Francis Scott Key Bridge long before the busy morning commute in what one official called a “developing mass casualty event” in a major American city just outside of Washington. Two people were rescued, and it  The NHTSA recently announced recalls for 612,829 vehicles, which include Mercedes-Benz, Hyundai, Kia, and Chrysler. The standby passenger was seen taking photos of other people's boarding passes before using one of the photos to illegally board the plane, authorities said. Chase Daniel Jones, 18, was driving at 112 mph before a T-bone car crash that killed 4 people, charging documents show.  When you buy a luxury automobile with a hefty price tag of $80,000, give or take, you expect it to last. In fact, you might even expect a seamless experience, with visits to the mechanic only for... BEIJING (AP) — China filed a World Trade Organization complaint against the U.S. on Tuesday over what it says are discriminatory requirements for electric vehicles subsidies. Starting this year, U.S. car buyers are not eligible for tax credits of $3,750 to $7,500 if critical minerals or other battery components were made by Chinese, Russian, North Korean or Iranian companies. The credits are part of U.S. President Joe Biden’s signature climate legislation, named the 2022 Inflation Reduction Act. Minutes before striking the bridge's support beam, the ship's lights turn off. They then turn back on moments before the vessel crashes.  The driver and the passenger were “highly intoxicated,” Sutter County sheriff’s officials said. David Ryder/ReutersBoeing CEO Dave Calhoun will leave the company along with two other top executives, the business announced Monday, amid intense scrutiny on the aircraft manufacturer following a series of high-profile safety problems.The head of Boeing’s commercial aircraft business, Stanley Deal, is retiring immediately, while the company’s chairman, Larry Kellner, won’t seek re-election at an upcoming annual shareholder meeting. “President and CEO Dave Calhoun today announced his decision to Tractor-trailer hauling thousands of pineapples rolls over on Massachusetts highway  Japan's Toyota plans to mass-produce a battery electric Hilux pickup truck by the end of 2025, the president of its Thailand unit said on Tuesday.  The announcement comes just a few days after the Thai government said that the rival Japanese automaker Isuzu Motors said it would manufacture its battery D-MAX pickup in Thailand by 2025.  Thailand is a regional automaking hub, with pickup trucks among the vehicles produced for domestic sale and export. The driver of a vehicle that smashed last December into a St. John's residence, killing one of his passengers, has been charged with several crimes resulting from a police investigation.Rodney Constantine, 38, has been charged with impaired operation of motor vehicle causing death, among several other driving offences.The Royal Newfoundland Constabulary alleged in a news release Monday that Constantine was behind the wheel when the vehicle, carrying three passengers, struck a residence on Empire With more and more people looking for ways to minimize their impact on the planet, the auto industry has embraced the movement of producing vehicles that pollute the environment less than others and...  BANGKOK (AP) — Vietnamese automaker VinFast announced Tuesday that it plans to sell its electric vehicles in Thailand and said it had tied up with auto dealers to open showrooms in the country. VinFast, which only began exporting its EVs last year, faces stiff competition in Thailand from Chinese automakers like BYD. Tesla also recently entered the fray. All were displaying their latest models at the Bangkok International Motor Show. The Thai EV market is small but growing fast, buoyed by incent ATSUGI, Japan (Reuters) -Nissan Motor said on Monday it would launch 30 new models over the next three years and aim to raise its global sales by 1 million vehicles while cutting costs to improve profitability.  Announcing an update to its medium-term business plan, Japan's third-largest automaker by sales said it would target an operating profit margin of over 6% by end of the financial year to March 2027 and total shareholder returns of more than 30%.  Nissan was a pioneer in electric vehicles with its all-battery-powered Leaf but its EV efforts have been eclipsed by the likes of U.S. rival Tesla and Chinese leader BYD, including in the world's biggest car market, China. A subway rider was pushed onto the tracks and killed by a train, the latest in a string of violent episodes in New York City's transit system that have prompted officials to beef up policing in the subway system.  The shoving victim, who has not been identified, was pushed onto the tracks inside an East Harlem subway station shortly before 7 p.m. Monday, police said.  The suspected shover, Carlton McPherson, 24, was arrested on a murder charge, a police spokesperson said.  TOKYO (AP) — Nissan will expand its electric vehicle lineup, develop more powerful batteries and cut production costs, while speeding up the whole process, in what the Japanese automaker’s chief called “The Arc” pathway to higher sales by 2030. “The auto industry is now being forced to reshape its values so we can say continuous change is the new normal,” Chief Executive Makoto Uchida told reporters Monday, in outlining a sprawling but ambitious business plan. “Nissan must change. We cannot succ WASHINGTON (Reuters) -Shares of United Airlines closed down 3.4% on Monday after the U.S. Federal Aviation Administration (FAA) said over the weekend it was increasing its oversight of the carrier following a series of recent safety incidents.  On Saturday, the FAA said it would initiate a formal evaluation to ensure the Chicago-based airline was complying with safety regulations and said the FAA may delay future United certification projects \"based on findings from oversight.\"  Reuters reported Saturday the FAA could potentially not approve allowing customers on United's new planes or new routes. BERLIN (AP) — Germany's main railway operator and a union representing many of its train drivers have reached a deal in a long dispute over working hours and pay that was marked by a string of strikes, the union said Monday. Neither the GDL union nor state-owned railway operator Deutsche Bahn gave details of their agreement. Both scheduled separate statements on Tuesday. GDL called drivers for Deutsche Bahn out on strike repeatedly in the dispute, which has dragged on for months. It was the most "
}