{
    "title": null,
    "date": "2/4/2024",
    "url": "https://startupnews.fyi/2024/02/04/apple-says-the-eu-accounts-for-just-7-of-its-global-app-store-revenue-3/",
    "text": "Share via:  During Apple’s Q1 2024 earnings call with analysts and investors today, CEO Tim Cook and CFO Luca Maestri commented on the company’s recently-announced App Store changes in the European Union. Maestri revealed a notable statistic about the importance of Apple’s App Store business in the European Union, saying that it accounts for around 7% of Apple’s global App Store revenue.  When asked about the App Store changes in the EU and how they could impact Apple’s financials, Cook said: We announced a number of changes last week in Europe that would be in effect beginning in March, so the last month of the of the first calendar quarter of the second fiscal quarter. Those are some of the things that we announced include alternate billing opportunities, alternate app stores or marketplaces, if you will. We’re also opening NFC for new capabilities for banking and wallet apps. If you think about what we’ve done over the years, we’ve really majored in privacy, security and usability. We’ve tried our best to get as close to the past, in terms of the things that are that people love about our ecosystem, as we we can. But we’re going to fall short of providing the maximum amount that we could supply because we need to comply with the with the regulation. In terms of predicting the choices that developers and users will make, it’s very difficult to do that with precision. So, I will see what happens in in March. And CFO Luca Maestri added: As Tim said, these are changes that we’re going to be implementing in March. A lot will depend on the choices that will be made. Just to keep it in context that the changes apply to the EU market, which represents roughly seven percent of our global App Store revenue. Read our full coverage of Apple’s Q1 2024 earnings right here. FTC: We use income earning auto affiliate links. More.  We strive to uphold the highest ethical standards in all of our reporting and coverage. We StartupNews.fyi want to be transparent with our readers about any potential conflicts of interest that may arise in our work. It’s possible that some of the investors we feature may have connections to other businesses, including competitors or companies we write about. However, we want to assure our readers that this will not have any impact on the integrity or impartiality of our reporting. We are committed to delivering accurate, unbiased news and information to our audience, and we will continue to uphold our ethics and principles in all of our work. Thank you for your trust and support.  During Apple’s Q1 2024 earnings call with analysts and investors today, CEO Tim Cook and CFO Luca Maestri commented on the company’s recently-announced App Store changes in the European Union. Maestri revealed a notable statistic about the importance of Apple’s App Store business in the European Union, saying that it accounts for around 7% of Apple’s global App Store revenue.  When asked about the App Store changes in the EU and how they could impact Apple’s financials, Cook said: We announced a number of changes last week in Europe that would be in effect beginning in March, so the last month of the of the first calendar quarter of the second fiscal quarter. Those are some of the things that we announced include alternate billing opportunities, alternate app stores or marketplaces, if you will. We’re also opening NFC for new capabilities for banking and wallet apps. If you think about what we’ve done over the years, we’ve really majored in privacy, security and usability. We’ve tried our best to get as close to the past, in terms of the things that are that people love about our ecosystem, as we we can. But we’re going to fall short of providing the maximum amount that we could supply because we need to comply with the with the regulation. In terms of predicting the choices that developers and users will make, it’s very difficult to do that with precision. So, I will see what happens in in March. And CFO Luca Maestri added: As Tim said, these are changes that we’re going to be implementing in March. A lot will depend on the choices that will be made. Just to keep it in context that the changes apply to the EU market, which represents roughly seven percent of our global App Store revenue. Read our full coverage of Apple’s Q1 2024 earnings right here. FTC: We use income earning auto affiliate links. More.  We strive to uphold the highest ethical standards in all of our reporting and coverage. We StartupNews.fyi want to be transparent with our readers about any potential conflicts of interest that may arise in our work. It’s possible that some of the investors we feature may have connections to other businesses, including competitors or companies we write about. However, we want to assure our readers that this will not have any impact on the integrity or impartiality of our reporting. We are committed to delivering accurate, unbiased news and information to our audience, and we will continue to uphold our ethics and principles in all of our work. Thank you for your trust and support. Website Upgradation is going on for any glitch kindly connect at [email protected] Startup Information that matters. Get in your inbox Daily! Δ Startup Information that matters. Get in your inbox Daily! Δ © 2024 StartupNews.fyi | DOTFYI Media Ventures Private Limited. All Rights Reserved. StartupNews.fyi is India's leading news & Technology media company that focuses on Startups in India and to stories across the globe. © 2024 StartupNews.fyi | DOTFYI Media Ventures Private Limited. All Rights Reserved. "
}