{
    "title": "Acast expects short-term impact on listens from Apple update",
    "date": "2/12/2024",
    "url": "https://the-media-leader.com/acast-expects-short-term-impact-on-listens-from-apple-update/",
    "text": "Acast has reported organic net sales growth of 13% in 2023, despite a “weakened economy” affecting global advertising markets. Net sales for the year reached SEK1.64bn (£124.4m), according to its interim end-of-year report. In Q4, organic growth of 7% resulted in net sales of SEK494.2m. In its results, Acast highlighted the impact of Apple’s latest iOS 17 operating system, which changed how podcasts were automatically downloaded on iPhones. The company attributed this to the decrease in counted listens in the near term across the industry, leading Acast to make a “non-cash-flow-affecting revaluation of podcast contracts” to the tune of SEK76m in Q4. The independent podcast network recorded a 2% decline in number of listens for the year compared with 2022 at 5,019m. Average revenue per listen went up by 21% to SEK0.33. While in the short term there may be a decrease in number of listens, CEO Ross Adams had said in a previous earnings call that Apple’s update in the long term would mean “a more accurate picture of the listening frequency for each podcast, which is a positive development for the industry as a whole”. How a single iPhone update will have a big impact on podcast measurement  In the latest report, Adams said there were “early signs of improved momentum in the market” for the coming year. He added: “The work to balance tight cost control with the development of new services and tools that help advertisers and podcast creators reach a wide audience will have continued high priority for us in the coming year.” Acast reported positive adjusted EBITDA for the first time in its history in Q4. Matt Deegan, founder of Folder Media, stressed that, despite the improved Q4 performance, losses of SEK1,636.4m for the full year still amounted to “quite a chunk of change”. North America “continued to drive overall growth”, according to Acast, with net sales up 19% year on year in Q4, while net sales in Europe grew 5%, “despite the fact that several countries have been in recession with a negative impact on advertising markets”. Deegan added: “Acast has made good progress in the US, but it’s still only delivering twice what they take in Sweden. It’s their big opportunity, but they face lots of competition from other players.” Elsewhere in its 2023 results, Acast pointed to new ad products such as the AI-powered Collections+ and Performance+ tools, launched with Podchaser, that provide advertisers with increased reach and accuracy, along with options for more effective direct response podcast ad campaigns. The company also added real-time planning for its campaigns, including updated overviews of available ad inventory and pricing, and developed its self-service platform further to include host-read sponsorships. Acast CEO: podcasting will become a social medium, not audio  Receive weekly round-ups of the latest comment, opinion and media news,\n          direct to your inbox. Data-led charts from across the UK media landscape Find out more about the UK's most comprehensive aggregator of media data. "
}