{
    "title": "Apple Worker Jailed For 4 Months Due to Leaking Company Secrets",
    "date": "2/10/2024",
    "url": "https://propakistani.pk/2024/02/10/apple-worker-jailed-for-4-months-due-to-leaking-company-secrets/",
    "text": "After a prolonged legal battle, the California district court has rendered its verdict in the case involving Xiaolang Zhang, a former Apple employee. Zhang has been sentenced to four months in prison, followed by three years of supervised release, and has been ordered to pay $146,984 in damages. This legal saga began in 2018 when the FBI and Apple initiated a collaborative investigation into allegations of trade secret theft. It was uncovered that Zhang had allegedly misappropriated sensitive company information related to Project Titan, Apple’s codename for its forthcoming smart electric vehicle (EV) venture. Upon departing the United States and reestablishing himself in China, the former employee embarked on a new professional venture with XMotors, a Chinese startup specializing in autonomous vehicle technologies. It was during this period that Apple initially observed Mr. Zhang’s elusive conduct and took action. Substantial evidence detailing Zhang’s clandestine actions emerged from his network activity at Apple and his utilization of Apple devices. His role as an engineer involved in the development of multiple products under Project Titan became apparent. While employed at Apple, Zhang was involved in various projects, encompassing the design and testing of circuit boards with the capability to interpret sensor data. As the investigation unfolded, it became apparent that Zhang had illicitly acquired a multitude of files from Apple’s repositories, among them a 25-page dossier detailing the engineering schematics of a circuit board tailored for autonomous vehicles. Initially contesting the charges laid against him in 2018, Zhang subsequently reversed his plea, entering a guilty verdict in August 2022. 📢 For the latest Tech & Telecom news, videos and analysis join ProPakistani's WhatsApp Group now! Follow ProPakistani on Google News & scroll through your favourite content faster!  Shares ProPakistani is the premier and most trustworthy resource for all happenings in technology, telecom, business, sports, auto, education, real estate and entertainment news in Pakistan. \nWhether it's the top trending news, inside scoops or features, interviews, market trends and analysis, product reviews, How to's or tutorials – we cover it all. © 2024 ProPakistani.PK - All rights reserved  Follow ProPakistani to get latest news and updates.  Join the groups below to get latest news and updates. "
}