{
    "title": "Apple reveals new details about Spotify's business as possible EU fine nears",
    "date": "2/24/2024",
    "url": "https://au.finance.yahoo.com/news/apple-reveals-details-spotifys-business-223014774.html",
    "text": "With the European Commission set to rule on Spotify's complaint focused on competition in the streaming music market, there are hints that the ruling will not be in Apple's favor. This week, the Financial Times reported the EC will issue its first-ever fine against the tech giant for allegedly breaking EU law over competition in the streaming music market. The fine is expected to be around €500 million (about $539 million USD), the report noted. Instead of chalking up the fine as the cost of doing business, as a company that made history as the first to be valued at $3 trillion surely could, the tech giant is taking the fight to the public. In a statement shared with media today, Apple argued against the idea that Spotify has been harmed by any anticompetitive practices on its part. (The statement was not issued by a single spokesperson, but rather comes from Apple itself). It reads: We’re happy to support the success of all developers — including Spotify, which is the largest music streaming app in the world. Spotify pays Apple nothing for the services that have helped them build, update, and share their app with Apple users in 160 countries spanning the globe. Fundamentally, their complaint is about trying to get limitless access to all of Apple’s tools without paying anything for the value Apple provides. Apple pointed out also that Spotify has a 56% share of the market, compared with 20% for Amazon Music and Apple Music's 11%, per MIDiA's 2022 report on the subscription music market. In addition, Apple shared a number of non-public details about Spotify's business, as it pertains to Apple's platforms, including, for example, that Spotify uses thousands of Apple's APIs across 60 frameworks; that Spotify uses Apple's beta testing platform TestFlight; that Spotify has submitted over 420 versions of its app to App Review, which were approved; and even that Apple engineers have helped Spotify solve various challenges, like those impacting hardware-accelerated media playback and battery optimization. And, for those number watchers out there, Apple also said that Spotify's app had been downloaded, re-downloaded or updated more than 119 billion times across Apple devices -- a stat we had not heard before, we should note. The fact that Apple is front-running the EC's decision with its own commentary is remarkable, in and of itself. It speaks to a company that so solidly believes that it's doing the best thing for its own customers and developer partners that any sort of ruling that deems otherwise is so absurd that it demands comment and pushback. Apple believes its system of in-app purchases for things like music subscriptions saves consumers not only the headache and inconvenience of having to visit external websites on the iPhone's small screen -- they can just click the side button instead -- but also protects against fraud, excess data collection, consumer confusion over cancellations and errant purchases by children. (Of course, Apple is familiar with the latter itself.) Apple believes that Spotify only wants to increase its profits, by leveraging regulations to its advantage. In the case of the EU complaint, the concern is that Apple's App Store distorts competition in the music streaming market. It is not solely a complaint that Spotify has been harmed, in other words, but that the nature of the App Store may have thwarted other rivals. \"Spotify is a big player in the music streaming market but we don’t know what would have been the conditions without this,\" EVP and competition chief Margrethe Vestager said about the EC's investigation back in 2021. \"There are other rivals to Apple Music — there are Deezer, there are Soundcloud. Smaller competitors and here we have real concerns about their developments. This is not a Spotify case — this is a music streaming case,\" she noted. Spotify, however, has been the loudest of the Apple Music rivals and has fought against the company on other matters, for instance by calling Apple's new DMA rules \"extortion\" and a \"complete and total farce.\" To protect its interests (and, Apple argues, consumers), Apple's response to the EU's DMA (Digital Markets Act) regulation is the introduction of a new system that requires developers to pay for its services beyond just App Store payment processing. Rather, it now separates payment processing from other services by levying a \"Core Technology Fee\" for those developers who want to do business under the new DMA rules. In other words, it wants developers to pay Apple for the work it does to create and maintain its iOS platform, where apps can run, rather than acknowledging that access to consumers' favorite apps helps sell its iPhones. For the record, Apple disputes Spotify's claims that it's been harmed by any anticompetitive practices. It speaks to the success Spotify has seen over the years, having grown its streaming app over eight years from 25 million to 160 million subscribers -- a 27% average growth rate. It points out that Spotify users regularly subscribe to the service outside its app, and that Spotify qualifies for the \"Reader app\" exception to Apple's rules, which allows it to link directly to its website for account creation and payment, similar to Netflix. However, Apple seems to ignore the fact that Spotify turning a quarterly profit still makes headlines, that it just laid off 17% of its workforce, and that, you know, Spotify does face competition on iOS globally from Apple Music, which is preinstalled on iPhones, iPads and other Apple devices. In addition to being offered as a standalone service, Apple's music streaming app is upsold to customers as part of the Apple One bundles, which combine multiple Apple services, like iCloud+, News+, Apple TV+ and others, under one roof. Apple also stresses how closely Spotify has worked with the Commission on its complaint, having met with the regulators more than 65 times since the investigation began. The investigation, however, has been ongoing for years. A rep for the EC declined to comment on news related to Spotify's complaint or any pending fines. The FT had reported the fine is expected to be announced early next month. Spotify responded to Apple's statement with one of its own, saying: Spotify’s success has happened despite Apple's best efforts to gain an artificial advantage by favoring their own music service at every turn while placing roadblocks and imposing unfair restrictions on ours. Under their current rules Apple controls Spotify’s access to its own customers and gives Spotify one of two untenable options: We either have to deliver a poor user experience where we can’t directly communicate how to buy or subscribe to Spotify on iPhones or we have to accept a 30% cost disadvantage against our biggest competitor. This is not a level playing field. We support the European Commission and trust that they will take action soon to create a fair ecosystem for everyone involved. Additional reporting: Natasha Lomas; Updated 2/22/24 5:54 PM with Spotify statement. Europe charges Apple with antitrust breach, citing Spotify App Store complaint The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. The Coles shopper said they'd visited the branch 'for the thousandth time' - but was left in shock by what they said was a new protocol. Trade 24 hours a day on the world's most popular platform. Anne Hathaway covers the April issue of Vanity Fair in her most daring shoot yet featuring the actress wearing a huge black bow bodysuit with just a glove. An appalling terror attack outside Moscow is revealing the vengeful streak of Russian officialdom. Latrell Mitchell and the Rabbitohs are under immense pressure. Find out more here.  Cara Delevingne just posed naked in the new Stella McCartney campaign alongside a pile of trash and a trio of grey Falabella bags Reece Walsh has been left with a facial fracture. Read more here. Lisa Wilkinson’s husband has been dragged into the Bruce Lehrmann saga, asking the court to order the former political staffer to pay his legal costs.  It turns out \"marrying\" Lucinda Light wasn't Tim's first marriage, with it being revealed Tim had been married for seven years. Read more. Sunday night's episode finally revealed that Jono McCullough had been texting Ellie Dix behind his partner Lauren Dunn’s back. Read more. They're only as big as a deck of cards, but these boxes serve one important purpose.  The president has been going after his presumptive 2024 opponent with a little more venom than usual The mum with two young kids said she was intrigued by the plant's bizarre 'sweet-smelling' fruit. Locals say she made a dangerous error. Find out why. A social media post by the Australian embassy in Moscow has sparked opposition from Russia's government which called it an interference in its internal affairs.  A collector has revealed an easy-to-miss feature that makes these coins worth much more. Trump and his MAGA allies have been working for years to pre-rig the 2024 election. Here’s how Team Biden is planning to fight them A wet weekend is ahead for some states as a weather system that drenched the north starts to move south.  The homeowners said they had 'no idea' about the hidden feature on their property. Death in Paradise could do with making a big change introducing a new detective, and a recent star could be just the replacement we need. Police are searching for a young teenager who hasn’t been seen for nine days, as concerns for her safety grow. "
}