{
    "title": "Afterpay's Australian users have flatlined as Apple Pay continues to soar",
    "date": "2/9/2024",
    "url": "https://www.startupdaily.net/topic/fintech/afterpays-australian-users-have-flatlined-as-apple-pay-continues-to-soar/",
    "text": "10:30AM - 3:30PM 8 February. Hear from a line-up of passionate AI innovators for talks that will inspire and educate. Register now. Join us for a FREE digital masterclass where we’ll unpack the burning questions founders have around expansion, from funding to product-market fit. What are the secrets of great marketing? Join our masterclass with startups marketing guru Kayla Medica on Thursday 29 June to find out. News » Topics » Fintech » Afterpay’s Australian users have flatlined as Apple Pay continues to soar While Block-owned Afterpay saw its user base decline over the last six months Apple Pay has more than doubled its share of users in the Australian market over the last three years. Apple Pay is now used by nearly 4 million Australians (17.7% of the population) on a 12-month average. But after hitting a peak of 15.9% in June 2023, Afterpay is now used by around 3.4 million people (15.2%), falling below the 15.5% market share it had in December 2022. Afterpay launched in Australia in late 2014, just over a year before Apple Pay entered market late in 2015. Apple Pay’s market share in in December 2020 was 8%, behind Afterpay as the market leader with 11.6%, but in the last few years the buy-now-pay-later (BNPL) sector has struggled amid rising interest rates, consumer cost of living pressures and regulatory concerns, with several providers going out of business. But as impressive as Apple Pay’s growth has been, the masters of the digital payment services universe remain PayPal and BPAY, which are both used by more 40% of Australians. However, their growth has been stagnant in recent years. Australian users of digital payment services Apple Pay & Afterpay in an average 12 months Chart: Roy Morgan Single Source. Roy Morgan CEO Michele Levine said Apple Pay’s growth in recent years has outpaced any other digital payment service. “The surge in usage of Apple Pay contrasts with the stabilisation in the usage of Afterpay which has now plateaued at between 15-16% of Australians for 18 months since June 2022,” she said. “Overall awareness of ‘buy-now-pay-later’ services such as Afterpay, Zip and Klarna is high with the sector the most well-known type of digital payment service – now 18.9 million Australians (86%) say they are aware of these services. However, only 4.7 million Australians (21.2%) have used a ‘buy-now-pay-later’ service in the year to December 2023. “The usage of ‘buy-now-pay-later’ services still trails well behind more traditional digital payment services such as ‘online payment platforms’ PayPal, Visa Checkout and Masterpass.” Over 10 million Australians (45.6%) used an online payment platform in 2023.   Startup Daily has been inspiring, educating, and reporting on the Australian tech and startup community since 2012. Daily startup news and insights, delivered to your inbox. Copyright 2019 Pinstripe Media - Digital Publishing and Video Production Agency Sydney\nABOUT US / CONTACT | \nADVERTISE "
}