{
    "title": "Dow, S&P 500 Extend Rallies to Records; Nasdaq Falls",
    "date": "2/23/2024",
    "url": "https://www.tradingview.com/news/mtnewswires.com:20240223:A3085793:0-dow-s-p-500-extend-rallies-to-records-nasdaq-falls/",
    "text": "The Dow Jones Industrial Average and the S&P 500 extended rallies to records, while the Nasdaq Composite closed lower Friday. The Dow rose 0.2% to close at an all-time high of 39,131.5, while the S&P 500 climbed less than 0.1% to a record 5,088.8. The Nasdaq fell 0.3% to 15,996.8. Utilities and materials posted the biggest gains among sectors, while energy recorded the steepest decline. For the week, the Dow rose 1.3%, and the S&P 500 gained 1.7%. The Nasdaq advanced 1.4%. In company news, Nvidia's NVDA market capitalization briefly hit the $2 trillion mark for the first time intraday, putting the chipmaker only behind the likes of Apple AAPL and Microsoft MSFT as the world's most valuable companies. Late Wednesday, Nvidia posted stronger-than-expected financial results. Dominion Energy D shares rose 5% Friday, the second-biggest gain on the S&P. The company agreed to sell a 50% interest in the Coastal Virginia Offshore Wind project to alternative investment firm Stonepeak through an offshore wind partnership, according to a Thursday statement. Warner Bros. Discovery WBD recorded a wider-than-expected Q4 loss amid lower revenue in its studios and networks businesses, although the media and entertainment giant gained subscribers annually. The shares slumped 9.9%, the second-largest drop on the S&P. The US 10-year yield fell 7.5 basis points to 4.25%, while the two-year dropped 2.4 basis points to 4.69%. Recent remarks by Federal Reserve officials and the minutes of the Federal Open Market Committee's Jan. 30-31 meeting released earlier this week indicate the first interest rate cut is \"unlikely to come as early as our previous forecast of the May meeting,\" Goldman Sachs said Friday in a note. Fed Vice Chair Philip Jefferson said Thursday that the progress on inflation and an economic slowdown may allow policymakers to start cutting rates later this year, but shocks or a deviation from expectations pose some risks. Separately, Philadelphia Fed President Patrick Harker said the FOMC \"may be near the point\" where it can lower rates, though \"when we will actually arrive at that point, I cannot yet say.\" On Wednesday, the meeting minutes showed policymakers indicated last month that its benchmark lending rate was \"likely at its peak\" for the current tightening cycle, though more confidence was needed on the inflation front before pivoting to rate cuts. The next FOMC meeting is scheduled for March 19-20. West Texas Intermediate crude oil declined 2.6% to $76.56 per barrel Friday. Gold rose 0.7% to $2,046 per troy ounce, while silver added 0.8% to $22.97 per ounce. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @lewicz.michal @hiramedina @mytradingsetup @Cenobar @mytradingsetup @horibuful @fx_papi @setupstrading @olka_gadzieva GMS @globalsignals_ @TradingView @rajpalgore @mytradingsetup @neo_inversion @chartfeed @captainkolbaska @mytradingsetup @life_of_lorena.fx Whatever the trade "
}