{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.cnbc.com/2024/02/20/us-supreme-court-wont-review-apples-win-against-503-million-patent-verdict-.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article The U.S. Supreme Court on Tuesday declined to hear patent-licensing company VirnetX's bid to revive a $502.8 million jury verdict it won against Apple in a dispute over internet-security patents. The justices turned away Zephyr Cove, Nevada-based VirnetX's appeal of a lower court's decision to overturn the verdict against Cupertino, California-based Apple that had been reached by a jury in Tyler, Texas. VirnetX had challenged the U.S. Patent and Trademark Office's decisions to invalidate its patents. Apple and VirnetX have waged a 14-year-long court battle over VirnetX's internet-security patents that has included several trials and appeals. The jury awarded VirnetX $502.8 million in 2020 after a separate jury determined that Apple's iPhones and iPads infringed patents related to virtual private networks. The patent office's Patent Trial and Appeal Board allows petitioners to challenge the validity of specific patents. The process, known as inter partes review (IPR), is often used by big tech companies that are frequently targeted with patent lawsuits to contest patents they are accused of infringing. The board rejected Apple's requests to invalidate the patents under the IPR process after it found that Apple had waited too long to file its petitions. The board later declared the patents invalid based on separate requests from hedge fund Mangrove Partners in cases that Apple was allowed to join. The patent-focused U.S. Court of Appeals for the Federal Circuit upheld the decisions to invalidate the patents and overturned the verdict last year. VirnetX had told the Supreme Court that letting the rulings stand would incentivize the \"harassment\" of patent owners at the board. \"A veritable cottage industry has sprung up,\" VirnetX said. \"Entities with no discernable stake file IPR petitions challenging patents successfully asserted in litigation - only for well-heeled but time-barred infringement defendants to conveniently join the proceedings and shoulder the cost.\" VirnetX cited a patent board case in which patent office director Kathi Vidal imposed sanctions on an entity called OpenSky Industries for attempting to extort both sides in a multi-billion-dollar dispute between Intel and patent owner VLSI Technology. Vidal removed OpenSky from the case based on its misconduct, and the tribunal allowed the challenge to a VLSI patent to continue with Intel leading it. VirnetX also argued that former patent office interim director Drew Hirshfeld, who presided before Vidal was appointed, exceeded his authority by denying VirnetX's requests for director review of the decisions. Apple and Mangrove responded that VirnetX's arguments were not supported by applicable federal law. President Joe Biden's administration, representing the patent office, also urged the justices to reject the case. VirnetX previously won $440 million from Apple based on a 2016 verdict that the tech giant used its security technology in features like FaceTime video calls. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}