{
    "title": null,
    "date": "2/17/2024",
    "url": "https://9to5mac.com/2024/02/17/super-bowl-halftime-show-behind-the-scenes/",
    "text": "Following last weekend’s Apple Music Super Bowl LVIII Halftime Show with USHER, Apple has shared a new in-depth behind-the-scenes look at the making of the show. The kicker? The entire behind-the-scenes video was shot using iPhone 15. Apple says that this video was shot using over 40 iPhone 15 Pro and iPhone 15 Pro Max devices. These devices were placed throughout the show itself and rehearsals, including being strapped to performers themselves. The behind-the-scenes video was directed by Mike Carson, who said: “Choosing iPhone allowed me to have my dream amount of coverage, which was necessary for a docu-style project like this because we had to be in so many places at once. And since it is an all-in-one device, and we didn’t use any external lenses, we were able to have a multitude of angles and operators in spaces that would have proven to be both difficult and expensive, given the sheer scale needed for this film. While we had an incredibly talented crew, I truly believe it also freed us up to be able to just shoot and focus on beautiful compositions, camera movement, and storytelling, and it made shooting a lot more fun & exciting. Being able to switch lenses instantly when the moment called for either more information or a more intimate close-up allowed our team to stay focused on their frames versus having to overthink, especially in high-pressure, “think quick on your feet” scenarios. For example, we embedded camera operators into the field cast/mosh pit of the live performance, and our operators were able to literally have a camera a few feet away from guest talent’s face, creating beautiful wide angle frames, and 10 seconds later when action was happening on the main stage 50ft away, we’re able to have a high-quality medium shot instantly.” Carson also explained why the iPhone 15 Pro’s support for LOG and Pro Res recording was such a key factor for this project: “This was a game-changer, especially with so many uncontrollable lighting scenarios, given our docu-style approach. We were able to retain so much visual information and data with the amount of dynamic range we had, and Log was paramount in that. I was blown away in the color session by the final image.” Overall, Carson concluded: “Overall, it was great. As a director who also likes to be hands-on, I especially had fun being able to just pick up a camera and shoot without having to overthink about gear, and I could focus on what was in my frame and the overall story and emotion I wanted to evoke. The learning curve was small. As someone who just loves creating, regardless of scale or medium, seeing the results of what we shot has definitely inspired me to pick up iPhone and just shoot, so I’m excited to keep exploring the possibilities and embedding iPhone into my process.” Xiaolong Liu, director of photography for the behind-the-scenes video, added: “iPhones are significantly more portable and discreet compared to traditional cameras, allowing for shooting in a wider variety of locations and rigs with minimal setup. The ability to swap between lenses (Wide, Ultra Wide, Telephoto) quickly without additional equipment is an efficient advantage for schedule-intensive shooting situations. The unobtrusive nature of an iPhone can help capture more natural and spontaneous shots. The size and flexibility of iPhone allows for capturing footage from unique angles and tight spaces where traditional cameras wouldn’t fit. For example the throne shot of Usher and the piano shot of Alicia Keys.” You can find the full 11-minute behind-the-scenes video below. How long until we see an actual Super Bowl Halftime Show shot on iPhone? FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}