{
    "title": "Aerial WWII drama 'Masters of the Air' breaks records for Apple TV+",
    "date": "2/19/2024",
    "url": "https://9to5mac.com/2024/02/19/aerial-wwii-drama-masters-of-the-air-breaks-records-for-apple-tv/",
    "text": "The new limited series Masters of the Air, the highly-anticipated sequel to the Band of Brothers and The Pacific franchise, is setting records for Apple TV+. The streamer told Variety that the show received more viewers in its debut weekend than any original premiere to date, beating previous heavyweights like The Morning Show and Hijack. And it’s having a halo effect on Apple’s programming worldwide. The company says viewership of the entire Apple TV+ platform — in the seven days since Masters of the Air debuted on January 26 — increased 65%. And since then, the company has maintained double digit growth in more than 100 countries. The 9-part limited series, currently rolling out weekly every Friday, cost in the range of $250-300 million to make thanks to an expansive cast led by Austin Butler and Callum Taylor, richly-detailed sets, full-size models of meticulously-crafted B17 planes, and epic visual effects to bring the story to life. Although Apple does not release firm viewing figures or subscriber counts for TV+, the vague tidbits it has shared today indicate the series was worth the investment. Masters of the Air hails from executive producers Steven Spielberg, Tom Hanks and Gary Goetzman, with Band of Brothers heritage throughout the production staff. All nine episodes are written by John Orloff. Masters of the Air is streaming now with a new episode every Friday. The finale will drop on March 15. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Apple TV is Apple's streaming device that access… Benjamin develops iOS apps professionally and covers Apple news and rumors for 9to5Mac. Listen to Benjamin, every week, on the Happy Hour podcast. Check out his personal blog. Message Benjamin over email or Twitter. The easiest way to get into HomeKit and Apple smart home tech. Great for gifts. Inexpensive, fast, wireless charger for iPhone. "
}