{
    "title": "Masked California thief nabbed after being caught on video snatching dozens \nof iPhones from Apple Store",
    "date": "2/8/2024",
    "url": "https://www.foxbusiness.com/retail/masked-california-thief-nabbed-being-caught-video-snatching-dozens-iphones-apple-store",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy A thief was filmed stuffing dozens of iPhones into his pockets inside an Apple Store in Emeryville, California. (@bustdowncorn/LOCAL NEWS X /TMX) A California man was arrested on Wednesday night in connection with a theft from an Apple Store in Berkeley, in which he is allegedly seen on video snatching display devices before walking past a police vehicle and walking to a getaway car. Emeryville Police Department detectives arrested 22-year-old Tyler Mims of Berkeley for his involvement in the theft, and charged him with burglary, grand theft and other crimes. On Monday, officers with the department were dispatched to the scene after a caller reported the crime and said the suspect fled with 50 iPhones, with a total value of $49,230. A masked man, later alleged to be Mims, was wearing all black clothing and seen in the video going from table to table at about 10:30 a.m. on Feb. 5, 2024, ripping phones from their display and placing them into his pockets. MASKED CALIFORNIA THIEF CAUGHT ON VIDEO BRAZENLY TAKING DOZENS OF IPHONES FROM APPLE STORE The Emeryville, California police department arrested an individual for allegedly stealing nearly $50,000 worth of iPhones from an Apple Store. (@bustdowncorn/LOCAL NEWS X /TMX / Fox News) During the nearly 45-second video, the thief takes dozens of phones, which cost hundreds of dollars each. Witnesses stood by and watched, and the person recording the video followed closely behind the individual as he exited the store and brushed against a police cruiser before getting into a black Hyundai. The video made the rounds on social media the next day. Since Jan. 19, the department has responded to four grand thefts from the Apple Store in town. After the first incident, detectives began working with nearby agencies with similar thefts, identifying the thefts as organized retail crimes. WISCONSIN MAN ARRESTED FOR ALLEGEDLY STEALING OVER $90K IN CALCULATORS FROM TARGET STORES ACROSS THE US The Emeryville, California police department arrested an individual for allegedly stealing nearly $50,000 worth of iPhones from an Apple Store. (@bustdowncorn/LOCAL NEWS X /TMX / Fox News) The department announced Thursday that on Wednesday night, a joint collaboration between its detectives and the Berkeley Police Department and California Highway Patrol resulted in three arrests associated with a theft at the Apple Store in Berkeley that happened earlier that morning. Mims was one of the individuals arrested, police said, and was the person depicted in the video from the Emeryville Apple Store. FORMER APPLE CEO COMPARES THIS 'EXTRAORDINARY' NEW PRODUCT TO THE INVENTION OF THE IPHONE An Apple corporate logo hangs above the front door of their store in the Garden State Plaza Mall on November 4, 2023, in Paramus, New Jersey  (Gary Hershorn/Getty Images / Getty Images) Mims was booked into jail and charged with three counts each of conspiracy to commit a crime, burglary, grand theft and organized retail theft. CLICK HERE TO GET THE FOX NEWS APP The video garnered more than 10 million views on TikTok and X, in total, as of Thursday morning. According to the E’Ville Eye, the Apple Store in the video was closed for several months last year but reopened in January. FOX Business' Lawrence Richard contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}