{
    "title": "Rivian gets another Apple Car veteran ahead of R2 launch",
    "date": "1/28/2024",
    "url": "https://www.teslarati.com/rivian-apple-car-r2-launch/",
    "text": "Another longtime Apple veteran who helped with the company’s electric vehicle (EV) program has left for Rivian, ahead of the automaker’s next-generation vehicle launch. Teslarati reported on the departure of Jonas Reinke, former Apple Head of Product, Mobility and Automotive Services, last week. Now, VP of Engineering DJ Novotney has also left Apple for Rivian, set to become senior VP of Vehicle Programs at the EV pickup and SUV maker, according to people familiar with the matter in a report from Bloomberg on Sunday. The sources, who requested to remain anonymous, said that Novotney will start on Monday, reporting directly to Rivian CEO RJ Scaringe. He will also join Rivian ahead of the highly anticipated R2 launch, after working at Apple for almost 25 years, according to his LinkedIn page. The Apple veteran also detailed his departure in a memo to colleagues: Great products are what we do best and I have been so very lucky along the way to be part of so many amazing teams that developed everything from iPod, iPhone, iPad, Watch and so many more. Apple has been my life, but now is the time for me to move on and help bring to life a new set of products. Apple and Rivian spokespersons declined to comment on the matter , and Novotney did not respond to Bloomberg’s request for comment as of writing. At Apple, Novotney worked on home devices and the long-rumored Apple Car project, which is now expected to launch in 2028 with fewer features than previously planned, after being delayed to 2026 a couple of years ago. He also worked on some robotics and artificial intelligence (AI) projects developing future home products, after being tapped by former Apple hardware chief Dan Riccio to lead iPad development. Reinke, who will become VP of Product Management at Rivian, previously worked at both Apple and Porsche, and will also help play a major role in launching the R2 and R3 platforms, according to a recent statement from Scaringe. Last June, Rivian also hired former Apple, Tesla, and Meta alumnus Sarah O’Brien as the company’s Chief Communications Officer. Recent reports have also said that Apple will tone down its plans for autonomy in the vehicle, while another source in September said that the EV project had “lost all visibility.” Rivian speculated to unveil the R2 SUV by March 2024  What are your thoughts? Let me know at zach@teslarati.com, find me on X at @zacharyvisconti, or send your tips to us at tips@teslarati.com. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... Tesla Summon and Autopark are set to gain major improvements next month, according to... Tesla appears to be ready to roll out wireless EV charging, according to the... Hertz CEO Stephen Scherr has decided to step down following the rental firm’s big... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Copyright © TESLARATI. All rights reserved. "
}