{
    "title": "Apple stock wipes $200 billion in two days; How far will AAPL crash?",
    "date": "1/3/2024",
    "url": "https://finbold.com/apple-stock-wipes-200-billion-in-two-days-how-far-will-aapl-crash/",
    "text": "In the familiar narrative of recent years, Apple (NASDAQ: AAPL) stock continued its impressive streak with another robust performance throughout 2023. Boasting a year-to-date gain exceeding 50%, AAPL outpaced the broader market, buoyed by the flourishing artificial intelligence (AI) sector and improving macroeconomic conditions, fostering heightened investor enthusiasm. However, as the calendar turned to 2024, the tech giant witnessed a sharp pullback, erasing over $200 billion in market capitalization within less than two trading days, according to data retrieved on January 3. The primary catalyst behind Apple’s latest setback is a stock downgrade by a prominent Wall Street firm. Notably, Barclays analysts led by Tim Long demoted AAPL stock to Underweight (Sell) on Tuesday, from Equal Weight (Neutral). In addition, the analyst slashed the 12-month price target to $160 from $161, implying a downside risk of more than 16% from the December 29 closing price. According to the expert, Apple’s shares overperformed in 2023 while the company posted four consecutive quarters of sales declines. Among the primary concerns noted by Long were “lackluster” sales of Apple’s iPhone 15, its single-biggest revenue driver. Moreover, the upcoming 16 faces a similarly gloomy outlook, the analyst wrote. “We expect reversion after a year when most quarters were missed and the stock outperformed.” Long and his team of analysts also expect weak demand for Apple’s other hardware offerings, while revenue growth in its lucrative services unit is not anticipated to exceed 10% this year. At press time, shares of Apple were down roughly 1% at $183.76, the lowest since mid-November. Since December 29, the last trading day of 2023, the stock fell more than 4.5%, erasing over $200 billion off its market capitalization. At the current level, AAPL stock is trading above a crucial confluence support zone formed by 100-day and 200-day moving averages (MAs) at $182.31 and $179.78, respectively. Losing this area would pave the way for Apple to fall toward the next support area between $173.5 and $172. On the upside, the stock faces near-term resistances at $186.6 and $190, indicating areas where selling pressure may increase. Buy stocks now with Interactive Brokers – the most advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}