{
    "title": "Apple veteran who started the Apple Car project leaves Cupertino for rival \nEV carmaker Rivian",
    "date": "1/29/2024",
    "url": "https://www.firstpost.com/tech/apple-veteran-who-started-the-apple-car-project-leaves-cupertino-for-rival-ev-carmaker-rivian-13665122.html",
    "text": "One of Apple’s EV project’s key executive, DJ Novotney, is leaving the company to join rival EV maker Rivian. Novotney played a crucial role in the development of iconic Apple products, including the iPod, iPhone, iPad, and the Apple Watch It seems that Apple is not able to stop the talent drain from their Apple Car project no matter what they try. In a significant departure from Apple’s halo project that is yet to produce a working prototype for the public, DJ Novotney, a seasoned veteran with nearly 25 years at the tech giant, is set to join Rivian Automotive Inc. as the Senior Vice President of Vehicle Programs. This departure marks another in a series of high-profile exits from Apple’s Apple Car division, following a trend of senior executives leaving the company in recent years. Novotney, formerly Apple’s Vice President of Hardware Engineering, played a crucial role in the development of iconic Apple products, including the iPod, iPhone, and iPad. He is also said to have started the development of the Apple Car. His departure was communicated to colleagues on Friday, as he moves on to assume a key leadership position at Rivian, a company known for its electric SUVs and pickup trucks. In his new role, Novotney will report directly to Rivian’s CEO, RJ Scaringe. Having contributed significantly to Apple’s hardware engineering endeavours, Novotney also had a hand in the launch of the Apple Watch and was part of the initial team tasked with kick-starting Apple’s foray into electric vehicles about a decade ago, under the codename Project Titan. In a memo to colleagues obtained by Bloomberg, Novotney expressed gratitude for his time at Apple, stating, “Apple has been my life, but now is the time for me to move on and help bring to life a new set of products.” Rivian, headquartered in Irvine, California, views Novotney’s recruitment as a major accomplishment. Starting his role on Monday, Novotney is expected to be a crucial player in leading product management for products and engineering, reinforcing his status as one of Rivian’s top executives. This latest move follows a string of exits from Apple’s senior ranks, including Tang Tan, Vice President of Product Design for the iPhone and Apple Watch, and hardware technologies leader Steve Hotelling. Meanwhile, Rivian positions itself as a formidable contender in the electric vehicle market, competing with the likes of industry leader Tesla Inc., as it continues to expand its product lineup and solidify its presence in the rapidly evolving electric vehicle sector. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}