{
    "title": "Apple's Ultra-Pricey Vision Pro Sets U.S. Launch Date",
    "date": "1/8/2024",
    "url": "https://ca.sports.yahoo.com/news/apple-ultra-pricey-vision-pro-144840139.html",
    "text": "Apple’s ultra-high-end gadget, the Vision Pro, will be available online and at U.S. Apple Stores starting February 2, the company has announced. The $3,500 virtual reality device was unveiled last year, taking up a large portion of the company’s annual September tubthump for new products and technology. More from Deadline Disney And Apple Shareholders Will Get The Chance To Vote On AI Proposals After SEC Rebuffs Company Efforts To Table The Issue Jon Hamm To Star In 'Your Friends and Neighbors' Series For Apple From Jonathan Tropper David & Jessica Oyelowo's Yoruba Saxon Strikes First-Look Deal With Apple TV+ While sales of VR headsets have generally been sluggish across the industry in recent years, Apple has made the claim that its take is wholly unique. The Vision Pro’s main lens adjusts to lighting and user preference, so it can be worn for longer periods, with the user able to interact with other people, the company maintains. It is controlled by eyes, hands and voice, via a newly customized operating system. In addition to lean-forward activities like videoconferencing, the Vision Pro also features games, movies and series, including titles from Disney+ and Max. About 250 games will be available at launch from Apple Arcade, including several titles designed for the Vision Pro. The device uses Apple Immersive Video, which presents films and series in 3-D 8K wrapping 180 degrees around the viewer, with Spatial Audio. Pre-orders will be taken starting January 19. The sticker shock of the Vision Pro’s price will be a new test of Apple’s grip on consumers. Sales of the company’s flagship iPhone have faltered in recent months, leading to downgrades of Apple stock by a few Wall Street analysts. Some skeptics have pointed to a Big Tech rival, Meta Platforms, which has pivoted toward virtual reality and even renamed itself from Facebook without much initial success. The counter-argument has been that Apple is in a unique position to entice more people to engage with VR, and that the $3,500 price point will come down as demand rises, making it more feasible for the Vision Pro to gain wider adoption. Apple even eschews the term virtual reality, referring instead to the concept of “spatial computing.” Best of Deadline 'Joker: Folie à Deux' Photos: All The Images Of Joaquin Phoenix And Lady Gaga Hollywood & Media Deaths In 2024: Photo Gallery & Obituaries 2024 Premiere Dates For New & Returning Series On Broadcast, Cable & Streaming Sign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram. The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein  Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises.  Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr.,  The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach “The Daily Show” host tears into the former president’s claim ― and shows why the case matters.  As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit. New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. The Ohio lawmaker was asked about Donald Trump’s debunked claims about the 2020 election.  Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Anne Hathaway told Vanity Fair during a cover story interview that Christopher Nolan more or less saved her career when public opinion turned against her in the lead up to and the aftermath of her winning the Oscar for “Les Miserables.” Hathaway was widely mocked online at this time, and she once remembered googling herself … The president has been going after his presumptive 2024 opponent with a little more venom than usual  President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… The rapper was caught off guard when her \"whole boob\" fell out of her top on stage MSNBCThe stars of MSNBC’s Morning Joe kicked off Monday by adding their voices to the growing chorus of NBC News journalists and on-air personalities publicly chastising the media company for hiring former Republican National Committee chairwoman Ronna McDaniel as a network pundit.“I know you won’t be surprised to know that we’ve been inundated with calls this weekend, as have most people connected with this network about NBC’s decision to hire her,” co-host Joe Scarborough declared at the top o "
}