{
    "title": "iPhone users on alert! Reports indicate data breaches through in-app ads \nand push notifications | Mint",
    "date": "1/26/2024",
    "url": "https://www.livemint.com/technology/iphone-users-on-alert-reports-indicate-data-breaches-through-in-app-ads-and-push-notifications-11706252499809.html",
    "text": "In a shocking revelation, reports have emerged suggesting that iPhone users may be at risk of having their data and activities spied on through in-app ads and push notifications. A recent 9to5Mac report highlights that certain in-app ads are being exploited to gather sensitive information from iPhone users, which is then allegedly sent to security services, as reported by 404media. Another report claims that popular apps such as Facebook, TikTok, FB Messenger, Instagram, Threads, and others are utilizing a vulnerability in push notification services to collect user data without their knowledge. It's worth noting that Apple had previously taken steps to enhance user privacy by requiring companies to seek explicit permission before tracking users. However, some app providers reportedly sought alternative methods to bypass these restrictions, leading to the adoption of the controversial \"device fingerprinting\" technique. Security researchers at Mysk shed light on how certain iPhone features are exploited for spying purposes. Many apps, according to Mysk, utilize this opportunity to quietly send detailed device information in the background. The information gathered includes system uptime, locale, keyboard language, available memory, battery status, device model, and more. Responding to these security concerns, Apple announced forthcoming measures to address the misuse of push notifications. Starting from Spring 2024, developers will be required to declare the reasons for using APIs that provide unique device signals commonly used for fingerprinting. The report adds that California based tech giant Google, in its response, disclosed that it has severed ties with a company employing the device fingerprinting technique to track users. Both Apple and Google seem committed to addressing the issue and safeguarding user data. As users await the implementation of these new rules and measures, the reports underscore the ongoing challenges tech companies face in balancing user privacy with the functionalities of third-party apps on their platforms. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}