{
    "title": "18 High Growth Low PE Stocks",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/news/18-high-growth-low-pe-091635841.html",
    "text": "In this article, we will take a detailed look at the 18 High Growth Low PE Stocks. For a quick overview of such stocks, read our article 5 High Growth Low PE Stocks. When value stocks came back with a vengeance in 2022, value investors cheered what they thought was the beginning of a long bull run of value stocks. But thanks to the AI boom, growth stocks rebounded in 2023. In a ten-year period ending 2021, the Russell Growth 1000 Index doubled the performance of the Russell 1000 Value Index. The so-called 'value investing' strategy has taken a hit amid an unending growth of technology stocks. But over the years the traditional boundaries between value and growth investing have faded. In fact, successful investors like Warren Buffett have long been saying that differentiating between value and growth does not make sense as they see growth a part of the broader value investing philosophy. Warren Buffett once said: \"There is no such thing as growth stocks or value stocks as Wall Street generally portrays them, as contrasting asset classes. Growth is part of the value equation.” There was a time Buffett stayed away from tech stocks like Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA) saying he did not understand business models of these companies. But today he has huge stakes in some of the top tech companies in the US. Relying totally on PE ratios without paying attention to fundamentals and growth of companies is also not useful. For example, Oakmark in its September 2023 report on Value Vs Growth said the following which shows the importance of paying attention to both value multiples and growth metrics before making investment decisions: \"When we compare the 50 lowest ranked companies by P/E ratio on the S&P 500 today to the ones that made that list in previous periods, we don’t observe any decline in business quality. Therefore, considering both the relatively high price of the higher P/E companies and the solid business quality of the lower P/E companies—we believe that low P/E stocks today present a better hunting ground than they normally do. Last year we bought depressed stocks of high- growth businesses, such as Uber, at a double-digit free cash flow yield; Workday at a low price relative to sales; and Adobe at only a slightly higher than average P/E ratio. This year, after strong outperformance, we sold them and bought much lower P/E stocks. Here’s a fun way to think of it: In 2022, we bought a share of Adobe for about three shares of CVS Health. (CVS was just under $100 and Adobe under $300). This year we sold Adobe to buy more than six shares of CVS. (Adobe increased to well over $400 and CVS fell to $70.) We thought Adobe was cheap when we bought it, despite it being a high-growth business, and that CVS was fully priced when we sold it, despite it having a below-average P/E ratio.\" Photo by Kaleidico on Unsplash Methodology For this article we first used a stock screener to identify stocks with PE ratios less than 15 and high revenue growth (over 25%) over the past five years and also in the most recent quarters. From these stocks we selected 18 companies with the highest number of hedge fund investors. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator. Number of Hedge Fund Investors: 16 White Mountains Insurance Group Ltd (NYSE:WTM) shares have gained about 4% over the past 12 months. In November White Mountains Insurance Group Ltd (NYSE:WTM) posted Q3 results. Revenue in the quarter increased by about 35.6% year over year. As of the end of the third quarter of 2023, 16 hedge funds out of the 910 funds in Insider Monkey’s database had stakes in White Mountains Insurance Group Ltd (NYSE:WTM). The biggest stakeholder of White Mountains Insurance Group Ltd (NYSE:WTM) is Scott Wallace’s Wallace Capital Management which owns a $123 million stake in White Mountains Insurance Group Ltd (NYSE:WTM). Number of Hedge Fund Investors: 16 Golub Capital BDC Inc (NASDAQ:GBDC) has a dividend yield of over 9%, which is making it an attractive stock to investors in the current environment. As of the end of the third quarter of 2023, 16 hedge funds out of the 910 funds in Insider Monkey’s database had stakes in Golub Capital BDC Inc (NASDAQ:GBDC). The biggest stakeholder of Golub Capital BDC Inc (NASDAQ:GBDC) was Israel Englander’s Millennium Management which owns a $23 million stake in Golub Capital BDC Inc (NASDAQ:GBDC). Number of Hedge Fund Investors: 17 Arcturus Therapeutics Holdings Inc (NASDAQ:ARCT) ranks 16th in our list of the best high-growth low-PE stocks to buy according to hedge funds. During the third quarter Arcturus Therapeutics Holdings Inc’s (NASDAQ:ARCT) revenue jumped by about 237% year over year. Last month, Canaccord Genuity started covering the stock with a Buy rating, citing Arcturus Therapeutics Holdings Inc’s (NASDAQ:ARCT) cystic fibrosis drug candidate and recently approved COVID-19 vaccine. A total of 17 hedge funds in Insider Monkey’s database had stakes in Arcturus Therapeutics Holdings Inc (NASDAQ:ARCT) as of the end of the September quarter. Number of Hedge Fund Investors: 18 Earlier this month, Morgan Stanley upgraded Futu Holdings Ltd (NASDAQ:FUTU) to Equal-Weight from Underweight. Morgan Stanley’s analyst said Futu Holdings Ltd’s (NASDAQ:FUTU) risk reward is attractive amid strong numbers from Japan. Digital financial services company Futu Holdings Ltd (NASDAQ:FUTU) shares were spotted in 18 hedge fund portfolios as of the end of the third quarter of 2023. The most notable stakeholder of Futu Holdings Ltd (NASDAQ:FUTU) during this period was Paul Marshall and Ian Wace’s Marshall Wace LLP which owns a $54 million stake in Futu Holdings Ltd (NASDAQ:FUTU). Number of Hedge Fund Investors: 18 Residential lot development company Forestar Group Inc (NYSE:FOR) shares have gained by about 112% over the past one year. In November Forestar Group Inc (NYSE:FOR) posted fiscal fourth quarter results. Revenue in the quarter jumped 44.1% year over year to $549.7 million, surpassing estimates by $160 million. As of the end of the third quarter of 2023, 18 hedge funds out of the 910 funds tracked by Insider Monkey had stakes in Forestar Group Inc (NYSE:FOR). The most significant stake in Forestar Group Inc (NYSE:FOR) is owned by John Khoury’s Long Pond Capital which owns a $47 million stake in Forestar Group Inc (NYSE:FOR). In addition to Forestar, hedge funds are super bullish on Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Number of Hedge Fund Investors: 19 Budget airline company Ryanair Holdings plc (NASDAQ:RYAAY) in November posted results for the first half of fiscal year. Revenue in the period jumped 29.6% year over year to €8.58 billion. A total of 19 hedge funds tracked by Insider Monkey reported owning stakes in Ryanair Holdings plc (NASDAQ:RYAAY). The most significant stake in Ryanair Holdings plc (NASDAQ:RYAAY) is owned by Natixis Global Asset Management’s Harris Associates which owns a $704 million stake in Ryanair Holdings plc (NASDAQ:RYAAY). Number of Hedge Fund Investors: 19 Florida-based banking company  SouthState Corp (NYSE:SSB) ranks 12th in our list of the stocks with high growth and low PE ratios. As of the end of the third quarter, 19 hedge funds out of the 910 funds in Insider Monkey’s database had stakes in  SouthState Corp (NYSE:SSB). The biggest hedge fund stakeholder of  SouthState Corp (NYSE:SSB) was Ken Fisher’s Fisher Asset Management which owns a $61 million stake in  SouthState Corp (NYSE:SSB). Hedge funds are also loading up on Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Number of Hedge Fund Investors: 20 During 2021, Old National Bancorp’s (NASDAQ:ONB) revenue came in at about $811 million, while in 2022 Old National Bancorp’s (NASDAQ:ONB) revenue stood at $1.73 billion. During the past 12 months Old National Bancorp’s (NASDAQ:ONB) revenue is $1.9 billion. The stock’s PE ratio as of January 8 is 7.69. Number of Hedge Fund Investors: 20 Biotech company Zymeworks Inc (NASDAQ:ZYME) ranks tenth in our list of the best high-growth low-PE stocks to buy according to smart money investors. During the third quarter Zymeworks Inc’s (NASDAQ:ZYME) revenue increased by about 535% on a YoY basis. Number of Hedge Fund Investors: 22 Veritex Holdings Inc (NASDAQ:VBTX) revenue for the 12 months ending December 31, 2021 was $333.43 million, while at the end of 2022 its annual revenue stood at $423 million. The bank holding company shares were spotted in 22 hedge fund portfolios as of the end of the third quarter of 2023, The most notable stakeholder of Veritex Holdings Inc (NASDAQ:VBTX) was Phil Stone’s Fourthstone LLC which owns a $4.4 million stake in Veritex Holdings Inc (NASDAQ:VBTX). Number of Hedge Fund Investors: 24 Canadian energy company Baytex Energy Corp (NYSE:BTE) ranks eighth in our list of the best high-growth low-PE stocks to buy according to smart money investors. A total of 24 hedge funds in Insider Monkey’s database of funds reported having stakes in Baytex Energy Corp (NYSE:BTE). The biggest stakeholder of Baytex Energy Corp (NYSE:BTE) was Israel Englander’s Millennium Management which owns a $41 million stake in Baytex Energy Corp (NYSE:BTE). Number of Hedge Fund Investors: 24 Oil and gas exploration company Par Pacific Holdings Inc (NYSE:PARR) shares have gained about 54% over the past one year. Yet the stock’s PE ratio as of January 8 is 4.05. In November Par Pacific Holdings Inc (NYSE:PARR) posted third quarter results.  Revenue in the quarter jumped 24.3% year over year. Number of Hedge Fund Investors: 24 Ranking sixth in our list of the best high-growth low-PE stocks is Harmony Biosciences Holdings Inc (NASDAQ:HRMY), which saw a 36.8% revenue growth during the third quarter on a year-over-year basis. A total of 24 hedge funds tracked by Insider Monkey had stakes in Harmony Biosciences Holdings Inc (NASDAQ:HRMY).  Click to continue reading and see the 5 High Growth Low PE Stocks.  Suggested Articles: 11 High Growth Low Debt Stocks to Buy 12 High Growth International Stocks to Buy 13 High Growth Healthcare Stocks to Buy Disclosure. None. 18 High Growth Low PE Stocks was initially published on Insider Monkey. Related Quotes "
}