{
    "title": null,
    "date": "1/31/2024",
    "url": "https://techcrunch.com/2024/01/31/match-group-says-it-hasnt-yet-decided-if-it-will-opt-into-apples-new-dma-rules/",
    "text": "Dating app giant Match Group says it hasn’t yet determined how it plans to adapt its products in light of the EU’s Digital Markets Act (DMA), a new regulation that is forcing Apple to open up its platform to alternative app stores, third-party payments and more. Speaking to investors during the company’s Q4 2023 earnings call this morning, Match President and CEO Gary Swidler noted that, like other companies including Spotify and Microsoft, there are questions and concerns with Apple’s response to the legislation, but added that Match hasn’t yet decided if it would opt into Apple’s new rules. “We’re still considering what this all means,” Swidler said. “We’re still looking at it, making sure we understand it,” he explained. Apple announced last week a host of complicated rules around how it’s complying with the DMA, which involve a new commission structure for apps distributed in the EU, including separate fees for the use of Apple’s in-app payments and a new “Core Technology Fee” that applies to any business opting into the new rules. Alternately, app developers can choose to stay on the same system they are today, where they simply pay Apple a commission for in-app purchases that range from 15% to 30%, depending on the company size and other factors. In doing the math, several large companies realized Apple’s DMA rules wouldn’t actually provide them the discounts they had hoped for in an open app marketplace, where they could process their own payments and distribute apps outside the App Store. That’s led to backlash from notable Apple critics, including Epic Games and Spotify, as well as others like Mozilla and Microsoft. Match is likely going to come to the same conclusion that the rules are not as favorable to their business as they had wanted them to be. However, Swidler noted there was the potential for the rules to change because, even though Apple had proposed new rules for its App Store and iOS platform, the European Commission still actually has to accept its proposal. “And that, in and of itself, is far from assured,” Swidler added. “And so I think that will continue to play itself out over the next weeks or months as we get to that March 6 deadline.” In addition, Match believes the fact that the new regulations are available to EU users could put pressure on other markets, like the U.S., to adopt similar measures. “If you’re a consumer in the U.S., or you’re a consumer in the U.K. — right next door to the EU — you start to wonder why our customers in the EU are getting benefits and we’re not getting the same benefits. So if you’re the government in those jurisdictions, you’d say, well, our citizens deserve the same benefits as what we’re seeing in the EU.” Match has a relatively small percentage of its revenue in the U.K. that comes from iOS, the CEO noted, but it has a lot more revenue coming from the U.K. and North America, where similar laws regulating app stores would benefit the dating app maker, if they came to pass. “We’re excited to see where this goes because we’ve been waiting for this for a long time. And this is the first, tangible movement that we’ve seen from the the regulators,” Swidler said. He said Match estimated it could save $20 million in app store fees in the EU in the future. Match’s earnings on Tuesday came out ahead of estimates with earnings of $0.81 per share, up from $0.30 per share a year ago. The company also posted revenues of $866.23 million for the quarter ending in December, up from $786.15 a year ago. For the full year, Match reported record revenue, up 6% year-over-year, to $3.4 billion. Epic Games CEO calls out Apple’s DMA rules as ‘malicious compliance’ and full of ‘junk fees’  Spotify calls Apple’s DMA compliance plan ‘extortion’ and a ‘complete and total farce’  Apple’s answer to EU’s gatekeeper rules is new ‘core tech’ fee for apps  "
}