{
    "title": "Apple events history, key moments",
    "date": "1/5/2024",
    "url": "https://www.businessinsider.com/apple-events",
    "text": "       Apple hosts multiple events every year, including the company's Worldwide Developers Conference. These events are usually where new Apple products are announced, as well as product updates, keynote addresses from company leadership. Here's a timeline of some of Apple's most iconic events: The first WWDC was held in 1983. At the time, it was called the Apple Independent Software Developers Conference. Attendees got a glimpse of the first personal desktop computer with a graphics interface, called Lisa, named for co-founder Steve Jobs' daughter. Apple debuted the Macintosh computer at an event in 1984. The Mac featured a graphical user interface, known as GUI, and a navigational mouse. When Steve Jobs returned to Apple in 1997, he walked on stage during a keynote to a roaring applause. He co-founded the company two decades earlier but was fired by the company's board in 1985. His return spurred a turnaround for Apple, which was facing bankruptcy at the time. Apple's introduction of the first iMac in 1998 was a hit with event attendees. With its colorful design and user-friendliness, the iMac was the first computer that \"seemed cool and wasn't focused on the enterprise.\" At a 1999 event, Jobs made a show of demonstrating the iBook's Wi-Fi capabilities. He picked up the laptop and walked around while browsing the web. During a 2001 intimate event, Apple CEO Jobs revealed the iPod. The pocket-sized product moved people away from CD players to MP3 players, and then to the music streaming that's ubiquitous today. When Jobs unveiled the iPhone in 2007 and described it as \"an iPod, a phone, and an internet communicator\" in one device, conference attendees \"went ballistic.\" The iPhone remains Apple's best-selling product. Apple unveiled the iPad in 2010, and the audience at the keynote address was surprised to learn that it only cost $499, about half as much as many people expected. Also, at an event that year, Jobs demonstrated FaceTime for the first time. Tim Cook took over as Apple CEO in 2011, following Steve Jobs' death. At an event that year, Cook introduced the Apple Watch, a new product category for the company. Cook used Jobs' iconic catchphrase, \"one more thing,\" during the announcement. Apple unveiled its wireless AirPods in 2016 after the company had announced plans to remove the headphone jack from its iPhones. At its 2023 WWDC in June, Cook revealed the Vision Pro, the company's first mixed-reality headset. It was Apple's first major product release since the Apple Watch. The headset is expected to be released in 2024 with a $3,499 price tag. Read next Jump to "
}