{
    "title": null,
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/video/pre-orders-start-apple-vision-213544219.html",
    "text": "Pre-orders have begun for Apple’s (AAPL) Vision Pro headset, which will be available in the US on February 2, with delivery dates slipping as far as March. The device's most popular use case, for most people, will be gaming, but it could also assist with productivity and watching 3D videos. Yahoo Finance’s Dan Howley breaks down the pre-order process and weighs in on whether this system can be beneficial outside of gaming. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim JARED BLIKRE: It's preorder day for Apple's Vision Pro headset. This comes following a rough start to 2024 for the tech giant. Joining us now is Yahoo Finance's Dan Howley. Dan, what are the details here? DAN HOWLEY: Hey, Jared. Right now I'm actually coming through the setup process to try to get one of these. When you do, you're going to have to have an iPhone or iPad with you basically to take a scan of your face. It's going to tell you to look up, down, left, right kind of similar to what you do when you set up face ID. And that's the way that it takes measurements for you to ensure that you're getting a right fit when you have this. The big reason why you want a good fit is because you don't want light leaking in to take you away from that immersive experience that Apple's offering. So far though, it looks like there are backups as far as the delivery date. So they're appear to be slipping as far away as March. It's going to take quite a while. I just set one up, $3,500, $3,499. I set one up with Zeiss Optical inserts for my glasses, $4,147 is what I would pay. I don't think I got paid this week, so it's not happening. But I do think that it's something worth watching to see how many people actually buy and how long those delivery times end up getting delayed just because it shows how much people are interested in this product. And it's still a nascent market, but you know we've seen Meta in here for quite a while and it hasn't taken off as much as maybe Mark Zuckerberg would have hoped. So we'll have to see if Apple can stoke these fires. JOSH LIPTON: And Dan, what do you think the most popular use cases for this device are going to be? Not just in the near term, but kind of farther out. Do you think this is going to be-- listen, this is really going to be for gamers? Is it going to be for people watching movies, or sports, or are people going to use it at work? DAN HOWLEY: I mean, hands down, the reason why people have these headsets right now is gaming, right? And so if you're not a gamer or you're not even you know interested in gaming at all, then it's not really a system for you. That's how it is with the Meta Quest. There are some work options where you can dip into meetings and things like that. But let's face it, you don't want to turn on your camera on your laptop for a meeting, you're not going to want to strap on a headset for a meeting. You don't want to see something-- someone in the flesh, you don't want to see a virtual version of them either. The thing that I think Apple is banking on is that you would use this as a productivity device to extend your screen. So you would look down at your Mac and then, oh, here's a giant version of that screen up here. That's very cool. I got to look at a version of that. The other is watching interactive videos or 3D videos, things like that. When I tried it in June at WWDC, I got to see a version-- a 3D version of the \"Avatar\" movie, which looked very cool, you know. I got to say the overall between any of the devices that I've used, the Vision Pro is the best. The fidelity for the screen is amazing. You put it on and you see the pass through and it looks great. I think the real question is, do people want something like this? And if so, why? I've said it before, I have a 65-inch OLED TV, I have my PlayStation there. I can get up and walk to the fridge, I can lay down, I don't have to worry about a headset. I'll have to see when I get my hands on the Vision Pro if that makes me change my mind. Related Quotes "
}