{
    "title": "Apple overtakes Samsung as world’s top smartphone seller",
    "date": "1/17/2024",
    "url": "https://www.theguardian.com/technology/2024/jan/17/apple-samsung-worlds-top-smartphone-seller-iphone-honor-google-divide-android",
    "text": "iPhone maker ends South Korean rival’s 12-year lead, as Xiaomi, Honor and Google divide Android market Apple has overtaken Samsung as the world’s top smartphone seller, ending the Korean tech firm’s 12-year run as industry leader. The iPhone took the top spot in 2023 with 234.6m units sold, according to figures from the International Data Corporation (IDC), overtaking Samsung’s 226.6m units. IDC said the crowning of Apple, which released the iPhone 15 in September, was due to trends including the increasing popularity of high-end devices, which now account for more than 20% of the market. “The last time a company not named Samsung was at the top of the smartphone market was 2010, and for 2023 it is now Apple,” IDC said. “A sort of shifting of power at the top of the largest consumer electronics market was driven by an all-time high market share for Apple and a first time at the top.” The $2.8tn (£2.2tn) US tech company commanded a 20.1% market share ahead of Samsung’s 19.4%, the IDC said. Apple is well established as the largest smartphone maker in terms of revenues and profits but this is the first time it has led the market in terms of volume. The sales data came before the latest release of Samsung models on Wednesday, with the South Korean conglomerate expected to release the Galaxy S24, S24 Plus and S24 Ultra with artificial intelligence-backed features. Ben Wood, the chief analyst at the research firm CCS Insight, said the IDC data was a “psychological” blow to Samsung but he expected the contest to remain tight this year. “I think it will remain a close-fought battle throughout 2024, but there is little doubt that Apple is on a strong trajectory and the loyalty consumers have towards Apple devices means once they get one they seldom switch to something else,” he said. Wood said the data gave extra weight to the importance of Samsung’s Wednesday product launch. “This means Samsung needs to do everything it can to hold on to existing users as well as securing new customers for its devices.” IDC also pointed to an increasingly fragmented market for smartphones that run on the Android operating system, citing low-end Samsung rivals such as Transsion and Xiaomi as well as Honor and Google. The success of Huawei’s well-received products in China also had an effect on Samsung’s drop in sales, the IDC said. The data provider added that Huawei remained a competitive threat to Apple in China, the US company’s largest market. According to IDC, global smartphone shipments declined 3.2% to 1.17bn units in 2023, though the group said the industry was recovering after a sluggish period. “Growth in the second half of the year has cemented the expected recovery for 2024,” the IDC added. Last week, Apple was overtaken by Microsoft as the world’s most valuable company, at $2.9tn. "
}