{
    "title": "Which Nasdaq company just overtook Apple as the world's largest by market \ncap?",
    "date": "1/16/2024",
    "url": "https://www.fool.com.au/2024/01/16/which-nasdaq-company-just-overtook-apple-as-the-worlds-largest-by-market-cap/",
    "text": " Access all of your premium services in our Member Centre Click here to learn more about our premium services TO MAKE THE WORLD\nSMARTER, HAPPIER, AND RICHER. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services. History was made on Tuesday morning as a familiar rival snatched the crown from the iPhone maker after a year dominated by AI. Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Tuesday morning was a historic moment in stock markets as long-time leader Apple Inc (NASDAQ: AAPL) was knocked off the perch as the world's largest company by market capitalisation. CMC Invest shows that fellow NASDAQ-100 Index (NASDAQ: NDX) giant Microsoft Corp (NASDAQ: MSFT) now has a market cap of US$2.887 trillion, eclipsing Apple's US$2.875 trillion. It seems Microsoft's stake in OpenAI, which started an artificial intelligence (AI) revolution upon its public release 14 months ago, has encouraged investors to flock to the almost 49-year old company. Over the past year, the Microsoft share price — and therefore market cap — has rocketed more than 61%. Apple shares have risen 37% over the same period, while the Nasdaq-100 index has climbed 46%. According to Bloomberg, this is the first time since November 2021 that Microsoft has been more valuable than Apple. For Montaka Global Investments portfolio manager Chris Demasi, Microsoft is the type of stock he calls \"compounders\". \"A compounder is an established winner that can continue to grow its business value at superior rates for a long period of time,\" Demasi said on the Montaka blog in November. \"Compounders typically earn high returns on capital, especially incremental capital invested, and grow their earnings and cash flows quickly.\" These stocks, often in the NASDAQ, are bread-and-butter for Montaka's portfolio. \"Compounders can generate very large payoffs over very long periods, which means the return potential is very high, which can have an outsized impact on overall portfolio performance for many years.\" And Microsoft is \"a quintessential compounder\", Demasi added, and it's not even about AI. \"Microsoft has been able to capitalise on the transition to the cloud in two different ways with their Azure cloud computing platform, but also the business productivity applications through Microsoft Office and Teams that are offered in the cloud now.\" One downside for Apple in the past year has been China's struggling economy. Sales for the iPhone, especially, are facing tougher competition from cheaper local handsets in the world's most populous nation. Motley Fool contributor Tony Yoo has positions in Microsoft. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Apple and Microsoft. The Motley Fool Australia has recommended Apple. The Motley Fool has a disclosure policy. This article contains general investment advice only (under AFSL 400691). Authorised by Scott Phillips. March 19, 2024 |\n        Jeremy Bowman Buying Nvidia when the disruptive AI chatbot launched would have been a smart move. Read more » March 19, 2024 |\n        Jeremy Bowman Investors were encouraged by news of a price hike on the Model Y. Read more » March 16, 2024 |\n        Keithen Drury Nvidia last split its stock when it traded for a pre-split $744 in 2021. Read more » March 14, 2024 |\n        Howard Smith Tesla is no longer a magnificent stock, according to a Wells Fargo analyst. Read more » March 14, 2024 |\n        Dani Cook The company's stock could rise 40% over the next two years and outperform the S&P 500. Read more » March 13, 2024 |\n        Will Healy Nvidia stock has split five previous times in the company's history. Read more » March 13, 2024 |\n        Danny Vena Nvidia stock has gained nearly 300% over the past year. Can investors still profit from this AI stock? Read more » March 12, 2024 |\n        Tristan Harrison This stock has rocketed higher. How do we get access to it? Read more » View All Sign Up for Take Stock\nInvestment news, stock ideas, and more, straight to your inbox. Get Started Investing\nYou can do it. Learn about investing with our Investing Education hub. Win at Retirement\nOur latest articles and strategies for the post-work life you want. Listen to Our Podcast\nHear our experts take on shares, the market & how to invest. Join Our Premium Community\nJoin our flagship membership service, Share Advisor. The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service.  Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. The Motley Fool launched its Australian presence in 2011, and since then has grown to reach over 1 million Australians. Read more about us >  This Service provides only general, and not personalised financial advice, and has not taken your personal circumstances into account. The Motley Fool Australia operates under AFSL 400691. For more information please see our Financial Services Guide. Please remember that investments can go up and down. Past performance is not necessarily indicative of future returns. The Motley Fool Australia does not guarantee the performance of, or returns on any investment. We respectfully acknowledge the Traditional Custodians of the land where we live and work and pay our respects to all Elders, past and present, of all Aboriginal and Torres Strait Islander nations. © 2010 - 2023 The Motley Fool Australia Pty Ltd. All rights reserved. ACN: 146 988 052 Australian Financial Services Licence (AFSL): 400691 The Motley Fool Australia, PO Box 104, Isle of Capri, Qld 4217 Contact Details:\nPhone: (03) 8592 4841\nEmail: [email protected]\nOur friendly customer service team will happily get back to you as soon as they can. Notifications Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! "
}