{
    "title": "[News] Market Rumors Suggest Apple Vision Pro Stock Limited to 60-80K \nUnits, Expected to Quickly Sell Out Post ...",
    "date": "1/12/2024",
    "url": "https://www.trendforce.com/news/2024/01/12/news-market-rumors-suggest-apple-vision-pro-stock-limited-to-60-80k-units-expected-to-quickly-sell-out-post-launch/",
    "text": " Apple CEO Tim Cook recently made the official announcement that the company’s inaugural spatial computing product, Vision Pro, is set to go on sale on February 2nd in the United States. According to a report by TechNews, due to the limited preparation of Vision Pro units, with an estimated quantity of only 60,000 to 80,000, there is a high likelihood that the product will sell out on the first day of its release. TechNews cites the latest analysis from China’s TF Securities analyst Ming-Chi Kuo, who recently posted on X. According to Kuo, Apple has prepared only about 60,000 to 80,000 units of the Vision Pro before its launch, and due to the limited quantity, it is expected to quickly sell out once it hits the market. Kuo also notes that despite questions about Apple’s lack of clear positioning and key features for the Vision Pro, as well as its relatively high price, the company is likely to sell out rapidly based on its groundbreaking technological innovations, creating a user experience that includes the illusion of mind-controlled interfaces. This, coupled with Apple’s strong core user base and a significant number of heavy users, should result in a swift sellout after the product’s release. There are rumors suggesting that even though online ordering is possible, users may need to adjust the head circumference size, and Apple may prefer customers to try fitting it in person, which could lead to some consumers adopting a wait-and-see approach. However, a user on the X platform, Aaron @aaronp613, discovered an encoding set as ‘ You will be able to use the Apple Store app to scan your face to pick the right size,’ indicating that users who are unable to visit stores for fitting may use the Apple Store app to scan their faces and order the correct Vision Pro size. Vision Pro requires a proper fit for functionality, involving a tight seal and correct headgear. Apple has also introduced the Head Measure and Fit app to help developers test Vision Pro and determine the correct product size. Similar functionality may be built into the Apple Store app. According to the latest data from TrendForce, global shipments of Apple Vision Pro are expected to reach 500,000 units in 2024. (Image: Apple) "
}