{
    "title": "5 Top-Ranked Stocks That Have More Than Doubled Year to Date",
    "date": "2/23/2024",
    "url": "https://finance.yahoo.com/news/5-top-ranked-stocks-more-140800509.html",
    "text": "Wall Street has been roaring higher, driven by a solid earnings season, a resilient economy and a technology surge. Both the S&P 500 and Dow Jones are at all-time highs, while the tech-heavy Nasdaq Composite Index is just below its record peak.The gains have been broad-based across various segments and many stocks have more than doubled this year. We have highlighted five stocks that have a Zacks Rank #1 (Strong Buy) or 2 (Buy), a Momentum Score of B or better and saw positive earnings estimate revisions for the current fiscal year over the past 30 days, suggesting continued outperformance. These are Equillium, Inc. EQ, Phunware Inc. PHUN, Super Micro Computer, Inc. SMCI, Vaxart, Inc. VXRT and Dianthus Therapeutics Inc. DNTH. You can see the complete list of today’s Zacks #1 Rank stocks here. Total fourth-quarter earnings of the 402 S&P 500 members who have reported results so far increased 4.9% from the prior-year period on 3.4% higher revenues. Of the companies that reported results, 78.6% beat EPS estimates and 64.4% surpassed revenue estimates. The pace of earnings and revenue growth represents an acceleration from the last couple of quarters, with the technology sector being a major contributor. Notably, the earnings growth is the best growth rate for the S&P 500 companies since the 6.2% earnings growth rate in the second quarter of 2022. The resilience of the U.S. economy has played a crucial role in the rise of the stock market. However, it has reduced the likelihood of a near-term rate cut. Factors like robust retail sales, consumer sentiment and a cooling trend in the producer price index indicate the possibility of the Fed achieving a soft landing, bringing inflation back to target without triggering a recession. The surge in big technology companies on optimism over artificial intelligence has been a significant driver of the market's upward trajectory. Notably, six of the \"Magnificent Seven\" — Apple Inc. (AAPL), Microsoft Corp (MSFT), Alphabet Inc. (AAPL), Amazon.com Inc. (AMZN), Nvidia (NVDA), and Meta Platforms Inc. (META) — have been the biggest engine of stock market growth.Notably, Nvidia’s (NVDA) blockbuster earnings report ignited the global rally for the stocks, pushing many stock indices to new highs. A leading U.S. chip designer exceeded fourth-quarter earnings and revenue expectations. The company reported a staggering 265% increase in revenues and provided an optimistic outlook, indicating a surge in demand for AI hardware. This not only showcased Nvidia's robust position in the AI chip market but also signaled promising prospects for the semiconductor industry in 2025 and beyond. Equillium is a biotechnology company. It develops products for autoimmune and inflammatory disorders. The stock has skyrocketed 245.8% this year. It has seen a solid earnings estimate revision of 3 cents for this year over the past 30 days and has an estimated growth rate of 69.4%.Equillium currently has a Zacks Rank #2 and a Momentum Score of B.Phunware provides a cloud platform for mobile. It offers software, solutions, data and services for brands. The stock has soared 222% and saw a positive earnings estimate revision of a penny over the past 30 days for this year, with an estimated earnings growth rate of 64.5%.Phunware has a Zacks Rank #2 at present and a Momentum Score of B.Super Micro designs, develops, manufactures and sells energy-efficient, application-optimized server solutions based on the x86 architecture. The stock has surged nearly 158% this year.Super Micro saw a positive earnings estimate revision of $4.58 for the fiscal year ending June 2024 and has an earnings growth rate of 83.8%. It has a Zacks Rank #1 and a solid Momentum Score of A.Vaxart is a clinical-stage company developing a range of oral recombinant vaccines based on its proprietary delivery platform. The stock has soared nearly 146% so far this year. It has seen a positive earnings estimate revision of 3 cents over the past 30 days for this year, with an estimated earnings growth rate of 21.5%.Vaxart has a Zacks Rank #2 and a Momentum Score of B.Dianthus Therapeutics is a privately held, clinical-stage biotechnology company dedicated to advancing the next generation of antibody-complement therapeutics. It has gained 130.5%. The stock saw a positive earnings estimate revision of 61 cents over the past 30 days for this year and has an estimated earnings growth rate of 45.1%.Dianthus Therapeutics has a Zacks Rank #2 and a Momentum Score of A. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Super Micro Computer, Inc. (SMCI) : Free Stock Analysis Report VAXART, INC. (VXRT) : Free Stock Analysis Report Equillium, Inc. (EQ) : Free Stock Analysis Report Phunware (PHUN) : Free Stock Analysis Report Dianthus Therapeutics, Inc. (DNTH) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}