{
    "title": "HTC boss welcomes Apple VR competition",
    "date": "2/26/2024",
    "url": "https://news.yahoo.com/htc-boss-welcomes-apple-vr-151051388.html",
    "text": " The boss of consumer electronics firm HTC on Monday welcomed Apple's launch of its own a mixed reality headset, saying it will help the technology take off and become mainstream. Apple began sales of Vision Pro, the company's pricey virtual and augmented reality headset on February 2 in company's biggest product launch since the original iPhone went on sale in 2007, putting it in competition with HTC. Once a major player in the smartphone market, the Taiwanese company has staked its future on the merging of virtual and physical worlds with its HTC Vive line of headsets. \"I think it is good that Apple joined the competition. I mean Apple is a big brand so its good,\" HTC chief executive and co-founder Cher Wang told AFP at the four-day Mobile World Congress, the telecom industry biggest annual show, which got underway in Barcelona on Monday. \"I think their price is very high but people started to see what you can do\" with the technology, she added. Asked when she thought virtual and augmented reality would become mainstream, Wang said: \"It is not going to be too long. Definitely this is an area we believe will be the next internet.\" \"I think when the price point gets lower and the technology, what we provide, improves further, things will get more ubiquitous,\" she added. Sales of virtual and augmented reality headsets have remained modest with critics complaining the devices cause eye strain, mess up the user's hair and often require a clunky battery pack although they are getting lighter. Most headsets are still mostly used for gaming but Wang said VR is increasingly being used in business settings to simulate work experiences, such as in healthcare such to train surgeons to become more proficient in the operating room as well as to help police learn how to de-escalate violent situations. \"We have been doing quite well in these areas. There are all sorts of applications,\" she said. HTC Vive Focus 3 headset are even being used on the International Space Station to help astronauts exercise and give them images of life on Earth during their long stays, Wang said. \"Astronauts talk about how they really miss greenery, the air, butterflies,\" she said. \"It calms down their anxiety because it is such an enclosed space for many, many months.\" The IDC consultancy estimates worldwide shipments of augmented reality and virtual reality headsets fell by around 8.3 percent in 2023 to 8.1 million units as rising inflation damped household consumption and business spending slowed. But it expects shipments to grow by 46.4 percent this year, thanks in part to a \"full year's availability\" of Apple's Vision Pro \"which is expected to bring lots of attention\" and Meta's Quest 3 which went on sale in October 2023. ds/rl "
}