{
    "title": "Apple bought more than 30 AI startups last year, more than any other company",
    "date": "2/9/2024",
    "url": "https://www.gearrice.com/update/apple-bought-more-than-30-ai-startups-last-year-more-than-any-other-company/",
    "text": " Join the conversation According to a new report from Statistaa firm specialized in compiling statistics on different trends worldwide, Apple bought 32 new companies dedicated to artificial intelligence in 2023.  It is the company that made more acquisitions than any other technology giant. Will Apple really bet everything on AI in the future? Those from Cupertino have a strategy behind them to be at the forefront when it comes to the biggest trend in recent years, artificial intelligence.  In addition to recent acquisitions, Apple has added staff from AI startups to bolster its own capabilities and work on multiple product lines. What other companies acquired artificial intelligence startups?  Neither more nor less than Google (21), Meta (18) and Microsoft (17). Part of Apple’s philosophy is to recognize the value that new companies possess, in fact they do it at an early stage and not when they are consolidated.  Of course They have an advantage because they identify emerging technologies before they reach a greater degree of adoption. Apple gives more signs of AI-related jobs The data presented by Statista, for the moment, are estimates. Apple usually acquires companies or startups silently without any type of announcement.  Tim Cook has already given clues in the past about the acquisition of companies.  They generally buy a startup in 2 to 4 weeks according to statements made by the CEO of Apple in the BBC. On the topic of Apple and AI, the firm’s financial analyst StocklyticsEdith Reads, comments that those from Cupertino are making important agreements with AI companies.  They put themselves in a good position for the future even taking into account their competitors who are in the same race. A big difference is that Apple is getting top talent and innovative technologies.  To cite an example, the improvement behind Siri is based on the purchase of Voysis, an artificial intelligence startup that works on creating voice assistants.  This happened in 2020, first reported by Mark Gurmanthe intention is to improve Apple devices and try to better understand our language. The Apple Vision Pro is something that Apple has been working on for years The most recent acquisition is Brighter AI, a startup specialized in data and privacy protection through the use of artificial intelligence.  To a large degree, Apple will benefit from the direct impact of Apple Vision Pro and in the background in other apps such as Apple Maps and anyone related to the use of images and files.  What will be Apple’s next move?  Everything indicates that WWDC 2024 will be the most interesting due to the topic of AI. Join the conversation      Save my name, email, and website in this browser for the next time I comment.   Δ Type above and press Enter to search. Press Esc to cancel. "
}