{
    "title": "Apple and Samsung working on rival smart rings, reports claim",
    "date": "2/22/2024",
    "url": "https://ca.finance.yahoo.com/news/apple-samsung-working-rival-smart-135613455.html",
    "text": "Wall Street took a break from rally on Monday, with all three major indexes dipping slightly Apple and Samsung are both secretly working on smart rings, according to reports. Both tech giants have been quietly filing patents for the wearable technology for several years, though indications hint that an ‘Apple Ring’ or ‘Galaxy Ring’ may soon be about to launch. Korean publication ETNews cited an industry insider in reporting that “commercialisation appears to be imminent” for an Apple ring. Along with biometric sensors designed to track a wearer’s health and fitness, any Apple ring could potentially also include wireless motion controls for interacting with the Cupertino company’s recently launched Vision Pro mixed reality headset. Samsung could be planning its smart ring launch as early as July, the report claimed. Beyond health tracking, the smart ring could also include support for wireless payments. Samsung first teased a smart ring at its Galaxy Unpacked event last month, saying that it could integrate with its existing health apps like Samsung Health. “We’ve created a powerful and accessible health and wellness device, here to change the shape of future health like only Samsung can,” it said at the time. Apple and Samsung have both had succes with wearable technology, with the Apple Watch and Galaxy Watch generating billions of dollars in revenue, though neither company has ventured into smart rings. A 2023 report from consulting firm DataHorizzon Research estimated that the global smart ring market will be worth $1.4 billion by 2032, up from $147 million in 2022. The current market leader in the smart ring space is the Finnish health tech startup Oura, which holds a share of more than 50 per cent, according to 360 Industry Insights. The £290 device is able to track activity, heart rate, temperature, sleep and stress levels, and has even been used to detect early signs of illnesses. In 2020, researchers from the University of California San Francisco and San Diego reported that an Oura smart ring was able to spot when a wearer had Covid-19 before any outward symptoms showed. “We’re seeing changes up to three days in advance before the onset of symptoms,” said Oura CFO Mikko Kärkkäinen at an event attended by The Independent. “They can quarantine if they get a text early – it could effectively stop the spread.” The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein Trade 24 hours a day on the world's most popular platform. Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises.  Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr.,  (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach  “The Daily Show” host tears into the former president’s claim ― and shows why the case matters. New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit.  The Ohio lawmaker was asked about Donald Trump’s debunked claims about the 2020 election. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Anne Hathaway told Vanity Fair during a cover story interview that Christopher Nolan more or less saved her career when public opinion turned against her in the lead up to and the aftermath of her winning the Oscar for “Les Miserables.” Hathaway was widely mocked online at this time, and she once remembered googling herself …  The president has been going after his presumptive 2024 opponent with a little more venom than usual President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… The rapper was caught off guard when her \"whole boob\" fell out of her top on stage "
}