{
    "title": "Apple Sets New Record: Acquires 32 AI Startups in 2023, the Highest Among \nMajor-Tech Companies - Tech | Business ...",
    "date": "2/7/2024",
    "url": "https://techeconomy.ng/apple-sets-new-record-acquires-32-ai-startups-in-2023-the-highest-among-major-tech-companies/",
    "text": "Home » Apple Sets New Record: Acquires 32 AI Startups in 2023, the Highest Among Major-Tech Companies Apple office Apple’s pursuit of AI innovation has been evident in recent years. The tech giant has made a series of strategic acquisitions, including staff hires from AI startups, to bolster its AI capabilities across various product lines. According to Stocklytics.com, Apple purchased up to 32 AI startups by 2023, the highest number among tech giants. In the overall AI startup acquisition, Google trails Apple with 21, Meta with 18, and Microsoft lags with 17. Stocklytics financial analyst Edith Reads commented on the data: In the ongoing AI arms race, Apple is making sizeable deals with many AI startups, putting it in a good spot for future tech developments even as its competitors, Microsoft and Google, make considerable investments in already established AI companies. By acquiring promising AI startups, Apple gains access to top-tier talent and innovative technologies and consolidates its foothold in crucial AI domains, ensuring a competitive edge in the rapidly evolving tech landscape. Stocklytics Finacial Analyst, Edith Reads The iPhone Maker has been quite subtle in increasing its AI capabilities. It has yet to unveil its plans with the newly found insight into AI technology. Still, the CEO, Tim Cook, remarked on how the company is directing its energy into research on AI but nothing to hold onto in terms of new developments. Furthermore, Apple’s acquisition strategy reflects a multifaceted approach to AI advancement, encompassing talent acquisition, technology integration, and intellectual property expansion. Back in 2020, Apple Inc. purchased Voysis, an AI startup involved in making digital voice assistants that naturally aid in comprehending natural language. Apple bought the company to improve Siri, the virtual assistant, on its devices. The Silicon Valley heavyweight also acquired WaveOne in March 2023, whose technology is helpful for ample video compression. Other Apple-secured technologies are Emotient, Laserlike, and Drive.AI, and AI. Music, some of which have been embedded in iPhones,  Apple watches, and Macs. One notable aspect of Apple’s acquisition spree is its emphasis on acquiring early-stage startups, indicating a proactive strategy to identify and invest in emerging AI trends and technologies before they reach mainstream adoption. While Apple has updated the software and hardware in its devices with the help of AI and machine learning, companies like Google and Samsung have moved progressively faster with their latest phones and devices, building their own generative AI. The Samsung Galaxy S24 Ultra and Galaxy S24+ have got many people excited and running to the shelves to get their own Galaxy AI-powered devices. However, statistics show Apple is well ahead of its competitors in equity and add-on investment in AI technologies since 2017, with about 21%, while Microsoft holds 12%. Alphabet Inc. lies in the single digits at 8%. Apple is looking to add more acquisitions even as it plans to bring on board Brighter.AI, a German-based startup, to improve its new headset, the Apple Vision Pro. While its competitors seem well ahead, that may change in the coming years. Joel Nwankwo is a tech journalist. He is passionate about telling stories as it relates to Africa's social and financial tech advancements. You can reach him at joel.nwankwo@techeconomy.ng This new venture allows users to access educational video courses on a range of topics, from the in-depths of music... Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Privacy Policy Agreement *\n I agree to the Terms & Conditions and Privacy Policy.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Follow Us © 2023 Techeconomy - Designed by Opimedia. © 2023 Techeconomy - Designed by Opimedia. "
}