{
    "title": null,
    "date": "2/28/2024",
    "url": "https://winbuzzer.com/2024/02/28/apple-shareholders-demand-transparency-on-ai-risks-ahead-of-annual-meeting-xcxwbn/",
    "text": "Apple faces shareholder pressure for transparency on AI risks. Major investors seek details on social impacts, ethics, and specific risk mitigation strategies. - Apple faces significant pressure from its shareholders to disclose more information about the risks associated with advancements in artificial intelligence (AI) as the company's annual shareholder meeting approaches. The push for transparency comes primarily from two of Apple's top investors, Norges Bank Investment Management and Legal & General, who are advocating for the company to shed light on its AI operations' potential social impacts and ethical considerations. The driving force behind this initiative is a shareholder proposal originally submitted by the American Federation of Labor and Congress of Industrial Organizations (AFL-CIO), with strong backing from Norges Bank Investment Management and Legal & General, Apple's eighth and tenth-largest shareholders, respectively. This proposed resolution calls on Apple to discuss the implications of its AI deployment on job security, privacy risks, and the proliferation of deepfakes. The proposal articulates concerns over the “very little” information Apple shares about how it manages AI-related risks, emphasizing the need for greater transparency in this rapidly evolving domain. Apple, for its part, cautions against the broad nature of the requested disclosures. The company articulates its commitment to ethical AI development, highlighting its robust approach to navigating the ethical landscapes of its business operations. Apple's official response suggests that the requested report's scope could inadvertently reveal strategic plans, potentially harming its competitive stance. Specifically, the company has stated, “The scope of the requested report is overly broad and could encompass disclosure of strategic plans and initiatives harmful to our competitive position.” Despite Apple's resistance to disclosing detailed AI risk management strategies, the tech giant hints at future revelations. Apple's CEO, Tim Cook, has announced plans to unveil new AI capabilities at the upcoming WWDC 2024, signaling the company's ongoing investment in artificial intelligence technologies. Meanwhile, the shareholder proposal mirrors broader industry trends, as stakeholders, including governments and investors across the tech landscape, are increasingly calling for more accountability and transparency regarding AI technologies' social and ethical ramifications. For instance, Microsoft faced similar calls from its shareholders in December, urging the company to assess and report on risks tied to AI-generated misinformation and disinformation. As Apple's annual meeting looms, the tech community closely watches how these demands for transparency will play out, especially if the proposal garners significant backing. If at least 30% of company investors support the initiative, Apple may face heightened pressure to address these concerns comprehensively, marking a pivotal moment in how tech giants manage and disclose AI risks and policies. Subscribe to WinBuzzer on Google News   "
}