{
    "title": null,
    "date": "2/20/2024",
    "url": "https://finance.yahoo.com/news/apple-tesla-downgraded-wall-streets-145839552.html",
    "text": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.Top 5 Upgrades: Deutsche Bank upgraded Southwest (LUV) to Buy from Hold with a price target of $42, up from $28. The firm believes more moderate domestic available seat mile growth for 2024 will have positive implications for domestic unit revenue performance, and by extension, should translate into solid sales performance for the domestic-focused names. As such, Deutsche upgraded Alaska (ALK), JetBlue (JBLU), and Southwest to Buy from Hold. Meanwhile, Bernstein also upgraded Southwest to Market Perform from Underperform with a price target of $32, up from $26. UBS upgraded US Foods (USFD) to Buy from Neutral with a price target of $64, up from $47. Following the company's Q4 results, UBS is becoming more bullish on US Foods based on expectations for further market share gains on the back of sales force investments and its differentiated tech platform as well as higher conviction that the company's EBITDA growth trajectory is sustainable. Piper Sandler also upgraded US Foods to Overweight from Neutral with a price target of $59, up from $45. B. Riley upgraded Brunswick (BC) to Buy from Neutral with a price target of $108, up from $100. The firm upgrades the shares following positive indications from the Miami International Boat Show around underlying demand trends, market share upside, increased moves to boost operating margins, and overall 2024 guidance conservatism. Wolfe Research upgraded Freshworks (FRSH) to Outperform from Peer Perform with a $27 price target. The firm sees the combination of improving fundamentals, execution, and competitive dynamics supporting multi-year 20% revenue growth with expanding margins for the company. Mizuho upgraded LivaNova (LIVN) to Buy from Neutral with a price target of $70, up from $60. The company has a \"well-hedged path\" to either 20-plus annual earnings growth over the next three years or upside optionality based on outcome of the RECOVER trial by mid-year, the firm tells investors in a research note. Top 5 Downgrades: Phillip Securities downgraded Apple (AAPL) to Neutral from Accumulate with an unchanged price target of $194. The firm cites valuation for the downgrade following the stock's recent gains, but says it expects Services to continue being Apple's main growth driver as its installed base increases. Phillip Securities downgraded Tesla (TSLA) to Neutral from Accumulate with a $175 price target. The near-term outlook for Tesla \"looks quite bleak, with the company set on sacrificing margins and growth also slowing,\" the firm tells investors in a research note. Phillip Securities downgraded Airbnb (ABNB) to Neutral from Buy with a $150 price target, down from $157. The firm cites valuation for the downgrade following the recent rally and a slowdown in booking volumes for the downgrade. Evercore ISI downgraded Caterpillar (CAT) to In Line from Outperform with a price target of $338, up from $321. The downgrade is not so much company specific as it is a call to take profits on the group, the firm tells investors in a research note. Argus downgraded Johnson Controls (JCI) to Hold from Buy. The firm sees the stock's current valuations as reasonable given the company's reduced growth outlook due to the recent cybersecurity attack. Top 5 Initiations: Seaport Research initiated coverage of Booking Holdings (BKNG) with a Buy rating and $4,380 price target. The firm is positive on Booking's fundamentals saying the company is the clear leader in global online accommodations, with particular strength in Europe and Asia. Goldman Sachs initiated coverage of BrightSpring Health (BTSG) with a Buy rating and $26 price target. The firm expects strong growth, emergence of medium-term upside drivers, acquisition execution and de-levering progress to be key drivers of the stock closing the valuation gap relative to peers. Jefferies, Wells Fargo, Leerink, BofA, UBS, and Morgan Stanley also started coverage of the name with Buy-equivalent ratings, while Deutsche Bank initiated the stock with a Hold. Goldman Sachs initiated coverage of ArriVent Biopharma (AVBP) with a Buy rating and $27 price target. The firm anticipates clinical success of furmonertinib in a subset of non-small cell lung cancer. Citi and Jefferies also started coverage of the name with Buy-equivalent ratings. UBS initiated coverage of Morgan Stanley Direct Lending (MSDL) with a Buy rating and $23.50 price target. Over the next 12-18 months, the firm expects the company to generate attractive returns and avoid significant credit issues, assuming the economy avoids a recession. JPMorgan and Wells Fargo started coverage of the name with Neutral-equivalent ratings, while RBC Capital initiated the stock with an Outperform. JMP Securities initiated coverage of Nuveen Churchill Direct Lending (NCDL) with a Market Perform rating. The firm believes there could be an opportunity for valuation multiple expansion over time, but says this will likely take some time to play out, assuming strong execution. UBS and Wells Fargo also started coverage of the name with Neutral-equivalent ratings, while Truist and BofA started the stock with Buy. Related Quotes "
}