{
    "title": null,
    "date": "2/14/2024",
    "url": "https://www.androidauthority.com/how-to-connect-two-airpods-to-mac-3267163/",
    "text": "Affiliate links on Android Authority may earn us a commission. Learn more. If you’re in the Apple ecosystem, you likely know how easy it is to sync your AirPods to a Mac. But what if your friend also wants to listen to your music or videos? Thankfully, you can connect two sets of Apple’s true wireless earbuds to the same Mac computer simultaneously. That way, you don’t each have to settle for one earbud. Here’s how to connect two AirPods to one Mac. QUICK ANSWER To connect two sets of AirPods to one Mac, use Audio MIDI Setup to create a multi-output device. Then, add the AirPods you'd like to use. Lastly, select your newly created device as the main audio output on your Mac to enjoy sharing audio.  Unfortunately, macOS is missing the Share Audio feature from iOS, letting you quickly share your iPhone’s audio with two sets of AirPods. However, there is a workaround using the built-in Audio MIDI Setup app. The upside of this solution is that you can connect other kinds of audio devices, too, not just AirPods. To start, connect both sets of AirPods to your Mac via the Bluetooth settings. After both AirPods are paired via Bluetooth, open a new Finder window, click Applications in the sidebar, and open the Utilities folder. You can also click Utilities in the Finder’s Go menu or press Shift + Command + U. Search for the Audio MIDI Setup app in the Utilities folder using Spotlight. Click the plus (+) icon in the lower-left corner of the window and choose Create Multi-Output Device. In the right section, tick the boxes next to the two sets of AirPods you want to use. You can also select any other two output devices you like. Select the new device you created from the volume menu or the Sound System Preferences. Now enjoy sharing audio with your friend! Make sure that you have a Mac with the latest version of macOS. Yes, AirPods can be used with Macs. They can connect to any Mac that supports Bluetooth. You can access your AirPods on your Mac by going to “System Preferences,” selecting “Bluetooth,” and then pairing your AirPods. Ensure your AirPods are in their case and the lid is open during pairing. There could be several reasons why your AirPods won’t connect to your Mac. It could be due to Bluetooth not being turned on, the AirPods not being in range, or a need to reset the AirPods. You may also need to update your Mac’s operating system or disconnect your AirPods from other devices. Apple occasionally runs promotions for AirPods where they are free with the purchase of a Mac, typically around back-to-school season. However, these promotions are not always available, and the specifics may change. We recommend checking Apple’s official website in your region for the most current information. "
}