{
    "title": "Apple may position the next iPhone as an 'AI' phone. What could that look \nlike?",
    "date": "2/24/2024",
    "url": "https://seekingalpha.com/news/4071030-apple-may-position-next-iphone-ai-phone-what-could-that-look-like",
    "text": "Hiroshi Watanabe Concerns have cropped up over the past couple of years that Apple (NASDAQ:AAPL) has fallen behind competitors like Nvidia (NVDA), Microsoft (MSFT) and others in the generative artificial intelligence space, as investors have rewarded them with massive valuation increases. Despite these concerns, investment firm Bernstein believes the tech giant has much to tell consumers and investors on the topic. And it starts with the iPhone. The term 'AI phone' is seen as a bit \"squishy,\" since everyone seems to have different definitions of what it actually is. However, most agree that the AI capabilities are largely \"incremental\" and not revolutionary, Bernstein analyst Toni Sacconaghi wrote in an investor note. Sacconaghi has a Market Perform rating and $195 price target on Apple. Samsung (OTCPK:SSNLF) recently released its Galaxy S24 lineup and integrated several AI-linked features, including the ability to edit photos, real-time translation and the ability to tag photos. Apple is likely to use AI for similar tasks, but it may go a bit further, given its ability to integrate software and hardware, Sacconaghi posited. \"We expect potential AI capabilities that are also largely consistent with existing products, including advanced image and video capture/editing tools, translation and transcription, enhanced messaging support, enhanced Siri and greater automation in Music, among others,\" Sacconaghi wrote. \"We also believe that Apple will look more tightly and seamless integrate its Apps for enhanced ease of use.\" Other AI-specific features that Apple could include may be tied to the next Apple silicon, which is expected to be the 3 nanometer A18, Sacconaghi suggested. The perception amongst the investing community is Apple has fallen behind the competition in generative AI, even as the company has boosted spending on the technology and reportedly built an internal version of ChatGPT. Apple has been surpassed in market value by Microsoft (MSFT) and Nvidia (NVDA) has become the poster boy for generative AI in the eyes of investors, as its market cap has skyrocketed 230% over the past year. Even if the iPhone's AI features are not unique, the power of the company's marketing capabilities could be enough to result in a \"material upgrade cycle,\" Sacconaghi said. \"We note that Apple was late relative to peers to introduce large screens (6/6+ cycle), OLED (iPhone X) and 5G, but each triggered meaningful upgrade cycles for Apple,\" Sacconaghi said. \"Our analysis suggests that every 100 [basis point] change in the upgrade rate for iPhone would represent an incremental ~8M phones sold, or ~$7B of iPhone revenue, adding [roughly 300 to 400 basis points] to FY25 iPhone revenue, and 100-200 [basis points] to overall revenue growth,\" he added. If Apple were to raise prices on the iPhone 16 (like Google (GOOG) (GOOGL) did with the Pixel 8 compared to the Pixel 7) even more because of the AI features, growth could be bolstered even more, he continued. Apple is not one to talk about its future products and services, but the company has firmed up its comments around generative AI in recent memory, including on this month's earnings call. \"In terms of generative AI ... we have a lot of work going on internally as I've alluded to before,\" Chief Executive Tim Cook said on the earnings call, adding the company has \"some things that we are incredibly excited about that we'll be talking about later this year.\" Cook's most recent comments are being portrayed as \"more specific and pointed to more investment and enthusiasm for AI than statements he had made on prior calls,\" Sacconaghi said. There have also been a number of media reports in recent weeks — citing sources familiar with the matter — that have heavily intimated the next version of iOS is likely to be chock full of AI-related updates. If Apple does inject the next iOS with as many AI features as possible, it's likely to do so at its next developer's conference, scheduled for June, Citi said. The investment firm highlighted reports that Apple is getting ready to unveil a generative AI tool for iOS developers, expanding the capabilities of its Xcode programming software in an effort to better compete with Microsoft's (MSFT) GitHub Copilot. Apple has reportedly been working on the tool for the last year and has expanded testing of the features internally and ramped up development ahead of a planned release later this year. The company is also said to be working on bringing AI features to the next version of macOS, Apple Music (automate creation of playlists) and revamping its Spotlight search feature. "
}