{
    "title": "With carmakers in a 'state of shock' over Tesla-beating BYD's prices, EU \ninvestigators will visit China's EV giants as part ...",
    "date": "1/13/2024",
    "url": "https://finance.yahoo.com/news/carmakers-state-shock-over-tesla-211359069.html",
    "text": "China might have problems with its economy, but as an exporter of affordable electric vehicles, it’s on a tear. Now, investigators from the European Commission will visit Chinese EV makers as part of a probe into whether they have an unfair advantage thanks to government subsidies. In the coming weeks, the EU investigators will visit BYD, Geely, and SAIC, according to Reuters. Their visits will help determine whether the EU imposes higher tariffs to protect European carmakers. BYD recently overtook Elon Musk’s Tesla as the global leader in sales of electric vehicles. Backed by Warren Buffett’s Berkshire Hathaway, the carmaker keeps its costs low partly by owning the entire supply chain of its EV batteries, significant since a battery accounts for roughly 40% of an electric vehicle’s price. But as the existence of the EU’s anti-subsidy investigation suggests, many worry there’s more than supply-chain efficiencies behind the low prices of Chinese EVs. The visits promise to be central to the EU probe, announced in September and set to run for 13 months. “Their price is kept artificially low by huge state subsidies. This is distorting our market,” European Commission President Ursula von der Leyen said in September of Chinese EVs. “And as we do not accept this distortion from the inside in our market, we do not accept this from the outside.” Earlier this month, Beijing, in what appeared to be a tit-for-tat move, launched an anti-dumping probe into brandy imported from the EU, sending shares of France’s Remy Cointreau and Pernod Ricard tumbling. The move, which might be the first of many, appeared to be aimed at France, which has pushed for the EV investigation. An Allianz Trade report last year said that China’s EV makers pose a significant threat to Europe’s carmakers, particularly the \"automotive-dependent economies of Germany, Slovakia and Czech Republic.” The report called for higher tariffs on Chinese EVs, estimating they could cost Europe’s carmakers 7 billion euros a year in lost profits by 2030. In the EU, Chinese-made EVs typically sell for 20% less than those made in the bloc, and their share of the EV market, which has grown to 8%, could reach 15% by 2025, according to Reuters. “No one can match BYD on price. Period,” Michael Dunne, CEO of Asia-focused car consultancy Dunne Insights, told the Financial Times earlier this month. “Boardrooms in America, Europe, Korea, and Japan are in a state of shock.” Tesla CEO Elon Musk has gone from laughing about the quality of BYD cars in 2011 to suggesting recently that Chinese companies will emerge as dominant players in the global automotive industry. In the EU, Chinese EV makers face 10% tariffs, versus 27.5% in the U.S. That’s encouraged them to target Europe as their home market gets increasingly crowded, although they’re also growing in Southeast Asia, Mexico, Australia, and elsewhere. Indeed, China has recently overtaken Japan as the world’s largest car exporter. This month, BYD’s first chartered cargo ship—dubbed the BYD Explorer No. 1—embarked on its maiden voyage. Capable of carrying 7,000 cars, its destination is, predictably, Europe. This story was originally featured on Fortune.com Related Quotes "
}