{
    "title": "Tesla investors see 'no floor' after losing $300b",
    "date": "1/27/2024",
    "url": "https://www.afr.com/markets/equity-markets/tesla-investors-see-no-floor-after-losing-300b-20240127-p5f0el",
    "text": "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Tesla investors have not had a stretch this bad in a long, long time. Shares of Elon Musk’s electric-vehicle giant have dropped 26 per cent this month, wiping out $US205 billion ($300 billion) in market valuation. The stock is on pace to close lower for the sixth straight week, its longest losing streak since 2016. For perspective, at that point Tesla had not even launched its first mass-market car, the Model 3. “There’s no floor in this stock in the near term,” Adam Sarhan, founder and chief executive of 50 Park Investments, said in an interview. “Investors are scratching their heads. If Tesla is lowering its forecast and is not bullish on the near term, why should investors be bullish?” “Tesla’s December results and outlook effectively pushed back the positive inflection point in the business by a year,” said Gene Munster of Deepwater Asset Management. FDC There are plenty of reasons for the sell-off. The auto industry is warning about plunging demand for EVs. Hertz Global Holding, the rental-car behemoth, pulled back from plans to expand its electric vehicle fleet, and Ford Motor said it was seeing a weaker market for them. Meanwhile, Tesla instituted several price cuts, sparking worries about thinning margins. Then came Wednesday’s (Thursday AEDT) fourth-quarter earnings report, when the company said it expected to expand at a “notably lower” rate in 2024, but did not give any further details. The stock tanked on the news. Since then, at least two analysts have downgraded the stock, while several have cut their price targets on it. The average price target on Tesla has fallen by nearly 8 per cent since Tuesday’s close, according to data compiled by Bloomberg, and now sits at $US220.34. The shares are trading at around $US182. Long-time bullish Tesla analyst, Wedbush’s Daniel Ives, removed the stock from his “Best Ideas List”, saying the lack of details on price cuts, outlook, demand from the company is “a bitter pill to swallow for the bulls”. Ives still has a buy equivalent rating on the stock, but has also lowered his price target. The stock could stay in flux for a while, considering Tesla’s reluctance to lay out a road map and an EV winter that is expected to plague the entire industry this year. “Tesla’s December results and outlook effectively pushed back the positive inflection point in the business by a year,” said Gene Munster, of Deepwater Asset Management. “Now it looks to be the second half of 2025 before revenue growth will accelerate. In the near term, shares will likely drift lower in what will be a vacuum of good news.” Still, for a stock that can move vigorously in either direction once sentiment shifts, this month’s sharp dive also could open the doors to a quick bounceback. Technical signals suggest the stock has dropped into “oversold” territory, which typically signals a coming reversal. The violent drop “in less than one month has taken it to the kind of oversold level that has only been exceeded once since it went public”, Matt Maley, chief market strategist at Miller Tabak + Co, wrote in a note on Friday. “This stock might have further to fall before it reaches its ultimate bottom, but the odds that it will see a bounce over the near term are getting quite high.” Still, not everyone is pessimistic. Fund manager David Baron is betting the stock slide will be a bump in the road for Elon Musk’s company before another parabolic rally. The manager of the Baron Focused Growth Fund expects Tesla’s stock to reach $US1200 by 2030, up some 550 per cent from current levels, citing its strong brand. Tesla and Musk’s privately held SpaceX were the fund’s largest holdings as of December 31. Last year, it climbed 28 per cent, beating the 18 per cent rise in its benchmark, the Russell 2500 Growth Index, and the S&P 500’s 24 per cent gain. And despite Tesla’s outlook for slower sales growth this year – a result in part of the EV winter that’s gripping the entire industry – Mr Baron still expects the stock to touch around $US300 in about 12 months. Bloomberg Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}