{
    "title": "Will Enbridge Stock Be Worth More Than Tesla by 2026?",
    "date": "1/22/2024",
    "url": "https://www.fool.ca/2024/01/22/will-enbridge-stock-be-worth-more-than-tesla-by-2026/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. With Tesla facing big competition and Enbridge expected to steadily grow, it seems like Enbridge stock will be fast approaching Tesla’s. Image source: Getty Images Enbridge Inc. (TSX:ENB) is one of Canada’s leading energy infrastructure companies. Today, Enbridge’s stock price trades at a mere $48 per share, or 15 times next year’s earnings. This compares to Tesla Inc. (NASDAQ:TSLA) stock, which trades at $214 per share, or 44 times next year’s earnings. With Enbridge, we get a predictable and growing business that’s protected by strong barriers to entry.  With Tesla, on the other hand, we get a lot of uncertainty and growing competition, placing its business at risk. So, let’s consider the question – will Enbridge stock be worth more than Tesla by 2026? Enbridge transports and distributes oil and gas in its extensive North American pipeline system. In fact, Enbridge moves about 30% of North America’s crude oil. It also transports nearly 20% of the natural gas consumed in the U.S. In recent years, the company has made efforts to diversify its business in response to the pressing need for renewable, clean energy. Investments in areas such as liquified natural gas, storage, and offshore wind are securing Enbridge’s future growth. Also, Enbridge’s recent acquisition of three U.S. natural gas utilities will provide additional low-risk, regulated revenue. This will help strengthen the balance sheet and further position Enbridge for the energy transition. These strategic moves are setting Enbridge up for long-term growth and success. The problem with Tesla is mainly that competition in the electric vehicle market is intense. Hyundai/Kia, for example, captured the number two spot in U.S. electric vehicle sales last year. In fact, the company’s growth in electric vehicles outpaced both Tesla and the broader electric-vehicle market last year. This has been something that the company has been aggressively working on in the last few years. Today, Hyundai offers a broad line-up of almost 10 electric vehicles, with battery technology that has faster charging. In contrast, Tesla offers four different types of electric vehicles at this time. So what this means for Tesla is that its market share is slipping as competitors such as Hyundai rise. In fact, Tesla’s share of the U.S. electric vehicle market fell to 55% last year while Hyndai/Kia’s share stands at approximately 8%. To make matters worse for Tesla, competition from more players is expected to explode in the next year as the number of electric vehicle models available for sale is expected to almost double to approximately 100. The market is clearly heating up, and the road ahead will be increasingly more difficult for Tesla. Given all of this information, it appears likely that Tesla’s stock price is at risk. At the very least, it appears that the risk/reward proposition of Tesla is quickly deteriorating. There’s nothing like a hyper competitive market to destroy a company’s advantage. And this appears to be what is brewing in the electric vehicle market. So, with Tesla’s advantage slowly being chipped away, its multiple and earnings forecasts will likely decline. To be fair, it’s extremely difficult to predict 2026 earnings in this environment that’s so fast changing. Yet, it’s not a stretch to say that Tesla’s stock price will get hit in the next couple of years. In contrast, Enbridge remains the beacon of predictability. Steady growth over the next couple of years, mixed with continued advancement of its growth strategy, can very likely send Enbridge’s stock price significantly higher. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 15, 2024 | Karen Thomas, MSc, CFA While Cenovus Energy is a quality oil stock, its dividend yield doesn't compare to the yields of Suncor or Canadian… Read more » March 13, 2024 | Puja Tayal Investors who purchased Algonquin stock in 2022 are 40% in the red as the company underwent restructuring. Is it still… Read more » March 13, 2024 | Amy Legate-Wolfe If you want monthly passive income, consider this stock. Here’s how to achieve all that income in the first place.… Read more » March 13, 2024 | Karen Thomas, MSc, CFA Cameco stock has stalled recently, but things might be turning around again as increased nuclear spending in the U.S. takes… Read more » March 13, 2024 | Christopher Liew, CFA Two stocks are poised to skyrocket in the impending comeback and bull run of the energy sector in 2024. Read more » March 13, 2024 | Chris MacDonald Many investors may be wondering why Northland Power (TSX:NPI) is down so much, and here are a few reasons to… Read more » March 12, 2024 | Jitendra Parashar These two rallying Canadian energy stocks can continue their bullish runs in 2024 and beyond. Read more » March 12, 2024 | Sneha Nahata Investors could consider top energy stocks like Enbridge for reliable dividend income. Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}