{
    "title": "Musk vs. Zuckerberg: Elon seems to envy the other CEO's Meta control",
    "date": "1/19/2024",
    "url": "https://www.businessinsider.com/tesla-elon-musk-vs-mark-zuckerberg-envy-meta-ceo-power-2024-1",
    "text": "       Elon Musk and Mark Zuckerberg have been trading barbs for years. And earlier this week, Musk found another reason to gripe at the other CEO and founder — about the company structure that gives him a big chunk of voting control over Meta — even as Musk himself seeks to tighten his hold on Tesla. Musk appeared to give Tesla's board an ultimatum on Monday, saying he wants 25% voting control at Tesla or he'll stop growing AI development at the electric-car maker. (He currently has about a 13% stake in Tesla and had around 22% before he sold off some of his shares to fund his Twitter purchase in 2022.) One way of getting that would be via a dual-class stock structure. This isn't uncommon and could mean Musk wouldn't necessarily get more shares but that the ones he held would deliver more voting power. One problem: while Musk would be \"fine\" with that, he's been \"told it is impossible to achieve post-IPO in Delaware,\" he wrote on X, formerly Twitter. Tesla IPOed in 2010. Zuckerberg, however, has supervoting shares at Meta that are equivalent to 10 votes per share. The company's dual-class stock structure provides Zuckerberg and select executive managers and directors with them. So, while Zuckerberg only owns about 13% of Meta's stock, he holds over 50% of total voting power, meaning he essentially has a complete veto over other shareholders. And the fact Musk can't now change Tesla's structure seems to have irked the billionaire — and made him sound a bit envious. \"It's weird that a crazy multi-class share structure like Meta has, which gives the next 20+ generations of Zuckerbergs control, is fine pre-IPO, but even a reasonable dual-class is not allowed post-IPO,\" Musk wrote. It's not the first time Musk has criticized Zuckerberg's control of Meta, but he now appears to want at least half that level at Tesla — though he doesn't seem to want to make himself irreplaceable. Related stories \"If I have 25%, it means I am influential, but can be overridden if twice as many shareholders vote against me vs for me,\" he wrote on X. \"At 15% or lower, the for/against ratio to override me makes a takeover by dubious interests too easy.\" Tesla did not immediately respond to emails from Business Insider requesting further comment. Some Tesla shareholders have spoken out against Musk's request. And it could be a risky decision, according to finance experts, who pointed to Musk's unorthodox behavior in recent months, allegations of illegal drug use, as well as the negative impact of Musk's Twitter acquisition on Tesla's stock. \"The whole situation points to an important weakness of Musk—insufficient respect for the outside shareholders who are contributing the capital that is essential to developing his vision,\" Chester Spatt, a professor of finance at Carnegie Mellon University and a former Chief Economist for the SEC, told BI. Musk has also previously faced scrutiny over his control of Tesla's board, which includes his brother and several close friends. The billionaire is still awaiting a ruling in Delaware on his more-than-$50-billion compensation package after a Tesla shareholder sued Musk and the carmaker, alleging Musk had undue influence over the pay plan. Musk does not receive a salary from Tesla and his pay package centers on a series of goalposts around the carmaker's financial growth, set in place in 2018. Specifically, the plan involves a 10-year grant of 12 tranches of stock options vested when Tesla hits certain targets. According to the carmaker, Tesla has accomplished all of the 12 targets as of 2023. When each milestone is passed, Musk gets stock equal to 1% of outstanding shares at the time of the grant. While experts point to the \"unusual nature\" of Musk's compensation package, it might be the only way to keep Musk's focus on Tesla, according to Joshua Tyler White, a former financial economist for the SEC and an assistant professor of finance at Vanderbilt. Musk also has a hand in five other companies, including SpaceX, X, and The Boring Company. \"Musk's so wealthy at this point that money doesn't really motivate him, power does,\" White said. \"It creates more utility for him than just making another few billion dollars.\" With a 25% stake, Musk's power would be far more limited than Zuckerberg's voting power at Meta, but his request to create a dual-class structure post-IPO is a more peculiar one, according to experts. Between 2017 and 2019 nearly a third of the companies that went public had a dual-class structure, according to a study by Ofer Eldar, a corporate governance expert out of UC Berkeley. The structure is designed to motivate founders to take their companies public while still allowing them to maintain a higher level of control. \"Zuckerberg probably wouldn't have gone public without a dual-class structure,\" White said. Meantime, it would be virtually impossible for a listed company like Tesla to enact a dual-class structure now. One of the only ways for a company to implement a tiered voting system after already going public would be to go private and file a new IPO, as Michael Dell did in 2018. That could spook investors after the fallout from the last time Musk discussed taking Tesla private. Ultimately, Musk's call for a 25% stake might be a warning sign. Case Western Reserve University corporate law professor Anat Alon-Beck told BI she sees two primary reasons for Musk's request: he thinks he's likely to lose the Delaware case, or he's facing pressure behind the scenes from an activist investor. Erik Gordon, a professor at the University of Michigan's Ross School of Business, added that Musk followed Sam Altman's ousting at OpenAI closely and it might be playing into his fears, especially as more Tesla owners and investors have begun to speak out against his actions on social media. \"Maybe he's a little less confident that shareholders will go along with what he says,\" Gordon said. Read next Jump to "
}