{
    "title": "Ignore The Pessimism: Tesla Is Undervalued, Isn't Likely To Collapse \nAnytime Soon (TSLA)",
    "date": "1/26/2024",
    "url": "https://seekingalpha.com/article/4665354-ignore-the-pessimism-tesla-is-undervalued-not-likely-to-collapse-anytime-soon",
    "text": "Spencer Platt Spencer Platt In my previous article, I discussed many possible outcomes for Tesla, Inc. (NASDAQ:TSLA). Since that article, the stock has tanked by 28.88% because of the fall in margins. After the Q4 2023 earnings release, TSLA stock tanked around 10% fueled by a miss on revenue and Tesla's warning of a slowdown this year. Nevertheless, I will maintain my strong buy rating on Tesla stock, and I will demonstrate why this fall in stock price has made Tesla's stock undervalued. Seeking Alpha Seeking Alpha Tesla's charging network ranks second in the U.S. with 33,000 locations, mainly comprising level 3 chargers, positioning the company as a dominant player in the electric vehicle (\"EV\") charging market. This segment is projected to experience a substantial 36% growth rate, reflecting the increasing demand for electric vehicles nationwide. Author's Calculations based on many sources Author's Calculations based on many sources In terms of Tesla's potential revenue streams, its insurance venture holds significant promise, with forecasts going as far as suggesting it could contribute up to 30% of the company's profits. Despite initial challenges, such as website crashes upon launch and the reliance on safety scores derived from vehicle data to determine premiums, some people speculate that Tesla's insurance business could bring around $250 billion in revenue at some point. Currently, the worldwide car insurance market is expected to grow at a CAGR of around 7.38%. Furthermore, Tesla's involvement in the solar business, offering products like solar panels, solar roofs, string inverters, and batteries, is expected to witness a global growth rate of 6.9% through 2029. Author's Calculations based on Fortune Business insights Author's Calculations based on Fortune Business insights Tesla's revenue has exhibited remarkable growth, averaging an annual pace of 120.5%. However, this growth has unmistakably begun to decelerate. If we examine the growth rates from 2021 to 2023, we observe an annual growth rate of approximately 27%. Since my previous article was released in Q2 2023, revenue has increased by 2.12%. Operating income plummeted by 29.7%, driven by price cuts. Nevertheless, net income surged by 23.1%, buoyed by a tax benefit of around $5.75 billion in Q4 2023. The operating margin, understandably, is lower than in Q2 2023 when my previous article was published, standing at around 9.19%, down from the previous 13.46%. However, aided by the substantial tax benefit, the net income margin ascended from 12.97% to 15.5%. Nevertheless, what you can see is that even though Tesla has been slashing prices, the operating margin has grown as well as the net income margin. Author's Calculations Author's Calculations Author's Calculations Author's Calculations Tesla boasts excellent financial health. Total debt has been declining at an annual rate of -9.5%, while cash reserves have surged by an impressive 127.3% annually-an uncommon feat in the capital-intensive industry. Cash reserves have grown by 26%, whereas total debt decreased by approximately 10% from Q2 2023 to Q4 2023. Author's Calculations Author's Calculations Furthermore, free cash flow (\"FCF\") has seen consistent growth at an annual pace of 59.6% since 2017. In my previous article, this metric stood at $5.1 billion, but has since soared to $9.5 billion, marking an 86% increase. However, it's important to note that this surge was largely attributed to the substantial $5.7 billion tax benefit. The free cash flow margin has naturally increased from 5.5% to 9.8%, aligning more closely with the margins recorded since 2020. Author's Calculations Author's Calculations Author's Calculations Author's Calculations Author's Calculations Author's Calculations In summary, Tesla stands as a robust company, boasting ample cash reserves and minimal debt. This positions Tesla advantageously against competitors, affording the company the luxury to adjust car prices without the looming risk of defaulting on substantial debt obligations. This valuation will encompass two models. The first model will be derived from the estimates available at Seeking Alpha, focusing on both revenue and EPS. The second model will be based on my estimates of potential sales behavior resulting from price cuts, drawn from historical data. It's important to note that the calculation of depreciation and amortization (D&A), interest expenses, and prospective capital expenditures relies on margins associated with revenue. This may be the sole assumption within this context, as Tesla maintains the flexibility to adjust its capital expenditures and interest expenses, potentially increasing long-term debt. Moreover, the WACC will be calculated from this table. As mentioned earlier, the first model will be based on available estimates for Tesla. These estimates can be found on Seeking Alpha under the \"Earnings\" tab for the Tesla stock ticker. The estimates presented in the table below indicate that Tesla's EPS is projected to increase by 206.18% by 2030. Furthermore, they suggest that Tesla will achieve approximately $334.8 billion in revenue by 2030. The projections also indicate that the net income margin is expected to remain around 10% through 2030. However, my projections only extend to 2029, as per available data. It's important to note that while the projections on Seeking Alpha extend to 2032, I have omitted 2031 and 2032 due to insufficient analyst support for those years. Additionally, following the release of Q4 2023 earnings, the EPS consensus for those years has been withdrawn. Author's Calculations Author's Calculations According to the available estimates, Tesla is anticipated to be fairly priced at $311.12, indicating an upside of 67%. Moreover, if the components of equity continue to grow at the same pace observed from 2017 to 2023, the future price of the stock could reach approximately $666.51. This projection implies annual returns of around 43% through 2029. The second model comprises my estimates. As illustrated in the table, it outlines the anticipated sales of Tesla, influenced by price reductions. According to my projections, these cuts could amount to around 5.3% annually, aiming to align with Tesla's goal of offering $25,000 vehicles. It's noteworthy that the average price cuts observed from 2019 to 2022, averaging 7.7%, resulted in an average sales growth of 50.2%. Additionally, Tesla surpassed estimates by delivering 1.8 million cars, selling approximately 15,581 more vehicles than projected. Looking ahead to the 2024 outlook, which currently remains unavailable and is anticipated to be disclosed in the next earnings release (Q1 2024), as communicated by Vaibhav Taneja, Tesla's CFO. Taneja said then that Tesla was focused on \"growing our volumes in a very cost-efficient manner,\" and would provide 2024 guidance on the next earnings call. Tesla Q4 2023 Tesla Q4 2023 To project the other two segments, I will continue using the percentage of revenue they represented in Q2 2023. Then, I will project them based on their respective market CAGR, which is 7.38% for services (excluding the charging network & others) and 6.9% for solar. Author's Calculations Author's Calculations This model presents more optimistic outcomes compared to the previous one, indicating a fair price per share of approximately $358.89, translating to a 92.7% upside from the current stock price of $186.29. Furthermore, the projected future price for 2029 is approximately $766.68, suggesting annual returns of around 51.9%. The narration regarding \"falling margins\" is incomplete. Tesla's recent drop in margins occurred rapidly due to the immediate effects of price cuts. However, considering historical data (available in the financials section of this article), it becomes evident that Tesla has actually increased its operating margin over time. Therefore, it is incorrect to assume that Tesla's operating margins will suddenly plummet to 1-3% and remain at that level indefinitely. Electrek Electrek BYD Company Limited (OTCPK:BYDDF) is closely comparable to Tesla for two main reasons: 1) cheaper cars; and 2) government support and Chinese preference for national products. Observing BYD's operating margins, it's apparent that its operating margin is around 5.18%, with a net income margin of approximately 4.9%. This illustrates the first reason behind BYD's affordability: the company is willing to sacrifice earnings. Additionally, BYD, along with most of its EV counterparts in China, enjoys backing from the Chinese Government through subsidies, stock purchases, and access to cheap credit. An important distinction is that BYD manufactures its own batteries, a practice Tesla does not currently undertake. However, Tesla is developing a lithium refinery in Texas set to be operational by 2025, potentially enabling Tesla to match BYD's pricing in the future. Consequently, both brands may converge in pricing, with consumers likely favoring Tesla due to its luxury brand perception, a distinction BYD lacks as Chinese products are often associated with inferior quality. Tesla boasts one of the largest charging networks globally, and with numerous players already saturating the market, there's little incentive for new entrants. Consequently, BYD has opted to collaborate with Shell plc (SHEL) & many other EV charging networks instead of developing its own charging infrastructure, leaving this market firmly within Tesla's grasp. Remember that partnerships can be broken. Looking at estimates for BYD, it's clear they're projected to generate significantly less revenue than Tesla by 2030, with Tesla forecasted to reach around $330 billion in revenue. BYD's revenue is estimated to grow at a CAGR of around 20% through 2030, while Tesla is expected to grow at around 35%. Therefore, the expectation that BYD will bankrupt Tesla is unfounded. Moreover, Tesla remains a hotbed of innovation. BYD Revenue Estimates (Seeking Alpha) Tesla Revenue Estimates (Seeking Alpha) BYD Revenue Estimates (Seeking Alpha) Tesla Revenue Estimates (Seeking Alpha) The primary risk associated with my estimates is the possibility that Tesla may not achieve the anticipated sales volume. Essentially, Tesla is striving to emulate Toyota Motor Corporation (TM). I believe we should have greater confidence in Tesla, given its track record of avoiding bankruptcy on multiple occasions. This should reassure investors of Tesla's adeptness at reducing prices while maintaining profitability. Another risk pertains to CEO Elon Musk's somewhat controversial behavior. Instances of this have led to issues in Europe, where the company is grappling with trade unions. Such tensions are particularly concerning in Europe, a key consumer market globally. Additionally, there's the risk posed by Chinese car companies, as the Chinese state has demonstrated its willingness to support domestic companies through various means, such as providing cheaper credit or purchasing their stock. Unlike Tesla, these companies have government backing to mitigate the risks of bankruptcy. I don't perceive price cuts as a significant risk, as this aligns with Musk's primary objective of selling $25,000 in electric cars and potentially expanding into buses and trucks. Investors who believed that Tesla would maintain prices around $70,000 may not have been paying attention. In conclusion, despite Tesla's recent 28.88% stock decline attributed to the immediate effect of price cuts which caused margins to drop and a subsequent 10% drop post-Q4 2023 earnings release, I maintain a strong buy rating on the company. The dip in stock price has rendered Tesla undervalued, presenting an opportune moment for investment. Tesla's charging network, which operates in a market expected to deliver 36% growth, and its potential in the insurance and solar sectors indicate promising revenue streams. Financially, Tesla exhibits robust metrics with decreasing debt, surging cash reserves, and growing free cash flow. Valuation models suggest significant upside potential, with estimates projecting a fair price per share of $311.12 to $358.89, offering considerable returns. Risks include Tesla's sales projections, Elon Musk's controversial conduct, and competition from Chinese car companies, yet Tesla's commitment to price cuts and profitability aligns with its long-term vision of democratizing electric vehicles. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, but may initiate a beneficial Long position through a purchase of the stock, or the purchase of call options or similar derivatives in TSLA over the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}