{
    "title": "Tesla Stock Tests Support As EV Giant Cuts Vehicle Range Estimates In The \nU.S.",
    "date": "1/5/2024",
    "url": "https://www.investors.com/news/tesla-stock-tests-support-as-ev-giant-cuts-vehicle-range-estimates/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     Tesla (TSLA) updated range estimates on two Model Y variants in the U.S. Thursday night, reducing the range on its Long Range and Performance trims by around 6%, according to the company website. Meanwhile, Tesla will also perform over-the-air updates to 1.6 million vehicles in China. TSLA shares edged slightly lower Friday, trying to hold a key support level. Tesla late Thursday reduced the estimated range on its Model Y Long Range to 310 miles from 330, and the Model Y Performance to 285 miles from 303. The U.S. EV giant maintained the range estimate of 260 miles on the rear-wheel drive version of the Model Y. It also appears that Tesla cut the range on its luxury Model S and Model X vehicles. The Model X Long Range vehicle currently has an estimated range of 335 miles, down from the previous 348. Tesla's Model X Plaid has a range of 326 miles from 333. The Model S Plaid now has an estimated range of 359 miles, down from 396 miles. TSLA's Model S Long Range estimated range remains unchanged. Tesla stock angled 0.2% lower to 237.43 Friday during market action. On Thursday, TSLA edged down 0.2% to 237.93, with the shares down more than 4% on the week essentially on their 10-week line. There is no change in price for any of the vehicles. It is unclear exactly why Tesla changed the range estimates. However, it may reflect a change in Environmental Protection Agency (EPA) testing methods. The EPA now mandates new testing for 2024 model year and later vehicles. Under the new testing standard, all EV manufacturers that sell in the U.S. must test acceleration and ride height modes in best and worst-case scenarios and average the results. This is in an attempt to get a more accurate real-world range estimate. Tesla has consistently fared poorly in real-world range tests, with reports that the EV company substantially overstates vehicle range. Meanwhile Tesla will be performing over-the-air updates on 1.6 million vehicles in China, essentially all its units sold in the world's biggest EV market. Tesla is recalling a total of 1,610,105 vehicles with production dates between August 26, 2014, and December 20, 2023, according to a statement on the website of China's State Administration for Market Regulation. The mandated fix has to do with concern from regulators about misuse of the the automatic assisted steering function and possible increased risk of a vehicle crash. Tesla will perform an over-the-air update with new features that will urge drivers follow driving regulations while the assist driving system is in operation, CnEVpost reports. This appears to be similar to the OTA recall that Tesla announced last month in the U.S., as part of the NHTSA's ongoing Autopilot probe. Tesla stock is building the right side of a double-bottom base, according to MarketSmith analysis. It now has a handle with a 265.13 buy point, But TSLA stock is fighting to hold the 10-week line, with the 50-day and 200-day not far below that. The relative strength line, which tracks a stock's performance vs. the S&P 500, is not far from its recent October lows. In 2023, Tesla doubled, easily outperforming the broader S&P 500 index. Tesla stock ranks fifth in the 35 member IBD Auto Manufacturers industry group. The stock has a 75 Composite Rating out of a best-possible 99. Tesla also has an 86 Relative Strength Rating and an 88 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla Stock A Buy Or A Sell? Stocks Near A Buy Zone Learning How To Pick Great Stocks? Read Investor's Corner Is Rivian A Buy Right Now After The Cybertruck Delivery Event? Futures Fall As Boeing Tumbles On FAA Grounding 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}