{
    "title": null,
    "date": "1/29/2024",
    "url": "https://finance.yahoo.com/news/heres-the-big-investing-lesson-from-sloppy-earnings-reports-out-of-tesla-intel-levis-citi-and-others-110010590.html",
    "text": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with: The chart of the day What we're watching What we're reading Economic data releases and earnings With earnings, so has begun the execution of one of my three hobbies: reading an insane amount of earnings call transcripts (go ahead and guess the other two). While I definitely take this practice way too seriously, the reality is this hobby helps bring to the surface an interesting theme thus far in earnings season: stumbling iconic companies inside a still-solid economy. A couple of stumblers for your watch list: Tesla (TSLA): Weak quarterly numbers, worrying earnings call with no guidance, and cautious post-EPS analyst commentary, all leading to a stock hammering. Wedbush analyst and Tesla watcher Dan Ives had some choice words about the company on Yahoo Finance Live. Intel (INTC): Weak quarterly numbers, uninspiring Q1 guidance, cautious post-EPS analyst commentary, and another stock hammering. Intel CEO Pat Gelsinger offered up his trademark energetic take on the results and outlook in the above video. Levi’s (LEVI): Ugly performance in the department store channel and a new CEO laying off 10% to 15% of the workforce. Levi's CFO Harmit Singh sounded a touch more cautious on Yahoo Finance than when we last talked to him several months ago. Citi (C): Just an all-around dreadful earnings day as CEO Jane Fraser restructures the bank, including thousands of layoffs, as reported by Yahoo Finance's David Hollerith. Going through these reports and earnings calls, I can’t help but think about why this is happening at this point in the economic cycle. Will it happen to the rivals of the aforementioned companies? Does Tesla’s commentary signal a weak outlook from Ford's and GM's earnings next week? Does Levi’s soft sales at department stores mean bad results from Macy’s in February? What’s next for these companies and their leaders (like Levi's new CEO Michelle Gass, who's credited with not doing a great job at Kohl's)? More questions than answers about these companies, no doubt. But I fancy one conclusion that should be factored in when you are eyeing a stock in February, March, or whenever. Bad earnings and outlooks are bad earnings and outlooks for a reason. Very often, they reflect poor execution relative to a competitor, structural industry challenges, or both. Execs may hype that things will get better soon, but they often don’t — and sometimes they get worse. And in this context, a stock that may seem \"cheap,\" trading on a PE multiple of 6x forward earnings is nothing more than a value trap. Go read some earnings call transcripts today and become a better investor! Brian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on Twitter/X @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com. Click here for in-depth analysis of the latest stock market news and events moving stock prices. Read the latest financial and business news from Yahoo Finance Related Quotes "
}