{
    "title": "Could buying this growth stock at $5 be like investing in Tesla in 2010?",
    "date": "1/15/2024",
    "url": "https://www.fool.co.uk/2024/01/15/could-buying-this-growth-stock-at-5-be-like-investing-in-tesla-in-2010/",
    "text": "Joby Aviation (NYSE: JOBY) is taking a leaf straight out of the Tesla playbook. But can the growth stock deliver similar life-changing returns from $5 today? The content of this article was relevant at the time of publishing. Circumstances change continuously and caution should therefore be exercised when relying upon any content contained within this article. Image source: Getty Images When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. Trying to identify the next growth stock that goes up 10, 50, or 100 times in value isn’t easy. It usually means investing in an industry of the future, which again isn’t straightforward (3D printing stocks, anyone?). But it’s important to remember that the market’s big winners weren’t always viewed as no-brainers. In the mid-1990s, it wasn’t certain many people would ever trust Amazon/the internet with their bank card details. Meanwhile, the idea of an electric vehicle (EV) start-up like Tesla disrupting the mighty auto industry was widely seen as absurd in 2010. It sill is by some. As daft as it sounds, though, I think electric flying taxis may soon take off, in more ways than one. And Joby Aviation (NYSE: JOBY), whose shares are at $5, is currently the leader in this space. Here’s why I’ve invested. The Toyota-backed company is building four-passenger electric vertical take-off and landing (eVTOL) aircraft. In layman’s terms, flying taxis that carry four passengers. They lift off like a helicopter, fly like a traditional aircraft, but are near-silent like EVs. The benefits here include less pollution and noise, traffic reduction, and much shorter journeys. With a top speed of 200 mph, they’re perfect for regional air mobility (airport runs, city-to-city trips, etc). Joby acquired Uber Elevate in 2020, with the two companies agreeing to integrate their respective services into each other’s apps. It expects to begin commercial operations in 2025. However, there are still regulatory hurdles to overcome with the Federal Aviation Administration. The company has made great progress here, but there’s still more work to secure full airworthiness certification. As part of this process, the company successfully performed an exhibition flight in New York City in November. While this marked the first ever such flight over the city, a delay to commercial operations remains a risk. Put simply, Joby is trying to do in the air what Tesla has achieved on the ground with EVs. And it is following Elon Musk’s firm in a couple of specific ways: Similar to Elon Musk investing in Tesla after leaving PayPal, Joby’s executive chairman Paul Sciarra invested in the eVTOL start-up then left Pinterest, the internet company he co-founded. The firm currently has a market cap of $4bn. This reflects a lot of optimism as the industry leader, but there is competition, notably from Archer Aviation. However, one thing I like here, especially in this higher interest rate environment, is that the company remains well-capitalised (for now). At the end of September, it had $1.1bn in cash. It’s too early to tell whether investing in Joby at $5 will be like investing in Tesla in 2010. It’s very high-risk. But I’m convinced there will be a big winner in this market, which Morgan Stanley predicts could reach $1trn by 2040. For now, I’m keeping my holding small. If it flops, it won’t harm my overall portfolio. But if Joby does turn out to be the next Tesla, I’d only need a small investment to make fantastic returns.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Ben McPoland has positions in Archer Aviation, Joby Aviation, and Tesla. The Motley Fool UK has recommended Amazon, PayPal, Pinterest, Tesla, and Uber Technologies. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 25 March, 2024 | Sumayya Mansoor This Fool explains how passive income stocks can help to create an additional income stream and details two picks she… Read more » 25 March, 2024 | Royston Wild These FTSE 250 trusts are on sale right now! And Royston Wild thinks they may be great last-minute buys for… Read more » 25 March, 2024 | Royston Wild The Lloyds share price has rebounded sharply after a tough start to 2024. Can it keep going, or will the… Read more » 25 March, 2024 | Sumayya Mansoor I reckon this FTSE 100 has been going under the radar, and recently posted excellent full-year results. Should I buy… Read more » 25 March, 2024 | Mark Rogers Ice ideas will usually offer a steadier flow of income and is likely to be a slower-moving but more stable… Read more » 25 March, 2024 | Royston Wild I'm searching the London market for the best dividend stocks to buy for my portfolio. Here are two that currently… Read more » 25 March, 2024 | Alan Oscroft Upbeat FTSE 100 results have been coming in, and interest rates must surely fall this year. Investors could be smiling… Read more » 25 March, 2024 | Ben McPoland They say statisticians don't play the lottery for obvious reasons. Fortunately, Warren Buffett has shown us a great way of… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}