{
    "title": "2023 Deal Of The Year Awards: Toyota, Tesla, Scout Motors, AWS",
    "date": "1/12/2024",
    "url": "https://businessfacilities.com/2023-deal-year-awards-toyota-tesla-scout-motors-amazon-web-services/",
    "text": "Home » Economic Development » Press Releases » Toyota, Tesla, Scout Motors, Amazon Web Services Top 2023 Deals Of The Year EV industry, data center investments took top honors in Business Facilities’ annual awards, which recognize significant corporate relocation and expansion investments. RED BANK, NJ — Each January, Business Facilities, a leading publication for corporate site selectors, recognizes economic development organizations for their work in securing significant corporate relocation, expansion, or retention projects. The annual Business Facilities Deal of the Year Awards focus on capital investment, jobs creation, and innovation. While entries for the Business Facilities 2023 Deal of the Year awards included corporate relocation and expansion projects across a vast array of industries, it was clear 2023 was the year the electric vehicle (EV) industry supercharged its forward momentum. As evaluated by the judging panel and Business Facilities editors, three of the four 2023 Deal of the Year award winners are in the burgeoning EV sector. Economic development organizations submitted entries for projects announced or taking place between September 2022 through 2023. The Business Facilities 2023 Deal of the Year Awards are as follows: “This year’s Deal of the Year winners represent billions of dollars in capital investment and thousands of jobs for the communities where these companies have chosen to establish operations or to expand on their success,” said Anne Cosgrove, Business Facilities Editorial Director. “The significance of these investments will be seen for years to come. We congratulate the economic development teams that worked to bring these projects to fruition.” In addition to the four Deal of the Year awards above, Business Facilities editors also select a number of projects from the pool of entries for recognition for the magazine’s Impact Awards. The 2023 Platinum Deal of the Year Award recognizes the State of North Carolina for supporting the growth of Toyota’s EV manufacturing operations. This support culminated most recently in the company announcing an $8 billion investment to expand its Greensboro-Randolph megasite. This expansion in Liberty, NC will bring total investment at the Toyota Battery Manufacturing North Carolina (TBMNC) to nearly $14 billion since 2021. Slated for completion in 2025, direct job creation will total 3,000. As Toyota continues its drive toward global vehicle electrification, the company’s significant investment in North Carolina over several years is testament to the strides it is making at this location. The 2023 Gold Deal of the Year Award winner is the Nevada Governor’s Office of Economic Development (GOED) for its work to secure Tesla’s expansion of its gigafactory in Storey County in northern Nevada. In January 2023, the company announced a capital investment of $3.6 billion to build two factories at the site: a battery cell factory with capacity to produce batteries for 1.5 million light-duty EVs annually, and Tesla’s first Semi factory, a fully electric combination truck. The expansion project is expected to create 3,000 direct jobs. Since 2014, Tesla’s capital investment in Nevada totals $6.2 billion with the construction and operation of the 5.4 million square foot gigafactory in Storey County. The 2023 Business Facilities’ Silver Deal of Year Award recognizes the South Carolina Department of Commerce, along with Richland County, South Carolina, for successfully attracting Scout Motors to Blythewood, SC. Owned by Volkswagen AG, Scout Motors is undergoing a relaunch to market, and the company’s $2 billion investment for a new manufacturing facility in South Carolina is a linchpin of that strategy. Located outside of Columbia, SC in an industrial park along I-77, the company plans to create 4,000 jobs at the site where it will build all-electric trucks and rugged SUVs. The Business Facilities Bronze Deal of the Year Award recognizes the Virginia Economic Development Partnership for its work to secure Amazon Web Services’ (AWS) continued expansion of its data center campuses across the Commonwealth. In 2023, the Amazon subsidiary announced it will invest $35 billion by 2040 to build data center facilities in Virginia. Between 2011 and 2021, AWS invested nearly $52 billion in the state, with more than 8,700 employees at more than 50 data centers. With the 2023 investment announcement, AWS plans to add 1,000 jobs in the coming years. Along with Business Facilities’ editors, the 2023 Deal of the Year judges are John Boyd, Principal, The Boyd Company, Inc.; Linda Burns, Incentives Practice Leader, WDG Consulting; and Dana Crater, Director of Technical Assistance, International Economic Development Council (IEDC). As part of the Deal of the Year Awards, Business Facilities editors select a number of projects from the pool of entries for recognition for the magazine’s Impact Awards. Now in its third year, these awards showcase corporate relocation and expansion investments that are having, or are expected to have, a significant impact on the communities in which they are located. Business Facilities’ 2023 Impact Awards feature 19 projects across a variety of categories. Here are the winners of the 2023 Impact Awards: Advanced Manufacturing: Siemens — City of Fort Worth (Texas) with Fort Worth Economic Development Partnership; Tarrant County; Texas Economic Development, Office of the Texas Governor Aerospace/Defense: General Dynamics Electric Boat — AdvanceCT (Connecticut) with Connecticut Department of Economic & Community Development; Town of Groton Agri-Tech: Plant Agricultural Systems (Plant-AS) — Lubbock Economic Development Alliance and Amarillo Economic Development Corporation (Texas) Aviation: Joby Aviation — JobsOhio with Ohio Department of Transportation; Ohio Department of Development; Dayton Development Coalition; Springfield-Beckley Municipal Airport; Greater Springfield Partnership; City of Dayton; Dayton International Airport Building Products Manufacturing: Saint-Gobain/Certain-Teed Gypsum — Putnam County Chamber of Commerce (Florida) with Putnam County Chamber of Commerce/PCEDC; Putnam County Board of County Commissioners; JAXUSA Partnership; Enterprise Florida, Inc.; CareerSource Florida Canada: Magna International & Panattoni Development Co.— City of Brampton, Ontario with City of Brampton Economic Development Office; Panattoni Development Company; Colliers International; CAP Ontario Inc.; NexRock Design Build; BMO Financial Group; Torkin Manes LLP Clean Energy: First Solar — Louisiana Economic Development with One Acadiana; Iberia Industrial Development Foundation Distribution Center: Conair, LLC — Washington County, Maryland with State of Maryland Department of Commerce; Washington County Department of Business and Economic Development; Trammell Crow Company; Binswanger EV/Chemical Processing: Albemarle Corporation — Chester County Economic Development (South Carolina) with South Carolina Department of Commerce; South Carolina Ports Authority; South Carolina Coordinating Council for Economic Development; South Carolina I-77 Alliance; Chester County Economic Development Office; Chester County Council; Duke Energy; L&C Railroad (Gulf & Ohio Railways); readySC, a division of SC Technical College System EV Supplier/Manufacturing: Magna International — Tennessee Department of Economic & Community Development with Lawrence County; City of Lawrenceburg; Lawrence County Chamber of Commerce; Tennessee Valley Authority Food Manufacturing: American Foods Group — Missouri Partnership with Missouri Dept. of Economic Development; Missouri One Start; Missouri Development Finance Board; Missouri Dept. of Agriculture; Missouri Dept. of Transportation; Missouri Dept. of Natural Resources; Missouri Dept. of Corrections; Greater Warren County Economic Development Council; Greater St. Louis, Inc.; Warren County; St. Charles Community College; St. Charles Water District #2; Norfolk Southern, Ameren; Cuivre River Electric; Cochran Engineering; Missouri Farmers Car Foreign Direct Investment (FDI): Enel North America/3Sun USA LLC — Tulsa’s Future and Tulsa Ports (Oklahoma) with Oklahoma Department of Commerce; Public Service Company of Oklahoma Hydrogen Energy: Nel Hydrogen — Michigan Economic Development Corporation with Detroit Regional Partnership Manufacturing Expansion: Ford Meter Box — Grow Wabash County (Indiana) with Northeast Indiana region (Adams, Allen, DeKalb, Huntington, Kosciusko, LaGrange, Noble, Steuben, Wabash, Wells, and Whitley counties) Plastics: Manner Polymers — Jefferson County Development Corporation (Illinois) with Illinois Dept. of Commerce & Economic Opportunity; Intersect Illinois; SI Now Semiconductors: Integra Technologies — Kansas Department of Commerce with Greater Wichita Partnership; City of Bel Aire; U.S. Senator Jerry Moran Social Impact: Westrock Coffee Company — Arkansas Economic Development Commission with Conway Chamber of Commerce; City of Conway; Conway Corporation Solar Panel Manufacturing: Maxeon Solar Technologies — State of New Mexico with New Mexico Partnership; New Mexico Economic Development Department Workforce: Ultra Safe Nuclear Corporation — Gadsden-Etowah Industrial Development Authority (Alabama) with Alabama State Department of Commerce; Alabama Power; Economic Development Partnership of Alabama; City of Gadsden; Northeast Alabama Regional Airport Authority Full coverage of the 2023 Deal of the Year and 2023 Impact Awards will be featured in the January/February 2024 issue of Business Facilities. Business Facilities is a national publication that has been the leading location source for corporate site selectors and economic development professionals for more than 50 years. Save my name, email, and website in this browser for the next time I comment.   Δ Business Facilities is a leading full-service media brand specializing in the site selection marketplace. Through a bi-monthly magazine, e-mail newsletters, a news portal, and its LiveXchange event, Business Facilities has created a dynamic community for C-level executives and economic development organizations.  "
}