{
    "title": "Tesla, SpaceX board members concerned about Elon Musk's 'illegal drug use': \nReport | Mint",
    "date": "1/7/2024",
    "url": "https://www.livemint.com/companies/people/tesla-spacex-board-members-concerned-about-elon-musks-illegal-drug-use-report-11704611299372.html",
    "text": "Elon Musk's volatile behaviour has often been attributed to the high levels of stress or sleepless nights he suffers while running six major companies, including big names like social media platform X, electric car maker Tesla, artificial intelligence company xAI and more. However, a recent report in the Wall Street Journal suggests that Musk's behaviour may also be due to his drug use, which could have major consequences for his six companies and billions of dollars in assets. Also Read | Elon Musk's SpaceX sues US agency that accused it of illegally firing workers The report noted that Musk has often used LSD, cocaine, ecstasy and psychedelic mushrooms at various private parties around the world, where attendees must sign a non-disclosure agreement and hand over their phones before entering. Notably, Musk famously smoked marijuana during an episode of the Joe Rogan podcast in 2018, which drew criticism from NASA, which demanded written assurances from SpaceX that the company was complying with the federal Drug Free Workplace Act. The WSJ report notes that many Tesla board members have talked among themselves about Musk's drug use, but haven't raised a formal concern that would be revealed in official board agendas or meeting minutes. However, many Tesla directors, including current chairman Robyn Denholm, have approached Musk's brother Kimbal Musk for help with Musk's behaviour without using the word \"drugs\". Furthermore, many on Tesla's board believe Musk was also under the influence of drugs when he tweeted about taking the electric car maker private in 2018. The tweet eventually led to an SEC investigation into the matter, which resulted in a $40m fine and Musk's resignation as Tesla's chairman. One former Tesla director, Linda Johnson Rice, was so frustrated with Musk's behaviour and her concerns about the billionaire's drug use that she did not stand for re-election as a Tesla director in 2019, the WSJ reported.  Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Chat with\n                    MintGenie I am Genie, Mint’s AI enabled assistant to help you with your queries related to: "
}