{
    "title": "Special Electrek podcast: Is Elon Musk blackmailing TSLA for $100B, \nadmitting to conflicts of interest?",
    "date": "1/16/2024",
    "url": "https://electrek.co/2024/01/16/special-electrek-podcast-elon-musk-blackmailing-tsla-tesla-conflicts-of-interest/",
    "text": "This is a special episode of the Electrek podcast in which we dive into Elon Musk’s comments from last night requesting a 25% stake in Tesla in order to advance AI at the company, which he himself described as an AI/robotics company. The Electrek podcast is generally live every Friday at 4 PM ET, but we are making a special episode today to discuss a strange situation. If you want a primer before the podcast, you can read my article from last night: Elon Musk complains about his smaller stake in Tesla after wasting it on buying Twitter. In a new tweet, Musk seems to admit to a serious conflict of interest and possibly even a breach of fiduciary duty toward Tesla shareholders. I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control. Enough to be influential, but not so much that I can’t be overturned.Unless that is the case, I would prefer to build products outside of Tesla. You don’t seem to understand… The CEO says that he prefers building AI products at his new startup rather than at Tesla unless he receives a new compensation plan that would give him control over 25% of the company’s shares. Is this blackmail? Is this a conflict of interest? Join us live to discuss the situation. The episode will start recording live at 11:15 AM ET. You can join us live on YouTube (or most other platforms): FTC: We use income earning auto affiliate links. More. Subscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast. The Electrek Podcast is Fred Lambert and Seth We… Fred is the Editor in Chief and Main Writer at Electrek. You can send tips on Twitter (DMs open) or via email: fred@9to5mac.com Through Zalkon.com, you can check out Fred’s portfolio and get monthly green stock investment ideas. Get interesting investment ideas by Fred Lambert ChargePoint Home WiFi Enabled Electric Vehicle (EV) Charger "
}