{
    "title": "Tesla Stock Slides Nearly 3% In Today's Premarket, Here's Why",
    "date": "1/31/2024",
    "url": "https://www.tradingview.com/news/benzinga:7a00a4aa1094b:0-tesla-stock-slides-nearly-3-in-today-s-premarket-here-s-why/",
    "text": "Electric vehicle maker Tesla, Inc.’s TSLA stock fell in premarket trading on Wednesday after a Delaware Chancery Court Judge ruled to nullify CEO Elon Musk’s 2018 compensation plan. The decision comes more than a year after the end of the trial, which looked into the merits of a shareholder lawsuit challenging the $55 billion compensation plan the board approved for Musk. Tesla can appeal the ruling in the Supreme Court of Delaware and eventually in the Supreme Court. The development creates uncertainty at a time when Tesla is navigating fundamental challenges. Musk has aggravated fears further by commenting on the verdict on X, a social-media platform he owns. Even as the repercussions of the “funding secured” tweet in 2018 linger, the billionaire lamented the perils of being a public company. \"The parasitic load of being a public company has become extremely high,\" he said. Souring of sentiment toward big techs following some high-profile disappointments and apprehensions ahead of Wednesday’s Fed decision could also be weighing down on the stock. In premarket trading, the stock fell 2.79% to $186.25, according to Benzinga Pro data. Check out more of Benzinga’s Future Of Mobility coverage by following this link. See Also: Everything You Need To Know About Tesla Stock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}