{
    "title": "Brazilian Entrepreneur Takes Inspiration from Tesla to Develop National \nElectric Car",
    "date": "2/22/2024",
    "url": "https://www1.folha.uol.com.br/internacional/en/business/2024/02/brazilian-entrepreneur-takes-inspiration-from-tesla-to-develop-national-electric-car.shtml",
    "text": " Flávio Figueiredo Assis drives a Tesla Model 3 on a daily basis, but that's not enough for him. The Capixaba businessman wants to make his own electric car. After selling his card administrator in 2022 and amassing a fortune, he decided to invest in the new business. \"I gave it a game over, sorted out my life, and thought, 'what to do now?'\" says Assis, explaining how the story of the Lecar 459 prototype began. The car, which will be able to travel 400 kilometers on a full battery charge, had an estimated price of R$ 279,000 at the beginning of the project. However, according to the businessman's calculations, it could be sold for less than R$ 200,000. The national project is progressing quickly, but the first design of the Lecar 459 has already changed. The sedan style of the prototype is being replaced by an SUV coupe body, similar to the Fiat Fastback and the BMW X4. Assis says that the inspiration for the sketches came from fauna. \"Romis says that a car is an animal, it's a Jaguar, it's a Cobra, it's a Mustang.\" The name Lecar refers to Assis's former card company, which was called Lecard. The number 459, according to the businessman, alludes to the inventor and engineer Nikola Tesla (1856-1943), who was obsessed with the number 369. Here's the logic behind the choice: in both cases, the sum of the first two digits results in nine. Read the article in the original language Carregando... Copyright Folha de S.Paulo. All rights reserved. All materials contained in this page may not be reproduced in any media, whether electronic or printed, without the prior written permission of Folhapress. Seu e-mail foi cadastrado com sucesso! Por favor, tente mais tarde! "
}