{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/tesla-shares-fall-nearly-25-in-2024-drag-on-auto-industry-index-80301162",
    "text": " Tesla shares fall nearly 25% in 2024, drag on auto industry index MediaTalk | Season 2  Ep.5 Big Dance, Big Business: Breaking Down March Madness An Energy Company Assesses Datacenter Demand for Renewable Energy Baird Research is Now Exclusively Available in S&P Global’s Aftermarket Research Collection Next in Tech | Episode 158: Mobile World Congress Review Tesla Inc.'s stock has lost almost a quarter of its value so far in 2024, and its struggles have put a serious dent in the equity market performance of the auto industry overall. Through Feb. 2, Tesla has been one of the S&P 500's biggest laggards. Its shares have fallen 24.4%, while the broader index has climbed about 8.3%. The S&P Composite 1500 Automobiles index — a selection of automobile industry companies from the S&P 500, mid-cap focused S&P 400 and small-cap S&P 600 — has tumbled about 20.6% over the same time. The broader S&P Composite 1500 index has risen about 4.1%.  Tesla shares have lost 53.9% from their November 2021, shedding nearly $629 billion in market capitalization. Since peaking on July 18, the S&P 1500 Composite Automobiles index has fallen more than 32%. Big impact on auto index Tesla has an outsized influence on the auto industry's performance overall as it accounts for about 82% of the automobile index's weight, according to S&P Dow Jones Indices.  The performance of other auto stocks is mixed. Ford Motor Co. is roughly flat on the year, while Winnebago Industries Inc. is down about 7.7%. General Motors Co. shares have risen about 7.9% on the year so far. Short interest Short sellers have increased their bets against automobile manufacturer companies, with short interest against Fisker Inc. rising to 48.6% through mid-January from 43.2% at the end of 2023.  Short interest in Tesla was at 2.53% as of mid-January, down nearly 40 basis points from where it was two months earlier. Demand wanes Automobile makers have faced several headwinds in recent months, including labor strikes and relatively high interest rates, which have muted demand for car loans.  About 10% of Americans in January said they plan to buy a vehicle within the next six months, according to the latest survey from The Conference Board. That is down from 11.1% a year earlier. "
}