{
    "title": "Tesla & BYD secures combined 35 per cent share of global EV market in 2023",
    "date": "2/17/2024",
    "url": "https://topnews.in/tesla-byd-secures-combined-35-cent-share-global-ev-market-2023-2414590",
    "text": "In the fast-evolving realm of electric vehicles (EVs), American electric car pioneer Tesla Motors and Chinese automaker BYD Limited emerged as leading players, collectively securing an impressive 35 per cent share of the global EV market in 2023. With the world witnessing more than 13.6 million plug-in electric cars being sold, constituting a noteworthy 16 per cent of total worldwide car sales, the dominance of Tesla and BYD became increasingly evident, particularly in the realm of all-electric cars. According to newly released data, the top five original equipment manufacturers (OEMs) BYD Group, Tesla, Volkswagen Group, Geely-Volvo, and SAIC played a crucial role in steering the EV market. These five OEMs emerged as the frontrunners, collectively accounting for slightly more than 7.5 million rechargeable car registrations, marking a notable 41 per cent year-over-year growth. This group of five OEMs bolstered their share in the plug-in market to 55 per cent, which represents a notable uptick from 52.8 per cent in the year of 2022. China-based BYD stands tall as the largest contributor, with more than 3 million units registered, commanding a substantial 22 per cent share, up from 18.4 per cent in the year of 2022. Following closely, Tesla secured its second position, focusing solely on all-electric cars, with more than 1.8 million units sold and a praiseworthy 13.2 per cent share. This percentage is slightly more than 13.0 per cent recorded in 2022. Collectively, BYD and Tesla commanded 35.2 per cent of the total plug-in market, which represents a notable leap from the previous year’s 31.4 per cent. The third-largest OEM, Volkswagen Group, accounted for a total of 994,403 new plug-in car registrations, grabbing a market share of 7.3 per cent, which represents a slight decrease from 8.2 per cent in 2022. In the battery-electric vehicle (BEV) segment, Tesla led the pack with more than 1.8 million registrations, constituting 19.1 per cent of the BEV segment. BYD followed closely with a total of 1,570,388 units and an impressive 16.5 per cent market share. With a 5.3 per cent share, GAC emerged as the first OEM outside the top five, indicating the widening gap between the leading players and the rest. As Tesla and BYD continue to electrify the global automobile market, their combined prowess in the field is reshaping the industry, promising an electrifying future where these companies are expected to lead the charge towards sustainable transportation.    © 2005-2023 TOPNEWS.IN ALL RIGHTS RESERVED. COPYSCAPE PROTECTED  "
}