{
    "title": "Tesla pays bakery $2K for canceled pie order after Musk vowed to 'make \nthings good'",
    "date": "2/26/2024",
    "url": "https://nypost.com/2024/02/26/us-news/tesla-pays-bakery-2k-for-canceled-pie-order-after-musk-gets-involved/",
    "text": "Submit Δ Thanks for contacting us. We've received your submission. Tesla paid a California bakery $2,000 to cover the costs of a canceled pie order after the car company’s billionaire owner, Elon Musk, caught wind of the debacle and promised to “make things good.” The owner of the Giving Pies — which has seen a boom in business since the ordeal made headlines last week — confirmed to the Guardian that Tesla paid the outstanding bill on Monday. The San Jose bakery originally received a request for 2,000 mini pies from Tesla before that order was doubled. But a rep with Musk’s company canceled on the bakery at the last minute just as the treats were set to be shipped, the business owner previously claimed. “To me, it was clear that Tesla’s corporate culture prioritized convenience over accountability, disregarding the livelihoods of small business owners like myself,” owner Voahangy Rasetarinera said in a Facebook post last week. After Musk, the CEO of Tesla, apparently became aware of the issue through media coverage, he said he would make sure Rasetarinera got paid. “Just hearing about this. Will make things good with the bakery,” Musk said in an X post on Friday. “People should always be able to count on Tesla trying its best.” Rasetarinera told the Guardian by email three days later, “Tesla just paid the $2k that I was out of.” The payment covers the cost of ingredients the company had purchased to fulfill the canceled order, KGO reported. “When you’re a big corporation, $2,000 is pocket money, it’s nothing,” Resetarinera told the outlet. “But for us, it’s a lot.” Over the weekend, hundreds of patrons lined up to order pies from the bakery in a show of support following the Giving Pies’ scathing review of Tesla. “Oh my gosh, it’s incredible,” Rasetarinera told NBC Bay Area. “I am blown away. I’m like, ‘I didn’t do it for that.’ I’m so grateful. It’s amazing. People are amazing.” While she told the station Tesla offered her a new catering gig for a women’s day celebration in March, she turned it down because of a shortage of crust following the onslaught of new orders. Advertisement "
}