{
    "title": "Elon Musk's Tesla is in all kinds of trouble",
    "date": "2/10/2024",
    "url": "https://qz.com/emails/quartz-weekend-brief/1851238064/tesla-troubles-elon-musk",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Hi, Quartz members, It’s never a good look if, in the midst of bankrolling a Star Wars actress’s lawsuit against Disney, news breaks that your board members allegedly wanted you to go to rehab for drug use. But that’s Elon Musk for you. Musk’s troubles with Tesla keep compounding. Not long ago, a shareholder sued Musk and the company’s executives over his exorbitant $56 billion in compensation. A Delaware court eventually tossed out the pay package, calling it “unfathomable” and criticizing the board for approving it. Tesla’s stock, meanwhile, has been sliding so rapidly that it is the worst performer in the S&P 500 this year. Musk’s net worth, tied up significantly in Tesla’s fortunes, is shrinking as well; he has lost at least $24 billion this year, according to the Bloomberg Billionaires index. The latest news about Musk’s drug use illustrates the singular tension between Musk and his board on the one hand, and Tesla shareholders on the other. Musk has appointed what one shareholder, in a different lawsuit, called “a completely subservient board.” Its eight members are so handsomely compensated (more on that below) that they would be loath to lose their seats. At the same time, Musk clearly worries them—both because of his erratic behavior and because Tesla is, as its annual report admits, “highly dependent on [his] services.” Meanwhile, the company’s troubles continue to mount. Tesla has lost more than $150 billion in shareholder value this year alone, and Musk has already sounded warnings about slower growth ahead. Production at the gigafactory in Germany had to be put on hold because of the Red Sea shipping crisis. And the recalls keep coming—most recently, 2.2 million vehicles in the US, including Cybertrucks, over a problem with their warning lights. That’s practically all the vehicles Tesla has sold in the country. Words may not suffice. So Quartz brings you Tesla’s torrid time, in charts and numbers. In 2024, Tesla is the worst-performing stock in the S&P 500. As Quartz’s Melvin Backman points out, that index includes Boeing, whose planes are losing their doors in midair and their wheels on the tarmac. $329,351: The average total compensation for board members in the 200 largest US companies, as of 2023 $650 million: How much Tesla’s eight-person board, not including Musk, has earned over the years by selling shares from the stock options awarded to them by way of compensation The fact that Tesla sold a single, solitary car in South Korea in January isn’t entirely its own fault. Koreans are facing high inflation, newfound anxiety over battery fires, and a persistent lack of fast EV chargers across their country. Still, the crash in sales from a mere four months ago, when the Tesla Model Y was the best-selling imported car in South Korea, has been dramatic. And the bottom line doesn’t care if it’s the company’s fault or not. Quartz did the math for you. If you add up all the Tesla vehicles recalled since 2013, it sums up to more than 7.2 million. As of 2023, the Tesla Model Y was the most recalled car in the US, according to data compiled by the National Highway Traffic Safety Administration. The latest recall of Teslas in the US involved, of all things, a font issue. “On affected vehicles,” the recall notice read, “the letter font size of the Brake, Park, and  Antilock brake system (ABS) visual warning indicators is smaller than  3.2 mm (1/8 inch), as prescribed in FMVSS Nos. 105 and 135.” The fonts have to be expanded by 5%—easily achieved through an over-the-air software update. In that sense, Tesla’s “recalls” don’t always require cars to be taken back to be retooled or repaired. Sawyer Merritt, a Tesla investor, claims that 99% of Tesla’s recalls last year in the US called for just over-the-air fixes, with only 21,455 vehicles needing to be physically recalled. Thanks for reading! And don’t hesitate to reach out with comments, questions, or topics you want to know more about. Have an electric  weekend, — Samanth Subramanian, Weekend Brief editor Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}