{
    "title": "Bearish Sentiment Engulfs Tesla, Rivian Stock Craters On Production Woes, \nFord Pauses F-150 Lightning Shi",
    "date": "2/24/2024",
    "url": "https://www.benzinga.com/markets/asia/24/02/37300601/bearish-sentiment-engulfs-tesla-rivian-stock-craters-on-production-woes-ford-pauses-f-150-lightning",
    "text": "Bad tidings from electric vehicle startups Rivian Automotive, Inc. RIVN and Lucid Group, Inc. LCID cast a pall of gloom on the EV space this week. The weakness came despite the broader market finishing the week at a record high. Here are the key events that happened in the EV space during the week: Tesla Bearish Sentiment Abounds, Price Tinkering: Tesla, Inc. TSLA shares have been languishing at depressed levels ever since the company reported a double miss in the third quarter of 2023. Fundamentals of the Elon Musk-led company have faltered due to an inclement economy, slowing EV adoption and some of its own strategies. Morgan Stanley analyst Adam Jonas said in a report released this week that, out of the 84 investors responding to the firm’s investor survey, three-quarters believe the stock has yet to bottom. Investors were particularly worried about the slowing EV demand narrative. Tesla went on to hike the price of the Model 3 Long Range SUV in the U.S. by $250, with the variant now having a starting price of $47,740. The price of the base rear-wheel-drive variant remains unchanged at $38,990. The company also increased the price of the white interior Model 3 by $500. Commenting on the price changes, Troy Teslike, a social media user known for predicting Tesla deliveries, said the company could be discouraging customers from ordering a Model 3 version it can’t produce and pushing sales of Model Y, which is seeing bloated inventory levels. Rivian, Lucid, Nikola Earnings Disappoint: The earnings season did not pan out well for startups as well, with Lucid, Rivian and Nikola Corp. NKLA all reporting disappointing quarterly performances. Rivian beat revenue expectations but missed production targets, as it guided for 57,000 units in 2024, significantly lower than analysts' estimates, CNBC reported. Despite working on its new R2 platform, the company also announced a 10% workforce reduction. Lucid missed revenue expectations and offered a weak 2024 delivery guidance of 9,000 units, reflecting production challenges. Struggling truck maker Nikola also reported below-consensus revenue as the company delivered only 20 battery EV trucks despite producing 133 units. Looking ahead, Nikola said it expects to deliver between 250 and 350 BEV trucks and 125 to 150 of its upcoming fuel-cell trucks in 2024. See Also: Best Electric Vehicle Stocks Ford Pauses F-150 Lightning Shipments: After slowing production of its F-150 Lightning pickup trucks, Ford Motor Co. F has paused shipments of its 2024 model years of the truck, citing longer-than-expected quality check process, Detroit News reported. A Ford spokesperson said the pause in shipments went into effect on Feb. 9 and that production of the EV continued at the Rouge Electric Vehicle Center in Dearborn. Nio Tests Humanoid Robot Usage For Factory Line: Chinese EV startup Nio, Inc. NIO is apparently achieving production efficiency. A CnEVPost report said the Shanghai-based company is testing the usage of humanoid robots in its assembly lines at one of its factories. The report said Hong Kong-listed humanoid robot maker UBTech Robotics recently shared a video on Weibo showing its Walker S robot working in Nio’s assembly line. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Volvo To Cut Polestar Stake: Sweden’s Volvo Car AB (publ.) VLVOF, owned by China’s Geely Automobile Holdings Limited GELYF, said its board has resolved to distribute 62.7% of its stake in loss-making EV manufacturer Polestar Automotive Holding UK PLC PSNY to its shareholders, contingent on approval by shareholders at its 2024 annual general meeting. The proposed move will reduce its stake in Polestar to 18%. “After the distribution, Geely Holding will continue to provide operational and financial support to Polestar going forward. The distribution will enable Volvo Cars to concentrate its resources on the next phase of the Volvo Cars' transformation, and Volvo Cars will therefore not provide further funding to Polestar,” Volvo Cars said. The KraneShares Electric Vehicles and Future Mobility Index ETF KARS ended Friday’s session down 0.05% at $21.64, according to Benzinga Pro data. For the week, the ETF fell 2.30%. Read Next: Tesla Investor Shows Love For Battered Rivian: 4 Reasons Why He Is Positive About The EV Maker EV Stock Performances For Week: Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}