{
    "title": "SpaceX has moved its incorporation to Texas from Delaware, says Elon Musk",
    "date": "2/15/2024",
    "url": "https://www.firstpost.com/tech/spacex-has-moved-its-incorporation-to-texas-from-delaware-says-elon-musk-13729492.html",
    "text": "In the wake of a recent ruling by a Delaware state judge concerning Elon Musk’s 2018 pay package of $51 billion at Tesla, the tech mogul has formally relocated SpaceX’s state of incorporation from Delaware to Texas SpaceX, the aerospace company led by Tesla CEO Elon Musk, has formally relocated its state of incorporation from Delaware to Texas, Musk announced on Wednesday. The move, confirmed in a filing to the Texas Secretary of State, marks a significant shift for the company, aligning its legal domicile with its operational headquarters. SpaceX has moved its state of incorporation from Delaware to Texas!If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible. pic.twitter.com/B7FLByL2dY The decision to move comes in the wake of a recent ruling by a Delaware state judge concerning Musk’s 2018 pay package at Tesla, another company under his leadership. The judge’s decision, which favoured a shareholder’s challenge of the package as excessive, could potentially impact Musk’s assets by over $51 billion pending any appeals. Delaware has long been a favoured destination for corporate incorporation in the United States due to its business-friendly legal and tax environment, including its reputation for facilitating mergers and adjudicating disputes. However, Musk’s recent legal setback has prompted him to reconsider the state’s advantages, leading to SpaceX’s relocation and a similar move by his other venture, Neuralink, to Nevada. In a statement on social media, Musk advised against incorporating companies in Delaware and recommended Nevada or Texas as preferable alternatives, particularly for those who prioritise shareholder input in decision-making processes. Following the SpaceX announcement, Musk initiated a public poll on social media platform X, querying whether Tesla should also shift its registration from Delaware to Texas, where the EV company is already headquartered. The response was overwhelmingly in favour of Texas, with over 87 per cent of approximately 1.1 million respondents endorsing the move. As Musk navigates the legal and logistical implications of these corporate relocations, including seeking shareholder approval for Tesla’s incorporation in Texas, the billionaire entrepreneur continues to reshape the corporate landscape in pursuit of his vision for the future of technology and space exploration. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}