{
    "title": "Tesla sued by California counties over hazardous waste",
    "date": "2/3/2024",
    "url": "https://www.autoblog.com/2024/02/03/tesla-sued-by-california-counties-over-hazardous-waste/",
    "text": "A group of 25 California counties have sued Elon Musk's Tesla, claiming the electric vehicle maker mishandled hazardous waste at its facilities across the state. The lawsuit from Los Angeles, Alameda, San Joaquin, San Francisco and other counties was filed in California state court. It seeks civil penalties and an injunction that would require the company to properly handle its waste in the future. Tesla did not immediately respond to a request for comment. The counties accused Tesla of violating state unfair business and hazardous waste management laws by improperly labeling waste and sending the materials to landfills that cannot accept hazardous material. California's hazardous waste management law carries potential civil penalties as high as $70,000 per violation per day. Waste produced or handled at the facilities includes paint materials, brake fluids, used batteries, antifreeze and diesel fuel, the counties said. The lawsuit claims that violations have occurred at as many as 101 facilities, including at Tesla's manufacturing plant in Fremont. Spokespeople for the counties did not immediately provide additional details about the case. The lawsuit is not the first time Tesla has faced allegations related to its hazardous waste management practices. The company reached a settlement in 2019 with the U.S. Environmental Protection Agency over alleged federal hazardous waste violations at its Fremont plant. In that deal, Tesla agreed to take steps to properly manage waste at the facility and pay a $31,000 fine. Tesla later reached a deal with the EPA in 2022 in which it agreed to pay a $275,000 penalty after the federal agency said the company was failing to keep records and to implement plans to minimize air pollutants from painting operations at the Fremont plant. Dad buys cancer-stricken son a Mustang, Ford CEO Jim Farley helps him live for today in it Texas is refusing to register kei trucks, and owners are fighting back Jeep reveals 2024 Easter Safari concepts Elon Musk addresses Cybertruck door gap reviewer calls the 'worst I've ever seen in a production vehicle' Toyota FJ Cruiser reboot rumored to sit on Hilux Champ chassis Aston Martin hires Bentley boss as Lawrence Stroll cycles through another CEO    Please enter a display name Please sign in to leave a comment. "
}