{
    "title": "Tesla Used Car Values Sink 50% From Mid-2022 Peak: What It Means For EV \nGiant, Users",
    "date": "2/11/2024",
    "url": "https://www.tradingview.com/news/benzinga:3e1dc5c9a094b:0-tesla-used-car-values-sink-50-from-mid-2022-peak-what-it-means-for-ev-giant-users/",
    "text": "Tesla, Inc. TSLA used car prices continued to plummet, hitting a new record low last week, possibly reflecting the effects of the company’s recent price cuts. What Happened: Data from automotive research and shopping website CarGurus showed that used Tesla car prices dropped to $33,913 on Feb. 10, marking a decrease of approximately 30% year-over-year. The most significant decline was seen in the Model X, which now trades at $45,873, down by 34.25%. Similarly, the price of a used Model S fell by roughly 33% to $34,355. Used Model Y and Model X are now selling for $37,776 and $29,078, respectively. Commenting on the data, markets strategist Charlie Bilello from Creative Planning noted, “The average price of a used Tesla has declined for 19 consecutive months, plummeting from a record high of $67,900 in July 2022 to a record low of $33,913 today. That’s a 50% decline.” The average price of a used Tesla has declined 19 months in a row, moving from a record high of $67,900 in July 2022 to a record low of $33,913 today. That's a 50% decline. $TSLA pic.twitter.com/WCUUmBBvi8 See Also: Everything You Need To Know About Tesla Stock Why It’s Important: According to Capital One, the plunge in used car prices can be attributed to higher interest rates and an improved supply of new cars. Supply chain disruptions during the COVID-19 pandemic reduced the availability of new cars, causing used car prices to soar. Additionally, federal stimulus measures during the pandemic enhanced consumer affordability. With supply chain constraints easing, new car inventory has surged. Moreover, automakers, particularly EV manufacturers, have significantly reduced configurator and new inventory prices, making them more accessible. Tesla spearheaded the price-cutting trend in the EV industry, initiating reductions in early 2023. After a brief pause late last year, the Elon Musk-led company has resumed slashing prices. As recently as Saturday, the company began offering a limited-time $1,000 price reduction on its popular Model Y vehicle. The decline in used car prices may squeeze profits for automakers’ in-house financing arms, as off-lease vehicles are sold for less than the residual values used in leasing contracts. Automakers are faced with the dilemma of either keeping lease rates low to remain competitive, potentially impacting profits, or maintaining lease amounts, which could negatively affect sales. Furthermore, lower used car prices could influence the purchase decisions of new car buyers, as consumers often avoid vehicles with lower resale value. Lower used car prices typically result in reduced residual values for new cars. Tesla ended Friday’s session up 2.12% at $193.57, according to Benzinga Pro data. Read Next: Tesla Layoff Rumors, Rivian Drops Entry-level Pricing, Lucid’s Unusual Partnership And More: Biggest EV Stories Of The Week Photo by Sheila Fitzgerald on Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}