{
    "title": "Wall Street Analysts Just Trimmed Price Targets for These 10 Stocks",
    "date": "1/21/2024",
    "url": "https://finance.yahoo.com/news/wall-street-analysts-just-trimmed-210848056.html",
    "text": "In this article, we will discuss the 10 stocks whose price targets were recently trimmed by analysts. If you want to see more such stocks on the list, go directly to Wall Street Analysts Just Trimmed Price Targets for These 5 Stocks. Equity markets in Asia demonstrated widespread gains on January 19, mirroring the positive trend in Nasdaq 100 futures, propelled by the optimistic outlook of Taiwan Semiconductor Manufacturing Co. (TSMC). The surge in semiconductor stocks contributed to the upward momentum of MSCI Inc.'s Asia Pacific index for the second consecutive day. TSMC, in particular, experienced a remarkable increase of over 6% in Taiwan, while its American depository receipts saw an impressive surge of nearly 10%, reaching the highest closing level since February 2022. The noteworthy performance of TSMC has become a focal point, acting as a catalyst for heightened expectations of a global recovery within the semiconductor sector. The positive momentum in Asia reflects the broader sentiment in equity markets, driven by the resilience and growth potential perceived in key industry players. Traders' sentiments are undergoing shifts, with a notable reduction in bets on a Federal Reserve rate cut anticipated in March. This adjustment in expectations aligns with the evolving economic landscape and signals a degree of confidence in the prevailing economic conditions. Redmond Wong, Chief China Strategist, provided insights into the outlook for the world's second-largest economy, shedding light on government policies and their implications for the stock markets. These discussions underscore the importance of staying informed about global economic dynamics and geopolitical factors that influence market trends. As markets continue to respond to changing conditions, the performance of semiconductor stocks, such as TSMC, serves as a barometer for broader economic recovery sentiments. Investors and analysts will closely monitor developments in the semiconductor sector and gauge their impact on global markets in the coming days. According to Reuters, the most recent economic indicators point towards a positive trajectory for the U.S. economy as of January 18, with notable developments in jobless claims and the housing market. Weekly jobless claims have reached a 16-month low, falling by 16,000 to 187,000, showcasing a robust labor market. The decline, unexpected by economists, hints at sustained job growth in January and contributes to an optimistic economic outlook, potentially complicating expectations for a Federal Reserve interest rate cut in March. The strong performance is attributed to the resilience of the labor market, where companies are demonstrating reluctance to lay off workers amidst challenges in finding skilled labor, particularly after the COVID-19 pandemic. Though some volatility in claims data is expected during the turn of the year, the overall trend aligns with a tight labor market. In the housing sector, single-family housing starts experienced an 8.6% decline in December, attributed in part to adverse weather conditions. However, the year-on-year increase of 15.8% indicates sustained demand, fueled by a shortage of existing homes for sale. Building permits for single-family homes rose by 1.7% to the highest level since May 2022, reflecting positive sentiment among homebuilders and responding to declining mortgage rates. While the housing market shows signs of resilience and increased demand for new construction, challenges persist, particularly in addressing the inventory shortage. The gap between housing starts and completion rates and the inventory gap in the market underscore the need for additional supply to alleviate the housing affordability crisis. Overall, these economic indicators provide a multifaceted view of the U.S. economy's current state, with both the labor market and the housing sector contributing to a generally positive narrative. Investors and analysts will closely monitor these trends for insights into economic resilience and potential policy implications. On the stock market front, analysts are bearish on The Procter & Gamble Company (NYSE:PG) and Tesla, Inc. (NASDAQ:TSLA) by trimming their price targets. Check out the complete article to see details of these stocks. Rawpixel.com/Shutterstock.com Price Reaction after the Price Target Cut: +2.34 (+5.30%) As of January 18, Stifel analyst Steven Wieczynski has made adjustments to the outlook for Caesars Entertainment, Inc. (NASDAQ:CZR), a significant player in the gaming and entertainment industry. Despite lowering the price target from $70.00 to $67.00, Wieczynski maintains a buy rating on the stock. Following this price target cut, the closing bell on January 18 witnessed a price reaction, with Caesars Entertainment, Inc. (NASDAQ:CZR) experiencing a positive uptick of +2.34 (+5.30%). This shift in the price target and subsequent market response highlights the dynamic nature of financial assessments and investor reactions within the gaming and entertainment sector. Wieczynski's decision to maintain a buy rating indicates an underlying confidence in Caesars Entertainment, Inc. (NASDAQ:CZR) potential for growth and value appreciation, even with a revised price target. Baron Real Estate Fund made the following comment about Caesars Entertainment, Inc. (NASDAQ:CZR) in its second quarter 2023 investor letter: “In the most recent quarter, we reduced our investment in Caesars Entertainment, Inc. (NASDAQ:CZR), the largest casino-entertainment company in the U.S. and one of the world’s most diversified casino-entertainment providers. We chose to modestly reduce our significant exposure in travel-related real estate companies and reallocated the capital to other non-travel related real estate companies. We are big fans of CEO Tom Reeg and remain optimistic about the long-term prospects for the company.” Price Reaction after the Price Target Cut: +8.55 (+4.21%) Just like The Procter & Gamble Company (NYSE:PG) and Tesla, Inc. (NASDAQ:TSLA), analysts are bearish on The Boeing Company (NYSE:BA). As of January 18, Susquehanna analyst Charles Minervino has revised his evaluation of The Boeing Company (NYSE:BA), a major player in the aerospace and aviation industry. Despite lowering the price target from $306 to $279, Minervino maintains a Positive rating on the stock. Following this adjustment, the closing bell on January 18 witnessed a notable price reaction, with The Boeing Company (NYSE:BA) experiencing a positive increase of 4.21%. The market's reaction, characterized by a notable increase in stock value, adds an interesting dimension to The Boeing Company (NYSE:BA) ongoing narrative within the aerospace and aviation industry. This development reflects the ongoing dynamics within the aerospace and aviation sector, where analysts like Minervino are recalibrating their expectations for individual stocks based on various factors. Despite the reduced price target, maintaining a Positive rating suggests that Minervino sees The Boeing Company (NYSE:BA) as having favorable prospects for growth and value appreciation. Price Reaction after the Price Target Cut: +1.57 (+1.71%) On January 18, Wedbush analyst adjustments significantly influenced the evaluation of Starbucks Corporation (NASDAQ:SBUX), a key player in the coffee and beverage industry. Despite a reduction in the price target from $100 to $95, the analyst maintains a Neutral rating on the stock. This modification, coupled with the note highlighting \"increasingly limited top-line visibility,\" adds an additional layer of consideration. Following this alteration, the closing bell on January 18 witnessed a modest price reaction, with Starbucks Corporation (NASDAQ:SBUX) experiencing a positive uptick of 1.71%. This development sheds light on the evolving dynamics within the coffee and beverage sector, where analysts like Wedbush are adjusting their outlooks based on various considerations. The mention of \"increasingly limited top-line visibility\" suggests a heightened awareness of challenges and uncertainties facing Starbucks Corporation (NASDAQ:SBUX) in terms of revenue generation. RiverPark Advisors made the following comment about Starbucks Corporation (NASDAQ:SBUX) in its Q3 2023 investor letter: “Starbucks Corporation (NASDAQ:SBUX): SBUX is the premier roaster, marketer and retailer of specialty coffee in the world, operating in 83 markets. Through its more than 36,000 global stores (roughly 50% operated and 50% licensed) the company offers handcrafted coffee, tea and other beverages and a variety of food items. SBUX also sells a variety of packaged coffee and tea products and licenses its trademarks through other channels such as grocery and foodservice through a Global Coffee Alliance with Nestlé. In addition to its flagship Starbucks Coffee brand, the company sells goods and services under the brands Teavana, Seattle’s Best Coffee, Ethos, Starbucks Reserve and Princi. SBUX’s recently appointed CEO (March 2023), Narasimhan Laxman, reiterated the company’s long-term plans for 10-12% revenue growth and 15-20% EPS growth while reporting fiscal 3Q23 earnings. Revenue will be driven by a combination of factors including unit growth, higher food “attach” rates (more food sold per cup of coffee), equipment innovation to speed throughput, and delivery expansion. In addition to the leverage of higher revenue across the company’s fixed asset base, SBUX sees margin expansion from supply chain management opportunities and procurement efficiencies. We initiated a small position in August.” Price Reaction after the Price Target Cut: +0.11 (+0.05%) On January 18, JPMorgan Chase & Co. made significant revisions to its evaluation of Cummins Inc. (NYSE:CMI), a key player in the manufacturing and engine technology industry. The financial institution lowered the price target from $255.00 to $245.00 while maintaining an Underweight rating on the Cummins Inc. (NYSE:CMI) stock. Following this adjustment, the closing bell on January 18 witnessed a marginal price reaction, with Cummins Inc. (NYSE:CMI) experiencing a modest uptick of 0.05%. This development sheds light on the shifting dynamics within the manufacturing and engine technology sector, where financial analysts such as JPMorgan Chase & Co. are fine-tuning their assessments based on various considerations. Despite the reduction in the price target, maintaining an Underweight rating suggests a cautious stance, reflecting the analyst's opinion that Cummins Inc. (NYSE:CMI) may underperform compared to its industry peers. Similar to how analysts express a bearish sentiment on The Procter & Gamble Company (NYSE: PG) and Tesla, Inc. (NASDAQ: TSLA), Cummins Inc. (NYSE: CMI) is also viewed pessimistically by analysts. Price Reaction after the Price Target Cut: -0.04 (-0.03%) As of January 18, BofA Securities made significant adjustments to its evaluation of Diamondback Energy, Inc. (NASDAQ:FANG), a notable player in the energy exploration and production industry. The financial institution reduced the price target from $147 to $129 while maintaining an Underperform rating on the Diamondback Energy, Inc. (NASDAQ:FANG) stock. In response to this revision, the closing bell on January 18 witnessed a marginal negative price reaction, with Diamondback Energy, Inc. (NASDAQ:FANG) registering a slight decline of 0.03%. Despite the reduction in the price target, the decision to uphold an Underperform rating underscores a bearish stance, indicating the belief that Diamondback Energy, Inc. (NASDAQ:FANG) may underperform compared to industry peers. Diamond Hill Large Cap Strategy made the following comment about Diamondback Energy, Inc. (NASDAQ:FANG) in its Q3 2023 investor letter: “Diamondback Energy, Inc. (NASDAQ:FANG) is a top-tier operator in the independent US E&P sector, running a streamlined team with an organizational culture centered on efficiency and cost-optimization. Its strategic location in Midland, Texas, close to its Permian operations, gives it a unique advantage by being in close proximity to a community of service providers. This has helped the company optimize its operations and reduce costs. The company stands out as a pure play in the Permian region, demonstrating strong operational capabilities, a sound capital return framework and a history of intelligent capital allocation. As long-term investors, we appreciate Diamondback’s strategic approach to investment and its commitment to cost efficiency and sustainable growth.”  Click to continue reading and see Wall Street Analysts Just Trimmed Price Targets for These 5 Stocks.  Suggested articles: 15 Strongest Currencies in the World in 2024 Billionaire Steve Cohen Aggressively Bought These 12 Stocks Recently 18 Most Profitable Value Stocks Now Disclosure. None. Wall Street Analysts Just Trimmed Price Targets for These 10 Stocks is originally published on Insider Monkey. Related Quotes "
}