{
    "title": "Uh-Oh. Why NIO Stock Looks Like a No-Go for 2024 and Beyond!",
    "date": "1/28/2024",
    "url": "https://investorplace.com/2024/01/uh-oh-why-nio-stock-looks-like-a-no-go-for-2024-and-beyond/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Nio stock once had tremendous potential. It’s not looking so good in 2024 Advertisement Source: Sundry Photography / Shutterstock.com I read two articles recently about Nio (NYSE:NIO) stock that made me wonder if it’s a buy now, at its lowest point since June 2020. The first headline was, Could Nio stock rise 1,000% in 10 years? The second asked, Will Nio Be a Trillion-Dollar Stock by 2050? That’s pretty heady stuff. I definitely wouldn’t want to miss out on such massive profits. Based on its current share price of $6.07, were the first headline to come true, that would be a 25.9% compound annual growth rate. If I invested $1,000, that would be $10,000 in a decade from now, a true 10-bagger. If the second headline were to happen, the present value calculator suggests Nio would need a market capitalization of $84 billion today to reach the $1 trillion mark. It’s currently $10 billion. With BYD (OTCMKTS:BYDDY) and Tesla (NASDAQ:TSLA) controlling 36% of China’s battery-electric vehicle market as of September 2023 it seemed they’re the better bet. Nio’s share of the BEV market was 2.3%. At this point, a Hail Mary pass is in order. However, if you’re convinced Nio will be the best sub-$10 stock you’ve ever bought in your lifetime of investing, do yourself a favor and explore using options to get the deed done. Here’s why. The 1,000% gain in NIO stock mentioned in the intro would increase its shares from $6.07 to $60.70. But that’s over a decade. Assuming it gets halfway there by 2029, that brings us to a more reasonable target of $30. Nio’s share price traded at $30 as recently as January 2022, 24 months ago. And 12 months before that, it was over $60, the 2034 target. Looking at Barchart.com’s option prices, I see the furthest-out expiration date is Jan. 16/2026, 24 months from now. The highest strike price is $20. The current ask price on the call is $0.87, a down payment of 4.4% on Nio’s stock. I’m not an expert in options, but that seems a little high, given the improbability of its stock reaching that mark in two years. Dialing it back to Jan. 17, 2025, a $30 strike is available with an ask of $0.12, a down payment of just 0.4%. There’s a reason for this discount: you’ve got 12 fewer months to ride a resurgence in Nio’s fortunes. But the price is right. Furthermore, the delta is 0.07198. You can double your money on the call by selling it when and if the share price reaches $7.74 before next January. That’s a 28% gain over the next 10-12 months. That’s doable. If, for some reason, good news shines down upon Nio in 2024, and its share price increases by more than 28%, all the better, and if it goes in the toilet, you’ve spent the equivalent of a cheap bottle of wine. You keep buying cheap calls with 1-2 years to expiry, hoping to get lucky at some point. But if you buy 100 shares at $6.07 a share, that’s $607 out of pocket instead of $12. And neither is a guarantee. In the trailing 12 months ended Sept. 30, Nio had a loss of 21.4 billion Chinese yuan ($3.02 billion) on revenue of 54.6 billion Chinese yuan ($7.70 billion). That’s 39 cents in losses for every dollar of sales. Or, as The Motley Fool’s Leo Sun put it in his article from the intro about Nio becoming a trillion-dollar stock, its vehicle margin had fallen to 11% in Q3 2023 from a peak of 20.1%. In Q3 2023, Tesla’s automotive gross margin was down considerably, to 18.7%, from 27.9% in Q3 2022. That’s the difference between Tesla’s quarterly operating profit of $1.76 billion in the third quarter and Nio’s $664 million operating loss. For it to have broken even in Q3 2023, it needed 6 billion in vehicle sales [$664 million divided by 11%], more than double its actual sales in the quarter. Even if they were 27.9% in Q3 2023 (Tesla’s Q3 2022 gross margin), they would have needed nearly $1 billion more vehicle sales just to break even. So, looking at it from this perspective, I’m not sure there’s a pathway to profitability in its immediate future. Perhaps when EVs become cool again. Until then, NIO stock seems like a dead bet walking. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. Consumer Discretionary, Automotive, Electric Vehicles   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/uh-oh-why-nio-stock-looks-like-a-no-go-for-2024-and-beyond/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}