{
    "title": null,
    "date": "1/9/2024",
    "url": "https://seekingalpha.com/article/4662034-tesla-stock-much-more-than-just-car-company",
    "text": "  Justin Sullivan  I initiated coverage of Tesla (NASDAQ:TSLA) in March 2023 with a buy-rated article titled Tesla: Electrifying The Earth. Tesla has outperformed the S&P by 10% since then. I followed that up with two articles, one about price cuts and another about Tesla's ecosystem. Since the ecosystem article, Tesla has outperformed the S&P by 34%. My most recent Tesla coverage was a Q2 earnings review, which I downgraded Tesla to hold, and Tesla has underperformed the S&P since. I'm re-upgrading Tesla to Buy in this article, in which I make the case that Tesla is much more than just an auto company. The bear case is clear: margin compression, high rates, geopolitical concerns, and a slowing growth rate. On top of that, the Q3 earnings call was met with criticism and a sharp selloff. While the financials certainly weren't positive - a $0.06 miss on EPS and missing revenue by nearly $800m - the bear case is overblown and overwhelmingly focused on the short term. Let's discuss some tailwinds for Tesla stock and the three major factors that could drive Tesla to become the world's most valuable company. Tesla management believes in the long term. This is their greatest strength. Wall Street necessarily believes in the short term. This is their greatest weakness. When this dynamic exists in markets, quite substantial mispricing can occur. While I wouldn't characterize Tesla as mispriced currently, individual investors must maintain a long-term perspective on the company. This discrepancy in time horizons leads to major volatility in Tesla stock. Short-term margin compression should be of little concern because it is aligned with the long-term strategy of the company. This is the argument that I made in a previous article titled Price Cuts Are Good For Tesla. The core of that argument is that if price cuts allow management to pursue their business strategy, which they do, then it is a good strategy to cut prices. That business strategy is to accelerate the transition to sustainable energy. Tesla has continued growing production, deliveries, the Tesla Energy business, and its Supercharger network. Price cuts resulted in margin compression and slower-than-expected revenue growth YTD through Q3 of 2023. Partly responsible for price cuts were rate hikes and increasing financing costs. Management rightfully believes that monthly cost is one of the foremost factors in consumers' car-buying decisions, so cutting prices was critical to keep the total cost of ownership down. Price cuts were important to continue ramping deliveries, which exceeded production volume in Q3. For both Q4 and full year 2023, production exceeded deliveries with both showing ongoing growth.  Business Wire  Key to this delivery data is that BYD (OTCPK:BYDDF) overtook Tesla as the global leader in EV sales. BYD has its sights set on becoming more relevant outside of China. The key difference between Tesla's and BYD's business models currently is that BYD offers much lower-priced models. This certainly plays a part in their rapid sales increase, which when matched with impressive production capacity makes this a very foreseeable outcome in hindsight. Important to note though is that BYD overtook Tesla only for Q4. For the full-year 2023, Tesla is still the lead. Tesla recently began working on a new production process to manufacture an affordable EV at scale, though. While this could still be years away, Tesla will eventually have a product that rivals BYD's pricing and could regain the title of global sales leader at that time, if not before.  Bloomberg  Focusing specifically on the US market tells a different story though. For one, BYD does not sell its vehicles in the US market due to prohibitively expensive import tariffs. The US has the largest economy with the strongest consumer, and Tesla is utterly dominant with more sales than all other competitors combined:  Electrek.co  While it isn't great that BYD dethroned Tesla, it's clear that Tesla is still the US leader in EVs. This may erode over time as legacy automakers offer more EV models, but Tesla will enjoy this dominance for years to come. The first-mover advantage is quite clear. Let's turn back now to a comment I made earlier about Tesla's new manufacturing process. This process, dubbed 'unboxed', uses new technology and could upend auto manufacturing. It's hard to overstate the marvel of Tesla's manufacturing process. The most important innovation in Tesla's manufacturing, aside from the extensive use of robots, is the Giga Press. The Giga Press is a huge die-casting machine that facilitates gigacasting, a process that creates large, single-piece molds for various auto components. The Giga Press revolutionized auto manufacturing and has even caught the attention of Toyota (TM), who is the clear leader in manufacturing quality. General Motors (GM) has even gone so far as to acquire one of the leading Giga Press suppliers. Here's how Reuters reporter Kevin Krolicki explains the benefits of Gigacasting:  Fewer parts, lower costs and a simplified production line have contributed to Tesla's industry-leading profitability, analysts have said. For Tesla, the use of a single component in the rear of the Model Y - its best-selling model - allowed it to cut related costs by 40%, the company has said. In the Model 3, by using a single piece from the front and rear of the vehicle, Tesla was able to remove 600 robots from assembly, Elon Musk has said. It can also cut a vehicle's weight – an important consideration for EVs where the battery pack alone can weigh more than 700 kg. And it has the potential to reduce waste and greenhouse emissions from a plant. True to Tesla's history of innovation, they aren't stopping there. Reuters recently reported on the Giga Press 2.0 and the complementary \"unboxed\" manufacturing process. This is speculated to enable the mass production of an affordable EV, possibly the \"Model 2\", which will cost less than $30k. The Giga Press 2.0 could allow Tesla to replace up to 400 individual components with one single mold and reduce the time to market for new models to 12-18 months. Legacy automakers can take anywhere from 3-4 years to release a new model. While Gigacasting at the scale of the Giga Press 2.0 was traditionally seen as too costly, 3D printing models and testing on a much smaller scale has allowed Tesla to prototype for far cheaper and avoid a lot of costly mistakes. Although the Giga Press 1.0 proved to revolutionize auto manufacturing, there are drawbacks to this design. Accidents can be far more costly if they deal damage throughout the single-die mold. Further, the use of structural battery packs can entirely total a car if the underbody damage also damages the batteries. Elon Musk has stated that Tesla designed crash absorption rails that can be cut off and repaired to preserve the packs. As an aside, another important update on the mass market EV came in Walter Isaacson's recently released biography of Elon Musk:  So in May 2023, he decided to change the initial build location for the next-generation cars and Robotaxis to Austin, where his own workspace and that of his top engineers would be right next to the new high-speed, ultra-automated assembly line. Throughout the summer of 2023, he spent hours each week working with his team to design each station on the line, finding ways to shave milliseconds off each step and process. As he had in the past with both Tesla cars and SpaceX rockets, he knew there was something just as important as the design of the project: the design of the manufacturing systems that would build the products at high volume. The vehicle will not be produced in Mexico as was the previously held belief. As if the story couldn't get better, we can now expect the next-gen vehicle to be made in America. It's still yet to be seen if this next step in Gigacasting will prove successful in the long run though and it's something that investors need to pay close attention to. If successful, this will once again revolutionize auto manufacturing and enable Tesla to market a low-cost EV at scale. The results will speak for themselves, but success in this venture will certainly get Tesla closer to being the world's most valuable business. Manufacturing efficiency is a key characteristic of leading car companies though. The next piece of the Tesla puzzle is that they have quickly become the industry standard in EV charging. With the expansive Supercharger network and increasing adoption of the NACS standard, Tesla has a major opportunity in EV charging. Tesla earns money when Superchargers are used. Naturally, revenue will increase as usage increases. This will benefit immensely from the NACS standard quickly becoming the industry standard for EV charging ports. Legacy automakers that have adopted the NACS standard have all but formally announced that they will rely on the Supercharger network for their EV charging infrastructure. The network itself is by far the most extensive with a current installed base of 50,000 units, 11,000 of them new in 2023, according to this Tesla post on X. Meanwhile, analysts predict the supercharger network could become a $10b/year business by 2030. A more ambitious estimate proclaims this is up to a $100b business for Tesla in the dominant case, which is increasingly likely as NACS adoption ramps. A key assumption used here is that EVs will make up 8% of total driving miles in 2030. With 8% miles share and a few other assumptions, the Supercharger network could grow to be an incredible asset for Tesla. In my opinion, the $100b valuation of Superchargers by 2030 is reasonable because I believe EVs will comprise significantly more than 8% of all miles driven in 2030. However, the assumption that the Supercharger network will run on 100% solar energy that is completely free for Tesla is less believable. These two considerations roughly balance out in my mind, so I will agree with a $100b valuation, or over 1/8th of the current market cap of Tesla. That's ignoring auto sales, leasing, insurance, energy storage, Optimus, and robotaxis. Tesla hasn't stopped there with Superchargers though. They also recently announced a second deal to sell non-Tesla branded Superchargers to a large chain of gas stations. This announcement comes on the heels of the $100m deal with BP and the public proclamation that this will be a new business practice they pursue. The most recent update to the Supercharger network is the start of the V4 station rollout. V4 stations feature a 3-foot increase in cable length, important for Cybertruck and non-Tesla EV charging, faster charging (from 250 kW/180 miles of range in 15 minutes to 350 kW/250 miles of range in 15 minutes). V4 Superchargers also have better cooling technology to prevent overheating and come equipped with Magic Dock, the CCS standard for non-Tesla EVs. From the competition standpoint, Tesla dominates. For one, Electrify America has 3,729 fast chargers currently installed but they are backed by Volkswagen which recently adopted the NACS standard. ChargePoint (CHPT) is undergoing a leadership transition and has 22,000 DC ports installed. EVgo (EVGO) meanwhile has 945 fast charging stations. IONITY, a joint venture between various major automakers (2 of which have adopted NACS) has 3306 fast charging stations scattered throughout Europe. Finally, Blink Charging (BLNK) has 85,000 charging ports installed but doesn't specify which are fast chargers. Tesla's 50,000 Superchargers make them a market leader in fast-charging infrastructure. The final piece of Tesla that differentiates it from other car companies is Dojo. Dojo is a supercomputer that Tesla built to train FSD and Optimus and subsequently run FSD and Optimus inference at scale. You can find a primer on Dojo here. Dojo is critical to Tesla becoming the world's most valuable company. By now you should know that Tesla's autonomous driving software FSD, Full-Self Driving, runs entirely on AI. The only other leading approach is that of lasers and sensors monitoring the surrounding environment and driving accordingly. Using AI is an ambitious approach since we'll be entrusting algorithms to make real-time decisions with cars, something that could be catastrophic. FSD will have to be extremely fine-tuned so that it doesn't hallucinate like ChatGPT sometimes does. Overall, an AI model is only as good as the data it's trained on. This is Tesla's unique competitive advantage in AI. All Tesla vehicles come equipped with numerous cameras that capture real-time driving data to feed the model. These algorithms are also trained to capture 'interesting events' when the human driver performs an action that the AI model wouldn't have. These interesting events are fed back to Tesla HQ where they can be reviewed and incorporated into additional training algorithms. While FSD is still considered Level 2 autonomy, meaning it requires active human supervision, it will be a strong growth engine for the company as the Tesla fleet continues to grow and the algorithms learn more. The better the data, the better the model. The better the model, the better the performance. The better the performance, the more trust consumers will have and the faster it will grow revenues. FSD will be a major asset for Tesla in the future. This is not to mention that autonomous driving, once fully commercialized, should be significantly safer than human driving. Tesla will benefit from this as insurance costs will come down and the total cost of Tesla ownership will drop in tandem. With cheaper insurance, lower rates, lower manufacturing costs, and more consumer trust, Tesla will dominate both the EV and autonomous driving industries. The Dojo Supercomputer is built with the capacity to train the FSD model. AI models require significantly more hardware and networking requirements in training than they do in inference. As FSD shifts further from training to inference, Tesla will have significantly more compute capacity than needed. While they have left open the option to make this compute available to outside customers (similar to a cloud provider), they are still focused on training FSD and Optimus with Dojo. Both of these will take up all the bandwidth Tesla can get for the foreseeable future, but there is some likelihood that Tesla could offer a product similar to NVIDIA DRIVE in the future as well. While NVIDIA (NVDA) is the clear king of full-stack AI solutions, their autonomous driving proposition likely won't be as competitive as Tesla's. FSD will have a wealth of training on real-world proprietary data and be proven to succeed at scale in the Tesla ecosystem. Also, if FSD does get full autonomy and regulatory approvals, there will be much more trust in Dojo than in DRIVE. Of course, there is immense execution risk here. It's possible that FSD simply never crosses the finish line into level 4 or 5 'full autonomy'. Regardless, Tesla has found a way to monetize a workable level 3 product, so in worst case scenario, we will remain stagnant at level 3. I'm upgrading Tesla to buy partly because I expect markets to begin a bull run in 2024. I can't predict how much we'll run, but I do think we end '24 in the green. Aside from markets performing generally well, my valuation model suggests Tesla is undervalued. In my initial model, I correctly predicted this year's slight drop in net income (though I predicted ~$10.2b in net income vs ~$10.7b actual). I also priced in net income dropping in 2024 and 2025 and used a terminal earnings multiple of 30 to round out a margin of safety valuation of $175-$190/share. I consider anything below $190/share my margin of safety price. Using TTM net income and slightly more aggressive growth figures (flat/no growth from 2024-2026, 15% earnings growth from 2027-2030, and 10% earnings growth from 2031-2033) and a terminal P/E of 30, I estimate Tesla's intrinsic value to be $245-$260. Therefore, the current trading range within the $230's allows investors to buy Tesla right around my intrinsic value estimate. Keep in mind that these numbers are extremely conservative considering Tesla's growth prospects. I expect Tesla to significantly outperform this model, but I like to be brutally conservative in my valuation estimates to build in the inherent uncertainty of the real world. Therefore, I rate Tesla a Buy at current levels. While Tesla is far from Apple at current levels, I believe Tesla's future growth prospects significantly overshadow the others in the Magnificent 7. Tesla is disrupting the legacy auto manufacturing industry, is the de-facto standard in EV charging design, and built their own supercomputer to make autonomous driving a reality. Historically, betting against Elon Musk has been a supremely bad bet. I don't see this changing in the future, so investors who can tolerate Tesla's volatility will be rewarded greatly over time. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}