{
    "title": "Court Says Elon Musk's $55B Tesla Pay Package Is 'Excessive'",
    "date": "1/30/2024",
    "url": "https://time.com/6590293/elon-musk-wealth-tesla-pay-excessive-court-ruling/",
    "text": "Elon Musk’s $55 billion pay package at Tesla Inc. was struck down by a Delaware judge after a shareholder challenged it as excessive, a ruling that would take a giant bite out of Musk’s wealth and put the fate of his companies in question. That is if the ruling survives a likely appeal. The decision Tuesday, which amounts to his first major loss in court, means that more than five years after the electric carmaker’s co-founder was granted the largest executive compensation plan in history, Tesla’s board will have to start over and come up with a new proposal. Musk never attempted to exercise his options since they’d been challenged in Delaware Chancery Court. Tesla’s share price slid about 3% in after-hours trading on the news. Musk has repeatedly urged Tesla’s board to arrange another massive stock award for him, years after he sold a significant chunk of his shares in the company to acquire Twitter. The billionaire has said he needs a bigger stake in Tesla to maintain control of the electric-car maker and expand further into artificial intelligence. Read More: Inside Elon Musk’s Struggle for the Future of AI The ruling leaves the future of Musk’s fortune in limbo. Worth some $51.1 billion, the options were one of his most valuable assets. Without them his net worth would drop to $154.3 billion, making him the third-richest person in the world after spending most of the past couple of years as No. 1, according to the Bloomberg Billionaires Index. Evan Chesler, Musk’s New York-based lawyer, didn’t immediately respond to an email and a call seeking comment late Tuesday on the decision. Following a trial that ended more than a year ago, Delaware Chancery Court Chief Judge Kathaleen St. J. McCormick sided with an investor who complained Tesla directors didn’t make proper disclosures about the 2018 executive compensation package and the performance benchmarks required of Musk. She also found that conflicts of interest marred the board’s consideration of the pay plan. “In the final analysis, Musk launched a self-driving process, recalibrating the speed and direction along the way as he saw fit,” the judge wrote in a 200-page ruling. “The process arrived at an unfair price. And through this litigation, the plaintiff requests a recall.” Musk, 52, has topped Bloomberg’s wealth list thanks to his stake in Tesla, the world’s most valuable auto company. The stock options from his compensation plan have vested in increments over the past few years as performance targets were achieved, but he hasn’t exercised any of the options, regulatory filings show. The billionaire was quick to react to the ruling on his social media platform X, formerly known as Twitter. He recommended “incorporating in Nevada or Texas if you prefer shareholders to decide matters.” Never incorporate your company in the state of Delaware Musk, who prides himself on snubbing corporate norms, has usually prevailed in court battles, including a shareholder suit over his acquisition of renewable-power provider SolarCity. In the compensation case, lawyers for Tesla shareholder Richard Tornetta argued board members failed to exercise independence as they drew up the pay package for the company’s chief executive officer and allowed him to improperly engineer the details of his pay plan to his liking. Musk dictated the “framework and financial terms, which remained fundamentally unchanged” throughout the board’s approval process, Tornetta’s lawyers argued in briefs. In her decision, McCormick noted that Musk acknowledged he was basically “negotiating against myself” in the back-and-forth over his pay. “The most striking omission from the process is the absence of any evidence of adversarial negotiations between the board and Musk concerning the size of the grant,” the judge wrote. The decision was delayed, in part, by the judge’s back surgery last year. Musk’s defense failed to explain why the “historically unprecedented compensation plan” was necessary to motivate the CEO to achieve “transformative growth.” Musk had no intention of leaving Tesla, and his ownership stake was sufficient motivation to keep him focused on growth, the judge said. “Swept up by the rhetoric of ‘all upside,’ or perhaps starry eyed by Musk’s superstar appeal, the board never asked the $55.8 billion question: Was the plan even necessary for Tesla to retain Musk and achieve its goals?” she wrote. During an earnings call last week, Musk was persistent in his pursuit for a bigger stake in Tesla, portraying the issue as all about his command of the carmaker rather than money. “I don’t want to control it, but if I have so little influence at the company at this stage, I could be voted out by some random shareholder advisory firm,” he said. Read More: Elon Musk Has Lost Sight of What Matters Tesla’s CEO called out proxy advisers Glass Lewis and Institutional Shareholder Services—he jokingly referred to the latter as the extremist group ISIS—and claimed they were infiltrated by “activists” with “strange ideas.” Greg Varallo, one of Tornetta’s lawyers, hailed the undoing of “the absurdly outsized pay package for Musk.” He added in an email that the decision wipes out the share-dilution effect Tesla shareholders suffered from this “gargantuan” plan. It remains unclear whether Musk will appeal Tuesday’s ruling or Tesla’s board will draw up a new pay package. Musk has spent years—and pledged a large part of his wealth—in pursuit of his ambitions to go to Mars through SpaceX, which has become the world’s second-most valuable startup and a juggernaut in the commercial space industry. He vowed to use options from the 2018 package to fund the Mars colonization if it was upheld. “Colonizing Mars is an expensive endeavor,” the judge wrote. “Musk believes he has a moral obligation to direct his wealth toward that goal, and Musk views his compensation from Tesla as a means of bankrolling that mission.” Read More: What Elon Musk Really Believes In a post on Twitter in 2018, he said “about half my money is intended to help problems on Earth & half to help establish a self-sustaining city on Mars to ensure continuation of life (of all species) in case Earth gets hit by a meteor like the dinosaurs or WW3 happens & we destroy ourselves.” The case is Tornetta v. Musk, 2018-0408, Delaware Chancery Court (Wilmington). Contact us at letters@time.com "
}