{
    "title": "Tesla slashes Model Y prices in Germany",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/video/tesla-slashes-model-y-prices-152919192.html",
    "text": "Tesla (TSLA) shares are down in the pre-market session after the automaker slashed Model Y prices in Germany, following price cuts in China. Production and distribution challenges persist for the EV manufacturer in international markets. Yahoo Finance’s Seana Smith and Brad Smith deep dive into the various factors contributing to Tesla’s current challenges. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim. SEANA SMITH: All right, let's take a look at Tesla because Tesla once again slashing prices. This time, in Germany, the EV maker cutting prices of its Model Y in the country after previously pulling back on the cost of goods Model Y and Model 3 vehicles in China. That was announced last week. We brought that news to you. We're seeing some pressure on the stock here this morning, off about 2%. The reason why, and one of the issues that analysts have talked about time and time again here at Yahoo Finance is the price cuts. What exactly that's going to do to margins. The pressure that could then put on margins. We've seen that over the last couple of quarters here for Tesla. And it looks like as these price wars play out on a global scale that's something Tesla's going to continue to contend with. BRAD SMITH: I mean, as we see this kind of pullback in EV demand right now. What you're seeing is price cuts as a demand generation mechanism from the auto manufacturers right now. And none more so than Tesla because their structure is vastly different. It's not a million dealerships that are around the world that are pumping all of these different vehicles that have been produced and delivered to some of those dealers on a regional basis through their own cost mechanisms that can have more of a one on one relation for each sale. For Tesla, it's online. And it's being able to go into certain malls to be able to place some of those orders or at least find out more about what the vehicle can do. What was interesting is even now we're getting more data year-over-year about where the used car sales of some of these vehicles are going. Carvana came out with some data this morning. They said, within its top 10 best selling EVs of 2023, two of those, two of the top three, were Tesla. The Tesla Model 3 was the number one. And there you're taking a look at one through five there, Tesla has two of those positions. And then, even if you go out to the top 10, Tesla has four of those top 10 positions within those sales too. Related Quotes "
}