{
    "title": null,
    "date": "1/11/2024",
    "url": "https://www.marketwatch.com/story/tesla-to-pay-raises-to-employees-bloomberg-e7b624fc",
    "text": "Tesla Inc. has told employees at its California car plant that it plans to boost wages across its U.S. factories in what the electric-vehicle maker described as a “market adjustment pay increase,” Bloomberg reported Thursday. The announcement was made on a poster at Tesla’s \n        TSLA,\n        +5.97%\n       facility in Fremont, Calif., and seen by Bloomberg, the news service’s report said. The company did not reply to an email from MarketWatch. Tesla’s stock was down by 3.1% on Thursday. All material handlers, quality inspectors and production associates at Tesla will be getting a raise, but specifics remain unknown. CNBC-TV reported in December that Tesla planned to pay a 10% raise at to most hourly workers at its Nevada gigafactory starting in January. The move follows other big automakers in increasing pay for workers including major new labor contracts between the United Auto Workers and Ford Motor Co.  \n        F,\n        -0.54%,\n       Stellantis NV \n        STLA,\n        -2.33%\n       and General Motors Co. \n        GM,\n        +0.45%,\n       as well as Hyundai Motor Co. \n        005380,\n        +0.42%,\n       Toyota Motor Corp. \n        TM,\n        +0.84%\n       and Volkswagen AG \n        VOW,\n        +0.32%. Tesla Chief Executive Officer Elon Musk has voiced opposition to the UAW and unions in the past. On the company’s most recent quarterly financial call with analysts in October, Musk said the company is focused on bringing its costs down to keep its cars as affordable as possible. “It’s like Game of Thrones but pennies,” Musk said, according to a transcript of the meeting. “If you’ve got a $40,000 car and roughly 10,000 items in that car, that means each thing on average costs $4. So in order to get the cost down, say, by 10%, you have to get 40 cents out of each part on average. It is a game of pennies.” Overall, Musk said cost-controls “does feel like digging a tunnel with a spoon at times.” Tesla’s team was able to reduce its cost per vehicle further despite headwinds from factory-idle costs and ramp-up of new factories, with “meaningful room for improvement,” Musk said. Meanwhile, at the 20,000-worker Fremont, Calif., plant, workers have formed an organizing committee with the United Auto Workers. A dispute with the UAW and the National Labor Relations Board over alleged violations of labor laws for Tesla’s move to fire a labor organizer remains in federal appeals court. Also read: Hertz cites weak demand, high damage costs in decision to downsize EV fleet “Usage of AI is going off the charts. The whole industry woke up when ChatGPT was shipped in late 2022,” David Schmaier, Salesforce’s president and chief product officer, said in an interview. Steve Gelsi covers banking and cannabis as a Senior Reporter for MarketWatch. Steve Gelsi covers banking and cannabis as a Senior Reporter for MarketWatch. Visit a quote page and your recently viewed tickers will be displayed here. "
}