{
    "title": "News Flash • Tesla expands into Hutto",
    "date": "1/3/2024",
    "url": "https://www.huttotx.gov/CivicAlerts.aspx?AID=226",
    "text": "Create a Website Account - Manage notification subscriptions, save form progress and more. Tesla has expanded into hippo nation.Ashley Bailey, director of development services for the City of Hutto, said the news represents yet another win for the East Williamson County area. Hutto has already attracted major datacenters such as Skybox as well as the Titan MegaTech Center, along with suppliers to the Samsung facility being built in adjacent Taylor. “With the substantial technology investments continuing to come to Hutto and our neighbors, East WilCo is becoming the place to be for future-focused development,” Bailey said. Tesla recently began occupying an existing industrial building on CR 199 in Hutto, located about 25 miles north of its famous Gigafactory. The clean energy company submitted plans to the City in late December 2023 for interior modifications to part of the 35,000-square-foot building, formerly occupied by The JRS Company, to best suit Tesla’s needs. Records indicate Tesla is anticipated to spend over $1.5 million on the improvements, with construction slated to start this month—pending formal permits.Once the project has passed all relevant inspections, information can be released as to the type of work that Tesla will do at the Hutto location and the next steps for this project. Tesla has expanded into hippo nation. Ashley Bailey, director of development services for the City of Hutto, said the news represents yet another win for the East Williamson County area. Hutto has already attracted major datacenters such as Skybox as well as the Titan MegaTech Center, along with suppliers to the Samsung facility being built in adjacent Taylor. “With the substantial technology investments continuing to come to Hutto and our neighbors, East WilCo is becoming the place to be for future-focused development,” Bailey said. Tesla recently began occupying an existing industrial building on CR 199 in Hutto, located about 25 miles north of its famous Gigafactory. The clean energy company submitted plans to the City in late December 2023 for interior modifications to part of the 35,000-square-foot building, formerly occupied by The JRS Company, to best suit Tesla’s needs. Records indicate Tesla is anticipated to spend over $1.5 million on the improvements, with construction slated to start this month—pending formal permits. Once the project has passed all relevant inspections, information can be released as to the type of work that Tesla will do at the Hutto location and the next steps for this project. "
}