{
    "title": "Tesla's Transparent Price-Cutting Is 'Poison' for Used EV Values",
    "date": "2/8/2024",
    "url": "https://financialpost.com/pmn/business-pmn/teslas-transparent-price-cutting-is-poison-for-used-ev-values",
    "text": "Tesla Inc.’s frequent prices cuts are “poison” for the used electric-car market , which is holding up better for manufacturers that handle discounting through dealers, according to global lease firm Ayvens. Author of the article: You can save this article by registering for free here. Or sign-in if you have an account. (Bloomberg) — Tesla Inc.’s frequent prices cuts are “poison” for the used electric-car market , which is holding up better for manufacturers that handle discounting through dealers, according to global lease firm Ayvens.  “Having a list price that goes up and down is poison for residual values,” the fleet manager’s Chief Executive Officer Tim Albertsen said Thursday. “It’s quite damaging for the market, and I think for the long term, it’s damaging for Tesla the way they do it.” Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience.  Tesla spent much of 2023 slashing prices, including a nearly 30% cut to the sticker of the top-selling Model Y in just over three months. Meant to stoke demand, the practice has devastated used-car values, prompting rental firms Hertz Global Holdings Inc. and Sixt SE to ditch Teslas from their fleets as depreciation is among their biggest risks to manage.  Read More: SAP Stops Offering Teslas as Company Cars to Employees  The US carmaker’s practice of announcing reductions via its website as part of its direct-to-consumer sales model are a particular problem, the Avyens CEO said, whose company manages about 3.5 million vehicles, including more than half a million EVs. The cuts immediately flow through to residual values, Albertsen said, which isn’t the case for carmakers that sell through dealer networks.  “Tesla is a difficult animal,” he said. The company is “very keen to keeping working with us and all the bigger players in the market so they are coming up with solutions.”  Read More: Weak Demand for Used EVs Is Making It Tougher to Sell New Ones  While other carmakers like Volkswagen AG likely have offered even deeper EV discounts, this transpires during individual sales conversations, Albertsen said, making effects on used cars more manageable.  The slump in secondhand EV values is outstripping declines for combustion-engine vehicles. While this makes used EVs more affordable, it’s painful for early adopters and has negative consequences for the car industry, including making new leases more expensive for consumers.  The issues with pre-owned cars — in addition to higher energy prices and insurance premiums — is undermining the assumption that EVs would be cheaper to run, a central claim in stoking demand. As buying incentives are being rolled back, adoption rates have started to slow.  The transition to electrification is “structural” but the path “may not be as linear as initially expected,” Albertsen said.  Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2024 Financial Post, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. You can manage saved articles in your account. and save up to 100 articles! You can manage your saved articles in your account and clicking the X located at the bottom right of the article. "
}