{
    "title": "‘I really need to be paid’: Tesla cancels large pie order last minute",
    "date": "2/24/2024",
    "url": "https://www.newsnationnow.com/us-news/west/tesla-large-pie-order/",
    "text": "NewsNation Amanda Hari SAN JOSE, Calif. (KRON) – A small business owner in Northern California says her pie shop is out thousands of dollars after Tesla unexpectedly canceled an order for thousands of mini pies. Voahangy Rasetarinera owns Giving Pies​ in San Jose’s Willow Glen neighborhood. Each pie is carefully assembled by hand in small batches. Despite that, the bakery has managed to put together orders for large corporations, like Apple, Google and Intuit. On Valentine’s Day, the bakery got a last-minute order request from Tesla – 2,000 pies, half to be delivered on Tuesday, the other half on Thursday. Rasetarinera said she agreed. But then the waiting game began for Tesla to pay. After not hearing from her contact, Rasetarinera says she reached out again and sent the invoice multiple times to multiple people. Finally, at 9 p.m. Thursday night, she got a call from Tesla. The company apologized for the delayed payment and asked to double the order to 4,000 pies. “So I contacted my staff and they’re like ‘Yes, we can work on Saturday, on Sunday, on Monday. We can get it done. No problem,’” Rasetarinera recalls. She says she sent Tesla a revised invoice and still did not receive a payment. She contacted them multiple times and finally got a response by text. “Sorry to bother you again, but I’m a small business. I don’t have the luxury of infinite resources so I really need to be paid so I can secure my staff. I received a message back that was like ‘Hey, so sorry, I don’t think we’re going to need this order anymore,’” Rasetarinera said. Rasetarinera had turned down other orders and already purchased resources like ingredients, boxes and stickers. After she posted about it on social media, she says Tesla saw it and reached out. “They said they wanted to make it right by me and they offered for me to do two events on March 6 and 7, but I’m still waiting for confirmation,”  she said. “If they want to make it right, I’m going to give them the opportunity to make it right.” KRON4 reached out to Tesla for comment, but as of Thursday night, they have not responded. Copyright 2024 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Jimmer Fredette, Kareem Maddox, Canyon Barry and Dylan Travis piled up enough wins together last year to get USA Basketball qualified in men’s 3×3 for the Paris Olympics. They’re staying together to chase gold in France. USA Basketball announced its men’s 3×3 roster for the Paris Games on Tuesday, going with the same foursome that […] ORLANDO, Fla. (AP) — Kickoff returns are returning to the NFL. Team owners on Tuesday approved a new rule that will take what essentially had become “a dead play” and make it an integral part of the game again, a person familiar with the decision told The Associated Press. The person spoke to the AP […] LOS ANGELES (AP) — In a women’s NCAA Tournament where Iowa’s Caitlin Clark, LSU coach Kim Mulkey and undefeated South Carolina have dominated the headlines, the Pac-12 Conference is making sure it doesn’t go away quietly in its final season. The onetime Conference of Champions leads the way with five teams making the Sweet 16. […] A timeline of events following the total collapse of the Francis Scott Key Bridge. A container ship struck a major bridge in Baltimore early Tuesday, causing it to plunge into the river below. From 1960 to 2015, there were 35 major bridge collapses worldwide due to ship or barge collision, with a total of 342 people killed, according to a 2018 report from the World Association for Waterborne Transport […] NASHVILLE, Tenn. (AP) — Nearly a year after a shooting at a Christian elementary school in Nashville that left three adults and three children dead, the students and their families have formed tight bonds out of their shared suffering. They’ve also adopted a lot of dogs. Among the adopters is Matthew Sullivan, who now cares […] The vessel was built in 2015 and, to date, it has logged more than 195,000 nautical miles without a major incident. Here’s a brief history about the construction and motive behind the Francis Scott Key Bridge. DES MOINES, Iowa (AP) — The Powerball jackpot increased to an estimated $865 million after no one won Monday night’s drawing, continuing a winless streak that dates to New Year’s Day. The numbers drawn were: 7, 11, 19, 53 68 and red ball 23. Since the last winner on Jan. 1, there have been 36-straight […] "
}