{
    "title": "How a heavy metal drummer stripped Elon Musk of a $56 billion pay package",
    "date": "2/2/2024",
    "url": "https://indianexpress.com/article/explained/explained-global/elon-musk-pay-package-drummer-9141259/",
    "text": "A Delaware court judge on Tuesday (January 30) cancelled Elon Musk’s $56 billion pay package for his work as Tesla CEO, favouring a Tesla shareholder, who claimed that the package was unfair. If the verdict sustains appeal, it could severely hit the fortunes of Musk, currently one of the richest people in the world. Notably, the billionaire’s 2018 pay package for leading Tesla is much larger than any executive pay package to date, according to a report by Reuters. Here is a look at who sued Musk, why, and what the judge said. Who sued Musk? Richard Torenetta, a resident of Pennsylvania, sued Musk and other Tesla directors in 2018 over Musk’s pay package. At the time, he held just nine shares of the company. Torenetta was the drummer for the heavy metal band Dawn of Correction between 2005 and 2007. The band released a full-length studio album, ‘Dead Hand Control’, in 2007 and performed in music festivals. Subsequently, Torenetta, who holds a degree in industrial design, went on to work in the marketing department at an online real estate marketing service, according to a report by the New York Post. On a social media platform, he described himself as a “marketer, inventor, custom fabricator, car guy, family man and drummer,” and claimed that he “designed and built an illuminated headpiece for onstage drumming performances,” the report added. It remains unclear if Torenetta still owns those nine shares of Tesla or has bought more shares over the years. In the past five years, the company’s share prices have jumped by 800%, the New York Post said. Why did Torenetta sue? Torenetta claimed that Musk’s pay package was unfair. According to the Reuters report, the package gives Musk stock grants worth around 1% of Tesla’s equity each time the company achieved one of 12 tranches of escalating operational and financial goals. Torenetta said, “Shareholders were not told how easily the goals would be achieved when they voted on the package,” the report added. In its defence, Tesla’s board of directors argued that the pay package was required to ensure that Musk continued to dedicate his attention to the company. The Guardian reported that “Antonio Gracias, a Tesla director from 2007 to 2021, called the package ‘a great deal for shareholders’ because he said it led to the company’s extraordinary success”. Torenetta, however, said the pay was not necessary to incentivise Musk to help Tesla succeed, as the billionaire already owned around 22% of the company’s stock. What did the court say? In her ruling, Judge Kathaleen McCormick wrote that the pay package’s share-based compensation was negotiated by directors who appeared beholden to Musk, according to Reuters. “Swept up by the rhetoric of ‘all upside,’ or perhaps starry eyed by Musk’s superstar appeal, the board never asked the $55.8 billion question: Was the plan even necessary for Tesla to retain Musk and achieve its goals?” she wrote. Judge McCormick also noted that Tesla’s current board of directors lacks independence as it includes Kimbal Musk, Elon Musk’s brother, and James Murdoch, son of media tycoon Rupert Murdoch, who have close relationships with Musk. (With inputs from Reuters) The U.S. is monitoring the arrest of Indian opposition leader Arvind Kejriwal and urges a fair legal process. Germany also expressed concern over the arrest, causing India to protest. Delhi CM and AAP leader Arvind Kejriwal was arrested on corruption charges a month before national elections. The U.S. and Germany both emphasize the importance of a fair and impartial trial for Kejriwal.    "
}