{
    "title": "Tesla’s Super-charged Equity Award to Elon Musk Unplugged by Delaware Court \nCautionary Tale for Boards and ...",
    "date": "2/15/2024",
    "url": "https://www.jdsupra.com/legalnews/tesla-s-super-charged-equity-award-to-1183809/",
    "text": "The Delaware Chancery Court invalidated a substantial equity award to Elon Musk – the largest in history.  It applied the entire fairness test instead of the more deferential business judgment rule, finding that Musk “controlled” Tesla and dominated the grant approval process. Key factors included: Even though Tesla conditioned the award on approval by a majority of disinterested stockholders, the burden of proof did not shift to plaintiffs.  The court determined stockholders were not “fully informed” because of misleading statements and omissions in the proxy statement, including: Even recognizing that Musk may appeal, the ruling provides lessons for companies and their boards when making compensation decisions: Carefully evaluate the independence of directors handling material compensation matters. Establish that directors satisfy their duty of care to act deliberately and on a fully informed basis. Pay attention to disclosures of compensation proposals to stockholders. Background In 2018, Tesla awarded Elon Musk a performance-based equity-compensation plan that stockholders approved at the annual meeting. The plan offered Musk the opportunity to receive twelve tranches of options, each representing 1% of Tesla’s total outstanding shares. For a tranche to vest, Tesla’s market capitalization needed to increase by $50 billion and Tesla needed to achieve either an adjusted EBITDA target or a revenue target in four consecutive fiscal quarters. According to the board and Musk, the plan provided “all upside” for stockholders – they risked nothing – and gave “6% for $600 billion.” With a $55.8 billion maximum value and $2.6 billion grant date fair value, the plan was the largest potential compensation opportunity in history. In June 2018, the plaintiff filed his complaint asserting breaches of fiduciary duty and waste against the defendants and unjust enrichment against Musk.  The court dismissed the waste claim but found for the plaintiffs on the others. Although Delaware law does not automatically require rescission due to material disclosure failures, the court concluded that invalidation of the award was appropriate because no third-party interests were implicated, it had not been exercised and any exercised shares would be subject to the five-year holding period. Business Judgment Rule Not Available; Entire Fairness Test Applied The court applied the Delaware entire fairness test instead of the more lenient business judgment rule because Musk “controlled” Tesla and dominated the grant approval process.  The finding of Musk’s control was based on (1) his 22% stock ownership; (2) his “superstar” status with influential positions as CEO, Chair and founder and with managerial authority over the company, often disregarding board authority; (3) “thick ties” with directors negotiating on behalf of the company, rendering them “beholden to him” and therefore non-independent, and (4) his domination of the process leading to board approval of the compensation plan. Application of Entire Fairness Test The court examined both elements of the entire fairness test: process and price. “Deeply Flawed” Board Process. The court found that the board approval process was “deeply flawed,” citing, among other things: Failure to Calibrate Size or Structure of Plan. The court also criticized the price – the design of the plan – which would reward Musk with up to an additional 6% ownership if Tesla’s market capitalization increased $600 billion while also achieving certain revenue and adjusted EBITDA growth metrics. Key failures included: No Burden Shifting due to Disclosure Failures Tesla conditioned the plan on approval by a majority of disinterested stockholders.  Under Delaware law, that would normally allow defendants to shift the burden of proof – even if, as here, the committee was not independent.  However, the court found that defendants were unable to prove that the stockholder vote was fully informed because the proxy statement: The court also rejected various arguments made by defendants, finding they did not satisfy their burden of proof with respect to establishing: [View source.] See more » DISCLAIMER: Because of the generality of this update, the information provided herein may not be applicable in all situations and should not be acted upon without specific legal advice based on particular situations. © BCLP  |  Attorney Advertising Refine your interests » Back to Top Explore 2024 Readers' Choice Awards Copyright ©  JD Supra, LLC "
}