{
    "title": null,
    "date": "2/12/2024",
    "url": "https://www.businessinsider.com/elon-musk-tesla-model-y-winter-discount-2024-2",
    "text": "       Elon Musk just announced another Tesla price cut. In a post on X, the Tesla CEO said the automaker would offer a $1,000 discount on the Model Y through February because people “don’t love to buy cars in the middle of winter.\" “This is the essential quandary of manufacturing: factories need continuous production for efficiency, but consumer demand is seasonal,” he added. Related stories The price cut applies to the Model Y rear-wheel drive and long-range versions sold in the US, which now cost  $42,990 and $47,990 respectively, but not to the “performance” variant, per Tesla’s website. It's a temporary discount, however. Model Y prices will rise again on March 1. The Model Y, which Tesla first unveiled in 2019, is the company's most popular model and accounted for around one-third of all EV sales in the US last year, per data from Kelley Blue Book. Tesla has cut prices several times in the past year as EV demand slows and it attempts to fend off competitors. The latest price cut kicks off a pivotal year for the automaker. Elon Musk warned investors in last month’s earnings of a sales slowdown. And the company is also preparing to ramp up production of an affordable mass-market EV codenamed “Redwood.” The billionaire warned Tesla workers to expect a grueling version of the firm’s famed “production hell” and that they would need to sleep and live on the line to build the car. The push to make its cars cheaper comes as Tesla faces the looming threat of real competition in the form of Chinese automaker BYD. The Warren Buffett-backed company overtook Tesla as the world’s top seller of electric vehicles at the start of the year, and is now eyeing expansion into Europe, one of Tesla’s key markets. Tesla did not immediately respond to a request for comment from Business Insider, made outside normal working hours. Read next Jump to "
}