{
    "title": "DBS unveils a scent-sational new way to celebrate this Lunar New Year | The \nWork",
    "date": "2/9/2024",
    "url": "https://www.campaignasia.com/article/dbs-unveils-a-scent-sational-new-way-to-celebrate-this-lunar-new-year/494292",
    "text": "One of Asia's largest banks, DBS has partnered with The Secret Little Agency and Oo La Lab this festive season to give customers a whiff of wealth and prosperity...literally. In a fragrant twist to the Lunar New Year celebrations, DBS, one of Asia's most prominent banks, has introduced a limited-edition scential offering: the Huat Eau De Parfum. Drawing inspiration from the scent of new banknotes—yes that's right, actual money—the parfum is designed to add an element of 'Huat'—a term associated with prosperity and good fortune, into the holiday celebrations. The fragrance was developed in collaboration with The Secret Little Agency (TSLA) and crafted by perfume specialists at Oo La Lab. The aim was to encapsulate the unique aroma associated with newly-minted currency and the festive smells of red packets and greeting cards.  \"Fragrance plays a powerful role in storytelling and creating memorable experiences. In an era where digital gifting is on the rise, the Huat Eau De Parfum introduces a novel sensory layer to the tradition, making it more enjoyable and engaging,\" said Nicholas Ye and Mavis Neo, co-chief creative officers at TSLA. \"We aimed to recreate the distinctive scent of prosperity, combining aldehydes, ink, and soft musk to evoke the essence of new banknotes and the festive season,\" added Dan Terry Jacobson, founder of Oo La Lab. To make the holiday even more special, DBS/POSB is distributing 2,500 bottles of this unique perfume to its customers. This move pairs perfectly with the bank's increasingly popular QR Ang Bao gifting feature, a digital take on the traditional New Year monetary gift. This year, the QR Ang Bao also comes with a new twist—a slot-in design that mimics the classic experience of opening a traditional Ang Bao. By adding a touch of the Huat Eau De Parfum, givers can elevate this modern gifting method, allowing recipients to embrace in the fragrance of prosperity as they discover their digital gift. \"By integrating this scent with our QR Ang Bao, we hope to enrich the digital gifting experience for our customers during the Chinese New Year,\" shared Lim Bee Bee, the head of marketing for Consumer Banking Group (Singapore) at DBS Bank. The perfume will be available for free at selected locations and events, including the bank’s pop-up ATMs and the River Hongbao 2024. Participants can use their DBS PayLah app for sending a QR Ang Bao or eGift. Top news, insights and analysis every weekday Sign up for Campaign Bulletins As the ‘humans being humans’ trend goes viral on TikTok, BBH's Kyle Duckitt explains how marketers can tap into the connection between humancore and AI. Publishers are struggling to assess the value of multiple vendor relationships while streamlining their tech stack. Campaign asks experts in the region for suggestions on what publishers should do. The fast-food joint started with a vision to obtain high-value users in South Korea. We speak to the brand’s digital marketing representative to learn about the brand’s data-driven approach to obtain long-term users and optimise creative campaigns. A charismatic leader, Titshall’s drive for excellence is infectious, but hard to match. Terms & Conditions / Contact Us © Haymarket Media Ltd. "
}