{
    "title": "Tesla investors should think twice about Musk’s plan to reincorporate in \nTexas",
    "date": "2/3/2024",
    "url": "https://www.marketwatch.com/story/tesla-investors-should-think-twice-about-elon-musks-plan-to-reincorporate-in-texas-87f46be7",
    "text": "Tesla Inc. investors need to carefully consider Elon Musk’s possible forthcoming proposal to reincorporate the electric-vehicle maker in Texas, a business-friendly state that may not be as focused on the rights of shareholders as Delaware. The Tesla \n        TSLA,\n        +5.71%\n       chief executive said Thursday on X, formerly known as Twitter, that he plans to “immediately hold a shareholder vote to transfer state of incorporation to Texas.” Musk has soured on Delaware, where the majority of U.S. corporations are incorporated, after the chancellor of the Delaware Chancery Court issued a ruling in a shareholder lawsuit Tuesday that voided his $56 billion pay package. For more: Nullification of Elon Musk’s pay package could be a wake-up call for corporate boards. “People come to Delaware for a very important reason, it is considered a neutral jurisdiction. It intelligently decides corporate disputes, and has the best judges in the country to revolve corporate disputes,” said Charles Elson, founding director of the Edgar S. Woolard Jr. Chair in Corporate Governance at the University of Delaware. “There is no home-court advantage in Delaware.” And that appears to be specifically the point now for Musk, and possibly for many other U.S. executives as well. Companies have been moving to Texas from states perceived as less business-friendly, like California, and some are considering reincorporating there. Texas has now even created its own business courts, which will begin hearing cases in September on “certain types of complex commercial disputes.” “More than 10% of the Fortune 500 is headquartered in Texas — 55 of the 2023 list,” said Brad Foster, a Dallas-based partner at Haynes Boone’s corporate-governance practice group. “The majority have long been incorporated in Delaware, but there is competition. Texas wants to be at the front of that.” And it appears that Texas could end up being more friendly to businesses and CEOs, rather than shareholders. “Texas has modern business statutes, in terms of the legal requirements for corporations. The fiduciary duties for officers and directors, those are substantially similar to Delaware’s,” Foster said. “In both states, you owe the same duties. But in Texas, the duties are owed to the corporation only, so that’s one difference, as opposed to fiduciary duties that may run to minority shareholders or implied duties. Whereas Texas has more straightforward duties that are owed directly to the corporation.” Also read: Can Elon Musk do ‘whatever he wants’? Why moving Tesla out of Delaware may spook investors. Elson said that shareholders should really look at Musk’s motivation for wanting to move the company before they vote on a possible reincorporation, if a vote does come up. “A pro-shareholder decision in Delaware is a good reason to move to another jurisdiction?” he asked. One key element of Delaware Chancellor Kathaleen McCormick’s ruling was her finding that Musk controlled Tesla’s board, at least in the instance of creating his massive compensation package — the largest ever in corporate America — and that the process itself was flawed. The ruling has also brought up a huge debate around the concept of “pay for performance,” with many agreeing that Musk deserved to be rewarded for having met such oversized, seemingly unreachable goals at Tesla. “This was a gigantic number, but when I first looked at it, the targets were just astronomical, I don’t know of any company that has hit such targets,” said David Larcker, professor of accounting, emeritus, at Stanford Graduate Business School and senior faculty at the Rock Center of Corporate Governance. “So at some point, as a shareholder, would you be willing to give up some ownership or experience some dilution for the chance of an astronomical payoff?” As McCormick noted in her opinion, “each market-capitalization milestone increase of $50 billion required Tesla to grow in size roughly equal to the market capitalizations of each of Tesla, Ford and GM as of early 2018.” But she did not agree with the price. With Musk “self-driving the process,” the process arrived at an unfair price, she wrote. Putting aide the debate on whether Musk was paid too much, the more important aspect is the state of Tesla’s board, then and now. The board at the time of Musk’s comp package was — and still is today, even with some changes — viewed as rubber-stamping all of Musk’s demands. They do not appear to provide any checks and balances that are required of a board of directors, whose fiduciary duty in Delaware includes acting in good faith to do what each director believes is “in the best interests of the corporation and its stockholders collectively.” As Elson notes, the “raison d’etre of the Delaware Chancery Court is to protect shareholder capital.” And if Tesla directors are too beholden or loyal to Musk, can they really be the best checks and balances of the CEO in charge of that shareholder capital? If Musk is able to persuade enough Tesla shareholders to move to reincorporate in Texas, it’s not clear what kind of protection or rights shareholders will have going forward. The Texas business courts won’t be up and running until September, so there is no case law to determine what kind of rulings could come out of them. But it seems quite feasible that Musk, as an important and possibly the loudest employer in Texas, will have a big voice in a big state — and that voice right now seems focused on looking after No. 1.   Affiliate of Saudi sovereign wealth fund will buy $1 billion of a new series of convertible preferred stock via private placement. Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. Visit a quote page and your recently viewed tickers will be displayed here. "
}