{
    "title": "Silicon Valley bakery claims it lost $16k after Tesla placed order for \n4,000 pies to 'celebrate Black History",
    "date": "2/23/2024",
    "url": "https://www.dailymail.co.uk/news/article-13118481/tesla-canceled-pie-order-black-history-month-bakery-claims.html",
    "text": "By Martha Williams For Dailymail.Com Published:  17:51 GMT, 23 February 2024   |  Updated:  16:34 GMT, 24 February 2024  244 View  comments  A Silicon Valley baker says she is reconsidering her business policies after prepping an order placed by Tesla for 4,000 mini pies, which the company 'canceled at last minute'. The Giving Pies in San Jose, California, are accustomed to working with big corporations like Meta, Google, Apple and Amazon. However, a recent order made by Tesla for 4,000 pies cost the local bakery around $16,000 after the clean energy company allegedly canceled the order all of a sudden at the last minute. The thousands of mini pies, which cost around $3-$4 each, were supposedly ordered for a Tesla event to commemorate Black History Month. Voahangy Rasetarinera owns the Willow Glen neighborhood bakery and says that she took a big hit after the massive pie order caused her to reject other requests, splurge on ingredients and work around the clock alongside her employees to complete the order. Tesla are being slammed for placing a huge order for 4,000 pies from a local Silicon Valley bakery before canceling the order last minute The Giving Pies in San Jose, California, are accustomed to working with big corporations like Meta, Google, Apple and Amazon (pictured: bakery owner Voahangy Rasetarinera) A recent order made by Tesla for 4,000 pies cost the local bakery around $16,000 after the clean energy company allegedly canceled the order all of a sudden at the last minute Voahangy Rasetarinera says that she took a big hit after the massive pie order caused her to reject other requests, splurge on ingredients and work around the clock alongside her employees to complete the order 'To fulfill the order, I had turned down other Black History Month catering inquiries, purchased supplies, and prepared for a demanding production schedule,' Rasetarinera explained. Tesla reached out to the locally-loved bakery on Valentine's Day to place the order for 2,000 mini pies to be delivered the following Tuesday and Thursday - which is short notice for the bakery, according to Rasetarinera. In a post on Facebook titled 'How Tesla's actions hurt my small black women-owned business,' Rasetarinera explained the series of events. The post detailed how the payment did not go through, which caused initial concern. Despite the lack of payment, Laura from Tesla reached out to the bakery again to apologize for the delay and request that the order be doubled to 4,000 pies, assuring the bakery that 'cost was not an issue.' Tesla reached out to the locally-loved bakery on Valentine's Day to place the order for 2,000 mini pies to be delivered the following Tuesday and Thursday (Pictured: Elon Musk, Tesla CEO) Tesla reached out to the bakery again to apologize for the delay in payment and request that the order be doubled to 4,000 pies, assuring the bakery that 'cost was not an issue' 'To fulfill the order, I had turned down other Black History Month catering inquiries, purchased supplies, and prepared for a demanding production schedule,' Rasetarinera explained. Rasetarinera said that her hopes were 'shattered' when Laura 'casually' texted her to say that Tesla no longer needed the pies after she had already bought the supplies and prepared for the order 'Despite the late hour and short notice, I consulted with my staff, who assured me they could manage the expanded order,' the post described. Rasetarinera said that her hopes were 'shattered' when Laura 'casually' texted her to say that Tesla no longer needed the pies after she had already bought the supplies and prepared for the order. 'This abrupt reversal left me reeling, realizing the extent of the impact on my small business,' the business owner said. 'I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry.' After sending Laura a heartfelt message expressing her disappointment, Rasetarinera said that her response attempted to 'shift blame to upper management.' 'To me, it was clear that Tesla's corporate culture prioritized convenience over accountability, disregarding the livelihoods of small business owners like myself,' Rasetarinera wrote on the company's Facebook page. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}