{
    "title": "Ford gives cause to not chase Tesla- Republic World",
    "date": "2/7/2024",
    "url": "https://www.republicworld.com/business/ford-gives-cause-to-not-chase-tesla/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated February 7th, 2024 at 12:12 IST Unlike General Motors, Ford’s has opened up on its rivers of battery-powered red ink. Danger: low voltage. Ford Motor wants investors to have its cash. The Detroit-based automaker announced an extra dividend on Tuesday, the flipside to scaled-back spending on money-losing electric vehicles. Unlike cross-town rival General Motors, Ford’s decision to disclose its rivers of battery-powered red ink makes clear that its horizons may need to shrink further. For investors, that's a boon. Fueled by its combustion- and, increasingly, hybrid-engine business, Ford beat expectations in fourth-quarter results. Like GM, Ford doesn’t think recently increased wages will leave a scar. Expected operating profit of $10 billion to $12 billion in 2024 shows room for growth from 2023's $10.4 billion. And, again like its archnemesis, Ford is using its core strength in combustion engines to offset the pain of bad electric news by spreading the wealth. Shares rose roughly 6% after-market. Where Ford differs from GM is in allowing investors a closer look under the hood of its electric business. Losses per car of over $46,000 are up by a quarter from the prior three months alone. Little wonder the company postponed a planned battery plant, shrunk another, and cut an international joint venture. Boss Jim Farley promises next-generation vehicles will be profitable at launch. But the message is clear: Investments won’t happen “until they’re justified by demand,” and its electric business must stand on its own. The unit serves a purpose no matter what – one battery-powered ride sold leaves room under government emissions rules to offload a dozen gas-powered cars without incurring penalties. But Ford is paving a road away from the narrative that it will have to become the next Tesla, or wither. Published February 7th, 2024 at 12:12 IST Send us your views, we’ll publish them. This section is moderated. 'Shakti Swaroopa': PM Modi Speaks to Rekha Patra, Sandeshkhali Victim Beyond Bengaluru: 10 Indian Cities Facing Water Shortage Threat | List Pune: Revised Traffic Plans at SPPU Chowk Fails to Curb Congestion Laxman Sivaramakrishnan SHUTS DOWN with troll with savage response 'Whenever Virat Kohli retires, people will..': Pietersen's prediction BJP's Kabir Shankar Bose Faces Former Father-in-Law Kalyan Banerjee Not Veer Savarkar Or Madgaon Express, THIS Movie Ruled BO On Holi 'My Janmabhoomi Has Called Me Back': Kangana Ranaut After BJP Ticket Virat Kohli's reaction to Shikhar Dhawan's doppelganger is all hearts Randeep Hooda-Lin Laishram Celebrate First Holi Post Marriage | Photo © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}