{
    "title": "Tesla settled hazardous waste disposal charges for $1.5M with the OCDA and \nother district attorneys",
    "date": "2/4/2024",
    "url": "https://newsantaana.com/tesla-settled-hazardous-waste-disposal-charges-for-1-5m-with-the-ocda-and-other-district-attorneys/",
    "text": "Santa Ana's top news & views blog SANTA ANA, Calif. – Orange County District Attorney Todd Spitzer, along with 24 other District Attorneys throughout California, announced today that a judge in San Joaquin County has ordered Tesla, Inc. to pay $1.5 million as part of a settlement of a civil environmental prosecution alleging the electric car company illegally disposed of hazardous waste at its car service centers, energy centers and its factory in Fremont. In the complaint filed in San Joaquin County, prosecutors accused Tesla of illegally disposing of hazardous waste generated during its servicing and manufacturing of its electric vehicles in violation of California law establishing the proper control, storage, management and disposal of hazardous waste. Tesla, Inc., a Delaware Corporation, currently owns and operates approximately 57 car service centers and 18 solar energy facilities throughout California. It also manufactures electric vehicles at its Fremont factory in Alameda County. The case was brought by the San Francisco District Attorney’s Office and 24 other California District Attorney’s Offices where Tesla’s car service centers and energy locations are located. “A company that is supposedly environmentally friendly should know better than to illegally dump hazardous waste that threatens to do irreparable damage to our communities. More than two dozen district attorney’s offices in California banded together in this investigation to hold Tesla accountable for its egregious misconduct,” said Orange County District Attorney Todd Spitzer. “The settlement serves as a reminder to companies that don’t adopt responsible practices that they can face legal consequences when they mismanage hazardous waste.” “While electric vehicles may benefit the environment, the manufacturing and servicing of these vehicles still generates many harmful waste streams,” said District Attorney Brooke Jenkins. “Today’s settlement against Tesla, Inc. serves to provide a cleaner environment for citizens throughout the state by preventing the contamination of our precious natural resources when hazardous waste is mismanaged and unlawfully disposed. We are proud to work with our district attorney partners to enforce California’s environmental laws to ensure these hazardous wastes are handled properly.” The investigation, initiated by the San Francisco District Attorney’s Office Environmental Division began in 2018 when San Francisco District Attorney investigators conducted undercover inspections of Tesla, Inc.’s trash containers at its car service centers, which revealed the illegal disposal of numerous hazardous automotive components (i.e., lubricating oils, brake cleaners, lead acid and other batteries, aerosols, antifreeze, waters solvents and other cleaners, electronic waste, waste paint and debris contaminated with the above). Following this discovery, District Attorney investigators from Alameda, Monterey, Orange, Placer, Riverside, San Diego, and San Joaquin counties conducted additional inspections at Tesla, Inc.’s car service centers throughout California and found similar unlawful disposals. Alameda County District Attorney investigators also conducted waste inspections of trash containers at the Fremont factory and found the unlawful disposal of additional hazardous waste, including metal car panel welding spatter waste (which can contain copper), waste paint mix cups produced during paint repair and wipes/debris contaminated with primer. Tesla, Inc. cooperated with the District Attorneys’ investigation and took steps to improve its compliance with the environmental protection laws brought to its attention by the prosecutors. After Tesla was notified of the issues, they began quarantining and screening trash containers for hazardous waste at all of its service centers before trash was brought to the landfill. As part of the settlement, Tesla, Inc. is ordered to pay $1.3 million in civil penalties and $200,000 to reimburse the costs of the investigation. Tesla also is ordered to comply with a detailed injunction for five years. Injunctive compliance measures include proper training of employees and the hiring of a third party to conduct annual waste audits of its trash containers at 10 percent of its facilities. These audits will occur each year for five years and auditors will examine trash containers for hazardous waste.  The New Santa Ana blog has been covering news, events and politics in Santa Ana since 2009. This site uses Akismet to reduce spam. Learn how your comment data is processed. Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address Subscribe Santa Ana's top news & views blog "
}