{
    "title": "These three Magnificent Seven stocks are earnings winners",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/video/three-magnificent-seven-stocks-earnings-163329144.html",
    "text": "The top tech stocks, known as the Magnificent Seven - Amazon (AMZN), Apple (AAPL), Alphabet (GOOG,GOOGL), NVIDIA (NVDA), Meta (META), Microsoft (MSFT), and Tesla (TSLA) have all reported their latest quarterly results. Following the reports, analysts revised their earnings estimates for upcoming quarters. Yahoo Finance Markets Reporter Josh Schafer explains how the Wall Street's views on the Magnificent Seven may be evolving. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino BRAD SMITH: All Magnificent Seven companies have reported their fourth quarter results. The majority seeing upward estimates revision-- estimate revisions rather an average of over 7% for the quarter. That's according to Datatrek Now, let's bring in \"Yahoo Finance's\" Josh Schafer for more details on this. Hey, Josh. JOSH SCHAFER: Yeah, Brad. Datatrek did a great job breaking this down in their evening note last night. And I want to zoom out a little bit here and take a look at some of the other earnings revisions they had. So we had earnings from all of the Magnificent Seven companies. And then, of course, the big question is, well, what do analysts think are now going to happen for the current quarter for the next year? And maybe even out into 2025? That's what gets priced into these stocks. So if you take a look here, this is what's changed in earnings estimates over the last 30 days. So this is not expectations for next year, necessarily, directly, it is what has changed in the last 30 days. You see, really, I think the takeaway here, Seana, you're looking at it. There's only three companies that really saw big changes. And that to me is one of the prevailing takeaways here. NVIDIA Amazon, Meta, the big three winners of this earnings season. You can see Alphabet actually had its estimates up a little bit. But we were talking about this off air and discussing what do we learn from this. And I think it's the three companies there. And then if you look at year-to-date performance in these stocks, you probably have to give Microsoft a little bit of credit. Microsoft is up about 8%. So a little bit over the market. So maybe we'll call it 3 and 1/2. But to me, the prevailing takeaway that we've seen in earnings projections, movements is maybe we're not talking about the Magnificent Seven. Maybe, it's the Fantastic Four or the 3 and 1/2. I don't know. But it seems like we're no longer in this seven tech stock phase. And it's certainly narrowed. BRAD SMITH: The triple threat. Yeah. SEANA SMITH: Triple threat. That was a good one. OK. I was trying to I was sitting over here trying to come up with something quick. You beat me to it. But, Josh, I think also for investors is what this means for the broader market. Zooming out even more, talking about how this is factoring into S&P projections for year end. We've seen a number of analysts, even this week with Barclays out this morning, upping their target even more. JOSH SCHAFER: And in most of these strategists that are coming out and saying they expect the S&P 500 to rise higher, so Barclays coming out and saying that they think it's going to go to 5,300. They're boosting their target from 4,800. The main driver of that is big tech. So they're saying they think the economy is going to hold up well, which is, of course, important, because, big tech also needs the economy to do well. But then they're also highlighting that they think that big tech is going to be the big outperformer here. And they said in this release here in their research, they were highlighting, overall, how much more big tech is worth in the earnings story than the rest of the S&P 500, and really, the rest of big tech. If you were to remove big tech, I'm looking at their projections for the full year 2024 right now. You're talking about the rest of the S&P 500 being at like $177 worth of earnings. Instead of when you add in big tech you get $46 worth of earnings in that. So it's a significant increase when you're adding in big tech and adding in those high expectations. That's what's driving these targets higher right now. SEANA SMITH: It seems like nothing stopping-- what is it? Triple threat-- BRAD SMITH: The trifecta, the hat trick. JOSH SCHAFER: One day, we got to just do two hours on just the triple threat. We'll just talk about the three stocks. BRAD SMITH: Triple double. SEANA SMITH: You're onto something. JOSH SCHAFER: It's all the-- SEANA SMITH: It's going very well. JOSH SCHAFER: Who needs the 497? BRAD SMITH: Nobody. Related Quotes "
}