{
    "title": "Tesla to buy Nvidia and AMD hardware worth billions to fuel its AI efforts",
    "date": "1/28/2024",
    "url": "https://www.notebookcheck.net/Tesla-to-buy-Nvidia-and-AMD-hardware-worth-billions-to-fuel-its-AI-efforts.797942.0.html",
    "text": "After a few delays, the Dojo ExaPod supercomputer went online last year. This machine can deliver up to 1.1 exaflops of computing power optimized for AI tasks. While this first Dojo supercomputer uses custom AI chips designed by Tesla, its successors will use both Nvidia and AMD processors, reveals Elon Musk. While talking about a new $500 million project for the New York Gigafactory, Musk pointed out that this amount could buy around 10,000 H100 AI GPUs by Nvidia, but Tesla has plans to spend much more. He said that the company \"will spend more than that on Nvidia hardware this year. The table stakes for being competitive in AI are at least several billion dollars per year at this point.\" When asked about possible plans to buy AI chips from AMD, Tesla's head simply replied with a \"Yes\" without going into the details. Unless AMD will surprise everyone and make some custom chips for Tesla — which is quite unlikely, but not completely out of the picture — the latter will buy AI processors from the Instinct MI300 lineup, namely the Instinct MI300X. Unveiled alongside the world's first data center APU (Instinct MI300A), the MI300X is similar to the Nvidia H100 when subjected to training tasks, but can be 1.6 times faster when facing AI inference scenarios. Unlike Nvidia's solution, which works with its own networking hardware, the MI300X platform can handle a wide range of NICs. Unsurprisingly, the next Dojo supercomputer(s) will be used by Tesla to get closer to its goal of providing safe, fully autonomous vehicles to both individuals and large business customers. Those who want to take a look into the past of supercomputing could grab Stephen H. Kaisler's The Control Data Corporation’s Supercomputer Systems, a book covering CDC's machines that dominated the market for over two decades, unti the mid-1990s. Elon Musk (on X/Twitter) "
}