{
    "title": "Tesla to idle German plant for 2 weeks as Red Sea attacks delay supplies",
    "date": "1/12/2024",
    "url": "https://www.cnn.com/2024/01/12/business/tesla-germany-production-halt-red-sea/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Follow: Tesla plans to pause most production at its only European factory due to supply chain problems caused by attacks in the Red Sea. The carmaker said it would halt output at its huge factory near Berlin for two weeks from January 29 because assaults on container ships along the vital trade route had delayed the delivery of components, CNN affiliate RTL reported Friday. Tesla (TSLA) has not responded to a CNN request for comment. The Grünheide factory is capable of producing 375,000 cars a year for customers across Europe. Tesla plans to fully resume production on February 12, RTL said. In recent weeks, Houthi militants, based in Yemen, have ramped up attacks on vessels traveling through the Red Sea, saying they are revenge for Israel’s war against Hamas in Gaza. As a result, six of the world’s 10 biggest shipping companies — namely Maersk, MSC, Hapag-Lloyd, CMA CGM, ZIM and ONE — have been largely or completely avoiding the Red Sea. Carriers have been forced to reroute many ships around the Cape of Good Hope in South Africa, resulting in delays of up to three weeks. A spokesperson for the European Automobile Manufacturers’ Association said earlier this week that the longer route “has entailed higher costs and (delivery) delays of around two weeks.” Volvo will halt production at its plant in Belgium next week for three days due to delays caused by the security situation in the Red Sea, a spokesperson told Reuters. Not every automaker has been affected yet, however. Volkswagen, Germany’s biggest carmaker, said Friday that its passenger car division did not anticipate “significant” restrictions to production over the situation in the Red Sea, according to Reuters. Tesla’s decision will amplify fears that a prolonged closure of the Red Sea route — which connects with the vital Suez Canal — will hurt the global economy by snarling supply chains and driving up the prices of goods. And if the Houthis redirect their attacks toward oil tankers and bulk carriers, which transport crucial raw materials such as grain and timber, the economic consequences could be altogether worse. Ikea, Crocs (CROX), and British clothing retailer Next have all warned of delays to their shipments. The Suez Canal accounts for 10-15% of world trade, which includes oil exports, and for 30% of global container shipping volumes. How the Red Sea crisis could clobber the global economy The attacks have also pushed up freight costs. Container transport costs are more than double what they were in early December, according to the Drewry World Container Index. US and British forces upped the stakes Thursday when they struck more than 60 Houthi targets in what President Joe Biden said was a direct response to the threat posed to the “freedom of navigation in one of the world’s most vital waterways.” The price of Brent, the global oil benchmark, was up 3.6% by 7.09 a.m. ET to top $80 a barrel, while West Texas Intermediate crude, the US benchmark, had risen 3.8% to trade near $75 a barrel. The strikes on Iran-backed Houthis raise the specter of a regional conflict that could derail oil supplies from the Middle East. “The chance of dragging multiple oil-producing countries into the conflict is definitely higher today than it was yesterday,” said Robert Yawger, vice-president of energy futures at Mizuho Securities. Matt Egan contributed reporting. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}