{
    "title": "Tesla's own former AI engineer trolls the company: 'full self-wiping'",
    "date": "1/23/2024",
    "url": "https://electrek.co/2024/01/23/tesla-own-former-ai-engineer-trolls-full-self-wiping/",
    "text": "Tesla’s own former head of AI infrastructure, Tim Zaman, is impressed with the latest FSD v12 Full Self-Driving software, but he trolls the company’s AI effort. Up until last year, Tim Zaman was the head of AI infrastructure and platform at Tesla, where he worked on AI products since 2019. He was among the presenters at Tesla’s AI Day in 2022. Zaman was also among the engineers that Elon Musk brought from Tesla to Twitter, now X, to help as the CEO was firing more than half the staff at the social media platform. In 2023, he brought his talents to Google DeepMind. Zaman is active on X and he commented on the recently released FSD Beta v12 update: Full Self Wiping when? He is referencing Tesla’s AI-powered automatic wipers, which had inconsistent performance. Like most premium vehicles today, Tesla has an automatic wiper system that automatically matches the speed of the wipers to the intensity of the rain or snow. However, unlike most other automakers, Tesla doesn’t use a rain sensor for its system. Instead, the automaker is using its Autopilot cameras to feed its computer vision neural net to determine the speed for the wipers. It has been deployed in Tesla vehicles since 2018, but many owners have been complaining that it is not as accurate as other systems using rain sensors. Tesla’s auto wipers often start when there’s no precipitation or their speed don’t match the actual intensity of the precipitation. Over the last few years, CEO Elon Musk has been talking about Tesla improving on the system with the release a new “Deep Rain” neural net. I wonder how many man hours have been spent trying to fix a problem Tesla created by eliminating a cheap IR rain sensor. Tesla could easily add one but it refuses, sort of like adding a camera to the nose of the 3/S/X/Y or radar for cross traffic detection. I strongly suspect if Elon was removed from Tesla tomorrow, within 9 months we would see Tesla add a few things to its vehicles that they currently lack that make them inferior to the rest of the automotive industry. It’s even more annoying now that Tesla forces you to use the wipers in Auto or turn them on manually if you want to use cruise control or any other AP/FSD features. I hope one day Tesla adds back parking sensors, too, as they actually worked reliably while the camera based distance estimates are horrendously inaccurate. I know he is just joking, but he has a point. Tesla’s auto wipers have been subpar compared to systems using rain sensors at best – and completely useless at worst. Personally, I have to shut the auto wipers off every other time, especially in the winter, because they either don’t activate fast enough when the precipitation starts or they go crazy when they don’t have to. If those are powered by neural nets, it’s hard to understand how Tesla can solve this AI problem, but we should believe that it will solve the much bigger software problem of self-driving? Again, I know Zaman is joking here, but it’s still interesting that an AI expert in the know (he was at Tesla as recently as last year) is pointing it out. Even if it’s just to troll. FTC: We use income earning auto affiliate links. More. Subscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast. Tesla is a transportation and energy company. It… Fred is the Editor in Chief and Main Writer at Electrek. You can send tips on Twitter (DMs open) or via email: fred@9to5mac.com Through Zalkon.com, you can check out Fred’s portfolio and get monthly green stock investment ideas. Get interesting investment ideas by Fred Lambert ChargePoint Home WiFi Enabled Electric Vehicle (EV) Charger "
}