{
    "title": "Tesla: May Decline Further, But Thereby Create A Long-Term Opportunity \n(Upgrade)",
    "date": "1/26/2024",
    "url": "https://seekingalpha.com/article/4665267-tesla-may-decline-further-but-thereby-create-a-long-term-opportunity-upgrade",
    "text": "Xiaolu Chu Xiaolu Chu After years of being a permabear on Tesla, Inc. (NASDAQ:TSLA) and repeatedly saying it's not a technology company, I have finally seen the forest for the trees. My most popular article on Seeking Alpha (can be read here) was written on May 6th, 2022, and I discussed why I felt TSLA was overvalued by 85.26%. Many investors called me crazy, while others sent me private messages asking to have a public debate on the topic. At that time, shares of TSLA traded at $295.67 and fell to roughly $112.71 by the end of 2022, which was a decline of -61.88%. Since then, TSLA has been growing on me, and my outlook has gone from bearish to neutral. This is the first time I truly see TSLA as more than an automotive company, and I am seeing the forest for the trees. The day after Q4 earnings was difficult for TSLA bulls, as shares finished down -12.13% after an earnings call that many investors weren't thrilled about, including Dan Ives, who considered it a trainwreck. I can't time bottoms, and shares of TSLA could certainly decline further, but I am seeing a long-term opportunity. Several weeks ago, I started utilizing capital generated from writing covered calls on other positions to purchase shares of TSLA, and I am now buying with fresh capital. Technically, I was always a shareholder because my wife owns TSLA, but now it's official, and this isn't a trade for me. I will follow TSLA as low as it goes to build out a position because, for the first time, I think TSLA has the potential to become the largest company in the S&P 500 (SP500) by 2030. Please keep in mind that I do think TSLA will decline further, and no matter how low TSLA goes, it won't impact me, so don't purchase TSLA just because I am starting to build a position. Seeking Alpha Seeking Alpha I started out being very bearish on TSLA because of the valuation and the fact that 100% of their gross profit was being generated from the automobile business. I didn't feel that it was fair for TSLA to have a larger valuation than tech companies such as Meta Platforms (META), producing tens of billions in additional profits. As shares declined, I became neutral on TSLA as the valuation became more reasonable, and the other lines of business started contributing to the bottom line I discussed in my most recent article (can be read here). While I am still not sold on some aspects of the bull thesis, there are four aspects that have made me turn bullish on TSLA as a long-term position. I fully expect shares to continue selling off, but I can't predict bottoms, so I will be building a position throughout this downturn. In this article, I will discuss why I am now bullish on TSLA as a long-term opportunity. Just to clarify, when I say long term, I am looking forward to 5-10 years. Seeking Alpha Seeking Alpha I want to address the risks first, as there are many risks to my investment thesis. For my investment thesis to materialize, CEO Elon Musk and the team at TSLA need to execute flawlessly. Today, TSLA is still a car company, as the automotive segment accounted for 85.17% of TSLA's 2023 revenue and 90.77% of TSLA's 2023 gross profit. TSLA's margins have been under pressure due to several price reductions throughout 2023, which caused the automotive segment to operate at an 18.85% gross profit margin in Q4 compared to 25.92% in Q1 2023. If TSLA continues to squeeze margins to play the volume game, they risk generating less profitability when they are still expanding their manufacturing footprint. On the earnings call, Mr. Taneja stated that TSLA's volume growth will be lower in 2024 if margins are squeezed further with less forward vehicle sale growth; this could cause TSLA to miss EPS estimates. Tesla Tesla The next risk is breaking into the sub $25,000 market with TSLA's next-generation vehicle. TSLA still sells premium vehicles, and while prices have declined and less expensive models have been introduced, they are still expensive for the average household. If TSLA has issues bringing a sub $25,000 vehicle to market, they will be missing out on a tremendous segment of the auto industry, which could impact their future growth. TSLA is also a victim of macroeconomic factors that are outside of their control. Elon said it on the conference call himself, indicating that if rates don't decline quickly in 2024, it could impact not just margins but the ability of Americans to purchase TSLA vehicles. There is demand for the products, but if the payment doesn't fit into the monthly budget, it is a deterrent because the ability to afford a TSLA isn't there. Rates play a substantial role in the monthly payment, and if rates stay higher for longer, it could impact TSLA's top and bottom-line growth prospects. I know TSLA bulls don't want to hear this, but not every person wants to drive an EV, and not every person wants to drive a TSLA. I am a perfect example, as my wife and I purchased a new vehicle in the spring of 2023, and it wasn't an EV or a TSLA. For better or worse, CEO Musk is a polarizing figure, and some of his comments on X could cause people to purchase a competitor's vehicle out of spite. The other risks are that much of the future bull case, especially the points presented in Ark Invest's research, may not soon materialize. Full Self-Driving (FSD) may not be monetizable in 2024, and even if a full working version is ready to be deployed, you will need government regulation to be passed to utilize it fully. In my opinion, until it becomes legalized, it's not ready for mass-market consumers. I think something many bulls forget is that even if FSD is optimized, it could be years until you can actually turn it on and take a nap. The Robotaxi premise is also further away than many expect, in my opinion. The first hurdle is regulations being passed for FSD; then the 2nd hurdle is people actually opting in. Don't forget federal legislation is just one aspect, as individual states could pass specific laws that prohibit FSD in certain jurisdictions. The final risk to my investment thesis is the valuation. From a numbers perspective, TSLA is expensive compared to the rest of the Magnificent Seven. TSLA generates the least cash from operations out of the Magnificent Seven and the least free cash flow (FCF). TSLA also trades at the largest price to FCF valuation, and the gap could expand after the rest of the group reports earnings over the next two weeks. From a valuation perspective, TSLA has a lot of risk. Steven Fiorillo, Seeking Alpha Steven Fiorillo, Seeking Alpha I know that so far, I still sound like a permabear, but quite frankly, the risks are real. I know that I can't time the bottom, and I know that there are many risks that could cause shares of TSLA to decline further before shareholders see better days. I prefer to go into every investment with my eyes wide open, and right now, the opportunity cost outweighs the investment thesis risks for me. I won't lose sleep if my investment declines in value because I want to buy additional shares at lower prices. The three largest companies in the S&P are Apple (AAPL), Microsoft (MSFT), and Alphabet (GOOGL). For TSLA to overtake GOOGL as the third largest company, its market cap would need to increase by $1.34 billion or by 233.84%. GOOGL has generated $297.13 billion in revenue, $166.76 billion in gross profit, and $66.73 billion in net income over the trailing twelve months (TTM) compared to TSLA, generating $96.77 billion in revenue, $17.66 billion in gross profit, and $15 billion in net income for their 2023 fiscal year. In my opinion, TSLA would need to generate around GOOGL's current levels of profitability to be valued in the $2 trillion neighborhood. I think TSLA can get there and surpass these numbers, but it's not going to be overnight, and it could take 5-10 years to accomplish this. My bull case revolves around four aspects, Optimus Bot, FSD, Ride hailing, and the sub $25,000 vehicle. Starting with Optimus, there are roughly 142 million homes in the United States, 84.37 million white-collar jobs, and 63.6 million blue-collar jobs. I agree with Elon that the Bot could be the biggest product and larger than the car business at TSLA. Over the next decade, I believe that the Bot will be able to replace a significant number of blue- and white-collar jobs, and it will be a race to purchase them. I'll use FedEx (FDX) and United Parcel Service (UPS) as examples. By implementing the Bot for loading and unloading trucks and trailers at the warehouse, they can mitigate workman's comp claims, which could correlate to lowered insurance premiums in the future. They would also need less staff and lower their payroll expenses. Depending on how long Optimus can run, it could replace 2 shifts per day, maybe more depending on charging or how it replenishes energy. Now, extrapolate this to Amazon (AMZN), Walmart (WMT), Target (TGT) and every other company. Outside of manual labor tasks, artificial intelligence could get to a place where it replaces white-collar jobs over the next decade. When you combine AI with the Bot, the Bot could potentially work a back-office service position for 16+ hours per day. Outside of work, there is a commercial use in the household. Humans love efficiency and reducing the amount of time spent on remedial tasks. I believe that if the Bot can do laundry, clean the kitchen and bathroom, and cut the lawn, it will see mass adoption. It won't occur tomorrow, but for $350 per month, I could see penetration into the household market occurring. I don't believe that the Bot will be a one-time purchase, and there will be a monthly recurring charge when the Bot is hooked into the TSLA network, and it is constantly updating and learning from each task that every other Bot is performing. If the Bot is $22,000 and the learning plan is $39.99 per month, at a 10% penetration rate across white-collar jobs, blue-collar jobs, and households, the Bot would generate $638.75 billion in sales and $1.16 billion in monthly reoccurring revenue. Eventually, I could see a 10% penetration occurring and maybe a higher percentage. If TSLA can get a 17% penetration, they will generate over $1 trillion in Bot sales and $1.97 billion in monthly reoccurring revenue at $39.99 per month. If they achieve between 10-17% penetration across these markets, they could generate between $13.93 billion and $23.69 billion in annual revenue from a learning plan. Keep in mind that this is just looking at the U.S. and that this can be extrapolated with as the Bot is introduced to other markets, such as Mexico, China, and India. The possibilities are limitless, and I do think that the Bot business will be bigger than the automobile business in the future. Steven Fiorillo Steven Fiorillo The next business segments I am bullish on are FSD, the $25k car, and ride-hailing. In 2023, there were roughly 1.19 million EVs sold in the U.S. I am looking at FSD as a direct-to-consumer play through TSLA direct, and a licensing play. TSLA can be the brain powering its competitors' vehicles, making them significantly more valuable. It's inevitable that we get to a point where autonomous driving is a reality. If TSLA could work out a licensing agreement with Volkswagen (OTCPK:VWAGY) (OTCPK:VLKAF) (OTCPK:VWAPY), Ford (F), and General Motors (GM), it could mean billions or tens of billions in reoccurring revenue on an annual basis. TSLA is further ahead of everyone else, so it would make sense for these companies to work out a licensing agreement for any EV that wants to opt into the TSLA FSD network. I think as FSD matures and actually comes to market, we will see more talk about this. As far as the Robotaxis, I don't agree that the true value will be from individuals opting into a Robotaxi network while they aren't using their vehicle. I have always said the two things that will get me to purchase a TSLA are when I can either charge it in 2 minutes or take a nap while it drives me around. What I will not be doing is allowing anyone else to ride around in my TSLA, and I bet there are others who feel the same way. I think that the $25k car has two purposes. The first is to break into the mass consumer market and break away from being a luxury brand. The second is for TSLA to build a full Robotaxi fleet and rival Uber Technologies (UBER). UBER generated $35.95 billion in revenue and $11.65 billion in gross profit in the TTM. I think that TSLA will repurpose some of its engineering team to build a ridesharing network to rival Uber. They already have the in-house team to build it with the FSD network, so there will not be added expenses. The other aspect is that TSLA can set aside a percentage of their produced sub $25k vehicles for this business at cost. Seeking Alpha Seeking Alpha Currently, there are 31 analysts expecting $4.75 of EPS in 2025, and 12 analysts expecting $5.65 of EPS in 2026. TSLA is trading at 43.77 times 2025 earnings and 36.81 times 2026 earnings. There are 3 analysts calling for 10.41 of EPS in 2030, which places TSLA at 19.97 times 2030 earnings. In the next 7 years, there could be so many advances from FSD to the Bot that $10.41 of EPS may be drastically low. There are also other catalysts, including the charging network and energy business, but to be honest, I am less convinced that these will be as big as the other areas I outlined. This is the first time I have truly seen TSLA as more than an automotive company. Right now, I am not excited about the energy business as it only accounts for 5.88% of TSLA's 2023 gross profit. TSLA has demonstrated that it can scale its manufacturing capacity at an extraordinary pace while substantially increasing its throughput. The narrative isn't great in the current environment, and shares of TSLA could easily be retraced to the $ 150s or lower. I can't predict bottoms, so I am building out a position as shares fall. This is a stock that I now want to hold for the long term because, over the next decade, I believe the combination of its automotive business, the Bit, FSD, and a ride-hailing company could make it the most valuable company in the market. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSLA, AAPL, AMZN, GOOGL, META either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Disclaimer: I am not an investment advisor or professional. This article is my own personal opinion and is not meant to be a recommendation of the purchase or sale of stock. The investments and strategies discussed within this article are solely my personal opinions and commentary on the subject. This article has been written for research and educational purposes only. Anything written in this article does not take into account the reader’s particular investment objectives, financial situation, needs, or personal circumstances and is not intended to be specific to you. Investors should conduct their own research before investing to see if the companies discussed in this article fit into their portfolio parameters. Just because something may be an enticing investment for myself or someone else, it may not be the correct investment for you. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}