{
    "title": "Tesla Q4 earnings key for EV maker's 2025, 2026 outlook",
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/video/tesla-q4-earnings-key-ev-162751928.html",
    "text": "With the fourth-quarter earnings season well underway, all eyes are on the EV market with Tesla (TSLA) set to report earnings on January 24. How will this earnings report set the tone for the EV market and overall electric vehicle demand in 2024 as even Tesla faces various production challenges? Canaccord Genuity Managing Director George Gianarikas joins Yahoo Finance Live to weigh in on what investors should consider ahead of Tesla’s earnings report. “Last year, Tesla... had an issue with margins,\" Gianarikas states, citing price cuts as a core factor. Gianarikas insists “it’s a really, really important [earnings] call\" for determining Tesla's future earnings as far out as 2025 and 2026. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim SEANA SMITH: Thanks so much for joining us. So, George, let's talk a little bit about what we could likely hear from Tesla, lots of focus on EV demand, the fact that that is slowing. Are some of those fears a bit overblown? GEORGE GIANARIKAS: It could be. So first, thanks for having me on. Look, last year, Tesla, as you alluded to in your previous segment, had an issue with margins, and that's because they cut prices several times throughout the year, actually, starting in late '22, to combat what we think was just an impact on demand from an increase in interest rates. So they cut prices basically to keep that monthly payment the same because most people who buy cars have a monthly payment and don't pay cash up front. So what we saw for Tesla was an impact to margins. Gross margins, which they promised were probably going to have a line in the sand in the first quarter of '23, kept going down throughout the year. So when we look at what the company will talk about for 2024, it's a really, really important call because for us, it means two things. First, what's Tesla's path to earnings in '24, '25, and '26? And next year or this year, I should say, we'll probably see a slight increase in earnings, depending on what they say about margins and units. And the second thing is to combat this narrative that's been really accelerating over the last several months that EV demand is terrible. People don't want EVs anymore. We think it's a symptom of a few things most likely that don't have anything to do necessarily with the EVs. EVs just happen to be higher in price. And so when interest rates go up, and they impact the price of that monthly payment, you're probably going to see an impact to the higher-priced vehicles, which in general are EVs. And by the way, a lot of the EV offerings in the market today stink. They're not as good as Tesla's or Rivian's, for example. They don't hold water to what those two companies are bringing to the market. Related Quotes "
}