{
    "title": null,
    "date": "1/2/2024",
    "url": "https://www.deccanherald.com/opinion/its-not-tesla-in-byds-sights-its-the-whole-car-industry-2833650",
    "text": "Follow Us By David Fickling It may be just one-tenth the size of Tesla Inc. in terms of market capitalization, but BYD Co has just pulled ahead to become the world’s biggest producer of battery passenger cars. For its next trick, it’s going to take on the world. To many, BYD still remains a little-known car brand, more familiar from business-news articles citing Warren Buffett’s 2008 investment in the Chinese EV maker than sightings of actual vehicles out on the road. And yet the vast volume of its sales in China, combined with a growing number overseas, means it overtook its American rival in the December quarter. The 526,409 delivered over the period pipped Tesla’s 484,507. This milestone if anything underplays BYD’s growing might. Throw in trucks, buses and plug-in hybrids that use gasoline engines to extend their largely battery-powered range, and BYD’s sales total is 75 per cent higher than the number for pure battery cars, at 918,807. More importantly, on almost every financial metric, the Chinese company is either advancing on, or overtaking its American rival — with its gaze already set on the wider car industry. While many competitors have struggled amid the wave of discounting that’s hit the EV sector over the past year, BYD has prospered. In contrast to Tesla, which racked up years of losses before turning profitable in 2019, it has hardly ever posted negative operating income — and in the September quarter came within a whisker of the reinvigorated US company’s $1.76 billion result. By owning its own battery supply-chain and focusing on cheaper, less zippy cells that use abundant iron and phosphate instead of scarce cobalt and nickel, it’s managed to lift margins even as materials costs rose. That translates into industry-beating financial performance. Most Chinese car companies post uninspiring single-digit returns on equity, giving shareholders little reason to prefer their stock to investment-grade corporate bonds that yield 5.8 per cent. BYD, on the other hand, is spitting out profits that have led to the best returns on equity among major automakers worldwide. Returns on invested capital, a metric that encompasses how successful the company is at generating profits from its asset base, are also the best among volume automakers worldwide, and have risen consistently for the past 18 months to overtake Tesla. You might expect this performance would induce the sort of shareholder euphoria that has caused Elon Musk’s company to be valued at a 64-times forward price-earnings ratio. Far from it: While BYD’s 13.5 ratio is a premium to the 7.95-times P/E ratio on the Hang Seng Index, it’s priced at a discount to India’s Tata Motors Ltd. and the 19.7-times multiple of the S&P 500, and not far above mainstream automakers such as Toyota Motor Corp. and Ford Motor Co. After a $12 billion selloff during November, BYD is as cheap as it has been going back to the start of 2010, despite 31 out of 32 analysts putting a Buy rating on the stock. The most substantive argument against BYD right now is that it has grown too far, too fast. Despite overtaking Honda Motor Corp, Toyota and Volkswagen AG to snatch the crown as China’s best-selling car marque over the past few years, its vehicles aren’t exactly rushing off dealership lots: There were 1.91 cars sitting in inventory for every one that was sold in November, a number that’s grown from 1.04 a year earlier even as prices have fallen about 6.2 per cent. This is high even by the standards of a Chinese industry that’s plagued with oversupply, and suggests flagging consumer appetite for vehicles that most reviewers seem to find more stolid than compelling. That’s a small negative when placed against the wealth of positive metrics BYD can now boast — and if you think boring cars don’t have a future, it’s worth remembering that the best-selling four-wheeler in history is the Toyota Corolla, or that this entire industry was kicked off by a vehicle that, famously, was usually only available in black. BYD is already settings its horizons well beyond China, with one in 10 of its cars sold overseas during December, compared to one in 40 in July 2022. The EV maker announced a new assembly factory last month in Hungary, and others are reportedly under consideration in Mexico. Such investments would mirror Japanese and South Korean carmakers, who got around protectionist tariffs since the 1980s by building production lines in key destination markets. If its current trajectory is anything to go by, BYD’s relatively little-known status outside China is about to change drastically. In years to come, we’ll look back on 2024 as the year it joined the ranks of Tesla, Hyundai Motor Co., Toyota, Volkswagen and Ford as formerly obscure car brands that went on to bestride the world. "
}