{
    "title": "Netflix, Tesla, Intel shares on the move this week following mixed earnings \nreports",
    "date": "1/27/2024",
    "url": "https://www.proactiveinvestors.com.au/companies/news/1039503/netflix-tesla-intel-shares-on-the-move-this-week-following-mixed-earnings-reports-1039503.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Emily began her career as a political journalist for Australian Community Media in Hobart, Tasmania. After she relocated to Toronto, Canada, she reported on business, legal, and scientific developments in the emerging psychedelics sector before joining Proactive in 2022. She brings a strong journalism background with her work featured in newspapers, magazines, and digital publications across Australia, Europe, and North America, including The Examiner, The Advocate, The Canberra Times, and... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 07:02 27 Jan 2024 AEDT Earnings season ramped up this week with the release of highly anticipated reports from Netflix Inc (NASDAQ:NFLX), Tesla Inc (NASDAQ:TSLA) and Intel Corp (NASDAQ:INTC, ETR:INL), among others. Netflix shares have gained 18.8% week-over-week after the streaming giant reported the addition of 13.1 million new subscribers in the fourth quarter and issued bullish guidance. Tesla, on the other, has seen its share price tumble 13.8% this week as the electric vehicle maker projected a slowdown in production. Intel’s shares also fell more than 12% on Friday on weaker-than-expected guidance despite its fourth quarter earnings coming in ahead of estimates. Catch up on this week’s biggest earnings reports: Levi Strauss & Co has unveiled plans to cut jobs in its corporate division after reporting a fall in net income during 2023. Between 10% and 15% of the denim giant’s global corporate workforce will be cut under the move, which will aim to reduce costs and simplify organisation across the business. Intel Corp (NASDAQ:INTC, ETR:INL) shares plunged after Thursday’s closing bell as the PC maker issued weaker-than-expected guidance for the first quarter. For 1Q, Intel expects adjusted earnings per share (EPS) of $0.13 on revenue in the range of $12.2 billion to $13.2 billion, below Wall Street estimates of EPS of $0.35 on revenue of $14.3 billion, according to Zacks Consensus Estimate. Comcast Corporation (NASDAQ:CMCSA, ETR:CTP2) on Thursday reported estimate-topping fourth quarter and full year financial results sending its shares more than 4% higher. The telecommunications and media conglomerate reported 4Q revenue of $31.25 billion, ahead of estimates of $30.41 billion. Alaska Air Group (NYSE:ALK) expects its profits to take a $150 million hit from the grounding of Boeing Co (NYSE:BA, ETR:BCO)'s 737 Max 9 aircraft which was taken out of service after a January 5 incident which blew a hole in the side of an Alaska Airlines plane. The two-week grounding significantly impacted the airline which has 65 of these jets in its fleet. The Federal Aviation Administration (FAA) ruled on Thursday the planes could re-enter service. American Airlines Group Inc (NASDAQ:AAL, ETR:A1G) said it is projecting a 2024 profit that surpasses Wall Street expectations, benefiting from robust demand for international travel. The Texas-based carrier forecasts full-year adjusted earnings per diluted share between $2.25 and $3.25, exceeding Bloomberg consensus estimates of $2.22. Data storage company Seagate Technology PLC (NASDAQ:STX) disclosed a year-on-year decline in revenues but a marked gross margin improvement in today’s second-quarter trading update. Top-line sales for the quarter totalled $1.56 billion, down 17% from last year’s second quarter, but operational efficiencies propelled gross margins up from 13% to 23.3%. Humana (NYSE:HUM) shares tumbled more than 10% in early trade as the Kentucky-based health insurance firm warned its 2024 profits are expected to be impacted by higher costs associated with its Medicare Advantage offering. The company guided adjusted earnings per share (EPS) guidance of approximately $16, assuming higher Medicare Advantage costs experienced during the fourth quarter will persist throughout this year. International Business Machines Corp (NYSE:IBM) shares moved more than 5% higher in afterhours trade after the hardware and software provider reported better-than-expected fourth quarter results and estimate-topping full-year revenue guidance. For 4Q, the company reported a 4% year-over-year increase in revenue to $17.4 billion, ahead of estimates of $17.29 billion. Tesla Inc (NASDAQ:TSLA) reported 4Q financial results that fell short of expectations, causing concern among investors and highlighting challenges in the electric vehicle (EV) market. Tesla's sales figures indicate that demand for its vehicles is slowing more than anticipated, amidst increased competition from both traditional automakers and Chinese EV companies. SAP’s US-listed shares gained more than 7% on Wednesday morning after the German-headquartered software company unveiled a restructuring plan that would impact 8,000 jobs along with the release of its fourth quarter and full-year 2023 earnings. The company said the planned transformation program reflects the company’s focus on the scalability of its operations and its Business AI offering. Kimberly-Clark Corporation hit the top end of its internal guidance in 2023, with net sales of $20.4 billion resulting in 5% year-on-year organic growth on a 34.4% gross margin for the maker of Kleenex and Huggies products. However, a substantial foreign exchange impact and the exit of its tissue and K-C Professional business in Brazil resulted in 1% actual growth, though this was also within internal guidance. Texas Instruments Inc (NYSE:TXN) stock was on the backfoot in Wednesday’s early premarket trade, down 3.64% at $168, after the semiconductor firm gave a disappointing revenue and earnings outlook. Revenue dropped to $4.08 billion for the fourth quarter, down 13% from the same period last year, and was broadly in line with expectations. Netflix Inc (NASDAQ:NFLX) shares are heading for a near-9% gain on Wednesday after the video streamer’s fourth-quarter growth in subscribers and revenues exceeded expectations, with a bullish outlook for 2024. Revenue of $8.83 billion topped Wall Street analyst expectations of $8.72 billion. This year-over-year growth of 13.2% was attributed to Netflix’s paid-sharing model, recent price changes, and its strong content slate. United Airlines Holdings Inc (NASDAQ:UAL) shares traded more than 6% higher as the airline’s warning that its losses this quarter will be greater than expected due to the latest grounding of Boeing jets was outweighed by investor optimism over the company’s prospects for the remainder of the year. The airline said that due to the Boeing problems, it now expects a loss in the range of $0.35 to $0.85 per share in its first quarter of 2024, assuming its MAX 9 planes are grounded until the end of January. 3M Co (NYSE:MMM) shares are set to open at a six-week low on Tuesday following the release of a 2024 profit outlook that fell well below forecasts. The disappointing outlook for the consumer goods manufacturer overshadowed fourth-quarter results that surpassed expectations. RTX (NYSE:RTX) shares moved higher in pre-market trade Tuesday after the aerospace and defence firm reported better-than-expected fourth-quarter results. The company, formerly known as Raytheon Technologies, reported a 10% jump in its 4Q revenue to $19.9 billion, above Wall Street estimates of $19.8 billion. The industry challenges faced by Verizon Communications Inc. (NYSE:VZ) were on display in today’s full-year 2023 results presentation. The company's total operating revenue for the fourth quarter was reported at $35.1 billion, marking a 0.3% decrease year-over-year, while full-year revenue saw a sharper decline of 2.1%, totaling $134 billion. Lockheed Martin (NYSE:LMT) Corp on Tuesday reported improved fourth-quarter earnings on sales that were little changed, and forecast further top-line growth in 2024. The defence manufacturer said sales in the three months to December 31, 2023, were $18.9 billion, compared to $19.0 billion in the fourth quarter of 2022. Procter & Gamble (NYSE:PG) (P&G) on Tuesday raised its estimate for core earnings for the year after reporting a modest increase in sales, although second-quarter earnings were hit by an impairment charge for Gillette. The owner of Olay, Pampers and Gillette said revenue in the three months to December 31, 2023 - its financial second quarter - rose 3% to $21.4 billion, with organic sales growth totaling 4%. Sign up to receive alerts and news direct to your inbox RooLife Group Ltd CEO Bryan Carr sits down with Jonathan Jackson in the Proactive studio to discuss the digital marketing and e-commerce platform and how it facilitates the connection between brands and consumers, primarily focusing on leveraging technology to penetrate new markets effectively.... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive Australia PTY LTD ACN:132787654 ABN:19132787654. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}