{
    "title": "Tesla dominates in California but EV growth is the true winner",
    "date": "1/30/2024",
    "url": "https://www.teslarati.com/tesla-dominates-california-ev-growth-true-winner/",
    "text": "Tesla dominated electric vehicle registrations in California in 2023, but the growth of EVs as a whole turned out to be the true winner in the state as adoption saw a 5 percent uptick. Tesla saw a 24.6 percent increase in registrations in 2023 compared to 2022, and it held a 60.5 percent market share in California last year. This is a 10.5 percent reduction compared to the 71 percent it held in 2022. The domination of Tesla in California still continues to be a story on its own, but the bigger picture, which is EV adoption as a whole, is encouraging despite what some fans of the EV maker might see. Although Tesla backtracked over 10 percent in terms of market share, we can see that the company’s macro picture is more than encouraging. Many tend to forget the company’s mission, which is to accelerate the adoption of sustainable energy and transportation. Tesla is doing it and leading the charge, still holding a majority of the market share, while others are growing. BMW saw the biggest year-over-year market share increase in California, with 2.2 percent. It sold 14,585 EVs in California last year. Ford, Chevrolet, Hyundai, Mercedes-Benz, and Volkswagen also had encouraging figures. Credit: CNCDA Credit: CNCDA California’s best-selling EVs were the Tesla Model Y and Tesla Model 3, which accounted for 215,422 of the 380,891 registrations for the year. The Model Y was the best-selling vehicle globally, according to Tesla, and it dominated every other EV model in California last year. Tesla says Model Y has achieved unthinkable ‘best seller’ label in just four years  However, the Chevrolet Bolt was third-best, selling 19,041. This affordable and accessible EV has been a mainstay on best-selling lists, but GM plans to phase it out. Tesla is leading the charge in EVs, and it is likely we will continue to see its market share in the state decrease every year as new competitors and models hit the market. This is not a bad thing. Instead, Tesla fans should see it as proof that its overall influence on the automotive market is working. The more EVs sold, the better it is, and that’s the stance Tesla has always taken. After all, Tesla still grew its year-over-year registrations by nearly 25 percent, and that’s something to be incredibly proud of. I’d love to hear from you! If you have any comments, concerns, or questions, please email me at joey@teslarati.com. You can also reach me on Twitter @KlenderJoey, or if you have news tips, you can email us at tips@teslarati.com. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... Tesla Summon and Autopark are set to gain major improvements next month, according to... Tesla appears to be ready to roll out wireless EV charging, according to the... Hertz CEO Stephen Scherr has decided to step down following the rental firm’s big... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Copyright © TESLARATI. All rights reserved. "
}