{
    "title": "Elon Musk says he wants 25% of Tesla stock for AI development",
    "date": "1/16/2024",
    "url": "https://www.upi.com/Top_News/US/2024/01/16/elon-musk-AI-Tesla-25-stock/1751705407362/",
    "text": "Jan. 16 (UPI) -- Tesla founder Elon Musk went public with his desire to own 25% of the electric vehicles' shares to grow its artificial intelligence and robotics sector.\nMusk, who is already the company's largest shareholder with a 13% stake, said in comments on X Monday that he would grow the products outside of the company if he is unable to secure the larger share.\nAdvertisement\n\"I am uncomfortable growing Tesla to be a leader in AI and robotics with having 25% voting control,\" Musk said on X. \"Enough to be influential but not so much that I can't be overturned. Unless that is the case, I would prefer to build products outside of Telsa.\"\nMusk went on to say that Tesla is more than an electric vehicle company and its focus should be diversification.\nRelated\nTesla to halt German production for two weeks due to Red Sea delays\nSamsung unveils updated roving, AI-powered companion robot at CES\nTesla recalls 1.6 million vehicles in China for automatic steering issue\n\"You don't seem to understand that Tesla is not one startup, but a dozen,\" Musk said. \"Simply look at the delta between what Tesla does and GM. As far as stock ownership itself being enough motivation, fidelity, and other similar stakes to me, why don't they show up for work?\"\nIn his post Monday, Musk also said Tesla's board is \"great\" and added the company was holding back on introducing a new compensation plan as a 2018 lawsuit by shareholder Richard Tornetta, alleging that a previous package that granted him billions of dollars in stock had yet to be resolved.\nAdvertisement\nHe added, however, that his effort to secure 25% of Tesla stock was \"primarily about ensuring the right amount of voting influence\" at the company.\n\"If I have 25%, it means I am influential but can be overridden if twice as many shareholders vote against me versus for me,\" he said.\nMusk currently holds about 411 million shares of Tesla which has 3.19 billion in common stock outstanding, according to third quarter financial filings.\nHe previously had a greater share in the company, but dumped nearly 95 million shares of stock worth about $22.93 billion in 2022, largely to facilitate his purchase of X, the social media company then known as Twitter.\nAt the time, Musk had predicted, that Tesla's work in AI and robotics would become more valuable to the country than its electric car and automated driving divisions and he late last year described Tesla as \"an AI/robotics company\" in a post on X.\nThe company has already spent billions in AI initiatives. Tesla has pumped a significant amount of money into the humanoid prototype robot Optimus and spent more than $1 billion on the self-driving system supercomputer Dojo.\nLast November, Musk testified in a trial over his compensation package from Tesla in Delaware. A shareholder sued Musk and Tesla, charging that the Tesla board breached its fiduciary duty, calling Musk's pay as CEO excessive.\nAdvertisement\n\n\n\nTopics\nBusinessElon MuskTESLA Motors\n\n\n\n\n\n\nLatest Headlines\n\n\n\n\n\n\n\nU.S. News // 18 minutes ago\nKrispy Kreme to partner with McDonald's\n March 26 (UPI) -- Krispy Kreme announced it would partner with McDonald's to sell their fresh doughnuts daily.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 5 hours ago\nRescuers searching for at least 7 people in Baltimore bridge collapse\n March 26 (UPI) -- A large cargo ship struck a major transportation bridge that spanned Baltimore's Patapsco River early Tuesday, causing the structure to collapse, officials and authorities said.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 1 hour ago\nUnited Airlines adds larger overhead bins to SkyWest flights\n March 26 (UPI) -- United Airlines announced on Tuesday it would be making adjustments on 50 of its Skywest- operated Embraer E175 craft by expanding the plane's overhead storage space.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 6 hours ago\nU.S. blacklists Russian companies aiding sanctions evasion through digital assets\n March 26 (UPI) -- U.S. sanctions 15 companies and individuals for being behind blockchain-based services operating in Russia's financial sector that enable the evasion of sanctions imposed upon the country over its war in Ukraine.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 2 hours ago\nU.S. Supreme Court takes up Texas case challenging abortion pill access\n March 26 (UPI) -- The U.S. Supreme Court will consider a ruling from an Amarillo federal judge who revoked FDA approval of the abortion drug mifepristone. It's the first major abortion-related case since the overturning of Roe vs. Wade.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 3 hours ago\nPowerball jackpot rises to $856 million after no winner in Monday's drawing\n March 26 (UPI) -- The Powerball jackpot rose to $856 million for Wednesday night's drawing after no winner claimed the top prize on Monday, while Mega Millions will be offering $1.1 billion on Tuesday.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 9 hours ago\nFederal prosecutors warn against threatening election workers\n March 26 (UPI) -- As the Untied States continues its march toward November's presidential election, federal prosecutors are warning the public that threats made against election officials will be prosecuted to the full extent of the law.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 12 hours ago\nNearly $2 billion up for grabs in Powerball, Mega Millions drawings\n March 25 (UPI) -- Powerball and Mega Millions jackpots are reaching new heights as they combine to a total of nearly $2 billion this week. Monday's Powerball drawing is worth $800 million. Tuesday's Mega Millions is worth $1.1 billion.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 21 hours ago\nVP Harris meets Guatemala President Arévalo to discuss core migration issues\n March 25 (UPI) -- Vice President Kamala Harris announced a series of commitments Monday, aimed at addressing the root causes of irregular migration from Guatemala, as she met with the country's newly sworn-in President Bernardo Arévalo.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 15 hours ago\nProsecutors drop charges against N.Y. nurse accused of mishandling newborn\n March 25 (UPI) -- Child endangerment charges filed last year against a nurse accused of mishandling a newborn infant at a Long Island, N.Y., hospital were dropped Monday, her lawyer announced. Jan. 16 (UPI) -- Tesla founder Elon Musk went public with his desire to own 25% of the electric vehicles' shares to grow its artificial intelligence and robotics sector. Musk, who is already the company's largest shareholder with a 13% stake, said in comments on X Monday that he would grow the products outside of the company if he is unable to secure the larger share.\nAdvertisement \"I am uncomfortable growing Tesla to be a leader in AI and robotics with having 25% voting control,\" Musk said on X. \"Enough to be influential but not so much that I can't be overturned. Unless that is the case, I would prefer to build products outside of Telsa.\" Musk went on to say that Tesla is more than an electric vehicle company and its focus should be diversification.\nRelated\nTesla to halt German production for two weeks due to Red Sea delays\nSamsung unveils updated roving, AI-powered companion robot at CES\nTesla recalls 1.6 million vehicles in China for automatic steering issue \"You don't seem to understand that Tesla is not one startup, but a dozen,\" Musk said. \"Simply look at the delta between what Tesla does and GM. As far as stock ownership itself being enough motivation, fidelity, and other similar stakes to me, why don't they show up for work?\" In his post Monday, Musk also said Tesla's board is \"great\" and added the company was holding back on introducing a new compensation plan as a 2018 lawsuit by shareholder Richard Tornetta, alleging that a previous package that granted him billions of dollars in stock had yet to be resolved.\nAdvertisement He added, however, that his effort to secure 25% of Tesla stock was \"primarily about ensuring the right amount of voting influence\" at the company. \"If I have 25%, it means I am influential but can be overridden if twice as many shareholders vote against me versus for me,\" he said. Musk currently holds about 411 million shares of Tesla which has 3.19 billion in common stock outstanding, according to third quarter financial filings. He previously had a greater share in the company, but dumped nearly 95 million shares of stock worth about $22.93 billion in 2022, largely to facilitate his purchase of X, the social media company then known as Twitter. At the time, Musk had predicted, that Tesla's work in AI and robotics would become more valuable to the country than its electric car and automated driving divisions and he late last year described Tesla as \"an AI/robotics company\" in a post on X. The company has already spent billions in AI initiatives. Tesla has pumped a significant amount of money into the humanoid prototype robot Optimus and spent more than $1 billion on the self-driving system supercomputer Dojo. Last November, Musk testified in a trial over his compensation package from Tesla in Delaware. A shareholder sued Musk and Tesla, charging that the Tesla board breached its fiduciary duty, calling Musk's pay as CEO excessive.\nAdvertisement "
}