{
    "title": "Tesla Explores Entry into India's Rooftop Solar Panel Market",
    "date": "2/15/2024",
    "url": "https://timesnext.com/tesla-explores-entry-indias-rooftop-solar-panel-market/",
    "text": "Tesla explores entry into India's rooftop solar panel market, aligning with government initiatives and signaling a broader commitment to renewable energy solutions. As Tesla gears up for its anticipated entry into India's electric mobility sector, the Elon Musk-led company is now eyeing a presence in the country's rooftop solar panel manufacturing market.  Tesla has reportedly approached the Indian government with plans to establish rooftop solar panel manufacturing facilities in the country, seeking subsidies to support the endeavor. The company intends to collaborate with a local partner for setting up the plant while leveraging its technology and sales expertise.  This move aligns with the Indian government's initiatives to promote solar energy adoption, particularly through schemes like PM Surya Ghar: Muft Bijli Yojana, aiming to provide free electricity to 1 Cr households by investing INR 75,000 Cr.  Elon Musk's vision for India extends beyond solar panels. In advanced discussions with the government, Tesla aims to establish a battery manufacturing plant and commence car manufacturing operations in the country. The company is reportedly poised to invest nearly $30 Bn over the next five years, with a significant portion earmarked for a car manufacturing unit and the battery ecosystem.  Negotiations for Tesla's first manufacturing unit in Gujarat are in the final stages, signaling progress towards the company's expansion into India's automotive market.  In addition to its automotive endeavors, Musk's Starlink project is set to debut in India, pending regulatory approval. Following scrutiny regarding shareholding patterns, the Department for Promotion of Industry & Internal Trade (DPIIT) has sought clarification from Tesla, indicating a step forward in the approval process.  Tesla's potential foray into India's rooftop solar panel market underscores its commitment to renewable energy solutions, aligning with global efforts to combat climate change. "
}