{
    "title": "Nvidia overtakes Tesla as Wall Street's most traded stock",
    "date": "2/22/2024",
    "url": "https://cionews.co.in/nvidia-overtakes-tesla/",
    "text": " Chipmaker Nvidia (NVDA.O) has surpassed Tesla (TSLA.O) and opened a new tab as Wall Street’s most traded stock by value, adding to its prominence after becoming the third-most valued U.S. firm and demonstrating how important AI-related bets have become for investors. Nvidia’s large presence in day-to-day stock trading may make investors more vulnerable if the chipmaker’s revenue growth fails to match investors’ lofty expectations, punctuating a Wall Street surge powered by optimism about artificial intelligence. The Santa Clara, California, chipmaker’s quarterly report, due late Wednesday, will be one of Wall Street’s most closely anticipated events. Some strategists predict that anything less than a blowout report might derail a surge that has put Nvidia’s stock up 40% by 2024. Nvidia’s shares fell roughly 5% on Tuesday, suggesting market concerns ahead of the release. Over the last 30 sessions, around $30 billion worth of Nvidia shares changed hands per day on average, surpassing Elon Musk’s electric vehicle maker, which averaged $22 billion. Tesla has dominated daily U.S. stock trading since 2020, according to LSEG statistics, with turnover—a stock’s share price multiplied by the number of shares exchanged—exceeding $35 billion numerous times in recent years. On Tuesday, combined trading in Nvidia and Super Micro Computer (SMCI.O), another company benefiting from the AI boom, accounted for 46% of all turnover of the ten most traded U.S. stocks, including Tesla, Meta Platforms (META.O), Apple (AAPL.O), Amazon (AMZN.O), and Microsoft (MSFT.O). “There’s an argument here that this is the dawn of a new era of trading, like the dawn of the internet, with Nvidia in the pole position,” said Dennis Dick, a financial analyst. However, Dick cautioned that the strong turnover in AI-related equities shows that individual investors and algorithmic traders are driving share prices higher primarily on momentum rather than fundamentals, such as expectations for future revenue growth. Super Micro, which provides AI-related server components to Nvidia, has nearly tripled its worth to $43 billion so far in 2024. It slid nearly 5% on Tuesday, following a 20% drop from record highs on Friday, after Wells Fargo began covering the stock with an equal weight recommendation, stating that its value already discounts “solid upside.”. Nvidia controls over 80% of the high-end AI chip industry, and last week its market value surpassed Amazon’s and Alphabet’s, making it Wall Street’s third-most valuable business, after only Microsoft and Apple. Following Tuesday’s selloff in Nvidia shares, Alphabet and Amazon’s stock market valuations both retreated ahead of the chipmaker. Nvidia’s stock market value last year stood at $1.7 trillion, up from $540 billion the previous year. Meanwhile, Tesla’s stock has fallen 23% in 2024 as it battles low demand for its electric vehicles and increased competition. Also read: As a technology leader, I cultivated the knack of understanding one step above the others so that I can handle them, says Dr. Chandran Raghuraman, CTO at Bahwan Cybertek Do Follow: CIO News LinkedIn Account | CIO News Facebook | CIO News Youtube | CIO News Twitter About us: CIO News, a proprietary of Mercadeo, produces award-winning content and resources for IT leaders across any industry through print articles and recorded video interviews on topics in the technology sector such as Digital Transformation, Artificial Intelligence (AI), Machine Learning (ML), Cloud, Robotics, Cyber-security, Data, Analytics, SOC, SASE, among other technology topics. Log in to leave a comment CIO News produces award-winning content and resources for IT leaders, it provides business technology executives with an overview and insight into developments in information technology and an understanding of the role IT plays in achieving business objectives. Contact us: [email protected] © CIO News by Mercadeo "
}