{
    "title": "Tesla Investor Questions Rationale Of EV Maker Building Up Cash At 'Stupid \nRate,' Suggests This 'Sensible",
    "date": "2/18/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37196203/tesla-investor-questions-rationale-of-ev-maker-building-up-cash-at-stupid-rate-sugg",
    "text": "Tesla, Inc. TSLA shares have shown no signs of taking off, with the electric vehicle giant’s faltering fundamentals not helping matters any further. On Friday, a Tesla investor weighed on a strategy that could support the sagging stock. What Happened:  Future Fund’s Gary Black slammed Tesla for the huge cash hoard the company has built up. “With $TSLA again building up cash at a stupid rate ($29B at 2023 Y.E. with predictions cash could hit $150B by 2030), and TSLA ‘in between two major growth waves,’ I'll ask again: Why doesn't TSLA distribute some of its unneeded cash ($10B over 3 years) back to shareholders?” the fund manager asked on X, formerly Twitter. Tesla is the third-biggest holding of the Future Fund Active ETF FFND, after Alphabet and Nvidia. Tesla’s tech rivals have been returning cash to shareholders, Black said, adding, “It's the sensible thing to do rather than let cash build up unchecked at 4-5% ROIs.” Free cash flow, Black said, is the cash left after setting aside capex for new factories, robots, robotaxis, research and development, and more. He noted that free cash flow can be deployed only for one of the following: See Also: Everything You Need To Know About Tesla Stock Why It’s Important: Buybacks, which is one mode of returning cash to shareholders, technically reduces the number of outstanding shares, in turn boosting earnings per share. Meta Platforms META recently initiated a maiden dividend, and the announcement, along with solid quarterly results and positive guidance, led to a strong upside in shares. Black said he also sees buybacks as a means to boost Tesla CEO Elon Musk’s voting control in the company. “If the TSLA Board combined a new 2024 CEO comp plan with a multi-year $50B buyback (@$250/share = 200M shares), the shares denominator could shrink by ~6%, making it easier for @elonmusk to get to 25% ownership,” he said. Musk recently advocated for granting himself 25% voting control to give him more autonomy in driving advanced AI initiatives at Tesla. The next catalyst for the stock, according to Black, is the potential resolution of Musk's 2018 compensation plan so that Tesla can send out a 2024 proxy with his new compensation plan in a timely manner. The Delaware Chancery Court recently ruled to nullify the billionaire’s $56 billion compensation plan that was approved by the board in 2018. Tesla ended Friday’s session down 0.25% at $199.95, according to Benzinga Pro data. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Is Tesla Stock About To Take Off? Fund Manager Cites 2 Factors That May Allay Key Investor Concern Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}