{
    "title": "Forget Nvidia: These 3 Artificial Intelligence (AI) Stocks Have Up to 203% \nUpside, According to Select Wall Street ...",
    "date": "2/27/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA-Q/pressreleases/24368591/forget-nvidia-these-3-artificial-intelligence-ai-stocks-have-up-to-203-upside-according-to-select-wall-street-analysts/",
    "text": "Over the past three decades, there's always been a next-big-thing trend to captivate investors' attention. For the moment, nothing is causing more excitement within the investing community than the artificial intelligence (AI) revolution. AI utilizes software and systems to oversee tasks that would normally be handled by humans. What makes AI special is the incorporation of machine learning, which is what allows software and systems to evolve and become smarter over time. With practical application across virtually all sectors and industries, artificial intelligence is expected to add more than $15 trillion to global gross domestic product (GDP) by the turn of the decade, according to researchers at PwC. Image source: Getty Images. The astronomical dollar figures attached to AI solutions aren't lost on Wall Street or its analysts. Most analysts anticipate continued upside in AI stocks over the next year -- and that includes leading megacap stock Nvidia(NASDAQ: NVDA). According to analyst Ananda Baruah of Loop Capital, shares of Nvidia can catapult to $1,200, which would imply 52% upside from where the stock closed on Feb. 23, 2024. This would effectively tack on $1 trillion in market cap and potentially make Nvidia the largest publicly traded company in the world. Baruah's optimism likely stems from Nvidia's dominant position as the infrastructure backbone of the AI movement. The company's A100 and H100 graphics processing units (GPUs) may account for as much as 90% of the share of GPUs used in high-compute data centers in 2024. With demand clearly outpacing supply, and Nvidia enjoying a boatload of near-term pricing power, it's been able to easily surpass Wall Street's consensus sales and profit forecasts. However, Nvidia is also set to face numerous headwinds this year. As I outlined recently, it'll be contending with growing external competition from the likes of Advanced Micro Devices and Intel, as well as internal competition. Nvidia's two largest customers, Meta Platforms and Microsoft, are developing AI-fueled data-center chips of their own. What's more, there's the real possibility Nvidia could cannibalize its own gross margin as A100 and H100 GPU production ramps. If GPU scarcity wanes, the pricing power that's been primarily responsible for powering Nvidia's data-center sales higher could shift into reverse. Even though Baruah at Loop Capital believes Nvidia's stock could deliver a 52% return from where it closed last week, three other AI stocks offer higher upside, according to select Wall Street analysts. Image source: Getty Images. The first artificial intelligence stock that at least one Wall Street analyst believes can outpace Nvidia to the upside is China-based Baidu(NASDAQ: BIDU). According to Fawne Jiang at Benchmark, Baidu stock can reach $210 per share, which would imply upside of 89% relative to where it closed on February 23. Most investors are familiar with Baidu because of its dominant internet search engine in China. In January, Baidu accounted for 61% of internet search in the world's No. 2 economy by GDP. With few exceptions, Baidu has been responsible for between 60% and 85% of China's internet search share over the past nine years. This makes it a logical go-to for advertisers, which has helped it maintain strong ad-pricing power. However, Baidu's future is very much dependent on the success of AI. The company's AI Cloud and world-leading autonomous ride-hailing service, Apollo Go, have delivered consistently superior growth rates when compared to the company's foundational internet search segment. In particular, generative AI solutions offer businesses a means to tailor their ads to the wants and needs of specific users. Jiang's price target of $210 isn't outrageous, either. Given Baidu's historic double-digit growth rate, its $27.8 billion in cash, cash equivalents, and restricted cash (as of Sept. 30), and its remarkably low forward-year earnings multiple of just 10, non-online marketing revenue could realistically push Baidu's stock to $210. Another AI stock that may have investors completely forgetting about Nvidia is Mobileye Global(NASDAQ: MBLY), a developer of advanced driver assistance systems (ADAS) and autonomous driving solutions. Analyst Itay Michaeli of Citigroup believes Mobileye Global stock can more than triple to $72 per share. Next-generation vehicles are incorporating technology like never before. Mobileye's SuperVision is currently its most-advanced ADAS offering. Though it still requires the full attention (and potential intervention) of a driver, SuperVision is a hands-off solution that can handle lane changes, accelerating and decelerating, and provide evasive maneuver assistance, and point-to-point automated navigation of an autonomous vehicle. As cars become \"smarter,\" Mobileye's solutions are bound to become more popular. Something else working in Mobileye's favor is that the company was profitable on the basis of generally accepted accounting principles (GAAP) during the fourth quarter. Mobileye landed $7.4 billion in future orders in 2023 and also has $1.21 billion in cash and cash equivalents at the ready, as of Dec. 30, 2023. Not only should the company have little trouble sustaining a double-digit growth rate during long-winded periods of U.S. economic growth, but it has the capital needed to continue innovating. While Mobileye Global has developed undeniably exciting technology, and majority shareholder Intel would be thrilled to see its share price soar, the growing possibility of a recession taking shape in the not-too-distant future makes a $72 price target a tough sell in 2024. The third AI stock that offers even more upside than Nvidia, at least based on the prognostication of one Wall Street analyst, is electric vehicle (EV) maker Tesla(NASDAQ: TSLA). Wedbush Securities analyst Dan Ives recently reiterated his belief that Tesla's stock can reach $315 per share, which would represent 64% upside from where shares ended on Feb. 23. AI solutions are critical to the EVs Tesla sells and leases. The company's Autopilot software relies on cameras, sensors, and other solutions to cull data from the car's surroundings, which are needed to make split-second driving decisions. Tesla has ridden its first-mover advantages in the EV space to become North America's leading EV manufacturer. The company produced just shy of 1.85 million EVs in 2023, while delivering its fourth consecutive year of GAAP profits. But unlike Baidu, which has a very reasonable high-water price target, the lofty perch Dan Ives' price target sits atop appears unreachable due to mounting headwinds for Tesla. The company has slashed prices for Models 3, S, X, and Y on more than a half-dozen occasions since the start of 2023. These cuts are in response to weakening EV demand, fierce competition, and rising inventory levels as Tesla's production expands. Although Tesla is selling more vehicles, its operating margin has been more than halved to 8.2% in a little over a year. Tesla's ambitions to become more than a car company have fallen flat, too. Growth in the company's Energy Generation and Storage segment has stalled on a sequential quarterly basis, while Services gross margin came in below 3% in Q4. Tesla is almost entirely reliant on selling and leasing EVs to generate a profit. This is a problem considering that Tesla trades at north of 60 times consensus earnings in 2024 in an industry known for single-digit, price-to-earnings ratios. Should you invest $1,000 in Baidu right now? Before you buy stock in Baidu, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Baidu wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Citigroup is an advertising partner of The Ascent, a Motley Fool company. Sean Williams has positions in Baidu, Intel, and Meta Platforms. The Motley Fool has positions in and recommends Advanced Micro Devices, Baidu, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends Intel and Mobileye Global and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short February 2024 $47 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}