{
    "title": "Black-Owned Bakery Loses Thousands After Tesla Cancels Order",
    "date": "2/25/2024",
    "url": "https://www.blackenterprise.com/black-owned-bakery-tesla-order/",
    "text": "February 25, 2024 Elon Musk has promised via a tweet to “make things good” with the bakery owner. A Black-owned bakery accused Tesla of making a large order for a Black History Month event and then canceling before any payment was made, leaving the company holding the bag. Some questioned if the incident had anything to do with Tesla CEO Elon Musk’s attack of diversity, equity, and inclusion initiatives. The Giving Pies, a San Diego, California-based bakery, had an order placed by a Tesla representative on Feb. 14, set to be delivered the following week. Voahangy Rasetarinera, owner of the bakery, told NBC Bay Area that the bakery had to shift its employee work schedule and spend $2,000 only to be informed via text message two days later that the order had been canceled. She said the experience made her feel like her company was being disrespected. “It felt like we didn’t matter,” Rasetarinera said. “It felt like, ‘OK, it’s no big deal, it’s just a business transaction that didn’t pan out.’ But it’s not like that. I had to tell my staff change your plans.” While Musk has promised via a tweet to “make things good” with the bakery owner, she says that the experience has made her reexamine how she does business with large corporations going forward. So it’s not just @elonmusk, pos are a dime a dozen at @Tesla. They ordered 4000 mini pies from @TheGivingPies, a small, black woman owned business and cancelled at the last minute without any payment. pic.twitter.com/FXmzMGL9UJ The owner of San Jose's The Giving Pies told ABC7 News she took a big hit after @Tesla placed an order worth more than $2,000, then unexpectedly canceled. But on Friday, @elonmusk wrote a message on @X saying he would \"make things good with the bakery.\" https://t.co/Ib6CJHyYrT pic.twitter.com/fDKJB7rJDf  A post shared by The Giving Pies (@thegivingpies)  Rasetarinera told ABC 7 that she first began to worry when the invoice didn’t come through within the day of the order, even after she sent a request for payment that was approved. However, the next night, a company representative asked to double Tesla’s initial order. “I’m like, ‘Okay, I’m gonna wait, you know, and they are professional, they are a big company. So once it’s approved, it’s approved.'” Rasetarinera said a Tesla representative had called her a little after 9 p.m. “She said, ‘Oh, I’m so sorry that vendor hadn’t paid you yet, I think they’re kind of new,'” Rasetarinera recollected, “‘And I have a question for you, can we double the order?’” This development caused the bakery to have to cancel other orders and purchase additional ingredients to make the pies, which at that point still had not been paid for. Once Rasetarinera contacted the representative to follow up, she received a text message informing her that the order had been canceled: “It unfortunately sounds like we will be changing plans and will not be needing this order. Thank you so much for your support I appreciate it.” Once Rasetarinera posted her side of the story to Instagram, her account of the experience went viral and resulted in increased traffic for her business, which she is grateful for. She also hopes that her story will be used as a warning to large corporations to respect the time and effort of smaller businesses. Rasetarinera told ABC 7, “I don’t want them to feel like, ‘Oh you know we can do whatever.’ It’s people’s lives that they are affecting and I want them to know that.” Customers like Bruce Felperin certainly appreciate small businesses like The Giving Pies, as he told ABC 7. “You got to help your community, the people that make your community, the merchants that are in your community,” Felperin said, “because if you don’t help them, no one else is.” RELATED CONTENT: Elon Musk Slammed For Controversial Comments On Diversity In Aviation Programs       Enter your Email Address below to get our fun-filled Newsletter! © 2024 Black Enterprise. All Rights Reserved. "
}