{
    "title": "Elon Musk's Mother Confirms Tesla Offers No Friends or Family Discount. She \nEven Showed The Receipt.",
    "date": "2/21/2024",
    "url": "https://greenbuildingelements.com/elon-musks-mother-confirms-tesla-offers-no-friends-or-family-discount-she-even-showed-the-receipt/",
    "text": "In a recent report on The Electric Viking channel, Sam delved into the surprising revelation made by Elon Musk’s mother regarding the Tesla CEO’s car purchases. Contrary to popular belief, Musk apparently pays the full price for his Tesla vehicles, dispelling the assumption that he, as the head of the company, would enjoy complimentary or discounted models. Here’s the full story. The video began with Sam sharing his own experience of starting a business and receiving products at a cost price, sharing the common practice of employees enjoying discounts or perks related to their work. However, when it came to Tesla, Sam suggested that the rules were different. Sam expressed his initial expectations, saying that one would assume Elon Musk, the CEO and founder of Tesla, would receive Tesla vehicles for free. However, the surprising revelation came from Musk’s mother, who disclosed that her son paid the full price for a Tesla, and there were no family discounts involved. The video went on to highlight that it was not just Elon Musk who abided by this practice, but also his family members, including his mother and brother Kimble Musk. Even with Kimble being on the board at Tesla, he reportedly did not receive any special pricing benefits. Sam shared that this unconventional approach was contrary to the practices seen in many companies, where executives and their families often enjoyed certain perks and discounts. Sam mentioned that Tesla’s policy extended to celebrities as well, citing an incident involving rapper Snoop Dogg. In a tweet to Elon Musk, Snoop Dogg expressed his desire for a Tesla, expecting a complimentary vehicle. However, Musk’s response was clear: everyone, including him, paid the full price for a Tesla. The video suggested that this might come as a surprise to celebrities who were used to receiving special treatment. The video also shared that while other car companies, such as Toyota, reportedly offered employee discounts, Tesla remained an exception in this regard. Sam concluded the video by sharing the uniqueness of Tesla’s approach in the automotive industry, where traditional norms of discounted vehicles for executives and their families were challenged. Several YouTube users shared their thoughts on the incident. One user wrote, “Tesla employees get stock which is more valuable than a car, they can buy a car and house which other employees can’t.” Another user added, “Elon paid full price for his Tesla, but did he notice? That’s the difference. IMO employees should get a discount or atleast on options.” So what are your thoughts? As Elon Musk and Tesla broke away from conventional practices in the automotive industry, what impact do you think this unique approach had on the company’s culture and perception, both internally among employees and externally among customers? Dara Brant is the Managing Editor at Green Building Elements. Prior to joining us she covered alternative energy news and local developments at Your Energy Blog. Dara has a passion for sustainable living and wants to do more than her fair share to help build a better tomorrow for future generations. Apple surprised the world this week by abruptly pulling the plug on its secretive electric... In a surprising turn of events, the Biden administration has announced a significant slowdown in... The Biden administration is contemplating imposing restrictions on imports of Chinese electric vehicles (EVs) and... In a recent video by the Chase Car channel, a troubling trend was brought to... In a recent report, NBC’s Adrienne Broaddus explored the challenges faced by EV owners as... Sam from The Electric Viking recently raised concerns about Ford’s electric vehicle sales plummeting by... In today’s world, where sustainability and ethical choices are increasingly valued, “vegan leather” has become... Mercedes-Benz CEO’s recent decision to ditch electric vehicle (EV) production has sent shockwaves through the... Green Building Elements, LLC935 Main Street B3-B,Manchester, CT 06040(860) 255-4207 © 2024 All Rights Reserved. Privacy Policy Green Building Elements LLC is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com. As an Amazon Associate we earn from qualifying purchases.        \"*\" indicates required fields\n\n\nDo you require financing for a residential or commercial property?*\n\n\nResidential\n\n\n\nCommercial\n\n\n\n\n\n\n\n\nWhat type of residential building is your project?*\n\n\nMetal House\n\n\n\nBarndominium\n\n\n\nTraditional House\n\n\n\nGarage/Shed/Carport/Barn\n\n\n\n \n\n\n\n\nWhere is your project located?*\n\n\nAlabamaAlaskaAmerican SamoaArizonaArkansasCaliforniaColoradoConnecticutDelawareDistrict of ColumbiaFloridaGeorgiaGuamHawaiiIdahoIllinoisIndianaIowaKansasKentuckyLouisianaMaineMarylandMassachusettsMichiganMinnesotaMississippiMissouriMontanaNebraskaNevadaNew HampshireNew JerseyNew MexicoNew YorkNorth CarolinaNorth DakotaNorthern Mariana IslandsOhioOklahomaOregonPennsylvaniaPuerto RicoRhode IslandSouth CarolinaSouth DakotaTennesseeTexasUtahU.S. Virgin IslandsVermontVirginiaWashingtonWest VirginiaWisconsinWyomingArmed Forces AmericasArmed Forces EuropeArmed Forces Pacific\nState \"*\" indicates required fields  Username or email address * Password * Remember me\n\n Log in Lost your password? "
}