{
    "title": "$56bn reasons to show autonomy",
    "date": "2/4/2024",
    "url": "https://www.businessdailyafrica.com/bd/opinion-analysis/columnists/-56bn-reasons-to-show-autonomy--4513962",
    "text": "SpaceX, Twitter and electric car maker Tesla chief executive Elon Musk. FILE PHOTO | AFP Someone recently shared with me a breaking story coming out of the company incorporation heaven of Delaware in the United States. Delaware is reputed to have a business-friendly legal and tax framework, which has made it attractive for many companies to incorporate themselves there. One such company is the electronic vehicle (EV) manufacturer Tesla, associated with the legendary South African billionaire Elon Musk. According to the Reuters news agency, last Tuesday, January 30 2024, a Delaware judge threw out Musk’s record-breaking $56 billion Tesla pay package. She called the compensation granted by the EV maker’s board “an unfathomable sum” that was unfair to shareholders. I would have converted the dollar equivalent into Kenya shillings for ease of reader reference, but in light of the ever-shifting daily exchange rate, it might be easier for a camel to enter through the eye of a needle than for me to try and pin down a rate for you. As the person who shared the news article with me pointed out somewhat amused, with Kenya’s gross domestic product (GDP) in 2022 estimated at $113 billion, Musk’s package is politely about half of this blessed country’s GDP. Back to Musk’s eye-watering compensation. Let me first start by giving Google search driven context. Born in 1971, Musk and his brother Kimbal co-founded a software company in 1995, which was bought by the computer company Compaq for $307 million four years later in 1999. He then co-founded another company, which eventually became PayPal in 2000 and was acquired by eBay two years later for $1.5 billion. In his early 30s, with dollars burning a hole in his clean energy pockets, Musk became an early investor in Tesla Motors in 2004 eventually becoming its chairman, product architect and eventually CEO in 2008. Fast forward to 10 years later. Tesla had launched a series of mass-market electronic vehicles that were becoming wildly popular. In 2018, he negotiated a compensation package with his board which, according to a Reuters article published last week on February 1, created 12 tranches of options. Each tranche was equivalent at the time to one percent of Tesla’s outstanding shares thereby potentially giving him a 12 per cent stake. Musk was not going to receive a salary. The article explains further that under the 10-year deal, Musk was eligible to win an options tranche every time Tesla hit a series of up to 12 targets. Those targets were tied to increases in Tesla’s market capitalisation in $50 billion increments, and to aggressive hurdles for revenue and EBITDA growth. Musk went on to hit all 12 targets and the options are now worth $51 billion, which is the cost to Musk to exercise them. Now this is where it gets interesting. Even though the judge described the pay package as “unfathomable”, Tesla shareholders had approved the amount in 2018 with 73 percent of the votes cast, excluding votes by both Musk and his brother Kimbal. For context purposes, and perhaps the reason why shareholders thought the targets were a total stretch was because Tesla, at the time, was struggling to manufacture its Model 3 sedan and it was widely believed that competition from larger manufacturers would wipe Tesla off the EV universe. When the package was approved, Tesla’s stock market value was $53 billion. Three years later in 2021 the value of the company had blown into the stratosphere, growing by more than 2,000 percent to $1.2 trillion. More recently it has settled at $605 billion. The Reuters article goes ahead to posit that an investor who held shares when Musk’s package was approved in 2018 would currently be up by 1,000 percent. So why should any judge be alarmed when the shareholder, who is the company’s ultimate stakeholder, is sitting pretty? Remember, Musk has not exercised the option, meaning he hasn’t purchased the shares. The shares subject of the option, are priced at a discount to current market value, which value he has grown during his CEO tenure with products that have been profitable to the company. Unwinding the, package, therefore would not be difficult since the options remain unexercised, but ideally the compensation will have to be replaced with something else. In calling the package an “unfathomable sum”, Judge Kathaleen McCormick claimed that it was unfair to shareholders and brought to question the independence of Tesla’s board. Did someone say board independence? Next week we will delve into the composition of the Tesla board and why this motley group of individuals have been the unrelenting focus of activist investors. Email:[email protected]Twitter:@carolmusyoka "
}