{
    "title": "Tesla Power India plans to recruit over 2000 employees across departments; \nto open 5000 ReStore units by 2026",
    "date": "2/19/2024",
    "url": "https://www.financialexpress.com/business/industry-tesla-power-india-plans-to-recruit-over-2000-employees-across-departments-to-open-5000-restore-units-by-2026-3398323/",
    "text": "The Financial Express Tesla Power India, a sustainable energy storage solutions brand, announced its plans to recruit over 2000 employees across various verticals as part of their expansion efforts in India. The company has recently launched India’s first refurbished battery brand, ReStore. ReStore is based on Electrochemical Battery Enhancement Process technology, which enhances the life of old used lead-acid batteries. ReStore actively contributes to the Skill India and Atmanirbhar Bharat initiative by providing training and employment opportunities in the refurbishing of batteries in the energy storage sector. Tesla Power India plans to open 5000 ReStore units by 2026. Through these units, a significant number of employment opportunities will be created in various departments. The planned recruitment drive will encompass a diverse range of positions across engineering, operations, sales, marketing, and support functions, providing ample opportunities for unemployed youth of the country. Kavinder Khurana, Managing Director of Tesla Power India, expressed enthusiasm about the company’s expansion plans and emphasized the importance of talent acquisition in driving success in the Indian market. “As Tesla Power India continues to expand its footprint in India, we recognize the critical role that talented individuals will play in achieving the sustainable goals through innovation. We are excited to welcome the new talent in our team and leverage their contribution to further our mission of Save Cost. Save the Environment. Save Lives,” he said. Tesla Power India’s commitment to hiring local talent aligns with its broader vision of fostering economic development and driving job creation even in remote regions. By investing in talent development and retention initiatives, the company aims to build a skilled workforce capable of addressing the evolving needs of the energy storage sector in India. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}