{
    "title": "The Next Tesla? 3 EV Stocks That Investors Shouldn't Ignore.",
    "date": "2/16/2024",
    "url": "https://investorplace.com/2024/02/the-next-tesla-3-ev-stocks-that-investors-shouldnt-ignore/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. Here are just a few of the hottest EV stocks to buy and hold today Advertisement Source: shutterstock.com/Nixx Photography EV stocks have been struggling thanks in large part to high interest rates. Look at Tesla (NASDAQ:TSLA), for example. Since the year began, the EV giant sank from about $265 to a low of $175, all after warning that growth would be notably lower than in 2023, when sales were up 39%. CEO Elon Musk even said that Chinese rivals “will pretty much demolish most other car companies in the world” unless trade barriers are put in place,” as noted by the BBC. We’ve even seen a scale-back of EV models from General Motors (NYSE:GM) and Ford (NYSE:F) because the demand just isn’t there. However, while Tesla is struggling, there are other EV stocks you may not want to ignore at the moment. That includes: Rebounding well off recent lows, Li Auto (NASDAQ:LI) could be one of the top EV stocks of the year. Just in January, the company delivered 31,165 EVs, which is a 105.8% improvement year over year. Cumulative deliveries of LI vehicles are also up to 664,529 at the close of January, with a good deal of upside remaining. Xiang Li, chairman and chief executive officer of Li Auto said, “2024 will be an unprecedented year of growth for us, and we will establish a portfolio of eight competitive models, including four EREVs and four BEVs, to satisfy the evolving demands of our family users. Our 2024 launches will kick off in March with the official release and commencement of deliveries of our high-tech flagship family MPV, Li MEGA, alongside the rollout of the 2024 Li L7, Li L8, and Li L9,” as noted in a company press release. We’ll learn more about Li’s progress when the company posts financial results for the fourth quarter and full year 2023 before the U.S. market opens on Monday, Feb. 26. We can also look at XPeng (NYSE:XPEV), whose January 2024 Smart EV sales soared 58% to 8,250. The company also launched its X9 Ultra Smart Large Seven-seater MPV, delivering 2,478 units across 100+ Chinese cities. Better, the X9 Max is already dominating with 70% of all orders. In December, the company delivered 20,115 EVs, a 78% jump year over year. For the fourth quarter of 2023, it delivered 60,158 vehicles—a 171% year-over-year jump. For all of last year, it delivered 141,601 vehicles, a year-over-year improvement of 17%. The company expects to expand in three new markets across Europe this year. As noted by Electrek.co, “XPeng is planning to expand to markets in Germany, France and Britain in 2024. Those entries will begin with the aforementioned G9 SUV and P7 sedan, as well as the automaker’s most recent model to reach production, the G6.” For the second consecutive year, BYD (OTCMKTS:BYDDF) overtook Tesla as the world’s top selling electric automaker. Helping, the company sold about 3.02 million EVs in 2023, an improvement of about 62% year over year. According to CNBC, “The sales comprise 1.6M battery-electric vehicles (BEVs) and approximately 1.4M plug-in hybrid electric vehicles (PHEVs). The company sold 526,409 fully electric vehicles in Q4, with EV and hybrid sales totaling 340,178 in December, including 190,754 all-electric cars, driven by aggressive end-of-year discounting.” The company is also looking to open a plant in Mexico as part of its global push. That’s because BYD sees Mexico as a key market with big potential. It opened plants in Thailand and announced plans to build a production facility in Hungary. Plus, it has plans to build a plant in Brazil and is now selling EVs in Indonesia. Better, BYDDF wants to get more aggressive in the U.K., Denmark and Norway. On the date of publication, Ian Cooper did not hold (either directly or indirectly) any positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Ian Cooper, a contributor to InvestorPlace.com, has been analyzing stocks and options for web-based advisories since 1999. Automotive, Consumer Discretionary, Electric Vehicles   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/the-next-tesla-3-ev-stocks-that-investors-shouldnt-ignore/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}