{
    "title": "‘At what point do you decide Tesla is bigger than Musk?’ The time may be \nright for Elon Musk to step down as CEO, suggest experts",
    "date": "2/3/2024",
    "url": "https://fortune.com/2024/02/03/elon-musk-tesla-ceo-board-directors-corporate-governance/",
    "text": "Whisper it, but the time may have finally come for Tesla’s board to nudge Elon Musk towards stepping down as CEO, experts suggest. Advocates argue that the visionary entrepreneur should relinquish day-to-day operations, allowing him to zero in on his forte—innovating new products. It’s an approach he’s already adopted at his social media platform X, where Linda Yaccarino is in charge of running the company while Musk focuses on driving innovation. By doing so, he would take himself out of the firing line during a challenging juncture when Tesla’s growth is starting to falter and its stock price has languished—in part due to a flawed governance culture, for which he is responsible. Read more: Elon Musk took drugs with Tesla board members: Report “When you have a founder at the helm, it’s both a gift and a curse, because visionaries rarely make great CEOs,” says Corestone Capital chairman and CEO Will McDonough. The wealth manager argues Tesla needs to find someone like Google’s Eric Schmidt or Facebook’s Sheryl Sandberg, who can professionally manage the company under the overarching strategic direction of Musk. Zack Kirkhorn, described by the Wall Street Journal as the “executive who keeps Tesla rolling”, might have been exactly that individual. But the highly respected finance chief abruptly departed in August with no explanation given. Thus far the only individual to work with him noiselessly over a long period is SpaceX president Gwynne Shotwell. Normally the idea of replacing Musk as CEO might sound foolhardy given he is the most influential entrepreneur of his generation, someone blessed with an uncanny drive to succeed, an ability to recruit the best talent to his cause, and a gift for predicting what trends will shape society. But he also comes with a lot of sharp edges that make it challenging to run a publicly traded megacap like Tesla. A 200-page court opinion from a Delaware judge this week sheds light on Musk’s degree of consideration for governance. The document reveals how he crafted his own $56 billion compensation package in 2018, as Tesla’s directors dared not reject it. Randall Peterson, a professor at the London Business School whose research centers on CEO personalities and boardroom dynamics, told Fortune the ruling was a “pretty damning critique” of Musk’s board and believes Tesla would be better off with him in a supporting role where he could devote himself to creating new products. “Could they find some kind of accommodation that keeps Elon in the atmosphere but takes him out of day-to-day management of the rest of Tesla?” says Peterson, who co-authored a 2022 book on dysfunctional boards. “If they can come to that, then they’re in business. If not it’s a huge risk.” Last year, Musk went on the record saying he did not care whether his investors lost money because he might promote unsubstantiated conspiracy theories. In November, he then told Bob Iger to “go f*** yourself” after the Disney CEO pulled his advertising over concerns his brand might not be safe on X. “He’s a compliance officer’s nightmare because he shoots from the hip,” McDonough tells Fortune. Musk also ruffled feathers after he decided to negotiate in public over his upcoming pay package, saying he will no longer develop artificial intelligence within Tesla unless the board ensures he can gain a 25% blocking minority—essentially a power to veto certain decisions of shareholders. This demand came even though Musk seamlessly moved onto the third part of his Master Plan this March without arguably accomplishing any of the four main targets laid out in the second one. While there is some sympathy given he watched his non-profit OpenAI become a commercial appendage of Microsoft, the petulant attitude and unvarnished attempt to blackmail his directors only served to undermine his case. “The way he phrased it is dangerous because it’s holding the board hostage,” says Philippe Houchois, a veteran auto analyst with investment bank Jefferies. “If you start building something inside the company, you cannot just threaten to take it out.” Contemplating a Tesla in which he is not CEO seems impossible in part because he has been the public face of Tesla for years, and the stock price has in part been juiced by his visionary leadership. But Wall Street isn’t helping Musk’s case any longer either. While Tesla enjoyed a stellar pandemic year, the share has dropped 20% since the start of 2021 while the Nasdaq 100 has gained 35% during the same period. Other companies like Nvidia, Microsoft and Meta have marked all-time highs in recent days, by comparison. “There have been a number of investment decisions made in the last two years that have put Tesla off track, and that is the issue for the board,” says Jefferies analyst Houchois. “At what point do you decide Tesla is bigger than Musk?” The entrepreneur has repeatedly claimed he never wanted to be CEO and hoped to step back and serve as chief product architect once the initial problems manufacturing the Model 3 were solved during the critical launch over six years ago. Tesla director James Murdoch even testified that a successor had been identified. Now the board has a unique chance to reassert its authority, ease the burden on the 52-year-old and overhaul its acute governance shortcomings before Tesla suffers its next courtroom defeat. The chief editor of EV-friendly media website Electrek, who himself voted as Tesla shareholder in favor of Musk’s $56 billion pay package, argued this was the time for the charismatic yet mercurial CEO to step down to advance his vision as a product architect. “You know who first thought of that plan?” he wrote on Wednesday. “A guy called Elon Musk.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}