{
    "title": "'Jaw Dropper:' Tesla Analysts, Investors Unpack Fallout From CEO's $55B Pay \nPlan Collapse While Musk Lame",
    "date": "1/31/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36861662/jaw-dropper-tesla-analysts-investors-unpack-fallout-from-ceos-55b-pay-plan-collapse",
    "text": "Delaware Chancery Court Chief Judge Kathleen McCormick on Tuesday struck down Tesla, Inc. TSLA CEO Elon Musk‘s $55 billion 2018 compensation plan. The decision comes more than a year after the trial concluded. Disgruntled Tesla shareholders initiated the lawsuit, challenging the board’s approval of Musk’s substantial pay package, a majority of which comprises granted options. Uncertainty Rules High: Many analysts and investors agree that the verdict introduces uncertainty at a challenging time for Tesla. See Also: Everything You Need To Know About Tesla Stock Tesla CEO Reacts: Musk reacted to the court ruling on his social media platform, X, expressing exasperation and running a poll asking followers whether Tesla should change its place of incorporation to Texas. A majority of respondents favored the move. Musk also responded to observations by his fan following. A Tesla influencer suggested the federal government is the ultimate loser in the whole affair as Musk would have paid taxes on all the options. Responding to the post, the billionaire underlined the fact that he can’t be running away with all the option awards he received. “The most salient point that was missed was that the shares could not be sold for 5 years after exercise of the options, making it impossible to ‘exercise and run,'” he said. A former Tesla employee turned influencer lamented the development as one of the perils of being a public company, and Musk concurred with him. “The parasitic load of being a public company has become extremely high,” he said. Why It’s Important: Future Fund’s Black, in the past, highlighted “key man risk” as a reason for low institutional ownership in Tesla. Black suggests that a new compensation plan could mitigate the risk of Musk’s departure, outlining steps for Tesla to revive its declining stock. Tesla shares have been on a downtrend since October 2023, with two consecutive quarters of underperformance. The ongoing dispute over Musk’s compensation further complicates the situation. If the options were excluded, Bloomberg estimates that Musk’s net worth could fall by $50 billion, potentially dropping him to the third-richest individual globally from his current position as the richest person with a net worth of $205 billion. Reacting to the uncertainty, Tesla shares fell 3.35% to $185.17 in premarket trading on Wednesday, according to Benzinga Pro data. Read Next: Tesla’s Revenue Victory Over Disney ‘A Modest ‘Start,’ Says Elon Musk: Stock To See Better Times After January’s $180B Wipeout? Image via photos on Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}