{
    "title": "Forget Tesla, This EV Stock Is Poised for an Incredible Run",
    "date": "1/19/2024",
    "url": "https://www.fool.ca/2024/01/19/forget-tesla-this-ev-stock-is-poised-for-an-incredible-run/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Tesla hasn’t been a true growth stock but one EV stock could deliver far superior returns when its incredible run begins. Image source: Getty Images The first electric car was invented in 1832 but in contemporary times, Tesla is famous because it pioneered the electric vehicle (EV) revolution. Chairman Elon Musk and his team introduced the Roadster in 2008, a premium all-electric sedan and the rest is history. Today, Tesla is the top-of-mind EV stock in North America. Investors perceive it as a high-growth stock but it isn’t. TSLA won’t qualify for the TSX30 List, a flagship program for the top-growth stocks. Black Diamond Group ranked 30th in 2023 with 304%-plus performance in three years. Tesla’s return last year was 101.7%, although its overall return in three years is -21.7%. If you invest right now, the share price is UD$215.55 (-13.25% year to date). But is there a better alternative for ESG investors on the TSX? The Lion Electric Company (TSX:LEV) is tiny compared to the billion-dollar American EV manufacturer. However, the $540.5 million zero-emission vehicle maker could upstage the giant soon. Also, you will only spend a little to own shares, but the potential gains could be enormous. The Lion Electric Company was established in the year Tesla came up with the Roadster. In May 2021, the company from Saint-Jérôme made a dual-listing IPO on the TSX and NYSE. Fast forward to the present and Lion Electric is a leading OEM in transportation electrification in North America. Besides rolling out all-electric school buses and urban trucks, Lion Electric designs, manufactures, and assembles many components of its vehicles, including chassis, battery packs, cabins, and powertrains. The buses and trucks come in several ranges and configuration options depending on customers’ needs and route planning. According to management, around 1,600 Lion purpose-built all-electric vehicles are running on the road today and in real-life operating conditions. Lion has manufacturing factories in Saint-Jérôme and Joliet, Illinois, that can each produce 2,500 vehicles annually. Its battery factory in Mirabel, Quebec, is highly automated and has a manufacturing capacity of 1.7 GWh (for 5,000 vehicles). The full-year 2023 financial results have yet to come out, but the record revenue in Q3 2023 speaks volumes. In the three months ending September 30, 2023, revenue jumped 96.1% year over year to US$80.4 million. However, net loss widened 15.4% to US$19.9 million. Management said the losses were due to non-cash-related factors. For the first nine months of 2023, revenue soared 110.5% year over year to US$193.07 million. Other business highlights during the quarter include 2,232 all-electric vehicles (1,964 buses and 268 trucks) on the order book worth US$525 million. On the Lion Energy side, the total order book for charging stations and related services is 129 (US$4 million). Lion Electric is confident that its heavy-duty EVs can address the needs of the mid-range urban market. This market is also well suited for electrification given the short distance and return to base during workdays. Moreover, the company should benefit from regulatory tailwinds and programs supporting zero-emission vehicles. This Canadian EV stock still flies under the radar but is a strong buy at only $2.39 per share. Market analysts’ 12-month average price target is $4.07 (+70.3%). Consider investing in Lion Electric before it soon leapfrogs competitors. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 25, 2024 |\n        Andrew Button NVIDIA (NASDAQ:NVDA) may be trendy but Shopify (TSX:SHOP) has more upside according to Wall Street. Read more » March 25, 2024 |\n        Andrew Button Tech stocks like Shopify (TSX:SHOP) are crushing the TSX this year. Read more » March 25, 2024 |\n        Aditya Raghunath Kinaxis has delivered market-beating gains to shareholders in the past decade. Is the TSX tech stock still a good buy… Read more » March 25, 2024 |\n        Amy Legate-Wolfe WELL Health (TSX:WELL) stock has seen its shares plunge after full-year earnings. Should investors write off the stock? Read more » March 25, 2024 |\n        Joey Frenette Kinaxis (TSX:KXS) stock is looking way too cheap to ignore if you seek top-notch AI innovation. Read more » March 25, 2024 |\n        Aditya Raghunath Shares of Nvidia have been on an absolute tear in the last decade. Should you buy this tech stock right… Read more » March 22, 2024 |\n        Karen Thomas, MSc, CFA Well Health stock has been hit hard in the last three years, yet fundamentals remain strong and keep hitting records. Read more » March 22, 2024 |\n        Amy Legate-Wolfe This growth stock has been on a tear in 2023 and 2024, with even more likely for this year and… Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. ©  2024 The Motley Fool Canada, ULC. All rights reserved. "
}