{
    "title": null,
    "date": "1/2/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240102110/tesla-is-getting-beat-by-chinas-byd-on-ev-sales",
    "text": "By Tomi Kilgore BYD sold more than 520,000 all-battery vehicles in the fourth quarter, while Tesla delivered just over 480,000 Tesla Inc. has been knocked off its perch as the electric vehicles leader, after delivery data showed that China-based auto giant BYD Co. is now beating Tesla in the EV game. BYD (BYDDY) (CN:002594) said over the long weekend that it sold 190,754 battery electric vehicles in December, up 70.4% from the same period a year ago. Including the 170,150 EVs sold in November and the 165,505 EVs delivered in October, BYD sold 526,409 EVs during the fourth quarter. Tesla reported Tuesday fourth-quarter deliveries of 484,507 vehicles, up 19.5% from a year ago and above the FactSet consensus of 473,000, but 8% below BYD's total. Tesla's stock (TSLA) edged up 0.1% in morning trading Tuesday, reversing an earlier premarket loss of as much as 1.4%. Meanwhile, BYD's U.S.-listed shares fell 2.5%. In the third quarter, BYD had sold 431,738 EVs while Tesla delivered 435,059. And for 2023, BYD delivered 1.575 million EVs, while Tesla's 2023 delivered 1.809 million EVs. Tesla's stock had soared 101.7% in 2023, while BYD's U.S.-listed shares gained 11.3%. In comparison, the iShares MSCI China ETF MCHI dropped 14.2% in 2023 while the S&P 500 index SPX advanced 24.2%. -Tomi Kilgore This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 01-02-24 1016ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}