{
    "title": "Telangana CM Revanth Reddy says state in talks to bring Tesla & BYD to \nHyderabad",
    "date": "1/22/2024",
    "url": "https://www.businesstoday.in/latest/corporate/story/telangana-cm-revanth-reddy-says-state-in-talks-to-bring-tesla-byd-to-hyderabad-414343-2024-01-22",
    "text": "Feedback Telangana CM Revanth Reddy, who is the first Congress CM of the state, has recently told a small group at the Indian High Commission in London that the state is trying to woo electric vehicle makers Tesla and BYD to set up their units. CM Reddy, of late has signed multicrore deals with conglomerates, such as the Adani Group, JSW, Tata Technologies, BL Agro, and others. The World Economic Forum has also agreed to set up its Centre for Fourth Industrial Revolution (C4IR) in Hyderbad. In July 2023, the Centre refused permission to Chinese EV maker BYD to establish a manufacturing unit in Hyderabad. Tesla has been expressing interest in entering India for more than two years, and Telangana's former Industry and Commerce minister KT Rama Rao had famously reached out to its CEO Elon Musk on social media, extending an invitation to the state. The Centre rejected BYD Motors' proposal on security grounds. BYD and Megha Engineering and Infrastructures had submitted a proposal to the Department for Promotion of Industry and Internal Trade (DPIIT) for the unit, which was worth $1 billion. BYD, the world's largest electric vehicle maker by sales, in its proposal had pitched to manufacture 10,000-15,000 electric cars a year. Megha Engineering and Infrastructures is a Hyderabad-based infrastructure company that has been involved in the construction of roads, bridges, and power plants.\nMegha was putting up the capital while BYD was putting in technology and know-how. On the other hand, Tesla is currently engaged in advanced discussions to enter the country and is considering the possibility of investing approximately $30 billion over the next five years. This investment would be directed toward establishing a manufacturing plant, developing a battery ecosystem, and supporting related industries. Tesla has also requested lower import taxes for electric cars. If the new EV policy of the Centre fulfills Tesla's requirement for a rebate on the existing import duty for foreign-made EVs, the company intends to initially introduce a limited range of its standard models to compete in the luxury car market in India, a report in Hindustan Times said. At the same time, Tesla will commence the development and testing of a charging ecosystem. Additionally, there is a possibility that Tesla might consider investing in a factory in India to manufacture its first compact car within the next two years, with the facility expected to be fully operational within three years. \"If the deal works out, Tesla will invest $3 billion in the plant and other partners in its manufacturing ecosystem will invest another $10 billion. In parallel, there will be another $5 billion investment in batteries that will grow to $15 billion. We are looking at a total of $30 billion,” said a person close to the company and involved in discussions on the project,\" sources quoted by HT said. The EV30@2030 campaign, initiated by the Ministry of Road Transport and Highways, seeks to achieve the target of having 30 per cent of newly registered private cars, 40 per cent of buses, 70 per cent of commercial cars, and 80 per cent of 2-wheelers and 3-wheelers as electric vehicles by 2030. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}