{
    "title": "Not even Tesla can dodge the EV sales slowdown",
    "date": "1/27/2024",
    "url": "https://www.businessinsider.com/elon-musk-tesla-avoid-ev-sales-slowdown-china-byd-2024-1",
    "text": "       Tesla just confirmed the market for electric vehicles really is slowing down. Elon Musk warned a slowdown in sales growth was coming when Tesla reported earnings on Wednesday. Or, as the EV maker tried to dress it up to investors, the company is now \"between two major growth waves.\" Tesla had some pluses to report, churning out almost 500,000 vehicles in the September to December period. Vehicle deliveries last year jumped 38% to 1.81 million. But that wasn't enough to stop the warnings. Revenue growth slowed, up 3% to $25.2 billion after years of breakneck expansion. Now, the outlook appears to be dimmer amid flailing demand. Tesla embarked on an aggressive price-cutting strategy in 2023 that reduced the prices of everything from the Model 3 to the popular Model Y by more than 25% to spur interest. Investors did not like what Tesla had to say, pushing its share price down more than 10% on Thursday, wiping more than $50 billion off its value. But against a backdrop of sharply higher inflation and interest rates, focus has been increasingly directed towards a cheaper mass-market EV from Tesla. One problem: it's not likely to arrive anytime soon. The \"next-generation\" sub-$25,000 vehicle will enter production in the second half of 2025, Musk said. That's several years after it was first touted — and reminiscent of the four-year gap between the Cybertruck being announced, and actually being delivered. Meanwhile, competition from China's BYD has become a major threat. The Warren Buffett-backed EV maker, which sells its vehicles in more than 60 countries and recently overtook Tesla on global EV sales, put an early focus on affordable models such as the $10,000 Seagull. Chinese automakers pose such a threat that they could \"pretty much demolish most other car companies in the world,\" Musk claimed, \"if there are no trade barriers established.\" Related stories Taken together, it explains why Tesla explicitly said sales growth would be \"notably lower\" this year – making it just the latest car maker to confront the wider slowdown in the developed world. Although a record 1.2 million EVs were sold in the US last year, per data from industry research firm Kelley Blue Book, a slowdown beyond Tesla is very real. EV sales surged 40% year-on-year in the last three months of 2023 —a \"strong result by any measure,\" as the industry research noted. However, it's lower than both the 49% rise in the third quarter, and 52% increase in the last three months of 2022. Aran Waid, senior analyst at Benchmark Mineral Intelligence, said growth in EV sales globally was continuing but that it had \"fallen short of automaker expectations.\" \"High inflation and interest rates have also impacted sales last year, particularly in Europe, while individual countries have also been reducing financial incentives,\" he said. Growth is happening then, but at an increasingly slower pace in a phenomenon that's hitting pure-play EV companies like Tesla, as well as traditional automakers. Ford, for example, said this month that it's cutting production of its F-150 Lighting truck due to poor sales. General Motors, meanwhile, said in October it was scrapping a target to produce 400,000 EVs by mid-2024. CEO Mary Barra said the company was \"adjusting to slowing near-term growth.\" Perhaps the clearest sign came when car rental company Hertz announced that it was selling some 20,000 EVs, citing higher repair costs as an issue. Tesla does have some advantages in the slowdown. As my colleague Nora Naughton notes, it can afford to keep cutting prices thanks to cost savings it gets from manufacturing. There are plenty of markets too that Tesla can target for rapid growth in the future, such as Japan. \"We should at least have a market share proportionate to, say, other non-Japanese carmakers like Mercedes or BMW, which we do not currently have,\" Musk said Wednesday. Selling more cars in a country like Japan won't come easy. Part of the challenge, Musk said, lies in a \"lack of awareness\" about Tesla in a nation very well served by its own automakers, such as Toyota, Honda, Suzuki, and Nissan. Meanwhile, the challenge of getting its mass-market vehicles on the road next year is likely to be monumental. As Musk said: \"We really need the engineers to be living on the line.\" Read next Jump to "
}