{
    "title": "Tesla Set for 550% Gain Despite Headwinds, Says Fund Manager - \nTeslaNorth.com",
    "date": "1/28/2024",
    "url": "https://teslanorth.com/2024/01/28/tesla-set-for-550-gain-fund-manager/",
    "text": " Tesla is currently the weakest stock on the Nasdaq 100 this year, facing slowing growth and shrinking profits. However, David Baron, a fund manager, is betting on a significant turnaround for Elon Musk’s company. Baron, managing the Baron Focused Growth Fund, is placing his confidence in Musk to navigate Tesla through these challenges. “While he may not be growing 50% a year as the company thought,” Baron said in an interview with Bloomberg, “this year in a tough environment he’s still growing volume by 15% to 20% per year and making us $7,000 per car of gross profit.” His optimism remains high despite Tesla’s recent warning of a “notably lower” growth pace this year, which led to a 12% drop in the stock. Tesla’s market value has seen a significant decrease, losing about $209 billion this month. Despite this, Baron’s fund, which saw a 28% growth last year, beating both the Russell 2500 Growth Index and the S&P 500, maintains strong faith in Tesla’s brand and future prospects. Baron expects Tesla’s stock to reach $1,200 by 2030, a 550% increase from its current level, and around $300 in about 12 months, a significant rise from Thursday’s close of around $183. In 2023, Tesla delivered 1.8 million cars, marking a 38% increase from the previous year. Wall Street analysts are projecting a 17% increase in unit sales for the current year. Tesla’s performance is a key component of Baron’s goal to grow his fund’s assets to $2 billion this year from $1.3 billion as of December 31. Baron’s investment philosophy, echoing his father and Wall Street veteran Ron Baron, focuses on companies whose leaders have significant stakes and the potential to double market value in five to six years. This approach reflects a compounded growth of 15% per year. “We are OK if that capital is not generating a return for the company in the near-term, as long as we believe there is a path to generating strong returns over time,” David Baron stated, emphasizing his long-term investment strategy. The fund’s performance is partly attributed to its substantial holdings in Tesla and SpaceX, Musk’s privately held space and satellite company, valued at more than $175 billion. David Baron projects SpaceX’s valuation to rise 20% in a year, double within three years, and triple within five. However, Tesla’s current market situation raises concerns among investors. Analyst Toni Sacconaghi from Sanford C. Bernstein noted, “More investors are beginning to increasingly question the company’s growth narrative.” He added that while Tesla bulls often cite innovation as a sustaining factor for the company’s cost advantage and strong margins, “the counterargument is that the automotive industry is hyper-competitive, and carmakers have historically been unable to sustain cost advantages.” Despite the challenges, Baron remains focused on companies with leaders significantly invested in their businesses and the capacity for substantial market value growth, with Tesla and Musk being central to his portfolio. “His interests are aligned with ours,” Baron asserted. “He’s not going to do anything stupid to change the trajectory of the companies.” "
}