{
    "title": "Cathie Wood buys Tesla shares just as Wall Street’s view dims",
    "date": "1/4/2024",
    "url": "https://www.moneycontrol.com/news/world/cathie-wood-buys-tesla-shares-just-as-wall-streets-view-dims-11998561.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Cathie Wood has started buying Tesla Inc. shares after selling them for most of last year. Her purchases come at a time when Wall Street’s outlook on the electric-vehicle maker is darkening rapidly. Funds operated by Wood’s firm Ark Investment Management LLC have bought about 216,000 shares of the company over investments made on Dec. 20 and Jan. 3, according to Ark’s daily trading data compiled by Bloomberg. Before the current buying streak, Ark had largely sold shares in the EV maker for three straight quarters. Analysts’ overall view on Tesla is fast deteriorating as an EV slowdown looms, government incentives are drying up and Chinese rival BYD Co.’s cheaper models are threatening its leadership position in electric cars. Tesla shares fell 4% to close at $238.45 on Wednesday.  The 12-month forward consensus profit estimate for Tesla has dropped more than 20% over the past year compared to a rise of 6% in the same metric for the S&P 500 Index, according to data compiled by Bloomberg. The EV maker’s consensus analyst rating is near its lowest score in almost two years. While the industry’s growth is expected to slow down and China’s is on track to become the world’s largest passenger car exporter, Wood believes Tesla is primed to grab more market share as peers like General Motors Co. and Ford Motor Co. step back from their EV plans due to profitability concerns. “There is more share for Tesla and others who choose to go for it,” Wood said on Bloomberg TV last week. Ark’s analysis of Tesla yields a price estimate of $2,000 per share in 2027, while its bull and bear cases come in at $2,500 and $1,400 per share, respectively, the investment management firm reiterated in a year-ender email to its subscribers. Ark’s flagship fund has risen 59% over the last 12 months compared to a gain of 51% for the Nasdaq 100 Index. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}