{
    "title": "Tesla stock, market cap take big hit as Red Sea attacks halt factory",
    "date": "1/12/2024",
    "url": "https://qz.com/tesla-stock-berlin-factory-red-sea-attacks-1851162811",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Caught in the crossfire of Red Sea attacks, EV maker Tesla took a big stock hit Friday (Jan. 12) after the company said its Berlin factory will grind to a halt for two weeks starting Jan. 29, primarily because of attack-related shipping disruptions. The company’s stock closed down almost 3.7%, at $218.89, as shipping routes between Europe and Asia remained snarled from attacks on ships  by Iranian-backed Houthi militants. “The considerably longer transportation times are creating a gap in supply chains,” Tesla said in a statement to Reuters. The one-day stock drop was enough to cost the company almost $36 billion in market value, down to $685.7 billion. The Red Sea conflict has delayed components for assembling Tesla vehicles. While the company has not disclosed which or how many parts have been disrupted, analysts at asset manager Baird estimate the delays will affect the production of up to 14,000 Teslas, according to CNBC. It is not clear when transport along the Suez Canal, which accounts for 12% of global shipping volumes, will resume. But Tesla said production would be back on Feb. 12. However, the disruption means a cumulative loss of trillions of dollars as many companies continue to halt transportation along the canal. The global shipping industry was valued at over $14 trillion in 2019, according to the International Chamber of Shipping, with many Europe-Asian routes run through the Suez. Shipping companies started avoiding the route last month. But ship attacks are just part of Tesla’s stock woes. The automaker’s value is also plunging thanks to aggressive EV price cuts in China, rising US interest rates, and Hertz’s recent decision to dump EVs for gasoline cars. In response to reduced prices in China, Tesla dropped Model Y and Model 3 prices by between 3% and 6% on Jan. 11, on the heels of a series of price reductions last year. Tesla’s Shanghai factory, which also produces EVs for the European market, is set to close operations for a week to celebrate China’s annual Lunar New Year holiday, which runs from Jan. 21 to Feb. 20. A market anticipation for reduced car sales during this period could slump Tesla’s stock further. The Red Sea disruption  comes at a difficult juncture for Tesla: The company has been navigating a tense labor dispute with Swedish trade union IF Metall churning since last November. This will potentially amplify the impact of the production hiatus. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}