{
    "title": "Trending tickers: Apple | Tesla | AstraZeneca | Hugo Boss",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/apple-tesla-astrazeneca-hugo-boss-trending-tickers-115822063.html",
    "text": "Apple stock was trading 1.6% lower in premarket trading on Tuesday, just days after the news that it had fallen from the top spot as the world's most valuable company. Tech behemoth Microsoft (MSFT) now holds the crown after myriad investments in its AI business. Apple has been plagued with worries about iPhone demand, with its shares paying the price of the unease. The company had rallied 48% in 2023. Shares in the electric carmaker Tesla were down 2.1% in premarket trading as Elon Musk, the chief executive, took to his platform, X, to make the case for a greater share of voting power. \"I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control,\" he wrote. \"Enough to be influential, but not so much that I can’t be overturned.\" Read more: FTSE 100 and European stocks fall as Trump wins landslide in Iowa \"Unless that is the case, I would prefer to build products outside of Tesla,\" he said. \"You don’t seem to understand that Tesla is not one startup, but a dozen. Simply look at the delta between what Tesla does and GM (GM). As for stock ownership itself being enough motivation, Fidelity and other own similar stakes to me. Why don’t they show up for work?\" I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control. Enough to be influential, but not so much that I can’t be overturned.Unless that is the case, I would prefer to build products outside of Tesla. You don’t seem to understand… — Elon Musk (@elonmusk) January 15, 2024 Drugmaker AstraZeneca was among the top fallers in the FTSE 100 (^FTSE) on Tuesday, even as it announced that it had not had shipping disruptions due to military confrontations in the Red Sea. Stock was around 3.1% lower by mid-morning in London. Hugo Boss stock plunged more than 11% on Tuesday, leading losses in the Stoxx 600 (^STOXX), as it missed earnings targets for the year. Its full-year sales were at record levels, climbing 15% to €4.2bn (£3.6bn). This failed to sweeten the deal for investors, however, as preliminary pre-tax earnings of €121m missed consensus expectations of €129m. Read more: Stocks that are trending today The brand is one of many luxury retailers facing challenging market conditions. UK-listed Burberry (BRBY.L) stock fell on Monday after its Christmas sales figures failed to wow. Download the Yahoo Finance app, available for Apple and Android. Related Quotes "
}