{
    "title": "Why did Tim Cook's pay package hold up in court while Elon's failed?",
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/news/why-did-tim-cook-pay-222112357.html",
    "text": "Just a week after Elon Musk’s $55 billion Tesla payday was struck down by a Delaware judge, a New York court dismissed a challenge to Apple CEO Tim Cook’s compensation package, which clocked in at under $100 million. Some coincidence. At face value, the two cases seem to have a lot in common. Both were shareholder suits waged against some of the highest-paid superstar tech CEOs in the world. And both were filed amid a backdrop of increased public scrutiny over executive compensation in recent years, which is near all-time highs across S&P 500 companies. But for all their similarities, from a legal standpoint the two cases are apples and oranges—and Cook was always going to stand a better chance of holding on to his paycheck. Elon Musk’s $55 billion compensation package at Tesla made headlines last month after Delaware chancellor Kathaleen McCormick ruled in favor of a shareholder who argued that Tesla was paying its CEO an unfairly high amount with the moonshot grant. Plaintiff Richard Tornetta argued that because Musk wields so much power at Tesla and maintains close relationships with his board members, the supposedly independent board of directors’ vote approving his massive pay scheme was anything but. “Chancellor McCormick found that the process for setting Elon Musk’s pay was essentially controlled by Elon Musk,” said Tulane University law professor Ann M. Lipton in an interview with Fortune. “The board didn’t engage in any kind of pushback or real bargaining.” In response, Musk has threatened to relocate Tesla from Delaware (where almost 70% of Fortune 500 companies are incorporated) to Texas, where a more favorable political climate could leave him less exposed to these types of challenges. While the Musk case was focused on a broad, more abstract legal question related to the Tesla board of directors’ degree of independence, the Cook case resolved yesterday was much simpler. “The question before Delaware [in the Musk case] was simply, ‘Was the pay substantively unfair?’ whereas the question in the Tim Cook case was solely, ‘Was the proxy statement misleading?’” said Lipton. The Teamsters’ pension fund sued Apple last year, arguing that the company had misled investors by misrepresenting Cook’s 2021 and 2022 pay in its proxy statements and paying him more than it had initially proposed. Because Cook and other Apple executives are primarily paid in equity known as RSUs, the company enlists financial models to estimate what Cook’s actual pay will be for shareholders’ approval each year. (For CEOs, being compensated primarily with stock isn’t uncommon. Mark Zuckerberg famously earns just $1 in annual salary, but he’s made billions through Meta stock grants included in his compensation package. The Economic Policy Institute found in a report last year that stock-related pay accounts for over 80% of CEO compensation.) The pension fund that sued Cook argued that Apple misrepresented its CEO’s actual compensation package by downplaying the value of his equity. Cook and other Apple executives netted over $90 million in compensation for 2021 and 2022, higher than the $77.5 million estimate the company initially asked shareholders to vote on for approval. (Both of those figures are well below Cook’s current annual compensation; at his own request, the Apple CEO took a 40% pay cut last year. That change was approved by shareholders and the Apple board’s compensation committee, which counts former Vice President Al Gore as one of its members.) The plaintiffs claimed that Apple used an unusual financial model to artificially deflate Cook’s pay estimate, and also buried the compensation tables in a drab, gray section of the proxy statement, where shareholders would be less likely to notice it before casting their Say-on-Pay votes. The court didn’t buy it. “What happened with Tim Cook is very common in public companies,” said Marc Hodak, partner at executive compensation consultancy Farient Advisors. “They award performance shares based on the face value of the stock. And each of those performance share units has a market value that’s higher than the face value stock at the time of grant.” One key difference between the two cases was the size of the contested pay package. Musk’s $55 billion award from Tesla was part of the largest compensation plan in corporate history. While Cook’s $100 million annual pay is by no means a small sum, it’s on par with his peers. In fact, Apple uses a group of its competitors, including Meta, Netflix, Visa, and Cisco, to benchmark its executives’ compensation. (Notably, it added Tesla to that peer group last year.) “I don’t have any question that the size and scale of [Musk’s] pay package was a driver, both in terms of the litigation and the decision that we saw,” said Hodak. “[$55 billion] is automatically going to attract an unusual amount of scrutiny.” Taken together, these two cases do seem to hint at a broader trend toward greater scrutiny of bloated CEO pay—but Lipton advised against reading the tea leaves prematurely. “Elon Musk is beating this drum that everyone should leave Delaware, to suggest that somehow this is a trend,” said Lipton. “I think this is an Elon Musk problem. That Tim Cook thing, it was a different law. It was a different argument.” Representatives from Apple did not immediately respond to a request for comment. This story was originally featured on Fortune.com Related Quotes "
}