{
    "title": "Tesla critic buys Super Bowl ads urging Tesla boycott over Autopilot - The \nWashington Post",
    "date": "2/11/2024",
    "url": "https://www.washingtonpost.com/technology/2024/02/11/tesla-super-bowl-ads/",
    "text": "A California tech entrepreneur is paying more than half a million dollars for Super Bowl ads criticizing Tesla for not disabling its Autopilot technology outside the conditions for which it was designed, a problem highlighted by a Washington Post investigation this past fall and later cited in a recall of virtually every U.S. Tesla equipped with Autopilot, around 2 million vehicles. It’s the second consecutive year Tesla critic Dan O’Dowd has run an ad campaign on television’s biggest night. He leads the Dawn Project, a group that has sought a ban on Tesla’s driver-assistance technology. The latest campaign is unequivocal: “Boycott Tesla,” it says, following footage of deadly and severe crashes involving its vehicles. One ad features footage of Teslas running over child-size mannequins, depictions that have previously led Tesla to issue a cease-and-desist letter. O’Dowd said he was compelled to bring awareness to the latest issue with what he calls “the most incompetent software I’ve ever seen” in part by The Post’s investigation. O’Dowd founded Green Hills Software, which makes operating systems for cars and airplanes. “What possible reason is there that they don’t disable Autopilot on roads that they say are not safe?” he asked of Tesla. Tesla and its chief executive, Elon Musk, did not respond to a request for comment. Musk’s followers have accused O’Dowd of a conflict of interest because one of Green Hills Software’s customers is Mobileye, which develops driver-assistance software. O’Dowd says his motivation stems purely from concerns over Tesla’s tech. Tesla maintains that its software is intended to be used by a fully attentive driver and argues that it is “morally indefensible not to make these systems available to a wider set of consumers,” citing figures it says show a lower prevalence of crashes when its software is activated. “The people would have it banned if they only knew the truth, if they only understood what it would do,” O’Dowd said. “Well, that’s our job. The politicians aren’t going to move until the public moves.” The two ads highlight three significant crashes alleged to have involved Autopilot. In one, a 17-year-old was severely injured when a Tesla struck him at 45 mph as he disembarked a school bus in North Carolina that had its stop sign out and warning lights flashing. “Still Tesla does nothing,” the ad concludes. “Boycott Tesla to keep your kids safe.” The ad makes reference to prior Dawn Project videos depicting the alleged failure of Teslas to react to child-size mannequins in the road — including last year’s Super Bowl commercial, which aired weeks before the North Carolina crash. The other ad set to air during this year’s game shows the crash that killed a 50-year-old father in 2019 when his Tesla drove under a semi-truck trailer and the moment a Tesla blew through a stop sign and blinking lights on a rural Florida road as it barreled toward a parked vehicle and flung a young couple into the air, killing one of them and leaving the other severely injured — footage first published by The Post. In both cases, Autopilot was operating in locations where it was not intended to be used. “Tesla dances away from liability in Autopilot crashes by pointing to a note buried deep in the owner’s manual that says Autopilot is only safe on freeways,” the commercial opens, pointing to federal pleas to restrict it. “Shockingly, Tesla refused,” the commercial continues, leading into footage of the semi-truck crash and the crash involving the young couple. “This caused many tragic accidents when Autopilot was enabled on roads where Tesla knows it isn’t safe. Tesla must be held accountable. Boycott Tesla to keep your family safe.” O’Dowd’s group said the ads are airing in D.C., California, Delaware and Michigan. Musk took last year’s Super Bowl attention in stride. “This will greatly increase public awareness that a Tesla can drive itself (supervised for now)” he tweeted about last year’s ad. The company is facing concerns over stagnating revenue, mounting worries about its capacity to deliver long-promised “Full Self-Driving” technology, and Wall Street hand-wringing over the persistent distraction of its mercurial CEO. It has shed billions in value, down around 15 percent just in the past month. Musk has asked for a larger stake in the company as a condition for “growing Tesla to be a leader in AI & robotics,” saying that without 25 percent control he “would prefer to build products outside of Tesla.” But some investors have not given the idea a warm reception. In January, a Delaware judge ruled that an unprecedented $56 billion pay package awarded to him in 2018 was unfair. "
}