{
    "title": "Tesla moves into new Bicester technology park building",
    "date": "2/10/2024",
    "url": "https://www.oxfordmail.co.uk/news/24110240.tesla-moves-new-bicester-technology-park-building/",
    "text": "Tesla is setting up its first Oxfordshire site at a technology park in Bicester, alongside an undisclosed design and manufacturing company. The automotive company will take up 24,000 sq ft, at Albion Land's Catalyst Bicester park while the unnamed firm will inhabit 29,600 sq ft. The new tenants are part of the site's phase two, with their bespoke units now finalised and handed over. The new occupants will join Evolito, an aerospace company, and Yasa, an EV motor company, which Mercedes Benz owns, at the site. READ MORE: Warning to drivers as 29 flood alerts in place in Oxfordshire Positioned off the southern gateway to the town off the A41, Catalyst Bicester also hosts a David Lloyd Leisure facility and a Holiday Inn hotel. To date, six buildings have been constructed and occupied or handed over, with an additional two under construction, set to be finished by the summer. The anonymous design and manufacturing firm has also pledged to occupy building seven, intending to make Catalyst Bicester its central technological facility. Building eight, with a footprint of 38,710 sq ft, is under construction as a speculative project due to the demand from the technology sector. Once completed, Catalyst Bicester will hold more than 400,000 sq ft of hybrid structures designed for advanced manufacturing sectors and technology. Simon Parsons, director of Albion Land, said: \"Momentum is building at Catalyst Bicester with the park’s excellent blend of occupiers, location, power, amenity, and facilities. \"It’s a sign of the strength of the park and the location that both Tesla and a further tech-driven design and manufacturing company have chosen Catalyst Bicester and we look forward to attracting more occupiers in the next phase of development. \"We expect our speculative building eight to let readily and look forward to bringing forward further phases of development in 2024 to meet sustained occupier demand.\" Catalyst Bicester already has \"full and implementable\" planning permission in place as well as substantial secured power connections. It can accommodate occupier requirements of up to 120,000 sq ft and offer certainty on handover dates. CBRE and Colliers International acting for Albion Land, Knight Frank representing Tesla, and Savills working on behalf of the anonymous design and manufacturing company are the letting agents involved in the deal. As a town with significant road and rail linkages, Bicester's progress and its impending connection to the Oxford-Cambridge East West Rail line contribute to the interest in this town, according to Albion Land. Work on Catalyst Bicester, a £1000 million project, started in 2021. At that point, its developers said it would provide workspace for up to 1,750 new jobs. We want our comments to be a lively and valuable part of our community - a place where readers can debate and engage with the most important local issues. The ability to comment on our stories is a privilege, not a right, however, and that privilege may be withdrawn if it is abused or misused. Please report any comments that break our rules. Last Updated: Are you sure you want to delete this comment?  © 2001-2024.  Newsquest Media Group Ltd, 1st Floor, Chartist Tower, Upper Dock Street, Newport, Wales, NP20 1DW  | 01676637 | Data returned from the Piano 'meterActive/meterExpired' callback event. As a subscriber, you are shown 80% less display advertising when reading our articles. Those ads you do see are predominantly from local businesses promoting local services. These adverts enable local businesses to get in front of their target audience – the local community. It is important that we continue to promote these adverts as our local businesses need as much support as possible during these challenging times. "
}