{
    "title": "Tesla cancels $16000 pie order last minute leaving bakery 'high and dry'",
    "date": "2/23/2024",
    "url": "https://www.indy100.com/news/tesla-bakery-order-cancelled",
    "text": "Join the news democracyWhere your votes decide the Top 100 Elon Musk's Tesla has been blasted for cancelling a $16,000 (£12,700) pie order and cancelling as it was set to leave for delivery. The small California bakery, The Giving Pies, was left \"high and dry\" when Tesla's 2,000 mini pie request fell threw. Owner Voahangy Rasetarinera claimed the company reached out on Valentine's at short notice, asking for the pies to be delivered the following week. She shared the email exchange between herself and the Tesla staff with ABC7. Tesla reportedly didn't pay her upfront. \"I'm like, 'Okay, I'm gonna wait, you know, and they are professional, they are a big company. So once it's approved, it's approved,'\" she explained to the outlet. Shortly after 9pm the following day, a Tesla representative apologised for the delayed payment because they believed the vendor was \"kind of new.\" They proceeded to ask: \"Can we double the order?\" Rasetarinera and her staff took on the large request and worked endlessly to get the job done. She bought more ingredients and turned down other orders – still, with no payment from Tesla. It was then she received a text message from a Tesla contact, which read: \"It unfortunately sounds like we will be changing plans and will not be needing this order. Thank you so much for your support I appreciate it.\" Rasetarinera later shared the experience in an Instagram post titled: 'How Tesla's actions hurt my small Black women-owned business.\" See on Instagram While doing an interview, Tesla finally reached back out to the bakery owner. They reportedly said it was a case of \"miscommunication\" and that \"Laura had no authority to promise any payment.\" They offered to find a way to still buy pies from The Giving Pies, but Rasetarinera is still unsure. Indy100 reached out to Tesla for comment How to join the indy100's free WhatsApp channel Sign up for our free Indy100 weekly newsletter Have your say in our news democracy. Click the upvote icon at the top of the page to help raise this article through the indy100 rankings. "
}