{
    "title": "Tesla May Begin Construction of Giga Mexico in March, Governor Says",
    "date": "2/19/2024",
    "url": "https://driveteslacanada.ca/news/tesla-may-begin-construction-of-giga-mexico-in-march-governor-says/",
    "text": "Tesla could begin construction of Giga Mexico in March this year, the state governor said. He noted that he spoke with the company’s management and they told him that they were ready to lay the first stone. During his speech at the event “From San Bernabé to Bernabeu 2024. World Challenge Madrid 2024” at the Civic Center in the western region of Monterrey, the governor of Nuevo León, Samuel García, said that he had spoken with Tesla management regarding the construction of Giga Mexico. The company was previously expected to begin construction in February, but it has become clear that it will begin no earlier than in March. “We have a queue, just look, of the best companies in the world that want to come to Nuevo León. Today I spoke with the director of Tesla… and they promised that… they would begin construction and improvement. The second largest company in the world has already knocked on the door and wants to come, the largest automobile company in the United States also wants to come,” the governor said, according to Milenio. García said the state has already begun building infrastructure for Giga Mexico. He said Tesla has extensive plans for the manufacturing facility that are already exceeding the original plan. Because of this, the company requested an extension of the environmental permit. “Today I spoke with… the leadership of Mexico and [there is] already a problem with electricity, there is a problem with water… they have asked for an extension of the environmental permit because it seems that the factory will be larger than they thought,” said the governor. It is worth noting that Tesla has not made a direct statement that it will begin construction of Giga Mexico in March. Rather, the company’s management did not say “no” to the request to begin construction no later than March of this year. “I told him that since the state is already building roads and access roads, I asked them to come no later than March to make a groundbreaking announcement and they did not say “no,” so I hope very soon, in less than a month, Tesla will come and take over the project,” García said. The governor also said Tesla initially considered Pachuca as a location to build Giga Mexico. He noted that if it were not for the convincing work of the Undersecretary of Foreign Investment of the Ministry of Economy, Emmanuel Loo, the mega-investment of the electric vehicle manufacturer would not have been made in Monterrey. “When we went to visit Tesla, they suggested going to Pachuca, and Monterrey wasn’t on their radar…Elon Musk was going to go to Pachuca and was going to go back to Austin (Texas, US). And if it weren’t for this man (Emmanuel Lu), he would not have made it to Monterrey, and if he had not seen Monterrey with his own eyes, Tesla would not have made it there,” García said. Queensland to transform former coal plant with $330 million Tesla Megapack system Fisker served with notice of non-compliance by the NYSE The politics of low earth space orbits and specific spectrum bands for internet services are starting to heat up. The 5G for 12 GHz Coalition has accused SpaceX of running a public misinformation campaign. The […] Volkswagen has secured an exclusive funding contract with the Canadian government to assist in their investment to build EV batteries in St. Thomas, Ontario. According to reporting by the Toronto Star, the contract is worth […] Tesla has had another strong month of sales in China in February, giving the automaker over 116,000 in the first two months of the year alone. According to the latest figures from the China Passenger […] Enter your email address to subscribe to Drive Tesla and receive notifications of new articles by email. Email Address Subscribe "
}