{
    "title": "Forest near Tesla factory occupied by 80 activists",
    "date": "2/29/2024",
    "url": "https://www.breakinglatest.news/business/forest-near-tesla-factory-occupied-by-80-activists/",
    "text": "Panorama protest against expansion As of: 08:21 a.m. | Reading time: 2 minutes The Tesla Gigafactory Berlin-Brandenburg plant Source: Patrick Pleul/dpa You can listen to our WELT podcasts here In order to display embedded content, your revocable consent to the transmission and processing of personal data is necessary, as the providers of the embedded content require this consent as third party providers [In diesem Zusammenhang können auch Nutzungsprofile (u.a. auf Basis von Cookie-IDs) gebildet und angereichert werden, auch außerhalb des EWR]. By setting the switch to “on”, you agree to this (revocable at any time). This also includes your consent to the transfer of certain personal data to third countries, including the USA, in accordance with Art. 49 (1) (a) GDPR. You can find more information about this. You can revoke your consent at any time using the switch and privacy at the bottom of the page. A majority of citizens in Grünheide have spoken out against the planned expansion of the Tesla factory – an activist group has now occupied the area of ​​forest that was intended for the expansion. You don’t trust that politicians will adhere to the people’s vote. Around 80 activists from the “Stop Tesla” initiative have occupied a forest near the company’s car factory in Grünheide to protest against the planned factory expansion. They also want to support the vote of the citizens of Grünheide, who voted against the corresponding development plan in a residents’ survey, as the initiative announced on Thursday. The group built tree houses on the approximately 120 hectare forest that is to be cleared to expand the site. Environmental activists said the occupation near Fangschleuse train station was planned for an indefinite period of time. “Our main concern is the drinking water protection area,” said activist Caro Weber of the German Press Agency. The initiative does not trust that politicians will follow the will of the residents, since the existing plant was already built with special permits. Part of the Tesla site is located in the drinking water protection area. Tesla also built its factory using early approvals. also read The company’s expansion plans for the car factory were largely rejected by the citizens of Grünheide. Almost two thirds voted against the plans last week. The vote is not legally binding. The local council still has to approve a development plan. The electric car manufacturer wants to build a freight station, warehouses and a company kindergarten in addition to the existing 300-hectare factory site. To achieve this, more than 100 hectares of forest will be cleared. Conservationists and citizens’ initiatives, among others, are against the expansion.     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}