{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.wionews.com/world/musks-illegal-drug-use-silence-of-board-and-money-ties-with-directors-what-wsjs-new-report-claims-687186",
    "text": "The relationship between Musk and his directors was disclosed by the publication a month after another report claimed that the billionaire's excessive drug habit had affected his work Elon Musk's habit of taking \"illegal drugs\" has been known to some serving and former directors of Tesla and SpaceX but none took any action as they didn't want to lose the social currency that the billionaire's circle brought, a report in the Wall Street Journal has claimed. Several directors at Tesla and SpaceX have money ties with Musk which may have bought their silence on his drug issues. The Tesla CEO has reportedly invested in entities linked to venture capitalists Antonio Gracias, Ira Ehrenpreis, tech magnet Larry Ellison and former media executive James Murdoch. In turn, these people have invested money in at least one of six companies belonging to Musk (Tesla, SpaceX, The Coring Co., X, Neuralink and xAI). Notably, Ellison, while being a director, also owned a significantly sizeable 1.5 per cent stake in Tesla as of 2022. Apart from investments, the newspaper claimed that Musk also provided career support to the likes of  Steve Jurvetson, who stepped down from his firm DFJ Venture Capital in 2017 after being accused of sexual harassment. Despite the allegations, Tesla retained him as an independent director till he resigned in 2020 \"Some current and former Tesla and SpaceX directors have knowledge of Musk’s illegal drug use but haven’t taken public action, according to people who have witnessed the drug use or were briefed on it,\" the newspaper reported. Watch | Elon Musk takes Ketamine for depression and parties?  The relationship between Musk and his directors was disclosed by the publication a month after another report claimed that the billionaire's excessive drug habit had affected his work. At the time, Musk responded to the report by taking to X and suggesting \"not even trace quantities\" of drugs were found in his system. Also read | Elon Musk testifies in second day of Tesla tweet trial; says buying share at $420 was no joke The Tesla founder was responding to an excerpt from the report where the publication questioned Musk's behaviour after smoking marijuana at Joe Rogan's popular podcast show in 2018. The report added that Musk's conduct had resulted in employees at SpaceX being randomly tested for drugs. \"After that one puff with Rogan, I agreed, at NASA’s request, to do 3 years of random drug testing. Not even trace quantities were found of any drugs or alcohol,\" said Musk. \"@WSJ is not fit to line a parrot cage for bird sh*t,\" he added. Musk's attorney Alex Spiro, confirmed to WSJ that the billionaire had never failed a drug test, adding that the newspaper's report included 'false facts', without disclosing what they were. (With inputs from agencies) "
}