{
    "title": "Tesla's Post-Earnings Plunge Pulls Elon Musk's Net Worth Below $200B — How \nClose Is Jeff Bezos To World's",
    "date": "1/26/2024",
    "url": "https://www.benzinga.com/markets/equities/24/01/36796973/teslas-post-earnings-plunge-pulls-elon-musks-net-worth-below-200b-how-close-is-jeff-bezos-to-wor",
    "text": "Tesla, Inc. TSLA shares witnessed a significant plunge on Thursday as investors opted for a sell-off, driven by concerns over the EV maker’s future outlook. What Happened: The decline also impacted CEO Elon Musk‘s net worth, sliding by $18 billion or 8.3% to $198 billion by the close of trading on Thursday, marking the first time since late October that the billionaire’s wealth fell below this level, as per Bloomberg’s Billionaire’s Index. The primary catalyst for Musk’s wealth erosion was Tesla’s fourth-quarter results, which fell below Street expectations. The company’s guidance indicating significantly lower volume growth for 2024 contributed to the negative sentiment. During the earnings call, Musk and his management team emphasized long-term revenue and margin-driving projects without providing clear insights into near-term fundamentals. Despite the stock plunge, it’s noteworthy that Musk remains the world’s wealthiest man, even as his net worth experienced a significant decline. Trailing behind Musk in the billionaires’ list is Jeff Bezos, whose net worth stood at $183 billion at Thursday’s close. See Also: Everything You Need To Know About Tesla Stock Why It Matters: It’s crucial to recognize that a substantial portion of Musk’s wealth is intricately tied to Tesla, with additional contributions from his ownership in ventures like SpaceX, Starlink, The Boring Company, and the social media platform X, acquired in October 2022. As of May 2023, Musk owned 411,062,076 Tesla shares, constituting just under a 13% stake in the company. If he exercises options vested with 303,960,630 shares, his stake could exceed 20%. Musk has been clamoring for greater control in Tesla to make the company into an AI and robotic powerhouse. This month, he expressed his desire for a 25% voting control in the company. Musk justified this request by suggesting that proxy advisory firms could potentially take control of the company, thereby endangering its technological trajectory. In contrast, a significant part of Bezos’ net worth is derived from his stake in Amazon. The e-commerce giant is set to report its quarterly results, and a strong performance could potentially boost Amazon’s stock, positively impacting Bezos’ overall wealth. As Tesla enters a low-growth phase and faces challenges in its strategies and macro fundamentals, the stock may continue to be under pressure in the near to medium term. Tesla ended Thursday’s session down 12.13% at $182.63, according to Benzinga Pro data. Read Next: Elon Musk’s Worst Fear Is About Proxy Firms Seizing Control Of Tesla: ‘Just Want To Be An Effective Steward Of Very Powerful Technology’ Photos by lev radin and Kathy Hutchins on Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}