{
    "title": "BYD senior exec taunts Musk that Tesla will lose market share and face \nchallenges in its AI self-driving system",
    "date": "1/24/2024",
    "url": "https://fortune.com/asia/2024/01/24/byd-senior-exec-taunts-musk-tesla-lose-market-share-face-challenges-ai-self-driving-system/",
    "text": "A senior executive at BYD Co. has stoked the Chinese automaker’s rivalry with Tesla Inc., warning Elon Musk that he’ll face challenges in intelligent driving systems. BYD is “very strong now,” Zhao Changjiang, the head of sales for the firm’s Denza joint venture with Mercedes-Benz AG, wrote on Chinese social media platform Weibo on Wednesday, saying he was responding to a comment made online earlier this month. While Zhao didn’t name Tesla or Musk specifically, he appeared to make reference to a post made by Musk on his X platform in early January. In his response to a discussion comparing Tesla and BYD, Musk said his company was an artificial intelligence firm, not an automaker. Tesla is an AI/robotics company that appears to many to be a car company Zhao also warned Tesla may lose market share. “You’ll face serious challenges in advanced driver-assistance system and car models in 2024, such as Denza’s N7 changing the landscape of the auto market and triumph over the ‘Y’ model!” Zhao said, referring to Tesla’s sports utility vehicle crossover, the Model Y. BYD’s rapid ascent has seen it threaten Tesla’s long-held title as the world’s biggest EV maker. The Shenzhen-based company outsold Musk’s firm for the first time ever in the fourth quarter, though hasn’t yet managed to repeat the feat across a full year. Tesla, which is due to report results after the market close on Wednesday, is facing growing pressure from stalling global demand for EVs and needing to maintain margins. It slashed prices in China as competition in the world’s biggest auto market continues to intensify, while doubts from investors saw more than $94 billion wiped from its market valuation in just the first two weeks of this year. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}