{
    "title": "Tesla missed out on $300M profit after Bitcoin sales",
    "date": "1/27/2024",
    "url": "https://cointelegraph.com/news/tesla-missed-out-300m-profit-bitcoin-sales",
    "text": "Elon Musk’s auto company has liquidated 70% of its Bitcoin portfolio to date yet exhibits caution in letting go of the remaining holdings. Own this piece of crypto history Tesla’s refusal to “hodl” Bitcoin (BTC) have resulted in a missed opportunity of over $300 million in profits. Tesla’s initial foray into Bitcoin began in February 2021 with a groundbreaking $1.5 billion investment. At the time, BTC’s price was around $36,000. Since the first reported BTC balance on Feb. 8, 2021, Tesla’s stock price is down roughly 40% against Bitcoin, specifically: However, in a surprising turn, Tesla sold about 10% of its holdings in March 2021. Then, in the second quarter of 2022, the company sold approximately 75% of its Bitcoin reserves. As Tesla CEO Elon Musk noted, these sales intended to demonstrate Bitcoin’s liquidity and to bolster Tesla’s balance sheet during uncertain financial periods. Had Tesla retained its entire Bitcoin investment, the company could have seen a hypothetical profit of over $300 million, considering the current Bitcoin value of approximately $41,500. Nonetheless, the company’s remaining Bitcoin holdings, estimated at around 9,720 BTC, have remained steady in recent quarters, reflecting a more conservative approach in what traders anticipate to be a bullish year for Bitcoin. Tesla still holds 9,720 #Bitcoin worth $385m and did not sell anyone Q4, 2023. pic.twitter.com/lFFBy6v9I4 Interestingly, Tesla’s previous Bitcoin sales appeared in the quarters reporting weaker free cash flows. It is the cash that a company generates after spending the money required to maintain or grow its business operations. For example, in the first quarter of 2021, Tesla’s sale of Bitcoin, valued at $272 million, constituted a staggering 93% of the company’s free cash flows during that period. Similarly, in Q2 2022, Tesla’s 73% reduction in free cash flows coincided with its Bitcoin sales. Related: X launches dedicated payments account, crypto community speculates In simple words, Musk relied on BTC to bolster finances during Tesla’s tighter cash periods. He may not need to employ the same strategy now, however, given Tesla’s increasing free cash flows throughout 2023. In Q4, 2023, for example, Tesla’s free cash flow was strong at $2.1 billion, contributing to a total of $4.4 billion for the year. $TSLA Tesla Q4 FY23:• Revenue +3% Y/Y to $25.2B ($0.6B miss).• Gross margin 18% (-6pp Y/Y).• Operating margin 8% (-8pp Y/Y).• Capex +24% Y/Y to $2.3B.• Free cash flow +45% Y/Y to $2.0B.• Non-GAAP EPS $0.71 ($0.03 miss).• Deliveries +20% Y/Y to 485K.• FY24: Volume… pic.twitter.com/pnOzZkCAde Numerous analysts forecast a rise in Bitcoin’s value in 2024, attributing their optimism to the approval of spot Bitcoin exchange-traded funds in the United States and the anticipated impact of the upcoming Bitcoin halving event as key drivers behind their predictions. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. Add reaction Add reaction "
}