{
    "title": "SHARE OF THE WEEK: Elon Musk under pressure to produce a solid set of \nfourth quarter results at Tesla",
    "date": "1/19/2024",
    "url": "https://www.thisismoney.co.uk/money/investing/article-12984551/SHARE-WEEK-Elon-Musk-pressure-produce-solid-set-fourth-quarter-results-Tesla.html",
    "text": "By City & Finance Reporter Updated:  21:50 GMT, 19 January 2024   View  comments  Elon Musk is under pressure to produce a solid set of fourth quarter results at Tesla next week after an iffy start to the year. Shares in the electric car giant – one of the so-called Magnificent Seven alongside Apple, Microsoft, Google-owner Alphabet, Amazon, Nvidia and Facebook-parent Meta – doubled last year. But they are down around 15 per cent this year and are worth just half what they were at their peak in late 2021. In a further blow, Tesla is no longer the biggest maker of electric cars in the world, having been overtaken by Chinese rival BYD amid a vicious price war to boost sales.  So investors will be hoping Musk – whose eccentric behaviour continues to raise eyebrows amid allegations of drug abuse, which he denies – can deliver the goods on Wednesday night. Failure to do so may spark fresh talk about the future of his sprawling business empire which also includes X, formerly known as Twitter, and Space X. 'Tesla has been disappointing investors as questions are raised over profitability amid an EV [electric vehicle] price war,' said Susannah Streeter, head of money and markets at Hargreaves Lansdown. But she added: 'It's important to stress that Tesla has an excellent product. If production can be ramped up at pace, the horizon looks promising.' Analysts are expecting quarterly revenues of around £20billion, and there will be much interest on how this translates into profits given the price cuts. Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence. Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards. We are no longer accepting comments on this article. MORE HEADLINES Work out how a lump sum or regular monthly savings would grow Find the top deals in our independent best-buy tables This is Money is part of the Daily Mail, Mail on Sunday & Metro media group "
}