{
    "title": "South Carolina: Tesla distribution center coming to Greenville County",
    "date": "1/18/2024",
    "url": "https://www.wyff4.com/article/south-carolina-tesla-greenville-county/46436985",
    "text": "The latest breaking updates, delivered straight to your email inbox. Tesla will open a regional distribution center in Greenville County, South Carolina, in early 2024. The inaugural Tesla facility for the state will be built in Fox Hill Business Park in Fountain Inn. Fox Hill Business Park, located on 172 acres, is being developed by  The Sudler Companies based in Chatham, New Jersey. More news: Sheriff: Person of interest in double homicide killed in shooting with Upstate officers “Tesla’s commitment to Fox Hill Business Park in Greenville County is a testament to the continued strength of our company’s partnership with Tesla and to the indisputable drivers that make the park and the Upstate a force in the logistics world,” said Brian Sudler, principal with The Sudler Companies. “Access to world-class labor, a friendly business environment, quality of life and proximity to more than 90 million people within one day’s drive combine to make Greenville County the vital and dynamic area it is known to be.” More news: Officials investigating homicide at Upstate apartment complex Tesla’s work in Greenville will focus strictly on the distribution of vehicle parts regionally and will not include manufacturing, officials report. Tesla will use all of Fox Hill’s Building 3, which is comprised of 251,100 square feet. The company says depending on final development strategies, the Fox Hill Business Park campus can accommodate up to 2.5 million square feet of manufacturing, distribution, and warehousing activity across multiple buildings. More news: Clemson University releases statement after student killed in crash Late in 2023, Tesla posted a hiring notice for a \"Training Leader\" to support and train employees at the new facility in Greenville County. Tesla operates six vertically integrated factories across three continents and employs over 100,000 employees who design, build, sell and service Tesla products in-house. The Tesla announcement is the latest addition for Fox Hill, which also saw the recent addition of Sage Parts Plus, which makes replacement parts for aviation ground support equipment. Sage Parts opened new distribution operations in Fox Hill Business Park in mid-2023, leasing a 103,049-square-foot building to accommodate distribution operations along with its new global headquarters that houses its leadership team, purchasing, finance, customer service, human resources, product management, and other support departments. Fox Hill Business Park features access to Interstate 385, Interstate 85, the Inland Port, and Greenville Spartanburg International Airport. “The addition of the Tesla brand to Greenville’s business ecosystem is another example of the important role that speculative development plays in today’s competitive environment, and exactly why Greenville County was so supportive of The Sudler Companies and Fox Hill Business Park,” said Kevin Landmesser, the interim CEO of the Greenville Area Development Corporation. “Our market is extremely strong thanks to quality investment by organizations like The Sudler Companies, and we will continue to support site development to attract more high-quality companies to Greenville County.” “Tesla is changing the automotive industry in America and abroad,” Landmesser noted. “The addition of Tesla to Greenville County can help raise income levels for our area and create quality jobs. We welcome Tesla’s addition to our community.” “We are excited that Tesla has chosen to call Fountain Inn home for their first facility in South Carolina,” stated Fountain Inn Mayor GP McLeer. “This facility will not only create local jobs that will support families, but it also helps many of our region's existing suppliers get their products to one of the nation's most innovative automotive companies more efficiently. We continue to be proud of our community's expanding role in the automotive industry and are excited to see Tesla begin operations.” Hearst Television participates in various affiliate marketing programs, which means we may get paid commissions on editorially chosen products purchased through our links to retailer sites. "
}