{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.lexpert.ca/legal-insights/can-superstar-ceos-actually-be-awarded-supersized-pay-packages-takeaways-from-tornetta-v-musk/383792",
    "text": "The views expressed in this article are those of the authors and not their firm. In 2017 Tesla’s market capitalization hovered around US$50 billion and it was the U.S.’s most shorted stock: the market was betting decisively against Elon Musk. But by October 2021, and on the heels of a performance-based equity-compensation plan awarded by the Tesla board to Musk and subsequently approved by shareholders in March 2018 (the Plan), Musk propelled Tesla to stratospheric valuations exceeding US$1 trillion. Observers can therefore be forgiven for being surprised by the Delaware Court of Chancery’s decision to rescind the Plan in Tornetta v Musk et al,[1] issued at the end of January. But even if one questions the result, the judgement remains worthwhile reading for corporate directors, and particularly members of compensation committees, attempting to fashion compensation plans for their senior executives.  It is rare that executive compensation plans receive the degree of judicial scrutiny levied by Chancellor McCormick. Furthermore, the essential similarity of Delaware and Canadian common law regarding principles of corporate governance makes much of the decision relevant north of the border. What is the key takeaway? Corporate law doesn’t prohibit “supersized” compensation for “superstar” executives, but it does impose specific procedural checks and balances. Stated differently, in Canada, provided it is the result of a robust process led by truly independent directors advised by external experts, and assuming meaningful disclosure to shareholders, a supersized compensation plan granted to a superstar CEO should, if challenged, find judicial approval. In brief, the Plan granted Musk options to increase his Tesla ownership by approximately 6% (from 21.9% to a maximum of 28.3%) if, and only if, he increased Tesla’s market capitalization from approximately $50 billion to $650 billion, while also achieving operational milestones tied to Tesla’s top-line (revenue) or bottom-line (adjusted EBITDA) growth.[2] The Plan’s total maximum potential value to Musk was US$55.8 billion.  Chancellor McCormick noted the Plan was “the “largest potential compensation opportunity ever observed in public markets by multiple orders of magnitude—250 times larger than the contemporaneous median peer compensation plan and over 33 times larger than the plan’s closest comparison.” Tesla’s directors highlighted the Plan’s objective was to “achieve transformative growth, and that Tesla accomplished this by securing Musk’s continued leadership.” They further underscored that Musk’s equity stake would only increase by 6% should he realize $600 billion of growth in shareholder value.[3] Ultimately, however, and notwithstanding the Court’s acceptance “that Musk was uniquely motivated by ambitious goals and that Tesla desperately needed Musk to succeed in its next stage of development,” the Court ruled Tesla’s directors had breached their fiduciary duties by awarding the Plan. The Court-ordered remedy: rescission of the Plan such that Musk was disentitled to the entirety of the equity he had earned under it. But what is critical to appreciate is the Court’s ruling doesn’t condemn the Plan based on its terms in and of themselves. Rather, Chancellor McCormick rescinded the Plan primarily for deficiencies identified in (1) the independence of the committee tasked with formulating the Plan (the Committee), (2) the process around the Committee’s development of the Plan, and (3) Tesla’s disclosure to shareholders regarding the foregoing. In total, with appropriate modifications to these process points, the Plan could have survived judicial scrutiny. Musk has also recently indicated that he intends to appeal the decision. Where exactly did the Committee and the Plan go wrong? The Court seized on several issues, and as such the judgement makes instructive, if not entertaining, reading. Regarding the Committee’s composition, the Court’s primary concern was numerous indicia its members lacked independence, i.e. appropriate objectivity and autonomy vis-à-vis Musk. The Court cited both business dealings outside the company and cross-investments amongst Committee members and Musk, as well as longstanding personal relationships evidenced by such things as attendance at family birthday parties and joint family vacations. Another “compromising factor” identified by the Court was the off-market and “outsized” director compensation being received by two of the Committee members. Relatedly, the “primary” intermediary between the Committee and Musk was Tesla’s General Counsel, who was Musk’s former divorce attorney.  The Court described him as a man whose “admiration for Musk moved him to tears during his deposition.” The Court underscored that on “whose side he viewed himself” during the negotiation was unclear.” Regarding the Committee’s development of the terms of the Plan, a key concern of the Court was that the process was insufficiently “adversarial”. The Court highlighted several admissions during Committee members’ testimony that they did not see themselves as being “on different sides of things” with Musk, that they viewed the process as “cooperative” rather than “contested”, and that they had not engaged in “positional negotiation.” This was aggravated by the fact that the Plan as ultimately approved was very close to that initially proposed by Musk, that the Committee had not won any significant concessions from Musk, and that, where the Plan had been downsized, it had essentially resulted from Musk “negotiating against himself”. The Court identified several additional deficiencies with the Committee’s process. One was inadequate Committee control over timing and preparation. Although the Plan had been developed over nine months, the Court saw most work as occurring in “short bursts” dictated by Musk and around which the Committee was given insufficient time to prepare. Another was that, notwithstanding that benchmarking is the “foundation” of a compensation analysis, the Committee had not conducted a benchmarking analysis. Nor had the Committee asked its advisors to either challenge the Plan or present alternatives to it. The Court also highlighted that several of the Plan’s preliminary performance milestones already appeared highly likely to be met.[4] Finally, the Court faulted the Committee for failing to address two interrelated questions. First, did adequate incentives for Musk already exist? The Court called this the “$55.8 billion question”, and answered that, given his existing 21.9% equity stake, Musk already had “every incentive to push Tesla to levels of transformative growth,” in that he “stood to gain over $10 billion for every $50 billion in market capitalization increase.” Second, whether the Plan was necessary to retain Musk, i.e., was there danger Musk would depart without it? The Court did not see any. Musk’s own testimony “throughout the litigation” was that he had “no intention of leaving Tesla.” The Committee had expressed concerns that a risk faced by Tesla was Musk dedicating insufficient time to the company due to distractions posed by his other significant business ventures. However, the Court criticized the Plan as “not conditioned on Musk devoting any set amount of time to Tesla because the board never proposed such a term.” Regarding Tesla’s disclosure of the foregoing in advance of the shareholder vote that approved the Plan, the Court held the vote was not fully informed as a result of deficiencies in the proxy circular sent by Tesla to shareholders, specifically for “inaccurately describing key directors as independent and misleadingly omitting details about the process.” What was required, according to the Court, was an “accurate, full, and fair characterization” of the Committee members’ standing vis-à-vis Musk as well as the process by which the Plan was developed. However, the circular did not disclose any of the “members’ actual or potential conflicts with respect to Musk.” Nor did the circular disclose several aspects of the Plan’s negotiation the Court viewed as material in the circumstances, including “the level of control that Musk exercised over the process.” Lastly,  the circular did not disclose that, under Tesla’s own projections, the company “would achieve three of the revenue milestones and all of the adjusted EBITDA milestones in 2020.” And so what are the key lessons of Tornetta v Musk et al for compensation committees in Canada? Once again, a principal takeaway is that corporate law doesn’t prohibit “supersized” compensation for “superstar” executives, but it does require that procedural checks and balances are respected. We highlight the following: Lastly, the importance of attention to the foregoing is amplified where the executive could reasonably be described as “superstar” and/or the compensation package as “supersized”. In special circumstances stratospheric compensation may be justifiable, but expect a commensurate level of scrutiny of the process undertaken by the directors that awarded the package. Chancellor McCormick’s judgement is no doubt making the rounds throughout boardrooms across North America and elsewhere. However, a few additional caveats and comments are warranted in the Canadian context. The reality is that the Canadian business community is dwarfed by that of the U.S. such that it can be more difficult here to entirely avoid overlapping business or personal interests among senior executives and directors. Also, questions regarding director independence, including what may or may not qualify as potential conflicts of interests, have received scant judicial guidance by Canadian courts, further complicating the situation. Finally, we do not entirely agree with the Court’s analysis regarding the requisite level of “adversarial” and “positional” bargaining during the negotiation of an executive compensation plan. Yes, the committee should be independent and negotiations should be arm’s length, but this does not mean that the process should be hostile as opposed to cooperative and collaborative. Negotiations over executive compensation are not the same as negotiations over an arm’s length merger. It must also be recalled that directors are ultimately in pursuit of an appropriately structured “win/win” pay package for senior executives and the company, and that the success of the company going forward will in good part depend on management and the board working well together for the benefit of all stakeholders. [1] C.A. No. 2018-0408-KSJM, Post-Trial Opinion (January 30, 2024). [2] The Plan also featured a five-year holding period, an M&A adjustment, and a 12-tranche structure.  For a tranche to vest, Tesla’s market capitalization had to increase by $50 billion and Tesla had to achieve either an adjusted EBITDA target or a revenue target in four consecutive fiscal quarters. [3] Or, as the Tesla directors put it, the Plan was “all upside” for the Tesla stockholders, who “risked nothing” but stood to gain $600 billion for only 6%.  The options were valued at $2.6 billion at the time of grant. [4] Tesla’s 2017 Projections showed revenue growth of $69.6B and adjusted EBITDA growth of $14.4B in 2020. Under the July 2017 Projections, Tesla would achieve three of the revenue milestones and all of the adjusted EBITDA milestones in 2020. *** Grant McGlaughlin is co-leader of the Private Equity Group and practices in the areas of mergers and acquisitions, private equity, corporate finance, governance and sensitive and complex transactions. He provides superior service and expert legal advice to public and private issuers, underwriters and private equity funds in a broad range of industries including mining and natural resources, technology and industrial. *** Richard Steinberg’s practice is focused on mergers and acquisitions and corporate finance. Richard advises targets, buyers and investors in both solicited and unsolicited transactions, with a particular expertise in cross-border transactions. Richard’s corporate finance practice is focused on structured and cross-border financings, with extensive experience acting for both underwriters and issuers. Richard is the former Chair of Fasken’s. *** Paul Blyschack     "
}