{
    "title": "Tesla Sales In California Down 10% In 4th Quarter",
    "date": "2/5/2024",
    "url": "https://cleantechnica.com/2024/02/05/tesla-sales-in-california-down-10-percent-in-fourth-quarter/",
    "text": " Reuters reports that registrations of Tesla vehicles in California dropped 10 percent in the last quarter of 2023. That is the first time sales of Tesla automobiles have fallen in the Golden State, which is ground zero for the EV revolution in the United States, in the past three years. The last time it happened was in the third quarter of 2020, when the Covid pandemic was roiling markets worldwide. California typically accounts for about 10 percent of all Tesla vehicles sold worldwide, which makes it one of the most important markets for the company. A total of 47,592 Tesla vehicles were registered in California in the fourth quarter, compared with 52,782 a year earlier, according to data from California New Car Dealers Association. Globally, Tesla saw its sales hit another record in the fourth quarter after the company cut prices. CEO Elon Musk has blamed high interest rates for raising monthly payments and in turn hurting demand for Tesla cars and forcing Tesla to slash prices. Analysts said Musk may have alienated many potential buyers with his actions and comments, including his endorsement of antisemitic comments on X and his support of the Republican Party. He later said he is “far from being antisemitic.” “83% of Americans connect Musk with Tesla and that’s a problem for Tesla considering that Musk’s reputation is much weaker than Tesla’s,” Shahar Silbershatz, CEO of market research firm Caliber, told Reuters. He added that his firm has seen a decline in the reputation and the consideration rates for Tesla since Musk has acquired X, formerly Twitter, more than a year ago. Tesla’s price cuts also hit the market value of Tesla cars already on the road, which may dissuade some potential customers and discourage current owners from purchasing another Tesla, Guidehouse Insights analyst Sam Abuelsamid said. “The poor residuals have probably left a lot of owners underwater on existing loans,” he said. Ongoing layoffs at tech companies located in California also may have weighed on consumer sentiment, both analysts said. Competition is also growing from Chevrolet, Hyundai, Mercedes-Benz, and BMW, which all increased their EV market share in California last year. During the full year of 2023, Tesla increased vehicle sales by 24.6% but lost market share in the electric car segment by 10.5 percentage points. It now is “only” responsible for 60.5 percent of EVs registered in California. The word on everyone’s lips today is “hybrid.” Sales of hybrid vehicles are now 13.3 percent of new car sales in California, up for 8.7 percent in 2022. The market share of battery electric vehicles in the state fell to 21.1 percent in the fourth quarter from 22.3% in the prior three month period. Suddenly, people like Mary Barra, CEO of General Motors, are talking about building more hybrid vehicles that have tried and true gasoline engines onboard to power a car when the battery gets depleted. The issue is really charging infrastructure. Despite years of trying by companies like Electrify America, ChargePoint, EVgo, Blink, and others, people remain reluctant to purchase an electric car if they are unsure about how to charge it. Having that gas engine under the hood alleviates those concerns. It also addresses other weaknesses that battery electric cars face, such as reduced range and difficulty charging in cold temperatures. Are hybrids a stop gap, halfway measure? Of course they are. But the Chevy Volt was an excellent automobile that allowed people to drive on electrons instead of molecules most of the time. When it came time to drive the family to Disneyland, however, it could take to the interstate just like a normal car without the worry of finding charging locations along the route. General  Motors did what it does best — introduce a new model, then smooth and improve it as part of a second generation makeover, and then, just when it has all the kinks worked out, kill it. The GM Voltec system developed for the Volt didn’t just disappear when that car went out of production. It is on the shelf, ready to go, and could be applied to many GM models — particularly the Canyon midsize pickup truck and many SUV models — with relative ease. Is that what Barra and her minions have in mind? Somewhere, Akio Toyodo is snickering up his sleeve as he watches the pendulum swing back towards his beloved “self charging” hybrid cars. Many other car company executives are applauding themselves for building cars on platforms that can accommodate a variety of powertrain options, from only combustion engines, to hybrids, to plug in hybrids, to full battery electric. The problem with that approach is that it prevents designers from taking full advantage of the packaging requirements for electric cars that allow more room inside for people and things because there is no need fit a big clunky gas engine and a ten speed automatic transmission inside the bodywork. The advantage is that manufacturers can rapidly adjust their product mix to meet the the demands of the marketplace. Right now, those demands are trending away from purely electric cars and toward cars that combine the advantages of piston power and electric motors. Tesla, of course, cannot take advantage of that shift in the market, if there is one, because it has never built cars with combustion engines and never will. In the book The Last Hurrah, Edwin O’Connor tells the story of Frank Skeffington, a powerful Irish mayor of an Eastern US city whose political empire reaches a pinnacle and then comes to an end quite abruptly. Most readers assume the book is a fictionalized account of the life and times of James Michael Curley, who was the mayor of Boston from 1914 to 1955. Like Skeffington, Curley was a rogue, a scoundrel, and a master politician who ruled his empire with an iron fist and a velvet glove. At the conclusion of the book, the protagonist is at a post election party where speeches and whiskey are flowing. But despite all the back slapping and bonhomie, Skeffington is keeping an eye on the vote totals by precinct as they are posted. He notices some of the numbers are not what he expected and while his supporters continue celebrating, he watches as his empire crumbles into dust. Is it too much of a stretch to ask if something similar might be happening to Tesla? The numbers from California may be just a glitch — a temporary disturbance in the force — or they could be the first signs of a shift that could signal the undoing of Tesla and its high profile leader. One could construct an argument that the EV revolution has moved too far, too fast, and a period of retrenchment is now upon us, one in which hybrids are asked to prepare the way for the second phase of the EV revolution sometime around 2030, when the charging infrastructure is fully developed to the point where it can support millions of electric cars charging every day. Perhaps on that distant horizon, batteries will have improved to the point where they can charge faster, weigh less, take up less space, and perform better in cold weather than the batteries we have today. The question is whether all those improvements will happen at all if the transition to battery electric cars takes a detour somewhere along the way. Who will pay for all those chargers if there are not enough electric cars using them? Who will pay to improve batteries if the world of transportation turns away from battery powered vehicles? CleanTechnica readers may find these questions silly or even inane. Of course Tesla is going to go from success to success. Of course the EV revolution is going to continue. But there are warning lights flashing for the transition to electric cars. Just because it needs to happen to tame the worst effects of global overheating doesn’t guarantee it will happen — at least not on the time schedule many of us assumed it would. We ignore such warning signs at our peril. Steve writes about the interface between technology and sustainability from his home in Florida or anywhere else The Force may lead him. He is proud to be \"woke\" and doesn't really give a damn why the glass broke. He believes passionately in what Socrates said 3000 years ago: \"The secret to change is to focus all of your energy not on fighting the old but on building the new.\"\r\n\r\nYou can follow him on Substack and LinkedIn but not on Fakebook or any social media platforms controlled by narcissistic yahoos. Steve Hanley has 5450 posts and counting.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\tSee all posts by Steve Hanley "
}