{
    "title": "Rivian, GM, Volvo And Polestar To Get Access To Tesla's Supercharger \nNetwork This Spring",
    "date": "2/29/2024",
    "url": "https://www.tradingview.com/news/benzinga:4c19cbd62094b:0-rivian-gm-volvo-and-polestar-to-get-access-to-tesla-s-supercharger-network-this-spring/",
    "text": "EV giant Tesla Inc TSLA said on Thursday that it will open its supercharger network in North America to rival EV makers Rivian Automotive RIVN, General Motors GM, Volvo Car VLVCY and Polestar Automotive PSNY starting spring this year. The announcement comes on the heels of the company opening its network to Dearborn-based legacy automaker Ford Motor Co. What Happened: Tesla is looking to open its North American supercharging network to more rival automakers through the end of 2025. While initially charging on the network will require an adapter provided by the respective automakers, they would no longer be needed once vehicles integrate Tesla’s charging standard. We're opening our Supercharger network to NACS-committed automakers starting today. See supported vehicles → https://t.co/wATK8FdJKF pic.twitter.com/1iq4wFQY3a Tesla superchargers, the EV giant says, make up three out of every four fast chargers in the geography. However, not all superchargers can be accessed by other vehicle drivers. There are also Tesla-only superchargers reserved purely for the company’s vehicles. The cost for non-Tesla vehicles charging at Tesla superchargers will be higher as compared to Tesla cars. However, users can sign up for a supercharging membership to allow them to charge at the same price as Tesla cars when using the Tesla app. Sign up for a Supercharging membership to charge at the same price as Tesla vehicles → https://t.co/wOtKl5odtR https://t.co/4aNwct47Fx “Supercharger access is coming to Rivian – that's 15,000 more fast chargers for Rivian owners across North America. In March we'll be adding Supercharger sites to our vehicle and app trip planner with adapter shipments to owners starting soon after. Start planning your road trips!” Rivian said in a post on X. Rivian is among the four automakers slated to gain access to the network starting spring. Ford Onboard: Ford announced Thursday that its Ford F-150 Lightning and Mustang Mach-E customers are the first non-Tesla automaker vehicles to get access to the Tesla Supercharger network. New and existing customers of Ford EVs can get a fast-charging adapter at no cost through June 30, 2024, to charge on Tesla superchargers. The adapter will cost $230 after the offer expires. “I would like to thank Elon and the Tesla team for their close collaboration and Tesla’s leadership to help change the lives of so many EV customers through improved access to charging,” Ford CEO Jim Farley. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: ‘Yeah:’ Elon Musk Agrees With Tesla Bull’s Theory About Apple Canceling Electric Car Project Due To Lack Of ‘Monumental Dataset’ Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}