{
    "title": "Tesla owners' tips on charging in extreme cold",
    "date": "2/4/2024",
    "url": "https://www.businessinsider.com/tesla-owners-tips-charging-electric-car-extreme-cold-temperatures-weather",
    "text": "       Driving an electric vehicle in the cold looks a lot different than driving a gas-powered car, but some Tesla owners — often among the most seasoned EV owners — say there are easy ways to avoid disaster. Last month, Tesla made headlines when dozens of EVs clogged a supercharging station in Chicago as Tesla owners struggled to charge in temperatures below zero degrees. Pictures of the scene sparked criticism of the brand and gave EV skeptics a reason to question the viability of battery-powered cars in colder climates. While studies have shown electric cars can lose as much as 30% of their range in sub-freezing cold and can take more time to charge in extreme temperatures, these restrictions aren't as prohibitive as they sound. Adopting an electric vehicle can't be approached like a one-to-one exchange with a gas car, experts say. Making sure you don't run out of juice necessitates more planning and often relies upon home-charging infrastructure. Insider spoke with eight Tesla owners who shared some tips on how to own an EV during a bitter winter. Related stories Here's what Tesla owners say about how to deal with the cold. Tesla owners say it's important to start your car in advance. Tesla's app allows owners to set the car to precondition so the battery and cabin temperature are set ahead of time. \"On days when I am driving my son to school, it is scheduled to precondition just before we leave,\" Dennis Duncan, a Model Y owner based in Washington said. If you don't have time to precondition, Tesla recommends using its internal navigation system to plot out a charging location that is 30 to 45 minutes away in order for the battery to reach the right temperature for charging. Leonard Zuga, a Model Y owner based in Ohio, said he's rarely run into an issue in the cold with his Tesla. \"When you hear the horror stories, it's usually a result of poor planning,\" Zuga said. \"They left it sitting without a charge in the cold at an airport or a hotel.\" Other Tesla owners say it's key to have a charger at home. By keeping the car plugged in, owners can prevent range loss and keep the battery at an optimal temperature, according to Tesla's website. \"I've told people, 'If you're thinking of buying an EV and you cannot charge at home, wait till you can,'\" Richard Samuels, a Model 3 owner based out of Oregon, said. \"You really need to have a place you can charge it overnight.\" Nick Caracciolo, a Model 3 owner based out of Canada, said he gives himself an extra 20% buffer from what his Tesla tells him about his battery range. He also makes sure to allow for more time in his schedule at Superchargers and public charging stations. \"I've definitely noticed it takes at least double — sometimes triple — the amount of time to charge when it's cold out,\" Caracciolo said. Heaters can be a source of battery drain on an electric car. Robbie Mack, a former Tesla salesman and the owner of a Model S, said he makes sure to turn on the defroster and cabin heat when the car's charging. And if you want to avoid batter degradation while driving, he recommends using the seat heaters to keep warm instead of the cabin heaters. \"It's just like any car, you need to be careful in extreme cold and you want to give it time to warm up before you drive it,\" Mack, who lives outside of Chicago, said. \"In some ways, it's even better. You can get it all charged up overnight from the comfort of your home instead of having to stand outside in the freezing cold at a gas pump.\" Read next Jump to "
}