{
    "title": "Elon Musk in talks with Tesla shareholder before appeal of nixed $56B pay \npackage",
    "date": "2/14/2024",
    "url": "https://nypost.com/2024/02/14/business/elon-musk-in-talks-with-tesla-shareholder-before-appeal-of-nixed-56b-pay-package/",
    "text": "Thanks for contacting us. We've received your submission. Elon Musk and the Tesla shareholder who won a verdict last month voiding the CEO’s $56-billion pay package will ask a judge to pause her ruling until an appeal is resolved, according to a Tuesday letter to the court from the shareholder’s attorney. Greg Varallo, the shareholder’s attorney, told Reuters the two sides will agree to a stay if they can reach a deal on an appeal bond. The letter is the first indication that Musk intends to appeal the ruling, which the billionaire has criticized on social media, saying he will seek shareholder approval to move Tesla’s state of incorporation to Texas, where it has its headquarters. Before Musk can appeal, the two sides will propose a final order for approval by the judge, Kathaleen McCormick, which will include a petition for a legal fee. That fee will be paid by Tesla and given the enormous verdict, it is likely to be among the largest ever. It will likely be opposed by Tesla. Musk and the shareholder will tell the court their position on fees by March 1, according to the court filing. If McCormick approves the fee and final order, Musk would have 60 days to file an appeal with the Delaware Supreme Court, which would likely take at least six months to resolve. An attorney for Musk did not immediately respond to a request for comment. An appeal bond protects a plaintiff who prevailed in court by ensuring that the losing party will pay up if they fail to overturn the verdict. The Jan. 30 ruling rescinded Musk’s $56-billion pay package, which consisted of stock options. Musk has not exercised the options, which allow him to buy Tesla stock at a deeply discounted price. Once he buys the stock he must hold it for five years. The case was brought by shareholder Richard Tornetta, who was pursuing it on behalf of Tesla. Shareholders benefited from the return of the stock options to Tesla. McCormick said in her ruling that Musk improperly controlled the pay negotiation process and that the shareholders lacked information when they voted in 2018 to approve the package. Advertisement "
}