{
    "title": "Tesla Model Y earns highest safety rating in 2024",
    "date": "2/28/2024",
    "url": "https://interestingengineering.com/transportation/tesla-model-y-earns-highest-safety-rating-in-2024",
    "text": "Tesla is not the only winner – Hyundai Motor Group, which includes Genesis, Hyundai, and Kia brands, has emerged as the leader in the 2024 safety awards. By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time.  Elon Musk’s favorite social media playground is buzzing again; this time, it’s not about meme coins, SpaceX, or cryptic tweets. Tesla’s Model Y just aced its safety exams, earning the highest possible score from the Insurance Institute for Highway Safety (IIHS). The notoriously picky IIHS even made the tests tougher this year, but the Model Y still rolled out with that coveted “Top Safety Pick+” rating. Elon Musk, ever the hype man, wasted no time sharing the news on X ( the social network formerly known as Twitter). His post, “Tesla Model Y receives the highest possible safety rating,” set off a digital fist-pumping party. Tesla Model Y receives highest possible safety rating https://t.co/6LDqVU3Qi4 Fans chimed in with praise like “This is an incredibly kick-ass car” and “There’s a reason the Model Y is the best-selling vehicle on earth.” Safety-conscious buyers were out in force, too. “My number one priority in buying a new car was safety. That’s why I went with my Model S. I have two young kids,” one commenter shared. Tesla is not the only winner – Hyundai Motor Group, which includes Genesis, Hyundai, and Kia brands, has emerged as the leader in the 2024 safety awards, earning six “Top Safety Pick+” and ten “Top Safety Pick” awards, totaling 16 awards. Toyota Motor Corp., which includes Toyota and Lexus brands, is a close second with one “Top Safety Pick+” and “Top Safety Pick” award. Mazda, on the other hand, is the brand with the highest number of Top Safety Pick + awards, having earned five, in addition to one Top Safety Pick. The IIHS is doing everything correctly when it comes to safety. For 2024, they upped the safety testing protocols with tougher crash tests and stricter standards for protecting pedestrians and backseat passengers. Despite the challenge, a whopping 71 vehicles managed to grab a Top Safety Pick or Pick+ award, with 22 of those earning the elite ‘plus’ designation. Tesla’s no stranger to the safety spotlight. The Model Y joins a lineup of Teslas known for their crashworthiness. Another EV, the Hyundai IONIQ 6, also snagged the top safety prize. Rivian’s R1S SUV and R1T pickup truck weren’t left out in the cold, each earning the “Top Safety Pick” award. In a press release, IIHS President David Harkey noted that the safety agency is determined to push automakers to raise the bar in vehicle safety. “We continue to raise the bar for vehicle safety with another significant update to our award criteria. This year’s winners represent the pinnacle of automotive safety, demonstrating exceptional protection for both occupants and vulnerable road users,” he said. The IIHS’ safety evaluations now include a tougher side crash test. A heavier barrier travels at a higher speed, closer to the weight of a conventional SUV. Vehicles need an “Acceptable” or “Good” rating in the revised pedestrian front crash prevention test and the updated moderate front overlap test, which now includes a dummy in the back seat to test back seat safety, to qualify for the safety awards. If safety is your jam, the Tesla Model Y just got even sweeter. And if you’re an Elon Musk fanboy, well, today’s a good day to be online. "
}