{
    "title": null,
    "date": "2/12/2024",
    "url": "https://www.entrepreneur.com/business-news/tesla-earned-billions-last-year-from-a-side-hustle-report/469609",
    "text": "Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            Tom Carter\n          \n                                                    •\n            \n            \n              Feb 12, 2024 Share This article originally appeared on Business Insider. Elon Musk's Tesla raked in $1.79 billion in regulatory credit sales last year, according to a recent SEC filing, as it cashed in on rivals failing to sell enough EVs to meet emission regulations. Tesla earns regulatory credits by making and selling electric vehicles. It can then sell them to other automakers who have not produced enough EVs to meet emission rules imposed by regulators in the US, Europe, and China. It has proven to be an important business for Tesla, which does not disclose who it sells the credits to. Bloomberg, which initially reported on the filing, calculated that the company has pulled in almost $9 billion from selling regulatory credits since 2009. That might be as much a surprise to Tesla as it is to anyone. The company has expected revenue from regulatory credits to dry up as other automakers ramp up EV production, with then-CFO Zachary Kirkhorn warning as much in a 2020 earnings call. \"We don't manage the business with the assumption that regulatory credits will contribute in a significant way to the future,\" Kirkhorn told investors, per Bloomberg. \"It will continue for some period of time, but eventually this stream of regulatory credits will reduce,\" he added. However, that scenario has largely failed to materialize, with Tesla's earnings from selling regulatory credits slightly increasing from last year, when it earned $1.776 billion. The Elon Musk-run automaker continues to dominate the US electric vehicle market, though it's starting to lose ground to other competitors. Still, many of its biggest rivals are scaling back their ambitious EV plans, with Ford postponing $12 billion in investment and General Motors reintroducing hybrids into their all-electric lineup. Right now, the biggest threat to Tesla's dominance comes from China, with BYD overtaking the automaker as the world's top seller of EVs at the start of the year. Tesla did not immediately respond to a request for comment from Business Insider, made outside normal working hours. Want to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join. The digital perm offers a way for those with straight-hair to completely change their hair texture. At 41, Josh Grinstead knew he was at a crossroads. Sarah Michelle Boes knew there had to be a better way to prepare for her stress-inducing nurse practitioner's exam — so she created it. The winning applicants span 38 states, Washington, D.C., and Puerto Rico. We put together a list of the best, most profitable small business ideas for entrepreneurs to pursue in 2024. We are constantly told what to do if we want success — but what about the habits to avoid? Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  "
}