{
    "title": "Tesla, Nikola: EV Stocks in Focus",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/video/tesla-nikola-ev-stocks-focus-172602057.html",
    "text": "Yahoo Finance's Rachelle Akuffo and Akiko Fujita examine electric vehicle stocks Tesla (TSLA), following reports of plans for a new EV ahead of its earnings Wednesday, and Nikola (NKLA) as Baird analysts initiate coverage starting at $2 per share and an \"Outperform\" rating. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. [AUDIO LOGO] RACHELLE AKUFFO: All right, well, let's look at some trending tickers. We have our eyes on electric vehicles, starting with Tesla. The EV maker is telling suppliers to start mass market production of a new crossover car, that's according to a report from Reuters. And this comes ahead of the car maker releasing its Q4 earnings today after the bell. Now this is interesting, the fact that they're announcing this, when we know there's going to be a lot of focus, of course, on margins and, of course, delivery estimates as well for Tesla, as well as really some questions about leadership going forward, especially in light of Elon Musk asking for that 25% voting control here. But interesting after all this time to finally see what's supposed to be a mid-priced crossover SUV vehicle that's supposed to be around $25,000. So really competing with some of that pressure that we've seen them taking from BYD. AKIKO FUJITA: Yeah, I mean, that's the key, right? $25,000 price tag, well below what the cheapest car that Tesla has on the market right now, which is the Model 3, roughly at $38,000 at a time when Tesla was overtaken by BYD as the largest EV maker. Now the pricing issue is certainly going to come up in the earnings call, no question, because Tesla has had to undergo multiple price cuts to remain competitive in this market. But Rachelle, this isn't just about the Tesla story. You could argue that what we have learned in the slowdown that we have seen in EV sales is that this next round of buyers-- if you want to talk about the first adopters, already underway-- this next round, they're looking for a cheaper option. And there is a concern, yes, about infrastructure, but there is a concern about price tag. Right now, Tesla's cars don't necessarily apply for federal subsidies. And so you take that out, you've got a $38,000 car at a time when there are cheaper options like a Kia out there, they've got to just sort of face the reality of where things are. You could argue also the other thing, Rachelle, you've been sort of teasing out, right, is that this may be an anticipation of this expectation that BYD is going to increasingly compete on a bigger level outside of its home market. Questions about whether they're going to enter the US market. But Tesla's going to have a cheaper option if they're going to go head to head with BYD. RACHELLE AKUFFO: Indeed. And I think especially when you think of also the resale value of Teslas and other EVs, that's also sort of another thing that people worry about. And then, of course, Hertz releasing that fleet of some of their rental cars up for sale as well, also sort of messing with some of the pricing as well, trying to really get a gauge on what people consider the right price point for this second round of adopters, as you mentioned, Akiko. AKIKO FUJITA: Yes. Another question to come up in the Tesla earnings call, I'm sure. Well, staying in the battery-powered lane, a Baird analyst is initiating coverage of Nikola, the firm rating the EV maker as outperform with a $2 price target. The analysts saying, there's opportunity to capitalize on the zero emissions trucking space, but take a look at that share price, Rachelle. We're talking about this company trading below that $1 level, now facing delisting from the NASDAQ yet again, because they have been trading below that $1 a share level for more than 30 consecutive days. So sure, you can make the argument about Nikola having this stronger runway here, as Baird has, but you have to wonder about the viability of a company that's trading at $0.70 a share. RACHELLE AKUFFO: I mean, it's true. It's one of these stocks that you keep waiting for it to take off and have its moment. I believe they thought they did with some of their proprietary design, especially when it came to their trucks, but it doesn't seem to be taking off. It's interesting, obviously, Nikola Tesla, the full name of the inventor from way back-- but to have these two very different futures that they've both been a part of here, interesting to see. But a cheap stock-- still keeping an eye of what we're seeing in terms of cash burn and liquidity, though, as well. Something to watch as we continue to track both of these EV stories. Related Quotes "
}