{
    "title": "Here's Why Tesla (TSLA) Shares Dipped Roughly 3% Yesterday",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/news/heres-why-tesla-tsla-shares-131400443.html",
    "text": "Shares of Tesla TSLA declined 2.9% yesterday amid reports of pay increases for U.S. factory workers and disruptions in the supply chain, which will impact production at its Berlin plant. The electric vehicle (EV) king will be suspending car production at its factory near Berlin for two weeks. The disruption, scheduled from Jan 29 to Feb 11, is a consequence of supply chain problems arising from attacks on vessels in the Red Sea. Tesla cites a lack of components due to shifts in transport routes caused by the attacks, leading to considerably longer transportation times and creating a gap in supply chains. Militant attacks on vessels in the Red Sea have increased in recent months as a demonstration of support for the Palestinian Islamist group Hamas in its conflict with Israel in Gaza. This has forced major shipping companies to avoid the Suez Canal, the primary maritime route from Asia to Europe, for the past three weeks. Tesla's Gruenheide factory in Germany, which opened in March 2022, primarily produces the Model Y and is now grappling with shortages due to these disruptions. Tesla is the first company to publicly acknowledge production interruptions due to the Red Sea disruptions. However, it is not alone in facing challenges. Other companies, including Geely and Ikea, have also warned of delays in deliveries. The considerably longer transportation times caused by the attacks are having a ripple effect on the automotive industry, with Tesla being directly affected. In a separate development, Tesla hiked wages for U.S. factory workers. All U.S. production associates, material handlers and quality inspectors are set to receive a \"market adjustment pay increase,\" marking a response to the momentum building within the United Auto Workers (UAW) union. The UAW, having secured historic labor contracts with major automakers, is now targeting Tesla and a dozen other manufacturers in an ambitious organizing drive. Tesla's decision to increase pay for its United States workers follows similar moves by industry giants like Toyota, Volkswagen and Hyundai. The UAW's success in negotiating significant contracts with Detroit 3 automakers last year has emboldened nonunion autoworkers to seek improved working conditions. TSLA currently carries a Zacks Rank #3 (Hold). Some better-ranked players in the auto space are Toyota TM, General Motors GM and NIO Inc. NIO. While TM sports a Zacks Rank #1 (Strong Buy), GM and NIO carry a Zacks Rank #2 (Buy). The Zacks Consensus Estimate for TM’s fiscal 2024 sales and earnings implies year-over-year growth of 11% and 45%, respectively. The EPS estimates for fiscal 2024 and 2025 have moved up by $1.98 and 5 cents, respectively, in the past 60 days. The Zacks Consensus Estimate for GM’s 2024 sales and earnings suggests growth of 2.5% and 3%, respectively, from the estimated 2023 figures. The EPS estimates for 2023 and 2024 have improved by 39 cents and 93 cents, respectively, in the past 60 days. The Zacks Consensus Estimate for NIO’s 2024 top and bottom lines indicates growth of 43% and 30%, respectively, from the estimated 2023 figures. Loss per share estimates for 2023 and 2024 have narrowed by 2 cents and 6 cents, respectively, in the past 30 days. You can see the complete list of today’s Zacks #1 Rank stocks here Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Toyota Motor Corporation (TM) : Free Stock Analysis Report General Motors Company (GM) : Free Stock Analysis Report Tesla, Inc. (TSLA) : Free Stock Analysis Report NIO Inc. (NIO) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}