{
    "title": "Chicago's wind gusts expose how Elon Musk failed to design a Tesla for when \nit gets too cold",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/chicago-wind-gusts-expose-elon-171319977.html",
    "text": "No, that’s not an abominable snowman growing a new layer of ice while sitting in the parking lot. It’s a Tesla. The cold temperatures are turning up the heat on Elon Musk and his electric vehicles. As record-breaking gusts crept into Chicago in the coldest temperatures seen in the Windy City since 2019, Tesla owners have been having difficulties charging their cars. Most people don’t like to work or leave the couch when temperatures reach below zero with wind chills dipping between -25 to -40 degrees—and it appears as if Teslas don’t want to work either. A viral TikTok video shows several Teslas in the area abandoned at charging stations like frozen popsicles while people try to let their cars charge overnight. Owners reported to Fox32 that despite charging their cars for an extended period of time, their EVs couldn’t brave the cold. \"Nothing. No juice. Still on zero percent,\" Tyler Beard said, adding that he’d been trying to charge his EV at the Oak Brook Tesla supercharging station for three hours for multiple days. Nick Sethi, a Tesla owner, told the New York Times that he spent an hour outside in negative temperatures struggling to unlock his frozen car. Electric vehicles have become more popular in the U.S. as many Americans look to EVs as a more climate friendly option. Even President Joe Biden invested in their rollout by pouring millions into grants to help build EV infrastructure like charging stations. EV sales rose from 7.3% in 2022 to 8% of all cars, per the Atlas Public Policy. But it seems as if Musk didn’t account for different climates when designing his Silicon Valley-based cars in San Francisco and Austin. As climate-change intensifies and EVs are adopted in colder metros, this oversight becomes more glaring. “The problem is that battery basics simply do not work well in freezing conditions. Ions inside EV batteries travel between the positive and negative electrodes through a liquid electrolyte,” writes The Register’s Richard Currie. He adds that the ions move slower when it gets colder, creating greater resistance and therefore a faster draining battery. Tesla's battery needs to be kept warm, but as Currie explains, the “heat comes from the battery itself.” An EV’s driving range is also compromised during the cold; the Norwegian Automatic Federation finds that the cars lose around 20% of their range and need to charge longer during the winter. EVs overall saw some bumps in the road as sales dipped this past winter (although Americans still bought them at a record number). Chicago is an example of what might be in store for Tesla. The weather was part of a bomb cyclone that recently swept the nation, shutting down NFL games, freezing over oil plants, and turning Texas icey in its wake. Some experts suggest that global warming plays a part in these extreme weather patterns as of late. If Musk wants his cars to go he'll have to get his California Girls (EVs) used to Midwestern cold. This story was originally featured on Fortune.com Related Quotes "
}