{
    "title": "Apple's EV Fiasco Stirs Fear In Bullish Analyst About Elon Musk's Company: \n'I Hope Tesla Is Not Working On A Phone'",
    "date": "2/27/2024",
    "url": "https://www.tradingview.com/news/benzinga:5ae3e3697094b:0-apple-s-ev-fiasco-stirs-fear-in-bullish-analyst-about-elon-musk-s-company-i-hope-tesla-is-not-working-on-a-phone/",
    "text": "Apple, Inc. AAPL reportedly pulled the plug on its self-driving car project, dubbed Project Titan, and this triggered a mixed reaction from the Street. An analyst, who weighed in on the development on Tuesday, has one big takeaway for companies. What Happened: New Street Research analyst Pierre Ferragu, who is a Tesla, Inc. TSLA bull, made note of Apple’s 10 years of “excruciating work” that went down the drain due to the rumored decision to shelve the Apple Car project. The analyst said he previously viewed that Apple’s unrelated diversification into self-driving cars might be an exception. He suggested he may have been wrong. “Maybe the golden rule of tech applies: being very good at one thing doesn't make you good at any other,” he said. Ferragu, who also covers Apple, has a Neutral rating on the stock and a $175 price target. The development set-off an unrelated concern in the New Street Research analyst. “I hope $TSLA is not working on a phone,” he said, apparently expressing his worst fears for Tesla, which he rates a Buy with a $255 price target. One cannot shrug off the fear as an imaginary one. When it was rumored in November 2022 that Apple and Alphabet, Inc. GOOGL GOOG might kick Twitter out of their respective app stores, Musk did not rule out the possibility of developing an in-house smartphone. See Also: Best Electric Vehicle Stocks Why It’s Important: Apple may have given up but other tech companies are either getting started or have made progress or embarked on this front. Given that self-driving tech belongs more to a technology domain than autos, tech companies with their expertise have an edge over traditional car companies or EV startups. Google’s Waymo self-driving project is thriving despite the many hiccups. Consumer electronics giant Sony Group Corporation SONY has partnered with Honda Motor Company HMC for a car project. Chinese smartphone maker Xiaomi Corporation XIACF unveiled late last year its first electric sedan called the SU7. Apple may now have to be content with limited exposure to the auto industry with its CarPlay, which lets people get directions, make calls, send and receive messages, listen to music, and more from their car's built-in display. The company licenses this to automakers. Apple ended Wednesday’s session down 0.81% to $182.63, according to Benzinga Pro data. Photo via Shutterstock Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Jim Cramer Says Alphabet Should Follow Apple’s Lead And Cut Ineffective Projects: ‘Time Google...Start Focusing On Actually Making Some Money’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}