{
    "title": "Elon Musk nominated for Nobel Peace Prize, Norwegian MP says Tesla boss is \na staunch ‘free speech’ crusader",
    "date": "2/22/2024",
    "url": "https://www.financialexpress.com/life/technology-elon-musk-nominated-for-nobel-peace-prize-norwegian-mp-says-tesla-boss-is-a-staunch-free-speech-crusaderbkg-3402386/",
    "text": "The Financial Express Tesla founder Elon Musk has been nominated by the Norwegian Minister of Parliament Marius Nilsen, for Nobel Prize 2024 as he explains as “adamant defense of dialogue, free speech and (enabling) the possibility to express one’s views, in a continuously more polarized world.” MP praised Elon Musk’s companies for their contribution to global connectivity and safety, while the identities of Nobel Peace Prize nominees remain undisclosed even after the award ceremony. Nilsen acknowledged the role of Musk’s satellite internet constellation, Starlink, highlighting its deployment in Ukraine to aid resistance fighters in communication, coordination, and resilience against Russia’s ongoing aggression. In a recent update from Elon Musk’s Neuralink project, Musk announced a milestone achievement: the successful demonstration of a brain implant allowing a human patient to control a computer mouse with their thoughts. Musk described the patient’s recovery as full, with no adverse effects, and highlighted ongoing efforts to expand the capabilities of the brain-computer interface beyond basic mouse control. Meanwhile, another Norwegian MP has nominated Julian Assange for the big award. Sofie Marhaug has cited his exposure to Western war crimes as a contribution to peace. Marhaug emphasized the importance of truth in preventing conflicts, noting Assange’s revelations of torture and mistreatment of prisoners of war. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}