{
    "title": "Ford EV Owners Can Order a Free Adapter for Tesla Superchargers",
    "date": "2/29/2024",
    "url": "https://ca.finance.yahoo.com/news/ford-ev-owners-receive-free-174300097.html",
    "text": "Wall Street took a break from rally on Monday, with all three major indexes dipping slightly \"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\" The Ford F-150 Lightning and Mustang Mach-E will be able to access Tesla's Supercharger network in Canada and the U.S. as an adapter is now available to order. Current owners and lessees can reserve the complimentary NACS adapter until June 30, 2024. After that, future owners will pay $230. Countless automakers have agreed to adopt Tesla's NACS charge port, and most have pledged to offer adapters for existing CCS-type plugs. UPDATE 2/29/24: Ford today has opened orders for a NACS adapter that will allow people who own or lease an F-150 Lightning or Mustang Mach-E to access Tesla's Supercharger network in Canada and the United States. The adapter is free of charge for those who are enrolled in Ford's BlueOval Charge Network and order one by June 30, 2024. After that point, customers will have to pay $230 for the adapter, which uses Tesla's proprietary NACS outlet. Ford is just one of the many automakers that plan to start building new EVs that feature Tesla's proprietary charge port, which is known as the North American Charging Standard—or NACS, for short. Like most other companies, Ford plans to make the switch starting sometime in 2025, and it has pledged to offer an adapter for some existing electric models with a CCS-style plug. While Ford isn't alone in promising an adapter, the company looks to be one of the first to deliver one to customers. Ford CEO Jim Farley today posted on his social media accounts that customers will soon be able to reserve a complimentary fast-charger adapter. That will give Ford F-150 Lightning and Mustang Mach-E owners who live in Canada and the U.S. access to Tesla's vast Supercharger network. When we announced @Ford EVs would get access to @Tesla Superchargers, I said we'd send customers a Fast Charging Adapter. I'm pleased to confirm that eligible #MustangMachE & #F150Lightning owners in the U.S. + Canada can reserve a complimentary adapter starting soon. This is… pic.twitter.com/QbGjEmsA3Y — Jim Farley (@jimfarley98) January 31, 2024 The timing aligns with Ford's original promise to offer the adapters in spring of 2024. Farley later followed up on his original post by explaining that all current Lightning and Mach-E owners are eligible to receive an adapter and that reservations will be validated by their vehicle identification number. Of course, only one adapter will be provided for each VIN. Ford will also cover the cost of shipping. Car and Driver also reached out to Ford directly to ask whether the adapters will be standard or optional when customers buy a new electric F-150 or Mustang SUV. The response we got was that more information about that will be revealed at a later date. You Might Also Like Car and Driver’s 10 Best Cars through the Decades How to Buy or Lease a New Car Lightning Lap Legends: Chevrolet Camaro vs. Ford Mustang! BALTIMORE (AP) — A container ship rammed into a major bridge in Baltimore early Tuesday, causing it to collapse in a matter of seconds and creating a terrifying scene as several vehicles plunged into the chilly river below. It was not clear why the cargo ship crashed into the Francis Scott Key Bridge long before the morning commute, or how many people might be in the waters of the busy harbor near a key port. Rescuers pulled two people from the water by mid-morning and searched for more. One off The NHTSA recently announced recalls for 612,829 vehicles, which include Mercedes-Benz, Hyundai, Kia, and Chrysler.  The Singapore-flagged Dali, which is about 984 feet long, crashed into the Francis Scott Key Bridge on Tuesday, causing it to completely collapse. “Like the determined old fellow he is, Barnaby adapted well to the scooter,” zoo officials said. A potent Colorado Low is forecasted to sweep across Ontario, poised to unleash up to 50 cm of snowfall accumulation in some regions. Meteorologist Rhythm Reet from The Weather Network provides in-depth analysis of the timing and potential impacts of this significant snow event. Trade 24 hours a day on the world's most popular platform. The standby passenger was seen taking photos of other people's boarding passes before using one of the photos to illegally board the plane, authorities said. The baby may be “hard to spot” for some time. With the federal carbon tax on consumers losing political support by the day, New Brunswick's Green leader says it's time to shift the debate to the pricing system for large industrial polluters.David Coon says a recent report on climate policies shows that it's the most effective way to lower greenhouse gas emissions, so the province's regime should be toughened. The study by the Canadian Climate Institute says the carbon tax on large emitters could yield emissions reductions six times as large 我們致力透過體育推動全民運動，作為官方社區合作夥伴，讓逾一萬名巿民有機會體驗七欖。 LONDON (AP) — The newest endangered baby gorilla at the London Zoo is more than six weeks old but doesn’t yet have a name. Zookeepers aren’t even sure if it’s a male or female because they haven’t been able to get close enough to examine it. A photo taken Monday by The Associated Press shows why: The gorilla's mother, Effie, has the baby in her loving cuddle. “It’s actually quite tricky to sex a young gorilla without a close-up examination,” said Rebecca Blanchard, a zoo spokesperson. “The infan Minutes before striking the bridge's support beam, the ship's lights turn off. They then turn back on moments before the vessel crashes. SPRAKEBUELL, Germany (AP) — The wind gusting across north German farm country brings much to the village of Sprakebuell: fog and rain from the sea, the occasional migrating stork, the faint smell of manure in the newly fertilized fields. And perhaps best of all, money — from selling the electricity generated by the wind turbines studding the flat green fields stretching out to the North Sea. A slice of the cash goes to the villagers themselves, with the local buy-in making this windy farming enc  While some brands are still affected by the supply chain restrictions caused by the pandemic, most car dealers have replenished their inventories and have an adequate supply of new cars. Check Out: 10... American researchers were on the hunt for new species in fish markets, according to a study. With more and more people looking for ways to minimize their impact on the planet, the auto industry has embraced the movement of producing vehicles that pollute the environment less than others and...  A lion described as a “gentle giant” celebrated his 19th birthday on March 26 at Adelaide Zoo in South Australia with some special treats.Video shows Mujambi the African lion playing with his presents, which were decorated by zoo staff.“Despite his stature and his 165 kilograms in weight, he is a gentle giant and slightly under the paw of companion lioness Amani,” the zoo’s assistant curator of carnivores and ungulates, Chad Crittle, said.Before Mujambi coupled up with Amani he suffered from seizures and also survived testicular cancer, the zoo said.According to the African Wildlife Foundation African Lions can live up to 18 years in the wild, but both Mujambi and Amani have lived beyond that expectancy at 19 and 22-years-old, respectively. Credit: Adelaide Zoo via Storyful An estimated 160,000 trees in Vancouver’s Stanley Park are being cut down because of a looper moth caterpillar infestation. Some experts say the tree cull is necessary, but there’s concern it’s too many trees and could create wildfire corridors. Video released by Yuyuantantian, a social media account affiliated with China Media Group, shows China Coast Guard vessels using water cannons to block a Philippine boat in the South China Sea where the two nations have overlapping claims.  An icy system is set to track into Quebec and northern New Brunswick, while southern sections of the Maritimes deal with prolonged heavy rain this week. Brace for difficult travel, outages and localized flooding with the storm set up As the weekend nears its end, the messy storm's impacts roll on across Atlantic Canada, including thousands of customers without power ZEBALLOS, B.C. — Intense efforts are underway to reunite an orca calf with its family pod after its mother was stranded and died in a tidal lagoon near the remote northern Vancouver Island village of Zeballos. The Fisheries Department said in a statement Monday a highly complex operation is underway to entice the juvenile whale in the lagoon to rejoin its pod, but \"time is of the essence.\" \"DFO staff on site are currently focused on doing everything possible to reunite the young whale with its p "
}