{
    "title": null,
    "date": "2/12/2024",
    "url": "https://autonews.autoua.net/en/48686-sap-doesnt-want-a-tesla-as-a-company-car-either.html",
    "text": "Global software giant SAP has decided to stop buying Tesla vehicles for its company fleet. This was reported by the Handelsblatt newspaper, citing Steffen Krautwasser, fleet manager at SAP. The reasons cited include fluctuating list prices and early deliveries from Tesla. These factors make planning more difficult and harbour higher risks. They also lead to storage and logistics problems for large orders. \"Tesla's list prices fluctuate more than those of other manufacturers, which makes planning more difficult and poses a higher risk for us,\" explained Steffen Krautwasser. This move by SAP is not an isolated case. The automotive industry has seen similar decisions from large companies such as Sixt and Hertz. Both companies are reducing their Tesla fleets. Sixt cites falling residual values due to discount campaigns such as Tesla's as the reason. Hertz points to Tesla's repeated price cuts, which reduce the resale value of fleet vehicles. Another challenge for electric vehicles (EVs) is the cost of repairing damage. Repair costs for EVs are about twice as high as those for internal combustion engines. Despite these challenges, Tesla has achieved great success. In 2023, its Model Y became the best-selling car in the world, surpassing the Toyota Corolla. However, decisions by major customers such as SAP could cause problems for Tesla if this trend continues. SAP is also taking a critical view of Tesla's technological lead. According to the company, competitors are catching up on the European market. Notable competitors include BYD, Nio and Polestar (owned by Geely/Volvo). Tesla's latest measures include several price cuts. While these measures may be aimed at boosting sales, they have led to a lower resale value of used vehicles - a problematic scenario for large customers. Source: Handelsblatt Popular brands     Social Networks "
}