{
    "title": "Musk switches Neuralink location of incorporation to Nevada",
    "date": "2/10/2024",
    "url": "https://www.foxbusiness.com/business-leaders/musk-switches-neuralink-location-incorporation-nevada",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy 'Varney & Co.' host Stuart Varney discusses the consequences of a Delaware judge striking down Elon Musk's $56 billion compensation package. Billionaire Elon Musk's cybernetic implant company, Neuralink, has changed its location of incorporation from Delaware to Nevada, state records show. The move comes about a week after Musk said Tesla would hold a shareholder vote to transfer its state of incorporation to Texas from Delaware after a judge voided his $56 billion pay package. \"Never incorporate your company in the state of Delaware,\" Musk posted on X, formerly Twitter, after that ruling came down. Neuralink did not immediately respond to FOX Business' request for comment. TESLA TO TEXAS? ELON MUSK ANNOUNCES MAJOR SHAREHOLDER VOTE Neuralink logo displayed on a phone screen, a silhouette of a paper in shape of a human face and a binary code displayed on a screen are seen in this multiple exposure illustration photo taken in Krakow, Poland on Dec. 10, 2021. (Jakub Porzycki/NurPhoto via Getty Images) Last week, Delaware judge Kathaleen McCormick sided with Tesla investors who had challenged the 2018 share-based pay package, ruling that the \"unfathomable sum\" was unfair to shareholders and negotiated by directors who appeared beholden to Musk. In response to that ruling, Musk polled X users, asking, \"Should Tesla change its state of incorporation to Texas, home of its physical headquarters?\" The results of the poll were 87.1% \"Yes\" and 12.9% \"No\" after more than 1.1 million users voted. \"The public vote is unequivocally in favor of Texas!\" Musk declared on Feb.1. \"Tesla will move immediately to hold a shareholder vote to transfer state of incorporation to Texas.\" However, switching the state of incorporation for Tesla could come with hurdles such as investor lawsuits, particularly if it was seen as a move to secure his pay package, legal experts told Reuters. TESLA LAYOFF FEARS MOUNT AS EV GIANT REPORTEDLY ASSESSING WHICH JOBS ARE ‘CRITICAL’ Chief Executive Officer of SpaceX and Tesla and owner of Twitter, Elon Musk gestures as he attends the Viva Technology conference dedicated to innovation and startups at the Porte de Versailles exhibition centre on June 16, 2023 in Paris, France.  (Photo by Chesnot/Getty Images / Getty Images) Musk announced last week that Neuralink successfully implanted its first brain chip into a human patient, who is reportedly recovering well. In September, Neuralink announced it was holding open recruitment for the first-in-human clinical trial of its wireless brain-computer interface (BCI). In the announcement, Neuralink said the Precise Robotically Implanted Brain-Computer Interface (PRIME) study would evaluate the safety of the company’s implant (N1) and surgical robot (R1), while assessing whether the device can help paralyzed people control external devices with their thoughts. ELON MUSK'S SPACEX FACING CALIFORNIA INVESTIGATION OVER SEXUAL HARASSMENT, RETALIATION CLAIMS Elon Musk, chief executive officer of Tesla Inc and X (formerly Twitter) Ceo speaks at the Atreju political convention organized by Fratelli d'Italia (Brothers of Italy), on December 15, 2023 in Rome, Italy.  (Photo by Antonio Masiello/Getty Images / Getty Images) On Jan. 28, the first implant was placed in a human. \"The first human received an implant from @Neuralink yesterday and is recovering well,\" Musk posted on X on Jan. 29. \"Initial results show promising neuron spike detection.\" GET FOX BUSINESS ON THE GO BY CLICKING HERE The tech mogul also tweeted that the first version of Neuralink is called Telepathy, explaining that it enables people to control their phone or computer, and through them almost any device, just by thinking. \"Initial users will be those who have lost the use of their limbs,\" Musk said. \"Imagine if Stephen Hawking could communicate faster than a speed typist or auctioneer. That is the goal.\" Fox Business' Greg Wehner and Reuters contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}