{
    "title": "Meta's dividend, Tesla's Musk claps back, Walmart's new stores and Fed's \nPowell pivots",
    "date": "2/3/2024",
    "url": "https://www.foxbusiness.com/markets/metas-dividend-teslas-musk-claps-back-walmarts-new-stores-and-feds-powell-pivots",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy LaSalle Network founder and CEO Tom Gimbel examines the state of the U.S. economy and reacts to the January jobs report. — Facebook parent Meta delivers surprise dividend, stock explodes — Social media CEOs skewered on Capitol Hill over child victimization — Tesla CEO Elon Musk retaliates after judge shoots down $56 billion payday — January jobs report blows away estimates, but layoffs this week mount — Federal Reserve Chairman Powell pivots on rate cut — Former President Trump on Powell's future if he wins the White House — Walmart to open 150 new stores, while adding a 3-for-1 stock split — Apple's Pro Vision is here — SEE IT: Ford's new explorer TOP STORY: SURPRISE CASH DIVIDEND: Facebook parent Meta not only surprised investors with better-than-expected quarterly results, it also announced its first-ever cash dividend, which added over $200 billion to the company's market value in one day, making CEO Mark Zuckerberg even richer…continue reading here. The move followed a tough week for Zuckerberg and his social media CEO peers who were raked over the coals by Congress over lapses on their platforms that have harmed children and, in some cases, caused fatalities…continue reading here. VIDEO: Why Facebook shares can rise another 15% on top of this year's 34% run. ELON MUSK CLAPS BACK: The Tesla CEO had his $56 billion pay package voided by a judge in Delaware, the state the company is incorporated in. The decision didn't sit well with Musk, who is rolling out a plan to fire back…continue reading here. VIDEO: Should a state judge decide CEO pay? Stuart Varney weighs in. CEO of Tesla Motors Elon Musk speaks at the Tesla Giga Texas manufacturing \"Cyber Rodeo\" grand opening party in Austin, Texas, April 7, 2022.  (Suzanne Cordeiro/AFP Via Getty Images / Getty Images) BLOWOUT: U.S. employers added a whopping 353,000 jobs in January, crushing estimates. These sectors did the heavy hiring…continue reading here. However, more recent data shows layoffs have started to soar, including UPS, which is cutting 12,000 positions…continue reading here. VIDEO: Is the job market starting to show cracks? POWELL PIVOTS: The Federal Reserve kept rates steady at January's meeting, but Chairman Jerome Powell changed his tune on when policymakers may cut rates…continue reading here. VIDEO: Former President Trump, the leading GOP candidate against Nikki Haley, tells FOX Business what he'd do with Powell if he wins the White House again. FOLLOW THE FOX BUSINESS DEBT TRACKER: HERE BIGGER IS BETTER: Walmart, already the nation's biggest retailer, wants to be even bigger…continue reading here. And in a nod to the company's associates, the retailer announced a 3-for-1 stock split…continue reading here. VIDEO: Walmart U.S. CEO John Furner on how to win. ROLLING IN: Ford rolled out its new Explorer, and the SUV has something no other company vehicle has…continue reading here. IN SIGHT: Apple's Pro Vision has landed. CEO Tim Cook hit New York City for the debut…continue reading here. Apple CEO Tim Cook greets people as they enter the Fifth Avenue Apple store Feb. 2, 2024, in New York City.  (Michael M. Santiago/Getty Images / Getty Images) STOCKS THIS WEEK: U.S. stocks notched the 4th straight week of gains, while the Dow Jones Industrial Average and the S&P 500 closed out at fresh record highs…more market coverage here. UP NEXT: -Looking for more business and market-moving headlines? Find more from FOX Business here. -Want live updates? Get the FOX Business app here. -Did someone forward you this email? Subscribe to additional newsletters from Fox News and FOX Business here. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}