{
    "title": "Tesla isn't making as much money per employee as GM and Ford",
    "date": "2/11/2024",
    "url": "https://www.autoblog.com/2024/02/11/tesla-revenue-per-employee/",
    "text": "As Tesla CEO Elon Musk reportedly ponders layoffs, recent financial reports from U.S. automakers show the leading electric vehicle (EV) manufacturer lags in the amount of revenue generated for each of its employees. Tesla reported almost $97 billion in revenue last year, equivalent to just under $690,000 for each of its over 140,000 employees. By comparison, General Motor generated over $1 million in revenue for each of its 163,000 employees in 2023, and Ford Motor raked in $937,000 for each of its 173,000 workers. Investors became increasingly worried about soft demand for EVs and increased competition after Tesla in January warned of \"notably lower\" sales growth this year. With Tesla increasingly focused on costs, the company has asked managers whether each of their employees' positions were critical, stoking layoff fears, Bloomberg News reported on Wednesday.  Tesla's stock gained over 1% on Thursday and a bit over 2% Friday, but the company has lost over $180 billion in market capitalization so far in 2024. Tesla is now valued at $603 billion, just ahead of chipmaker Broadcom at $601 billion. Tesla's gross margins - once the envy of other automakers - shrank in the December quarter to their lowest since 2019. In the same quarter, its revenue rose 3% to $25.17 billion, its slowest pace of growth in more than three years. While Tesla's revenue per worker lagged GM and Ford last year, it improved over 2022, when it was $637,000. Tesla increased its global workforce by about 10% in 2023, according to a recent filing. Wall Street's tech-related heavyweights have laid off hundreds of thousands of workers over the past two years, shedding some of the jobs they added during the coronavirus pandemic. In many cases they have continued to grow their sales. Last week, Meta Platforms reported a 25% surge in December-quarter revenue while simultaneously cutting costs and expenses by 8% after eliminating more than 21,000 jobs since late 2022. Dad buys cancer-stricken son a Mustang, Ford CEO Jim Farley helps him live for today in it Texas is refusing to register kei trucks, and owners are fighting back Jeep reveals 2024 Easter Safari concepts Elon Musk addresses Cybertruck door gap reviewer calls the 'worst I've ever seen in a production vehicle' Toyota FJ Cruiser reboot rumored to sit on Hilux Champ chassis Aston Martin hires Bentley boss as Lawrence Stroll cycles through another CEO    Please enter a display name Please sign in to leave a comment. "
}