{
    "title": "Elon Musk may be done with Delaware, but don't expect other corporations to \nfollow his crusade",
    "date": "2/21/2024",
    "url": "https://ca.finance.yahoo.com/news/elon-musk-may-done-delaware-230643279.html",
    "text": "Wall Street took a break from rally on Monday, with all three major indexes dipping slightly Elon Musk is moving SpaceX after a Delaware judge voided his $55 billion Tesla compensation package. Experts don't believe there will be a mass migration out of Delaware because of Musk's rhetoric. Musk's criticism of the judge and Delaware's legal system has been dismissed as unfounded. Elon Musk has had it with Delaware — but don't expect other corporations to flee the business-friendly state, too. Musk announced last week SpaceX was relocating from Delaware to Texas, along with this warning: \"If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible.\" The move came after a Delaware judge struck down Musk's $55 billion Tesla compensation package last month after a shareholder argued in a lawsuit the pay plan was excessive. Musk quickly took to X to blame the outcome of the case on the location of Tesla's incorporation, declaring: \"Never incorporate your company in the state of Delaware.\" But here's the thing — corporations love Delaware. In 2022, over 68% of Fortune 500 companies were incorporated in the state, while 79% of US IPOs were registered there. It's known as a low-tax and favorable home for businesses, with a history of case law that makes the legal landscape more predictable for corporations. \"There will be neither a stampede nor a trickle,\" Lawrence Cunningham, an expert on corporate governance and board member of Markel Group and Constellation Software, told Fortune of what to expect after Musk's warnings. \"There will always be frustrated and delighted customers in Delaware. All of this is both familiar and desirable.\" Musk also specifically went after the judge who ruled to void his pay package, Kathleen McCormick, calling her an \"activist and politician\" in an X post. It wasn't Musk's first brush up with Delaware or even McCormick, who also thwarted the billionaire in 2022 when he tried to back out of his $44 billion Twitter purchase. But like his complaints against the state, legal experts The Washington Post spoke with dismissed his criticisms of McCormick too, describing her as a tough but fair jurist who has won the respect of the corporate law. \"The reason Elon Musk frequently escapes account from other judges is because they don't see through his phantabulating,\" Lauren Pringle, editor of the Chancery Daily, which covers Delaware courts, told the outlet. \"They get wrapped up and star-struck. Not McCormick. She is clear-eyed as ever, and willing to take the slings and arrows that she knows will come with making a tough ruling.\" The legal experts also told the Post her ruling on the pay package was well-reasoned, in line with precedent, and unlikely to spook other business leaders. \"I don't expect a mass migration of firms from Delaware,\" Michal Barzuza, a professor at the University of Virginia who researches corporate law and governance, told the Post. \"Uncharted waters are not lawyers' favorite places to swim, generally speaking. No general counsel in their right mind is going to recommend that the company 'wing it' in a state with very little case law.\" John Coates, a law and economics professor at Harvard, told Fortune it wasn't even the first time there's been angry calls for businesses to leave the state. \"Over the past 100 years, Delaware has periodically irritated one or two executives by enforcing the law, and even led some prominent lawyers to call for companies to move elsewhere from time to time,\" Coates said. So, despite Musk's latest crusade against the state, it seems unlikely many other Delaware-based corporations will jump ship anytime soon. Read the original article on Business Insider The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein Trade 24 hours a day on the world's most popular platform. Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises.  When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. Family members said the 21-year-old suffered brain injuries and bruising throughout her body. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr., 我們致力透過體育推動全民運動，作為官方社區合作夥伴，讓逾一萬名巿民有機會體驗七欖。 (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer “The Daily Show” host tears into the former president’s claim ― and shows why the case matters.  The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit.  The former president appeared before a New York judge in an unsuccessful push to delay his hush money trial or dismiss the charges. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee The president has been going after his presumptive 2024 opponent with a little more venom than usual  The collection launches March 25. President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… The rapper was caught off guard when her \"whole boob\" fell out of her top on stage "
}