{
    "title": "Tesla Closes 2023 with Lowest Solar Deployment Since 2020",
    "date": "2/16/2024",
    "url": "https://www.roofingcontractor.com/articles/99181-tesla-closes-2023-with-lowest-solar-deployment-since-2020",
    "text": "Tesla displayed its Solar Roof and Powerwall products during the 2024 International Roofing Expo in Las Vegas. It wasn’t a great year for Tesla when it came to its solar products, though its battery and storage business boomed in 2023. The final quarter of 2023 continued a trend seen throughout the year where solar deployments decreased from previous quarters. In its Q4 earnings report, Tesla reports it deployed 41 megawatts of solar, a 16% decline from the previous quarter. When compared year-over-year, solar deployments took a 59% dive from 100 megawatts in Q4 2022. Zooming out to examine 2023’s overall solar deployments, solar dropped to a total of 223 megawatts, down 36% from 348 megawatts in 2022. This was its lowest year for solar since 2020 (205 megawatts). Like previous reports, Tesla didn’t differentiate its Solar Roof product versus more conventional solar products. In the earnings report, Tesla laid the blame on interest rates remaining high and seasonality. “Profitability in the quarter was negatively impacted by lower deployments and seasonal weakness in solar energy generation,” the report said. Though not mentioned in the earnings report, there are other factors that potentially contributed to the decline. Last August, Electrek reported that Tesla is stepping away from being an installer, instead relying on certified installers. The company was reportedly laying off staff that worked on deploying solar installations, and appears to be shifting to a supplier role in the solar industry. Tesla is seeking other avenues for its solar business. According to livemint.com, the company has recently approached the Indian government with plans to venture into the country’s rooftop solar panel manufacturing market. Tesla will reportedly provide the technology and sales expertise while a partner will aid in the manufacturing and installation. Tesla’s Solar Roof product has been fraught with hiccups and setbacks since it was first announced in 2016, including complexities with installing the roof on complicated roofs and a class-action lawsuit related to price hikes. The company has yet to hit the goal Tesla CEO Elon Musk set in 2020 that it would be installing 1,000 roofs a week on homes. Though solar has seen brighter days at Tesla, its energy storage continues to thrive. Despite dropping by 19% in Q4 2023 to 3.2 gigawatt-hours deployed — compared to 3.9 in Q3 — Tesla saw a staggering 14.7 gigawatt-hours deployed in 2023, a 125% increase from 2022. “I think we’ll continue to see very strong growth in storage,” Musk said during the company’s Q4 2023 earnings call. “I’ve said for many years that the storage business will grow much faster than the car business and it is doing that.” Tesla reported its Q4 revenue from energy storage was $1.43 billion, down from the third quarter’s total of $1.56 billion. “While we expect deployments will continue to be volatile on a sequential basis, impacted by logistics and the global distribution of projects at any given time, we expect continued growth on a trailing twelve-month basis going forward,” the earnings report said. Energy storage plays a large role in renewable energy. Tesla’s Powerwall home batteries and Megapacks store clean energy generated by wind and solar for later use, including helping homeowners and communities at large endure power outages during severe weather events. Tesla recently announced the release of its Powerwall 3, the next generation of its home energy storage system.  You must have JavaScript enabled to enjoy a limited number of articles over the next 30 days. Sponsored Content is a special paid section where industry companies provide high quality, objective, non-commercial content around topics of interest to the Roofing Contractor audience. All Sponsored Content is supplied by the advertising company and any opinions expressed in this article are those of the author and not necessarily reflect the views of Roofing Contractor or its parent company, BNP Media. Interested in participating in our Sponsored Content section? Contact your local rep! This intensive 2-day conference presents new and improved ways to run your roofing business for both commercial & residential applications. Gain invaluable knowledge from experienced industry leaders presenting sessions geared to help you improve your business and engage in exclusive networking opportunities with your peers at Best of Success. Copyright ©2024. All Rights Reserved BNP Media. Design, CMS, Hosting & Web Development :: ePublishing "
}