{
    "title": "Tesla, Is It Time To Hit The Investment Brakes On This Stock? (NASDAQ:TSLA)",
    "date": "1/18/2024",
    "url": "https://seekingalpha.com/article/4663610-tesla-is-it-time-to-hit-investment-brakes-on-tsla-stock",
    "text": "sshepard/iStock Unreleased via Getty Images  sshepard/iStock Unreleased via Getty Images There are a lot of good things to say about Tesla. They single-handedly brought electric vehicles (EVs) into the mainstream. Elon Musk took a huge chance and won on Tesla. The car industry went from questioning the legitimacy of electric to it being mandated from state to state. It's been more than 20 years since its founding and more than 13 years since its IPO. Many are unaware, but Elon was not the original founder of Tesla, but did invest in 2004. From its founding to present day, there were plenty of leadership changes, financial close calls and innovations. But there are more and more challenges facing the EV market as a whole; early adopters are running out, EVs are dying in the cold and consumer tastes are turning towards hybrids. In the face of these challenges Tesla has taken action, they have cut pricing on their models globally, as has been widely reported. They have signed agreements with other automakers like Honda, GM, Ford and many others to use their NACS charging standard going forward. This standardization will only help spur demand for EVs across all brands. Tesla has also had a great deal of success with their Energy Storage Business. For those who may not be familiar, the energy generation and storage business sells and installs solar panels for homes and energy storage products for commercial, residential and electric utility power grids. Sales growth from this business segment has been impressive but a very small part of their overall revenue. As of the 3rd quarter of 2023, it represented just over 6% of total revenue. Now, with all of the good that Tesla has done, let's look at some of the real world challenges they face. Supply of early adopters are diminishing The early adopters-the ones flush with cash and on the look out to signal to everyone that they are on the cutting edge-are drying up. The market is transitioning to people that value practical and lower costs. The idea for the graph below relates to the book “Crossing the Chasm” by Geoffrey Moore. It talks about the challenges faced when transitioning from early adopters and innovators to the majority of people that are more practical in their outlook. One of the big challenges Tesla and other EV makers are going to face is the pricing of these EVs. The 2023 Tesla Model 3 is the cheapest Tesla car currently available. The base rear-wheel drive (RWD) model has a starting price of $40,240 MSRP. Now, let's compare that to other car models that are more “affordable” as rated by Autotrader: We can see there is a big pricing difference. Why does price matter? Technology Adoption lifecycle (Medium.com) Technology Adoption lifecycle (Medium.com) Well, you can see the income difference in Early Adopters and the general public when you look at the incomes of people who have purchased Teslas so far and the rest of the population. Currently, the average household income of new Tesla owners is $150,000, and “as a comparison, the real median household income in the United States in 2022 was $74,580”: Hedges & Company. If EV makers want to target the rest of the population, they need to make their cars cheaper. Not just cheaper to buy, but cheaper to keep on the road. There have been a few articles online mentioning huge battery replacement costs. Battery replacements can be ridiculously expensive and scary! Prices can range from anywhere between $5,000 to $20,000 to replace a battery as has been reported by CarBuzz. Now, this all depends on make and model, but when I look online, they all seem to come on the higher end of these estimates, and some ridiculously more! The same article went on to say that Nissan Leaf’s battery replacements should be around $5,500 to replace, but some owners are reporting closer to $19,000. Also, one Tesla owner faced a $15,799 repair bill in 2020 after his Model 3 required a new battery. The battery itself cost $13,500, and the other $2000.00 went towards labor. All these reports and articles can be easily found online by prospective customers. The Canadian website Driving.ca recently wrote about one driver that was quoted 50,000 CAD or close to 38,000 USD in today's exchange rates to replace a battery in this 2017 Hyundai! What sane consumer would buy a used EV for $25,000, knowing when they are out of warranty they may face a similar cost to replace just the battery? In America, federal law mandates that manufacturers offer at least eight years or 100,000 mile warranties on EV batteries, but what do you do when it runs out? After a warranty expires, you have to pay for the replacement yourself! If a consumer needs to pay $20,000 for a replacement battery after only 100,000 miles, that will scare away a lot of price-conscious customers. We know they are price conscious since they are looking at used EVs. General reliability issues can be an issue with EVs On top of this, as reported by Reuters, a 2023 Consumer Reports found new EVs had 79% more problems than traditional gasoline-powered cars. “Even with monumental shifts in the auto marketplace, what matters most to consumers remains the same: finding safe, reliable cars,” said Marta L. Tellado, CEO of Consumer Reports and this latest 2023 report. The Consumer Reports goes on to say:  “The growing pains that have been plaguing EVs are still apparent in CR’s latest survey. Electric cars, electric SUVs, and electric pickups all rank among the least-reliable vehicle categories. Tesla Motors, the market leader in EV sales, continues to have issues with body hardware, paint and trim, and climate system on its models, but are not as problematic for motor, charging, and battery. At number 14, Tesla is the second-highest ranked domestic automaker in CR’s brand rankings. The Model 3 and Model Y have average reliability, while all the other Tesla models–the S, and X–are all below average.” Secondary market for EVs is bleak As one Fortune Magazine article headline read recently, “No one wants to buy used EVs and they’re piling up in weed-infested graveyards”. Why do I bring up used EVs, well, if you can’t sell your old EV when you want to, then you're going to hesitate to buy a new EV in the first place. A recent article from Forbes highlights dropping demand over the last year for used cars in general, and EVs in particular; “used EV prices are down 33.7 percent while the average used combustion car price is only down 5.1 percent”. These price drops can be corroborated with the time spent trying to sell used EVs. Used EVs take the longest to sell right now, while they were one of the quickest categories to sell just 1 year ago. When car dealers know they are going to sit on certain cars for longer, like EVs, they are forced to offer less for those cars. Used car sales data (iSeeCars) Used car sales data (iSeeCars) Survey reveals consumer preference for hybrid cars over pure EVs A few years ago, there was a surge of battery plant investment announcements from automakers. It was like every automaker was either investing billions of dollars or euros into a battery plants or they were signing cooperative agreements with rivals to build new plants or tech. As the surge of early adopters is coming to an end, the rest of the market seems to be hesitant on fully electric EVs. If you talk to most people you know, they like the idea of EVs, a very progressing choice, almost like what we were promised in the TV show, The Jetsons. But when you ask those same people why they have not gotten one yet, you will often hear: too expensive, don’t want my life to revolve around me charging my car, fear if they actually go on a road trip they won’t have a place to charge it. These are all reasonable objections. A lot of these concerns have been echoed in an AP article recently and in other news articles as well. The AP article goes on to mention that many feel hybrids have many of the same advantages of EVs, but alleviate many of their concerns regarding charging, resale market, long trips and so on. With more and more people openly preferring hybrids over fully electric EVs, I think Tesla will have their margins squeezed. Tesla valuation concerns With all the traditional automakers offering some kind of fully electric EV and offering hybrid versions of their standard gasoline cars, I don’t see how Tesla can keep on growing at phenomenal rates. You can see from the table below that their growth is slowing down. Data from Zacks.comData from Zacks.com Data from Zacks.com Data from Zacks.com You can see in the table above recent quarterly sales from Tesla. When you look at the quarterly data, it looks like sales for Tesla have already started to plateau. If this is the case, maybe Tesla has already entered the mature company phase. You can see that revenue is stable and if you just add up the last 4 quarters it comes out to 96 billion in revenue, that would make it only a 17% increase from last year. When we look at valuing Tesla, common formula like Justified P/E, P/S and P/B don’t work since they all need a dividend to be paid. We are going to need to approach this valuation by comparing ratios and deciding how long their super-fast growth rates can continue. I do believe Tesla, under the leadership of Musk can be one of the fastest-growing car companies in the future; but, will it be growing 2x as fast as its comparable competitors? I don’t think it can grow 2x as fast into perpetuity, that just defies economics when you have similar products and plenty of competition. Let's not forget that Tesla is only electric, people are pushing for hybrids. When I was looking at the sales growth data from just 2 years ago I was expecting to add a few years of above average growth to my forecast, and then discount the value back to the present, but it looks like Tesla has already hit normal market growth. Zacks.com and YahooFinance!Data from Zacks.com Zacks.com and YahooFinance! Data from Zacks.com For my estimate of yearly sales, the revenue over the last few quarters has been stable. I might as well just add the last 4 quarters and assume this is what the total will be for 2023. This may seem like a simple approach, but my numbers here are not to develop a precise income per share estimate, but rather to see if Tesla is reasonably valued, under or overvalued, or grossly under or overvalued. When I look at the numbers, I’m starting to think, Tesla is grossly overvalued. It's hard to envision a case for super-fast growth anymore with early adopters running out and consumers becoming more conscious of issues (problems) that arise with pure EV ownership. Even when you compare Tesla’s valuation to Toyota and Honda, which have similar 3-5 year earnings growth estimates, Tesla is vastly more expensive. At the end of the day, whether you're selling rubber tires, computers, or cars that are basically large computers running on rubber tires; it's all about earnings and the future growth of those earnings. Conclusion I don't see the case for Tesla’s current valuation and I don’t see the case for Tesla’s continued supercharged growth. The competition in the car market for EVs is only increasing and consumer sentiment is only shifting toward hybrids. If you take a look at the valuations of traditional car companies using P/S the average P/S is 0.4 and the highest P/S comes from Toyota at 0.93. I split the difference between the average and Toyota and picked 0.7. You can see just from P/S how much more expensive Tesla is. When it comes to reliability, even this week-after a large snowstorm in the Midwest-we get a headline from Fox that reads “Chicago-area Tesla charging stations lined with dead cars in freezing cold”. Don’t get me wrong, I’m not a detractor of Elon Musk’s vision. I will be the first in line to buy an IPO of Starlink or SpaceX if they ever come to market. Tesla has also made some quality cars, like the one written about in this motor1.com article, which has surpassed 1.2 million miles; yes miles not kilometers. But, as you read this article pay attention to some of a “small” details: Most people in the west don’t have time to orientate their lives around their cars charging schedule; we are busy enough as it is. This is why I don’t recommend a purchase of Tesla stock. I see too many headwinds affecting their sales growth and stock price. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}