{
    "title": "Tesla recalls 1.6 million cars in China to reduce risk of collisions",
    "date": "1/5/2024",
    "url": "https://www.cnn.com/2024/01/05/business/tesla-recall-china-safety-intl-hnk/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Tesla is recalling 1.6 million vehicles in China to fix problems with its Autopilot driver-assistance system and reduce the risk of collisions, a Chinese regulator said Friday. The issues can be fixed through over-the-air software updates, according to a statement from China’s State Administration for Market Regulation, the nation’s top market regulator. The Autopilot recall covers 1.61 million Tesla (TSLA) cars in the company’s second biggest market, including imported Model S, Model X and Model 3 sedans as well as Chinese-made Model 3 sedans and Model Y SUVs. The vehicles were made between August 26, 2014 and December 20, 2023. In these vehicles, drivers might “misuse” the Autopilot functions, which could increase the risk of collisions, the regulator said in the statement. The Chinese recall follows the recall of nearly all 2 million Tesla cars on US roads last month after the US safety regulator found the Autopilot system could be used in ways that posed an increase risk of crashes. Here’s what you need to know about BYD, the Chinese EV giant that just overtook Tesla As examples, the US regulator cited using Autopilot on local streets, rather than limited access highways, or without drivers paying attention or having their hands on the steering wheel. That recall came after analysis of roughly 1,000 US crashes involving Tesla with Autopilot in use. Tesla will update the software system for the recalled vehicles, including adding controls and alerts to “further encourage the driver to adhere to their driving responsibility,” the Chinese regulator added. The limitations on Autopilot serve as a blow to Tesla’s efforts to market its vehicles to buyers willing to pay extra to have their cars do the driving for them. A second Chinese recall — covering 7,538 imported Model S sedans and Model X SUVs — relates to the risk that doors could unlatch and open during a crash, the regulator’s statement said. These vehicles were manufactured between October 26, 2022 and November 16, 2023. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}