{
    "title": "Elon Musk's Compensation Is 'Tornado Situation' For Tesla: Analyst Calls \nFor New Plan To Satisfy CEO, Shareholders",
    "date": "1/31/2024",
    "url": "https://www.tradingview.com/news/benzinga:dd56352a3094b:0-elon-musk-s-compensation-is-tornado-situation-for-tesla-analyst-calls-for-new-plan-to-satisfy-ceo-shareholders/",
    "text": "A 2018 compensation plan for Tesla Inc TSLA CEO Elon Musk that was worth over $55 billion was voided Tuesday in a ruling by a Delaware judge. A leading Tesla analyst weighs in on what the ruling means and what's next for Tesla. The Tesla Analyst: Wedbush analyst Daniel Ives has an Outperform rating on Tesla and a price target of $315. The analyst recently lowered the price target from $350 after Tesla's fourth-quarter earnings report. Related Link: Tesla Q4 Earnings Highlights: Revenue Miss, EPS Miss, Model Y A Global Bestseller, Next-Gen Vehicle Update And More The Analyst Takeaways: Delaware judge Kathaleen McCormick made a shocking ruling against Musk and Tesla Tuesday, Ives said. \"This lawsuit has been stuck in Delaware courts and was widely viewed by investors it would be thrown out and instead it now creates a tornado situation for Tesla's Board in the next move with the Street closely watching this poker move,\" Ives said. Ives said the next move is in the hands of Tesla's board of directors. Tesla's board can appeal the decision, create a new compensation package that replaces the 2018 one or create an entirely new compensation package that includes getting Musk back to the 25% voting share he recently requested. \"We ultimately believe this decision will be a catalyst for the board to take the situation into its own hands and come up with a new comp package that could satisfy both shareholders and Musk helping put this 2018 comp package noise in the rear-view mirror.\" Ives added that he expects a statement from the Tesla board in the next 24 hours to respond to the judge's ruling and what could be next. \"Musk is Tesla and Tesla is Musk and shareholders need Musk locked into Tesla through this next phase of the EV growth and AI endeavors over the coming years.\" Ives recently shared 10 ideas that could help Tesla stock after the fourth-quarter earnings report. One of the points was creating a new compensation plan that locks Musk in as the CEO of Tesla through 2030. TSLA Price Action: Tesla shares are up 0.67% to $192.87 on Wednesday versus a 52-week trading range of $152.37 to $299.29. Shares of Tesla are up 14% over the last year. Read Next: ‘Jaw Dropper:’ Tesla Analysts, Investors Unpack Fallout From CEO’s $55B Pay Plan Collapse While Musk Laments ‘Parasitic Load’ Of Being A Public Company Photo: Shutterstock Latest Ratings for TSLA View More Analyst Ratings for TSLA View the Latest Analyst Ratings © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}