{
    "title": "Tesla Erases $80 Bln in Valuation after Musk's Sales Warning",
    "date": "1/26/2024",
    "url": "https://japannews.yomiuri.co.jp/news-services/reuters/20240126-164698/",
    "text": "Please disable the ad blocking feature. To use this site, please disable the ad blocking feature and reload the page. This website uses cookies to collect information about your visit for purposes such as showing you personalized ads and content, and analyzing our website traffic. By clicking “Accept all,” you will allow the use of these cookies. Users accessing this site from EEA countries and UK are unable to view this site without your consent. We apologize for any inconvenience caused. By Aditya Soni 14:03 JST, January 26, 2024 Jan 25 (Reuters) – Tesla TSLA.O tumbled over 12% on Thursday after CEO Elon Musk warned sales growth would slow this year despite price cuts that have already hurt margins at the world’s most valuable automaker and fueled investor concerns about soft demand and Chinese competition. Musk said on Wednesday that growth would be “notably lower” as Tesla focuses on a cheaper, next-generation electric vehicle to be made at its Texas factory in the second half of 2025, which is expected to spark the next boom in deliveries. But he said ramping up production of the new model would be challenging because it would involve cutting-edge technologies. Tesla’s stock suffered its sharpest intraday percentage loss in more than a year, with $80 billion in market value wiped out on Thursday. That pushed its market capitalization loss for the month to about $210 billion. “The Tesla headlines have essentially gone from bad to worse,” said TD Cowen analysts, noting that the fourth-quarter revenue and profit were also below expectations. Shares of other EV makers also fell, with Rivian Automotive Inc RIVN.O, Lucid Group LCID.O and Fisker FSR.N down between 4.7% and 8.8%. The EV industry has been grappling with a slowdown in demand for more than a year and the price cuts by Tesla will likely worsen the pressure on the startups and automakers such as Ford F.N. “The problem for Tesla is any significant attempt to boost sales from here on will probably need to be achieved at the cost of further falls in operating margin, due to having to compete with BYD in China, as well as increased competition elsewhere,” said Michael Hewson, chief market analyst at CMC Markets. At least nine brokerages downgraded the stock, while seven raised their ratings. The company, on average, has a “hold” rating with a median price target of $225, 23% higher than the share’s closing price of $182.63 on Thursday. Tesla short sellers have made $3.45 billion so far this year, making it the most profitable U.S. short trade, according to data and analytics firm Ortex. The company’s stock trades at nearly 60 times its 12-month forward earnings estimates, according to LSEG data. That gives it a more premium valuation than the other “Magnificent Seven” stocks – a group that includes Apple, Microsoft and Nvidia. Some analysts said valuation could become tough to justify if Tesla’s sales growth and margin weaken further. “Tesla is increasingly looking like a traditional auto company,” said Bernstein analyst Toni Sacconaghi. JN ACCESS RANKING The Japan News / Weekly Edition Our weekly ePaper presents the most noteworthy recent topics in an exciting, readable fomat. Read more eng jp © 2024 The Japan News - by The Yomiuri Shimbun "
}