{
    "title": "Elon Musk seeks greater share of Tesla before pushing AI ambitions",
    "date": "1/16/2024",
    "url": "https://www.theguardian.com/technology/2024/jan/16/elon-musk-ai-share-tesla",
    "text": "Musk says he is not comfortable with Tesla becoming market leader in AI and robotics without at least 25% voting control The Tesla chief executive, Elon Musk, said he would be uncomfortable growing the automaker to be a leader in artificial intelligence and robotics without having at least 25% voting control of the company, nearly double his current stake. Musk said on Monday in a post on social media platform X, formerly known as Twitter, that unless he got stock in the world’s most valuable automaker that was “enough to be influential, but not so much that I can’t be overturned”, at Tesla, he would prefer to build products outside of the electric-vehicle manufacturer. He has long touted Tesla’s partially automated “full self-driving” software and its prototype humanoid robots but the electric-vehicle maker generates most of its revenue from its automotive business. Some analysts have also pegged the technologies, including Tesla’s Dojo supercomputer to train AI models, as drivers of the EV maker’s valuation, with the Morgan Stanley analyst Adam Jonas saying in September that Dojo could boost its market value by almost $600bn. Tesla’s shares fell about 2% in pre-market trading on Tuesday, following Musk’s comments. Musk, the world’s richest person, currently owns around 13% of Tesla stock after selling billions of dollars of shares in 2022 partly to help finance his $44bn purchase of Twitter. In a separate post on X, he said he would be fine with a dual-class share structure to achieve his goal of getting 25% voting control, but was told it was impossible after Tesla’s initial public offering. “It’s weird that a crazy multi-class share structure like Meta has, which gives the next 20+ generations of Zuckerbergs control, is fine pre-IPO, but even a reasonable dual-class is not allowed post-IPO,” he said, referring to the Facebook parent’s founder, Mark Zuckerberg. Companies with dual-class structures have two or more types of shares with different voting rights: usually one with greater voting rights for founders or early investors, and another for other shareholders with less voting power. Tesla did not immediately respond to a request for comment. Musk currently faces a lawsuit over his compensation package. Tesla shareholder Richard Tornetta sued Musk and the board in 2018 and hopes to prove the co-founder used his dominance over Tesla’s board to obtain an outsized compensation package that did not require him to work at the EV maker full-time. Musk said on X there was no “feud” with the board over his new compensation package and said the pending verdict was holding back the discussions. "
}