{
    "title": "4 Key Takeaways From Elon Musk's Remarks During Tesla's Earnings Call",
    "date": "1/24/2024",
    "url": "https://www.investopedia.com/4-key-takeaways-from-elon-musk-s-remarks-during-tesla-s-earnings-call-8549480",
    "text": " Alain Jocard / AFP / Getty Images After Tesla's (TSLA) fourth-quarter earnings fell short of analyst estimates Chief Executive Officer (CEO) Elon Musk joined other company leaders on the electric vehicle (EV) maker's earning call. Musk touched on investor concerns including profitability, voting control of the company amid the artificial intelligence (AI) boom, Tesla's humanoid robot, and Cybertruck deliveries. \"If the interest rates come down quickly, I think margins will be good and if they don't come down quickly, they wouldn't be that good,\" Musk reported. Tesla indicated that reduced vehicle prices dragged down the company's revenue in the fourth quarter. The EV maker offered significant price drops to buyers as macroeconomic conditions like high interest rates affect consumers' spending. The auto industry at large offered discounts on vehicles, led by a 25% drop in the average sale price or Tesla vehicles in December compared with a year earlier. The Fed signaled at the end of 2023, that rate cuts are expected in the second half of 2024. Musk said that \"it's not that people don't want [to buy Tesla vehicles]\" they \"simply cannot afford it\" in a high-interest-rate environment. Musk said he is \"aiming for a strong influence, but not control\" of Tesla before ramping up AI initiatives. Earlier this month, Musk took to X (formerly Twitter), which Musk owns, to say that he wants 25% voting control of the company before advancing Tesla's position in the AI race. He wrote that he is \"uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control. Enough to be influential, but not so much that I can’t be overturned.\" When asked during the earnings call if retail investors should be concerned about his statements, Musk said that while he \"see[s] a path to creating an artificial intelligence and robotics juggernaut of truly immense capability and power,\" he is concerned that, without more influence, he could \"be voted out by some sort of random shareholder advisory firm.\" Musk said that 25% control is \"not so much that I can control the company even if I go bonkers,\" noting he could be dismissed under that circumstance. \"But it's enough that I have a strong influence. That's what I'm aiming for.\" Tesla has \"got a good chance of shipping some number of Optimus units next year,\" Musk said. Optimis, Tesla's humanoid robot, has been in the works since 2022. Tesla's bot uses some of the AI technology that powers its self-driving cars. The EV maker recently shared a video of the Optimus Gen 2 walking and performing basic tasks. Musk did note that \"there's a lot of uncertainty\" as it \"is a brand new product,\" but said that the company \"will be updating [the] public with progress\" as the project progresses. The Tesla CEO added that he thinks that the Optimis humanoid robot has the potential to be the \"most valuable product of any kind, ever.\" The Cybertruck delivery issues are \"very much a production-constrained situation, not a demand-constrained situation,\" according to Musk. Tesla delivered its first Cybertrucks, which were first announced in 2019, at the end of 2023. The truck led to some investors raising concerns surrounding delivery and profitability challenges. Musk said that the company \"could dramatically raise the price\" to address high demand amid low supply but that it \"doesn't feel right.\" The CEO indicated that Tesla expects to deliver around 250,000 Cybertrucks annually in North America. Tesla. \"Tesla Q4 and full year 2023 Financial Results and Q&A Webcast.\" Youtube. \"Optimus - Gen 2.\" "
}