{
    "title": "Cathie Wood Reinforces Faith In Tesla Despite Stock's Slump Following Q4 \nDouble Miss, Ark Buys Whopping $",
    "date": "1/27/2024",
    "url": "https://www.benzinga.com/markets/equities/24/01/36815532/cathie-wood-reinforces-faith-in-tesla-despite-stocks-slump-following-q4-double-miss-ark-buys-who",
    "text": "Tesla, Inc. TSLA stalled its post-earnings sell-off on Friday and ended modestly higher for the session. As the stock bounces around an eight-month low, Cathie Wood’s Ark Invest continued to pile into the stock. What Happened: Ark’s flagship exchange-traded fund, the Ark Innovation ETF ARK, and the Ark Next Generation ETF ARKW accumulated 182,541 Tesla shares Friday. At Friday’s close of $183.25, the purchase is valued at $33.45 million. On Thursday, after the stock’s 12%+ drop, Ark beefed up its Tesla stake by 177,870 shares or $32.48 million. The aggregate purchase for the week was $65.93M worth of Tesla shares. See Also: Everything You Need To Know About Tesla Stock Why It’s Important: Tesla shares have been on a downtrend since late October, trimming the stock’s annual gains to about 101%. The weakness continued into the new year as the broader market rally stalled in early January amid apprehensions over whether the Fed will cut rates. Even as the other mega-cap tech stocks, collectively called “Magnificent Seven,” recovered in the second half of the month amid earnings optimism, Tesla continued to sag. Ahead of Wednesday’s earnings report, traders chose to remain on the sidelines amid uncertainty over the company’s fourth-quarter performance. Tesla reported a double miss and spooked investors further by flagging the prospect of a significant slowdown in volume growth in 2024. Wood, on the other hand, is still bullish on Tesla and sees the stock hitting $2,000 by 2027, with a majority of the estimated enterprise value likely coming from the yet-to-be launched robotaxi service. Tesla is the second-biggest holding of ARKK and the sixth-biggest holding of ARKW. ARKK closed Friday’s session up 0.22% at $45.92, according to Benzinga Pro data. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Tesla Alienates Investors With Sketchy Near-term Outlook, Rivian’s Rumored R2 Global Premiere, Canoo On A Roll: Biggest EV Stories Of The Week Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}