{
    "title": "Abercrombie & Fitch stock soars, rivals Nvidia as Tesla, Elon Musk sink",
    "date": "2/15/2024",
    "url": "https://qz.com/abercrombie-fitch-stock-nvidia-tesla-magnificent-seven-1851261000",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Most of the so-called “Magnificent Seven” tech stocks are having a pretty good year. Apple stock is down 2%, but the big loser of the bunch continues to be Tesla, whose shares have sunk by more than a fifth since the end of 2023. Not so magnificent. So here’s a proposal: Drop Tesla from the Magnificent Seven and add in mall retailer Abercrombie & Fitch. Tesla is in a bunch of trouble: Its latest-and-greatest product is a rusty truck that has trouble going uphill in the snow. Its losing EV market share in the U.S. CEO Elon Musk reportedly has a drug problem so bad his board member friends want him to go to rehab. And Musk is at risk of losing his status as the world’s richest person, with Jeff Bezos catching up as he sells Amazon stock and Musk is losing ground as Tesla stock sinks to the bottom of the S&P 500. Abercrombie & Fitch, on the other hand, had a great year last year that isn’t slowing down. Its stock even beat chipmaker and Wall Street darling Nvidia, plus its turnaround strategy positioned it well to take advantage of rising consumer spending. Is Abercrombie a “technology” company? Not exactly. But stock groupings that get nicknames are all arbitrary anyway. Amazon is a logistics company. Apple makes gadgets. Meta makes alternate universes. But ooh, look! Last year, Abercrombie chief digital officer Samir Desai told an audience at the CommerceNext conference that artificial intelligence is an increasingly important part of his company’s business. “We feed [the tech] historical images of products that have sold really well and use prompts to iterate and refine and base a new line off of that,” he said. “It’s driving inspiration, it’s driving velocity and how quickly [the team] can produce product images.” See! There you go. Tesla out. Abercrombie in. Happy trading. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}