{
    "title": "Tesla rakes in US$9 billion from carmakers failing to sell enough EVs",
    "date": "2/10/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/tesla-rakes-us9-billion-carmakers-failing-sell-enough-evs",
    "text": "TESLA continues to cash in on other carmakers needing help to meet emissions standards, keeping up a lucrative business the company thought would fade away. The Elon Musk-led manufacturer generated US$1.79 billion in regulatory credit revenue last year, an annual filing showed last week. That brought the cumulative total Tesla has raked in since 2009 to almost US$9 billion. Selling regulatory credits is a tidy business for Tesla. It earns them by making and selling electric vehicles (EVs), then sells the credits to manufacturers whose new-vehicle fleets exceed emissions limits set by various authorities, including in China, the European Union and state of California. Tesla bears little to no incremental cost earning the credits, so the sales are virtually pure profit. Three and a half years ago, Tesla’s chief financial officer said he expected the revenue to gradually dissipate. “We don’t manage the business with the assumption that regulatory credits will contribute in a significant way to the future,” then-CFO Zachary Kirkhorn said during a July 2020 earnings call. “It will continue for some period of time, but eventually this stream of regulatory credits will reduce.” Start and end each day with the latest news stories and analyses delivered straight to your inbox. Tesla made US$1.58 billion selling regulatory credits that year. While the company generated about 7 per cent less credit revenue in 2021, it is brought in more than US$1.7 billion each of the last two years. It is no secret that auto executives rue the fact they have had to kick money Tesla’s way for this purpose. “It really makes them mad that Tesla got so much of a boost out of being the only purely electric-car manufacturer out there,” Mary Nichols, the former chair of the California Air Resources Board, told Bloomberg News in 2017. “In effect, they helped to finance this upstart company which now has all the glamour.” While more EV makers have emerged since then, Tesla’s regulatory-credit business may still have room to run. Automakers including Volkswagen (VW) and General Motors (GM) have fallen short of their EV goals and delayed or cancelled electric-vehicle manufacturing investments. VW and GM both have needed help meeting emissions standards in recent years, as has Honda Motor and Jaguar Land Rover. Meanwhile, emissions rules are not getting any easier. Europe has set stricter car-emissions targets starting next year and from 2030 onward, while the United Kingdom adopted a zero-emission vehicle mandate beginning this year. BLOOMBERG BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}