{
    "title": "Uber teams up with Tesla on an unprecedented initiative to help ride-share \ndrivers: 'There is much more we can do …'",
    "date": "2/11/2024",
    "url": "https://news.yahoo.com/uber-teams-tesla-unprecedented-initiative-220000581.html",
    "text": "The ride-sharing giant Uber has teamed up with Tesla to take steps toward fulfilling its pledge to become a zero-emission platform in the United States, Canada, and Europe by 2030 and worldwide by 2040. This collaboration attempts to address two key factors that Uber drivers say prevent them from using electric vehicles: charging station accessibility and the cost of purchasing an EV, Teslarati reported. “The road to zero emissions requires transparency and being accountable for progress year after year,” CEO Dara Khosrowshahi said in a statement addressing Uber’s approach to climate change. “Uber is proud to be the first mobility platform to measure and report on emissions from customers’ real-world use of our products.” Uber is committed to transparency and accessibility when it comes to its approach to sustainability. In its Climate Assessment and Performance Report, Uber states, “About 74,000 ZEV drivers a month, on average, actively used Uber’s app in Q3 2023 in the US, Canada, and Europe. That’s nearly double the same period a year earlier.” While Uber has partnered with Hertz to allow drivers the opportunity to rent Teslas on a weekly basis, this concept did not appeal to every driver since the cost cuts into their profits. Uber responded by partnering with Tesla and offering an incentive worth up to $2,000 on the purchase of a Tesla Model 3 sedan or Model Y Crossover. The second problem this collaboration addresses is the accessibility of charging stations throughout cities. Uber has started sharing with Tesla location data relating to where most drivers make their trips in order to provide insight about where Tesla should install charging stations. This will help alleviate the scarcity of charging stations Uber drivers may face in certain cities. To help manage battery life, Tesla-driving Uber drivers have the ability to sync their vehicles to the Uber app, which will filter ride requests by the Tesla’s remaining battery level, the Tesmanian blog reported. “We are excited to work with Tesla to tackle both of these issues. Working with cities, there is much more we can do together to speed up the pace of electrification,” said Andrew Macdonald, senior vice president of mobility and business operations at Uber. It seems both Uber and Tesla are determined to help highlight sustainability in order to fight climate change. In response to this collaboration, Electrek writer Fred Lambert said: “This is cool. EVs make so much sense for Uber drivers if they have easy access to charging. They can save hundreds of dollars and sometimes over $1,000 per month just with gas savings.” Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet. "
}