{
    "title": "Tesla's design chief leads workouts in parking lot",
    "date": "2/19/2024",
    "url": "https://www.businessinsider.com/teslas-design-chief-leads-workouts-in-parking-lot-2024-2",
    "text": "       Tesla's design chief Franz von Holzhausen isn't all work and no play — at least according to a new profile of the Cybertruck designer. Von Holzhausen, who has worked closely with Tesla CEO Elon Musk, likes to lead fitness training in the company parking lot, The Wall Street Journal reported on Friday. Von Holzhausen and a team of about 300 Tesla staff work out of a design studio that was made out of a converted airplane hangar in Los Angeles, according to the report. Related stories During lunch at the office, von Holzhausen and others would participate in workout classes led by a CrossFit trainer, but now the designer hosts what some call \"FranzFit\" training, according to the Journal. Von Holzhausen didn't immediately respond to a request for comment from Business Insider, but told the Journal regarding the workouts: \"I don't like to lose. Maybe it's a good outlet for that.\" The designer joined Tesla in 2008, just a few months before Tesla released its first car, the Roadster. He previously designed products for Volkswagen, General Motors, and Mazda. At Tesla, von Holzhausen reports directly to Musk and was known to meet with the CEO on a weekly basis in order to discuss his team's latest ideas, according to Walter Isaacson's biography on Musk. But in the wake of Musk's Twitter purchase, the meetings aren't as regular, according to the Journal. Though, von Holzhausen told the publication the billionaire is still \"very involved\" and sometimes shares design ideas from social media. Musk has developed a reputation for being a difficult person to work for — from sleeping in the office to reports Musk has denied that he rage-fires employees. Von Holzhausen possesses three qualities that help him collaborate with Musk, according to the Journal. \"Those who've worked with von Holzhausen described him as decisive, hard to fluster and open to new ideas, qualities that have helped him form a close bond with Musk and thrive at a company known for high executive churn,\" the Journal wrote. Von Holzhausen's work at Tesla has made him one of the most influential designers of his generation. His simplistic and user-friendly designs for the electric-car maker have been compared to what Jony Ive created for Apple. The Tesla designer has taken up more of the spotlight in recent months amid the release of the futuristic-looking Cybertruck and Musk's announcement regarding the carmaker's next-gen platform. Von Holzhausen has been pictured around town showing off the Cybertruck in the lead-up to the truck's release on November 30 and even appeared on Jay Leno's YouTube show \"Jay Leno's Garage\" to discuss the truck.  Read next Jump to "
}