{
    "title": "Elon vs Tesla shareholders",
    "date": "2/4/2024",
    "url": "https://www.ft.com/content/6b7dd3f4-fc5c-482d-8766-79d9c059b424",
    "text": " Katie Martin Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. Me again, filling in for Harriet Agnew, who is still on her hols. I don’t know what it is about newsletters, but readers are really quick to get in touch and say hi, which is nice. Hi back. Anyway, here’s the lowdown on asset management for this week. You’ll be back in Harriet’s capable (and tanned) hands next time. If any institutional fund managers were ever concerned that they lack the heft to really force change on the part of large companies whose shares they own, I present one Richard J Tornetta, a former thrash metal drummer who sued Elon Musk on behalf of all shareholders in 2018. Tornetta reportedly held nine shares in Tesla at the time. Tornetta should be one of the happiest investors on the planet. Assuming he still holds those shares, he is up a cool 750 per cent or so. Chapeau. But last week his lawsuit stripped Musk of a $55.8bn payday on the basis that the pay package did not go through a “fair” process — a ruling that has elicited the kind of calm, collected response from Musk that you might expect. (He will “immediately” hold an investor vote on shifting the company’s corporate registration from Delaware to Texas, as my colleagues William Sandlund and Peter Campbell report. If it happens, Tesla will be five times bigger than all the Texas-incorporated Russell 3000 stocks put together, FTAlphaville’s Bryce Elder adds.) The ruling “creates a tornado situation for Tesla’s board”, said Dan Ives, an analyst at Wedbush. But it could prove to be music (possibly thrash metal) to the ears of activist investors and others who have griped about the inability of Tesla’s board to rein in Musk for years. As my colleague John Gapper noted in his column, several of the board directors who originally signed off on Musk’s share options used to go on family holidays with him. John continued: “One director of Tesla, whose board currently includes Musk’s brother and the media investor James Murdoch, said that they awarded him the options in stages to give him the regular ‘dopamine hits’ that they thought he needed.” In passing down the verdict, judge Kathaleen McCormick noted that the directors behaved “like supine servants of an overweening master”. Supposedly pivotal moments in US corporate culture have been and gone before, but this feels like it will stick as a lesson for public company boards, and for the investors who back them. Cathie Wood — I think still the only woman in finance who is often known by her first name alone — is back. To the chagrin, no doubt, of her many detractors, she chalked up a cool 68 per cent gain in her Ark Innovation exchange traded fund last year, and she is not afraid to shout about it. By her standards this is relatively tame. Investments in Tesla helped her to a gain of more than 150 per cent in 2020, and the ETF is still nowhere close to its early-2021 peak — the best part of 70 per cent behind it, in fact. Still, she exercising her right to crow about a good year. “You would expect me to say this, but I think we did pay our dues in 2021 and 2022, and now we’re on the other side of that,” she told my colleague Will Schmitt. “Honestly, I think what happened to us in 2021 and 2022 — a worse downturn than the Nasdaq during the tech and telecom bust — that doesn’t make any sense, because innovation is here and ready for prime time,” Wood said. (As a reminder, she shed 23 per cent in 2021 — ouch — and a further 67 per cent in 2022 — double ouch.) Her style and process are clearly not for everyone. Morningstar data shows that her fund has ended up at either the very top or the very bottom of its peer group in each of the past four years. It’s from the archives, but the definitive read on the life and times of Cathie comes from Harriet, who wrote this magazine piece for us two years ago. Still worth a look if you missed it then. You know how everyone keeps saying that “bonds are back”? Well, it’s true, in every sense. Countries in the euro area issued a thumping €180bn in bonds in January, more than €30bn in excess of the January tally last year, my excellent colleague Mary McDougall reports. The really big question in global macro this year is around who will buy the huge wave of extra issuance from governments trying to make ends meet and finance the green energy transition. I’m not saying this is a made-up problem. It really could bite quite hard later this year when we get stuck in to the (deep breath) US election (and breathe out). For now, though, there seem to be plenty of willing bond buyers out there, ready to lock in decent yields. “There was an enormous consensus at the end of last year that supply was going to be problematic and the reality has been that the record supply in January has been absorbed extremely well,” said Andres Sanchez Balcazar, head of global bonds at Pictet Asset Management. GLG RIP: Robyn Grew is making her mark as the new CEO at Man Group, retiring the GLG brand — one of the best-known in the industry — and merging some teams together. Costas Mourselas has what you need to know. Ken’s cold feet: Ken Griffin, Mr Citadel, gave a pro-Nikki Haley super Pac $5mn in December and January. But now he is admitting that her path towards the GOP nomination is “narrower . . . than it was eight weeks ago”. He also told CNBC that “I think we all felt safer with Trump as president than we do right now,” which is . . . a take. Alex Rogers and Ortenca Aliaj have the details. Dry powder: US venture capitalists are sitting on $311bn in unspent cash, as they shy away from risky bets on Silicon Valley start-ups and concentrate on finding ways to return capital to their own backers. George Hammond and Tabby Kinder in San Fran have more. Bruncertainty: The UK government has paved the way for European fund managers to market their products to British investors on a long-term basis, removing some of the regulatory uncertainty created by Brexit. More here from Sally Hickey, Laura Noonan and George Parker. Odey’s money: The rightwing party Reform UK accepted a political donation from disgraced financier Crispin Odey two months after he was accused of sexual misconduct. Richard Tice, leader of the party, said he was not aware of the allegations against Odey published in the FT in June, because he did not “read the FT every day of the week. It’s a trendy lefty newspaper”. Rafe Uddin and Antonia Cundy have the story. Dry January is finally over, thank heavens. How is January so long? I’m happy to report that Mr Martin makes a mean martini — I guess the clue is in the name. Meanwhile, I’m still reading The Fund (that Bridgewater book) and honestly, if it was fiction, you would think it was a bit over the top. Eye-popping stuff.  International Edition "
}