{
    "title": "Warren Buffett Passed on Tesla — See His Other Investing Misses Over the \nYears",
    "date": "2/23/2024",
    "url": "https://finance.yahoo.com/news/warren-buffett-passed-tesla-see-130026504.html",
    "text": "Warren Buffett, the investing impresario and Berkshire Hathaway co-chairman, founder and CEO, rarely seems to make a bad move when it comes to investing. Yet Berkshire Hathaway passed on investing in Tesla, back in 2008, a move that Tesla’s CEO, Elon Musk, is rubbing in Buffett’s face today. Explore More: 10 Valuable Stocks That Could Be the Next Apple or AmazonFind Out: 6 Unusual Ways To Make Extra Money (That Actually Work) While Buffett’s portfolio isn’t hurting any, Tesla is not the only investment where Buffett and co-chairman of Berkshire Hathaway Charlie Munger have missed the mark over the years. GOBankingRates explores some of Buffett’s biggest investing misses and regrets, showing that even the top investors don’t always have perfect sight. Sponsored: Owe the IRS $10K or more? Schedule a FREE consultation to see if you qualify for tax relief. When Berkshire Hathaway first had the chance to invest in the electric vehicle company Tesla back in 2008, Tesla was only valued at $200 million, with an uncertain future. Musk recently posted that while Berkshire Hathaway’s portfolio has grown significantly since 1994, “[Buffett] could have just invested in Tesla at $200M market cap when he had the opportunity to do so.” It’s possible Musk feels slighted by the fact that his company is doing so well and that Berkshire Hathaway could have cashed in on that success — the volatile CEO has been known to flash his ego around. Today, Tesla is worth almost  $620 billion. But Berkshire Hathaway isn’t hurting either — shares in the company have increased 375% since 2008 as well. Investors Business Daily speculated that Musk, currently the second-richest person in the world, with a net worth of $177 billion, is hurt by Buffett’s investment in what can be construed as Tesla’s biggest competitors in the electric vehicle market, BYD and General Motors. Berkshire Hathaway owns 12% of BYD and nearly 4% of GM, though it did sell more than 4.2 million shares of BYD last month (it still owns 11.8% of the shares). And while Musk’s complaint may seem personal, he’s not wrong that investing in his company would have made Buffett a pretty penny. A $200 million investment in Tesla at the end of 2008 would be valued at around $620 billion today, or an astonishing 309,824% gain. Check Out: I’m a Financial Advisor: I’d Invest My First $5,000 in These 6 Stocks Buffett’s investing approach could be deemed old-fashioned in that he prioritizes “investments in businesses with both long-lasting favorable economic characteristics and trustworthy managers,” as he shared in a recent shareholder letter. As such, you won’t see Buffett jumping on the latest stock trend or hot new IPO. Yet, some analysts consider his approach to tech stocks an “aversion,” suggesting he might have missed out on some big money by hewing only to those companies that have fit into his narrow standards. Despite this tendency of his, he did surprise investors by purchasing Apple stock, and as of 2022, the company made up 40% of Berkshire Hathaway’s equity portfolio. Perhaps the most well-known misses that Buffett still regrets are not getting in early on the now massively valued companies Amazon and Google (the latter held under parent company Alphabet Inc.). Buffett’s partner at Berkshire Hathaway, Charlie Munger, has praised Amazon founder Jeff Bezos as a “miracle worker” and claimed to feel like a “horse’s ass” for not seeing Google’s potential. Buffett weighed in saying, “We blew it.” Not all of Buffett’s mistakes have been misses — one of his bigger regrets was investing in the four largest airlines: United, American, Southwest and Delta Airlines, which were worth a collective $4 billion or more pre-pandemic. The pandemic tanked stocks in these companies and Buffett sold off the company’s shares in these airlines. These shares’ drops in value contributed to Berkshire Hathaway seeing a nearly $50 billion loss in the first quarter of 2020. Another area of regret for Buffett was investing in IBM. Perhaps spurred on by his negative reputation for not investing in tech, in 2011, Berkshire Hathaway invested in IBM, which at that time seemed like it would go the distance, with name recognition and the numbers to back it up. Unfortunately, by 2015, shareholders were already displeased with IBM’s performance in their portfolios, and by 2017, Buffett had to admit his mistake. He still saw IBM as a strong company, but it wasn’t keeping up with the necessary technological change that would keep its shares strong. Buffett ultimately sold shares in the company. Even with these mishaps, Buffett’s failures have still netted him and his shareholders more money than some people’s successes. He’s crying, as the saying goes, all the way to the bank. More From GOBankingRates 7 Best New Dollar Tree Items That Are Worth Every Penny You Can Get These 3 Debts Canceled Forever 8 Signs You'll Retire Wealthy 4 Reasons You Should Be Getting Your Paycheck Early, According to An Expert This article originally appeared on GOBankingRates.com: Warren Buffett Passed on Tesla — See His Other Investing Misses Over the Years "
}