{
    "title": "When Much Is Too Much: Elon Musk's Compensation Package – OpEd",
    "date": "2/3/2024",
    "url": "https://www.eurasiareview.com/03022024-when-much-is-too-much-elon-musks-compensation-package-oped/",
    "text": "A Journal of Analysis and News  By Binoy Kampmark When is the acquisitive nature of open frontier capitalism too much?  When Elon Musk is told that US$56 billion as a pay package is unfair.  This, at least, was the finding by Delaware Court of Chancery by Judge Kathaleen McCormick regarding the spellbinding 2018 compensation package for the planet’s wealthiest human being. McCormick and Musk already have inked some judicial history.  The same judge presided over the Twitter suit against Musk that eventually resulted in him parting with US$44 billion to acquire the company that is now sliding into merry decay as the platform X. In her sharp ruling, daring to “boldly go where no man has gone before”, let alone a Delaware court, McCormick observed that Tesla, a company of Musk’s own creation, “bore the burden of proving that the compensation plan was fair, and they failed to meet their burden.”  The question of fairness first arose in 2019, when Tesla shareholder Richard Tornetta filed a suit challenging the validity of the 2018 performance-based equity compensation plan, the largest of its type in the history of public markets. Tornetta’s primary contention was that Musk was hardly showing much devotion to the carmaker, his duties and interests spread, as it were, across a number of other corporate entities: SpaceX, OpenAI, Neuralink and the Boring Company.  Tornetta’s legal team argued that the 2018 package did nothing to focus the billionaire’s interest on Tesla and, it followed, the interests of its shareholders.  The agreement, for instance, made no mention of any such requirements as time allocation.  “Indeed,” reads the lawsuit, “Musk testified that since the Grant’s approval, he has spent a little more than half his time on Tesla matters and has dedicated substantial time and attention to various other endeavours.” The judgment acknowledges that any decision by the board of directors on what to pay a company CEO “is the quintessential business determination subject to great judicial deference.”  Delaware law, however, recognised “unique risks inherent in a corporation’s transactions with its controlling stockholder.”  When it came to dealing with “conflicted-controller transactions,” the “presumptive standard review … is entire fairness.” Here, the defendants proved “unable to prove that the stockholder vote was fully informed because the proxy statement inaccurately described key directors as independent and misleadingly omitted details about the process.”  Even by the judge’s own reasoning, the task left to the defendants was an “unenviable” one, and “too tall an order.” For the court, there were critical problems with the process leading to the approval of the compensation plan.  The judgment paints a picture of Musk essentially negotiating with himself through devotees, flunkeys and friends.  The adversarial atmosphere was never present; the “controlled mindset” all powerful. The theme of the entrepreneurial God King holding his courtiers in thrall streaks McCormick’s observations.  Musk, for instance, maintained “extensive ties with the persons tasked with negotiating on Tesla’s behalf.”  The chair of the compensation committee, Ira Ehrenpreis, had known Musk well for 15 years.  Another member of the same committee, Antonio Gracias, had an enduring two-decade business relationship with Musk “as well as the sort of personal relationship that had him vacationing with Musk’s family on a regular basis.” The entanglements do not stop there.  There is General Counsel Todd Maron, the main negotiating link between the committee and Musk.  Maron had acted as divorce attorney for Musk and admired him so much he was “moved … to tears during his deposition.” With a flawed process, things did not get much better with the negotiated price.  Again, the defendants argued that, for Tesla to continue to grow, Musk’s continued leadership was indispensable.  Keeping Musk as the main helmsman meant a rise in stockholder value.  In one estimate, offering Musk a chance to increase his ownership of Tesla from 21.9% to 28.3% would mean “6% for (US)$600 billion of growth in stockholder value.” Such arguments did not convince McCormick.  Musk already owned 21.9% of the company when the plan was approved.  He had every incentive to push the company “to levels of transformative growth” seeing what he stood to gain from it: “(US)$10 billion for every (US)$50 billion in market capitalization increase.”  The arrangements also came with no conditions on how much time Musk would devote to Tesla.  “Swept up by the rhetoric of ‘all upside,’ or perhaps starry eyed by Musk’s superstar appeal, the board never asked the (US)$55.8 billion question: Was the plan even necessary to retain Musk and achieve its goals?”  The answer: plainly not. Such observations would have stung and made good the judge’s promise to go where no previous Delaware court had dared tread.  Here was a punchy assessment about the comfortable, clique-ridden tribalism of corporate non-governance.  Musk, riled and ruffled, took to the platform X (formerly Twitter) to vent.  “Never incorporate your company in the state of Delaware,” were his words of advice. By no means does this end matter.  Musk is hardly going to be out of pocket, nor is he going to leave the company from which he continues to handsomely profit from via stocks he owns.  Fairness operates in otherworldly dimensions here.  A new compensation package, according to the judge, will have to be worked out with Tornetta.  An appeal is also possible.  “The judge’s ruling should be a wakeup call (for Tesla shareholders) that things have gotten out of hand,” remarks Andrew Poreda, who also invests in Tesla through exchange-traded funds.  In this overgrown corporate jungle, it is questionable whether things were ever really in hand. Binoy Kampmark was a Commonwealth Scholar at Selwyn College, Cambridge. He lectures at RMIT University, Melbourne. Email: [email protected] Your email address will not be published. Required fields are marked * Comment * Name * Email * Website  By Sushant Sareen If bombing by fighter aircraft and drones, covert targeted killing operations, and hit-and-run raids on jihadist bases Many European leaders are well aware that the ONLY \"negotiation\" demanded by the Russian invaders is the complete capitulation by… A very exhaustive account. Should I ever decide to convert to Islam, I know who to consult. \"Understandable reaction\"? Sorry, I don't digest history with the naivety of a 12-year-old engrossed in comic books. This is precisely… Sorry, but the Crusades were not a putrefaction but rather an understandable reaction to the invasion of the murderous Islamic… Secularist is someone who believes that religion should not be involved with the ordinary social and political activities of a… "
}