{
    "title": "Automakers' share of China's NEV market in Jan: BYD tops with 31%, Tesla \n5th with 6%",
    "date": "2/18/2024",
    "url": "https://cnevpost.com/2024/02/18/automakers-share-of-china-nev-market-jan-byd-tesla/",
    "text": "Home » BYD Among the top 5, Tesla only produces BEVs, while the other automakers produce both BEVs and PHEVs.  BYD (OTCMKTS: BYDDF) continued to dominate China's NEV (NEV) market in January, with its share well ahead of second place. BYD's retail sales of NEVs in January were up 48.0 percent year-on-year to 206,904 units, according to a ranking table released today by the China Passenger Car Association (CPCA). BYD topped the Chinese NEV market in January with a 31 percent share, the only one with a share of more than 10 percent. BYD released figures earlier this month showing it sold 201,493 NEVs in January. Those figures are wholesale sales and include dealer inventory. Geely had retail sales of 64,286 NEVs in January, up 632.1 percent year-on-year, to take second place with a 9.6 percent share. Changan Automobile's NEV retail sales in January were 51,109, up 181.9 percent year-on-year, and third with a 7.7 percent share. SAIC-GM-Wuling had retail sales of 41,066 NEVs in January, up 132.8 percent year-on-year, and was fourth with a 6.2 percent share. Tesla (NASDAQ: TSLA) had retail sales of 39,881 in China in January, up 48.6 percent year-on-year, and ranked fifth with a 6.0 percent share. In China, NEVs include battery electric vehicles (BEVs), plug-in hybrids (PHEVs), and fuel cell vehicles, with the former two dominating. Among the top five, Tesla only produces BEVs, while other car companies produce both BEVs and PHEVs. The CPCA does not publish rankings for BEV sales, though it released data earlier this month showing that China sold 376,000 BEVs in January, with Tesla's share of the BEV market at 10.61 percent. BYD also had the highest retail sales in the overall passenger car market in January, with a 10.2 percent share. Changan and Geely ranked second and third in China's passenger car retail sales rankings with 9.3 percent and 9.2 percent shares, respectively, according to CPCA.  China's NEV retail at 668,000 in Jan, down 29.5% from Dec  "
}