{
    "title": "Tesla, Uber, Columbia Banking And More: CNBC’s ‘Final Trades’ - Tesla \n(NASDAQ:TSLA)",
    "date": "2/9/2024",
    "url": "https://www.benzinga.com/trading-ideas/long-ideas/24/02/37027334/tesla-uber-columbia-banking-and-more-cnbcs-final-trades",
    "text": "On CNBC’s \"Halftime Report Final Trades,\" Liz Young named  ProShares S&P 500 Dividend Aristocrats ETF NOBL  as her final trade. Jenny Harrington of Gilman Hill Asset Management, LLC said  Columbia Banking System, Inc.  COLB has a 7.8% yield. Columbia Banking System reported weaker-than-expected fourth-quarter financial results. The company posted adjusted earnings of 44 cents per share, missing market estimates of 79 cents per share. The company’s quarterly sales came in at $519.16 million versus expectations of $526.68 million, according to data from Benzinga Pro. Don’t forget to check out our  premarket coverage here Bill Baruch of Blue Line Capital picked  Tesla, Inc.  TSLA. The Austin, Texas-based carmaker cut prices on its costliest Model Y version in Canada, days after it cut prices on two of its lower-priced versions. The Model Y Performance is now priced at C$69,990 ($51,911.23) on the company website, down 5.8% or C$4,300 (about $3190) from the earlier starting price of C$74,290 ($55,100). Josh Brown  of Ritholtz Wealth Management named  Uber Technologies, Inc.  UBER as his final trade. Uber reported better-than-expected sales for its fourth quarter on Wednesday. The company posted fourth-quarter FY23 revenue growth of 15% year-on-year to $9.94 billion, beating the consensus of $9.76 billion. Uber’s GAAP EPS of 29 cents beat the consensus of 17 cents. Check This Out:  Top 5 Financial Stocks That Could Lead To Your Biggest Gains In Q1 Image: Pixabay © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}