{
    "title": "Tesla raised the salaries of its US factory workers last month",
    "date": "2/8/2024",
    "url": "https://www.notebookcheck.net/Tesla-raised-the-salaries-of-its-US-factory-workers-last-month.801584.0.html",
    "text": "Tesla currently employs over 140,000 people worldwide in over 1,200 locations (sales, service, and delivery centers alongside factories) and, two decades since its debut, is now capable of producing almost 2,000,000 vehicles a year. Many of the company's employees are located in the US and, according to documents that were recently leaked to Business Insider, the company's factory workers in the US received raises last month. The workers in Tesla's factories are divided into seven levels. Leads, on the other hand, can only move up one step. According to the leaked documents mentioned above, the entry-level workers at the Fremont factory now receive $25.25, while their top-level colleagues earn $35.50. There is no information about the payments of the leads. However, there are also areas where the salaries of Tesla's workers start at just $22. Last year's official statistics for the US auto industry show an average of roughly $28 for factory workers. Back to Tesla's leaked documents, the company's workers can move between levels every six months and can also get bonuses with the same frequency. Insiders familiar with Tesla's inner workings revealed a five-point performance review system, with the first two levels being considered insufficient for a bonus. Alongside Tesla, Toyota and Hyundai are other two big names that had to increase the salaries of their workers in the US. This was mostly due to the efforts by United Auto Workers, which is now targeting Tesla. In multiple occasions, Elon Musk made its anti-union stance very clear, and the recent salary raises might not be enough to make this threat just go away. Those waiting for their Cybertruck to arrive or who are just looking for a special gift can grab the Hot Wheels 1:10 Tesla Cybertruck Radio-Controlled Truck & Electric Cyberquad from Amazon for $97.41 instead of $110.99 for the time being. Yahoo News "
}