{
    "title": null,
    "date": "1/29/2024",
    "url": "https://seekingalpha.com/article/4665756-tesla-learn-from-the-past-think-of-the-future-rating-upgrade",
    "text": "benjaminec benjaminec In light of its disappointing Q4 2023 report, Tesla, Inc.'s (NASDAQ:TSLA) stock plunged by ~12% last Thursday. While a double miss for Q4 was disappointing, management's guidance for \"notably lower\" production growth in 2024 is sending shockwaves through Tesla's retail-centric shareholder base and the analyst community. Tesla stock chart (Google Finance) Tesla stock chart (Google Finance) While Wall Street analysts are busy lowering their lofty price targets for Tesla, I am not at all surprised to see the market's negative reaction to an underwhelming quarter. After all, TSLA was overvalued by ~40% going into 2024, offering little to no margin of safety:  In our view, Tesla is currently valued as an AI and robotics company (being given a lot of credit for futuristic projects like FSD, Dojo, and Optimus robot), and such a demanding valuation leaves little to no margin of safety [especially due to high uncertainty around the outcomes of these ambitious projects]. According to TQI Valuation Model, Tesla is currently overvalued by ~40%: TQI Valuation Model (TQIG.org) TQI Valuation Model (TQIG.org) Now, I am generally fine with the idea of paying a premium for a high-quality growth business like Tesla; however, the risk/reward isn't attractive enough to justify an investment in TSLA at current levels. From a technical perspective, a big breakout or breakdown is in the cards for Tesla in the first half of 2024. As I see it, a soft or no landing in the economy can support another wild run-up in Tesla stock. However, Tesla's valuation is already very rich, and it is hard to foresee any kind of expansion there. Furthermore, I expect an economic slowdown in 2024, which means the operating environment for Tesla could remain rough and worsen in upcoming quarters. Therefore, it is too hard to bet on a bullish breakout in Tesla. That said, easing financial conditions (lower interest rates) could help alleviate Tesla's demand and profitability concerns in 2024. Given the potential asymmetric upside of Tesla's ambitious projects, investors may decide to look beyond an economic recession [if were to end up in one]. Therefore, my cautiously bearish stance on Tesla has moderated to a neutral stance. As you may know, I hold a long position in Tesla [accumulated in late 2022: \"Tesla Stock: An Asymmetric Buying Opportunity Arises Out Of Insider Selling, Demand Concerns, And A Scary Recession Playbook\"]. And as of now, my plan of action for Tesla hasn't changed: Key Takeaway: I rate Tesla stock a \"Avoid/Neutral/Hold\" in the mid-$200s. Source: \"Tesla Stock At A Make-Or-Break Level: My Strategy For Buy, Sell, Or Hold.\" Since publication of this report in late-December, Tesla stock has lost nearly -28.5% (or $250B in market cap), and it is now sitting right above my suggested buying level (and fair value estimate) of ~$180 per share. In today's note, I will briefly review Tesla's Q4 2023 report and share my updated valuation model for the EV giant. Are you curious to learn if I am following through on my plan of action for Tesla? Read on to find out. For Q4 2023, Tesla reported revenues of $25.17B and non-GAAP EPS of $0.71, missing consensus estimates on both top and bottom lines: Seeking Alpha Seeking Alpha In Q4, Tesla's total revenue growth slowed further to just ~3% y/y (vs. 9% in Q3 2023) and GAAP gross margins declined to 17.6% (vs. 17.9% in Q3 2023) [below management's guardrail of 20%], reflecting the negative impact of price cuts. While lower vehicle ASPs and a shift in mix towards Model 3/Y continued hurting revenues and gross profit margins during the quarter, Tesla's operating margins rose to 8.2% (vs. 7.6% in Q3 2023) resulting in better-than-expected quarterly free cash flow of $2.06B in Q4. Tesla Q4 2023 Earnings DeckTesla Q4 2023 Earnings Deck Tesla Q4 2023 Earnings Deck Tesla Q4 2023 Earnings Deck During Q4 2023, Tesla delivered a record ~484K units (up 19.5% y/y) at an average selling price of $44.5K [down $600 vs. Q3 2023; and lower than the average price of a new car in the US]. For the year, Tesla met management's production target of 1.8M vehicles, exiting the year with an annualized production run rate of ~2M vehicles. While we will discuss Tesla's business outlook for 2024 in just a bit, I would like to point out that Cybertruck has moved out of \"pilot production\" to \"production,\" with Tesla pegging current production capacity at 125K+ units per year and leadership maintaining a positive view on this product and its ongoing ramp. Tesla Q4 2023 Earnings DeckTesla Q4 2023 Earnings Deck Tesla Q4 2023 Earnings Deck Tesla Q4 2023 Earnings Deck Throughout 2023, Tesla's top-line growth rates have decelerated rapidly amid a series of price cuts from the EV giant. And, according to its leadership's commentary, Tesla is likely to experience slower sales growth until the launch of its next-gen vehicle (emphasis added):  Our company is currently between two major growth waves: the first one began with the global expansion of the Model 3/Y platform and the next one we believe will be initiated by the global expansion of the next-generation vehicle platform. In 2024, our vehicle volume growth rate may be notably lower than the growth rate achieved in 2023, as our teams work on the launch of the next-generation vehicle at Gigafactory Texas. Source: Tesla's Q4 2023 Earnings Deck. While Tesla has issued no vehicle production guide for 2024, the \"notably lower\" growth outlook implies >0% y/y growth from a base of 1.8M vehicles. Given Tesla's annualized vehicles sales production rate was at ~2M in Q4 2023, I believe 2024 sales target must be at least ~2M vehicles. With CEO Elon Musk saying Tesla could start production of the next-gen vehicle in the second half of 2025, I think we will likely have to wait until 2026/27 for the next-gen vehicle to enter meaningful production, and then a year or so to ramp up big time. Hence, the next wave of rapid top-line growth at Tesla's auto business could realistically be 2-3+ years away. Now, Tesla's Energy Storage business is going strong, and it will likely continue to grow at a healthy clip. Unfortunately, it is not big enough to move the needle. And, futuristic projects like FSD and Optimus are unlikely to pay off in the next couple of years. Therefore, I think Tesla is set for a prolonged period of tepid growth. Furthermore, Tesla's dangerous recession playbook to chase unit volumes even at the cost of margins has already resulted in significant margin deterioration. And management's outlook on margins remains scary (emphasis added):  We don't know. We don't have a crystal ball, so it's difficult for us to predict this with precision. If the interest rates come down quickly, I think margins will be good. And if they don't come down quickly, they won't be that good. Yeah. It's always important to remember that the vast majority of people buying a car is about the monthly payment. It's not that people don't want. We have tons of -- we have lots of people who want to buy our car but simply cannot afford it. And as interest rates drop and that monthly payment drops, then they're able to afford it and they buy the car. It's pretty straightforward and there are no tricks around to get around this. - Elon Musk, Tesla CEO. In the event of a soft landing, interest rates are likely to remain elevated, i.e., Tesla's vehicle demand and margins stay suppressed. Conversely, in the event of a hard landing, interest rates may go down quickly (improving affordability); however, auto demand will likely fall in that environment (as consumers tend to postpone or cancel big ticket purchases in uncertain economic environments), potentially forcing Tesla into even more price cuts, i.e., continued margin suppression. As a Tesla shareholder, I really hope Musk & Co could cut costs fast enough to improve margins; however, I wouldn't bet on near-term margin expansion at Tesla. With all of this said, Tesla delivered record revenues and free cash flows in 2023 despite facing a very challenging business rate environment (caused by higher interest rates). Now, let's learn something from history. When high-flying growth companies experience a growth cliff and operating margin pressures, their stocks tend to get crushed! Just look at pandemic darlings like Zoom (ZM) and Roku (ROKU): Data by YCharts Given Tesla's financial performance, it could face a similar fate. To be clear, I am not comparing Tesla's business to Zoom or Roku; all I am doing here is highlighting the similarities in their financial performance. In the investing world, a large chunk of money managers tend to think in quarters due to performance targets, and these people don't have time to wait around for a business to find its next leg of growth, regardless of its past achievements. YCharts YCharts With slower growth and margin pressures, Tesla will lose many growth-oriented shareholders and given its lofty valuation [>50x forward P/E], value-oriented investors won't touch Tesla! Hence, I think Tesla's shareholders could have to undergo a world of pain in the next 12-24 months [especially, in the event of a hard landing]. In my previous update, I shared the following technical view on TSLA:  Upon re-drawing the lines with recent local tops and local bottoms on the weekly chart, I think we can make the case that Tesla is still trading within a symmetrical triangle pattern. Since triangles can break in either direction, Tesla looks primed for a big breakout or breakdown. WeBull Desktop As I see it, a break above $265-270 could send Tesla to $300 in quick order, and potentially to the $360-400+ range [new all-time highs] over the next 6-12 months. On the flip side, if Tesla suffers yet another rejection here, a breakdown below the $215-230 range could send TSLA stock into a tailspin that culminates in the low-to-mid $100s. From the two potential paths we discussed, Tesla has clearly picked the bearish one, breaking below the ~$215 level just before earnings and then collapsing down to ~$180 in a jiffy right after. What's next? With Tesla's murky growth and margin outlook, I can't see serious investors lining up to energetically buy the dip right here, right now. While Tesla stock is \"Oversold\" on the daily chart (RSI < 30) and a technical bounce can't be ruled out after such a rapid move lower, crashes happen from oversold levels and Tesla is potentially forming a bearish \"death cross\" pattern with 50-DMA getting close to undercutting the 200-DMA to the downside. Author, WeBull Desktop Author, WeBull Desktop If we do end up getting a death cross, I would expect selling pressure in Tesla to pick up significantly in the near-term despite \"oversold\" conditions. The symmetrical triangle has clearly broken down, and I think TSLA stock has entered a tailspin to the downside, which may ultimately culminate in our target box for the triangle, i.e., the low to mid $100s. I expect this sort of price action in a soft-softish landing for the economy - wherein Tesla's business chugs along just fine. Author, WeBull Desktop Author, WeBull Desktop Now, if we were to experience a severe hard landing in the economy over the next 6-12 months, Tesla's financial performance will likely deteriorate even further and then the range of negative outcomes could be much wider. In my view, Tesla's stock could still complete the reverse gamma squeeze we discussed in late-2022, by ending up in the mid-double digits. This idea sounds ridiculous, but if TSLA can gamma squeeze to the upside, it can reverse gamma squeeze to the downside. Now, I believe most Tesla bears will agree with this take, and most Tesla bulls will refute it. However, prudent investors must always keep an open mind, and prepare for negative outcomes. Based on fundamentals and technicals, I view Tesla's near-term risk/reward as skewed to the downside. But we must still look at long-term risk/reward to reach an informed investing decision. So, let's consider Tesla from a slightly different, more longer-term lens. In 2023, Tesla produced 1.8M vehicles and exited the year with an annualized production run rate of 2M vehicles! And, unlike most of its EV competitors (legacy auto and pure EV startups), Tesla is making billions of dollars in free cash flow making electric vehicles. Tesla Q4 2023 Earnings Deck Tesla Q4 2023 Earnings Deck Tesla Q4 2023 Earnings Deck Tesla Q4 2023 Earnings Deck Like Tesla's management, I don't know how much of its serviceable-addressable-market Tesla has already captured in its automotive business. However, I the growth runway for Tesla is very, very long. The world's transition to renewable energy is inevitable, and so is electrification of the auto market. As of 2023, EVs make up 9% of total auto sales globally, and this number will continue to rise for several years to come. Tesla Q4 2023 Earnings Call Transcript Tesla Q4 2023 Earnings Call Transcript Tesla Q4 2023 Earnings Call Transcript Tesla Q4 2023 Earnings Call Transcript Hence, Tesla may not grow rapidly over the next couple of years, but this incredible growth story has many more chapters to come. Furthermore, Tesla's Energy Storage business has incredible momentum and an even longer growth runway ahead of itself. As I shared earlier in this note, Tesla's services (& other) revenue is becoming a meaningful piece of the business, and this segment should continue to record strong growth as Tesla's fleet size increases and in general growth of the EV market [remember all major auto manufacturers are adopting Tesla's charging standard, with Tesla opening up its supercharging network to other auto OEMs]. In addition to these tangible businesses, Tesla is also developing ambitious futuristic projects like FSD (full self-driving), Optimus (humanoid robot), Dojo (AI chips), etc. While the outcome of these ambitious projects is uncertain and success is far from guaranteed, Tesla could potentially generate hundreds of billions of dollars per year if all or some of these projects were to work out. Let me share some napkin math on the potential of FSD as a recurring revenue business for Tesla: Again, this is just some napkin math, but it shows how FSD could be an absolute game changer for Tesla. During Q4 earnings call, Musk shared some interesting updates on the progress being made on this front (emphasis added):  For full self-driving, we've released Version 12, which is a complete architectural rewrite compared to prior versions. This is end-to-end artificial intelligence. So another bit nets basically photons in and controls out, and it really is quite a profound difference. This is currently just with employees and a few customers, but we will be rolling out to all customers in the U.S. who request full self-driving in the weeks to come. That's over 400,000 vehicles in North America. So this is the first-time AI is being used, not just for object perception, but for path planning and vehicle controls. We replaced 330,000 lines of C++ code with neural nets. It's really quite remarkable. Yeah, sort of, as a side note, I think Tesla is probably the most efficient company in the world for AI inference. Out of necessity, we've actually had to be extremely good at getting the most out of hardware, because Hardware 3 at this point is several years old. So I think we're quite far ahead of any other company in the world in terms of AI and inference efficiency, which is going to be a very important metric in the future in many arenas. - Elon Musk, Tesla CEO. While I remain skeptical about Tesla achieving full autonomy with FSD in the next couple of years, I am confident that Tesla is leading the race for autonomous vehicles having watched several \"Tesla owner videos\" showing intervention-free rides. Honestly, I think Tesla FSD is closer to full autonomy than most people believe it is at this stage. Tesla Q4 2023 Earnings Call Transcript Tesla Q4 2023 Earnings Call Transcript Now, I understand that FSD could need a few more years to reach full autonomy and it may fail to do so. That said, ignoring Tesla's FSD would be a grave mistake. While I don't factor in any revenues from FSD into my valuation model to instill a margin of safety there, our steady-state free cash flow (\"FCF\") margin assumption is based on Tesla building a sizeable AI/software business. For now, I am not considering Optimus and other projects like Dojo into my modeling. If those projects pay off, I will be happy to have received them as free embedded options for buying/owning Tesla stock! While Tesla is set to experience slower growth and continued margin pressures for the next couple of years, we must continue to take a long-term view of the business to determine its fair value. As such, I am sticking with our long-term growth and steady-state margins assumptions. TQI Valuation Model (Free to use at TQIG.org) TQI Valuation Model (Free to use at TQIG.org) On the back of a ~30% decline in early 2024, Tesla has lost a lot of the froth in its stock, which is now trading quite close to its fair value. Please note, TQI's fair value estimate for Tesla has moved from ~$180 to ~$174 in light of Q4 earnings. Assuming a base case exit multiple of ~25x P/FCF, I see Tesla stock going from ~$180 to ~$422 per share over the next five years at ~18% CAGR. TQI Valuation Model (Free to use at TQIG.org) TQI Valuation Model (Free to use at TQIG.org) Considering Tesla's uncertain business outlook, recent financial performance, and technicals; I view Tesla's near-term risk/reward as skewed to the downside. However, as a long-term investor, I see Tesla exceeding my investment hurdle rate of 15% over the next five years. In my view, investors with a 1-2 year investment horizon should continue to avoid Tesla. On the other hand, I like the idea of restarting accumulation for investors willing to look beyond a couple of years due to Tesla's favorable long-term risk/reward. At my investing group, we like to operate with a 5+ year time horizon, which is why we will restart slow, staggered accumulation in TSLA stock at our next bi-weekly deployment. To be clear, we understand that Tesla could drop more than 50% from current levels in the event of a hard landing. The plan is to dollar-cost average for the next couple of years even if Tesla keeps spiraling lower during this low-growth period for the EV giant. Key Takeaway: Due to a significant shift in long-term risk/reward, I now rate Tesla a modest \"Buy\" at ~$180 per share, with a strong preference for slow, staggered buying over the next 12-24 months.  Offer ends 1/31/2024. Sign up now! This article was written by \"We're in an asset bubble, and I can help you navigate it profitably\" I am Ahan Vashi, a seasoned investor with professional background in equity research, private equity, and software engineering. I currently serve as the Chief Financial Engineer at The Quantamental Investor, a community pursuing financial freedom through bold, active investing with proactive risk management. TQI was established in July 2022 with a singular mission to make investing simple, fun, and profitable for all investors. In alignment with this mission, we publish premium equity research reports on Seeking Alpha - research library - performance tracker. However, there's a lot more on offer within our investing group - features include highly-concentrated, risk-optimized model portfolios that meet investor needs across different stages of the investor lifecycle, access to proprietary software tools, and group chats. Learn more In addition to our work on SeekingAlpha, we publish best-in-class investing tidbits and research insights at TQI Tidbits [free newsletter], Twitter, and LinkedIn. Follow for more investing content. Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSLA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. At TQI, we are using QQQ Puts to hedge against significant broad market declines. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}