{
    "title": "Zacks Investment Ideas feature highlights: Tesla, Netflix, Nio, Rivian and \nLucid",
    "date": "1/26/2024",
    "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-110000423.html",
    "text": "Chicago, IL – January 26, 2024 – Today, Zacks Investment Ideas feature highlights Tesla TSLA, Netflix NFLX, Nio NIO, Rivian RIVN and Lucid LCID. Over the years, EV maker Tesla has evolved into a dynamic technology innovator. With the world’s richest man at the helm (Elon Musk), Tesla has gone from an obscure start-up to the EV king. Tesla has transformed the EV space like Netflix revolutionized entertainment. In fact, roughly 70% of battery-powered electric car sales in the United States are courtesy of Tesla. However, for four straight quarters, TSLA stock has plummeted after reporting earnings, and the stock is more than 50% off its all-time high of $414.50, which was achieved in 2021. Is it time to give up on Tesla, or is the most recent dip an opportunity for bargain hunters? Jason Goepfert (@jasongoepfert on X) ran historical price data on Tesla and made a significant discovery: “Every time Tesla gapped down 5% or more to a 6-month low, it rebounded strongly over the next 30 days. 100%-win rate, 18% (!) median return.” Thursday, Tesla gapped down more than 5% to 6-month lows. Will history repeat? Tesla’s price-to-book ratio of 12.19 (calculated by taking total assets – liabilities, preferred stock, and intangible assets) is at its lowest level since early 2020. The last time TSLA’s p/b was this low, TSLA exploded from $35 to more than $400 per share. Pure-EV competitors to Tesla are collapsing. For example, Nio, Rivian and Lucid are more than 90% off their all-time highs. Earlier this week, news broke that China is planning to unveil a massive stimulus package to boost the country’s struggling economy. In addition, the People’s Bank of China (PBOC) will allow banks to hold smaller cash reserves. Should the stimulus effort be successful, it will be a big boost for Tesla, whose second-largest market is China. Tesla is turning into a cash cow with nearly $30 billion cash on hand. With so much dry powder, Tesla’s board has the flexibility to buy back shares of TSLA or inject more cash into the business to ramp up production. As Tesla faces a stock decline for four consecutive quarters, recent data suggests a potential opportunity for investors. Historical analysis reveals that every time Tesla experienced a 5% or more gap down to a 6-month low, shares roared back in the next 30 days. Finally, an attractive valuation and cash hoard bode well for the EV king. Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Netflix, Inc. (NFLX) : Free Stock Analysis Report Tesla, Inc. (TSLA) : Free Stock Analysis Report NIO Inc. (NIO) : Free Stock Analysis Report Lucid Group, Inc. (LCID) : Free Stock Analysis Report Rivian Automotive, Inc. (RIVN) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}