{
    "title": "Eye-opening test track video reveals Tesla's top-performing safety feature: \n'Increased safety and assistance to drivers'",
    "date": "1/28/2024",
    "url": "https://www.thecooldown.com/green-business/tesla-model-y-euro-ncap-safety-assist/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. \"Imagine the countless lives we could save if more people drove Teslas.\" Photo Credit: X In another win for Tesla, a test track video released by the voluntary car safety performance assessment program Euro NCAP showed that the Model Y outperformed all other cars tested in the safety assist category. According to Euro NCAP's 2022 safety report for the Model Y, the vehicle earned a 98% rating for the performance of its safety assist features, which include speed assistance, occupant status monitoring, lane support, and an autonomous emergency braking (AEB) system. The test track video shared in April by the Tesla fan account Timmy (@elektrotimmy) on X, formerly known as Twitter, showed the Model Y beating every other car, including the all-electric VW ID.4 and the Mercedes EQS, in the AEB pedestrian category, scoring 82%. It earned the same rating in the AEB cyclist category, coming in a close second to the Mercedes EQE, which got an 83% safety score. While the Model Y performed well in all the categories, it really shined when its safety assist features, such as the collision avoidance and lane assist, were put to the test with another vehicle involved. Its AEB system, which was tested in scenarios like approaching a slow-moving car and turning in front of an oncoming vehicle, scored 98%. The Model Y's lane support features, such as emergency lane keeping, were included in that rating. \"Not all active safety systems are created equal. Even within the 5-star category, there can be considerable differences in the effectiveness of assistance systems like AEB,\" Timmy captioned the video. According to the Tesla fan site Not a Tesla App, a 2022 Tesla impact report confirmed that the company made significant upgrades to the AEB system. \"The enhancements include detecting and responding to vehicles moving perpendicular to the Tesla. This advanced feature aims to reduce the likelihood of accidents occurring when other vehicles cross Tesla's path, such as running red lights or cutting the Tesla off,\" the site stated. \"With the ability to detect crossing vehicles, Tesla's upgraded AEB system offers increased safety and assistance to drivers.\" Clearly, Tesla's unwavering commitment to improving safety has paid off, as both the Model Y — Europe's best-selling car in 2022 — and the new Model S earned top scores in Euro NCAP's 2022 safety tests. The Model S also won Best in Class in both the Executive Car and Pure Electric categories. In addition, the Model Y achieved the highest overall score in the Small Off-Roader category. \"While other car manufacturers struggle with updates, Tesla continuously improves its fleet and features. With its latest update, AEB now works in reverse and up to 124 mph (200 km/h),\" Timmy said in a post on X. \"Imagine the countless lives we could save if more people drove Teslas. With safety as a top priority, Tesla is leading the charge towards a safer future on our roads,\" Timmy added. Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}