{
    "title": null,
    "date": "1/2/2024",
    "url": "https://www.forbes.com/sites/jamesfarrell/2024/01/02/rivian-stock-falls-as-ev-deliveries-lag-as-tesla-beats-expectations/",
    "text": "Two major electric vehicle makers were trending in opposite directions Tuesday morning amid volatility in the EV market, as news of Rivian’s lagging deliveries dragged share prices down, while Tesla beat expectations and saw an uptick in pre-market trading. File - Tesla cars are parked at the construction site of the new Tesla Gigafactory for electric cars ... [+] in Gruenheide near Berlin, Germany, March 18, 2022. Tesla is expected to report fourth quarter and full year sales Tuesday as electric vehicle sales growth continues to slow. (AP Photo/Michael Sohn, File) Rivian reported Tuesday it had delivered 13,972 vehicles in the fourth quarter of 2023, falling short of the 14,000 forecasted by analysts, according to FactSet. Rivian shares were down almost 10% Tuesday morning, putting the California-based EV maker on track for its biggest single-day stock drop since Nov. 9, when it also fell nearly 10%. Tesla, meanwhile, reported delivering a record 484,000 vehicles, ahead of market estimates of around 473,000, per FactSet, finishing off the year hitting its target of 1.8 million deliveries. Tesla was up .6% in pre-market trading Tuesday morning and was up slightly just before 11 a.m. Analysts at Wedbush said in a report that Tesla’s numbers were “a clear win” for CEO Elon Musk and the company, as hitting its delivery goal was “a major achievement in a choppy macro for EVs.” It also wasn’t all good news for Tesla on Tuesday: Chinese EV maker BYD also announced it overtook Tesla in deliveries for the first time in the fourth quarter of 2023, though Tesla still out-delivered BYD over the course of the year. The numbers are posted amid concern about flagging demand in the EV industry, driven in part by high interest rates impacting EV affordability. Growing competition on the market, including from Tesla’s new Cybertruck, and an ongoing price war with Chinese EV makers, have created a challenging environment for EV automakers. Changes in EV tax credit rules also took effect Jan. 1, making many vehicles, including the Cybertruck, ineligible for tax credits, which may add further challenges to EV affordability. In October, Rivian’s shares dropped following news of an earlier-than-expected bond issuance, raising concern about the company’s financial health. But CEO RJ Scaringe pushed back against those concerns, telling Reuters that the issuance was aimed at strengthening its balance sheet before borrowing gets costlier. Tesla’s press statement Tuesday did not break out numbers specifying deliveries and production of its new Cybertruck, making it unclear how the new vehicle has performed since its debut in November amid recent reports of the difficulties in producing it. Rivian will release its fourth quarter and full year financial results Feb. 21 after markets close and Tesla will release its financials Jan. 24.   "
}