{
    "title": "Tesla Stock: Continuing The Short Bet (NASDAQ:TSLA)",
    "date": "1/17/2024",
    "url": "https://seekingalpha.com/article/4663303-tesla-continuing-the-short-bet-as-bull-thesis-depends-too-much-on-ai-and-robotics",
    "text": "nattapon1975/iStock via Getty Images  nattapon1975/iStock via Getty Images I started a short bet against Tesla (NASDAQ:TSLA) in July when shares were around $280. I have described it in two previous Seeking Alpha articles, an initial one, where I talked about the rationale and the investment thesis, and a second article where I gave an update on how it was going at the end of October last year. I was up around 120% in October, but those gains have been reduced to 80% as Tesla shares have performed relatively well in November and December. The start of the new year is a good opportunity to re-evaluate my investment thesis. I want to be very clear: I do not doubt that company fundamentals are solid and that Tesla has good long-term prospects. The problem is the valuation. Tesla’s market cap surpasses the 10 largest global auto manufacturers (by 2023 unit sales), but it is not even one of them. BYD (OTCPK:BYDDF, OTCPK:BYDDY) sold more EVs than Tesla in Q4 2023 and it is already among those 10. Not surprisingly, the bull thesis for Tesla more and more depends on Tesla being \"not just a car company\". Elon Musk recently posted this on X: Source: X Source: X This is a bold statement. In Q3 2023, 84% of revenue was in the automotive segment. So far, Tesla has not delivered an AI or robotics product, and there is no timeline for when it intends to deliver one. If you look at autonomous driving and FSD, it is – in my view – not even clear what the product and the business model would be, beyond adding a feature to a car. It seems to me that just a few days earlier Elon Musk had made it clear what the purpose of the promotion was: Source: X Source: X I think Tesla is a car company, and as a car company, Tesla will do reasonably well in 2024, but not well enough to justify a P/E ratio of around 100 (based on the $0.53 GAAP profit in Q3 2023). Because of the price reductions in 2023, revenue growth in Q3 was just 9%, and GAAP profit was even 44% lower than a year ago. Tesla's profit margins are now in line with other auto manufacturers. Car deliveries were still up by 38% in 2023, but it looks like this will come down too in 2024, putting an end to the 50% per year growth aspirations. The energy business, while solid, cannot compensate. So, this leaves autonomous driving, robotaxis, and the Optimus robot as drivers for the valuation. We can expect enormous hype around those things, but it is far from assured that we will see products delivered anytime soon. I think risks are skewed to the downside in 2024. Based on this rationale, I intend to continue the short bet and have even decided to increase my stake. There is no doubt that Tesla is growing. But is it growing enough to warrant the high valuation? Elon Musk said that unit sales will grow by around 50% per year. It should be more than 50% in some years and less in other years, so the guidance allows for flexibility. Tesla reached its goal to deliver 1.8 million vehicles in 2023, with a record 484,507 deliveries in Q3, bringing the total deliveries for the year to 1,808,581, a YoY growth rate of around 38%. QoQ growth looks less impressive, after 435,059 deliveries in Q3 and 466,140 in Q2. Q3 deliveries were lower due to maintenance shutdowns, so the Q2 number is the one we should look at here for a QoQ comparison. While the YoY 38% growth looks impressive by itself, it is not much better than what Volkswagen Group (OTCPK:VWAGY) achieved, a car company that certainly had its share of bad press in 2023. Volkswagen Group increased BEV deliveries in 2023 by 34.7% to 572,500. There is no guidance from Tesla yet on 2024 deliveries, and this will probably be one of the most discussed topics in the upcoming 2023 earnings call. It is hard to see (at least for me) where growth in the range of 30-50% is going to come from in 2024. The Model Y is the current sales driver, but the model is becoming dated (it is from 2019) and up against a variety of newer models from other manufacturers. According to Bloomberg, more than 100 new EV models will come on the market in China alone this year. Cybertruck sales will be negligible. There are rumors that a Model Y revamp is planned for 2024, but we have no confirmation from Tesla and accordingly no timeline. If the revamp is planned, volume production will unlikely happen before the second half of the year. The most obvious growth driver would be a new Model 2, but that one is very unlikely to come in 2024. Last quarter BYD overtook Tesla as the largest seller of fully electric vehicles. BYD still sells most of its cars in China. While Tesla is doing well in China, BYD is much larger there. Volkswagen Group and Stellantis (STLA) outsell Tesla in Europe with their EVs. This development is overshadowed by the popularity of the Model Y. Across all brands and models, Volkswagen Group has more than 21% market share in Europe, and Tesla only has 12%. Tesla still rules the EV market in the US with around 55% market share. But is this because Telsa is so strong or the legacy automakers, especially General Motors (GM) and Ford (F), are relatively weak? In Q4 2023, GM’s EV share was just 3.1%, and Ford (F) was not much higher at 5.3%. According to Forbes, the Swiss bank UBS forecasts EV sales growth between only 10% and 15% in Western Europe and the US in 2024. It is hard to see how Tesla, although the only real global player in the EV market, will achieve a growth rate close to 50% or even repeat the 38% growth in 2023 under such a scenario. The Cybertruck has now been released, sort of at least. It will not do much though for the delivery numbers and the top line in 2024, and it will be a negative on the bottom line at least until 2025. The big pre-release questions on the Cybertruck have been answered disappointingly, especially since the price has gone up significantly (which was expected) and the range has come down (which was unexpected). On the positive side, investors seem to be quite forgiving of Tesla, and the share price did not suffer much. So, in some ways, I was wrong here. The disappointing Cybertruck release did not push the share price down. In the long term, Tesla may still make this a success story – but it will probably not matter in 2024. The Cybertruck did not even feature in the latest quarterly production and delivery number: how many vehicles the company built and delivered in Q3 2023 is hidden in the “Other Models” category. As I have said in my previous articles, the transition to electricity is to a large extent not market-driven but caused by government policies to meet a climate emergency. Tesla, selling only electric vehicles, has been and continues to be a major beneficiary of various kinds of government subsidies, and this is the case in all three of its three large markets, the US, China, and Europe. However, those policies are costly and are subject to change. In my view, 2023 might have been the peak-subsidy year. This is not good news for Tesla. Just a few examples - each one by itself will have a limited impact, but together they will create significant headwinds for Tesla to grow deliveries: Tesla’s operating margins in Q3 2023 were 7.55%, the lowest since 2020, and more than two percentage points down QoQ. The company has prioritized volume growth over revenue and profit margins to increase demand. This has brought Tesla to the point where the starting price of a Model 3 or Model Y is less than the average price of a car in the US. It has also brought profitability in line with where mass-market auto manufacturers are. Toyota (TM) had a profit margin of 11.6% in its last quarter. Volkswagen Group, which does not say it is a cost leader and has a cost savings program worth several billion euros running, still came to 6.9% in Q3 2023. One interesting data point regarding Tesla’s margins in Q3 2023 is that operating margins were coming down faster (from 17.2% to 7.6% YoY) than gross profit margins (from 25.1% to 17.9% YoY), meaning Tesla’s cost base is increasing. This does not support the claim that Tesla has structural cost advantages compared to other auto manufacturers. An alternative explanation would be that Tesla’s cost base is a result of the small model line-up. Despite the claim from Elon Musk that \"Tesla is an AI/robotics company that appears to many to be a car company\", research and development expenses are still low compared to other auto manufacturers, despite the substantial recent increases. R&D expenses in Q3 were 1.1 billion US dollars, up 58% YoY, and around 4.9% of revenue. By comparison, BMW (OTCPK:BAMXF) (OTCPK:BMWYY) sold 2.3 million cars in 2023, which is not that far from Tesla. However, the ratio of R&D expenses to revenue (excluding the financial services segment) was significantly higher at 6.2%. Audi sold 1.9 million cars in 2023, so almost the same as Tesla. The R&D ratio in Q1-Q3 was even higher at 7.3%. And those two companies have no aspirations to be more than car companies. Despite the higher R&D cost, their profit margins are above Tesla, with BMW around 10% and Audi around 9%. My point here is that – in my view – it will be difficult for Tesla to meaningfully increase its profit margins in 2024. Given the slow-down in EV demand growth, the increasing competition, and the lack of new models on Tesla’s side, it does not look like Tesla will be able to increase prices. It even started the year in China with further price reductions. While lower raw material costs could provide tailwinds, new model development, factory ramp-ups, the Cybertruck ramp-up, Dojo, etc. will probably increase costs. Considering this, it is no wonder that Elon Musk and Tesla bulls tell us that Tesla is more than just a car company. Of course, there is the possibility that FSD, robotaxis, and robotics will drive revenue and profits in the future. Elon Musk has always been good at convincing us that the future will be much better than we imagine. While he has not delivered everything he has promised in the past, he has delivered a lot. But not everybody believes this anymore when it comes to autonomous driving. Over the last few years, he has predicted every year that fully autonomous cars would arrive very soon. For Tesla to truly achieve fully autonomous driving, as the company and Musk have promised, it must take responsibility for the system. Currently, the driver must supervise the system at all times. There is no indication that this will happen anytime soon, although Tesla would like to keep calling it \"Full Self Driving Capability\". Recently the company said in court that should be allowed to call the software \"Full Self Driving\", although it is not that, because it has used the name for so long that the California Department of Motor Vehicles has accepted the brand name. Therefore, it should not be allowed to sue Tesla now for false advertising. Musk has previously said that FSD will be \"coming out of beta\" with the v12 update, but we do not know what that will mean. Source: X Source: X The main difference with the Version 12 update is likely that vehicle control is handled by neural networks rather than hard-coded by engineers, as was the case in the past. There is one thing I will be watching for. Being a completely different system, it should now also behave completely differently – instead of the incremental improvements we have seen previously. I am very interested to see how this plays out once we have more information and data. Maybe there will be a breakthrough and my investment thesis will prove wrong. We will see, but currently, I like my odds. Since I live in Austria and am a retail investor, going short directly on a US stock is difficult. I decided to go for Put options with a duration of 4 to 6 months and plan to continuously roll over the options to the next 4 to 6 months at about the midpoint of the duration, so every 2 to 3 months. This comes with costs, so I do not want to do it too often. I have done it twice now since I started in July last year. The Put options limit my losses if things do not go well, but there is still the possibility of a total loss. I decided to go for options not quite in the money but with a strike price not more than 10% below the share price. This limits the loss rate, but on the flip side also the leverage of the options. The options I currently hold have a strike price of $240 and expire in June 2024. I intend to keep them until sometime in March. I reinvest gains but also reduce the reinvestment in case of a loss when I switch over. I am now up around 80%; it was plus 120% last October, but Tesla shares have recovered somewhat in November and December. The decision to use Put options means the timeframe for the thesis to play out is relatively short. Continuously switching to a longer duration mitigates that risk to some extent but does not completely solve it. Tesla stock can be driven greatly by sentiment and the excitement of future possibilities alone. Anything that drives up the stock for just a few months can reduce the value of the options significantly. That can happen quickly, even if the options strategy is designed carefully. Besides sentiment, there is the possibility of a real breakthrough in autonomous driving or robotics. Just because Elon Musk has not yet delivered on his grand promises, does not mean he will never deliver. Positive developments in other areas, like the energy storage business or battery technology, could have the same effect. Therefore, I am allocating only a small part of my portfolio to this short bet. I see it not as an investment, but as an interesting experiment. Tesla's current business model is to manufacture and sell cars, with an additional energy storage business. More than 80% of revenue is in the automotive segment. In the context of that business model, the current share price can only be justified if Tesla delivers the combination of continued high growth and profit margins above industry peers. This will be hard to achieve in 2024, but Tesla is valued higher than the 10 largest car manufacturers globally combined. Accordingly, we are seeing the bull investment thesis shift to the premise that Tesla is not just a car manufacturer, but an AI and robotics company. However, Tesla has so far not delivered a product in any of those two areas, and there is no timeline for when it intends to deliver one. Therefore, I think that risk for investors is skewed to the downside in 2024, and I intend to continue the short bet I started half a year ago. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Analyst’s Disclosure: I/we have a beneficial short position in the shares of TSLA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}