{
    "title": "Stellantis CEO says Tesla's price war will cause 'bloodbath' for competitors",
    "date": "1/22/2024",
    "url": "https://www.businessinsider.com/stellantis-ceo-warns-of-bloodbath-in-tesla-price-war-2024-1",
    "text": "       On the surface, you wouldn't think the platform beneath a new generation of automobiles has anything to do with politics and elections. But at Stellantis, new large vehicle underpinnings announced Friday are key to the company's ability to adjust to European and US government electric vehicle requirements that could change depending on this year's elections. CEO Carlos Tavares says the company's new large platform is flexible enough to handle batteries and electric motors, gas-electric hybrids and internal combustion engines. The company can also build midsize to large vehicles on those underpinnings, including sedans, crossover vehicles, SUVs and even off-road Jeeps. That flexibility is important, he said, because policies promoting EVs as a way to fight climate change could be rescinded depending on who is elected U.S. president or to European parliaments this year. Tavares often says that EVs for 40% more to make than vehicles with combustion engines, boosting prices beyond what the middle class can afford. Governments have tried to promote EV sales with subsidies and tax credits, but some countries are starting to rethink those. \"As soon as you do not fix the affordability issue by giving me a significant subsidy that will fix it, then I stop buying,\" Tavares said of consumers. \"That message is loud and clear.\" Electric vehicle sales growth is already slowing in many countries with consumers balking at the added cost as well as limited range and too few charging stations. On Friday, Ford said it was cutting production of the F-150 Lightning electric pickup after weaker-than-expected electric vehicle sales growth. Related stories Some political candidates, including GOP front-runner Donald Trump in the U.S., have criticized the move to EVs, indicating they would end policies to promote them. Stellantis, maker of Jeep, Ram, Dodge and other vehicles, has plans for two scenarios, one if populist candidates who are against EVs win, the other if EV-friendly candidates are elected, Tavares said. \"One is to accelerate (EVs), the other one is to slow down,\" he said. \"Not necessarily stop. We need to fix the global warming issue.\" Tavares said in some European countries, governments are imposing electric vehicles on consumers who can't afford them. So many are keeping their current vehicles longer, raising the average vehicle age, which he said is a \"disaster\" for the planet. Stellantis, he said, makes money on its EVs now, unlike many competitors. Those who can't get strong prices for their vehicles won't have money to invest in lower-cost new ones, and could wind up being consolidated into another company or going out of business, he said. If companies keep cutting EV prices to attract buyers and don't make money, there could be a \"bloodbath\" in the industry, Tavares said. \"I know a company that has brutally cut pricing, and their profitability has brutally collapsed,\" he added, without naming Tesla. Stellantis said vehicles built off the new large platform will be built at multiple North American and European factories. In North America, it's likely that the first new vehicles to come out will be a replacement for the Dodge Charger muscle car and a new version of the Jeep Wagoneer S. The platform can handle front-wheel drive, all-wheel drive and rear-wheel drive vehicles, the company said. The first will reach the market this year, with eight vehicles from Jeep, Dodge, Chrysler, Alfa Romeo and Maserati on sale by the end of 2026. The company can vary the length and width of vehicles and differentiate them from each other with ride and handling changes as well as infotainment and other interior features. Use of a platform for both battery and gasoline powertrains is unique to the industry, with many competitors building different chassis for each type of propulsion. \"The flexibility and agility of this platform is its hallmark and will be a driving force for our success in the shift to electrification in North America,\" Tavares said. A midsize vehicle platform announced by the company last year has similar flexibility, the company said. It's also planning a new small-vehicle platform. Read next Jump to "
}