{
    "title": "Man shares his full final Cybertruck order receipt and people are shocked",
    "date": "1/27/2024",
    "url": "https://www.unilad.com/technology/news/cybertruck-bill-receipt-tesla-300751-20240127",
    "text": "To make sure you never miss out on your favourite NEW stories, we're happy to send you some reminders Click 'OK' then 'Allow' to enable notifications Advert Kit Roberts Getting your hands on one of Tesla's new Cybertrucks could set you back a lot of money, according to a receipt recently posted online by a customer. The Cybertrucks have sparked a lot of attention over the vehicle's unusual design, as well as concerns over its safety. The Cybertruck is a large and heavy vehicle, with bodywork made out of stainless steel. But it turns out that the truck itself isn't the only thing which is large about the Cybertruck, as the price tag doesn't come cheap. Advert You will need to be pretty flush with cash if you want to get a Cybertruck as according to Tesla, a rear-wheel drive version of the car will set you back around $60,990. However, if you want the full four-wheel-drive version, which has been given the very subtle name 'Cyberbeast', then that could leave your wallet lighter to the tune of $99,990. Or possibly even more, according to a receipt posted to Reddit by a customer. The invoice goes into the full details of the costs involved in purchasing the truck, with the initial payment of $102,035 not being the full price paid. Advert That is, of course, the tax, because in the US taxes are not just included in the price for some reason. In this case, the sales tax comes to $9,712.33. There is also a charge of government and vendor fees, which comes to $1,295. So the total price that the person paid for their Cybertruck came to a whopping $113,242.33. This is nearly double the average price of a truck in the US, which is listed at around $59,000.  Advert People were left gobsmacked by just how much the vehicle costs, and this is before you even factor in things like monthly insurance costs. And people took to the comments on Reddit to share their thoughts on the high cost. One wrote: \"Imagine spending more than twice as much than what you originally agreed to for a vehicle that was 3 years late with much worse specs than what you originally bought.\" Another replied: $115k for an $80k vehicle. Not great.\" Advert And a third said simply: \"I can’t believe you paid 113k for a truck.\" The Cybertruck was at the centre of controversy after Tesla reportedly threatened to sue buyers who tried to resell their Cybertruck. Not only that, but a clause in the Cybertruck contract reportedly even said that Tesla may refuse to sell someone any more vehicles if they resold their Cybertruck. Advert It seems that if you want one, you'd better be absolutely sure. Topics: News, US News, Tesla, Elon Musk Kit joined UNILAD in 2023 as a community journalist. They have previously worked for StokeonTrentLive, the Daily Mirror, and the Daily Star. Advert Advert Advert "
}