{
    "title": "Tesla reportedly raising US factory workers' pay as union looms",
    "date": "1/12/2024",
    "url": "https://mashable.com/article/tesla-pay-rise-factory-workers-union-uaw",
    "text": "Tesla is reportedly giving all workers in its US factories a pay rise. This is undoubtedly good news for said workers, though it's unlikely the company is doing this out of the goodness of its heart. Bloomberg reports that Tesla announced a \"market adjustment pay increase\" for its US workers via a flyer posted in its Fremont, California factory. It isn't clear exactly how much the pay bump will be, however it will impact production associates, material handlers, and quality inspectors. Tesla shares fell by over 3 percent apparently in response to the news, though the electric vehicle company had already been on a downswing. Shares were also impacted by car rental company Hertz announcing on the same day that it would sell around one third of its electric vehicles, opting for combustion engines instead. This unexpected pay raise for Tesla workers comes only a few months after the United Auto Workers (UAW) union successfully negotiated agreements with leading auto manufacturers Ford, General Motors, and Stellantis. The three companies agreed to a 25 percent increase in workers' wages after a six week strike — the longest US auto strike in over two decades. With that situation resolved, the UAW has turned its attention toward getting Tesla workers unionised as well. While there have been previous attempts to organise Tesla workers in the US, the company remains the only car manufacturer in the country to not have a union. The success of the UAW strike may inspire some Tesla workers to revisit the idea of collective bargaining — or at least explore job opportunities at unionised competitors. Tesla's \"market adjustment\" is likely a response to this, aimed at bringing its salaries more in line with its competitors while attempting to convince workers that they don't need their own union in order to get a better deal. Pay no attention to the man behind the curtain. Both Tesla and its CEO Elon Musk don't have the greatest history with unions. In 2018, the billionaire implied that Tesla workers would lose their stock option benefits if they unionised, and accused the UAW of wanting to divide people into a \"2 class 'lords & commoners' system.\" These statements caused reasonable concern regarding union busting at Tesla, compelling the company to explicitly deny that Musk was threatening to take away employee stock options if workers organised. \"He was simply recognizing the fact that no UAW-represented automakers provide stock as compensation, which has particular relevance given that UAW organizers have consistently dismissed the value of Tesla equity as part of our compensation package,\" claimed Alexandra Veitch, Tesla's senior director of government relations and policy at the time. Interestingly, Tesla skipped its formerly annual distribution of merit-based stock options to employees last December. It's unclear whether this was an aberration or a permanent change in how Tesla compensates its workers. Either way, it doesn't look great in light of the company's previous emphasis on the importance of its workers' stock options. Over 30 Tesla workers were reportedly fired last February after attempting to unionise, though their complaint to the National Labor Relations Board (NLRB) was later dismissed. The NLRB also recently ruled that Tesla's clothing policy was unlawful because it implicitly prohibited workers from wearing union apparel. Topics\nTesla Amanda Yeo is Mashable's Australian reporter, covering entertainment, culture, tech, science, and social good. This includes everything from video games and K-pop to movies and gadgets. "
}