{
    "title": "When does Tesla stock become too cheap to ignore?",
    "date": "2/14/2024",
    "url": "https://www.tradingview.com/news/marketbeat:e20994dad094b:0-when-does-tesla-stock-become-too-cheap-to-ignore/",
    "text": "MarketBeat There’s perhaps never been a divergence like it. While the tech-heavy Nasdaq index has tacked on almost 10% since the first week of January, shares of electric vehicle (EV) giant Tesla Inc TSLA have sunk more than 20%. And the worst part for Tesla investors is that it hasn’t been just a flash in the pan, where shares opened up that far down on the back of unexpected bad news. No, instead, it’s been a slow but steady drift south since last summer in what is increasingly looking like a downtrend from 2021’s high, as Tesla finds itself catching a cold as the EV winter has set in. For a stock that could seemingly do no wrong for a long time, it’s an unfortunate turn of events but one that shows no company is immune from a dramatic change in its fortunes. Some of the main headwinds that CEO Elon Musk and his company have been tackling include a weak margin outlook and ongoing price cuts amid stiff competition from China. A weak earnings report from last month spooked investors, and there’s a good bit of work to be done in order to restore investor confidence. Considering the upside potential But for those of us on the sidelines, you have to be wondering at what point Tesla becomes too cheap to ignore. Already, we’re seeing some of the heavyweight names in the tech space come to its defense, with the likes of ARK’s Cathie Woods acknowledging that it’s having a bad time right now but also saying we’re close to seeing the low in its cycle. For Woods, there are just too many tailwinds and key industry catalysts waiting around the corner for Tesla to remain unwanted. She mentioned autonomous taxi networks as an example of a new industry just waiting to take off in the coming years and one that Tesla is positioned well to capitalize on. There’s every reason to think we’ll see a strong bounce in their margin performance as the company reaccelerates into growth mode. Wedbush’s Dan Ives has also come to Tesla’s defense in recent weeks. In particular, he pushed back hard on the bears who are going around acting as if the EV evolution is dead and over, writing in a note to clients that “we could not disagree more with the ultra negative Tesla narrative building and forming a black cloud over the stock.” Like Woods, he’s not expecting an immediate turnaround, with some industry-wide headwinds still to be navigated, but in the long term, you nearly couldn’t pick a better stock. By the end of the decade, Wedbush expects somewhere around 20% of all cars to be EVs, with autonomous driving an almost basic feature for consumers at that point. Long term outlook Ives and his team reiterated their Outperform rating on Tesla shares at the end of last month and gave them a fresh price target of $315. Considering Tesla closed at $184 on Tuesday night, that’s a targeted upside of some 70%, which is not to be sniffed at. The Piper Sandler team has also come out bullish on Tesla’s prospects over the long term and, just last week reiterated their own Overweight rating on the stock. For those of us considering a position, getting involved here will require an iron stomach and a desire to hold for a while. The recent bout of price cuts has damaged the company’s margins beyond what many were expecting, and there’s an ugly dispute emerging between Musk and the board over voting control. But for a stock that once commanded a four-digit price-to-earnings (PE) ratio, seeing it trade with a PE ratio of just 42 is almost hard to believe. With its stock back trading at 2020 levels and interest rates looking like they’ve topped out, we’re inclined to say these prices won’t be around for much longer. If you’re a believer in the EV industry, then this could be the time to start backing up the truck. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}