{
    "title": "Tesla lawyer admired Elon Musk so much that he cried during deposition",
    "date": "2/1/2024",
    "url": "https://www.businessinsider.com/tesla-lawyer-admired-elon-musk-so-much-cried-during-deposition-2024-2",
    "text": "       You might be a fan of Elon Musk, but would you cry for him during a deposition? That's what former Tesla General Counsel Todd Maron did, according to court documents out of Delaware. In a written opinion on Tuesday, Delaware judge Kathaleen McCormick criticized how Tesla's committee and its working group decided to award Musk his $55 billion compensation package. This process that led to the package's approval was \"deeply flawed,\" per McCormick's opinion.\"The working group included management members who were beholden to Musk, such as General Counsel Todd Maron who was Musk's former divorce attorney and whose admiration for Musk moved him to tears during his deposition,\" McCormick wrote in her decision. Related stories \"In fact, Maron was a primary go-between Musk and the committee, and it is unclear on whose side Maron viewed himself. Yet many of the documents cited by the defendants as proof of a fair process were drafted by Maron,\" she added. Maron declined to comment on the story but pointed Business Insider to transcripts of his testimony quoting the general counsel becoming \"emotional\" about his decision to leave Tesla. \"Unfortunately I lost my cool earlier and cried because I love the company so much, and I loved my teammates and my colleagues and the people on the executive team,\" the transcripts quoted Maron saying. Maron joined Tesla in September 2013 and left the company in January 2019. McCormick this week voided Musk's $55 billion compensation package at Tesla. Musk, who isn't paid a salary as Tesla's CEO, was promised a series of stock grants if he met Tesla's financial growth targets. McCormick's ruling appears to have infuriated Musk, who said on Thursday that he's done with Delaware and will call a shareholder vote to transfer Tesla's state of incorporation to Texas. Representatives for Tesla did not immediately respond to a request for comment from Business Insider sent outside regular business hours. Read next Jump to "
}