{
    "title": "NYT: Apple held talks with Elon Musk about buying Tesla, planned to use \nSiri instead of a steering wheel for Apple Car",
    "date": "2/28/2024",
    "url": "https://9to5mac.com/2024/02/28/apple-car-tesla-siri/",
    "text": "Yesterday, Bloomberg reported that the Apple Car project is officially dead after more than a decade of work. In a new story today, The New York Times shares additional details on the turmoil inside the Project Titan team, based on conversations with “a half dozen people who worked on the project over the past decade.” Some of these details were previously reported by NYT technology reporter Tripp Mickle in his After Steve book. This isn’t the first time we’ve heard about supposed discussions between Apple and Tesla about an acquisition. In December 2020, Elon Musk himself confirmed that he “reached out to Tim Cook to discuss the possibility of Apple acquiring Tesla” during the “darkest days” of the Model 3 development. According to Musk, Cook “refused to take the meeting.” Six months later, a report from the Wall Street Journal suggested that Cook had pitched Musk on the idea of Apple acquiring Tesla around that same timeframe. Musk was reportedly interested in this proposition, but on one condition: He serves as CEO not of Tesla, but of Apple entirely. Cook and Musk have both denied having that interaction. Until recently, the two said they had never even spoken to each other. Today’s report from The New York Times adds more fuel to the fire, albeit without many details. The report, for example, doesn’t include a timeline on when these “discussions” happened: The company held some discussions with Elon Musk about acquiring Tesla, according to two people familiar with the talks. But ultimately, it decided that building its own car made more sense than buying and integrating another business. Today’s report also includes details on how Apple initially planned that Apple Car wouldn’t have a steering wheel, and instead would be controlled entirely by Siri. There’s this humorous tidbit on an apparent demo presented to Jony Ive and Tim Cook: Mr. Ive and his team of designers drew concepts for a car that would look like a European minivan such as the Fiat Multipla 600, which has a half-dozen windows and a curving roof. It had no steering wheel and would be controlled using Apple’s virtual assistant, Siri. One day, in the fall of 2015, Mr. Ive and Mr. Cook met at the project’s headquarters in Sunnyvale, Calif., for a demonstration of how the car might work. The two men sank into the seats of a cabinlike interior. Outside, a voice actor read from a script of what Siri would say as the men zoomed down the road in the imaginary car. Mr. Ive asked Siri what restaurant they passed and the actor read an answer, said two people familiar with the demonstration. The full report can be read over at The New York Times. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}