{
    "title": "Tesla Bull Gary Black Says Elon Musk Added 'Fuel To The Fire,' But \nClarifies That Billionaire's Comments Not Sole ...",
    "date": "2/23/2024",
    "url": "https://www.tradingview.com/news/benzinga:e7ffa4a94094b:0-tesla-bull-gary-black-says-elon-musk-added-fuel-to-the-fire-but-clarifies-that-billionaire-s-comments-not-sole-cause-for-35-fall-in-rivian-stock/",
    "text": "Tesla bull Gary Black clarified that he does not think that Elon Musk's comments on rival Rivian Automotive Inc. RIVN caused a 35% fall in the stock over the last week. What Happened: The Future Fund co-founder Black said Musk added fuel to the fire of rival Rivian's bankruptcy, despite the chances of it happening being \"very low.\" Black was candid about his investment decisions in both the EV makers, saying they've been \"disasters for investors over the past year.\" \"Elon added fuel to the fire by raising the specter of bankruptcy when in our view bankruptcy risks are very low,\" Black said, adding that the odds of Rivian having to raise additional funds for the R2 line's launch are \"high.\" Let's be clear: Both $RIVN and $TSLA have been disasters for investors over the past year and especially since we added $RIVN to our portfolio last July. Until this week both $RIVN and $TSLA were doing equally bad although $TSLA has cost us far more in negative attribution than... pic.twitter.com/k5V5q7rPHF Black clarified that his earlier statements did not intend to blame Elon Musk’s comments for Rivian’s 35% stock plunge this week. Instead, he pointed out that Rivian’s flat production guidance for fiscal year 2024 was the primary reason for the drop. See Also: Tesla Takes Aim At Toyota: Model Y Now Cheaper Than Prius PHEV In Germany Why It Matters: Black’s statements come after his public admission of being wrong on Tesla for three years, describing the EV giant as his “worst-performing long.” Rivian also faced criticism from Musk, who warned of a possible bankruptcy for the company within six quarters. Despite this, Black defended Rivian, stating that the company still had the potential to become the second-largest EV maker after Tesla. Read Next: Remember Nikola’s Answer To Tesla’s Cybertruck? The Infamous Badger EV Pickup Is Making A Most Unexpected Comeback Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}