{
    "title": "EV winter? Don't tell Toyota and Ferrari sitting at their multi-year highs",
    "date": "2/24/2024",
    "url": "https://seekingalpha.com/news/4071266-ev-winter-dont-tell-toyota-and-ferrari-sitting-at-their-multi-year-highs",
    "text": "teddyleung While the electric vehicle sector is reeling from a reality check on demand trends, capital raise needs, affordability issues and the expected profitability timeline - investors have not ditched the auto sector as a whole. Toyota Motor (NYSE:TM) shares hit a record high after robust demand for hybrid vehicles boosted earnings last quarter. Japanese automakers Honda Motor (HMC) and Nissan (OTCPK:NSANY) have also seen increased investor interest due to expectations that hybrid lineups will look more attractive in the current climate of EV skepticism. \"We think the market is now rethinking the potential of hybrid products, which are a strength of Toyota,\" updated Goldman Sachs after the most recent round of earnings reports. Other automakers that have seen their share price rally by more than 50% over the last 52 weeks include Ferrari (NYSE:RACE) and Stellantis (STLA). Both of the Europe-based companies have been slower to make the capital-intensive commitments to an EV transition than General Motors (GM), Ford Motor (F), and Volkswagen (OTCPK:VLKAF). That has contributed to a string of solid earnings reports and generally favorable ratings from analysts. Morgan Stanley highlighted recently that trying to be the next Tesla (NASDAQ:TSLA) is turning out to be an expensive strategy. The firm thinks that as EV startups turn into restructuring stories, whoever finds a sponsor has the best chance of survival. Some of the EV pure plays with large year-to-date losses include Rivian Automotive (RIVN), Fisker (FSR), Lucid Group (LCID), VinFast Auto (VFS), Nio (NIO), XPeng (XPEV), Canoo (GOEV), Polestar Automotive (PSNY), and Li Auto (LI). Morgan Stanley analyst Adam Jonas also warned on the large-scale commitments for EV battery plants that were made before the demand forecast flipped. \"The changing reality of EV adoption curve (slowing) vs. current battery on-shoring plans (still progressing) creates a palpable tension within the industrial strategies of US auto companies. Without changes, we are prepared for the prospect of shiny, new, multi-billion-$ battery manufacturing facilities sitting largely idle in a number of key US states.\" "
}