{
    "title": "Elon Musk's SpaceX has left Delaware for Texas. Here's what happened",
    "date": "2/15/2024",
    "url": "https://www.firstpost.com/explainers/elon-musks-spacex-has-left-delaware-for-texas-heres-what-happened-13732722.html",
    "text": "Elon Musk made the move after a Delaware judge in January voided his $56 billion pay package for Tesla — the largest salary in corporate America — when a shareholder sued calling it unfair. Experts say the verdict shines a light on the problems with Tesla’s governance structure SpaceX has left Delaware. The rocket company belonging to Elon Mush has shifted base to Texas. Musk, one of the world’s wealthiest people, posted the news on X on Wednesday. SpaceX has moved its state of incorporation from Delaware to Texas!If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible. pic.twitter.com/B7FLByL2dY But why has SpaceX left Delaware? Let’s take a closer look: What happened? The move comes after a Delaware judge in January voided the CEO’s $56 billion pay package for Tesla — the largest salary in corporate America. The Delaware judge, Kathaleen McCormick, in her ruling deemed the compensation granted by the EV maker’s board “an unfathomable sum” that was unfair to shareholders. McCormick was ruling on a lawsuit from a Tesla investor named Richard Tornetta. Tornetta in 2018, calling Musk’s pay package ‘unfair’, sued Musk and several Tesla directors. While Tornetta himself held just nine Tesla shares, the deal was also criticised by major pension fund California State Teachers’ Retirement System (CalSTRS) and proxy advisory firms, who viewed it as far too generous. BBC quoted McCormick as saying that the Tesla board of directors were “perhaps starry eyed” over his “superstar appeal” and did not fully inform shareholders. “Swept up by the rhetoric of ‘all upside,’ or perhaps starry eyed by Musk’s superstar appeal, the board never asked the $55.8 billion question: Was the plan even necessary for Tesla to retain Musk and achieve its goals?” McCormick wrote. “The incredible size of the biggest compensation plan ever - an unfathomable sum - seems to have been calibrated to help Musk achieve what he believed would make ‘a good future for humanity’,” wrote McCormick in her 201-page opinion. As per CNBC, Tesla’s eight-person board comprises  Musk, his brother Kimbal, chairwoman Robyn Denholm and ex-Tesla technology chief JB Straubel. McCormick wrote that many of the directors on Tesla’s board lacked independence because of their close personal ties with the CEO. Two of Tesla’s current directors showed a lack of independence in the pay decision, she added. McCormick has ordered the Tesla shareholder who challenged the pay plan to work with Musk’s legal team on an order implementing the decision. “Good day for the good guys,” Greg Varallo, an attorney for Tornetta said. Tesla directors argued during the trial that the company was paying to ensure one of the world’s most dynamic entrepreneurs continued to dedicate his attention to the electric vehicle maker. Antonio Gracias, a Tesla director from 2007 to 2021, called the package “a great deal for shareholders”. Tornetta’s lawyers argued the Tesla board never told shareholders the goals were easier to achieve than the company was acknowledging and that internal projections showed Musk was quickly going to qualify for large portions of the pay package. The plaintiff’s legal team also argued the board had a duty to offer a smaller pay package or look for another CEO and that they should have required Musk to work full-time at Tesla instead of allowing him to focus on side projects, like SpaceX and X. Kristin Hull, founder of Tesla investor Nia Impact Capital, described the board as beholden to Musk, a problem she said is common at other big technology companies. “This is the bro-show,” she said of the situation. The pay package granted stock option awards for approximately 304 million shares that Musk can buy at about $23.33 each, well below $191.59 where it closed on Tuesday. Musk earned all 12 tranches of stock option awards as Tesla hit escalating financial and operational goals. Musk has not exercised any of the options and once he does he is required to hold the shares for five years before selling, according to McCormick. He was not guaranteed any salary. Tesla’s value ballooned to briefly top $1 trillion in 2021 from $50 billion when the package was negotiated. Amit Batish at Equilar, an executive pay research firm, estimated in 2022 that Musk’s package was around six times larger than the combined pay of the 200 highest-paid executives in 2021. Musk after the decision held a poll on X to determine where SpaceX should be incorporated. “The public vote is unequivocally in favor of Texas! Tesla will move immediately to hold a shareholder vote to transfer state of incorporation to Texas,” Musk wrote. According to BBC, Tesla earlier moved its corporate headquarters to Texas in August 2021. What happens next? Elon Musk and the Tornetta on Tuesday asked the judge to pause her ruling until an appeal is resolved. Varallo, the shareholder’s attorney, told Reuters the two sides will agree to a stay if they can reach a deal on an appeal bond. The letter is the first indication that Musk intends to appeal the ruling to the Delaware Supreme Court. “I’d give you very high odds on that,” Varallo told CNBC. Experts say Musk is extremely likely to challenge the ruling. Kobi Kastiel, a law professor at Tel Aviv University, told CNBC, “Given the high stakes involved, it is likely that Tesla will appeal the decision,” Kastiel said in an email. The ruling comes as Tesla prepares another round of compensation negotiations with the CEO. Musk said in a post on X this month that he was uncomfortable leading Tesla unless he had 25 per cent of the voting control. The billionaire owned around 13 per cent of the company at the time and he said negotiations would not start until McCormick had ruled. “Given the way she describes the board process - through the testimony of the directors - there is no way that his most recent demand for 25 per cent can get approved,” Brian Quinn, a professor at Boston College Law School, said. “It’s dead on arrival.” Kastiel agreed. In the absence of a successful appeal, “any new compensation arrangement with him will have to be assessed” in light of McCormick’s decision, Kastiel told CNBC. Ross Gerber, president and CEO at Gerber Kawasaki Wealth & Investment Management and a Tesla investor, told Reuters the ruling showed the company needed to replace at least three directors with independent board members before it can negotiate a new pay package for Musk. “Essentially, the entire corporate structure of Tesla has been deemed, like not appropriate for a public company,” Gerber said. But Kastiel said that’s easier said than done — particularly when a CEO like Musk is involved. “As long as the CEO is perceived as a star and the company depends on the CEO’s vision and leadership, even nominally independent directors — those without strong ties to the CEO — will have difficulty monitoring the CEO’s conduct,” Kastiel told C_NBC._ “Plaintiffs may have a better chance of advancing their claims by potentially leveraging the Tornetta findings to argue that the majority of the Tesla board is not independent of Musk,” he said. “To mitigate this risk, Tesla will need to significantly enhance the independence of its board and nominate new independent directors who do not have strong ties to Musk.” Musk’s brain-chip implant company, Neuralink also changed its location of incorporation from Delaware to Nevada last week. With inputs from agencies Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}