{
    "title": "Tesla recalls 1.6 million electric vehicles in China",
    "date": "1/5/2024",
    "url": "https://www.aljazeera.com/news/2024/1/5/tesla-recalls-1-6-million-electric-vehicles-in-china",
    "text": "The cars reportedly have problems with their automatic assisted steering and door latch controls. Tesla is recalling more than 1.6 million Model S, X, 3 and Y electric vehicles in China for problems with their automatic assisted steering and door latch controls. China’s State Administration for Market Regulation (SAMR) announced the recall on Friday and said that Tesla Motors in Beijing and Shanghai would use remote upgrades to fix the problems. “For vehicles within the scope of this recall, when the automatic assisted steering function is turned on, the driver may misuse the level two combined assisted driving function, increasing the risk of vehicle collision and posing a safety hazard,” said SAMR. The recall also includes 7,538 imported Tesla models made between October 26, 2022 and November 16, 2023, which were found to have a “problem with the door unlock logic controls”. In 2022, the firm also recalled nearly 128,000 cars in China due to a rear motor inverter defect.    China is a significant market and manufacturing centre for Tesla, and the company’s CEO, Elon Musk, has built close ties with Chinese officials even as US-China relations have soured. Tesla’s Shanghai production facility, its first “gigafactory” to be built abroad, delivered about 947,000 vehicles in 2023, Chinese state news agency Xinhua reported earlier this week. The recall comes after a recall in the United States last month of more than two million Tesla electric vehicles to improve its system for monitoring drivers. It also comes after a two-year investigation by the US National Highway Traffic Safety Administration found the system was defective after a series of crashes while the car was in autopilot mode. The upgrades are intended to get drivers who use Tesla’s Autopilot system to pay closer attention to the road, and documents filed by Tesla with the US government said that the software will increase warnings and alerts to drivers to keep their hands on the wheel.          Follow Al Jazeera English: "
}