{
    "title": "Tesla’s stock heads for fourth day of losses — and volatility could persist",
    "date": "1/12/2024",
    "url": "https://www.marketwatch.com/story/tesla-reportedly-cuts-prices-of-two-models-in-a-tough-china-market-where-byd-rules-c4d15c94",
    "text": "Tesla Inc. reportedly has reduced prices on two models in China, where it faces stiff competition from rivals such as BYD Co. Ltd. and is grappling with a continued difficult economic backdrop. Shares of Tesla were falling more than 3% in morning trading Friday. Investors were also grappling with news of a temporary shutdown of production facilities in Germany. Tesla \n        TSLA,\n        +5.73%\n       cut starting prices on its Model 3 sedan by 5.9% and its Model Y sport-utility vehicle to 2.8%, according to reports Friday from Reuters, Bloomberg News and social-media accounts tracking the automaker. Piper Sandler analyst Alexander Potter wrote that “China sales of Model 3/Model Y represent 8%/24% of total volume,” though he also noted that Tesla tends to pass on lower input prices to consumers and has seen lithium spot prices decline sharply recently. China’s economy has struggled to fully get back on its feet after the global pandemic, with consumers slow to spend even amid government stimulus efforts. Official data released Friday showed consumer prices dropping 0.3% in December for a third straight month of declines. Shares of Tesla are down over 11% so far this year — the stock has seen just one positive session since Dec. 28. Those losses come as the automaker reported forecast-beating fourth-quarter deliveries at the start of the month, but was knocked off its pedestal as the world’s leading EV seller by Berkshire Hathaway-backed BYD \n        002594,\n        +2.52%. China’s EV market is largely dominated by local companies, with Tesla not only facing BYD , but Li Auto Inc. \n        2015,\n        +2.35%,\n       Nio Inc. \n        NIO,\n        -2.03%\n       and Xpeng Inc. \n        XPEV,\n        +1.17%\n       as well. Separately Tesla appears to have also been dragged into the Middle East conflict, with media reports saying the EV maker will halt the majority of its auto production near Berlin for two weeks due to “a lack of components.” “The armed conflicts in the Red Sea and the associated shifts in transport routes between Europe and Asia via the Cape of Good Hope are also having an impact on production in Grünheide,” Tesla said in a statement on Thursday, according to Reuters and other media outlets. “So long as the stoppage is not extended, we think Tesla will lose [about 10,000 units of production,” Potter wrote, adding that the German plant is Tesla’s lowest by volume and the company “presumably” could make up for lost production once the plant opens up again. “As usual, we think most of this ‘noise’ has little bearing on the long-term thesis,” Potter wrote. “But nonetheless, it’s important for investors to understand how sentiment is evolving, because [Tesla] is (and will likely remain) more volatile than many other stocks in our coverage.” The Red Sea is a crucial shipping avenue for cargo travel through the Suez Canal, with some $1 trillion in goods estimated to pass through it each year. Many shipping companies have been forced to reroute due to ongoing attacks by Yemen’s Houthi rebels that were launched after the start of the Israel-Hamas war in October. The alternate route is longer and often incurs more costs for companies involved, while global shipping rates have been spiking due to those attacks. Analysts at Baird surmised that the Berlin factory produces 5,000 to 7,000 vehicles a week, “due to the factory not always reaching full utilization and other factors.” The shutdown would result in a 10,000 to 14,000 hit to first-quarter deliveries, said analysts Ben Kallo and David Sunderland in a note. “While the length of the conflict in the region is uncertain, we are wary of further impacts to [Tesla’s] supply chain and/or shipping routes for international deliveries,” they added. Specifically, they note that Tesla’s Shanghai factory deliveries to several regions, including Australia and Europe. “No delays have been cited, however, we speculate that disruptions in the Red Sea may lead to longer wait times as supply chains are rerouted,” they said. MarketWatch has reached out to Tesla for comment. Read: U.S., British launch massive retaliatory strike against Iranian-backed Houthis in Yemen Slowing demand for electric vehicles is to blame. Barbara Kollmeyer is based in Madrid, where she leads MarketWatch's pre-markets coverage of financial markets and writes the Need to Know column. She has worked in London and Los Angeles for MarketWatch previously. Follow her on Twitter @bkollmeyer. Barbara Kollmeyer is based in Madrid, where she leads MarketWatch's pre-markets coverage of financial markets and writes the Need to Know column. She has worked in London and Los Angeles for MarketWatch previously. Follow her on Twitter @bkollmeyer. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}