{
    "title": "Musk demands bigger stake in Tesla as price for AI work",
    "date": "1/19/2024",
    "url": "https://www.myheraldreview.com/news/business/musk-demands-bigger-stake-in-tesla-as-price-for-ai-work/article_0d3f0018-b49c-11ee-b9ce-338028a21c4b.html",
    "text": "Have any questions?  Please give us a call at 520-458-9440 Copyright ©  • Wick Communications Terms of Use | Privacy Policy  Elon Musk is interviewed at the 2023 New York Times DealBook Summit, in Manhattan on Nov. 29, 2023. Musk has demanded that Tesla’s board give him shares worth more than $80 billion if it wants him to continue developing products based on artificial intelligence. Elon Musk, the CEO of Tesla, demanded that the company’s board give him shares worth more than $80 billion if it wants him to continue developing products based on artificial intelligence. Musk said Monday on X, the social media site formerly known as Twitter that he owns, that he needed to own 25% of Tesla to avoid takeovers and have enough control of the company as it develops robots and other AI technology. Musk owns 13% of Tesla after selling a substantial portion of his stake to finance his $44 billion acquisition of Twitter. The social media site has struggled under his leadership and plunged in value. An additional 12% of Tesla would be worth $82 billion at the current share price, effectively recouping Musk’s investment in Twitter — which he has said he regrets — and then some. “I am uncomfortable growing Tesla to be a leader in AI &amp; robotics without having ~25% voting control,” Musk wrote on X. “Enough to be influential, but not so much that I can’t be overturned.” He went on: “Unless that is the case, I would prefer to build products outside of Tesla.” But he also said the board would take no action until a Delaware judge rules in a lawsuit brought by a Tesla shareholder challenging an earlier compensation plan that was instrumental in making Musk the richest person in the world. Tesla did not immediately respond to a request for comment. The demand by Musk underlined the extent to which Tesla, which sold 1.8 million vehicles last year and is the world’s most valuable carmaker, is subject to his impulses. Tesla’s success forced traditional carmakers to begin offering electric vehicles, which are essential in reducing greenhouse gas emissions from transportation. But Musk’s behavior and statements have weighed on the share price and gotten him into trouble with regulators. Tesla shares fell when Musk sold some of his stake to buy Twitter. The shares also suffered after Musk said in 2018 that he had the money to take Tesla private and delist it from the stock exchange. Musk was unable to execute the plan. The company’s stock has fallen about 14% this year but is up about 60% over the last 12 months. Musk did not specify which products he might develop outside the company. He has already started a separate AI business called X.AI, which last year released the Grok chatbot to selected users. Tesla is developing a robot called Optimus, which, according to a video posted on X by Tesla on Monday, can fold a shirt. Tesla also uses AI in its driver-assistance and self-driving systems. On X, some of Musk’s fans applauded his statement, saying he earned the money. But others said it was his own fault his stake in the company has fallen. “They didn’t make you sell your shares,” one user wrote, adding, “why should the board do anything to rectify this for you?” A stake of less than 15% of the company, Musk said, “makes a takeover by dubious interests too easy.” We're always interested in hearing about news in our community. Let us know what's going on! Copyright © 2001- • Herald/Review Media • 102 S Fab Ave, Sierra Vista, AZ 85635 | Terms of Use | Privacy Policy | Contact Us | The HERALD/REVIEW MEDIA is owned by Wick Communications. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: Get up-to-the-minute news sent straight to your device.        Account processing issue - the email address may already exist Receive the digital, interactive PDF of the newspaper in your inbox. Delivered right as the newspaper goes to print on Wednesdays, Fridays, and Sunday. Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}