{
    "title": "Hawaii Drops Last Coal-Fired Plant After Launch Of Tesla Megapack \nUtility-Scale Battery System On Oahu",
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/news/hawaii-drops-last-coal-fired-190000402.html",
    "text": "A Tesla Inc. Megapack battery system recently led the state of Hawaii to bid farewell to its last coal power plant, ushering in a new era powered by clean, renewable energy. The system, called the Kapolei Energy Storage (KES), is now operational on the west side of Oahu, Hawaii, signaling the end of an era dominated by polluting power sources. Owned and operated by Plus Power, this groundbreaking project represents the pinnacle of grid-scale battery energy storage technology, boasting unparalleled specifications and capabilities. With a capacity of 135 megawatts (MW) and 540 megawatt-hours (MWh) of energy, the system also has additional features like fast frequency response and black start capabilities. Its implementation facilitates an additional 10% of new utility-scale renewables beyond what previous models from Hawaiian Electric predicted. KES sits on 8 acres in Kapolei, Oahu. Approved by the Hawaii Public Utilities Commission in May 2021, it is now operational and serves as a crucial replacement for the last coal-fired plant. Supporting Hawaii’s transition to 100% renewable energy by 2045, KES garnered unanimous support from the local community and received the necessary permits. Jim Alberts, senior vice president and chief operations officer of Hawaiian Electric, said in a press release, \"KES is an important part of a portfolio of resources that work together to provide reliability and energy security on Oahu’s isolated island grid. Energy storage technology that responds quickly to constantly changing conditions is an essential tool for us to use to manage the grid and operate it as efficiently as possible.” The Megapack ensures grid stability and resilience. Its innovative design enables seamless integration of renewable energy sources, facilitating the transition toward a sustainable energy future. By storing excess energy during periods of low demand and delivering it when needed most, the Megapack plays a pivotal role in optimizing energy usage and reducing reliance on fossil fuels. It's a testament to Tesla’s commitment to revolutionizing the energy sector with innovative, eco-friendly solutions. This transition’s significance extends beyond Hawaii’s shores, resonating with global efforts to mitigate climate change. As coal plants across the United States shutter, the rise of clean energy sites heralds a shift toward a sustainable future. The affordability and accessibility of renewable energy sources incentivize homeowners and energy producers to embrace greener alternatives, Key stakeholders involved in the realization of this project express their pride and optimism for the future. Mark Glick, Hawaii's chief energy officer, lauds the state’s leadership in the clean energy transition. “This project provides another example of Hawai’i’s leadership in the clean energy transition,\" Glick said. \"The grid modernization strategies employed by Plus Power support a cleaner, more reliable and more affordable energy system.” Brandon Keefe, Plus Power’s executive chairman, encapsulates the sentiment surrounding this historic moment, describing it as a “landmark milestone” in the transition to clean energy. \"It's the first time a battery has been used by a major utility to balance the grid: providing fast frequency response, synthetic inertia and black start,\" Keefe said. \"This project is a postcard from the future — batteries will soon be providing these services, at scale, on the mainland.\" Photo Honolulu beach, courtesy of Maureen Meehan \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article Hawaii Drops Last Coal-Fired Plant After Launch Of Tesla Megapack Utility-Scale Battery System On Oahu originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}