{
    "title": null,
    "date": "2/6/2024",
    "url": "https://thedriven.io/2024/02/06/byd-becomes-best-selling-ev-brand-in-australia-as-tesla-sales-plunge-in-january/",
    "text": "    Chinese car maker BYD has overtaken Tesla as the biggest seller of EVs in Australia for the first time – at least for one month – as overall electric car sales stalled in the first month of 2024, mostly due to delivery delays and the removal of rebates in key states. The latest data from the Federal Chamber of Automotive Industries shows that 4,893 full battery EVs were sold in Australia in January, a slight rise over the same month last year when 4,852 were sold, but at a lower percentage of 5.4 per cent of the overall market, compared to 5.7 per cent last year. The sales data for January were also significantly less than the previous month, down 27.6% from 6,761 EVs sold in December, when rebates were removed in NSW and South Australia. Australia’s best-selling electric car brand Tesla suffered a 66.6 per cent slump in sales for the month after having a shipment turned around and sent back to China, and a stop-start delivery situation on the new Model 3 due to compliance issues with its child seat restraints. That meant that BYD, with 1,310 vehicles, overtook Tesla (1,107) as the best selling EV brand for the month. BYD sold 589 of its newly released Seal electric sedan, 465 of its Atto 3 SUV (following a price cut), and 256 of its low-priced BYD Dolphin. The refreshed Tesla Model 3 led the EV charts with 723 sales in January, ahead of the Seal, while the Model Y – despite being the best selling car around the world in 2023 – fell to fifth spot for the month with just 384 sales. MG also had a strong month with 537 sales of its popular MG4, and a further 111 sales of the MG ZS EV. Volvo started the year with 225 sales, which is down from last year’s 402 during the same period last year. This is likely to change dramatically as the Swedish brand introduces new ground-up electric models to the lineup, such as the very popular EX30 electric SUV. The best-selling EVs in January 2024 were: The Driven is waiting to hear back from various manufacturers for sales of some EV models and this list will be updated once they’re received. These EV sales come after a bumper year in 2023 when over 87,000 new EVs made it onto Australian roads. In 2023, the Tesla Model Y took the top spot with 28,769 sales, making up 33% of all electric car sales during the year. The results come only days after the federal government announced that emission standards will be coming into place by January 2025. The FCAI, which is dominated by legacy car makers such as Toyota, repeated its concerns about the design of the new policy, saying “industry wants an emissions standard that is ambitious without limiting the choice and increasing the cost of the vehicles Australians need and want.” “Even with the current incentives offered by the Commonwealth and State and Territory Governments, sales of battery electric vehicles appear to have plateaued during recent months,” it said. Overall, new car sales reached a January record of 89,782 vehicles, up from 84,873 sales during the same period in 2023. Top-selling car models during the month included the Ford Ranger, Toyota Hilux and the Toyota Landcruiser. Riz is the founder of carloop based in Melbourne, specialising in Australian EV data, insight reports and trends. He is a mechanical engineer who spent the first 7 years of his career building transport infrastructure before starting carloop. He has a passion for cars, particularly EVs and wants to help reduce transport emissions in Australia. He currently drives a red Tesla Model 3. I agree to the Terms of Use  I agree to the Terms of Use Input your search keywords and press Enter. "
}