{
    "title": "Australia releases preferred option on pollution rules to boost EV uptake",
    "date": "2/3/2024",
    "url": "https://finance.yahoo.com/news/australia-releases-preferred-option-pollution-031743677.html",
    "text": "SYDNEY (Reuters) - Australia on Sunday released a \"preferred model\" for new standards on vehicle emissions as the country moves closer to finalising rules to boost uptake of electric cars, in line with standards in most other developed economies. The road-map to fuel efficiency standards, a policy that advocates say will spur manufacturers to send more EVs to Australia and further boost adoption, was announced last year by the centre-left government, which won power in 2022 on a promise of climate policy reforms. Apart from Russia, Australia is the only developed country to either not have or be developing fuel efficiency standards, the Labor government says. In releasing its \"preferred model\" on Sunday, the government said it favoured an option that would \"bring Australia in line with U.S. standards by 2028 and provide the optimal cost benefit outcomes for Australian car buyers\". The new standard, which the government wants to have in effect from Jan. 1 2025, would save motorists A$100 billion ($65 billion) in fuel costs through to 2050, Energy Minister Chris Bowen said in a statement. \"This is about ensuring Australian families and businesses can choose the latest and most efficient cars and utes, whether they’re petrol and diesel engines, or hybrid, or electric,\" Bowen said. Electric vehicle (EV) sales in Australia hit an all-time high in 2023, according to the country's automotive association, however light vehicle sales remain dominated by emissions-intensive trucks and sports utility vehicles (SUVs). Transport is one of Australia's largest sources of emissions and a higher uptake of electric vehicles would bolster the government's pledge to cut emissions by 43% by 2030. ($1 = 1.5356 Australian dollars) (Reporting by Sam McKeith in Sydney; Editing by Lincoln Feast.) "
}