{
    "title": "Why Ford’s Tesla Charging Adapter is Good for Tesla, Ford and the EV \nIndustry",
    "date": "2/29/2024",
    "url": "https://cleantechnica.com/2024/02/29/why-fords-tesla-charging-adapter-is-good-for-tesla-ford-and-the-ev-industry/",
    "text": " A few days ago, Ford CEO Jim Farley teased us with a picture of a Ford Mustang Mach-e EV charging at a Tesla Supercharger, Farley promised “more details coming very soon.” Today, the company officially announced that its Tesla adapter is available for retail customers to order free of charge until June 30, 2024. After that date, it will cost $230. This means owners of Ford EVs, including the Mustang Mach-e and F-150 Lightning, will be able to use Tesla Superchargers to charge their EVs at high speed. Technically, the adapter is an “NACS to CCS” adapter or “SAE J3400 to CCS” adapter (the new standard names), but we all know it as the Tesla plug because Tesla invented it and opened it up in 2022 to become a public standard. And it’s the plug we find at over 25,000 DC fast chargers in the Tesla Supercharger network in North America. Ford is calling it their “Fast Charging Adapter.” Previously, Ford EV owners were limited to CCS (Combined Charging System) chargers for high-speed charging. Rather than building out its own network of chargers, Ford partnered with third party charging networks including Electrify America to form what they call their “BlueOval” charging network. As of today, Ford lists Tesla as one of their BlueOval charging partners and states that their customers now have access to “over 110,000 chargers, with more on the way.” Why would Ford partner with a competitor? To sell more cars, of course. But they’re not the only beneficiaries. Like Tesla Superchargers, CCS fast chargers allow an EV to regain up to 80% of its range in about 15–30 minutes. This makes long-distance road trips practical in an EV. But even after several years building out their networks, no single high-speed charging network yet approaches Tesla’s in size. Using data provided by the US Department of Energy, Electrify America, the second largest network in the US, currently has 918 CCS fast charging stations with 4,133 ports in the US and Canada. Meanwhile, Tesla has 2,393 Supercharger locations in the US and Canada with 26,515 charging ports. Even if we look at the sum of all CCS chargers in the US and Canada, there are currently only 16,995 CCS charging ports: Tesla has almost 40% more high-speed chargers than all the CCS charging networks combined. There are currently more CCS charging stations (8475 vs. 2407) but fewer actual charging ports. But more important than the number of stations is the performance and reliability of these charging stations. CCS charging networks like Electrify America have been plagued with performance and reliability issues. EA chargers are frequently non-functional or are “de-rated,” meaning they deliver power at much lower rates than they should. This unreliability has led to an overall lack of confidence in the high-speed charging networks from EV owners and prospective EV buyers. Although there are signs that this is improving, the damage has been done. Meanwhile, Tesla’s Supercharger network enjoys the highest reliability and satisfaction ratings of any high-speed charging network. Generally speaking, Tesla Superchargers are fast and reliable, and that’s critical for EV drivers, particularly those traveling far from home. The benefit to Ford customers is clear: access to Tesla Superchargers allows Ford EV owners to charge at the great majority of DC fast charging stations in the US and Canada. This allows Ford EV drivers to travel long distances with confidence. It also gives Ford EV owners without the ability to charge at home or at work more convenient charging options. To take advantage of this new capability to charge at Tesla Superchargers, Ford EV owners need to request the Tesla/NACS to CCS adapter from Ford at ford.com/FastChargingAdapter. The adapter is free for retail customers until June 30, 2024, or $230 after that date. The customer then needs to create an account on Ford’s BlueOval charging network and activate the “Plug & Charge” feature. Tesla Superchargers will support Plug&Charge with Ford EVs. This means customers simply have to plug in and charging will automatically start, with charges managed through FordPass. This is similar to the way Tesla owners currently charge at Superchargers. Ford owners will have access to all of Tesla’s V3 and V4 Supercharging stations, which currently account for approximately 75% of Tesla’s Supercharger stations in North America. All of the new Supercharger stations Tesla is rolling out now are Version 3 or Version 4, so these should all be eligible for use by Ford and other non-Tesla EVs using an adapter. Ford also announced that existing customers can now use the FordPass App or the Charge Assist (soon to be “Public Charge”) App on the vehicle touchscreen to locate all chargers just like before, but this now includes Tesla Superchargers. Integration of Tesla Superchargers into the car’s built-in routing will come with a future software update. By opening the Tesla Supercharger network to Ford EV drivers and other non-Tesla owners, Tesla is able to increase its Supercharger revenue, which then funds the construction of more Supercharger stations. Non-Tesla customers are charged a higher charging rate than Tesla customers, in order to accommodate the higher cost associated with supporting third party vehicles. Non-Tesla owners who wish to charge at the lower Tesla owner rate can sign up for a monthly Supercharging subscription (currently $12.99/month). This subscription option will lead to additional revenue for the company. An additional benefit to Tesla customers is that by Tesla opening the Tesla/NACS plug to become an industry standard — and by having all of the major EV makers adopt this standard — the “Tesla plug” will also start being included in third party DC fast chargers. All of the major DC fast charging networks — including Electrify America, ChargePoint, and EVGo — have announced that they will be adding NACS plugs to existing and new fast charging stations. This means Tesla drivers will soon have hundreds, perhaps even thousands, of additional non-Tesla fast charging stations available to them without the need to purchase a CCS adapter. In my case, my Model 3 is too old (2018) to support CCS charging without a retrofit, so I’m looking forward to having more high-speed charging options available. Some Tesla owners are concerned that opening up the Tesla Supercharger network will lead to congestion and long lines at Tesla Superchargers, and while this is possible, it is unlikely. It’s important to keep in mind that Tesla is still the dominant player in the US EV market. Tesla sold more EVs in the US in 2023 than all of its competitors combined. Tesla’s EV market share in 2023 was 55%. Meanwhile, Ford’s EV market share in the US in 2023 was 5.5%. So, for every 10 Teslas sold in the US in 2023, 1 Ford EV was sold. This is not a significant increase in Supercharger demand. Even as other EV manufacturers like GM and others begin offering CCS adapters, the increase in Supercharger demand will not spike overnight. Most EV owners charge their cars at home or at work and only need access to high-speed chargers while traveling. With a few exceptions, Tesla has managed to stay ahead of the demand for Supercharger stations, consistently building out the Supercharger network so that Tesla customers can use their cars for long-distance travel without incurring unnecessary delays. I recently completed a 6000-mile road trip from New York City to Tacoma, Washington, and back in my Model 3 and found myself alone (or close to it) at dozens of Supercharger stations across the US. In some major cities and around major holidays (particularly in cold weather), some Tesla drivers have had to wait to charge their cars, but this is the exception, not the rule. With Tesla’s charging port becoming an industry standard, it has become easier for the company to qualify for federal grants to build out the country’s EV charging infrastructure as part of the Bipartisan Infrastructure Law. Tesla recently secured $17 million in government grants to build out 41 additional Supercharger stations in the United States along major travel corridors. With this influx in infrastructure investment, Tesla should be able to keep up with increased Supercharger demand. Also, Tesla drivers still have exclusive access to around 25% of the Tesla Superchargers in North America. In order to open up Tesla chargers to CCS-equipped vehicles, Tesla had to modify the “signaling protocol,” which is the communication between the vehicle and the charger. This change was only made in the company’s V3 chargers and above. Tesla’s V1 and V2 Superchargers do not support cars with CCS charge ports (with or without an adapter). V2 chargers are limited to a maximum charging speed of 150 kW (compared to V3’s 250 kW max), but this is still fast enough for road trips for most people, or good for the occasional local top-off when needed. Moving forward, all Tesla Superchargers are likely to be V3, V4 (and beyond), but the 870 V1 and V2 Supercharging stations in North America will not be accessible by non-Tesla vehicles any time soon. One of the only remaining — and somewhat legitimate — criticisms of current-generation electric vehicles is that they are not suitable for road trips. This has never been my personal experience in six years and 65,000 miles owning a Tesla. I actually don’t mind stopping a little more frequently than I used to in my gas car, and I’ve never had a problem finding an available Supercharger along my travel routes. But for EV drivers who don’t own a Tesla, the lack of reliable high-speed charging options has limited their vehicles’ overall utility. Now, Ford EV owners — and soon others — will have the same piece of mind that I and millions of other Tesla owners have when driving long distances in our EVs. Range anxiety has left the building. With the adoption of the NACS charging port by all major EV manufacturers, and the opening of Tesla’s extensive and reliable high-speed Supercharger network to non-Tesla EVs, current and prospective EV owners can feel more confident that they will always have access to chargers when and where they need them. This removes one of the last remaining barriers for many car owners to purchase an EV. With increasing EV demand and continued public and private investment in building up the charging infrastructure, the US is on a clear path to replacing harmful ICE vehicles with emissions-free EVs. Got thoughts on how this impacts the EV market or your own personal EV journey? As always, let us know in the comments. Related reading: Why is Making a Reliable EV Charging Network So Hard? Electrify America’s Charging Network Does Seem to be Getting Better EV Charging Stations in the US Ranked (2023) Ask an Expert: Can You Charge a non-Tesla EV at a Tesla Charging Station?  is an EV and alternative fuel enthusiast who has been writing about technology since 2003. Chris Boylan has 68 posts and counting.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\tSee all posts by Chris Boylan "
}