{
    "title": "Tesla: Musk may face board challenges in achieving Texas move",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/video/tesla-musk-may-face-board-173406313.html",
    "text": "Tesla (TSLA) CEO Elon Musk may not have the full backing of the EV maker's board of directors to re-incorporate Tesla in Texas from Delaware. Yahoo Finance Legal Reporter Alexis Keenan highlights the boardroom challenges Musk may face in getting approval on this decision. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. [AUDIO LOGO] AKIKO FUJITA: Well, Tesla CEO Elon Musk's relationships with people on the EV makers board of directors might present a challenge to his push to reincorporate the company from Delaware to Texas. Let's bring in our very own Alexis Keenan for more on this story. Alexis. ALEXIS KEENAN: Hi, Akiko. Yeah. So I've been exploring whether Musk Tesla will need kind of a fresh crop of board members in order to effectuate and get through a suggestion and vote on a move of Tesla's incorporation from Delaware to Texas. And the corporate structuring experts that I've been talking to, they say that they think the company very well might need some new members. Now, one major reason is that the Delaware Chancery Court that invalidated that whopping $56 billion pay package-- CEO pay package for Musk, they did it by applying this really tough legal standard that even at Musk's 21.9% control of the company at that time said that Musk controlled Tesla. And that really put a burden on Musk to have to prove that that shareholder vote for that pay package was fair. Now, the judge said it wasn't, and that's because the judge concluded that Musk had, quote, \"thick ties\" with some of these directors that negotiated this compensation. And also that Tesla's proxy statement that recommended this pay package, that it didn't adequately tell investors about whether the board members who recommended it were independent versus not independent. They said, it wrongly said that the directors were not independent enough from Musk. So in order for the management to now recommend this shareholder vote on an incorporation in Texas, they're going to want to avoid this really heightened legal standard. And the way they could do it is to avoid these types of relationship conflicts. So take a look at Tesla's current board. Now it's different from what it was at the time of this pay package. And you kind of start to see some of the problems here and the limitations of who on in this group might be able to make a recommendation for this. You have Musk, who would need to abstain from this vote, you have Robyn Denholm-- the board chair that the Delaware judge said lacked independence. Also Ira Ehrenpreis-- Musk's close friend. Also the Delaware judge concluding that he lacked independence. James Murdoch CEO of 20th Century Fox, also a friend of Musk. Then you have Kimbal-- Musk's brother. You have JB Straubel-- Tesla co-founder, and Joe Gebbia-- Airbnb co-founder, as well as Kathleen Wilson-Thompson-- former executive at Walgreens and Kellogg. So there may be some of that group that would be considered independent enough, though some of these people haven't been tested in a fresh lawsuit. And certainly, shareholders could come back and say that they didn't think an action involving Musk or something that Musk wants presumably for his benefit. A move to Texas that it might not be fair. So even though without a conflict, though, this would all have to get through a shareholder vote. And it would have to be a majority of Tesla's minority shareholders. RACHELLE AKUFFO: So for people who are trying to look at some of the other precedent that's out there, another case that I know you were following in Delaware was decided last week that gave the green light to trip advisors move to Nevada over a legal challenge from shareholders. How might that impact Tesla's decision to try and incorporate in Texas? ALEXIS KEENAN: Yeah, Rochelle. So this other case, it was a pending case now just decided this week, and it very well might have an impact on what Tesla decides to do here. What happened was the shareholders similarly challenged this company, Tripadvisor, went ahead and voted on a move from Delaware to Nevada where it has more friendly rules for board directors in terms of liabilities that they can take on if they're challenged. Now, that, though, decision said that the company could go ahead, move to Nevada, incorporate there, but the real kicker here is that the judge said, the lawsuit, it can continue. And if during the pendency of that lawsuit, the shareholders who brought it are able to show that they were damaged by this move and that they should receive some sort of monetary compensation, that that would allow the case to go forward and for the shareholders to get really their day in court. So all of this-- a lot in the mix here yet Tesla has yet to make any move that we've seen to put forth a recommendation to its shareholders. But so much to consider here and certainly would be a big move for Tesla if it does decide to go ahead with a suggestion here. RACHELLE AKUFFO: And I know you'll be following all of that action for us, appreciate you breaking all of that down. Our very own, Alexis Keenan. Related Quotes "
}