{
    "title": "New report reveals exceptional trend among one state's drivers — and Tesla \nis reaping the benefits",
    "date": "2/14/2024",
    "url": "https://www.thecooldown.com/green-business/california-ev-vehicle-sales-years/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. It's been a banner year for the company. Photo Credit: iStock The commitment to electric vehicles in California is commendable, and the state has reached a new high in sales of the technology. Data from the California New Car Dealers Association revealed that 21.4% of new car sales in 2023 were electric vehicles, which Electrek reports is a new record. The figure dwarfs the nationwide percentage, with only 7.5% of vehicles sold across the country in the same period being electric. That's probably down to the incentives that California offers to prospective buyers, with rebates available for new and used electric models. It's unsurprising which brand boasted the top-selling car — Tesla's Model Y reached the summit of the charts with 132,636 registrations in the light truck category. The company also had the most-purchased passenger car, with the Tesla Model 3 seeing 82,786 units shifted in the state. As Electrek observed, Toyota was the top-selling brand across the automotive sector, holding 15.7% of the market share, but Tesla wasn't far behind at 13% — which is particularly impressive considering it has far fewer model options under its umbrella. That means one in every eight cars sold in California in 2023 was a Tesla, proving there is a strong appetite in the Golden State for cars that produce zero tailpipe pollution. It's been a banner year for the company, which said in a fourth-quarter earnings call, per Teslarati, that it sold 1.2 million Model Ys in 2023, making it the best-selling car worldwide regardless of powertrain. That figure also represented a 57% increase in how many of those cars were sold in 2022, as CleanTechnica observed. Meanwhile, another electric vehicle brand had significant success. Rivian saw a 142.7% increase year-on-year for sales, suggesting it is starting to muscle its way into a market that has had a clear leader for some time. \"It's great to see California showing what's possible when policymakers care about this green stuff,\" one commenter on Electrek said. \"It's so great to see the death of [the internal combustion engine] as the main source of transport occur in real time,\" added another. Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}