{
    "title": "Tesla moves forward with plans to occupy nearly 1M square feet in Kyle — \nhere’s what we know",
    "date": "2/16/2024",
    "url": "https://www.kxan.com/news/business/tesla-moves-forward-with-plans-to-occupy-nearly-1m-square-feet-in-kyle-heres-what-we-know/",
    "text": "KXAN Austin Please enter a search term. Please enter a search term. by: Justin Sayers – Senior Staff Writer, Austin Business Journal Posted: Feb 16, 2024 / 04:06 PM CST Updated: Feb 16, 2024 / 04:06 PM CST Job listings shine light on what the manufacturer may have planned in Hays County by: Justin Sayers – Senior Staff Writer, Austin Business Journal Posted: Feb 16, 2024 / 04:06 PM CST Updated: Feb 16, 2024 / 04:06 PM CST AUSTIN (ABJ) — Tesla Inc.’s plans to lease nearly 1 million square feet in Kyle sent ripples through the regional economy when it was announced last year, even though specific details of what the Austin-based electric vehicle maker had in store were not available at the time. Recent filings with both the city and state — plus job listings on the company’s website — begin to bring those plans into focus. Kyle Mayor Travis Mitchell revealed last year that Tesla was expected to lease three buildings at the Kyle/35 Logistics Park, about 20 miles south of downtown Austin, for warehousing and light assembly. Read the full story on the Austin Business Journal website. Copyright 2024 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Walmart’s Shark Days sale is here, and with it, you can get some pretty incredible discounts on Shark vacuums of all kinds. Shop excellent fitness gear deals now at Amazon’s Big Spring Sale. Spring wreaths symbolize fertility and the start of a new season as the snow melts and the grass begins to grow green. Thanks for signing up! Watch for us in your inbox. Subscribe Now Thanks for signing up! Watch for us in your inbox. Subscribe Now Send your story tips to our news team "
}