{
    "title": "Here’s what you need to know about BYD, the Chinese EV giant that just \novertook Tesla",
    "date": "1/3/2024",
    "url": "https://www.cnn.com/2024/01/03/cars/china-byd-explainer-tesla-intl-hnk/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter, which explores what you need to know about the country’s rise and how it impacts the world. BYD overtook Tesla as the world’s top seller of electric vehicles (EV) at the end of last year, crowning an extraordinary rise for the Chinese carmaker. It delivered more fully electric cars than Tesla for the first time in the three-month period to December 31, and slashed the sales lead held by Elon Musk’s company over the year as a whole. So how did a little-known Chinese battery maker grow so quickly to become Tesla’s biggest rival? Based in the Chinese megacity of Shenzhen, BYD was founded in 1995 by Wang Chuanfu, a low-key former academic who still runs the company. Wang says the letters BYD don’t stand for anything in particular. He said he chose a “rather strange” name to set it apart from other startups. It is China’s top EV producer and exports electric taxis, buses and other vehicles to the rest of the world, including Europe, South America, Southeast Asia and the Middle East. Unlike Tesla (TSLA), it also makes plug-in hybrids. Israel and Thailand currently count as BYD’s major overseas markets, where the Chinese company ranks number one in EV sales. Its best-selling passenger cars are the Qin and Song models. The Qin is a compact sedan available as a plug-in hybrid or an all-electric car. The BYD Song is a series of compact crossover SUVs. Compared to Tesla, BYD is known for offering more affordable cars, which helped it attract a wider group of consumers. Its entry-level model sells in China for just over $10,000; the cheapest Tesla Model 3 costs more than $32,000. BYD’s passenger cars are not yet available in the United States. But its electric buses — made in Lancaster, California — are sold in the country. Wang, an engineer, first moved to Shenzhen in the early 1990s to run a battery making business for a Beijing-based government research institute, according to his official resume in the company’s filings. Government posts in China at that time were considered “iron rice bowls,” a popular term for a job for life. But Wang soon quit and founded BYD. The start of his entrepreneurial journey coincided with the opening of the Chinese economy to the world. China’s former leader Deng Xiaoping had set up the country’s first special economic zone in Shenzhen, which encouraged hundreds of manufacturing businesses to flock to the city, lured by its liberal economic policies and cheaper labor and land costs. By 1997, Wang had grown his small workshop to a medium-sized cellphone battery maker with more than 100 million yuan ($14 million) in annual sales. That year, the Asian financial crisis provided a growth opportunity as plunging battery prices pushed many competitors out of business. Wang’s company was able to survive due to its cost advantage, according to the Southern Weekly newspaper. By 2003, BYD had become the world’s largest producer of nickel-cadmium batteries, which were widely used in mobile phones. But Wang wanted more. Eyeing the future growth of EVs, Wang ventured into the car industry in 2003, acquiring a state-owned automaker in the city of Xi’an for 269 million yuan ($38 million). While that surprise decision angered the company’s strategic investors and triggered a 21% plunge in the company’s Hong Kong-listed shares, as Wang later described, he  remained steadfast. “I build cars because I am optimistic about the future development of electric vehicles,” he said defiantly after the share price plunge, according to state-owned Beijing Business Today. Just five years later, in 2008, Wang was vindicated when he received a $230 million investment from his most famous backer, Warren Buffett, who paid about $1 per share for a stake of around 10%. That vote of confidence helped boost the company’s stock by as much as 1,370% over the next year. BYD launched its first plug-in hybrid model at the end of 2008. Since then, BYD has taken off as an EV manufacturer, partly thanks to the Chinese government’s support for the industry. Buffett has been gradually trimming his stake in BYD since 2022, taking some of the enormous profits he has made. According to the most recent filing by Buffett’s Berkshire Hathaway, the firm held nearly 8% of BYD as of late October. Those shares are now worth 18.28 billion Hong Kong dollars ($2.3 billion). BYD has dominated the Chinese EV industry since 2015, when it surpassed its domestic and overseas rivals in the world’s biggest car market. One of its key advantages against Tesla, the number two player in China, is price. Tesla’s four models — the Model 3, Model Y, Model S and Model X — have price tags ranging from $40,000 to $120,000 in the United States. In China, the cheapest Tesla model, the base Model 3, has a starting price of 229,900 yuan ($32,375). It has a range of 272 miles on a full charge and a top speed of 140 miles per hour. By contrast, the BYD Seagull has a starting price of 73,800 yuan ($10,392) in China. It has a top speed of 81 miles per hour. The Seagull is available with two battery packs. The smaller battery has a range of 190 miles, while the larger battery has a range of 251 miles. Both Tesla and BYD vehicles have received safety ratings from international organizations. In 2022, Tesla’s Model Y and BYD’s Atto 3 received a five-star Australasian New Car Assessment Program (ANCAP) rating respectively. Since 2020, BYD has been making its lithium iron phosphate battery (LFP) “Blade Batteries” for use in its own cars and for sale to other auto makers, such as Toyota. The company says the blade-shaped battery is thinner and longer than conventional lithium iron cells, and thus can maximize the use of available space within the battery pack. It’s also less likely to catch fire even when it’s severely damaged, according to BYD. Tesla also reportedly uses BYD Blade Batteries for its Y cars produced in the Berlin Gigafactory, according to German media. In March 2023, Elon Musk denied a media report saying Tesla was ending cooperation with BYD on battery supply. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}