{
    "title": "With Delivery Growth Cooling, Is Tesla Stock Still A Buy At $250?",
    "date": "1/4/2024",
    "url": "https://www.forbes.com/sites/greatspeculations/2024/01/04/with-delivery-growth-cooling-is-tesla-stock-still-a-buy-at-250/",
    "text": "02 January 2024, Brandenburg, Grünheide: A Tesla Model Y electric vehicle stands in front of the ... [+] Tesla Gigafactory Berlin-Brandenburg. Photo: Patrick Pleul/dpa (Photo by Patrick Pleul/picture alliance via Getty Images) Tesla\nTSLA\n reported 485,000 deliveries for Q4 2023, marking an increase of about 20% versus the last year. The company’s total deliveries for 2023 came in at 1.8 million units, up 37.7%, meeting its revised full-year guidance. However, this is below CEO Elon Musk’s long-term target of growing deliveries by 50% or more annually. Growth in the EV market has been cooling off, amid high interest rates, which are making it more expensive to finance EVs, and also due to weaker consumer sentiment amid an uncertain economy. However, Tesla has benefited from a couple of trends. For example, the company sold a refreshed version of its Model 3 in a few select markets, while also commencing deliveries of its newest Cybertruck pickup truck in the U.S. Tesla also cut pricing on some of its vehicles over the last year and began a limited amount of advertising in the second half of 2023 - something that the company has largely avoided since its incorporation. For instance, Tesla just reintroduced the rear-wheel-drive version of its popular Model Y crossover-sized vehicle in the U.S. at a price of about $44,000. The Model 3 starts at under $39,000. Looking at a slightly longer period, TSLA stock has seen little change, moving slightly from levels of $235 in early January 2021 to around $250 now, vs. an increase of about 25% for the S&P 500 over this roughly 3-year period. Overall, the performance of TSLA stock with respect to the index has been quite volatile. Returns for the stock were 50% in 2021, -65% in 2022, 102% in 2023, and 0% in 2024. In comparison, returns for the S&P 500 have been 27% in 2021, -19% in 2022, 24% in 2023, and -1% in 2024 - indicating that TSLA underperformed the S&P in 2022. In fact, consistently beating the S&P 500 - in good times and bad - has been difficult over recent years for individual stocks; for other heavyweights in the Consumer Discretionary sector including AMZN, HD, and TM, and even for the megacap stars GOOG, MSFT, and AAPL. In contrast, the Trefis High Quality Portfolio, with a collection of 30 stocks, has outperformed the S&P 500 each year over the same period. Why is that? As a group, HQ Portfolio stocks provided better returns with less risk versus the benchmark index; less of a roller-coaster ride as evident in HQ Portfolio performance metrics. Given the current uncertain macroeconomic environment with high oil prices and elevated interest rates, could TSLA face a similar situation as it did in 2022 and underperform the S&P over the next 12 months - or will it see a strong jump? We currently remain relatively neutral on Tesla stock, with a $237 price estimate, which is slightly below the $248 market price. We continue to believe that Tesla will remain a big beneficiary of the long-term transition to cleaner transportation and energy generation, given its well-oiled supply chain, superior battery and drive train tech, and its lead with software and self-driving technology. However, Tesla stock presently trades at about 72x 2024 consensus earnings, which could limit near-term upside. Competition is also mounting and Tesla’s lineup is aging with its Model 3, Y, X, and S remaining the same visually since launch. This is in contrast with mainstream automakers, who typically overhaul vehicle models every seven to eight years. While Tesla did recently launch the Cybertruck, we believe that the vehicle will remain a niche proposition, given its high price and unconventional looks. While Tesla advertised a starting price of $40,000 for the truck during the first unveil event back in 2019, the base model now starts at $61,000, with top-end models rising to about $100,000. Separately, Tesla’s price cuts in the United States and China are impacting margins. Tesla’s earnings for 2023 are projected to decline year-over-year. See our analysis on Tesla Valuation: Is TSLA Stock Expensive Or Cheap? for more details on Tesla’s valuation and how it compares with peers. For more information on Tesla’s business model and revenue trends, check out our dashboard on Tesla Revenue: How Does TSLA Make Money? TSLA Return Compared With Trefis Reinforced Portfolio Invest with Trefis Market Beating Portfolios See all Trefis Price Estimates  "
}