{
    "title": "Tesla stock will gain 550% and SpaceX's valuation will triple by 2030 under \nElon Musk's leadership, top invest",
    "date": "1/27/2024",
    "url": "https://www.businessinsider.in/stock-market/news/tesla-stock-will-gain-550-and-spacexs-valuation-will-triple-by-2030-under-elon-musks-leadership-top-investor-says/articleshow/107175625.cms",
    "text": "Liked the article? Share it with your friends... or copy link Shares of Tesla have tanked this week following a downbeat earnings outlook, but fund manager David Baron remains bullish on Elon Musk's carmaker, as well as his rocket-producer SpaceX. He forecasts Tesla stock to gain about 550% to hit $1,200 a share by 2030, and for SpaceX to triple in valuation over the same period, according to a recent interview conducted by Bloomberg. Baron runs the Baron Focused Growth Fund, which counted Tesla and SpaceX as its largest holdings as of December 31, 2023. The fund climbed 28% in 2023, outperforming the S&P 500's gain of 24%. Baron told Bloomberg that the growth outlook for Musk's companies remains strong, even if it has moderated from previous calls. \"While he may not be growing 50% a year as the company thought, this year in a tough environment he's still growing volume by 15% to 20% per year and making us $7,000 per car of gross profit,\" Baron said. His comments come on the heels of a rough week for Tesla, which reported revenue and profit that lagged estimates, and warned of a production slowdown in 2024. The stock tumbled 12% on Thursday following the results and a tumultuous earnings call one analyst called a \"train wreck.\" \"This was the most sobering outlook I have seen from Tesla,\" Gene Munster, the managing partner at Deepwater, said in an interview with CNBC Wednesday. Meanwhile, Baron expects SpaceX's valuation to increase by 20% this year. Longer term, he sees it doubling within three years and tripling by 2030. Bloomberg previously reported the company is worth more than $175 billion. The Tesla allocation in Baron's fund is critical for his ambition to boost his total assets to $2 billion, up from current levels of about $1.3 billion. One reason Baron is so bullish on Musk is that the world's richest person still holds a significant stake in his companies. Baron says he looks for such ownership levels when deciding where to invest. \"[Musk's] interests are aligned with ours,\" Baron maintained. \"He's not going to do anything stupid to change the trajectory of the companies.\" Advertisement "
}