{
    "title": null,
    "date": "1/29/2024",
    "url": "https://cnevpost.com/2024/01/29/tesla-22-pct-revenue-from-china-2023/",
    "text": "Home » Tesla In the fourth quarter, Tesla's revenue from China was a record $6.1 billion, or 24.25 percent of its total revenue.  Tesla (NASDAQ: TSLA) got $21.75 billion in revenue from China in 2023, or about 22.5 percent of its total revenue of $96.77 billion, according to an SEC filing today. The electric vehicle (EV) maker reported revenue of $25.17 billion in the fourth quarter, up 3.49 percent from the year-ago quarter and up 7.78 percent from the third quarter, according to its financial results announced on January 24. Tesla's revenue from China was $6.1 billion in the fourth quarter, surpassing the $5.73 billion in the second quarter of 2023 for a record high, CnEVPost's calculations show. That's up 33.34 percent year-on-year and up 21.57 percent from $5 billion in the third quarter China contributed 24.25 percent of Tesla's quarterly revenue in the fourth quarter, up from 21.50 percent in the third quarter and 18.82 percent a year earlier.  Tesla delivered 484,507 units worldwide in the fourth quarter, up 19.55 percent from the year-ago quarter and up 11.37 percent from the third quarter, according to data it released earlier this month. In China, Tesla sold 75,805 vehicles in December, up 80.81 percent year-on-year and up 15.73 percent from November. In the fourth quarter, Tesla sold 169,935 vehicles in China, accounting for 35 percent of the 484,507 vehicles it delivered globally, data compiled by CnEVPost showed. That's up 39.73 percent year-on-year and up 21.71 percent from the third quarter.  For the full year 2023, Tesla sold 603,664 vehicles in China, up 37.27 percent year-on-year. China is Tesla's second-largest single market in the world, after the United States. Tesla's revenue in the US was $45.2 billion in 2023, contributing 46.7 percent of total revenue. Other international markets, including Europe, contribute $29.8 billion in revenue to Tesla in 2023, or 30.8 percent. Tesla cuts Model 3 and Model Y prices in China amid fierce competition  "
}