{
    "title": null,
    "date": "1/2/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240102310/tesla-other-ev-stocks-sell-off-as-delivery-data-spooks-investors",
    "text": "By Tomi Kilgore Tesla tops estimates, Rivian's stock sinks as 2023 deliveries miss views and Nio's stock drops as quarterly deliveries decelerate Shares of electric-vehicle makers traded lower Tuesday, as delivery data failed to spark investor interest following a stellar 2023 for the group. The Global X Autonomous & Electric Vehicles ETF DRIV dropped 1.8%, after soaring 24.2% in 2023. The ETF underperformed the S&P 500 index SPX, which slipped 0.6% on Tuesday. Meanwhile, Tesla Inc.'s stock (TSLA) finished the day fractionally lower, after wobbling during regular trading hours. The \"former\" global EV leader said earlier that it delivered 484,507 EVs in the fourth quarter, up 19.5% from a year ago and above the FactSet consensus of 473,000. \"This was an important quarter for Tesla to show strong deliveries with clear momentum into 2024 as demand has upticked since 3Q, based on all our global checks,\" Wedbush analyst Dan Ives wrote in a note to clients. The stock saw some weakness earlier, as the data confirmed that Tesla ceded the EV delivery title to BYD Co. (BYDDY) (HK:1211), which is based in China. BYD reported on Sunday that it delivered 190,754 EVs in December, which brought the fourth-quarter total up to 526,409 EVs, or 8.6% above Tesla's total. Read: Tesla is getting beat by China's BYD on EV sales. But still, BYD's U.S.-listed shares shed 2.8%, snapping a six-session win streak. Among other China-based EV makers, Nio Inc.'s stock (NIO) took a 7.2% dive. The Shanghai-based company reported Monday morning that it delivered 50,045 vehicles during the fourth quarter. While that was up 25% from a year ago, it was down 9.7% from the 55,432 vehicles delivered in the third quarter. Among other China-based EV makers, shares of Li Auto Inc. (LI) lost 7.6%, even after the Beijing-based EV maker said fourth-quarter deliveries of 131,805 was up 184.6% from a year ago, and 25.4% more than what it delivered in the third quarter. And Xpeng Inc.'s stock (XPEV) slumped 3.8%, even after the Guangdong-based company delivered a quarterly record of 60,158 EVs in the fourth quarter, up 171% from a year ago and 50.4% more than the third quarter. Meanwhile, Rivian Automotive Inc.'s stock (RIVN) tumbled 10.1% after the California-based EV maker said it delivered 13,972 EVs in the fourth quarter, up 73.4% from a year ago but 10.2% less than what it delivered the previous quarter. For 2023, Rivian delivered 50,122 EVs, up 146.5% from 2022 but below the FactSet consensus of 51,000. Elsewhere, shares of Fisker Inc. (FSR) were down 6.9%. Mullen Automotive Inc.'s stock (MULN) was knocked 10% lower, while Nikola Corp. shares (NKLA) fell 4.8%. -Tomi Kilgore This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 01-02-24 1644ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}