{
    "title": "Tesla recalls 1.6M EVs in China over Autopilot concerns",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/video/tesla-recalls-1-6m-evs-143220744.html",
    "text": "Tesla (TSLA) is recalling over 1.6 million of its Models S, X, 3, and Y EVs exported to China over concerns around its Autopilot autonomous driving feature. Yahoo Finance anchors Seana Smith and Myles Udland paint a picture of Tesla's EV competition in the Chinese market while monitoring Tesla shares in Friday's pre-market trading session. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. SEANA SMITH: Let's take a look at Tesla because Tesla's self-driving problems are continuing to escalate. The EV giant recalling more than 1.6 million electric vehicles in China. Now, China's state administration for market regulation issuing this recall on Tesla Models S, the Model X, Model 3, and Model Y after raising concerns over its auto-steering function and door latch controls. You're looking at losses just about 3/10 of a percent here in pre-market trading ahead of the open, so not a huge move in the stock. But Miles, one of the reasons we bring this up is just because the issue that this really points or maybe it gives investors another reason to be a bit concerned about Tesla, at least in the short term, particularly in China. We had the news earlier this week with BYD overtaking Tesla as the most widely sold EV in the world. So on a global basis, there is some cause for concern just in terms of Tesla being able to produce cars and produce them at a price point that's really going to be a mass market here outside of the US. - You know, our autos reporter Pras Subramanian doesn't need to tell you that I'm not a huge recall guy when it comes to like a story for the stock. But I think, as you mentioned, the China story is really the important one for Tesla as we get into this year. In the fourth quarter, we saw BYD overtake them in terms of sales within China. There's been ruthless competition in the EV market worldwide over the last year around pricing. Now, Tesla's market share, at least in the US, still remains basically unchallenged. It's a little bit of a mixed picture as they go into different geographies. They're a huge leader in a number of markets over in Europe. But you have a lot of-- I don't know. This really feels like now is the moment when in terms of just pure market share, how many people have an EV from maker X versus have an EV from Tesla. Could start to get at least a little bit interesting. Now, how the stock acts, I mean, I feel like trying to figure out how Tesla is going to trade based on some of this information. That ship has sailed like many, many years ago. And you kind of-- every day, I feel like I wake up and Tesla is down 5%. Then I look at a one year chart and the stock's up 100%. So I'm never quite sure how to think about the actual trading in the name. And we are well past trying to figure out what piece of news will be a fundamental driver to get the stock to go up or down. I think the reasons why this continues to be a name that acts well or well established, given the investor base, how much money people have frankly made on this. People are becoming millionaires and billionaires just for owning a little bit of Tesla. So that story is obviously one that's outside of this local recall angle. But I do think Tesla's presence in China, how it navigates real challenges from domestic-based producers within China, a huge story for them not just in 2024, but really, I think through the end of the decade as more automakers get towards that. We want to produce, what? 50% of cars that are EVs by 2030, whatever the number is. And everybody has kind of a target around that. Certainly a story we're going to be tracking. Related Quotes "
}