{
    "title": null,
    "date": "1/11/2024",
    "url": "https://www.businessinsider.com/renting-tesla-from-hertz-what-it-was-like-experience-2024-1",
    "text": "In my first few minutes inside a Hertz waiting room in Ann Arbor, Michigan, I quickly realized I wasn't the first person here to try test-driving an electric vehicle through a rental service. One of the men in front of me was asking the rep about his options — a Tesla, a Volvo, a Chevy. He wanted to know what set each car apart, what each one looked like, and what the pricing was for each. When the worker went to the back to look for something, the man turned to someone nearby and explained he really hated Elon Musk and didn't want to rent a Tesla if he didn't have to. A conversation in the waiting room followed, with a spirited debate (well, as spirited as a bunch of polite Midwesterners get) about the pros and cons of Elon Musk and Tesla. After that, it was my turn to pick up my Model 3. I thought the employee might find it amusing after all the Tesla talk in the waiting room — but he wasn't fazed. He must do tons of these a day, I figured. The experience that followed reflected some of the headaches that may have led to Thursday's decision by Hertz to sell off 20,000 EVs from its fleet, citing higher costs to service and repair. The physical credit card needed for my booking was on the other side of town. My fault for not reading the fine print and assuming I didn't need the card if I had paid ahead of time, and also not a dealbreaker. When I came back 40 minutes later with the credit card, it only took a few minutes to complete the transaction and have the Model 3 pulled around. I was prepared to get a walk-around of the car or maybe some kind of quick run-down on how to use an EV or how to charge it. Instead, the Hertz rep handed me the Tesla key card and sat back down at his desk. I sat there for a moment before turning around to see my Model 3 parked out front. \"Oh, there it is!\" I said. And I walked out to the car by myself. Because I'd driven a Tesla before, I already knew how to tap the card to unlock the car and get in. I'm not sure a first-time Tesla driver would know that off the bat. For what it's worth, Hertz did email me some instructional videos about my Model 3 a few days before I picked up my rental. I found it buried in my inbox after I had the car, and these videos did help me quickly troubleshoot issues such as adjusting my side-view mirrors. My reservation quoted me about $56 a day — about what I expected for a fancier car during the holiday season. In total, my five days came out to $261.30 once taxes and fees were added in. When I got in the car, instructions on the touchscreen told me to press the brake and tap the key card on the center console. Once my Model 3 was ready to drive, I immediately checked the range, and my heart sank: Hertz had given the car to me with only 53% battery. I knew that in the Michigan cold, that wasn't going to last me very long. I needed to find somewhere to juice up before I could start putting the Tesla through its paces. \"Oh, well,\" I thought, \"A small setback.\" A Hertz spokesperson told me the company strived to have batteries at 80% for pickup, so it seems my experience was an oversight. The second I pulled onto the road, cars kicking up salty water quickly dirtied up the massive windshield of the Model 3. I went to hit the wiper fluid and immediately got an error message on the touchscreen: \"Wiper Fluid Low.\" Nothing came out of the sprayers. The wiper fluid wasn't just low; it was empty. \"Ok,\" I thought, getting a little more annoyed. \"Add that to the list with charging.\" Between the delay getting my car and the lack of charge, I decided to scrap my errands for the day and head home. I had dinner plans that night and needed to get home and change. I made two visits to Tesla Superchargers that night in order to keep enough range in the battery to get me where I needed to go — never with enough time to get up to a full charge. It was inconvenient but not prohibitive to my plans. Still, I wondered: What if I were a more typical rental customer, and this was the first day of a trip in which I had a lot of ground to cover? This could derail travel plans in a way half a tank of gas really couldn't. On the first stop, I charged for 15 minutes — as long as I could wait without being rude to my dinner host — to go from 35% to 40%. I left my house with 39%, so this trip was kind of pointless in the end. On my way home from dinner, the second stop was an hour long and only got me up near 60% battery. I got home after midnight. About 24 hours after acquiring the Model 3, thanks to a quick stop at CVS, the car was finally comfortable to drive, and the battery was at 100% charge. I could have asked for reimbursement for the wiper fluid when I dropped off the car, but I decided the $20 wasn't worth a back-and-forth with customer service. In the end, it's still a rental car. Hertz had sent me a video with instructions on how to use my Model 3 that helped me get through some little learning curves, and the free charging at Supercharger stations (so long as you return the car with the same level of charge you got it with) certainly saved me money. I had to charge four times in the five days I had the car. Dropping off the car at the end of my rental was also quick and seamless. I just parked, dropped the keys at the desk, and was on my way. Overall, getting started on renting a Model 3 from Hertz was bumpy and there are definitely simple improvements that could make the transition into the car more comfortable. Simply having 100% charge and a full wiper-fluid reservoir at pickup would have made all the difference in those first 24 hours. These little things are especially important as Hertz reckons with how to keep EVs in its fleets. My sometimes rocky experience renting an EV is proof that — from customers to employees to Hertz itself — there's still a lot of learning to do when it comes to electric cars. Even with these issues, I'd definitely rent a Tesla — or another EV — from Hertz again. A lot of the issues I encountered can be chalked up to one-off issues during the busy holiday season or the fact that I was renting from a smaller lot. I think what surprised me the most is how regular the experience is once the car is fully charged and you get used to things such as one-pedal driving. Even when you're renting a Tesla, it's still just a rental car. And Hertz is still just Hertz. Read next Jump to "
}