{
    "title": "Chicken shop boss makes Elon Musk vow as he loses £12k in Tesla trademark \nrow",
    "date": "2/14/2024",
    "url": "https://www.manchesterworld.uk/news/elon-musk-tesla-trademark-row-bury-takeaway-4517983",
    "text": "Manchester’s 10 richest neighbourhoods based on average income, including Withington and Didsbury The ambitious Greater Manchester council planning to treble town centre residents A Bury takeaway boss who wanted to call his new shop 'Tesla Chicken & Pizza' has been hit with a £12,000 bill after losing a trademark battle with Elon Musk's car giant. Amanj Ali, 41, registered the name in homage to inventor Nikola Tesla in May 2020, without objections. But when lawyers working for Tesla learned he'd registered the trademark in Britain, they launched a bid to protect its trademark for food and drinks services in the UK. Advertisement Advertisement  After losing the bitter ‘David and Goliath’ naming battle, Amanj was left with a fine and legal costs topping £12,000. And Amanj, who currently owns just a single chicken shop in Bury, said he would now not invite Elon Musk to eat at his premises. He said: “I was so disappointed after all this. All I can say is it is just because a big company [took on] a small company – nothing else. When I lost it, I was kind of hurting, but I just tried to keep a secret and not tell it to anybody. It was 18 months that I had been fighting them… I couldn’t sometimes sleep properly, and at that time, it was kind of hard for me.  He added about Musk: “If you asked me, 'Will you be inviting him', I would say ‘no’.” Hard-working Amanj said he had originally applied for his trademark as he hoped to open a new takeaway business in the Greater Manchester area. He already had a chicken shop called Colorado’s, but felt his new branch would need an alternative name as it would have a different identity. Advertisement Advertisement Amanj claims he struck upon 'Tesla Chicken & Pizza' as the famed inventor had left a mark on him when he was a youngster. And he planned for his new restaurant to have a mural dedicated to the trailblazer, who pioneered modern alternating current supply systems in electricity. Amanj said: “In my young age, I read about him... I don’t know whether it is true or not, but some people claim he invented a lot of things. For my Colorado’s brand, we do chicken only but with Tesla Chicken & Pizza, I wanted to do pizza as well. And we were planning when we open the restaurant, we will have a wall that will have a Nikola Tesla picture.\"  Amanj’s trademark was successfully registered in 'class 43' for food and drink services, but his plans for a new restaurant later stalled due to the pandemic. And in November 2021, he got emails from the UK's Intellectual Property Office (IPO), saying another party had applied for the 'Tesla' trademark in the same section. Stunned Amanj said he had no idea that electric car manufacturer Tesla was behind the application until he researched them on the internet. He said: “When we Googled that address, it was the headquarters of Tesla Motors. I’m a micro businessman being faced [with] one of the richest man’s companies, [so] I found a solicitor, and I called them.\" Advertisement Advertisement Working with his lawyer, Amanj said representatives from Tesla offered him £750 to sell the rights to his trademark to them in May 2022. But he was dismayed by this proposal and claims he then joked with his legal team that only '£750,000' would be enough to let him give it up. Amanj said his lawyer then relayed this to Tesla’s representatives as a matter of fact, and later they used this to successfully argue he had acted in “bad faith”. Amanj said: “At that time, they kind of made me laugh and I was angry, I just quickly replied to my solicitor, ‘Tell them my client will accept your offer with a ‘k’ next to it.' But my solicitor replied, ‘He won’t accept the £750 but instead, he will accept £750,000’… Tesla's solicitor used that against me.”  Court documents also revealed how Tesla's lawyers argued that a tweet sent by Elon Musk in January 2018 made clear his ambitions to start up a restaurant franchise using the company's name. It read: “Gonna put an old school drive-in, roller skates & rock restaurant at one of the new Tesla Supercharger locations in LA.” Advertisement Advertisement They also suggested that Amanj was “familiar with the trade mark system” and was aware of Musk's huge $206bn fortune due to his posts on social media. But after the case, Amanj said many people were aware of Musk's wealth and questioned whether the tweet was a legitimate business proposal as it hadn't yet materialised. Amanj fumed: “I said, 'I haven’t opened my restaurant yet, but you haven’t either?'\" As part of the IPO's ruling in late November last year, Amanj was forced to pay Tesla £4,000 while also shelling out £8,000 in fees for his solicitor. But despite the crushing defeat, he doesn't bear a grudge toward the world’s richest man. Amanj added: “I’m the type of person that I don’t have any hate against anyone. I am too busy to hate people.” Tesla has been contacted for comment.   "
}