{
    "title": "A Tesla rival is driving into India. What lies ahead for it",
    "date": "2/10/2024",
    "url": "https://m.economictimes.com/industry/renewables/a-tesla-rival-is-driving-into-india-what-lies-ahead-for-it/articleshow/107580767.cms",
    "text": "Download The Economic Times News App to get Daily Market Updates & Live Business News. Download The Economic Times News App to get Daily Market Updates & Live Business News.  The missing link: How criminals teamed up with bank employees to orchestrate cyber frauds. Payments banks a flawed business model, needs relook: former SBI chairman Rajnish Kumar What’s stopping GIFT City from becoming India’s Dublin? Was Dalal Street underestimating the potential of Maruti’s first EV? With USD169 billion in cash, what will be Warren Buffett’s next big money move? Challenges turning into tailwinds? 6 auto stocks from different segments with upside potential between 7-40% Trending Now Hot on Web In Case you missed it Top Calculators Top Searched Companies Top Prime Articles Top Story Listing Top Definitions Top Commodities Top Slideshow Top Videos Private Companies Follow us on: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin. Log In/Connect with: Will be displayed Will not be displayed Will be displayed Worry not. You’re just a step away. It seems like you're already an ETPrime member with Login using your ET Prime credentials to enjoy all member benefits Log out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.  To read full story, subscribe to ET Prime ₹34 per week Billed annually at \n                    ₹2499 ₹1749 Super Saver Sale - Flat 30% Off On ET Prime Membership   - - - Subscribe Now (Credit card mandatory) You can cancel your subscription anytime - - - Subscribe Now (Pay Using Netbanking/UPI/Debit Card)  ₹399/month Monthly\n        \t                        PLAN Billed Amount ₹399 No Trial Period  ₹208/month (Save 49%) Yearly\n        \t                        PLAN Billed Amount ₹2,499 15 \n            \t                                    Days Trial\n            \t                                +Includes DocuBay and TimesPrime Membership.  ₹150/month (Save 63%) 2-Year\n        \t                        PLAN Billed Amount ₹3,599 15 \n            \t                                    Days Trial\n            \t                                +Includes DocuBay and TimesPrime Membership. Quarterly $13.99 7  Days Trial Yearly (Save 40.0%) $33.99 15  Days Trial Get ET Prime for just ₹2499 ₹1749/yr Offer Exclusively For You Save up to Rs. 700/- ON ET PRIME MEMBERSHIP Offer Exclusively For You Get 1 Year Free With 1 and 2-Year ET prime membership Offer Exclusively For You Get 1 Year Free With 1 and 2-Year ET prime membership Offer Exclusively For You Get Flat 40% Off Then  ₹ 1749 for 1 year Offer Exclusively For You ET Prime at ₹ 49 for 1 month Then  ₹ 1749 for 1 year Holi Offer on ETPrime Get flat 20% off     Access the exclusive Economic Times stories, Editorial and Expert opinion Offer Exclusively For You Save up to Rs. 700/- ON ET PRIME MEMBERSHIP Offer Exclusively For You Get 1 Year Free With 1 and 2-Year ET prime membership Offer Exclusively For You Get 1 Year Free With 1 and 2-Year ET prime membership Offer Exclusively For You Get Flat 40% Off Then  ₹ 1749 for 1 year Offer Exclusively For You ET Prime at ₹ 49 for 1 month Then  ₹ 1749 for 1 year Holi Offer on ETPrime Get flat 20% off     90 Days Prime access worth Rs999 unlocked for you Exclusive Economic Times Stories, Editorials & Expert opinion across 20+ sectors Stock analysis. Market Research. Industry Trends on 4000+ Stocks ​Get 1 Year Complimentary Subscription of TOI+ worth Rs.799/-​ Stories you might be interested in "
}