{
    "title": "Tesla Stock: Labor Troubles Worsen But Some Positives Are Visible \n(NASDAQ:TSLA)",
    "date": "2/21/2024",
    "url": "https://seekingalpha.com/article/4671985-tesla-labor-troubles-worsen-but-some-positives-are-visible",
    "text": "jetcityimage jetcityimage Since I wrote about the electric vehicle [EV] giant Tesla, Inc. (NASDAQ:TSLA) last November, its share price is down by ~19% and even more year-to-date [YTD] (see chart below). No surprises there, given that a slew of factors were working against during at that time. Price Chart (Source: Seeking Alpha) Price Chart (Source: Seeking Alpha) My focus, then, was on its labor troubles in Sweden that risked spilling over into the rest of Europe and the U.S. Moreover, they also posed a potential risk to the company's already declining operating margins through the first nine months of 2023, fueled by price wars among EV companies. It didn't help that the stock's price had more than doubled YTD, resulting in elevated market multiples compared to peers. This, along with the company's other challenges, indicated little scope for further upside. However, much has happened in the past three months that reflects Tesla's ability to come out ahead despite its challenges. Here, I take a closer look at all these aspects to assess whether the Hold rating on the Tesla stock is now due for a relook. What started with Swedish mechanics striking for collective bargaining agreements in October last year spilt over into sympathy strikes by other workers' unions. This means that transportation, building maintenance and postal workers unions, among others, refrain from Tesla related tasks even as they carry on work otherwise. Unions in other Nordic countries like Denmark, Norway and Finland also support IF Metall, the Swedish Union, which means that Tesla's cars can no longer be unloaded on their docks. However, they haven't impacted Tesla's popularity so far. In its biggest Nordic market, Norway, Tesla's share jumped to 20% in 2023 from 12.2% the year before. Moreover, even in the eye of the storm, Sweden, the company has seen registrations inch up. This is in line with robust growth in the company's sales. The number grew by 20% year-on-year (YoY) in Q4 2023, even if it was considerably lower than the 38% growth seen for the full year 2023. However, risks persist, even though the share of Nordic countries in the company's 2022 sales was a small 2.7%. The first risk is slowing growth. In a hypothetical extreme case, if Tesla were to exit the Nordic markets, it could almost halve its quarterly YoY growth based on Q4 2023 figures. The second risk is that of a spread in industrial action to Germany, where it has big production plans and generates over 5% sales. While Tesla was quick to improve terms for German workers, possibly in anticipation, the challenge persists. The head of the country's union, IG Metall, Christiane Benner, expressed her displeasure with Tesla in an interview with Bloomberg upon taking on leadership last October. In the U.S., too, the United Auto Workers [UAW] union said it targets the unionization of at least one Tesla plant. As some background, UAW successfully conducted strikes for better terms from big car companies like General Motors (GM), Stellantis (STLA), and Ford (F) last year. But there could be some respite for the company as the macroeconomic situation improves. The cost of living crisis has subsided substantially, with Sweden's inflation in January 2024 down to 5.4% YoY from 11.7% a year earlier. It has declined also from 6.5% in October 2023, as I noted earlier. While the Swedish economy doesn't look any better placed with growth of 0.2% expected this year after a marginal contraction in 2023, the fact that it won't contract further and inflation can be even lower this year is still some positive. This, in turn, can play some part in easing the current labor pressures. Similarly, the German economy is expected to see better performance this year, too. Source: Tesla Source: Tesla Tesla's own numbers also give some hope. Besides robust sales, its operating margin rose to 8.2% in Q4 2023, reversing the sequential decline seen for the past three quarters. It's still only around half that seen in Q4 2022, but it has improved from 7.6% in Q3 2023. The real improvement was visible in its GAAP net margin, which rose to a high of 31.5% due to an income tax benefit. Still, there's something to be said for the fact that it maintained its non-GAAP net margin at 9.9% from Q3 2023, even though it's a decline from 16.9% in Q4 2022. As a result of the net income bump up in Q4 2023 and its price decline in the interim, the TTM GAAP P/E is now at 44.2x compared to the 77.8x levels it was at the last I checked. It remains significantly high compared to the other big four stocks by EV market share, though. The story is the same even for its forward ratio as well (see chart below). The multiples look particularly stretched as China's BYD Company (OTCPK:BYDDF) races ahead of Tesla in vehicle deliveries. To be fair, Tesla is a global brand, while BYD is China-focused, so they aren't entirely comparable. But even then, it's worth highlighting here that China is Tesla's second biggest market after the U.S., where it's seeing increased competition. Source: Seeking Alpha Source: Seeking Alpha In a nutshell, the Tesla stock isn't out of the woods yet. Its persisting labor challenges are getting spilling over into geographies outside of Sweden, and closer home, especially after UAW's win with other car companies last year. So far, though, Tesla's numbers are unaffected. Not only did its sales see robust growth as such in 2023, but they also grew at a fast clip in Nordic countries. It managed to arrest the operating margin decline in Q4 2023 as well, and its GAAP net margin showed a bump up, too. However, for the year as a whole, the operating margin declined and the non-GAAP net margin was static. With price wars underway, and China's BYD company taking Tesla's spot in the number of vehicles delivered in 2023, its market multiples still look stretched, though. This is even though they have reduced considerably in the past three months. If Tesla, Inc. can continue to improve its margins in the next quarters and also manage its labor situation well, it may well become a Buy again. But that time isn't now. And things can go either way for it. This chapter in the Tesla story is still ongoing. I'm retaining a Hold rating for Tesla shares. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Manika Premsingh is a macroeconomist converting big-picture trends into actionable investment ideas. She has worked in investment management, stock broking, and investment banking. Manika received the Goldman Sachs 10,000 Women scholarship for certification in business in recognition of her work as an entrepreneur while running her own research firm. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}