{
    "title": "Elon Musk Moves SpaceX's Incorporation Location to Texas After Delaware \nVoided His Tesla Pay Package",
    "date": "2/15/2024",
    "url": "https://www.ntd.com/elon-musk-moves-spacexs-incorporation-location-to-texas-after-delaware-voided-his-tesla-pay-package_973262.html",
    "text": "SpaceX has moved its incorporation location from Delaware to Texas, according to a Texas Secretary of State filing. “SpaceX has moved its state of incorporation from Delaware to Texas!” SpaceX CEO Elon Musk announced on X on Feb. 14. “If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible.” The latest decision by Mr. Musk comes after a Delaware court voided his Tesla pay package late last month in a lawsuit filed by a Tesla shareholder. The package is worth $56 billion in stock options and is considered the world’s biggest pay package for an executive. The move also follows Neuralink, one of Mr. Musk’s companies, switching its registration to Nevada from Delaware. The lawsuit was filed five years ago by Richard Tornetta, a Tesla shareholder, who claimed the pay package was excessive and marred by conflicts of interest and other factors. On Jan. 30, Delaware Chancery Court Judge Kathaleen McCormick wrote in her 200-page ruling that the electric carmaker’s board of directors had failed to prove “that the compensation plan was fair.” Flowing the court’s ruling, Mr. Musk responded to the ruling in a post on X: “Never incorporate your company in the state of Delaware.” Later, he added in another X, “I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters.” Tesla was incorporated in Delaware before Mr. Musk joined the company. Delaware is a common destination for incorporation because of its business-friendly laws and low corporate taxes. Mr. Musk then promised to move Tesla’s registration from Delaware to Texas and hold a shareholder meeting to vote on the relocation. The decision came after 87 percent of X users said “Yes” in a poll when he asked, “Should Tesla change its state of incorporation to Texas, home of its physical headquarters?” Reacting to the poll results, Mr. Musk wrote: “The public vote is unequivocally in favor of Texas! Tesla will move immediately to hold a shareholder vote to transfer state of incorporation to Texas.” It’s unclear whether Mr. Musk plans to appeal the ruling to the Delaware Supreme Court regarding his compensation package. If the ruling remains effective, he will lose stock options, but retain stakes he already owned. Before the court’s ruling, Mr. Musk moved his business incorporation location out of Delaware. After completing the $44 billion buyout of Twitter in 2022, he moved its business incorporation location to Nevada and renamed it X. Following the Delaware court’s ruling, Mr. Musk also moved the business incorporation site of his brain implant company Neuralink from Delaware to Nevada, according to Bloomberg. Neuralink, which has its physical headquarters in Fremont, California, officially became a Nevada company on Feb. 8, according to state records. Delaware records also list the company’s legal home as Nevada. Mr. Musk said last month that Neuralink had implanted a chip in a human patient for the first time, and the “initial results show promising.” Neuralink said it aims to create the world’s first neural implant that will allow users to control a computer or mobile device anywhere they go using their thoughts. Mr. Musk has expressed his desire for his company to assist individuals suffering from severe spinal cord injuries and amyotrophic lateral sclerosis. He believes that brain implants could potentially treat other conditions, such as obesity, autism, depression, and schizophrenia. He is also optimistic about the technology’s potential to enable telepathy and web browsing. Tom Ozimek, Caden Pearson, and the Associated Press contributed to this report. From The Epoch Times "
}