{
    "title": "‘I’m certain people who get this stuff want it for this reason’: Woman \nshares what it’s really like to own a Cybertruck",
    "date": "2/5/2024",
    "url": "https://www.dailydot.com/news/what-its-like-to-own-cybertruck/",
    "text": "Vusal Karim/ShutterStock\n\n\n@thesouthernrealtor/TikTok\n\n(Licensed) Phil West Trending Posted on Feb 5, 2024   Updated on Feb 14, 2024, 12:55 pm CST A woman in Texas who recently purchased a Cybertruck from Tesla says it’s become an attention-getting curiosity in the short time she’s owned it. Michelle Abner, who uses her TikTok account (@thesouthernrealtor) to highlight her realty business, The Southern Realtor, has given some video real estate to the futuristic Tesla truck she and her husband now own. One video, getting more than 2.9 million views as of Monday, shows her sitting in the truck talking about the experience of owning it and having people gawk at her. “Wanna know what it’s like to have a Cybertruck?” she begins. “Everywhere you go, people want to know about this truck. It’s crazy.” She then congratulates controversial Tesla CEO Elon Musk, saying, “You did good, Elon. You did good.” After that, she notes, “We have been stopped at stoplights already and people want to talk to us about it. The cops want to know about it. We already talked to two different cops in Burleson,” referring to her hometown in the Dallas-Fort Worth Metroplex. “We’re at Lowe’s right now picking up some lumber,” she explains, noting, “It is a truck,” before concluding the video by saying, “People just want to know about this thing.” The truck has received a lot of attention for its unconventional shape and not conforming to long-established expectations of a typical truck performance. A reviewer for Top Gear noted in a Dec. 24 article, “It appears to have been drawn by a six-year-old child who just discovered the joys of a ruler. It refuses to comply with any sort of car design convention and normal development protocols—namely, you don’t usually design a concept car then point at it and say ‘I want that one’ because it causes designers and engineers several years’ worth of migraines, but Elon Musk did.” But the reviewer also noted, “I like how it looks, I really do. It’s mesmerizing. It’s lumpen and fridge-like from some angles, and the panels look rippled in direct sunlight and it’s bloody massive, but you can’t take your eyes of it, and plonked in the real world it makes you smile. Most of all I like that, on supersized US roads at least, it’s just a useful car. The lockable bed cover, the dinky frunk, back seats that flip up to give you another massive six-foot long storage area, all those lovely over-priced accessories …” Despite its fans, others feel it’s worthy of ridicule, and commenters came in to dunk on the TikTok creator. “Wanna know what it’s like to have a cyber truck,” one mocked, using Abner’s own words. “It is a truck.” “I think people are trying to figure out why you got one,” another observed. “So informative,” said another sarcastically. “Glad you shared your story.” Others marveled over the Cybertruck’s weirdness, with one pointing out, “It looks like a Roblox 3D printed car.” Someone else, indicating the video did the opposite of what Abner might have intended, remarked, “You sold me on what car not to get.” One commenter, though, enjoyed the discourse around it, observing, “The comments didn’t disappoint.” The Daily Dot has reached out to Abner via email. Phil West is a veteran professional writer and editor, and the author of two books on soccer, ‘The United States of Soccer,’ and ‘I Believe That We Will Win,’ both from The Overlook Press. His work has appeared most recently in The Striker (where he served as managing editor), MLSSoccer.com, Next City, and Texas Highways. Based in Austin, he is also a lecturer in the Writing Program at the University of Texas at San Antonio. ‘You have got to be kidding me’: Man regrets spending $90K on Tesla after screen breaks 2 weeks in ‘Never use the app if you’re searching for penny deals’: Home Depot customer discovers DeWalt items on sale for 1 cent ‘Just take my word for it’: Server shares why Olive Garden is the worst place to wait tables. And 3 other places to ‘never’ serve at ‘They will pull it from you’: Viewers split when customer shows how to find penny clearance deals at Home Depot "
}