{
    "title": "Tesla to set up in Wolverhampton as plans unveiled",
    "date": "2/19/2024",
    "url": "https://www.birminghammail.co.uk/black-country/tesla-set-up-wolverhampton-plans-28662207",
    "text": "Multinational automotive company's plan to occupy unit in city Get the latest Black Country news straight to your inbox We have more newsletters Get the latest Black Country news straight to your inbox We have more newsletters A multinational automotive and clean energy company that designs and manufactures electric vehicles (EVs), battery storage devices and solar panels, is to set up shop in a Wolverhampton industrial park. EV giant Tesla, which has its headquarters in Austin, Texas, has been given approval to make external alterations to a recently constructed unit in Mammoth Drive at Wolverhampton Science Park, just off Stafford Road, Founded in 2003, the company is set to make a number of alterations to the arrangement of the outside parking area with the installation of a wash bay for cars and a series of EV charging points. In a statement to planners, Kevin Ayrton of ELG Planning, acting on behalf of Tesla, said: \"These changes are required as part of the company’s proposal to occupy the building. Tesla are an innovative industry leader in the development of electric engines, solar and integrated energy solutions, and one of the most valuable companies in the world. \"They are at the cutting edge of the knowledge industry as one of the earliest developers of electric vehicles. Their profile and operation fully complement the technology-focused business park at Wolverhampton Science Park. READ MORE: Call for new hotel to serve hospital and leisure park Get breaking news on BirminghamLive WhatsApp \"A separate application for a Lawful Development Certificate is being made at the same time, to seek formal confirmation that the proposed use of the building by Tesla does not need planning permission for a change of use, as has already been confirmed by the local planning authority as part of pre-application discussions with the landlord. The site is located within a predominantly industrial area and is allocated in the local plan for employment use. \"It was formerly a gas holder station, having remained vacant prior to redevelopment work and the construction of the new units, which started in September 2022. Overall, the package of proposed changes is modest and will have a limited impact, whilst facilitating the occupation of the unit by Tesla,\" added the statement. Planners have granted Tesla approval for ground floor doors and roller shutters on two sides; extract ducting to be added; a 60 sq m vehicle wash bay; alterations to servicing areas to allow for the parking of serviced vehicles and new post and wall-mounted electric vehicle chargers. Senior planning officer Phillip Walker said: \"These proposals will allow for the use of the building and land by Tesla, as a regional hub for customer vehicle servicing. The external changes to the building and layout are acceptable in visual appearance and character terms.\"  "
}