{
    "title": "Tesla: Ignore The Noise And Buy The Dip (NASDAQ:TSLA)",
    "date": "2/8/2024",
    "url": "https://seekingalpha.com/article/4668460-tesla-ignore-the-noise-and-buy-the-dip",
    "text": "Slaven Vlasic  Slaven Vlasic My previous bullish thesis regarding Tesla (NASDAQ:TSLA) kept up well before the disappointing Q4 earnings release. However, at the end of the day, the thesis did not age well compared to the broader U.S. stock market, as the stock lost about 20% of its value since November. In the swiftly changing landscape, I aim to provide readers with an updated perspective on recent developments, shedding light on their impact on valuation and revisiting the risks associated with investing in TSLA. \"The stock witnessed a lackluster beginning to 2024 following an outstanding performance in 2023. The primary setback occurred with the release of disappointing Q4 2023 earnings a couple of weeks ago, coupled with cautious guidance. However, my analysis indicates that the market may have overreacted significantly, as the warning signs appear more likely to be temporary rather than indicative of persistent issues. Furthermore, under a high-conviction base-case scenario, my valuation suggests that the stock is currently undervalued by 19%. I stand by my \"Strong Buy\" rating for TSLA. The company released its latest quarterly earnings on January 24, when TSLA missed consensus estimates. Revenue and adjusted EPS misses were slight in relative terms, though. The top line expanded by 3.5% on a YoY basis, which is a record slow pace after more than a dozen quarters of rapid revenue growth. Despite the revenue growth, the bottom line shrank with an adjusted EPS decrease from $1.19 to $0.71 YoY. Seeking Alpha Seeking Alpha In instances of an unfavorable deviation in a company's financial performance, it becomes imperative to discern the nature of the influencing factors. Identifying whether these factors are secular is a clear red flag for investors. Conversely, if the downturn in financial performance is attributed to cyclical or one-off challenges, it indicates that the hurdles are temporary and a recovery is likely on the horizon. I do not see any secular factors when I look at the below summary from the company's latest earnings presentation. Tesla's latest earnings presentation Tesla's latest earnings presentation Reduced vehicle ASP [average selling price] is an apparent temporary factor to me, caused by discounts on vehicles to address the softening demand due to the cyclicality in the macroeconomy. An increase in investments in artificial intelligence [AI] and R&D looks like an investment in the future to help Tesla remain the technological leader and continue setting trends in the automotive industry. The ramp-up in Cybertruck production represents an investment rather than a mere cost, given that the production volumes for 2024 are already sold out, which is indicative of robust demand for the truck. Furthermore, the dip in Full Self-Driving [FSD] revenue is a one-off occurrence, stemming from the spike observed last year when the feature was initially introduced widely in North America. It's noteworthy that, in my analysis, I haven't identified any concerning secular trends negatively impacting Tesla. On the contrary, I observe favorable secular factors that have played a crucial role in mitigating temporary headwinds for profitability. Notably, the lower cost per vehicle reflects a significant trend, indicating the company's adeptness in absorbing the economies of scale effect and outlining a clear roadmap for achieving greater economic efficiency in production. Looking ahead, it is reasonable to anticipate further reductions in cost per vehicle from a long-term perspective. The growth in vehicle deliveries aligns with the global shift toward electric cars, marking another positive secular trend. Additionally, the increased gross profit in the company's Energy Generation and Storage business signifies a favorable long-term trajectory, showcasing Tesla's success in diversifying its business mix. This diversification is instrumental in smoothing out the cyclicality inherent in the core automotive business. Seeking Alpha Seeking Alpha I have two robust reasons why I am optimistic about the company's continued substantial investments in R&D and the Cybertruck production ramp-up. First, even with the last fiscal year's dip in profitability, Tesla's return on invested capital [ROIC] is still stellar and far above the 8.2% WACC estimated by valueinvesting.io. As I often emphasize, past performance does not guarantee future success; however, investing in the stock market is not about assured returns but rather about assessing probabilities. In this context, the likelihood of ongoing successful investments in growth remains substantial, given the commendable track record of consistently delivering high ROIC. financecharts.com financecharts.com The second reason why I am optimistic about the company's ability to continue generating superior profitability from investments in innovation is the company's financial flexibility, which allows it to keep the cost of capital low. With $29 billion in cash as of the 2023 year-end and almost no debt compared to the market cap, Tesla has a formidable financial position to continue betting big on innovation and production ramp. Seeking Alpha Seeking Alpha Now let me move on to my expectations for 2024. During the latest earnings call, the management warned that the company is unlikely to hit the staggering 38% delivery growth rate in 2024. The substantial disappointment for investors unfolded as the stock price plummeted after the earnings call. However, for investors aiming at success, it is imperative to maintain a reasonable and sound approach. Anticipating a 38-40% growth in 2024 is not sound, considering the prevailing adverse factors such as high interest rates, rising layoffs, and extensive geopolitical uncertainty. The management did not outline a precise delivery target for 2024, unlike it did last year, but according to teslarati.com, analysts expect 2.2 million deliveries in 2024. This implies an approximately 20% YoY growth rate in deliveries, a figure that might seem like a significant decline when contrasted with Tesla's historical growth trajectory. However, evaluating growth rates in comparison to historical benchmarks may be deemed unfair, at least mathematically, since sustaining the same rate becomes unrealistic as comparatives grow. A more meaningful perspective would be to assess how Tesla's projected 20% delivery growth in 2024 aligns with the overall trend in the global EV market. As shown below, the global EV demand also demonstrates a massive growth deceleration after a 2020-2021 spike. ev-volumes.com ev-volumes.com In conclusion, in my analysis of recent developments, I posit that the company's underwhelming performance in Q4 2023 is predominantly attributed to temporary factors rather than persistent secular issues. Conversely, I identify several positive secular indicators: consistent growth in deliveries, an impressive projected growth rate for 2024, and ongoing substantial investments in innovation, including the promising ramp-up of Cybertruck production. Consequently, I encourage readers to look beyond the transient disruptions, emphasizing the importance of not losing sight of the overall positive trajectory amid any short-term noise. Tesla was one of the best-performing S&P 500 stocks in 2023, with a 110% return. Nevertheless, the onset of 2024 marked a challenging period for the company, witnessing a significant downturn with approximately a 25% reduction in its market capitalization since the year's commencement. As previously highlighted, the primary driver behind this decline can be attributed to the lackluster Q4 earnings report, where the softened revenue outlook for FY2024 played a pivotal role in the notable depreciation of the stock price. The table below shows that the current FY2024 revenue forecast is around $8 billion lower than the levels forecasted on November 23. At the same time, I want to emphasize that the estimated consensus long-term revenue CAGR is still above 20% and even slightly higher than before. That said, Wall Street analysts consider revenue challenges short-term and not secular. Author's calculation Author's calculation Let me update my discounted cash flow [DCF] analysis using new underlying assumptions, as the environment has changed since November 2023. Moreover, I will provide readers with the DCF outcomes of the three different revenue growth scenarios. First, let me determine the discount rate in light of the Fed's recent announcement that three rate cuts are expected in 2024. Assuming that rate cats will be steady with a 25 basis points step each time, I decrease my previous 10% WACC assumption to 9.25%. Second, let me move on to the FCF ex-SBC margin projections. Using the 0.43% level demonstrated in FY2023 will be conservative enough for a cautious FY 2024. However, I expect an aggressive 150 basis points expansion for the years beyond because Tesla has a strong track record of profitability expansion as the business ramped up. For my base-case scenario, I use a 15% revenue CAGR for the next decade, which is substantially slower than the growth rate outlined in the above table, meaning the assumption is very conservative. I am also adding up the current $19.5 billion net cash position to the fair value calculation Author's calculations Author's calculations For the base-case scenario, Tesla's fair capitalization is around $710 billion. This is almost 20% higher than the current market cap, indicating a compelling upside potential. It is also crucial to understand that undisputed market leaders like Tesla usually deserve a premium from the market, the extent of which depends on the broader market's sentiment. However, the premium is difficult to assess reliably and to calculate my base-case target price; I will just inflate the current $188 share price by the estimated 19% upside potential, which gives me $224 per share. I will now delve into simulating two additional scenarios— one optimistic and the other pessimistic. In the spirit of fairness, I'll allow for a range of plus-minus three percentage points in the change to revenue CAGR on both ends of the spectrum. I expect all other assumptions to be unchanged for both scenarios. Let me start with the optimistic scenario, i.e., with an 18% revenue CAGR for the next decade. Author's calculations Author's calculations With the optimistic 18% revenue CAGR incorporated, the fair capitalization jumps to almost $900 billion, which means nearly a 48% upside potential. Achieving these levels is not unreal for Tesla, given the fact that its market cap has already surpassed $1 trillion a few times. Adjusting the current $188 share price up by 48% gives the optimistic-case target price of $278. Now, let us move to the pessimistic scenario with a 12% revenue CAGR. Author's calculations Author's calculations As evident from the analysis above, with a 12% revenue CAGR, the stock appears to be slightly overvalued. It's crucial to emphasize that the 5% downside potential is relatively minor, particularly when considering that the projected 12% growth rate is nearly half of the consensus estimates. Consequently, the likelihood of such a scenario is deemed to be very low. I am demonstrating this scenario to demonstrate the margin of safety for investors at current stock price levels. A 5% reduction to the current TSLA price results in a pessimistic-case target price of $178. Here, I'm going to present a concise summary of the scenario table and the corresponding target prices derived from the analysis. Author's calculations Author's calculations From the perspective of the risk, it is important to emphasize that the competition is intensifying fiercely, especially from the Chinese auto giant BYD (OTCPK:BYDDF). BYD has outpaced Tesla for the second year in a row in terms of production volumes, building more than three million cars in 2023. Even Elon Musk has recently acknowledged the strength of Chinese EV makers and warned that they could \"demolish\" global competitors without trade barriers. While I am convinced that BYD cannot compete with Tesla in terms of brand power and technology, I must also highlight where BYD's strengths might make obstacles for Tesla. First, BYD has an extensive model lineup, which helps the company to address various segments. This looks like a solid advantage compared to Tesla, whose narrower model lineup. Second, BYD has a very solid position to conquer the global segment of cheapest EVs with its Seagull and Dolphin models, with prices of $12k and $16k, respectively. To mitigate the competition risk from BYD, I believe Tesla should continue betting on its strengths, which are the technology and the ability to quickly ramp up the production of current models. While I believe that BYD is, at the moment, the major global EV competitor for Tesla, I think it will also be useful for readers to understand the whole competitive EV landscape up to date. As I have mentioned earlier, Tesla delivered 1.81 million vehicles, delivering a 38% YoY growth. Below, I would like to demonstrate how the largest automakers performed in 2023 in terms of EV deliveries. I show the companies that are the greatest threats to Tesla, in my opinion. Apart from BYD, there are several EV companies from China, and Li Auto (LI) demonstrates an impressive growth rate, but its model line does not significantly overlap with TSLA. Geely Group's (OTCPK:GELYF) growth substantially outpaced Tesla's, but the EV scale is almost two times lower. Robust delivery dynamics of iconic German automakers pose a notable threat to Tesla's market share, given their established brands and foothold in the luxury segment. However, despite their strong presence, their EV production scales still lag considerably behind Tesla's. While other automotive manufacturers indeed present a challenge to Tesla, it's important to note that their delivery growth rates are likely to decelerate as EV production volumes increase naturally. Furthermore, examining the provided data, it's evident that despite some reports raising concerns about a potential cooling of the EV market, several automakers exhibit impressive growth rates. This underscores the enduring and robust demand for electric vehicles, indicating a promising near-term outlook for the industry despite an uncertain macro environment. Compiled by the author Compiled by the author Elon Musk is an extraordinary and polarizing figure, serving as both a boon and a significant risk for Tesla. His status as one of the most renowned individuals globally affords Tesla the unique advantage of spending minimal resources on marketing, redirecting those savings toward innovation. However, due to Mr. Musk's wide popularity, Tesla's CEO frequently gets a lot of negative press, which might adversely affect the stock price despite having no real effect on the company's fundamentals. The inherent risk of a seamless link between Tesla's image and Elon Musk poses a challenge beyond management's control. Investors should remain cognizant of this risk and be prepared to endure substantial volatility when provocative and controversial headlines surface in the news. The considerable volatility of Tesla's stock is evident from its wide 52-week price range, spanning from $152 to $300. As such, pinpointing optimal entry points can be challenging. For investors with moderate risk tolerance navigating highly volatile stocks like Tesla, I recommend employing a dollar-cost averaging strategy and maintaining a long-term investment horizon. For investors who are ready to take more risks, strategically increasing exposure to Tesla stock during significant drawdowns can also be a sound approach. For instance, in 2022, the stock experienced a sharp -68% downturn, only to rebound impressively by 110% in 2023. This highlights the potential for substantial gains following periods of market turbulence. Seeking Alpha Seeking Alpha In summary, I'd like for you to look past the market noise, knowing what appears to be an overreaction to the latest earnings release. While deliveries growth is expected to decelerate notably in 2024, this primarily reflects the broader market's slowdown as EV penetration deepens. On the profitability front, the Q4 2023 decline can be attributed to temporary factors and heightened investments in innovation rather than any inherent secular issues. In my view, the valuation presents an attractive proposition with limited downside potential even under a highly pessimistic scenario. To encapsulate, I maintain a \"Strong Buy\" recommendation for Tesla. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSLA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}