{
    "title": "Another Tesla Recall Makes Big News — Yet Its Over-The-Air Fixes Don’t Get \nMuch Love",
    "date": "2/3/2024",
    "url": "https://cleantechnica.com/2024/02/03/another-tesla-recall-makes-big-news-yet-its-over-the-air-fixes-dont-get-much-love/",
    "text": " A new Tesla recall has the media all in a frenzy. “Tesla recalls almost all its vehicles sold in the US over warning light problems.” (The Guardian) “Tesla recalls over 2 million vehicles in US due to font size issue with warning lights.” (USA Today) “Tesla recalls over 2 Million cars For small warning lights.” (Forbes) “Tesla recalling nearly 2.2M vehicles for software update to fix warning lights that are too small.” (WBALTV) The list of media stories decrying the Tesla indicator font size is quite long, and the titles are similar in their emphases: they all call out Tesla, list an enormous amount of total vehicles affected, and zoom in on the word “warning.” Together, these discourse features offer a laser-like focus to only one car company that receives recall notices — one of the top 2 all-electric vehicle manufacturers in the world— and fails to mention other current automobile manufacturers who have National Highway Traffic Safety Administration (NHTSA) sanctions. All media messages are intentional, and negative discourse patterns about Tesla carry with them a whole bunch of persuasive undertones: the company is inherently flawed, it represents a questionable personal investment, and EVs in general may be an unsafe transportation option. These particular Tesla recall headlines miss out on salient facts. Chip in a few dollars a month to help support independent cleantech coverage that helps to accelerate the cleantech revolution! The NHTSA defines a recall as when a manufacturer or NHTSA determines that a vehicle, equipment, car seat, or tire creates an unreasonable safety risk or fails to meet minimum safety standards. Most decisions to conduct a recall and remedy a safety defect are made voluntarily by manufacturers prior to any involvement by NHTSA. Here are the “2023 NHTSA Top 10 Carmakers with Most Vehicles Affected by Recalls.” Honda: 6,334,825\nFord: 6,152,614\nKia America: 3,110,447\nChrysler: 2,732,398\nGeneral Motors: 2,021,033\nNissan North America: 1,804,443\nMercedes-Benz USA: 478,173\nVolkswagen Group of America: 453,763\nBMW of North America: 340,249\nDaimler Trucks North America: 261,959 The New York Times calls the recent Tesla warning light font recall “a setback for the company.” It’s also clear that software issues are frequent obstacles to the transition to transportation electrification for many legacy automakers. In this recent National Highway Traffic Safety Administration (NHTSA) Tesla notification, the focus is on the brake, park, and anti-lock brake warning lights. It seems they have a smaller font size than required by federal safety standards. The decision is that such a small font size can make critical safety information hard to read, increasing the risk of a crash. “A visual warning indicator whose letter font size is smaller than 3.2 mm (1/8 inch), as prescribed in FMVSS Nos. 105 and 135, could reduce the driver’s detection of it when illuminated, increasing the risk of a collision.” Tesla has already started releasing the software update, and owners will be notified by letter starting March 30. Lots of other car owners who have an open recall need to get their vehicle repaired for free at a local dealership. The Times also cited “another hurdle for Tesla:” a separate NHTSA notice that an initial investigation into steering issues “that may have affected 334,000 Tesla vehicles was escalated to an engineering analysis.” Steering worthiness is no small issue. Steering allows humans to remain in control under infinite driving scenarios. When 2,000 complaints about loss of steering control in the 2023 Model Y and Model 3 vehicles were received, NHTSA, of course, should investigate. “A portion of drivers described their steering begin to feel ‘notchy’ or ‘clicky’ either prior to or just after the incident,” the agency said. More than 50 vehicles were towed from places including driveways, parking lots, roadsides, and intersections as a result of driver unease due to alleged steering-related issues. A majority of people who complained about this issue reported seeing a warning message, “Steering assist reduced.” How is this issue being addressed? You guessed it. Tesla is releasing a software update that will fix the issue free of charge, the safety administration said. The models affected include the 2012 to 2023 Model S, the 2016 to 2024 Model X, the 2017 to 2023 Model 3, 2019 to 2024 Model Y, and 2024 Cybertruck vehicles. In December, 2023, Tesla said it would update the software for its Autopilot system in some 2 million cars in the US to fix issues that NHTSA claimed were unsafe. In a statement, the agency said Tesla had done too little to ensure that drivers pay attention to the road while its Autopilot driver assistance system is activated. When the Chinese government announced last month that Tesla would recall nearly all the 1.6 million cars it had sold in the country to adjust their assisted-driving systems, many wondered if Tesla could continue to compete with Chinese manufacturers in the global EV sector. China is one of the world’s largest and fastest-growing markets for EVs. Because OTA updates are not yet standard on all vehicles, they are often misunderstood by the public, and those public misconceptions are frequently fed by media stories that imply distrust of EVs in general and Tesla in particular. What’s missing and rather significant is that remote management of such electronic fixes brings high economic benefits to both companies and their customers. OTA updates provide a convenient and efficient way to deliver bug fixes, security patches, feature enhancements, and other software improvements to many devices without physical access. Cornell University experts note that OTA software updates are becoming essential for electric/electronic vehicle architectures in order to reduce traditional take-it-to-the-dealer recalls amid increasing software bugs and vulnerabilities. By wirelessly transmitting the updated software to the target devices, OTA updates enable seamless and on-demand software maintenance and ensure that devices run the latest and most secure software versions. As explained in a 2023 SAE article, vertically integrated solutions also enable the identification and correction of software and calibration defects for the entire vehicle life cycle through OTA software update packages. Connected services are essential for not only the future of ADAS but also for the creation of a safer driving environment for all: “This eliminates the need for costly and time-consuming dealer visits and allows troubleshooting, updates, repairs, and recalibration to be performed remotely. There are industry-wide benefits of deep connectivity as well, such as the sharing of critical and safety-related data to make functional enhancements and use in the creation of a real-world safety rating system instead of one based on lab data and general speculation.” Next generation software will likely interconnect even more devices within vehicles in upcoming years, so efficient architecture supporting advanced functionalities or features becomes essential. And OTA updates will need evaluation metrics for vehicular software models, vehicle computing units, communication distances, and vehicle cluster sizes.  Graphic provided by GAO Curious if your vehicle in the US has a recall? Do a VIN check and find out. Carolyn Fortuna, PhD, is a writer, researcher, and educator with a lifelong dedication to ecojustice. Carolyn has won awards from the Anti-Defamation League, The International Literacy Association, and The Leavey Foundation. Carolyn is a small-time investor in Tesla and an owner of a 2022 Tesla Model Y as well as a 2017 Chevy Bolt. Please follow Carolyn on Substack: https://carolynfortuna.substack.com/. Carolyn Fortuna has 1266 posts and counting.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\tSee all posts by Carolyn Fortuna "
}