{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.thecourier.co.uk/fp/business-environment/business/4900047/fife-battery-farm/",
    "text": "The Pitkevy site will take capacity from the National Grid and be able to redistribute it depending on demand. Construction of a £70 million Fife battery farm which stores electricity from the National Grid is under way. The Tag Energy battery, in Pitkevy, Leslie, was granted planning permission by Fife Council at the end of January. Energy will be redirected to the massive power bank from the grid when demand is low. Then, when demand for electricity increases, the battery will be able to put the stored power back in, via the substation in Glenrothes. It is the sixth project of its kind in the UK. Construction has commenced and the energy park is scheduled to be operational at the end of this year. Energy giant Tesla will supply the Megapack 2XL battery system on-site, which will be constructed by Glasgow-based construction firm RJ McLeod. Storage is part of the Scottish Government’s renewables programme. Energy storage technologies can “counteract intermittency” linked with certain energy supplies. It also can ensure excess power is not lost at times of high production and can provide energy on demand off-grid in a variety of ways. If Scotland wishes to become an energy exporter, generating 100% of its energy from renewables, then sites like the one in Fife will need to become more common place, the government adds. The project was financed under a non-recourse green loan package of up to £70m, provided by lenders Santander, Rabobank, and Triple Point on a fully merchant basis (except for Capacity Market revenues). The package, originally secured to finance the construction and operation of Tag Energy’s Lakeside BESS project in October 2023, included an uncommitted accordion facility, enabling TagEnergy to incorporate Pitkevy into the funding structure. Franck Woitiez, chief executive of Tag Energy said : “We are proud to leverage this landmark debt package — secured without a revenue floor under our innovative financing model — to bring another facility to life as we work to add stability to the grid and accelerate the energy transition towards net zero. “Equally, we are pleased to be working with our trusted group of partners, from funding through to operations, to deliver the Pitkevy facility that takes TagEnergy’s secured portfolio to 320MW as we expand our footprint in the UK for the benefit of people and the planet.” Exclusive to our subscribers \n\n\n\n\nDundee city centre retail unit which was empty for over seven years …\nDundee city centre retail unit which was empty for over seven years owned by council\n\n\n4\n\n\n\n\n\n\n\n\n\n\nReturn to the old railway stations of Dundee and Fife in our picture…\nReturn to the old railway stations of Dundee and Fife in our picture special\n\n\n7\n\n\n\n\n\n\n\n\n\n\nSlessor Gardens: Does Dundee City Council make any money from Waterf…\nSlessor Gardens: Does Dundee City Council make any money from Waterfront events?\n\n\n10\n\n\n\n\n\n\n\n\n\n\nFilm star Ewan McGregor thanks Perth window firm as he renovates Car…\nFilm star Ewan McGregor thanks Perth window firm as he renovates Carse of Gowrie mansion\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn pictures: Travel back in time and catch the last train to Forfar\nIn pictures: Travel back in time and catch the last train to Forfar\n\n\n\n\n\n\n\n\n\n\n\n\n\nDundee were the kings of Scotland when it came to the Tennent's…\nDundee were the kings of Scotland when it came to the Tennent's Sixes © DC Thomson Co Ltd 2024. All Rights Reserved. "
}