{
    "title": "California bakery business triples after Tesla mishap",
    "date": "2/29/2024",
    "url": "https://www.foxbusiness.com/lifestyle/california-bakery-business-triples-after-tesla-mishap",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Check out what's clicking on FoxBusiness.com The Giving Pies, a small Black-owned business in California, saw its business triple overnight after word spread on social media that it lost out on thousands of dollars from a canceled Tesla order. Even though Elon Musk's company reimbursed the shop for expenses it lost after Tesla placed an order for 2,000 mini pies to the tune of $6,000 in early February, business is still booming. Owner Voahangy Rasetarinera told FOX Business that her shop, situated off the beaten path in San Jose, typically saw 30 to 40 people a day. Now, after her issue with Tesla went public, there are upward of 200 people that are stopping by on a daily basis to show their support. \"We're not in a very busy street, so if people come it's because they want pie,\" she said. ELON'S EXODUS: TRACKING MUSK'S BUSINESS INCORPORATION STATE CHANGES On Friday alone, she recalled selling over 1,000 pies, which is well more than normal for the small business. \"It was crazy,\" Rasetarinera said. Voahangy Rasetarinera, the owner of the Giving Pies shop in San Jose, California. (Charisse Lain ) \"I get messages from all over the world, I get some, people donating to me like 5 euros from Denmark… 15 euros from Sweden… it's crazy,\" she said. This wasn't what she had expected to happen, but she recognized that things might not have gone this way if it was another company she had an issue with. TESLA TO TEXAS? ELON MUSK ANNOUNCES MAJOR SHAREHOLDER VOTE \"If I had that problem with another company and would not have blown up this way,\" she said. \"Tesla is associated in people's mind with Elon Musk. And you either love him or hate him… so when people saw that it was Tesla, I think it stirred strong emotions.\" The mayor of San Jose, Matt Mahan, showed up in support, as well as some Tesla employees, who came to apologize in person for the mishap stemming from Valentine's Day. On Feb. 14, Rasetarinera got a call from the company requesting 2,000 mini pies for an event the following week. After the company had approved her quote, she sent over an invoice that same day, and her staff of five got to work. She was told that a third party vendor, City Flavor, was going to be sending her the payment. Rasetarinera proceeded to buy the materials and started the order, which she described as very labor-intensive given that it's all made by hand. A day later, and still with no payment, Rasetarinera got another call from the company, asking them to double the order. They apologized for the delay in the payment from the vendor and assured her that payment was not going to be an issue. FOX Business reached out to City Flavor and Tesla for comment. The Giving Pies shop filled with customers after a payment issue with Tesla. (Voahangy Rasetarinera) After speaking with her staff, they agreed to take on the order and were planning on working through the long weekend to make it happen. On Friday, Rasetarinera sent another invoice and asked for payment by noon that day given that she doesn't have \"infinite resources.\" Afterward, she received a text from Tesla that they no longer needed the order after spending thousands in material costs and labor to get the order done in time. GET FOX BUSINESS ON THE GO BY CLICKING HERE She was dumbfounded and immediately called back,. \"I thought if she hears my voice, maybe she'll do something,\" Rasetarinera said. She wanted the company, if anything, to reimburse her for the $2,000 she invested. When that didn't come, she turned to Facebook to tell her story, which subsequently went viral and even caught the attention of Musk. \"To fulfill the order, I had turned down other Black History Month catering inquiries, purchased supplies, and prepared for a demanding production schedule,\" she wrote. \"This abrupt reversal left me reeling, realizing the extent of the impact on my small business. I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry.\" After Musk got word of the ordeal, he posted on X that he would \"make things good with the bakery.\" \"People should always count on Tesla trying its best,\" he added. Rasetarinera said while she never spoke with Musk, she received a payment of $2,000 on Tuesday, roughly two weeks after this started. The added business and support feels good, but she admitted that not everyone has been so supportive. In fact, some people have claimed she was \"playing the race card.\" She never intended to stir up so much attention. In fact, Rasetarinera said she simply wanted to share her story and \"move on.\" Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}