{
    "title": "Tesla-beating BYD unveils $230,000 supercar and $14,000 hatchback in same \nweek",
    "date": "2/25/2024",
    "url": "https://finance.yahoo.com/news/tesla-beating-byd-unveils-230-210648200.html",
    "text": "BYD, the Chinese carmaker that recently overtook Elon Musk’s Tesla in global sales of electric vehicles, has struck fear into legacy automakers. That’s primarily because of its low production costs and inexpensive vehicles, which has the likes of Ford and Stellantis scrambling to become more competitive on price. But BYD, backed by Warren Buffett’s Berkshire Hathaway, is more versatile than many might realize. The carmaker produces not only ultra-affordable vehicles, but also models all along the price spectrum. That includes luxury models, such as those under its Yangwang brand. This weekend, BYD officially launched the Yangwang U9, a high-end electric sports car designed to rival Ferrari and Lamborghini. The vehicle—priced at 1.68 million yuan ($233,450)—can reach 100 km/h (62 mph) in 2.36 seconds and reach a top speed of 309.19 km/h, the company said. It can also spin in place and enter dance mode, as videos posted on social media showed. BYD officially launched its pure electric flagship sports car, the YANGWANG U9, today. Its air suspension system offers a wide range of dance modes, while the adoption of four electric motors allows it to spin in place. pic.twitter.com/IHhhTKDCSW — Yan Chang (@cyfoxcat) February 25, 2024 The car will be available only in China for now, though traders taking advantage of a loophole have been selling luxury Chinese EVs to overseas customers who view them as status symbols—even in markets where they’re not yet officially available. On the other end of the spectrum, BYD unveiled this week a lower-priced version of its popular Dolphin hatchback. In 2023, BYD sold 367,419 Dolphin models, up 79% from the previous year. The new version’s starting price is $13,865. Of course, BYD needs to do more than produce a wide range of vehicle types to survive. It faces price wars, a saturated market, and slower EV growth within China. And as it expands internationally, the host of challenges includes trade barriers, regulatory hurdles, and customers’ loyalty to legacy automakers. While it's working to establish manufacturing in places including Hungary, Thailand, and possibly Mexico—which thanks to a free-trade agreement could serve as a back door to the U.S., much to the alarm of trade groups and lawmakers—in doing so it might encounter labor and supply-chain challenges that are less of an issue in China. But Musk, who laughed at BYD’s vehicles in 2011, admitted last year that “their cars are highly competitive these days.” And last month, he said of Chinese automakers in general, “If there are no trade barriers established, they will pretty much demolish most other car companies in the world.” The late Charlie Munger—Buffett’s right-hand man—led the decision for Berkshire to invest in BYD. He then watched the value of Berkshire’s 2008 investment in the carmaker surge from $230 million to $9.5 billion 14 years later. Munger attributed much of BYD’s success to founder and chairman Wang Chuanfu, whom he described as a “combination of Thomas Edison and Jack Welch,” marveling that he could “look at somebody’s part in the morning…and in the afternoon he could make it.” “He is a natural engineer and a get-it-done-type production executive,” Munger added, “and that’s a big talent to have in one place.” This story was originally featured on Fortune.com Related Quotes "
}