{
    "title": "Tesla to open US battery plant with equipment from China's CATL",
    "date": "2/1/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/tesla-open-us-battery-plant-equipment-chinas-catl",
    "text": "TESLA will expand battery production in Nevada, opening a small facility using idle equipment from China’s Contemporary Amperex Technology (CATL), according to sources familiar with the matter. The automaker plans to buy machinery from CATL, as the battery maker is known, and install it in the city of Sparks, said the sources, who asked not to be identified. Tesla will have full control of the facility and cover 100 per cent of the costs, and CATL personnel will be uninvolved other than helping to set up the equipment, they said. The plant, which will make cells for Tesla’s large-battery Megapack product, is part of a broader effort to onshore the supply chain for lithium-iron-phosphate cells in America, according to one of the sources. Tesla also sees the equipment-purchase arrangement as a cost-effective way to set up new facilities, the source said. The move comes amid heightened scrutiny by United States lawmakers and the Biden administration of technology collaboration with China in a number of fields, including production of batteries. Tesla’s purchase may sidestep criticism about US companies’ dependence on Chinese partnerships because of CATL’s minimal involvement. Tesla did not respond to a request for comment. CATL also did not immediately respond to a request sent outside business hours in China. Alongside the plans for the new facility, Tesla has said it intends to double capacity this year at an existing battery factory in Lathrop, California. The efforts support chief executive officer Elon Musk’s assertion during a conference call last week that Tesla’s energy-storage operations would grow faster than its electric car business this year. Megapack is the company’s battery intended for utilities. Start and end each day with the latest news stories and analyses delivered straight to your inbox. CATL, the world’s biggest maker of electric vehicle batteries, dominates the market for so-called LFP batteries, which are cheaper and more stable than nickel-based alternatives. China’s electrified car market is projected to slow for a second year in 2024 as the nation’s patchy economic recovery from the pandemic weighs on consumer sentiment. Tesla’s arrangement appears to be a departure from CATL’s deal with Ford Motor, which aims to license the Chinese company’s technology to build batteries at a Michigan plant owned by the automaker. That project has attracted scrutiny and criticism from Republican lawmakers, who argue the company is influenced by the Chinese government and could undermine US interests. Tesla’s existing Megapack product already uses CATL cells, and Tesla plans to follow the design of those batteries for the cells built at the new facility. Initially, the plant will have a limited output – around 10 gigawatt hours (GWh) – the sources said, and be expanded if the project goes smoothly and the supply chain can be established. The facility likely will not be operational until 2025. It could eventually account for about 20 per cent of Tesla’s battery production in the region, including the Lathrop location. BLOOMBERG BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}