{
    "title": "Bear of the Day: Hertz (HTZ)",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/bear-day-hertz-htz-090000799.html",
    "text": "Company Overview Zacks Rank #5 (Strong Sell) stock Hertz Global Holdings (HTZ) is a multinational company primarily engaged in the car rental industry. As one of the world’s largest car rental providers, Hertz operates in over 150 countries, offering rental services for a wide range of vehicles, including cars, trucks, and SUVs. The company caters to both leisure and business travelers, providing short-term and long-term rental solutions. In addition to car rentals, Hertz has expanded its services to include equipment rental and fleet management solutions. Hertz is known for its extensive fleet of vehicles and a global network of rental locations, making it a prominent player in the transportation sector. Poor Fleet Allocation Recently, Hertz announced it would cut its Tesla (TSLA) EV fleet by 20,000 vehicles, or roughly 33%. Surprisingly, Hertz could not turn a profit renting out the wildly popular TSLA EVs. The failed EV fleet acquisition underscores car rental industry issues, including, poor visibility, weak economics, and tight margins. Earnings Growth is Moving in the Wrong Direction In bull markets (and any market for that matter), investors gravitate towards companies with strong and positive earnings growth. Unfortunately for Hertz investors, HTZ EPS has been declining for several quarters. Image Source: Zacks Investment Research To make matters worse, Zacks Consensus Estimates suggest -184.62% earnings growth for the current quarter and -24% for full-year 2024. Image Source: Zacks Investment Research Industry Disruption Blockbuster Video’s management team famously scoffed at the idea of sending DVDs in the mail (and later streaming) and refused to acquire Netflix (NFLX). The rest is history – Blockbuster went bust, and NFLX went on to have a meteoric rise and become a Wall Street darling. Unfortunately for Hertz, innovation is beginning to disrupt the industry. Turo is a peer-to-peer car-sharing platform that allows individuals to rent out their personal vehicles to others. The platform connects car owners with people in need of short-term rentals, providing a diverse selection of cars to choose from. Turo offers an alternative to traditional car rental services, allowing for a more varied and unique selection of vehicles. Both car owners and renters can benefit from the flexibility and convenience provided by Turo’s platform, often offering users a more personalized and local experience. I like to think of it as Airbnb (ABNB), but for cars. While Turo may not be in a position to put HTZ out of business, the platform is beginning to disrupt the industry and acts as a negative tailwind. Relative Weakness Hertz price action matches its sinking fundamental picture. While most stocks uptrend and soar to new heights, HTZ shares are stuck in the mud. Investors should avoid relatively weak stocks such as HTZ. Image Source: Zacks Investment Research Bottom Line Hertz is struggling from poor economics, industry disruption, and low visibility. Avoid laggards such as HTZ. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Hertz Global Holdings, Inc. (HTZ) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}