{
    "title": "Business booms at San Jose pie shop after Tesla backs out of large order",
    "date": "2/22/2024",
    "url": "https://www.ktvu.com/news/business-booms-at-san-jose-pie-shop-after-tesla-backed-out-of-large-order",
    "text": "Share The owner of a San Jose dessert store says Tesla ordered thousands of pies and then backed out of the deal. After posting about it on social media, she now says the community and people from across the country are stepping up to support the business. SAN JOSE, Calif. - The owner of a San Jose dessert store says Tesla ordered thousands of pies and then backed out of the deal. After posting about it on social media, she now says the community and people from across the country are stepping up to support the business. The Giving Pies is a Black-owned small business, and the owner says giving back to her community has always been a part of her business plan. Now, after her story has gone viral, other businesses and the community are giving back to her. \"Being in a small business myself, it really kind of hit close to home,\" said Eric Yokota, who owns Yokota DDS, MSD in San Jose. Yokota says he owns a business near The Giving Pies, and like so many others, he wanted to help. Owner Voahanguy Rasetarinera posted this message on social media saying Tesla contacted her to order 2,000 of these pies for about $6,000. \"When she asked for a quote, she said that it was approved, and she is excited to work with me. I was like ‘Yes, I got it!’ Two thousand pies is crazy, but yes, I was so excited!\" said Rasetarinera. But the message went on to say her excitement soon turned to disappointment. She says Tesla even asked to double their order and after submitting a new invoice, she never received the payment. Anytime, anywhere. Only with FOX LOCAL — download today and install using Roku, Amazon Fire, Apple TV, Google Android TV, and Vizio televisions. You can also stream KTVU on Samsung TV sets. \"They said, ‘Well, sorry. There’s been a big miscommunication, and they said she had no authority to promise any payments,\" said Rasetarinera. Rasetarinera says after her story went viral, Tesla offered to buy the pies and a tour of their factory. She says she still hasn’t received a payment, so she’s focusing on other customers like the San Jose Sharks, who spent $500 on pies after hearing her story. \"We are the brand of San Jose of the city of San Jose and the San Jose area. We take that very seriously and when somebody is in need, we want to be able to jump in and support that,\" said Chris Shay, San Jose Sharks CEO of Government Affairs. Related An event organized by Oakland A's fans group was in trouble after Drake's Brewing pulled its sponsorship days before the event, but other Bay Area breweries stepped in with support. \"I was thinking, Tesla, they don’t need extra money. So, I thought I’d help out a small business and get some pie,\" said Victor Lam, San Jose, who saw the story on Reddit. Raseterinera says since she made that post, she’s been selling out of pies every day and even getting requests from across the country. KTVU reached out to Tesla for comment and is awaiting comment. Breaking news delivered fast By clicking Sign Up, I confirmthat I have read and agreeto the Privacy Policy and Terms of Service.  This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX Television Stations "
}