{
    "title": "1 Unstoppable Multibagger Up 950% in the Last Decade That Is Secretly \nPowering the \"Magnificent Seven\"",
    "date": "2/28/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA/pressreleases/24399875/1-unstoppable-multibagger-up-950-in-the-last-decade-that-is-secretly-powering-the-magnificent-seven/",
    "text": "Consisting of Microsoft, Apple, Nvidia, Amazon, Alphabet, Meta Platforms, and Tesla, the \"Magnificent Seven\" may be the most important stocks of this generation. After collectively rising 107% in 2023 -- and another 14% so far in 2024 -- each of these businesses now hold market capitalizations between $600 billion and $3.1 trillion. To put this size in context, these stocks now account for roughly 30% of the S&P 500 index's total market cap of $44.5 trillion. Home to many bleeding-edge technologies in today's world, it is tough to argue that the Magnificent Seven doesn't deserve this massive allocation of funds. However, one company works behind the scenes to keep these juggernauts' operations humming: Netherlands-based ASML(NASDAQ: ASML). Playing a vital role in the semiconductor supply chain, ASML helps enable the Magnificent Seven's most ambitious technological aspirations. Thanks to its unmatched technology, here's how ASML secretly powers the world's most influential companies -- potentially making it a more intriguing investment than its enormous peers. Image source: ASML. ASML maintains a monopoly in the extreme ultraviolet lithography (EUV) market and controls around two-thirds of the more mature deep ultraviolet lithography (DUV) niche. Lithography uses ultraviolet light to draw infinitesimal patterns onto silicon wafers. These wafers are then layered to build semiconductors, which help power smartphones, computers, data centers, cars, and AI language models. Seeing this array of end-product use cases, it isn't surprising that ASML's three largest customers are the semiconductor behemothsTaiwan Semiconductor Manufacturing, Intel, and Samsung Electronics. These companies' products (requiring ASML's lithography) are vital to the innovation machines that comprise the Magnificent Seven. Just how important? Let's consider things through the lens of a snap test. Popularized by Motley Fool's co-founder David Gardner, a \"snap\" test asks us to imagine a world where we snap our fingers and a company's products disappear. In ASML's case, many of today's advanced electronics would be much different or less sophisticated -- at a minimum. At worst, they may be nonexistent. How is this so? First, ASML's largest customer, Taiwan Semiconductor (TSMC), counts Apple as its biggest client. Via this trickle-down effect from ASML to TSMC to Apple, there is no doubt that Apple's consumer electronics would be entirely different without using ASML's lithography. Sans ASML's help, Apple's products might be physically larger, slower, less powerful, and have fewer features. Meanwhile, another of TSMC's largest customers is Nvidia, which relies upon the company to create chips for its graphic processing units (GPUs). These GPUs from Nvidia are then distributed to the rest of the Magnificent Seven, for use in: While it is virtually impossible to imagine the extent to which a world without ASML would change, it is clear that the Magnificent Seven would look dramatically different. Posting a total return above 950% over the last decade, ASML is not only crucial to the world of advanced technology, but also shareholder-friendly. Thanks to its dominant positioning in the lithography industry, ASML maintains an incredible net profit margin of 28%. The company has repurchased 1% of its shares annually since 2014, bolstered by this immense profitability while boosting its dividend payments ninefold.  ASML Shares Outstanding data by YCharts While ASML may not match its 14% annualized revenue growth rate from the last decade over the next 10 years, it grew sales by 30% in 2023 and has clear megatrends working in its favor. Supported by growth drivers in end markets such as the ongoing energy transition, the \"electrification of everything,\" and AI, the semiconductor market should double within 10 years, according to ASML's CEO Peter Wennink. Commanding a lofty price-to-earnings (P/E) ratio of 43 today, the market expects this steady growth to come to fruition, with ASML maintaining its leadership position for many years. Since ASML secretly powers the Magnificent Seven in many ways, yet trades at nearly twice the valuation of the S&P 500's average, dollar-cost-averaging buys would be prudent for investors. Should you invest $1,000 in ASML right now? Before you buy stock in ASML, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and ASML wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Josh Kohn-Lindquist has positions in ASML, Alphabet, Meta Platforms, Nvidia, and Tesla. The Motley Fool has positions in and recommends ASML, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short February 2024 $47 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}