{
    "title": "Death of Tesla employee raises questions about Full Self-Driving mode: \nreport",
    "date": "2/13/2024",
    "url": "https://www.businessinsider.com/tesla-employee-died-full-self-driving-fatal-crash-2024-2",
    "text": "       Hans von Ohain, a Tesla recruiter, died in a car crash on a Colorado mountain road after his Tesla Model 3 veered off the road and barreled into a tree, bursting into flames, according to a new report from The Washington Post. Erik Rossiter, a friend of Ohain's who was in the vehicle at the time of the 2022 crash and survived the incident, told first responders Ohain had been using the \"auto-drive feature on the Tesla\" and the vehicle \"just ran straight off the road,\" the outlet reported. If what Rossiter said is true, the incident — which Tesla has so far refused to acknowledge publicly — would be the first known fatality linked to the car company's Full Self-Driving technology. While Ohain had been intoxicated at the time of the crash, with a blood-alcohol level more than three times the legal limit, investigators found the incident was not a typical drunken-driving crash. Sgt. Robert Madden of Colorado State Patrol told the Post there were no skid marks, which would have indicated the vehicle attempted to brake before impact, but there were \"rolling tire marks,\" meaning power was still being deployed to the wheels after the crash. Madden said that \"given the crash dynamics and how the vehicle drove off the road with no evidence of a sudden maneuver, that fits with the [driver-assistance] feature\" being engaged. Madden also described the subsequent fire, which engulfed the car, as one of the \"most intense\" vehicle fires he had encountered, due largely to the lithium-ion battery cells housed in the undercarriage of the Tesla that Ohain was driving. Related stories Ohain's cause of death was determined to be smoke inhalation and thermal injuries, per the Post, and Madden said he probably would have survived the crash had it not been for the intensity of the flames. Nora Bass, Ohain's widow, told the Post her husband believed in Elon Musk's vision for the future of autonomous vehicles so much that he was willing to tolerate the \"jerky\" experience to help improve Tesla's self-driving technology. But since Tesla has so far been silent about Ohain's death, she told the outlet she felt she and her husband were \"just guinea pigs\" ironing out the kinks in the tech with a false promise of safety. \"Regardless of how drunk Hans was, Musk has claimed that this car can drive itself and is essentially better than a human,\" Bass told the Post. \"We were sold a false sense of security.\" Bass and representatives for Tesla didn't immediately respond to a request for comment from Business Insider. Tesla's disclaimer for its current self-driving technology reads: \"Autopilot, Enhanced Autopilot, and Full Self-Driving Capability are intended for use with a fully attentive driver, who has their hands on the wheel and is prepared to take over at any moment. While these features are designed to become more capable over time, the currently enabled features do not make the vehicle autonomous.\" Tesla's Full Self-Driving capability is still in beta testing. There have been numerous crashes, some fatal, linked to Tesla's Autopilot technology, which is designed for use on highways, though Tesla has not been found responsible for the crashes. But the Full Self-Driving technology — meant to maneuver Tesla vehicles through nearly any scenario — has not been definitively tied to any deaths. The Post reported that a Tesla driver who was behind an eight-car pileup causing multiple injuries on the San Francisco-Oakland Bay Bridge in November 2022 said he was using Full Self-Driving and that Ohain's death could be the first known fatality associated with the technology. Read next Jump to "
}