{
    "title": "Tesla Cybertruck resold for more than twice price",
    "date": "3/1/2024",
    "url": "https://www.businessinsider.com/tesla-cybertruck-auction-resold-double-price-2024-2",
    "text": "       Cybertruck owners have already begun flipping their electric pickup trucks and some have turned a hefty profit. A Foundation series Cybertruck was sold at an auction for $244,500 on Wednesday — over $130,000 more than its sticker price. The vehicle was bought by a Porsche dealer in a wholesale auction on Cox Automotive's Manheim auction platform in Dallas, Texas. It's unclear what the dealership plans to do with the vehicle, and a spokesperson for Porsche of South Orlando declined to comment on the sale. Elon Musk poked fun at Porsche during the Cybertruck's delivery event earlier this year when he showed a video of the Cybertruck appearing to best a Porsche 911 in a race, while also towing a Porsche 911. Related stories John Clay Wolfe, owner and founder of the car-selling site Give Me The Vin, said his company bought the Cybertruck for $200,000 on Monday from a reservation holder and had previously resold a different Cybertruck directly to a dealer for $220,000. Since Tesla started deliveries of the Cybertruck on November 30, Give Me The Vin has received dozens of offers from Cybertruck owners, Wolfe said. But, many prospective sellers have been wary of Tesla's $50,000 resale clause. \"We've had people accept our offer and then just completely flake out,\" Wolfe said. \"They start second-guessing the fine, they worry they might get black-balled by Tesla. There's some real fear there.\" Last year, Tesla added a $50,000 resale fee to its Cybertruck order terms and conditions sheet, but deleted the clause in the sales agreement a few days later. The carmaker later added the clause to the order agreement for reservation-holders looking to buy its Foundation series version of the truck, saying that those who attempted to resell the vehicle within a year of purchase would face a $50,000 penalty or pay \"the value received as consideration for the sale or transfer, whichever is greater.\" Wolfe said he's gotten more reach-outs from Cybertruck owners since pictures from the auction started circulating on social media. Wolfe said his company typically tries to keep its sales relatively private, but decided to post a video from the auction after people began posting screenshots from the auction online. A post shared by The John Clay Wolfe Show (@johnclaywolfeshow) \"At the end of the day, all we did is make his product more desirable and worth more money,\" Wolfe said, adding that GiveMeTheVin was also one of the first to resell the Humer EV and Rolls Royce Spectre when they came out. It's not the first time Tesla owners have attempted to flip their cars. In 2022, some Tesla owners made up to $7,000 reselling their EVs. However, the resale market has been difficult for Tesla owners in recent years due to the company's recent series of price cuts. Do you own a Tesla or have insight to share reach out to the reporter via a non-work email and device at gkay@insider.com Read next Jump to "
}