{
    "title": null,
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/video/tesla-crowdstrike-tilray-brands-trending-215328431.html",
    "text": "Tesla (TSLA) shares are under pressure as a Bloomberg report highlighted slowing electric vehicle demand in North America. Separately, Reuters reported that Tesla is lowering the estimated driving ranges across its EV lineup. The reports have fueled concerns about softening EV demand. CrowdStrike (CRWD) shares rose on Tuesday after Morgan Stanley upgraded the stock to \"Overweight\" on an optimistic demand outlook. Analysts believe the rise of generative AI will benefit the cybersecurity provider amid escalating digital threats. Tilray Brands (TLRY) beat second-quarter revenue estimates in its latest earnings results. However, the company saw sluggish growth in its cannabis business as uncertainty looms around reform in US cannabis regulation. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith. - Let's get to some Trending Tickers now, we're going to start with Tesla here. Now, the stock is slipping in today's trade, Julie. Of course, we're going to put that one in context, it's still up about 100% in the past 12 months. But there were some interesting stories just broadly about the EV market worth paying attention to, one was from Bloomberg today. And listen, we know we've talked a lot about how consumer demand for EVs seems to perhaps be waning a bit, at least in North America what Bloomberg was reporting on, and obviously, there's different reasons for that we've gotten into in terms of price and others. But Bloomberg had on today was noting how the rapid growth of China's EV market is now starting to slow too. The economy over there, we know is shaky, that is impacting no surprise consumer sentiment. So they noted that shipments of battery electric and plug-in hybrid vehicles to dealers expected to increase 25% this year. And that is down from 36% in 2023, and 96% in 2022. So you start thinking about, what does that mean for EV makers now, in terms of sales targets? In terms of for their pricing pressures price wars and profitability? - Right. And this is something also that Elon Musk has talked about slowing growth of sales, although he's talked more about it feels like what's going on here in the US, but obviously China is going to be an issue as well. Now, probably not affecting the stock but also floating around out there today is a story from Reuters that the company has lowering, its driving range estimates. Now, Tesla has been under pressure from regulators about the accuracy of its range estimates. And there have been various stories over the years saying that the company is sort of juiced those estimates or has not been entirely honest about the estimates. So basically, Reuters went and looked at their estimates then and now and found that they had in fact, brought some of them down. So is that affecting the stock? Probably not, right. So there's some crosscurrents going on, obviously a lot of folks are looking at it on the Trending Ticker page and trying to figure out going into this year, is Tesla one I want to be in? And today, they don't want. More people don't want to be in it than want to be in it, or at a lower price. - Although we know what a run. And interesting when were talking about that market too because just to bring back to China, we talked so much about the competition for Tesla including, of course, BYD. - Yes, indeed. All right, let's look at CrowdStrike also. Those shares are trending and they are jumping up 5%. Morgan Stanley upgrading the stock to overweight from equal weight. Analysts there say they see an improving demand outlook for the cybersecurity technology company. Guess what? They think Generative AI is going to be good for CrowdStrike as well, and that there are going to be more cyber attacks and that will help CrowdStrike here. Basically, the analysts saying it's going to be a lead beneficiary of the rising threat environment. That was a quote from that Morgan Stanley analyst. - Yeah, their target goes to 304. They also-- as you point out, certainly one bullet here, they think it can leverage and importantly monetize Generative AI. They also note the stock has already-- we should point out, it is ripped higher here, Julie. I mean, Morgan Stanley's coming in, this thing is up 185% in the past 12 months. But obviously, Morgan Stanley's telling clients, listen, they think it goes higher. In fact, how many bulls on the street? Pretty much everyone, Julie, to holds, to sell-- to sells, to holds, 46 buys. So Morgan Stanley has plenty of company when it comes to CrowdsStrike. - I mean, it definitely feels like there's a lot of cybersecurity optimism broadly, right? And there are a lot of names in the industry for people to choose from, to your point, I'm going to have to. You know, what I'm going to do, I'm going to have to look at a head-to-head comparison of CrowdStrike and some of its competitors in terms of analyst bullishness. And who kind of wins in that bullishness. - That's going to be hard to beat for CrowdStrike. That's a lot of fans. - I mean, 92%. That's a pretty high percentage. - All right, we're going to end it up here with Tilray. Let's check those shares, falling in today's trade. That's despite reporting a narrowing loss and clocking in record revenue. The company however is still facing pressures from challenges in the cannabis market will be hearing from Irwin Simon, that's Tilray's CEO at 4:00 PM Eastern. So this one's interesting. So Tilray reporting results here. It looks like revenue just beat narrower than expected adjusted loss, adjusted gross margin for cannabis 35%, and that was 43% in the year ago period. They did reiterate, though 2024 guidance. The alcohol business, though, climbed 117% to 47 million, Julie. And of course, you know, Tilray acquired those beer brands from Anheuser-Busch last summer. And one big question for investors on this one is US health officials kind of recommending easing restrictions on marijuana, maybe reclassifying marijuana as a schedule III drug, that is a big open question for Tilray investors. How that plays out there? - Right. It seems like the Tilray would be poised to sell medical cannabis in the United States, but it doesn't necessarily look like they would get into the recreational business in the US. Right now, they operate in Canada in the recreational market. That 114% number sounds good, but to your point, it's because they bought a bunch of stuff. But this has been part of Irwin Simon's strategy that the firm has been to build up its non-cannabis businesses, including an alcohol and including in cannabis-infused drinks as well. I've been trying to look through the numbers here and try and figure out what happened with the stock because initially it was indeed rising. On the conference call is when the company gave that reiterated guidance for the full year, maybe that's an area that investors didn't love here, but still trying to dig into and figure out exactly what's going on, and that's something we're going to ask Irwin about as well. - Yeah. You know what else I'm going to ask him about? Vegetables. - Right. They sell vegetables. - They growing vegetables in Quebec. I'm going to ask Irwin, listen, he's got strawberries, cucumbers, eggplants, apparently maybe some tomatoes. Basically, monetizing some of that unneeded cannabis cultivation space. - Right, exactly. - We have things to talk about. - I don't know what tomato margin looks like versus-- - We ask Irwin, maybe one knows. Related Quotes "
}