{
    "title": "Stocks Mixed; Tesla Dives On Red Sea Attack As Cathie Wood Loads Up On TSLA \nStock",
    "date": "1/12/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-falls-tesla-dives-on-red-sea-attack-as-cathie-wood-piles-up/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     The Dow Jones Industrial Average pared some midday losses in afternoon trades Friday as inflation data came in cooler than expected. The Labor Department said the producer price index for December dropped 0.1%, while economists polled by Econoday expected a 0.2% rise. That is welcome news for investors after Thursday's consumer price index data, which showed a 0.3% rise for last month. Dow Jones stocks traded 0.4% lower in afternoon trades but the index improved from earlier lows. The S&P 500 ventured into positive ground again after falling 0.1% midday on the stock market today. The Nasdaq also eked out a small gain and traded less than 0.1% higher. IBD Leaderboard stock Zscaler (ZS) gained in the tech-heavy Nasdaq index while Tesla (TSLA) weighed it down. MercadoLibre (MELI) broke out from a flat base with a buy point of 1,660. Meanwhile, the small-cap Russell 2000 index succumbed to the larger trends and erased its earlier gains. The index fell 0.3%. Volume on the New York Stock Exchange was lower and unchanged on the Nasdaq compared with the same time on Thursday. Breadth deteriorated at midday and continued to show weakness. Advancers beat decliners by a small margin on the NYSE but lagged decliners on the Nasdaq. The Innovator IBD 50 (FFTY) exchange traded fund pulled back 0.2%. The fund is trying to work its way toward a 24.95 buy point in a cup with handle. West Texas intermediate crude oil bounced 1.8% higher to trade at 73.81 a barrel. And the yield on the benchmark 10-year Treasury note was unchanged at 3.97%. JPMorgan Chase (JPM) rose 0.7% after the brokerage reported earnings, but then it reversed and lost 0.2% as the session advanced. The financial giant's fourth-quarter earnings came in above views but sales fell short. United Health (UNH) fell below the 50-day moving average and triggered a sell signal. The Dow leader beat fourth-quarter estimates but cited higher medical costs as the percentage of premiums spent to cover health care needs increased. Outside the Dow Jones index, Tesla (TSLA) fell further below its 50-day moving average in afternoon trades Friday. The electric-vehicle giant plans on suspending operations in Berlin for two weeks from Jan. 29 to Feb. 11. According to the Wall Street Journal, components needed for manufacturing ran short due to the ongoing attacks on vessels in the Red Sea. Earlier, Cathie Wood's ARK Invest loaded up on Tesla stock on Thursday as it fell below its key moving averages. Delta Air Lines (DAL) was an earnings mover Friday. Shares fell but remain in a handle with an entry at 42.70. The airline operator topped expectations yet gave weak earnings views for the fiscal first quarter. Among other airline stocks, United Airlines (UAL) and American Airlines (AAL) fell in sympathy. Futures Fall; Elon Musk Makes This Tesla Threat Among the big banks, Wells Fargo (WFC) and Bank of America (BAC) fell on earnings news. Citigroup (C) reversed course and rose 1.5%. The stock is trying to break out past a 53.23 entry out of a consolidation. Outside the Dow Jones index, Twilio (TWLO) rose after an upgrade to overweight from analysts at Piper Sandler. The stock also got a new price target of 82, up from 75. Shares are rebounding from the 10-week line and are also near an entry at 78.16. Building maintenance and services stock Rollins (ROL) is trying to break out of a cup with handle with a buy point of 43.91. Shares were flat in recent action. Among software stocks, OpenText (OTEX) is near a buy point of 43.25 but was down in recent action. Further, DoubleVerify (DV) is approaching a handle entry at 38 and also reversed lower in light volume. Please follow VRamakrishnan on X/Twitter for more news on the stock market today. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders MarketSmith: Research, Charts, Data And Coaching All In One Place How To Research Growth Stocks: Why This IBD Tool Simplifies The Search For Top Stocks 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}