{
    "title": "BYD misses estimates, Tesla bosses plan share sales",
    "date": "1/30/2024",
    "url": "https://www.thestandard.com.hk/section-news/section/15/259954/BYD-misses-estimates,-Tesla-bosses-plan-share-sales",
    "text": "BYD (1211) said expects its net profit last year to grow as much as 86.5 percent in 2023 from a year ago, but the earnings fell short of analyst expectations, as demand for battery-powered cars softened late last year. The forecast came amid news that rival Tesla's bosses are gearing to sell shares. The Chinese auto giant said its net profit is projected to range from 29 billion yuan (HK$32 billion) to 31 billion yuan, compared with a full-year net profit of 16.6 billion yuan in 2022. Basic earnings per share for last year are expected to range from 9.98 to 10.67 yuan, it said in a filing. BYD said sales of new energy vehicles hit a record high last year, consolidating its leading position as the top electric automaker in the global market. Despite intensified competition in the industry, BYD said it has reached rapid growth in overseas sales and showed strong cost control capability in the industry chain, which has resulted in an improvement in profitability. Meanwhile, Tesla board chair and a top deputy to chief executive Elon Musk set up share-trading plans late last year allowing them to sell significant sums of stock in the coming months. Chair Robyn Denholm set up an insider share-trading plan in October for the potential sale of up to 281,116 shares, which would be worth U$51.5 million (HK$401.7 million) at Tesla's latest closing price, according to a regulatory filing. Today's Standard Trademark and Copyright Notice: Copyright 2024, The Standard Newspaper Publishing Ltd., and its related entities. All rights reserved.\r\n            Use in whole or part of this site's content is prohibited. Use of this Web site assumes acceptance of the Terms of Use, Privacy Policy Statement\nand Copyright Policy.  Please also read our Ethics Statement. "
}