{
    "title": "Elon Musk's record pay agreement was blocked by a Delaware judge",
    "date": "1/31/2024",
    "url": "https://finimize.com/content/beware-delaware",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest about 2 months ago  •  2 mins What’s going on here? Elon Musk’s $56 billion pay deal was canceled after a lengthy court battle in the state that the Tesla head honcho loves to hate. What does this mean? Elon Musk has many skills, including the ability to convert a legion of young men into loyal fans of oddly shaped trucks through the medium of podcasts. But clearly, winning over a court of law is not one of them. Musk was granted a $56 billion ten-year pay deal back in 2018, the biggest in the history of corporate America. There was just one problem: a disgruntled shareholder, with a whole nine Tesla shares to their name, who argued that investors in the firm weren’t given a big enough heads-up. On Tuesday, a Delaware judge agreed. So even though Musk argued that the money could fund humanity’s move to Mars when the Earth crumbles, the court canceled the record-breaking compensation. Why should I care? Zooming out: A win for one is a win for all. Investors in the US don’t usually kick up a fuss about how much company bosses are paid. Not that it has anything on Musk’s deal, mind you: that $56 billion was six times what 2021’s 200 highest-paid executives made combined. See, big payouts tend to be made in the form of shares or share options, as Musk’s was. That incentivizes big bosses to drum up the share price, which only benefits everyday shareholders too. The bigger picture: “G” for “Greater good”. Media has lit up the “E” in “ESG” with eco-friendly LED lights. But while environmental considerations matter, especially if you’d rather save the planet than follow Musk into infinite space, the social and governance factors tend to be overlooked. Musk’s pay debacle could dust off the governance folder, though: independent committees should ensure that a CEO’s salary lines up with the value they deliver, and this latest ruling could turn that theory into more common practice. elon musk esg options regulation tesla stocks us amazon earnings earnings healthcare Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}