{
    "title": "Elon Musk plans to buy AMD chips as Tesla loads up on AI hardware",
    "date": "1/27/2024",
    "url": "https://www.thehindubusinessline.com/info-tech/elon-musk-plans-to-buy-amd-chips-as-tesla-loads-up-on-ai-hardware/article67782271.ece",
    "text": "Get businessline apps on Connect with us TO ENJOY ADDITIONAL BENEFITS Connect With Us Get BusinessLine apps on By  Bloomberg Comments READ LATER Tesla Inc. Chief Executive Officer Elon Musk said he plans to buy chips from Advanced Micro Devices Inc. as part of a spending spree on computing hardware to handle artificial intelligence. After saying on his X social media platform that Tesla will spend more than $500 million on Nvidia Corp. hardware this year, Musk was asked if he would also buy chips from AMD. “Yes,” the billionaire replied. Nvidia is the current leader in so-called AI accelerators — processors suited to the data-intensive requirements of the technology — but rivals like AMD are pushing into the market. AMD unveiled a lineup called the MI300 last month that it said will be able to run AI software faster than competitors can. AMD shares briefly climbed more than 1% after-hours Friday following the remarks. They had been down earlier in extended trading. Also read: Bhavish Aggarwal’s Krutrim raises $50 mn, becomes India’s first AI unicorn Musk has said that Tesla plans to invest more than $1 billion on an effort called Project Dojo by the end of 2024. Dojo refers to an in-house supercomputer designed to handle massive amounts of data, including video from Tesla cars needed to create autonomous-driving software. The strategy is to use both Nvidia technology and its homegrown efforts. “We’re pursuing the dual path of Nvidia and Dojo,” Musk said during Tesla’s earnings call on Wednesday. “But I would think of Dojo as a long shot. It’s a long shot worth taking because the payoff is potentially very high.” More stories like this are available on bloomberg.com Comments BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Terms & conditions  |  Institutional Subscriber "
}