{
    "title": "Automakers uncertain about EV affordability as demand wanes",
    "date": "2/9/2024",
    "url": "https://finance.yahoo.com/video/automakers-uncertain-ev-affordability-demand-155331810.html",
    "text": "As electric vehicle demand cools, automakers have had mixed reactions in their latest quarterly earnings. While Tesla's (TSLA) Elon Musk believes lowering EV prices would boost consumer appetites, rivals like Ford (F) and General Motors (GM) indicate affordability constraints prevent offering further discounted price tags. Yahoo Finance's Pras Subramanian breaks down the details. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith BRAD SMITH: What an earnings season for car makers. Electric vehicles were the hot topic. Some companies struggled in the space, others claiming victory. Let's listen to what some of the biggest automaker CEOs had to say. MARY BARRA: It's true, the pace of EV growth has slowed, which has created some uncertainty. JIM FARLEY: Now, some have portrayed the change in the EV market as Darwinian. That could be a slow evolutionary change, but we think this has been a seismic change in the last six months of last year. That will rapidly sort out winners and losers in our industry. ELON MUSK: We are focused on exciting new projects that will, I think, ultimately, if we execute on all of these things and it is very hard to do all these things-- not a sure thing-- but I do see a path where Tesla could one day be the most valuable company in the world. BRAD SMITH: Let's bring in Yahoo Finance's very own Pras Subramanian to break down what this means for the future of EVs. Hey, Pras. PRAS SUBRAMANIAN: Hey, Brad. So we showed Jim Farley there. I wrote about this this week about how they sort of pivoted. And I think that's what's happening with in particular the traditional legacy OEMs like GM and Ford is they're pivoting their plans to make them smaller, spend less money, make sure the cars that come out in the future are going to be profitable at least in the near term. Elon Musk, of course, Tesla is sort of-- they're sort of winning in the sense that they actually make money on these EVs. But they're struggling with the fact that how much can we grow in this market? Are we hitting the 10% in this country? That's sort of the barrier and more people don't want to buy them. He thinks it's more of a price issue. We've got to have cheaper EVs to give to the masses. And the legacy OEMs like Farley at Ford and Mary Barra at GM are saying we can't necessarily afford to make cars that cheap. So we'll see. Maybe the gen two cars will be better and from a profitability point of view. SEANA SMITH: And Pras, when it comes to the strategy that we're learning here, at least the companies that are most at risk when it comes to those legacy players out of what we have heard over the last two weeks in those at least short-term plans trying to navigate what is turning out to be an extremely challenging landscape, is there one that maybe is better positioned than the other just in terms of helping to stem some of those losses? PRAS SUBRAMANIAN: I would say there that's-- I would say Ford and GM are in the driver's seat because they have really strong truck businesses and that seems to not be going away. Stellantis will report next week. And they do have the RAM truck franchise, but it's not a big moneymaker as F-150, Silverado, GMC Sierra. So I think if they have kind of a strong truck and SUV business, you can kind of lean on that for a little bit. But wait till oil prices go back high again, then consumers will shift over to cheaper cars. So right now, I would say those guys are in a better spot in America at least because of the fact that the trucks and SUVs. SEANA SMITH: Yeah, giving them the ability to offset some of that weakness. Related Quotes "
}