{
    "title": "Apple Abandons Electric Car Project To Focus On Generative AI - Apple \n(NASDAQ:AAPL), Tesla (NASDAQ:TSLA)",
    "date": "2/27/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37346162/apple-abandons-electric-car-project-to-focus-on-generative-ai",
    "text": "Apple Inc AAPL has been working on an electric vehicle for years. According to a new report Tuesday, it may never arrive. What Happened: Apple has pumped the brakes on its Apple Car ambitions and abandoned its EV development project dubbed Titan, according to Bloomberg. The report indicates that Apple broke the news on Tuesday to nearly 2,000 employees working on the project. Two executives reportedly told staffers that Apple will shift many of the employees designated for EV development to the company’s generative AI division. Layoffs are still expected, but it’s not clear how many workers will be let go. Timelines for the long-awaited electric vehicle from Apple have been pushed back multiple times due to development issues, and Apple has repeatedly made changes to the team’s leadership and strategy. Just last month, Bloomberg reported that Apple pivoted to a less ambitious design for its EV to make the project more attainable. Earlier reports indicated that Apple had tossed out the idea of making a completely driverless car and instead began working on building an EV with more limited features, similar to what Tesla Inc TSLA offers. Now it seems the entire project has been sent to the junkyard. Apple finalized the decision internally among top executives in recent weeks following continued pressure from the company’s board, Bloomberg said, attributing the information to people with knowledge of the matter. Apple was spending hundreds of millions of dollars a year on R&D for the project, and given the recent strategy adjustments to speed up time to market, some of the company’s top executives were concerned about the car’s profit margin potential. Check This Out: Tim Cook’s AI Efforts Have Wedbush’s Dan Ives Excited: ‘We View Apple Like Meta 18 Months Ago’ Why It Matters: The shift from Apple comes as many have raised concerns about the future demand environment for the EV industry. Many of the legacy OEMs have pulled back on electrification efforts and Tesla has been under pressure recently following two straight quarters of disappointing results. On the other hand, AI demand has helped fuel the recent market rally. At the beginning of the month, Deepwater Asset Management's Gene Munster said that many believe Apple is “asleep at the wheel” when it comes to AI, but they are wrong, he said. Munster called Apple one of the most underappreciated AI plays in the market. The tech analyst said he expects Cupertino to release its own AI foundation model sometime in June. AAPL Price Action: Apple shares spiked higher on the Bloomberg report. The stock was up 0.85% at $182.71 at the time of publication, according to Benzinga Pro. Photo: Shutterstock. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}