{
    "title": null,
    "date": "1/29/2024",
    "url": "https://markets.businessinsider.com/news/stocks/elon-musk-tesla-stock-mania-net-worth-wealth-jeff-bezos-2024-1",
    "text": "       Elon Musk's net worth has slumped by $30 billion this year to just under $200 billion as Tesla mania fades. Musk's fortune stands at $199 billion, per the Bloomberg Billionaires Index. That's just $15 billion ahead of Amazon founder Jeff Bezos, with LVMH chief Bernard Arnault at $183 billion, putting his status as the world's wealthiest person under threat. Moreover, Musk is only $71 billion ahead of Warren Buffett ($128 billion), who's ranked ninth on the index. He commanded more than triple the investor's net worth in November 2021, when Tesla stock peaked at over $400 on a split-adjusted basis. The electric-vehicle maker's stock has tumbled by 56% since then to $183, slashing its value from over $1.2 trillion to below $600 billion. Musk owns 411 million shares, or about 13% of Tesla, a stake worth over $100 billion at the start of this year. It's now valued at about $75 billion, reflecting a 26% decline in the stock this year to its lowest levels since May. The entrepreneur's 42% stake in SpaceX accounts for another $74 billion of his fortune, based on the aerospace company's $175 billion valuation in December. Musk also owns other businesses including X, formerly known as Twitter, and The Boring Company. Tesla stock has tumbled this year for a raft of reasons, including the EV maker falling short of Wall Street's fourth-quarter revenue and profit forecasts and issuing a muted growth outlook, and Musk clamoring for more control over the company. Musk also struck a cautious tone on the latest earnings call, flagging the threat posed by Chinese rivals and the pressure of higher interest rates on demand and profit margins. Wedbush analyst Dan Ives bemoaned the \"train wreck of a conference call,\" while Deepwater managing partner Gene Munster said it was \"the most sobering outlook I have seen from Tesla.\" Tesla's rough start to the year is a striking reversal after its stock price more than doubled last year, making it one of the S&P 500's best performers. The other six stocks in the \"Magnificent Seven\" have performed much better than Tesla in 2024, led by Nvidia and Meta, which are up 23% and 11% respectively this year. Musk's automaker has also trailed the broader stock market: the S&P 500 is up about 3% this year and hit a record high of over 4,900 points last week. Its gains have been fueled by slowing inflation, resilient economic growth, and the prospect of the Federal Reserve slashing interest rates this year, which promises to boost corporate earnings and lift the appeal of stocks relative to bonds and savings accounts. The divergence between Tesla and other stocks this year explains why Musk's fortune has shrunk and his lead over the other centibillionaires has narrowed. But it's worth remembering Tesla stock is still up by over 500% since the start of 2020, making Musk one of the biggest wealth gainers in recent years. Amazon is up 6% this year, and 58% over the past 12 months, leaving Bezos' company worth $1.64 trillion, or close to three times Tesla's value. Read next Indices Commodities Currencies Stocks Jump to "
}