{
    "title": "Elon Musk had a very strange conference call with Wall Street back in 2018, \nblasted analysts for asking 'boring ...",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/news/elon-musk-had-very-strange-110000585.html",
    "text": "Elon Musk is known for his quirky and controversial behavior. Whether it’s challenging other billionaires to cage matches or boosting conspiracy theories on his social network X, the co-founder and CEO of Tesla (TSLA) isn’t your typical business leader. So it might not be surprising that Musk once berated Wall Street analysts asking questions about his company during a conference call. The call was focused on Tesla’s performance during the first quarter of 2018. Commercial real estate has outperformed the S&P 500 over 25 years. Here's how to diversify your portfolio without the headache of being a landlord Take control of your finances in 2024: 5 money moves to start the new year off strong The US dollar has lost 87% of its purchasing power since 1971 — invest in this stable asset before you lose your retirement fund Sanford Bernstein’s Toni Sacconaghi wanted to know about the company’s capital requirements. “Boring, bonehead questions are not cool. Next?” Musk responded, cutting him off. Another analyst, RBC’s Joseph Spak, wanted to know why the Model 3 had a slower-than-anticipated rollout during the quarter. He was also cut off. “These questions are so dry. They’re killing me,” Musk said in response to Spak’s question. Morgan Stanley’s Adam Jonas described the conference call as “the most unusual call I have experienced in 20 years on the sell-side.” Musk’s behavior didn’t do much to placate growing concerns about Tesla’s future at the time. The company had reported a $700 million loss in the previous quarter and analysts were worried about the firm’s cash flow and debt burden. Meanwhile, its stock price was volatile and the company’s rollout of its latest model had been delayed. Read more: Find out how to save up to $820 annually on car insurance and get the best rates possible Turns out these concerns were justified. Musk admitted in 2020 over Twitter that ramping up production of the Model 3 was “production & logistics hell” and “extreme stress & pain for a long time — from mid 2017 to mid 2019.” He said the company was about a month away from bankruptcy at one point. Musk also apologized to the analysts during the following earning's call. He said, “Obviously I think there’s really no excuse for bad manners and I was violating my own rule in that regard. There are reasons for it, I got no sleep, 120 hour weeks, but nonetheless, there is still no excuse, so my apologies for not being polite on the prior call.\" Fortunately, bankruptcy was avoided and Tesla grew rapidly in the years that followed. The stock is up 1,065% since that bizarre May 2018 conference call. Tesla is now one of the 10 largest companies on the S&P 500 with a market cap of over $743 billion. It’s also profitable, reporting $1.9 billion in net income on $23.4 billion in revenue during the third quarter of 2023. Tesla’s sudden turnaround not only shocked Wall Street but also Musk himself. “I didn’t expect the stock to rise so much so soon,” he said in a tweet in November 2020. Retail investors can probably take away a few lessons from this ordeal. The future is unpredictable, even for professional analysts and investors. To make good decisions, investors should tune out the noise from all the headlines they read. Instead, focusing on the long term and independent research and forecasts are probably better. The same goes for market sentiment. In fact, legendary investor Warren Buffett prefers a contrarian approach. “Be fearful when others are greedy and greedy when others are fearful,” he once said. Tesla investors who ignored all the fear surrounding the company’s prospects in 2018 are probably sitting on sizable profits right now. This Pennsylvania trio bought a $100K abandoned school and turned it into a 31-unit apartment building — how to invest in real estate without all the heavy lifting Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2024 Rising prices are throwing off Americans' retirement plans — here’s how to get your savings back on track This article provides information only and should not be construed as advice. It is provided without warranty of any kind. Related Quotes "
}