{
    "title": "Tesla Recalls Nearly 200K Vehicles To Fix Rearview Issue Amid Earnings Dip \nAnd Elon Musk's Wealth Decline",
    "date": "1/26/2024",
    "url": "https://www.tradingview.com/news/benzinga:a8c780f70094b:0-tesla-recalls-nearly-200k-vehicles-to-fix-rearview-issue-amid-earnings-dip-and-elon-musk-s-wealth-decline/",
    "text": "Tesla, Inc. TSLA is recalling 199,575 units of Model S, X, and Y vehicles in the U.S. as software instability may prevent the rearview camera image from displaying, according to a National Highway Traffic Safety Administration (NHTSA) document. Per NHTSA, a rearview image that does not display while in reverse decreases the driver’s visibility and increases the risk of a crash. The recall covers certain 2023 Y, S, and X model vehicles. All of these vehicles are equipped with “Full Self-Driving” computer 4.0 and run software version 2023.44.30 through 2023.44.30.6 or 2023.44.100. As a remedy to the recall, Tesla has released an over-the-air (OTA) software update, free of charge. Owner notification letters are expected to be mailed March 22, 2024. Earlier this month, Tesla recalled more than 1.6 million vehicles in China due to concerns related to the misuse of autosteer features. This action comes on the heels of a similar recall initiated by the electric vehicle giant in the U.S. last month, affecting over 2 million vehicles equipped with all versions of Autosteer. It has been a rough week for Tesla so far, with the electric vehicle giant falling short of revenues in the fourth-quarter earnings. The revenue of $25.17 billion missed a Street consensus estimate of $25.62 billion, according to data from Benzinga Pro. The earnings report and weak growth forecasts for the coming year played a significant role in the stock’s decline. Tesla’s earnings call was also criticized, with one analyst labeling it a “train wreck.” The decline also impacted CEO Elon Musk’s net worth, sliding by $18 billion or 8.3% to $198 billion by the close of trading on Thursday, marking the first time since late October that the billionaire’s wealth fell below this level, as per Bloomberg’s Billionaire’s Index. Read More: Tesla’s Post-Earnings Plunge Pulls Elon Musk’s Net Worth Below $200B — How Close Is Jeff Bezos To World’s Richest Title Now? Price Action: TSLA shares are trading higher by 1.5% at $185.37 premarket on the last check Friday. Photo via Wikimedia Commons © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}