{
    "title": "Is buying a used Tesla from Hertz a good deal? Here's what to know.",
    "date": "1/15/2024",
    "url": "https://www.marketwatch.com/story/is-buying-a-used-tesla-from-hertz-a-good-deal-heres-what-to-know-75d1e9f7",
    "text": "Hertz Global Holdings Inc. \n        HTZ,\n        -0.13%\n       said Thursday it is selling about 20,000 electric vehicles from its fleet, including many Tesla Model S sedans. The move is aimed at better balancing supply and expected demand for EVs, allowing Hertz to scrap a disproportionate number of lower-margin rentals and reduce damage expenses associated with EVs. It also marks a reversal for Hertz, which in 2021 bet on electric cars with a 100,000-vehicle order from Tesla \n        TSLA,\n        +5.75%.\n       The order propelled Tesla’s valuation above $1 trillion for the first time. But is scooping up one of those EVs from Hertz a good deal for potential car buyers? It depends, experts told MarketWatch. Sean Tucker, senior editor at Kelley Blue Book, looked through the listings for used Tesla vehicles that Hertz had posted and said he has “mixed feelings.” “These are surprisingly reasonable prices for a used EV,” he told MarketWatch. Listings on the Hertz site on Thursday ranged from a 2021 Tesla Model 3 Standard Range Plus Sedan with 31,647 miles on its odometer for $20,125 to a 2022 Tesla Model Y Long Range SUV with 92,789 miles for $40,886. Some industry observers described the listing prices as downright “cheap,” with some models priced as low as $17,700. Some used EVs are eligible for a federal tax credit of up to $4,000 that further sweetens the deal for buyers. But to qualify for that credit, the EV must be a model from 2022 or earlier and can’t have a sale price of more than $25,000. There are also income limits for the credit. To qualify, individual buyers can only make up to $75,000, or twice that for married couples filing jointly. In many cases, the cars Hertz is selling already have 50,000 to 60,000 miles on them, even in vehicles that are about a year old. That’s a lot of miles to pack on over a short period, Tucker noted. “Hertz Car Sales offers competitive pricing at a nonnegotiated price,” with vehicles available online and at bricks-and-mortar sales locations, a Hertz representative told MarketWatch. Hertz is selling EVs in multiple makes and models, and there are more coming in 2024, the representative said.  In the company’s “Rent2Buy program,” potential buyers can rent a vehicle for up to three days or take a free two-hour test drive. Rental charges are dropped when customers make a purchase, the spokesperson said. When considering whether to buy a used EV, mileage isn’t necessarily the most important factor, said Jeremy Robb, senior director of economic and industry insights at Cox Automotive. More important is the quality of the battery and the tires, which can wear out more quickly than in gas-powered cars. “Almost 60% of [an electric vehicle’s] value is tied up in a battery, and batteries degrade with use,” Tucker said. That’s why Tucker recommended having a vehicle you’re considering inspected by an independent mechanic or technician — and one who understands EVs. You’ll want to get the tires checked, too, because EVs weigh more than gas-powered cars and need special tires that can handle the wear. That’s because EV batteries are much heavier than a traditional gasoline-powered engine. One of the reasons Hertz is selling off so many EVs is the high cost of repairs. For EVs, repairs after an accident can cost thousands of dollars more than their gas-powered counterparts — something else that potential buyers may want to consider. And, of course, for those who are serious about purchasing a Tesla from Hertz’s fleet, the basics of used-car buying apply. You shouldn’t purchase the car sight unseen, Tucker said, and if Hertz or any other seller of a used car won’t let you inspect it with your own mechanic, don’t buy it. That being said: “Hertz is a top-tier rental company,” Robb said. “I’m sure the vehicles they’re going to sell will overall be in really good shape.” There are additional factors to consider when purchasing an electric vehicle, used or new, Robb and Tucker agreed: How often will you use it? Will you be able to charge the vehicle at home? What’s the charging infrastructure like where you live? “That’s one of the most important things that a consumer needs to consider,” Robb said. “Most people that have an EV have some way to charge at home. If you don’t, it’s probably going to be difficult for you over the long run.” But, for a lot of buyers, “this is just about the cheapest way to get into a used Tesla right now,” Tucker added. “If there are consumers that were thinking about purchasing a used EV, [the Hertz sale] may be a good option for them,” Robb said. “Some of these units might be at a more attractive price point.” Californians face yet another setback on the housing front as a major insurer pulls out of 72,000 home-insurance policies, citing costs. Hannah Erin Lang is a personal finance reporter for MarketWatch, based in New York. Previously, she covered banking and finance for The Charlotte Observer in her home state of North Carolina. She graduated from UNC-Chapel Hill with a degree in business journalism and grew up in the same town as her alma mater. Hannah Erin Lang is a personal finance reporter for MarketWatch, based in New York. Previously, she covered banking and finance for The Charlotte Observer in her home state of North Carolina. She graduated from UNC-Chapel Hill with a degree in business journalism and grew up in the same town as her alma mater.   Visit a quote page and your recently viewed tickers will be displayed here. "
}