{
    "title": "Up 101%, is Tesla now a horribly overvalued growth stock?",
    "date": "1/4/2024",
    "url": "https://www.fool.co.uk/2024/01/04/up-101-is-tesla-now-a-horribly-overvalued-growth-stock/",
    "text": "Shares of the iconic EV maker doubled last year as the tech sector rebounded sharply. Has this left the growth stock too pricey? The content of this article was relevant at the time of publishing. Circumstances change continuously and caution should therefore be exercised when relying upon any content contained within this article. Image source: Getty Images When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. Tesla (NASDAQ:TSLA) must surely rank among the most divisive growth stocks ever. And after surging 101% in 2023, its valuation has come into sharp focus again. The bears view Tesla as a grossly overvalued auto manufacturer whereas some bulls see the shares heading much higher. Meanwhile, the stock is down 30% over two years but up about 1,000% in five years. What’s going on here? In 2010, Tesla became the first US car company to go public since Ford in 1956. But CEO Elon Musk has revealed that just one year earlier the late Charlie Munger listed several reasons to him why he believed the electric vehicle (EV) firm would fail. Yet despite the high likelihood of failure, it has triumphed. And last year its Model Y became the world’s bestselling car, overtaking the Toyota Corolla even though it costs about twice as much. To go from a start-up with one product to the world’s most valuable auto maker in less than 15 years is truly remarkable. Even Munger later said: “What Tesla has done in the car business is a minor miracle“, So Tesla is undoubtedly a great company. But is the stock overpriced? The shares currently trade at 69 times expected earnings for 2023. That drops to 55 times for this year’s forecast earnings. That’s a mighty premium to the wider S&P 500 (21). And if this were a value stock then it would certainly be horribly mispriced. But Tesla is a quality growth stock and these rarely trade at average market multiples. Moreover, the firm sold 1.8m vehicles last year, despite the dodgy state of the global economy. That was up from less than 500,000 vehicles in 2020. So it is growing much quicker than the overall auto market, arguably justifying its premium. Admittedly, the stock was ridiculously overvalued in late 2020 when it was trading at preposterous levels. But back then its Shanghai factory had just begun production and the gigafactories in Texas and Berlin weren’t even built. Therefore, I think the stock is less risky today, though there are challenges. Musk predicted that Tesla’s biggest competitive threat would come from Chinese EV firms, not legacy Western carmakers. This was correct, as Chinese rival BYD has just overtaken Tesla as the world’s top-selling EV firm. I think Chinese competition is a risk, as is China itself. New regulations may emerge, especially around data, which Tesla collects a lot of, and that could hinder operations and growth there. If I’m after a cheap stock on a low valuation with a juicy 5.1% dividend yield, then Ford could be what I’m looking for. If I want to invest in fast-growing industries (EVs and solar energy) and potential future ones (robots and robo-taxis), then Tesla certainly fits the bill. For different reasons, I think both stocks could add value to a balanced portfolio, despite the challenging global economy. But given Tesla’s $754bn market cap, I don’t expect the stock to double again this year. And Musk has been tempering growth expectations lately, saying the days of annual 50%+ growth are probably over. He still expects rapid growth, though. If I didn’t already own Tesla shares, I’d consider investing today, but I wouldn’t bet the farm.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Ben McPoland has positions in Tesla. The Motley Fool UK has recommended Tesla. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 25 March, 2024 | Sumayya Mansoor This Fool explains how passive income stocks can help to create an additional income stream and details two picks she… Read more » 25 March, 2024 | Royston Wild These FTSE 250 trusts are on sale right now! And Royston Wild thinks they may be great last-minute buys for… Read more » 25 March, 2024 | Royston Wild The Lloyds share price has rebounded sharply after a tough start to 2024. Can it keep going, or will the… Read more » 25 March, 2024 | Sumayya Mansoor I reckon this FTSE 100 has been going under the radar, and recently posted excellent full-year results. Should I buy… Read more » 25 March, 2024 | Mark Rogers Ice ideas will usually offer a steadier flow of income and is likely to be a slower-moving but more stable… Read more » 25 March, 2024 | Royston Wild I'm searching the London market for the best dividend stocks to buy for my portfolio. Here are two that currently… Read more » 25 March, 2024 | Alan Oscroft Upbeat FTSE 100 results have been coming in, and interest rates must surely fall this year. Investors could be smiling… Read more » 25 March, 2024 | Ben McPoland They say statisticians don't play the lottery for obvious reasons. Fortunately, Warren Buffett has shown us a great way of… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}