{
    "title": "Elon Musk acts to move Tesla legal base to Texas after pay package ruling",
    "date": "2/1/2024",
    "url": "https://www.theguardian.com/technology/2024/feb/01/elon-musk-acts-to-move-tesla-legal-base-to-texas-after-pay-package-ruling",
    "text": "Tycoon announces shareholder vote on relocating after Delaware judge strikes down $56bn pay package as ‘unfathomable’ Elon Musk has announced Tesla will hold a vote on moving the company’s legal base to Texas after the state of Delaware threw out his $56bn pay package at the electric vehicle maker. The world’s richest person, whose No 1 status is endangered by the Delaware ruling, held a poll on X asking whether Tesla should change the company’s state of incorporation from Delaware to Texas. With more than 1m votes cast, the poll recorded 87% in favour of moving. Responding on Thursday, Musk wrote on his X account: “The public vote is unequivocally in favour of Texas! Tesla will move immediately to hold a shareholder vote to transfer state of incorporation to Texas.” On Tuesday, a Delaware judge called a 2018 share-based package awarded to the Tesla chief executive “an unfathomable sum” that was unfair to shareholders, and struck down the arrangement. Soon after, Musk wrote on X: “Never incorporate your company in the state of Delaware.” He added: “I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters”. Musk has strong ties with Texas. He moved Tesla’s corporate headquarters from Palo Alto in California to the Texas city of Austin in 2021 after criticising California’s regulations and taxes, and also clashing with health officials at the start of the Covid pandemic over reopening a factory in Fremont. One of the carmaker’s gigafactories is in Texas and it is building a $1bn (£800m) lithium refinery in the state, aiming to produce enough battery-grade lithium for about 1m vehicles by 2025. Other Musk companies, including the rocket firm SpaceX and the tunnelling business the Boring Company, also have operations in Texas. Another Musk-related Texas expansion is under way at X, which he also owns, after the social media platform announced last month it would open a content moderation office in Austin with 100 staff. It was not immediately clear whether the Tesla board supported Musk’s X declaration on Thursday. The Delaware judge Kathaleen McCormick in her ruling on Tuesday, wrote that Musk, a 13% shareholder in Tesla, had “thick ties” with the directors negotiating his 2018 package and had “dominated the process that led to board approval of his compensation plan”. Brian Quinn, a professor at Boston College law school, said moving to Texas “will require the board to initiate the reincorporation.” He added: “So, if he hasn’t he should drop them a line because it’s supposed to be a board call, not the result of a poll on X.” Quinn said switching to Texas would not change the underlying law behind the Delaware ruling, but the state’s launch of a new business court means it will want to show the court is “a fair forum for the adjudication of business disputes.” Sign up to Business Today Get set for the working day – we'll point you to all the business news and analysis you need every morning after newsletter promotion “It won’t help that effort to have their very first customer be Elon Musk who expects them to kowtow to managers’ interests. He’s putting Texas in a bit of a bind,” he said. Two weeks before the Delaware ruling, Musk challenged the board by writing on X that he needed to own 25% of Tesla’s voting shares or else he might build unspecified artificial intelligence and robotics products outside the company. Musk is worth $202bn, according to the Bloomberg billionaires index, more than the luxury goods tycoon Bernard Arnault, on $183bn, and Jeff Bezos, the Amazon founder, on $180bn. "
}