{
    "title": "Investing in Electric Cars - 5 Electric Vehicle Shares & Stocks",
    "date": "2/9/2024",
    "url": "https://www.carsguide.com.au/ev/advice/investing-in-electric-cars-the-best-ev-stock-and-share-options-92206",
    "text": "Sign up / Sign in Buy Sell Reviews Browse over 9,000 car reviews  Family focused reviews and advice for everything family car related. Off-road for beginners and the experienced, plus camper trailers, caravans and motorhomes Utes, commercial vehicles and tow tests We make it easy to compare design, practicality, value and more Buying used? Here's what to look out for and buy smart Your thoughts could drive you to more than just your next destination 🚗💬 Buying guides Our experts pick the top models News What's happening in the automotive world Get to know the personalities behind the team every week The stars of the latest big events The most interesting hints of what's to come What's been recalled and why. Are you affected? The latest and future car tech from around the world Advice We're here to help you with any car issues Looking for tips on how to carry or travel with your family? How To, off-road tips and adventure travel destinations Not just utes. Detailed advice for you - the tradie - on what car is right for you and your job Looking for an answer? Our automotive experts are here to help If you're wondering, we've probably got the answer Unsure of your car's maximum towing capacity? We've listed all relevant models here. Wondering how much air to put in your tyres? Our database has the answer Everything you need to know to keep you and your family as safe as possible Helpful advice before you finance your next car Tips for getting the right insurance and how to make a claim Everything you need to know when sizing up your new car adventureguide  familyguide  tradieguide  urbanguide  evguide  Browse over 9,000 car reviews   adventureguide evguide familyguide tradieguide urbanguide Browse over 9,000 car reviews   Love it or hate it, you can’t deny that Tesla has changed the car industry, and indeed the world. Not only has the American brand - once rated about as likely to succeed as a company making flying submarines - acted as the catalyst for the widespread adoption of electric vehicles, at the same time it has made investing in electric cars big business. Hugely profitable business, indeed, for some. Electric cars companies such as Tesla, Rivian, Nio and Polestar have become opportunities for investors to try and turn a small fortune into a larger one. But is investing in electric cars a good idea? What are the best car stocks for you to invest in? And, perhaps most importantly of all, what are the dangers and pitfalls you need to consider if you are going to dive into the market? In a word - Tesla. In 2010 it became the first American car company to list on the NASDAQ since the Ford Motor Company in 1956. The initial share price was US$17 but it finished 2023 at more than US$250. Tesla has used its theoretical value to sustain its rapid growth and survive the ups and downs of developing a new car brand. Download the EVGuide Report, 2022\nAustralia's one-stop snapshot of all things relating to electric cars.\n\n Download for free\n\n\n\nAlong the way it has made investors rich and that has led to the simultaneous growth of car companies looking at going public to cash in, and investors looking for car brands to make a fast buck on.There are alternatives to directly investing in a single brand of course - the electric vehicles ETF (exchange-traded funds).These are packages of shares spread across multiple companies that allow you to lower your risk by betting on multiple brands at the same time.Why is it important to choose carefully when investing in electric cars? Because, like any investment, EVs can be volatile and the share price is not always connected to how well the car company is performing. Or, to put it simply, the best EVs don’t always make the best EV stocks.Lordstown is a great example of the volatility of the market. The American brand started off in a blaze of glory, with its initial public offering (IPO) valuing the company at a staggering US$1.6 billion in late 2020, but six months later it was accused of misleading investors and by the middle of 2023 the company declared bankruptcy.How can you invest in electric cars?You can invest in car companies the same way you invest in any stock. To be crystal clear, this is a motoring website, I am not a financial expert the advice here is not everything you need to know to rush out and start spending money.We would recommend speaking with professional stock brokers and investing experts to get a more detailed understanding of how the market is performing when you want to invest.However, here are some of the most notable electric car companies that are currently available to invest in on the stock market.TeslaNASDAQ - TSLAAs we’ve already mentioned, Tesla is the darling of EV investing but it hasn’t always been smooth sailing for the brand. Some experts have been trying to short the stock for years, but so far unsuccessfully, and at times company chief, and billionaire, Elon Musk has run afoul of the industry regulators. TSLA has remained arguably the most reliable EV stock.But through all the drama, TSLA has remained arguably the most reliable EV stock. It will likely be a roller coaster ride and you’ll get nervous every time Musk opens X (aka Twitter).Tesla went public at US$17 per share and is (at the time of publication) hovering around the US$180 per share figure.BYDOTC - BYDDYIf there’s a challenger to Tesla when it comes to the more appealing EV stock, it’s China’s BYD. There are several reasons for this but primarily it comes down to two factors - BYD overtook Tesla by delivering more EVs in 2023, and BYD is backed by none other than investing superstar Warren Buffett, also known as the Oracle of Omaha. BYD overtook Tesla by delivering more EVs in 2023.Buffett is one of the richest people in the world and has built his fortune primarily on playing the stock market, so his investment in BYD was seen as a sign by many that the Chinese company has a strong future.The share price has certainly risen over the past five years, peaking at US$40 per share in 2022, but is currently sitting closer to US$20.PolestarNasdaqgm - PSNYFor an example of Tesla’s impact on the car industry, look no further than Polestar. The former Volvo performance sub-brand was spun off into its own electric vehicle company, albeit with the support of Volvo and Chinese parent company Geely.Seemingly, the idea was to copy Tesla’s success, both with a small line-up of EVs in the showroom and by cashing in on the interest in EV shares. The former Volvo performance sub-brand was spun off into its own electric vehicle company, albeit with the support of Volvo and Chinese parent company Geely.But in a real-world demonstration of the unpredictable nature of the investing market, Polestar has struggled to elicit the same response from investors as Tesla. Volvo recently announced it would off-load its stake in Polestar to Geely, with the share price sitting under US$2 (at time of publication) after listing at US$9.70.RivianNASDAQ - RIVNRivian is another brand that has tried to follow the Tesla game plan, again with mixed results. Seizing the opportunity of the EV revolution, R.J. Scaringe founded Rivian to build electric SUVs and utes in the USA. It was an appealing idea to some big companies looking to get into a Tesla-like operation on the ground floor. Ford was one of the early investors, before Rivian went public, hoping to both borrow technology and make a handy profit when Rivian became a hot share.That hasn’t quite gone to plan, even if it did start well. Amazon bought US$200 million in stock during the IPO in mid-2021, which exceeded expectations with an initial share price of US$78 that quickly rose to more than US$100 by the end of its first day of trading. The company is slowly establishing itself, with the R1T ute and R1S SUVs now available across the US.In doing so, Rivian became worth more than both General Motors and Ford, despite not having put a car in production.Given these circumstances it wasn’t a total surprise that the share price has been in steady decline since those exciting early days.The company is slowly establishing itself, with the R1T ute and R1S SUVs now available across the US, and plans to add a mid-size SUV (dubbed R2), but the share price is yet to rebound.Which means either now is a great time to buy and wait for a Rivian resurgence, or avoid it out of fear your investment will go nowhere. Choosing which way to go is the art of investing.NioNYSE: NIONio is a brand that’s yet to try its luck in Australia, but that doesn’t mean you can’t invest in it. The Chinese carmaker has enjoyed steady sales growth in its domestic market, and has entered the European market, as it has expanded its range of offerings. The share price peaked (at least for now) at US$57 in early 2021 but has been sliding down ever since, sitting at the US$5 mark (at the time of publication).However, since its IPO in late 2018 it hasn’t been quite so smooth. The share price peaked (at least for now) at US$57 in early 2021 but has been sliding down ever since, sitting at the US$5 mark (at the time of publication).Like Rivian and Polestar, Nio Inc. is a tempting proposition at its current price, but only if the brand can turn around its fortunes in an increasingly crowded EV market.Overall, are electric cars a good option to invest in? How should you choose an investment that is right for you?To be blunt, investing in the stock market carries inherent risks. Electric cars are no safer or more profitable option than any other investment, such as legacy car brands like Ford and General Motors, or other industries.You should always consider your circumstances and consult an expert before investing in any particular carmaker.This material has been prepared for information purposes only. It should not be taken as constituting professional advice and you should consider seeking independent legal, financial, taxation or other advice to check how the information relates to your unique circumstances. Australia's one-stop snapshot of all things relating to electric cars. Along the way it has made investors rich and that has led to the simultaneous growth of car companies looking at going public to cash in, and investors looking for car brands to make a fast buck on. There are alternatives to directly investing in a single brand of course - the electric vehicles ETF (exchange-traded funds). These are packages of shares spread across multiple companies that allow you to lower your risk by betting on multiple brands at the same time. Because, like any investment, EVs can be volatile and the share price is not always connected to how well the car company is performing. Or, to put it simply, the best EVs don’t always make the best EV stocks. Lordstown is a great example of the volatility of the market. The American brand started off in a blaze of glory, with its initial public offering (IPO) valuing the company at a staggering US$1.6 billion in late 2020, but six months later it was accused of misleading investors and by the middle of 2023 the company declared bankruptcy. You can invest in car companies the same way you invest in any stock. To be crystal clear, this is a motoring website, I am not a financial expert the advice here is not everything you need to know to rush out and start spending money. We would recommend speaking with professional stock brokers and investing experts to get a more detailed understanding of how the market is performing when you want to invest. However, here are some of the most notable electric car companies that are currently available to invest in on the stock market. NASDAQ - TSLA As we’ve already mentioned, Tesla is the darling of EV investing but it hasn’t always been smooth sailing for the brand. Some experts have been trying to short the stock for years, but so far unsuccessfully, and at times company chief, and billionaire, Elon Musk has run afoul of the industry regulators. TSLA has remained arguably the most reliable EV stock. But through all the drama, TSLA has remained arguably the most reliable EV stock. It will likely be a roller coaster ride and you’ll get nervous every time Musk opens X (aka Twitter). Tesla went public at US$17 per share and is (at the time of publication) hovering around the US$180 per share figure. OTC - BYDDY If there’s a challenger to Tesla when it comes to the more appealing EV stock, it’s China’s BYD. There are several reasons for this but primarily it comes down to two factors - BYD overtook Tesla by delivering more EVs in 2023, and BYD is backed by none other than investing superstar Warren Buffett, also known as the Oracle of Omaha. BYD overtook Tesla by delivering more EVs in 2023. Buffett is one of the richest people in the world and has built his fortune primarily on playing the stock market, so his investment in BYD was seen as a sign by many that the Chinese company has a strong future. The share price has certainly risen over the past five years, peaking at US$40 per share in 2022, but is currently sitting closer to US$20. Nasdaqgm - PSNY For an example of Tesla’s impact on the car industry, look no further than Polestar. The former Volvo performance sub-brand was spun off into its own electric vehicle company, albeit with the support of Volvo and Chinese parent company Geely. Seemingly, the idea was to copy Tesla’s success, both with a small line-up of EVs in the showroom and by cashing in on the interest in EV shares. The former Volvo performance sub-brand was spun off into its own electric vehicle company, albeit with the support of Volvo and Chinese parent company Geely. But in a real-world demonstration of the unpredictable nature of the investing market, Polestar has struggled to elicit the same response from investors as Tesla. Volvo recently announced it would off-load its stake in Polestar to Geely, with the share price sitting under US$2 (at time of publication) after listing at US$9.70. NASDAQ - RIVN Rivian is another brand that has tried to follow the Tesla game plan, again with mixed results. Seizing the opportunity of the EV revolution, R.J. Scaringe founded Rivian to build electric SUVs and utes in the USA. It was an appealing idea to some big companies looking to get into a Tesla-like operation on the ground floor. Ford was one of the early investors, before Rivian went public, hoping to both borrow technology and make a handy profit when Rivian became a hot share. That hasn’t quite gone to plan, even if it did start well. Amazon bought US$200 million in stock during the IPO in mid-2021, which exceeded expectations with an initial share price of US$78 that quickly rose to more than US$100 by the end of its first day of trading. The company is slowly establishing itself, with the R1T ute and R1S SUVs now available across the US. In doing so, Rivian became worth more than both General Motors and Ford, despite not having put a car in production. Given these circumstances it wasn’t a total surprise that the share price has been in steady decline since those exciting early days. The company is slowly establishing itself, with the R1T ute and R1S SUVs now available across the US, and plans to add a mid-size SUV (dubbed R2), but the share price is yet to rebound. Which means either now is a great time to buy and wait for a Rivian resurgence, or avoid it out of fear your investment will go nowhere. Choosing which way to go is the art of investing. NYSE: NIO Nio is a brand that’s yet to try its luck in Australia, but that doesn’t mean you can’t invest in it. The Chinese carmaker has enjoyed steady sales growth in its domestic market, and has entered the European market, as it has expanded its range of offerings. The share price peaked (at least for now) at US$57 in early 2021 but has been sliding down ever since, sitting at the US$5 mark (at the time of publication). However, since its IPO in late 2018 it hasn’t been quite so smooth. The share price peaked (at least for now) at US$57 in early 2021 but has been sliding down ever since, sitting at the US$5 mark (at the time of publication). Like Rivian and Polestar, Nio Inc. is a tempting proposition at its current price, but only if the brand can turn around its fortunes in an increasingly crowded EV market. To be blunt, investing in the stock market carries inherent risks. Electric cars are no safer or more profitable option than any other investment, such as legacy car brands like Ford and General Motors, or other industries. You should always consider your circumstances and consult an expert before investing in any particular carmaker. This material has been prepared for information purposes only. It should not be taken as constituting professional advice and you should consider seeking independent legal, financial, taxation or other advice to check how the information relates to your unique circumstances. 26 March 2024 · Andrew Chesterton 25 March 2024 · Chris Thompson 25 March 2024 · Tom White 24 March 2024 · Richard Berry 22 March 2024 · Mark Oastler 14 March 2024 · David Morley 11 March 2024 · Mark Oastler 1 March 2024 · Andrew Chesterton 19 February 2024 · James Cleary 21 March 2024 · Chris Thompson 20 March 2024 · Tom White 15 March 2024 · Andrew Chesterton 25 March 2024 · Emily Agar 12 March 2024 · Emily Agar 5 March 2024 · Richard Berry 27 February 2024 · Stephen Ottley "
}