{
    "title": "Elon Musk said it was ‘time to move on’ from hybrids years ago—but a \nwindfall from them will help Japanese carmakers challenge Tesla in EVs",
    "date": "2/16/2024",
    "url": "https://fortune.com/2024/02/16/japanese-carmakers-evs-push-helped-by-hybrids-windfall-elon-musk-tesla/",
    "text": "Timing matters. When it comes to timing the transition to electric vehicles, several Japanese automakers may be getting it just about right—despite appearing to be late to the game at first. Rather than rush headlong into EVs, Toyota, Honda, and Mazda have focused on hybrid vehicles as a more practical transition—to great success. They’ve each enjoyed surging sales of hybrids, which has helped them achieve record or near-record profits. That’s positioned them well financially to invest in EVs today, with an eye toward entering the fray in earnest in the second half of this decade. Meanwhile, the sales growth of electric vehicles, while still strong, has recently slowed, prompting Ford and GM to pare back their production plans. This is partly because an initial wave of EV enthusiasts have already bought their vehicles, and everyday car shoppers are more likely to be turned off by higher prices, range anxiety, and poor resale value, among other concerns. Tesla, in a call with investors last month, warned of “notably lower” sales growth this year after a disappointing fourth quarter. CEO Elon Musk said his EV maker is “between two major growth waves” as it aims to start production of a more affordable new model late next year. One difference with that second growth wave for Tesla is that, unlike in the first, it will face intense competition from Japanese carmakers, whose EV pushes have been helped by surging hybrid profits, putting them on a stronger financial footing. In 2022, Musk dismissed hybrids as a phase, saying that it’s “time to move on” from them. He might be right in the long run, especially as regulators around the world push harder for EV adoption to meet climate goals. In California and New York, zero-emission mandates loom over the automotive landscape. Both states will require that all new passenger vehicles sold be zero-emission by 2035. But for now, many consumers are opting for hybrids, which use less fuel than traditional vehicles—easier on the environment and the wallet—even while still requiring occasional trips to the gas station. Currently, car shoppers are worried about the downsides of EVs, said Mazda CFO Jeffrey Guyton, as reported by Automotive News. “Our strategy is to follow regulation, yes, but also to pay close attention to what actual customers want,” he said. Mazda, thanks in large part to strong hybrid sales, reported record profits in its fiscal third quarter ending Dec. 31, 2023—and is closing in on the same for the full year ending March 31. Guyton said hybrids are getting extra attention among U.S. consumers thanks in part to growing interest in electric vehicles. “I think hybrid is benefiting a little bit from the hype around EV,” Guyton said. “Now there is a flattening of the EV market. And I think the people who used to be shouting EV and promoting EV have decided, well, if we cannot get people to take pure electric, hybrid is a good alternative.” While EVs accounted for less than 1% of Mazda’s global sales through last September, the carmaker expects that to reach up to 40% by 2030. By that time, it hopes to be selling seven or eight EV models. It recently set up a standalone division to build EVs on a new scalable platform, with the first models from that expected to launch in the 2025-2027 timeframe. Honda has similarly enjoyed surging sales and profits thanks in no small part to hybrids. Two hybrid models accounted for a quarter of Honda’s total U.S. sales in 2023. But it also aims to introduce 30 new EV models globally by 2030, by which time it plans on EVs making up 40% of its sales in North America. Toyota, the world’s top carmaker for four years running, feels vindicated after being widely criticized for its EV stance. It did sell an electric version of its RAV4 SUV that was discontinued in 2014, and more recently it launched an EV called the bZ4X in 2022, but it’s made relatively few EV offerings, especially considering its size. But this month, Toyota said it expects to notch record operating profit for the fiscal year ending March 31, crediting higher sales of hybrid vehicles across all its major markets. “We think the market is now rethinking the potential of hybrid products, which are a strength of Toyota,” Goldman Sachs analysts wrote in a recent research note. But as Toyota rakes in the hybrid profits, it also has big plans for EVs. In November 2023, it vowed to make 3.5 million EVs annually by 2030, with dozens of different models across its Toyota and Lexus brands. To put that in perspective, Tesla sold 1.8 million EVs last year. And as soon as 2027, Toyota plans to introduce new solid-state batteries that allow for longer ranges and faster charge times than today’s lithium-ion batteries. In October 2022, Akio Toyoda, then CEO of Toyota, said that EVs “are just going to take longer than the media would like us to believe,” thanks in part to insufficient charging infrastructure. He emphasized the importance of hybrids in the meantime, insisting that Toyota would keep offering a wide variety of powertrains and let consumers decide for themselves. Last month, he predicted that EVs would capture just 30% of the market and would share the road with hybrid, traditional, and hydrogen-powered vehicles. But that doesn’t mean Toyota won’t push hard into the EV space. Last year, Toyoda—whose grandfather founded the Japanese auto giant—resigned as CEO and became chairman, making way for a new leadership team that’s better able to transition to EVs. “I am an old-fashioned person in regards to digitalization, electric vehicles, and connected cars,” Toyoda said. “I cannot go beyond being a car guy, and that is my limitation. The new team can do what I can’t do.” Correction: An earlier version of this article misstated the first EV sold by Toyota. It was the RAV4 EV. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}