{
    "title": "Ashneer Grover shares pic of 'Tesla in Delhi'. But look closer...",
    "date": "2/4/2024",
    "url": "https://www.indiatoday.in/trending-news/story/ashneer-grover-shares-pic-of-tesla-in-delhi-but-there-is-a-twist-2497338-2024-02-04",
    "text": "Listen to Story Ashneer Grover, the former MD of BharatPe, has captured the attention of social media users with a unique post. He shared an image of what he referred to as the world's first \"cross-breed\" Tesla, which was spotted in Delhi’s Karol Bagh. However, this intriguing vehicle is not a product of Tesla but rather a BYD Atto 3, an electric SUV that comes in Boulder Grey. The twist? It sports the iconic \"Tesla\" branding on its rear. In the post, Grover expressed a mix of amusement and admiration at the car. \"World's first 'cross-breed' Tesla! Some Delhi boy literally 'built his dream' in Karol Bagh.\" The BYD Atto 3, which stands for the Chinese company Build Your Dreams, is known for its approximate 10-hour charging time when using an AC charger. Take a look at the post: The post has garnered over 203k views and tons of reactions. People were amused at the car and enquired about the company as well.\n \n\n\n\n \n\n\nWhile this quirky modification has caught the eye of many, it coincides with significant news in the electric vehicle industry. Reports suggest that Tesla, the renowned EV manufacturer led by CEO Elon Musk, is considering setting up its first local manufacturing plant in India, specifically in Gujarat. Speculation is rife that an official announcement could be made during the Vibrant Gujarat Summit.And as for the car, let us tell you that the BYD Atto 3 is not a cheap SUV. The price of the BYD Atto 3 starts at Rs 33.99 lakh (ex-showroom) and it has quite some cool features like one-touch open/close tailgate, roof rails, and electrically heated and adjustable ORVMs. While this quirky modification has caught the eye of many, it coincides with significant news in the electric vehicle industry. Reports suggest that Tesla, the renowned EV manufacturer led by CEO Elon Musk, is considering setting up its first local manufacturing plant in India, specifically in Gujarat. Speculation is rife that an official announcement could be made during the Vibrant Gujarat Summit. And as for the car, let us tell you that the BYD Atto 3 is not a cheap SUV. The price of the BYD Atto 3 starts at Rs 33.99 lakh (ex-showroom) and it has quite some cool features like one-touch open/close tailgate, roof rails, and electrically heated and adjustable ORVMs. But, on the contrary, we can actually hear Ashneer Grover saying ‘Ye sab doglapan hai’ after looking at this car. What are your thoughts? (with inputs from Varun Singh)Published By: Srimoyee ChowdhuryPublished On: Feb 4, 2024Also Read |  Internet explodes with memes after AB de Villiers reveals Virushka's secretMust Watch "
}