{
    "title": "Elon Musk, fuming over $55 billion Tesla pay ruling, switches Neuralink \nincorporation from Delaware to Nevada",
    "date": "2/10/2024",
    "url": "https://fortune.com/2024/02/10/elon-musk-neuralink-tesla-pay-ruling/",
    "text": "Elon Musk’s brain implant company, Neuralink Corp., switched the location of its business incorporation to Nevada from Delaware, taking steps to cut ties to a state where Musk has suffered significant legal setbacks — one over pay and another over his acquisition of Twitter. The change was completed Thursday, according to the office of the Nevada secretary of state and a notice sent to shareholders in the company. Last week, a Delaware judge struck down Musk’s $55 billion Tesla Inc. pay package. In a post on X, the social network he owns, Musk advised founders not to incorporate in the state. The notice sent to shareholders, which was reviewed by Bloomberg, informed them that their outstanding shares in the Delaware corporation would now be incorporated into outstanding shares in the Nevada corporation. Read more: Court forces Elon Musk to testify in SEC Twitter probe again after his refusal, and now the agency has ‘thousands of new documents’ Neuralink lawyer Philip Mao declined to comment. Last week, Musk tweeted that Neuralink had implanted a device in a human patient for the first time. The startup’s technology aims to help people with traumatic injuries operate computers using only their thoughts. Eventually, Musk has said Neuralink’s device will give people “control of your phone or computer, and through them almost any device, just by thinking.” Neuralink isn’t the first business Musk has reincorporated outside of Delaware and may not be the last. Musk previously moved the incorporation of X from Delaware to Nevada when he renamed the company from Twitter. Nevada’s corporate laws offer more protections for executives against investor suits. Tesla, which is headquartered in Austin, was incorporated in Delaware in 2003. Last week, Musk vowed to try to shift Tesla’s incorporation from Delaware to Texas, but such a move would require a shareholder vote. Musk has a long history of legal disputes in Delaware, which is known as the country’s incorporation capital. The state is the corporate home to more than 70% of Fortune 500 companies and its chancery court judges are recognized as business-law experts who can hear cases on a fast-track basis. Most high-profile merger-and-acquisition disputes are litigated in the state in non-jury cases. Even foreign companies come to Delaware to have corporate disputes decided. Two years ago, a Delaware judge rebuffed an investor suit challenging Musk’s $2.6 billion acquisition of renewable-power provider SolarCity, finding the billionaire entrepreneur didn’t improperly force fellow directors to accept an overpriced buyout of SolarCity. Later in 2022, Musk didn’t have as much luck when he tried to back out of his bid to buy the social media platform once known as Twitter. He was repeatedly dealt setbacks in pretrial rulings by Judge Kathaleen St. Jude McCormick – the same judge who would go on to zap his 2018 pay plan. — With assistance from Dana Hull and Jef Feeley © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}