{
    "title": "Elon Musk in 2024: What to know about the world's richest person",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/news/elon-musk-2023-know-world-204511244.html",
    "text": "Elon Musk has risen to fame by founding some of the most innovative tech companies in the world today, including electric vehicle maker Tesla and space exploration company SpaceX. Today, Musk ranks as the richest person in the world, according to Bloomberg, largely thanks to his roughly 13 percent stake in Tesla, which was worth about $74 billion as of February 2024. But Musk’s business practices are unconventional and sometimes controversial. In 2022, he agreed to acquire social media company Twitter in a $44 billion deal before later trying to back out of the deal. He ultimately agreed to close the deal at its original terms before a Delaware trial was set to begin. Here’s what else you should know about Musk including how he got his start and his largest investments today. Estimated net worth of $200 billion as of February 2024, making him the richest person in the world, according to Bloomberg. He is about $5 billion ahead of the man in second place, Amazon co-founder Jeff Bezos. Leads five ventures: Tesla, SpaceX, Twitter, Neuralink and The Boring Company. Born in Pretoria, South Africa and bought his first computer at age 10. Graduated from the University of Pennsylvania with degrees in Physics and Economics. In 2012, Musk joined Warren Buffett’s Giving Pledge, which asks billionaires to dedicate the majority of their wealth to charitable causes. Co-founder of online payment system PayPal, which was sold to eBay in 2002 for $1.5 billion. Helped launch The Boring Company, a tunneling venture that hopes to alleviate urban congestion and allow for high-speed, long-distance travel. CEO of Neuralink, which is working to develop interfaces that allow the human brain to be connected to computers. Agreed in 2018 to settle securities fraud charges brought against him by the Securities and Exchange Commission (SEC) after he tweeted that he could take Tesla private for $420 per share and that funding had been secured, which the SEC said “lacked an adequate basis in fact.” Disclosed a 9 percent stake in Twitter in April 2022 before agreeing to acquire the entire company in a $44 billion deal later that month. He later sought to back out of the deal before reversing his position and completing the deal at its original terms. Elon Musk has been involved in some leading tech companies, some of which have become among the largest companies in the U.S. Company Value # of Employees Tesla $587 billion 140,473 SpaceX $180 billion 13,000 The Boring Company Over $7 billion ~200 Neuralink $3.5 billion PayPal $68 billion 29,900 After selling Zip2, a software company designed to help newspapers build online city guides, to Compaq Computer in 1999, Musk used the proceeds to create X.com. He later merged the venture with money transfer company Confinity and they combined to create PayPal. When PayPal was sold to eBay in 2002 for $1.5 billion, Musk’s 11.7 percent stake ended up netting him about $180 million after taxes. The sale of PayPal created significant wealth for its founders and early employees, who went on to create and invest in new tech companies. The group of PayPal founders, which includes investor and political activist Peter Thiel and Affirm CEO Max Levchin, came to be known as the “PayPal Mafia.” Founded in 2003, Tesla has become a leader in electric vehicle manufacturing. Musk joined Tesla as an investor in 2004 and became chairman of its board of directors, eventually becoming CEO in 2008. Tesla launched its first car in 2008, and its Model S, launched in 2012, was named the best overall car by Consumer Reports. Tesla became the world’s most valuable car company in the summer of 2020 and its market value topped $1 trillion in the fall of 2021 before falling in 2022. The company had a market value of about $587 billion as of February 2024. Musk owns a roughly 13 percent stake in Tesla and has significant influence at the company, leading product design, engineering and global manufacturing for the company’s EVs, battery and solar energy products. In 2018, Musk and Tesla agreed to each pay $20 million to settle securities fraud charges brought by the SEC after Musk tweeted that he could take the company private for $420 per share and that funding had been secured, despite there being no adequate basis for the claim. Musk was also forced to step down as chair of Tesla for three years as part of the settlement. Musk is also CEO and lead designer at SpaceX, which develops rockets and spacecraft for missions to Earth’s orbit and ultimately, the company says, to other planets. Musk used the majority of the money he gained from PayPal to start SpaceX in 2002. The company has won contracts with NASA and the U.S. Air Force to design rockets. SpaceX is a private company, but Musk held a 42 percent stake in the business through a trust, according to a 2022 filing reviewed by Bloomberg. Neuralink is developing ultra-high bandwidth brain machine interfaces to connect human brains to computers, according to the company’s website. The company announced it had raised $205 million in 2021 from a number of venture capital firms and investors including Google. The company says Musk’s goal with Neuralink is to help people with brain injuries in the near term and reduce the risk that artificial intelligence poses to humanity in the long term. The company is one of the smallest Musk is involved with and has fewer than 500 employees. In January 2024, Musk announced that the first human had received a Neuralink brain implant and that the patient was recovering well. The Boring Company seeks to combine fast, affordable tunneling technology with an electric public transportation system in an effort to ease urban congestion and allow for high-speed, long-distance travel. The company built a 1.15-mile tunnel in Hawthorne, California to be used for research and development and is currently building Vegas Loop, a public transportation system at the Las Vegas Convention Center. The company was valued at more than $7 billion after an employee share sale in October 2023, according to a report from The Information. That valuation is higher than its valuation during a funding round in April 2022 when it raised $675 million. The 2022 funding was led by Vy Capital and Sequoia Capital, two leading venture capital firms. Artificial intelligence company DeepMind Technologies was started in 2010 with Musk as a key investor. The company has developed AI systems that play games better than humans. Musk has long warned about the dangers of AI and the risk it poses to civilization. Google acquired DeepMind in 2014 for a reported sum of $600 million. SolarCity was started in 2006 by two of Musk’s cousins and financially backed by Musk, who served on the company’s board. The company sold and installed solar generation systems and other related products to residential, commercial and industrial customers. Tesla agreed to acquire SolarCity in a $2.6 billion deal in 2016. Some critics characterized the acquisition as a bailout for SolarCity, which had struggled to raise money. Musk said he wasn’t involved in the valuation of the acquisition and later won a shareholder lawsuit related to the deal. Elon Musk has grown his net worth by creating and investing in companies. He’s been able to turn his proceeds from the sale of PayPal early in his career into even greater sums by redeploying the money into ventures that have turned out enormously well. His current estimated net worth of $200 billion has grown tremendously since the start of 2020, when it stood at about $27.6 billion, according to Bloomberg. Since then, Tesla’s stock has appreciated more than six-fold and Musk’s net worth has risen with it, vaulting him into the position of richest person in the world. At his net worth of $27.6 billion at the beginning of 2020, he’d sit at number 57 on the current list of billionaires. In April 2022, Musk disclosed a 9 percent stake in social media company Twitter after years of being an active user with a large following. Eventually he agreed to purchase the entire company before later trying to back out of the deal. He ultimately agreed to purchase the company at the original deal terms. Here’s a timeline of how the events played out: April 4, 2022: Musk disclosed that he holds a 9 percent stake in Twitter, sending Twitter shares soaring. April 25, 2022: Twitter accepts Musk’s bid to take over the company in a $44 billion deal, which values the company at $54.20 per share. July 8, 2022: Musk seeks to terminate the merger agreement with Twitter, saying he hasn’t received enough information to understand how many fake accounts exist on the platform. July 12, 2022: Twitter files a lawsuit against Musk, seeking to force him to honor the merger agreement. The company said it “bent over backwards” to provide the information he requested. July 19, 2022: Delaware judge grants Twitter’s request to fast-track its lawsuit, setting a five-day trial to begin in October. August 4, 2022: In a countersuit, Musk accuses Twitter of fraud, saying the company misrepresented key user metrics before he agreed to acquire the company. August 6, 2022: Musk challenges Twitter CEO Parag Agrawal to a public debate about the percentage of Twitter users that are fake or spam accounts. October 4, 2022: Musk agrees to purchase Twitter at the original deal price of $54.20/share weeks before a Delaware trial was set to begin. October 6, 2022: Delaware judge sets an Oct. 28 deadline for Musk and Twitter to complete the deal. October 28, 2022: Musk completes deal for Twitter and immediately fires its top executives including its CEO and CFO. May 12, 2023: Musk announces that he’s hired NBCUniversal executive Linda Yaccarino to be Twitter’s new CEO. June 5, 2023: The New York Times reports that Twitter’s ad sales fell 59 percent from April 1 through the first week of May, compared to the same period in 2022. July 24, 2023: Musk unveiled a new X logo, saying it would replace Twitter’s blue bird, potentially setting up the company to enter the financial services industry. Musk has also been a frequent commentator and supporter of cryptocurrencies through his tweets. In February 2021, Tesla announced it had purchased $1.5 billion in Bitcoin and planned to accept the coin as payment for its product and services. A few months later, Musk appeared on Saturday Night Live where he referred to the cryptocurrency Dogecoin as a “hustle.” The coin fell 30 percent after Musk’s comments and has fallen even further since. Tesla stopped accepting Bitcoin as payment just a few months after it started due to environmental concerns. Musk said in July 2021 that Tesla would “most likely” accept Bitcoin again once it becomes more eco-friendly. In July 2022, Tesla said it had converted about 75 percent of its Bitcoin holdings into fiat currency, despite touting the long-term potential of Bitcoin a year earlier. Invest in physical things: Musk wrote in a tweet in March 2022 that “it is generally better to own physical things like a home or stock in companies you think make good products, than dollars when inflation is high.” He added that he wouldn’t be selling his cryptocurrency holdings such as Bitcoin, Ethereum or Dogecoin. Diversification: “Buy stock in several companies that make products and services that *you* believe in,” Musk wrote to followers in 2022. By suggesting investors choose several companies, Musk is arguing for a diversified approach, which means you won’t be sunk if one or two of your investments perform poorly. Stay calm: Musk suggests that the only reason to sell an investment is if a company’s products and services are deteriorating. “Don’t panic when the market does,” he says. "
}