{
    "title": "This Electric Vehicle Stock Has 75% Upside, According to 1 Wall Street \nAnalyst",
    "date": "2/25/2024",
    "url": "https://finance.yahoo.com/news/electric-vehicle-stock-75-upside-131000079.html",
    "text": "Tesla (NASDAQ: TSLA) and other electric vehicle (EV) stocks haven't exactly been roaring on the stock market lately. Their price slumps have led some pundits to believe they're undervalued. One of these even feels Tesla's shares are poised to accelerate nearly 75% higher in price. That prognosticator is Morgan Stanley's Adam Jonas, who reiterated his overweight (buy, in other words) recommendation on Tesla at a target price of $345 per share in mid-February. In recent comments, Jonas and his team acknowledged the general bearish sentiment on the EV sector leader. However, they implied many investors have too narrow a view of the company's business. In their view Tesla also stands to benefit from advances in segments such as artificial intelligence (AI) and other hot tech areas. For example, it is developing Optimus, which it describes as \"A general purpose, bi-pedal, humanoid robot capable of performing tasks that are unsafe, repetitive or boring.\" The Morgan Stanley analysts said that \"Our thesis on Tesla is that it is both an auto stock and an energy, AI/robotics company. In fact, our valuation of the core auto business ($75/share) represents just 22% of our $345 price target.\" In their view, while the current weakness in the EV market is detrimental to manufacturers such as Tesla, the negative effects on this stock's price will be short-term. Jonas and his Morgan Stanley colleagues have been longtime Tesla bulls, but they've lowered their expectations in the recent past. In January, they trimmed the bank's price target on the stock from $380 to the present level, citing oversupply in the EV market as a key reason for the move. I don't share Jonas and his team's continued enthusiasm for Tesla. The great consumer rush into EVs seems to be over, meanwhile the company keeps cutting prices to bolster volume. I'm also troubled by the numerous accidents apparently involving the EV maker's inaccurately named Autopilot feature, which makes it seem as if the system needs more development and testing. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Tesla made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of February 20, 2024 Eric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. This Electric Vehicle Stock Has 75% Upside, According to 1 Wall Street Analyst was originally published by The Motley Fool Related Quotes "
}