{
    "title": "Elon Musk to seek shareholders approval to roll out Tesla in Texas",
    "date": "2/2/2024",
    "url": "https://timesofoman.com/article/141521-elon-musk-to-seek-shareholders-approval-to-roll-out-tesla-in-texas",
    "text": "Delaware: After the Delaware court ruling to struck down Tesla CEO, Elon Musk's pay package, he said he is seeking shareholder approval to incorporate the company in Texas, CNN reported on Thursday.It reported that Chancellor Kathaleen McCormick ruled about Elon Musk's 2018 salary package, worth about USD 51 billion at current stock prices, Musk put up a poll on X asking if Tesla should move its registration from Delaware to Texas, where it is already headquartered.  Delaware Chancery Court Chancellor Kathaleen McCormick, who oversaw the bench trial that concluded in November 2022, ruled Tuesday that Musk and the Tesla board \"bore the burden of proving that the compensation plan was fair, and they failed to meet their burden.\"Hours later, the Tesla CEO wrote that the \"public vote is unequivocally in favour of Texas.\" The poll results showed Texas had won the backing of more than 87 per cent of about 1.1 million votes.Musk added he will now \"immediately\" seek shareholder approval to incorporate the electric carmaker in the southern state.Delaware is famously one of the world's most welcoming places for companies of all kinds and sizes to incorporate for legal and tax purposes. Nearly 70 per cent of Fortune 500 companies are incorporated there.CNN reported that it is seen as a desirable place to seek approval for mergers and litigate disputes, and doesn't levy sales tax or tax on profits from intellectual property.While Musk has not commented directly on the judgment on his pay package, he tweeted Tuesday: \"Never incorporate your company in the state of Delaware.\"\"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another tweet.Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. It reported that Chancellor Kathaleen McCormick ruled about Elon Musk's 2018 salary package, worth about USD 51 billion at current stock prices, Musk put up a poll on X asking if Tesla should move its registration from Delaware to Texas, where it is already headquartered.  Delaware Chancery Court Chancellor Kathaleen McCormick, who oversaw the bench trial that concluded in November 2022, ruled Tuesday that Musk and the Tesla board \"bore the burden of proving that the compensation plan was fair, and they failed to meet their burden.\"Hours later, the Tesla CEO wrote that the \"public vote is unequivocally in favour of Texas.\" The poll results showed Texas had won the backing of more than 87 per cent of about 1.1 million votes.Musk added he will now \"immediately\" seek shareholder approval to incorporate the electric carmaker in the southern state.Delaware is famously one of the world's most welcoming places for companies of all kinds and sizes to incorporate for legal and tax purposes. Nearly 70 per cent of Fortune 500 companies are incorporated there.CNN reported that it is seen as a desirable place to seek approval for mergers and litigate disputes, and doesn't levy sales tax or tax on profits from intellectual property.While Musk has not commented directly on the judgment on his pay package, he tweeted Tuesday: \"Never incorporate your company in the state of Delaware.\"\"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another tweet.Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. Delaware Chancery Court Chancellor Kathaleen McCormick, who oversaw the bench trial that concluded in November 2022, ruled Tuesday that Musk and the Tesla board \"bore the burden of proving that the compensation plan was fair, and they failed to meet their burden.\"Hours later, the Tesla CEO wrote that the \"public vote is unequivocally in favour of Texas.\" The poll results showed Texas had won the backing of more than 87 per cent of about 1.1 million votes.Musk added he will now \"immediately\" seek shareholder approval to incorporate the electric carmaker in the southern state.Delaware is famously one of the world's most welcoming places for companies of all kinds and sizes to incorporate for legal and tax purposes. Nearly 70 per cent of Fortune 500 companies are incorporated there.CNN reported that it is seen as a desirable place to seek approval for mergers and litigate disputes, and doesn't levy sales tax or tax on profits from intellectual property.While Musk has not commented directly on the judgment on his pay package, he tweeted Tuesday: \"Never incorporate your company in the state of Delaware.\"\"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another tweet.Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. Hours later, the Tesla CEO wrote that the \"public vote is unequivocally in favour of Texas.\" The poll results showed Texas had won the backing of more than 87 per cent of about 1.1 million votes.Musk added he will now \"immediately\" seek shareholder approval to incorporate the electric carmaker in the southern state.Delaware is famously one of the world's most welcoming places for companies of all kinds and sizes to incorporate for legal and tax purposes. Nearly 70 per cent of Fortune 500 companies are incorporated there.CNN reported that it is seen as a desirable place to seek approval for mergers and litigate disputes, and doesn't levy sales tax or tax on profits from intellectual property.While Musk has not commented directly on the judgment on his pay package, he tweeted Tuesday: \"Never incorporate your company in the state of Delaware.\"\"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another tweet.Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. Delaware is famously one of the world's most welcoming places for companies of all kinds and sizes to incorporate for legal and tax purposes. Nearly 70 per cent of Fortune 500 companies are incorporated there.CNN reported that it is seen as a desirable place to seek approval for mergers and litigate disputes, and doesn't levy sales tax or tax on profits from intellectual property.While Musk has not commented directly on the judgment on his pay package, he tweeted Tuesday: \"Never incorporate your company in the state of Delaware.\"\"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another tweet.Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. CNN reported that it is seen as a desirable place to seek approval for mergers and litigate disputes, and doesn't levy sales tax or tax on profits from intellectual property.While Musk has not commented directly on the judgment on his pay package, he tweeted Tuesday: \"Never incorporate your company in the state of Delaware.\"\"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another tweet.Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. While Musk has not commented directly on the judgment on his pay package, he tweeted Tuesday: \"Never incorporate your company in the state of Delaware.\"\"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another tweet.Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. \"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another tweet.Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company's directors were too close to Musk to protect their interests.The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. The 303 million split-adjusted stock options that Musk had received as part of the package are worth USD 51 billion, when calculated using Tuesday's closing price, less the modest exercise price of USD 23.34 a share, CNN reported. "
}