{
    "title": "Tesla, the \"icon of the electric vehicle industry,\" is suffering from \ncontinuous bad news. This is d.. - MK",
    "date": "2/11/2024",
    "url": "https://www.mk.co.kr/en/business/10937868",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share Tesla, the \"icon of the electric vehicle industry,\" is suffering from continuous bad news. This is due to the continued slowdown in the electric vehicle market and the risk of CEO Elon Musk. Recently, the Wall Street Journal (WSJ) reported that Musk has been taking drugs with current and former Tesla and SpaceX directors. To make matters worse, about $55.8 billion (74 trillion won) compensation package received since 2018 has been invalidated by the court, raising the possibility of Musk's departure. The WSJ reported on Musk's drug use on February 3 (local time). WSJ quoted former and current Tesla and SpaceX officials as explaining, \"There was a situation where I had to take drugs with him depending on the atmosphere induced by Musk.\" Elon Musk's younger brother Kimbal Musk, Tesla's former outside director Antonio Gracias and early SpaceX investor Steve Jerbetson were cited as the board members who took drugs with Musk. The location of the drug party was also revealed. \"Musk has been attending social gatherings at the Austin Prosper Hotel in Texas in recent years, where he used nasal sprays several times to take ketamine for pleasure,\" the WSJ claimed.  It is truly a series of bad news. Some also raise the possibility of Musk leaving Tesla. This is due to the fact that compensation package issues also overlap. A Delaware court in the U.S. declared invalid on Jan. 30 (local time) a compensation package worth $55.8 billion (74 trillion won) for Tesla CEO Elon Musk. The compensation package, which passed the Tesla shareholders' meeting in 2018, aims to provide Musk with about 1% of Tesla shares whenever he achieves 12 specific goals, including sales and market capitalization. Musk has achieved all of his 2022 goals in four years and received $55.8 billion worth of Tesla shares. In response, the Delaware court pointed out that \"Tesla board members had procedural defects in establishing compensation plans for Musk, including violations of the duty of care (duty as a good asset manager),\" adding, \"Musk led the process of approving the compensation package for him.\" Musk's plan to increase his influence by increasing his stake in Tesla to 25%, which is currently around 13%, has also been disrupted. Musk previously said, \"To avoid hostile acquisitions and control the company sufficiently, we need a 25% stake in Tesla,\" adding, \"If we cannot increase our voting rights to 25%, we will also consider making products outside of Tesla.\" The market analyzes that Musk's risk also affects Tesla's stock price. The stock price, which was $253.18 at the end of last year, has fallen below $200. Although it has rebounded slightly recently, it is still moving sideways over the $200 wall.There is also a negative outlook in the investment market. Barance, a U.S. investment media outlet, pointed out that Tesla will be the first to be excluded from the \"Magnificent 7 (Apple, Microsoft, Amazon, Alphabet, Nvidia, Tesla, and Meta)\" tech stocks that recently led the U.S. stock market. 2024-03-25 13:53:34 2024-03-26 06:15:52 2024-03-24 15:26:58 2024-03-25 08:57:22 2024-03-24 14:09:45 2024-03-25 17:22:19 2024-03-26 09:40:53 2024-03-25 14:47:31 2024-03-26 06:07:05 2024-03-25 20:31:33 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}