{
    "title": "Barron's Weekend Stock Picks: GE, Meta And Turmoil At Tesla - Apple \n(NASDAQ:AAPL), iShares ESG Aware MSCI",
    "date": "2/3/2024",
    "url": "https://www.benzinga.com/news/24/02/36923838/barrons-weekend-stock-picks-ge-meta-and-turmoil-at-tesla",
    "text": "Benzinga reviews this weekend's top stories covered by Barron's. Here are the articles investors need to read. In \"GE Just Released Its Final Annual Letter. CEO Larry Culp Looks Back, Reluctantly,\" Al Root writes that GE CEO Larry Culp reflected on the breakup of General Electric Co. GE in the company's last annual letter, expressing optimism for the future of GE Aerospace and GE Vernova while citing past challenges like debt reduction. In \"Meta Is Paying a Dividend. What History Says Happens to the Stock Next,\" Root says that Meta Platforms Inc's META first-ever quarterly dividend of 50 cents, announced with a 20.3% stock surge, signals a shift in Big Tech's dividend approach, prompting investor optimism for future gains akin to Microsoft and Apple. In \"ESG Funds Set a Dismal Record. Yet Performance Was a Drag,\" Lauren Foster notes that U.S. sustainable funds experienced a record $13 billion outflow in 2023, led by poor performance and ESG backlash, notably from iShares ESG Aware USA ETF ESGU, while total assets still reached $323 billion by year-end. In \"Apple Stock Is Holding Up Despite Weak Guidance as Investors Refocus on AI,\" Eric J. Savitz writes that Apple Inc's AAPL weak forecast briefly affected stock, but analysts, including Morgan Stanley's Erik Woodring, anticipate positive developments at the June Worldwide Developers Conference, despite ongoing concerns about fundamentals and valuation. In \"Tesla Stock Is Down. Don’t Blame the Latest Recall—Blame Ford Instead,\" Root and Rupert Steiner point out that Tesla Inc's TSLA stock fell 1.9% due to a disappointing forecast, NHTSA investigations, and concerns about slowing EV sales, reflecting challenges in 2024 with slow China sales, production disruptions, price cuts, and a 24% year-to-date stock decline. Read Next: Cathie Wood Buys More Tesla Shares Friday, Taking Week's Purchases To Whopping $36M: Is Recovery On The Horizon? This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}