{
    "title": "Tesla Analyst Believes Megapack Is A $120B Sleeping Giant That Could \nSurpass EV Business, Flags Next Big Catalyst ...",
    "date": "2/29/2024",
    "url": "https://www.tradingview.com/news/benzinga:fc2bc0553094b:0-tesla-analyst-believes-megapack-is-a-120b-sleeping-giant-that-could-surpass-ev-business-flags-next-big-catalyst-for-stock/",
    "text": "As Tesla, Inc.‘s TSLA core electric vehicle business faces challenges, sell-side analysts are shifting their focus to the company’s ancillary ventures. On Thursday, an analyst from RBC Capital Markets pointed out a particular segment that could potentially surpass Tesla’s car business. What Happened: Following a “Battery Storage Facility Tour,” RBC analyst Tom Narayan emphasized the potential of Tesla’s Megapack utility-grade battery storage business. He noted, “Tesla’s Megapack utility-grade battery storage business could be worth substantially more than its standalone car business.” Tesla envisions a need for 2 Terawatt-Hours of annual battery storage on a large scale by around 2040, according to the analyst. He estimated the battery storage industry’s annual revenue at $600 billion, with Tesla’s specific storage revenue projected at $90 billion, assuming a 15% market share. “Applying a 15x cap goods EBITDA multiple results in a $345B EV for Tesla’s Megapack business, and discounting this back to 2024 from 2040 results in a $120B valuation,” he said. Despite this promising outlook for the battery storage business, Narayan reiterated that autonomy remains central to Tesla’s investment case. He anticipates the launch of a new affordable model, expected to commence production in the second half of 2024 or 2025, to serve as the next catalyst for Tesla’s shares. Narayan maintained an Outperform rating and a $297 price target for Tesla stock. See Also: Everything You Need To Know About Tesla Stock Why It’s Important: Tesla’s automotive sector has faced significant pressures over the past year, with subdued EV demand and consumer caution amid economic uncertainty. Aggressive price cuts by Tesla in an attempt to gain market share further complicated matters. Piper Sandler analyst Alexander Potter highlighted the rising importance of battery-related revenue for Tesla’s overall profitability. He anticipates an increase in Tesla’s market share in global stationary battery deployments by 2024, driven by contributions from the Megafactory in Lathrop, California. Potter projected that by the 2030s, Tesla’s energy business could generate ten times the revenue expected from Cybertrucks. He suggested that over half of Tesla’s net profit growth between 2023 and 2025 could stem from the sales of stationary batteries. Tesla ended Thursday’s session down 0.08% at $201.88, according to Benzinga Pro data. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Photo courtesy: Tesla © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}