{
    "title": "How China's BYD overtook Tesla to become the world's biggest EV maker",
    "date": "1/6/2024",
    "url": "https://finance.yahoo.com/news/chinas-byd-overtook-tesla-become-160000225.html",
    "text": "“The biggest car brand you’ve never heard of.” Those are the words China’s top carmaker is using to promote itself as it looks to expand across the globe. Having become China’s best-selling auto brand at home, BYD Co. (which stands for Build Your Dreams) has now surpassed Tesla to be the world’s biggest maker of electric vehicles. In the mini-documentary \"How BYD Took Tesla’s Crown,\" above, Bloomberg Originals explores how a company that started out as a battery manufacturer transformed itself into the global king of EVs. Critical to BYD’s success has been vertical integration. Instead of relying on other companies for parts, BYD managed to crack the code of producing EVs cheaply in part by making most of its own components. The company is able to offer a wide range of affordable EVs at low prices, maximizing sales (if not revenue) while expanding its footprint in new markets. After leapfrogging the US, South Korea and Germany, China now rivals Japan for the global lead in passenger car exports. And some 1.3 million of the 3.6 million vehicles shipped from the mainland as of October were electric. In a sector still dominated by big names like Toyota, Volkswagen and General Motors, companies like BYD are beginning to make serious inroads. To be sure, BYD has had a lot of help from the Chinese government and even Warren Buffett, whose Berkshire Hathaway has been a key investor. And its aspirations aren’t limited to relegating Elon Musk and Tesla to second place. BYD is building factories in Europe, Latin America and across Asia as part of a broader effort to expand sales across these continents, and its cars and buses are popping up in cities all over the world — even in the U.S. As the world increasingly turns from combustion to electric-powered vehicles, the Chinese automaker is positioning itself to take on all comers.   You Might Also Like Hertz's Tesla liquidation sale likely means more depreciation for used EVs Elon Musk's pursuit of a 25% stake in Tesla is 'delusional,' longtime shareholder says Tesla Cybertruck tells its owner that locking differentials are 'coming soon' Related Quotes "
}