{
    "title": "Tesla Is Just a Car Company, and It's Time Wall Street Valued It as Such",
    "date": "1/26/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA-Q/pressreleases/23622396/tesla-is-just-a-car-company-and-its-time-wall-street-valued-it-as-such/",
    "text": "There are few constants on Wall Street. But one thing investors can always count on is a next-big-thing trend demanding attention. For much of the past half-decade, electric vehicles (EVs) have ranked high on the list of game-changing innovations. Although estimates vary wildly, as you'd expect from any industry-changing technology, Fortune Business Insights has penciled in a nearly 18% compound annual growth rate for the worldwide EV market through 2030. By the turn of the decade, we could be talking about nearly $1.6 trillion in annual sales. At the moment, North American EV leader Tesla(NASDAQ: TSLA) is leading the charge (pardon the necessary pun). Led by outspoken CEO Elon Musk, Tesla has introduced five mass-produced models (3, S, Y, X, and Cybertruck), and spread its wings into energy, storage, and various services, including its Supercharger network. Image source: Tesla. While Tesla is viewed by its shareholders as something of an artificial intelligence (AI), technology, and automaking company rolled into one, I'm going to show you why it's nothing more than a car company that should be valued as such by Wall Street. Before digging into what's wrong with Tesla and the lofty valuation Wall Street has bestowed on the most valuable automaker by market cap, let me start by giving the company credit where credit is due. Tesla became the first auto company in more than a half-decade to organically build itself from the ground up to mass production. That didn't happen by accident. Although it took a lot of capital, Tesla has seen its Model Y sport utility vehicle blossom into the best-selling vehicle in the world, based on the company's own preliminary data. Furthermore, Tesla has become the only pure-play EV manufacturer to generate a recurring profit, based on generally accepted accounting principles (GAAP). On Wednesday, Jan. 24, it reported its fourth consecutive year of GAAP profits. While legacy automakers are often generating sizable profits from their internal-combustion engine vehicles, their EV segments are bleeding red. I'll also add that investors appreciate the innovative capacity that Elon Musk has brought to the table. He's overseen the launch of Models 3, S, X, and Y, along with the Cybertruck, Tesla Semi, and a host of battery/storage solutions. It's fair to question if Tesla would be worth anywhere close to $661 billion without Elon Musk steering the ship. But this brings me back to the point at hand, Tesla's valuation. A roughly $661 billion market cap equates to the combined market value of many of the largest automakers. Tesla sustains this ultra-premium valuation on the basis that it's an AI-driven technology company. But dig into its operating results and history of fulfilling the promises made by Elon Musk and you'll find otherwise. For example, Tesla brought in $96.8 billion in total revenue in 2023. Only $6 billion derived from its Energy Generation and Storage segment, with an additional $8.3 billion traced back to its \"Services and other revenue.\" This means 85% of the company's revenue comes from selling and leasing EVs. As a company like Amazon(NASDAQ: AMZN) has shown, it's OK for ancillary operating segments to do the heavy lifting, with regard to operating income and cash flow. Although Amazon generates the bulk of its revenue from its online marketplace, most of its operating income and cash flow comes from its world-leading cloud infrastructure service segment, Amazon Web Services (AWS). AWS makes up just a sixth of Amazon's net sales, but has accounted for the entirety of Amazon's operating income in select quarters. However, Tesla's ancillary segments are mostly for show, at least from an operating standpoint. Though total storage deployed (in megawatt (MW)-hours) rose by 125% in 2023 from the prior-year period, solar deployed (in MW) declined by 36% from 2022. Despite Energy Generation and Storage revenue rising by 10% during the fourth quarter from the prior-year period, it was down from what was reported in the first, second, and third quarter of 2023. Furthermore, Services revenue of $2.166 billion was flat in the fourth quarter from the sequential third quarter, with a gross margin of just 2.7%. Once operating expenses are factored in, neither Energy Generation and Storage nor Services are doing much of anything to move the needle for Tesla. The Model 3 is Tesla's flagship sedan. Image source: Tesla. The painful truth for Tesla is that it's a more or less average automaker contending with mounting headwinds in a highly competitive industry. Beginning in early 2023, Tesla began slashing the selling price on Models 3, S, X, and Y. Although optimists had assumed that these price cuts were strategic and based on improving production efficiencies, Musk noted during Tesla's annual shareholder meeting in May that the company's price cuts were in response to demand. Waning demand, coupled with rising global inventory, have more than halved Tesla's operating margin since September 2022 (17.2% to 8.2%). If Tesla were producing a superior operating margin to other auto stocks, an argument could be made that it deserved a premium valuation. But most time-tested legacy automakers are generating operating margins right around 8%, give or take a percentage point in each direction. Tesla's forward price-to-earnings ratio comes in at 10 times the industry average despite delivering a run-of-the-mill operating margin. To add to the above, a substantial percentage of Tesla's pre-tax income comes from unsustainable sources. You'd expect an innovative, high-growth company to generate organic growth by selling its core product(s). In Tesla's case, I'm talking about selling EVs, and to a far lesser extent generating a profit from the ancillary segments described above. During the fourth quarter, Tesla generated $433 million in profit from selling automotive regulatory credits given to it for free by governments. It also netted $333 million in interest income from its sizable cash pile. The world's largest EV company by market cap earned 35% of its $2.191 billion in pre-tax income in the fourth quarter from selling tax credits and generating interest on its cash. That's hardly \"innovative.\" To make matters worse, Elon Musk has a terrible habit of overpromising and underdelivering on new vehicles and innovations. For instance, not only was the launch of the Cybertruck delayed, but its production ramp is expected to be slower than Tesla's other models because of the complexity of the vehicle. Other examples of failing to deliver include the now-annual promise made by Musk that Level 5 autonomy is \"one year away,\" as well as Musk's commentary in 2019 that his company would have 1 million robotaxis on the road by \"the end of next year.\" While Tesla's side projects (e.g., Optimus robots) can be fun talking points, they don't provide any tangible value to the business.  TSLA PE Ratio (Forward) data by YCharts. Most auto stocks are valued at 6 to 8 times forward-year earnings. Based on Wall Street's profit consensus for Tesla of $3.67 per share entering 2024, this would put Tesla's share price between $22 and $29 to be on-par with the auto industry. While an argument can be made that Tesla deserves a premium to traditional automakers given its first-mover advantages in the EV space, a triple-digit share price simply can't be supported given the company's operating performance and history of failing to meet production and innovation targets. It's time to face the fact that Tesla is just a car company, and Wall Street should value it as such. When our analyst team has an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.* They just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys. See the 10 stocks *Stock Advisor returns as of 1/22/2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Sean Williams has positions in Amazon. The Motley Fool has positions in and recommends Amazon and Tesla. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}