{
    "title": "Cost Woes to Offset Tesla (TSLA) Record Deliveries in Q4 Earnings?",
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/news/cost-woes-offset-tesla-tsla-150700415.html",
    "text": "Tesla TSLA is set to release fourth-quarter 2023 results on Jan 24, after the closing bell. The results will primarily center around the company’s vehicle deliveries and profit margins. While fourth-quarter deliveries set records and beat our model estimates, shrinking margins might act as a spoiler. Notably, TSLA surpassed earnings estimates in three of the trailing four quarters and missed in one, the average surprise being 3.22%. Before we delve into the factors that are set to shape its upcoming results, here’s a snapshot of its third-quarter 2023 earnings report. (Also read: Insights Into Expectations From Tesla's Q4 Earnings) Tesla snapped its 10-quarter winning streak in the third quarter of 2023. The electric vehicle (EV) titan reported earnings per share of 66 cents, which declined from the year-ago figure of $1.05 and also missed the Zacks Consensus Estimate of 72 cents. Total revenues came in at $23,350 million, witnessing year-over-year growth of 9%. The top line, however, fell short of the consensus mark of $24,381 million. Tesla’s third-quarter production totaled 430,488 units (416,800 Model 3/Y and 13,688 Model S/X), up 18% year over year and surpassing our estimate of 415,645 units. The company delivered 435,059 vehicles, reflecting a year-over-year rise of 27% and topping our estimate of 428,141 units. The Model 3/Y registered deliveries of 419,074 vehicles, marking year-over-year growth of 29% and outpacing our projection by 7,999 units. Deliveries of the Model S/X totaled 13,688 units, down 31% from the year-ago levels and below our estimate of 17,066 units. Tesla had cash/cash equivalents of $26,077 million as of Sep 30, 2023. Long-term debt and finance leases, net of the current portion, totaled $2,426 million, up from $1,597 million on Dec 31, 2022. The company generated FCF of $848 million during the reported quarter, which declined from $3,297 million generated in the year-ago period. The company reported record deliveries of 484,507 deliveries during the fourth quarter. The delivery numbers rose 19.5% and 11.4% on a yearly and sequential basis, respectively.  Additionally, it exceeded our model projection of 476,620 units. Tesla’s models 3 and Y are the company’s most successful EVs, accounting for most of its sales. For the quarter, Tesla delivered 461,538 of those, surpassing our forecast of 457,892 units. Fourth-quarter delivery performance was propelled by robust sales of the Model 3 in the United States, particularly before the phase-out of federal tax credits for specific variants under the Inflation Reduction Act. The conclusion of these tax incentives is likely to have played a role in the surge of fourth-quarter deliveries, as consumers hastened to capitalize on the advantages before their expiration. To stimulate deliveries by the end of December, the company implemented various incentives, including heightened discounts and a six-month provision of complimentary fast charging. Fueled by the delivery surge, our forecasts imply 5% year-over-year growth in automotive revenues, projecting the metric to reach $22.38 billion. Nevertheless, substantial discounts on models in the United States, China, and other regions are anticipated to exert downward pressure on its gross margins. High costs of raw materials and logistical constraints are expected to have an adverse impact on overall results. We project the cost of automotive sales to rise more than 16% to around $18 billion. We expect gross profit from automotive sales to decline 25.6% year over year. Automotive gross margin (excluding leasing) is projected at 17.9%, significantly down from 25.5% recorded in the year-ago period and 18.2% in the third quarter of 2023. Our proven model does not conclusively predict an earnings beat for Tesla as it doesn’t have the right combination of a positive Earnings ESP and a favorable Zacks Rank. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter. The company has an Earnings ESP of -1.04% and carries a Zacks Rank #2 (Buy). The Zacks Consensus Estimate for the to-be-reported quarter’s earnings is pegged at 74 cents per share, indicating a contraction of 37.8% on a year-over-year basis. The consensus mark for EPS has moved north by a penny over the past 30 days. The Zacks Consensus Estimate of $25.94 billion for sales indicates a 6.7% rise on a year-over-year basis. While an earnings beat looks uncertain for Tesla, here are a few players from the auto space, which, according to our model, have the right combination of elements to post an earnings beat for the quarter to be reported: General Motors GM will release fourth-quarter 2023 results on Jan 30. The company has an Earnings ESP of +3.47% and a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here. The Zacks Consensus Estimate for General Motors’ to-be-reported quarter’s earnings and revenues is pegged at $1.09 per share and $39.6 billion, respectively. GM surpassed earnings estimates in the trailing four quarters, with the average surprise being 23.82%. Ford F is set to report fourth-quarter 2023 results on Feb 6. The company has an Earnings ESP of +4.93% and a Zacks Rank #3 (Hold). The Zacks Consensus Estimate for Ford’s to-be-reported quarter’s earnings and automotive revenues is pegged at 12 cents per share and $36.4 billion, respectively. F surpassed earnings estimates in two of the trailing four quarters for as many misses, with the average surprise being 20.3%. BorgWarner BWA is set to report fourth-quarter 2023 results on Feb 8. The company has an Earnings ESP of +0.88% and a Zacks Rank #3. The Zacks Consensus Estimate for BorgWarner’s to-be-reported quarter’s earnings and automotive revenues is pegged at 90 cents per share and $3.6 billion, respectively. BWA surpassed earnings estimates in three of the trailing four quarters and missed in one, with the average surprise being 10.4%. Stay on top of upcoming earnings announcements with the Zacks Earnings Calendar. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Ford Motor Company (F) : Free Stock Analysis Report BorgWarner Inc. (BWA) : Free Stock Analysis Report General Motors Company (GM) : Free Stock Analysis Report Tesla, Inc. (TSLA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}