{
    "title": "Tesla's Early Investor Tim Draper of Draper Associates, Backs Citix, a \nKazakhstan-Based Smart City & Ad Tech ...",
    "date": "2/21/2024",
    "url": "https://markets.businessinsider.com/news/stocks/tesla-s-early-investor-tim-draper-of-draper-associates-backs-citix-a-kazakhstan-based-smart-city-ad-tech-technology-company-1033088003",
    "text": "ALMATY, KAZACHSTAN / ACCESSWIRE / February 21, 2024 / The investment amount was 1 million USD, at a 98 million USD valuation. Draper Associates can increase its equity share in the company further.  Mr. Tim Draper comments on the investment: \"Citix can transform cities, bringing people together for events, alerting citizens about goings on, and even provide security, Wi-fi, and additional services call from a small footprint. Citix is for smart government.\" Citix projects itself as an innovator in urban technology and states its mission as redefining public space. The company combined solutions for smart cities and Ad Tech out-of-home in a single product and introduced a smartboard to the market - the first urban gadget. The smartboard collects and analyzes external data and streams relevant content - navigation, social, entertaining, and advertising. Citix offers an ecosystem of gadgets: a transport smartboard, Tom, a pedestrian one, Jerry, and a mobile one, Shark. They operate on their own software and hardware, using blockchain technology. Smartboards are linked to a common platform, Citix Panel, to manage content remotely.  As envisioned by Citix, smartboards will become a new way of communication between the city, people, and businesses. The company has built a gadget network in Kazakhstan, grown into a local leader in the Digital Out-of-Home market, entered the markets of Turkey and MENA, and is currently developing in the USA. Tim Draper is the first US investor in Citix, known for his early investments in Tesla, Skype, SpaceX, Robinhood, and other technology projects. He took an interest in Citix during the Draper University Hero Training accelerator program. In 2023, Astana Hub, the technology park of IT startups in Central Asia, partnered with the program. The region's 15 best projects went to Silicon Valley for training, giving Citix an opportunity to work with Draper. This led to the first case of a Kazakhstan-based IT company attracting US investments. Bakhtiyar Kubessov, Citix co-founder & CBDO: \"We couldn't be more inspired by our partnership with Tim Draper, such an experienced investor. His presence not only adds extra motivation to our team but also reaffirms the significance of our mission - redefining public space. With confidence and ambition, backed by Tim, we aim to enhance public spaces for all.\" Central Asia is now being promoted in the USA as a single region. For this purpose, the Silkroad Innovation Hub was opened in San Francisco, to build connections between the region and Silicon Valley and support talent from Kazakhstan and other Turkic countries. Citix is one of the leaders of the Hub, a graduate of Google for Startups and Draper University, and a successful participant of TechCrunch Disrupt 2023 with the \"Best Speaker\" award.  Yana Shoibekova, Citix founder & CEO: \"Central Asia has something to offer to the Silicon Valley investors and the international technology market. We are sure that interest in Citix will result in investment in other promising IT projects of this region\". ### About Citix Citix is a Kazakhstan-based technology company in the field of Smart City & AdTech, which develops urban gadgets and aims to reinvent public space by unlocking the digital potential of cities. Gadgets provide useful information, making the city more informative, safe and comfortable. To learn more, visit www.citix.me. About Draper Associates  Founded in 1985 by Tim Draper, Draper Associates is the leader in early-stage venture capital that continues to invest in technology companies that show exceptional promise. The firm's investments have included Coinbase, Baidu, Tesla, Skype, SpaceX, Twitch, Hotmail, Focus Media, Robinhood, Carta, and other industry unicorns at the early stage. Draper Associates has built a reputation for encouraging entrepreneurs to drive their businesses to greatness, to transform industries with new technologies, and to build platforms for extraordinary growth, jobs and wealth creation. Send plans to plans@draper.vc. To learn more, visit www.draper.vc. PR Contacts Yelena Ogbonna y.ogbonna@citix.me +77054505829Leonid Nigmatullin l.nigmatullin@citix.me +77015292423 SOURCE: CITIX Indices Commodities Currencies Stocks "
}