{
    "title": "Tesla Stock: An Analysis Of Its Position In Artificial Intelligence \n(NASDAQ:TSLA)",
    "date": "2/13/2024",
    "url": "https://seekingalpha.com/article/4669746-tesla-an-analysis-of-its-position-in-artificial-intelligence",
    "text": " VCG/Visual China Group via Getty Images Tesla, Inc. (NASDAQ:TSLA) is seen by its supporters as more than just a car company. And CEO Elon Musk fueled this in the last earnings call where he said the following about AI and robotics: Our main goal with these AI Day things is recruiting and to sort of change the perception of Tesla as people thinking of Tesla as a car company when they should be thinking of Tesla as an AI robotics company. So, I think it's important to look at where Tesla is relative to the competition in the markets of the future. Does Tesla have a significant competitive advantage in these markets, or is it too early to tell? In my opinion, especially in the robotics market, we are at such an early stage that it is very difficult to predict how these markets will develop because there are many large companies with a lot of money and great teams working on different areas of application for their technologies. But it's always a good idea to position yourself for future growth, especially when a visionary like Elon Musk is at the helm. I strongly believe that robots will change the job market. They can perform dangerous and repetitive tasks and probably work more hours per day than humans without showing concentration problems after a while. Plus, one day they will probably be cheaper than human labor and more productive. But we are still in the very early innings of this market. Tesla once said that they could start selling robots somewhere between 2025 and 2027. And these will be the first versions that will probably have a lot of upside in terms of features and functionality. But this market is going to be tough. Almost all large companies have an interest in using robots in their factories, so they are working in-house or with partners to develop them. Amazon (AMZN), for example, has a partnership with Agility Robotics Digit, and OpenAI with 1x Technology. And in my opinion, the software side is going to be the hard part, especially if you want to build intelligent robots that can observe and analyze in real time. And this is where Tesla has an advantage, because the Tesla bot uses Tesla's ADAS, which is also used in the car models. This engine has a lot of data and is trained on real-time data every day. Boston Dynamics, now part of Hyundai Motor Company (OTCPK:HYMTF), is often the company people mention when they talk about robotics. And this is probably because of the many viral videos that most of you have probably seen on social media of their robots doing some acrobatic stunts. And when it comes to mobility and motion, Boston Dynamics probably has the most advanced technology available today. Their robot is probably faster and more maneuverable than the Tesla Bot because, unlike Tesla's EV, it uses a hydraulic engine. But this hydraulic frame also makes it more expensive and noisy, and it probably has a higher power consumption. A common criticism is that the Boston Dynamics Atlas is pre-programmed and does not adapt to new situations. And, for example, many comments refer to the Tesla Bot as an AI bot and therefore superior. But is this accurate? On their website, Boston Dynamics says this: In this iteration of parkour, the robot is adapting behaviors in its repertoire based on what it sees. This means the engineers don't need to pre-program jumping motions for all possible platforms and gaps the robot might encounter. In addition, there is the Boston Dynamics AI Institute, which also suggests that they are using AI and machine learning in their bots. But to me, Boston Dynamics is more of a research company, and they are probably not going to mass-produce their robots to sell. However, their research is likely to benefit all companies in the field. So, I do not think the comparison with Boston Dynamics is the right one. Comparisons to solutions from Amazon or Microsoft might be more appropriate in the future. I could also imagine that in the future, software will be licensed and companies will use their own robots, but buy the best software from someone else, just like you buy operating systems for computers. But we are still so incredibly early in this market that very much can happen, and I am curious to see how it develops. The beauty of Tesla is that their products have synergies and can be used in multiple areas, such as advanced driving assistance system (\"ADAS\") in full self-driving (\"FSD\") and Tesla Bot. A competitive advantage that I believe is enhanced by the use of the Dojo supercomputer. But let's take a look at the FSD landscape, how it has evolved in 2023, and what we can expect in the future. A recent study highlighted the benefits of ADAS and how they have the potential to eliminate up to 37 million accidents in the future. So, drowsiness detection systems have really come a long way in the past year, and will likely help make the roads even safer for most of us. After an accident last October, Cruise's driverless taxis were briefly prohibited from operating in San Francisco, which was definitely a setback for the industry. As a result, Cruise, a subsidiary of General Motors (GM), pulled all of its cars off the road to install software patches. In general, it seems that we are still some way off from fully self-driving cars, as most of today's options are more semi-self-driving in that they require some assistance from the driver. More and more manufacturers, such as BMW (OTCPK:BMWYY) in the 7 Series or Mercedes (OTCPK:MBGYY), offer Level 3 systems. And the Chinese automakers are getting better and better and are likely to play a big role in the future. However, the complexity of achieving Level 4 or Level 5 systems seems enormous, and with the safety of road users the primary concern, algorithms, computing power, and data must be improved to meet this goal. After all, in real time, many influences must be processed in order to make the right decision, and no mistakes can be made or injuries could result. In addition, these systems must be protected from external attacks, as cyber-attacks are a risk. The difference between Level 3 and Level 4 is that Level 3 still requires the driver to make important decisions, while Level 4 is designed to operate without driver intervention. And industry insiders go on the assumption that driverless taxis or commercial vehicles will be the first to reach Level 4. Interestingly, they also assume that cars may not have pedals and steering wheels when they reach Level 4, and that the software side is difficult because the system has to make decisions where it is not certain that the decision is the right one. They also expect that the number of sensors will double and that the camera systems will have to become even more powerful in order to reach the next level. Tesla's new FSD V12 Beta, released in January, promises quicker and more accurate decision making, and early reviews are promising. There have been improvements, but when the first full Level 4 Tesla cars that can do more than just park themselves will be released is still up in the air. Analyzing all the data that Tesla collects with the Tesla Bot and its cars is the right and obvious step in my opinion, which is why diversifying into this area makes sense for Tesla. Dojo is currently powered by a D1 chip manufactured by TSMC (TSM), perhaps the most important company in the world today. In addition, as Elon Musk answered a question at X, the H100 from Nvidia (NVDA) and the Mi300 from Advanced Micro Devices (AMD) will also be used. Both are also highly polarizing investments that are currently misunderstood or undervalued by many investors. The live collection of data from the sensors in the bots and cars, combined with machine learning, could lead to major advances in the algorithms used by Tesla. And the resulting software could be licensed, as is likely to happen soon with Tesla's FSD. So, the $300 million and $500 million investments to build two new Doja supercomputers could be well spent. With 340 FP64 flops, Dojo is the fourth fastest supercomputer in the world, and they are aiming for 100 Exa-Flops later in 2024.  Author Tesla, which was relatively overvalued in the past, has become more balanced in its valuation. Currently, the stock is pricing in a diluted EPS growth rate of 15% over the next 10 years, based on TTM diluted EPS of $4.30. Not an easy task, but one that is feasible for a company that is working in AI and robotics and sees its future in these areas. Historically, the EPS growth rate is 173% over the last 3 years, but this is also due to the fact that the company has not been profitable for a long time. We should expect a lower growth rate in the future, but I think 15% is achievable and, therefore, the company is fairly valued. If Tesla's robotics business performs as promised in recent earnings calls, one could even argue that the company is undervalued if management's predictions for the future come true. But I think there is always a bit of optimism in these forecasts, so realistically we are more in the fair range. The risks in the FSD area lie in the fact that the breakthrough to Level 4 and Level 5 will take much longer than originally expected, which is already the case in some cases, and that regulatory requirements will make it more difficult. Also, a lot can happen in the robotics market because we are still several years away from the first mass-market robots, so no one really knows how this market will develop and what will happen. There are so many possible scenarios. And with OpenAI, we saw how something developed under the public radar can turn the world upside down in a matter of weeks. Maybe a company has a big breakthrough in the robotics market and is just waiting for the right time to announce it. Tesla, Inc. is attractively positioned in the 3 areas of Robotics, FSD and Supercomputers. Therefore, I expect them to gain market share in the AI space. Especially the combination of collecting real-time data and training the algorithms on this valuable data can be very important. Other companies do not have this data and must purchase it at a high cost or obtain it elsewhere. This is a huge competitive advantage for Tesla. However, the future will show how strong and how big this advantage is, as all areas still have a lot of growth ahead of them and therefore the dynamics in these markets can change rapidly. But the second generation of the Tesla Bot, for example, has shown that the company is capable of making great advances, as this version of the Tesla Bot has much smoother movements, a higher walking speed, and a better sense of touch. But I think the competition is incredibly fierce, and I also think in all markets it is possible that the competition will have a better product in a few years. Tesla's success is not certain, either, and they have to execute accordingly. And it often happens that a company that no one expected to be at the top ends up leading the industry years later. I mean, Tesla was underestimated by a lot of people, and the same thing could happen now with other companies in the robotics or AI market. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSM either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}