{
    "title": "Elon Musk Shares New Video of Tesla’s Humanoid Robot, Optimus, Showing Its \nConfidently Walking Around",
    "date": "2/25/2024",
    "url": "https://www.latestly.com/technology/elon-musk-shares-new-video-of-teslas-humanoid-robot-optimus-showing-its-confidently-walking-around-factory-floor-5782698.html",
    "text": "New Delhi, February 25: Tech billionaire Elon Musk has shared a new video of Tesla's humanoid robot, Optimus, showing the robot confidently walking on the bustling factory floor. “Optimus strolling around the lab,” wrote Musk while sharing the video on X, where it has been viewed over 64 million times. The video has received thousands of reactions from users. \"It can't be a coincidence that the Tesla Optimus walks like Joe Biden. Is it?,\" a user wrote. \"This removes all doubt that Biden passed away some time ago and has been replaced by a robot running on Gemini AI,\" another user said. Elon Musk’s X in Talks With GenAI Program and Service Provider Midjourney for Potential Partnership: Report. Optimus Strolling Around Factory Floor  Optimus strolling around the lab pic.twitter.com/E25ttHGsF0 — Elon Musk (@elonmusk) February 24, 2024  One more user mentioned, \"Who isn’t impressed by the progress of Optimus development? Remember the 1st clumsy-walking Optimus not that long ago? The progress is insane. When do you think Optimus will be commissioned at job sites?\".\rLast month, Musk shared a video of Optimus folding a shirt, followed by a disclaimer: \"Important note: Optimus cannot yet do this autonomously, but will certainly be able to do this fully autonomously and in an arbitrary environment (won't require a fixed table with box that has only one shirt).\" Xmail: Tesla and SpaceX CEO Elon Musk Says Gmail’s Alternative Service Coming Soon. As per the company, the robot is using the same artificial intelligence (AI) software and sensors present in Tesla's advanced driver assistance system called 'Autopilot'. (The above story first appeared on LatestLY on Feb 26, 2024 09:35 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com). Optimus strolling around the lab pic.twitter.com/E25ttHGsF0 — Elon Musk (@elonmusk) February 24, 2024  One more user mentioned, \"Who isn’t impressed by the progress of Optimus development? Remember the 1st clumsy-walking Optimus not that long ago? The progress is insane. When do you think Optimus will be commissioned at job sites?\". Last month, Musk shared a video of Optimus folding a shirt, followed by a disclaimer: \"Important note: Optimus cannot yet do this autonomously, but will certainly be able to do this fully autonomously and in an arbitrary environment (won't require a fixed table with box that has only one shirt).\" Xmail: Tesla and SpaceX CEO Elon Musk Says Gmail’s Alternative Service Coming Soon. As per the company, the robot is using the same artificial intelligence (AI) software and sensors present in Tesla's advanced driver assistance system called 'Autopilot'. (The above story first appeared on LatestLY on Feb 26, 2024 09:35 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com). Copyright © Latestly.com All Rights Reserved. "
}