{
    "title": "Is Tesla Still A Magnificent 7 Stock? Berkshire Hathaway, Broadcom, Eli \nLilly Line Up As Contenders - Bro",
    "date": "2/9/2024",
    "url": "https://www.benzinga.com/news/earnings/24/02/37035036/is-tesla-still-a-magnificent-7-stock-ev-maker-could-get-bumped-by-these-companies",
    "text": "Tesla‘s TSLA standing within the Magnificent Seven is in question. What Happened: The Austin, Texas-based electric vehicle (EV) company now stands at number nine on the list of biggest companies on the S&P 500 index. Therefore, when looking at the top seven stocks on the S&P 500 index with the largest market caps, then Tesla doesn’t rank. The Elon Musk-led carmaker’s recent share price slump coincides with a dramatic drop in market cap. Back in November 2021, Tesla stock enjoyed a record of nearly $410 — putting its market cap at $1.31 trillion. It has been on a broadly downward trajectory ever since. See the chart below. Tesla’s market cap was slashed in half and now stands at $603.71 billion. The company has also been relegated from seventh to ninth on the mega-cap leaderboard. But if one were to define the Magnificent Seven as simply the seven biggest and most influential technology stocks, one could argue that other companies are more worthy of the group. Also Read: Broadcom’s Tech Dominance Affirmed by JPMorgan Analyst; Forecasts Company Will Lead AI and Cloud Revolution Let’s first look at Broadcom AVGO, a major semiconductor designer and manufacturer. It currently sits with a market cap just a couple of billion dollars below Tesla. The difference is that its shares have been on a long-term incline. Its market cap has more than doubled since the beginning of 2023. With still a month to go before it reports fourth quarter and annual earnings, consensus expectations are for $10.61 earnings per share during the October-December period, up 2.7% over the previous year, and revenues of $11.27 billion, up 26.4% on the year-ago number. But 2024 is predicted by many to be the year that artificial intelligence use cases take off and provide huge profits to the companies that supply the powerful processing gear. For the next fiscal year, Broadcom is expected to post earnings per share of $56.59 — up 19% on 2023. It’s these kinds of numbers that impress analysts such as Morgan Stanley which, this week, added Broadcom to its U.S. Focus List, initiating coverage of the stock with an Overweight rating and a $1,550 price target, indicating 22% upside from the current share price. Tech companies aside, two stocks have recently crept above Tesla as the EV maker’s shares have fallen. Berkshire Hathaway‘s BRKA class A shares alone rank the Warren Buffett investment vehicle at number seven among the biggest market caps, with the shares worth a total $861.4 billion. What can be said about this company that hasn’t already been said: an average of nearly 20% annual profit growth over an astonishing six decades, ran by one of the world’s richest men, the company is closing in on an illustrious $1 trillion market cap. The shares are a bit pricey, but there’s no shortage of exposure to Berkshire Hathaway within the exchange-traded fund (ETF) market. The iShares U.S. Financial Services ETF IYG has 15% of its holdings in Berkshire Hathaway’s B shares, but its exposure to the banking industry has made its performance a little volatile over the past year. Eli Lilly and Company‘s LLY shares have enjoyed an even better ride than Broadcom’s. Currently at record levels around $740, thanks to the spectacular success of its diabetes/anti-obesity blockbusters Mounjaro and Zepbound, its shares have doubled in less than a year and trebled since March 2022. It reported its fourth-quarter earnings earlier this week, and they were well received — the shares, after hitting a record high on the day, fell to profit-taking, but have since recovered ground. It is also liked by analysts, with Morgan Stanley and Barclays among the institutions raising their price targets on the stock — MS to $805 and Barclays to $810. It’s hard to say how Tesla might recover. Its shares have been on a long-term decline, despite the rally over 2023. Musk can be the make or break of this company, with his erratic behavior often eclipsing the company’s more newsworthy developments. The fourth-quarter numbers weren’t well received, with signs of slowing demand for electric vehicles casting an ominous shadow on future earnings growth. Tesla has been among the most shorted stocks for more than a year. So, if the current Magnificent Six are looking for a new rider to replace Tesla, one of the above could be the answer. Now Read: AI Growth, Lower Interest Rates Foil Recession Threats In 2024, Says IMF Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}