{
    "title": "Tesla Vs BYD In China",
    "date": "1/16/2024",
    "url": "https://kraneshares.com/tesla-vs-byd-in-china/",
    "text": "Krane Funds Advisors, LLC is the investment manager for KraneShares ETFs. KraneShares offers innovative investment solutions tailored to three key pillars: China, Climate, and Uncorrelated Assets. Our team is determined to provide industry-leading, differentiated, and high-conviction investment strategies that offer access to key market trends. Our mission is to empower investors with the knowledge and tools necessary to capture the importance of these themes as an essential element of a well-designed investment portfolio. March 25, 2024 – Brendan Ahern on Yahoo Finance: China’s Gradual Economic Recovery March 25, 2024 – Luke Oliver Talks Carbon Market Investing in 2024 March 21, 2024 – China Market: Geopolitics a Distraction From Improving Situation for Fundamentals, Kraneshares Says March 15, 2024 – Trump’s TikTok Flip-Flop and What It Means for Chinese Stocks View More Our semi-monthly topical research reports. Subscribe to our weekly mailing list for more. March 25, 2024 – Charging Ahead: Investing in the Energy Transition with Electrification Metals March 19, 2024 – Applying Defined Outcome Strategies Where They Count: China Internet March 11, 2024 – Top Trends Driving Global Luxury: Overview of Our Conversation with CLSA’s Chris Gao March 6, 2024 – China Market Connect February 2024: The Arrow Is Nocked, It Must Fly View More Information about KraneShares ETFs, China's markets and culture, and general investing resources. View More Our market update is a collaboration between the KraneShares internal research department, our local Chinese partners, and select China thought leaders from around the world. Our goal is to deliver a differentiated perspective on Chinese capital markets, business, government, and culture. +1 (855) 8KRANE8 [email protected] 280 Park Avenue, 32nd FloorNew York, NY 10017 +1 (212) 933-0393 1 Embarcadero Center, Suite 2350San Francisco, CA 94111 181 Queen Victoria Street London EC4V 4EG +44 203 955 5230 [email protected] [email protected] [email protected] Anthony Sassine joined Schwab Network to discuss his outlook for the electric vehicle sector and Tesla versus BYD in China. He also highlighted the KraneShares Electric Vehicles & Future Mobility ETF (Ticker: KARS) and the KraneShares CSI China Internet ETF (Ticker: KWEB). Watch more For KARS standard performance, top 10 holdings, risks, and other fund information, please click here. For KWEB standard performance, top 10 holdings, risks, and other fund information, please click here. The linked video contains Anthony Sassine's opinion. It should not be regarded as investment advice or a recommendation of specific securities. Holdings are subject to change. Securities mentioned do not make up the entire portfolio and, in the aggregate, may represent a small percentage of the fund. * Data from Bloomberg New Energy Finance as of 5/15/2020. Retrieved 9/30/2020.\n** Morgan Stanley Research. “The EV Infrastructure 55: A Diversified Way to Play a Critical Enabler in the EV Theme.” Morgan Stanley. 10/17/2017\n*** Lanctot, Roger. “Accelerating The Future: The Economic Impact of the Emerging Passenger Economy.” Strategy Analytics. June 2017. View All ©2024 Krane Funds Advisors, LLC280 Park Avenue, 32nd Floor, New York, NY 10017 Follow Us: Carefully consider the Funds’ investment objectives, risk factors, charges and expenses before investing. This and additional information can be found in the Funds’ full and summary prospectus, which may be obtained by visiting:\n\n\t\t\t\t\n\t\t\t\t\twww.kraneshares.com.\n\n\t\t\t\tRead the prospectus carefully before investing. Risk Disclosures: Investing involves risk, including possible loss of principal. There can be no assurance that a Fund will achieve its stated objectives. Indices are unmanaged and do not include the effect of fees. One cannot invest directly in an index. This information should not be relied upon as research, investment advice, or a recommendation regarding any products, strategies, or any security in particular. This material is strictly for illustrative, educational, or informational purposes and is subject to change. Certain content represents an assessment of the market environment at a specific time and is not intended to be a forecast of future events or a guarantee of future results; material is as of the dates noted and is subject to change without notice. KARS may invest in derivatives, which are often more volatile than other investments and may magnify KARS’s gains or losses. A derivative (i.e., futures/forward contracts, swaps, and options) is a contract that derives its value from the performance of an underlying asset. The primary risk of derivatives is that changes in the asset’s market value and the derivative may not be proportionate, and some derivatives can have the potential for unlimited losses. Derivatives are also subject to liquidity and counterparty risk. KARS is subject to liquidity risk, meaning that certain investments may become difficult to purchase or sell at a reasonable time and price. If a transaction for these securities is large, it may not be possible to initiate, which may cause KARS to suffer losses. Counterparty risk is the risk of loss in the event that the counterparty to an agreement fails to make required payments or otherwise comply with the terms of the derivative. The ability of KARS to achieve its respective investment objectives is dependent, in part, on the continuous availability of A Shares and the ability to obtain, if necessary, additional A Shares quota. If KARS is unable to obtain sufficient exposure to limited availability of A Share quota, KARS could seek exposure to the component securities of the Underlying Index by investment in other types of securities. KARS is subject to political, social or economic instability within China which may cause decline in value. Emerging markets involve heightened risk related to the same factors as well as increase volatility and lower trading volume. Fluctuations in currency of foreign countries may have an adverse effect to domestic currency values. Narrowly focused investments typically exhibit higher volatility. KARS’s assets are expected to be concentrated in a sector, industry, market, or group of concentrations to the extent that the Underlying Index has such concentrations. The securities or futures in that concentration could react similarly to market developments. Thus, KARS is subject to loss due to adverse occurrences that affect that concentration. In addition to the normal risks associated with investing, investments in smaller companies typically exhibit higher volatility. ETF shares are bought and sold on an exchange at market price (not NAV) and are not individually redeemed from the Fund. However, shares may be redeemed at NAV directly by certain authorized broker-dealers (Authorized Participants) in very large creation/redemption units. The returns shown do not represent the returns you would receive if you traded shares at other times. Shares may trade at a premium or discount to their NAV in the secondary market. Brokerage commissions will reduce returns. Beginning 12/23/2020, market price returns are based on the official closing price of an ETF share or, if the official closing price isn't available, the midpoint between the national best bid and national best offer (\"NBBO\") as of the time the ETF calculates the current NAV per share. Prior to that date, market price returns were based on the midpoint between the Bid and Ask price. NAVs are calculated using prices as of 4:00 PM Eastern Time. The KraneShares ETFs and KFA Funds ETFs are distributed by SEI Investments Distribution Company (SIDCO), 1 Freedom Valley Drive, Oaks, PA 19456, which is not affiliated with Krane Funds Advisors, LLC, the Investment Adviser for the Funds, or any sub-advisers for the Funds. Privacy Policy Whistleblower Policy Form ADV Fund Filings & Tax Supplements Hyperlinks on this website are provided as a convenience and we disclaim any responsibility for information, services or products found on the websites linked hereto. You are now leaving KraneShares.com. Hyperlinks on these websites are provided as a convenience and we disclaim any responsibility for information, services or products found on the websites linked hereto. This website uses cookies to help us enhance your browsing experience. By using this website you consent to our use of these cookies. To find out more about how we use cookies and how to manage them, please see our  Terms & Conditions and Privacy Policy. Accept "
}