{
    "title": "Tesla has options to consider after shock ruling on Elon Musk's \ncompensation package",
    "date": "1/31/2024",
    "url": "https://seekingalpha.com/news/4060540-tesla-has-options-to-consider-after-shock-ruling-on-elon-musks-compensation-package",
    "text": "Justin Sullivan/Getty Images News Tesla (NASDAQ:TSLA) investors have a new wildcard in the mix after a judge invalidated Elon Musk's compensation package from 2018 that could be worth as much as $55B. Wedbush Securities analyst Dan Ives called the decision of Delaware judge Kathleen McCormick shocking after investors had largely assumed the case was essentially thrown out. Ives warned that the decision now creates a tornado situation for Tesla's (TSLA) board with its next moves. Tesla's (TSLA) board can decide to appeal the decision. Or it can create a new compensation package that supersedes the contested 2018 package, and let shareholders vote on it at the next shareholder meeting. A third option, per Ives, could be to devise a new compensation package that allows Elon Musk to get to the 25% voting share he has discussed over the past few weeks. Earlier in January, Musk said he would be uncomfortable growing the electric vehicle maker into a robotics and artificial intelligence leader unless he owned at least 25% of its voting shares, nearly double his current stake. The voting control would be \"enough to be influential, but not so much that I can't be overturned,\" Musk wrote on social media platform X. \"Unless that is the case, I would prefer to build products outside of Tesla (TSLA).\" Future Fund managing partner and notable TSLA shareholder Gary Black also thinks the ruling adds more uncertainty for the EV stock, but sees a path to rework the compensation package to satisfy investors. Looking ahead, Tesla (TSLA) could make an official statement in the next few days to respond to the Delaware ruling and give an indication of the Austin-based company's strategy. Shares of Tesla (TSLA) fell 2.86% in premarket trading on Wednesday and are now down about 23% so far this year. The EV stock trades below its 100-day and 200-day moving averages, and has an average Hold rating from Wall Street analysts, Seeking Alpha analysts and Seeking Alpha's quant system. "
}