{
    "title": "How Origence Is Giving Tesla Buyers a Financial Boost",
    "date": "1/5/2024",
    "url": "https://fintechmagazine.com/financial-services-finserv/origence-tesla-credit-union-partnership",
    "text": "While range anxiety and the readiness of the charging network remain major concerns for prospective buyers of electric vehicles, many are holding back from taking the EV leap of faith for financial reasons. A recent S&P Global Mobility survey of almost 7,500 people revealed a significant proportion (48%) consider EV prices to be too high, even though they understand that most EVs inherently carry a price premium. That’s where Origence comes in. The credit union lending tech firm has formed a partnership with EV heavyweight Tesla to offer credit union financing to buyers through the Tesla site, providing those seeking affordable monthly payments with more options. Origence is leveraging its new licensed subsidiary, FI Connect, to purchase and place retail contracts with partner credit unions across the US. When a consumer finances their vehicle through FI Connect on the Tesla website, the contract will be purchased and serviced by a credit union. “Tesla is making its cars more affordable for credit union members with price adjustments,” comments Tony Boutelle, President and CEO at Origence. “With FI Connect and Tesla coming together, EV buyers can receive affordable financing through credit unions.” Established in 1994 as a credit union service organisation (CUSO), Origence has helped thousands of credit unions process more than 88 million applications, including 9 million in 2022 alone. The business provides the lending technology solutions needed by credit unions to advance their total origination experience, including indirect lending, loan and account origination, auto shopping, marketing automation, lending operations and much more. By joining forces with Tesla and making credit union financing available at the point of purchase, Origence is giving EV buyers easy access to competitive rates and extended financing terms – both of which are important factors in providing consumers with options to lower their monthly payments. Consumers shopping for Tesla vehicles are set to be provided with financing options when reserving or purchasing a Model Y, Model 3, Model X, Model S or Cybertruck vehicle through Tesla’s website or mobile app. The addition of credit union financing makes convenient point-of-sale financing available to millions of credit union members and consumers seeking low-rate financing options. Credit unions can become a FI Connect partner and expand their EV lending channels via the FI Connect website. ****** Make sure you check out the latest edition of FinTech Magazine and sign up to our global conference series – FinTech LIVE 2024. ****** FinTech Magazine is a BizClik brand. Put your brand in front of thousands of attendees at FinTech LIVE in 2024 by becoming a sponsor of one of our events… KPMG has launched its KPMG Digital Finance fintech platform and managed services solution, powered by Aptitude Software and Microsoft Azure & Dynamics… In this exclusive, Alan Irwin, VP of Product & Solutions Europe at Global Payments, discusses embedded payments and its benefits for consumers & businesses… BizClik’s FinTech portfolio connects banking, financial services, payments, technology & consulting brands and their most senior executives with the latest FinTech trends, industry insight, and influential FinTech, InsurTech & Crypto projects as the world embraces CX, Business Transformation and Digital Ecosystems.\nFinTech Magazine and its entire portfolio is now an established and trusted voice on all things FinTech, engaging with a highly targeted audience of 113,000 global executives.\nWe provide key industry players with the perfect platform to showcase their brands, develop content syndication plans, webinars, white papers, demand generation as well as a global set of events (In-Person & Virtual). "
}