{
    "title": "Tesla owner says car stopped on highway. He's done driving it.",
    "date": "1/27/2024",
    "url": "https://www.businessinsider.com/tesla-model-3-stopped-working-shut-down-while-driving-complaint-2024-1",
    "text": "       Tesla owner James Hanna said his Model 3 lurched to a stop without warning in the middle of a highway. \"The entire car locked up and I was unable to turn the wheel or even get it back into gear,\" Hanna wrote in a complaint to the National Highway Traffic Safety Administration that was viewed by Business Insider. \"I even tried to put on the hazards but the car just completely died.\" Hanna, who had owned the Tesla for just over a year when the incident occurred in September, said that the vehicle had been at 60% battery and had nearly 27,000 miles on it. He said he was driving down an interstate in North Carolina on his way to pick up his son from school when the car went haywire. Related stories The Tesla owner told Business Insider the car beeped for a few seconds but not long enough for him to pull to the side of the road before it came to a complete stop. Hanna said he'd been driving about 40 miles per hour. \"I had a panic attack,\" Hanna told BI. \"I didn't know what was going on. I was trying to figure out what to do — how to get power, or get it started again — and the whole time I'm worried about someone slamming into the back of me.\" Hanna said that when he stepped out of the car, he was no longer able to get back into the vehicle because the battery that powered the doors was no longer working. From there, he called the police and a tow truck. A Tesla service center representative told Hanna in Tesla's app that the electric carmaker \"reviewed vehicle logs, found several controllers reported the right body controller missing, which led to insufficient power being supplied to vehicle contactors, ultimately shutting down,\" according to screenshots included in Hanna's NHTSA complaint. The service center said it replaced the part that was likely causing the issue, the screenshots show. The repairs and the tow truck were covered under Tesla's warranty, but Hanna said the entire experience made him think twice about driving his Model 3. He's since started leasing out the car and has stopped driving it entirely, he told BI. \"I asked them what would stop it from happening again and the guy just told me it was bad luck,\" Hanna said. \"I can't risk my son's life on that.\" A spokesperson for Tesla did not respond to a request for comment. While it is extremely rare for a Tesla to die with a charged battery, Hanna is not the first to a report such an incident. A local news outlet in Charlotte that was the first to report on Hanna's experience said it found a dozen more complaints similar to the Tesla owner's from June 2022 to present. Last year, a Tesla blocked traffic for over 9 hours in the UK after it stopped working in the middle of a road. Read next Jump to "
}