{
    "title": "This AI Stock And Tesla Partner Tests A Buy Point",
    "date": "1/17/2024",
    "url": "https://www.investors.com/research/this-ai-stock-and-tesla-partner-tests-a-buy-point/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     Artificial intelligence (AI) stock Cadence Design Systems (CDNS) is Wednesday's selection for IBD 50 Stocks To Watch. CDNS stock tested a buy point of a flat base. Cadence's AI platform and data analytics environment are integrated and used in product design. Its technology is used to design 5G systems, aerospace and defense products, and in scalable computing, life sciences, consumer and automotive industries. Tesla partnered with Cadence to design its Full Self Driving and DOJO AI chips for car navigation and computer vision video functionality, which is used in Tesla's Cybertruck. \"Our customers like Tesla are able to leverage the power of revolutionary Cadence Cerebrus generative AI technology to optimize the quality of results of their groundbreaking AI chips and related solutions,\" said Anirudh Devgan, president and CEO of Cadence, in the company's second-quarter earnings call. Cadence announced on Jan. 8, it acquired design engineering and software company Invecas for an undisclosed amount. CDNS stock tapped the 279.32 buy point of a flat base to start the trading session Wednesday, but quickly reversed course. The AI stock jumped 3.4% on Tuesday in heavy volume, but fell short of its buy point. The stock started to rebound from the base's low on Jan. 8, as tech and software stocks rallied while Treasury yields dropped at the time. CDNS stock reclaimed its 50-day moving average and 21-day exponential moving average during the climb. Its relative strength line is starting to tick back up after bumpy, sideways action. Cadence reported better-than-expected third-quarter earnings and sales on Oct. 23. Management raised its full-year profit guidance. But analysts were looking for more and the stock fell. Third-quarter earnings growth accelerated to 19% from 10% and 13% in the prior two quarters. Meanwhile, quarterly sales growth ranged from 13% to 14% in the same time period. Analysts project 20% full-2023 EPS growth and 17% in 2024. Cadence is scheduled to release its fourth-quarter and full-year results on Feb. 12. CDNS has an IBD Accumulation/Distribution Rating of B, indicating moderate institutional buying over the last 13 weeks. It also has a 1.6 up/down volume ratio. A reading above 1.0 means there was more volume on up days over the last 50 days, and is a positive sign. Mutual funds own 58% of shares, with 3,226 owning the AI stock in December, up from 3,172 in September and 3,146 in June. Four IBD Mutual Fund Index names own shares of the AI stock, with Fidelity Contrafund (FCNTX) and MFS Growth Fund (MFEGX) adding shares in the fourth quarter. Cadence Design stock holds 96 out of 99 IBD Composite and EPS Ratings. Follow Kimberley Koenig for more stock market news on X/Twitter @IBD_KKoenig. YOU MAY ALSO LIKE: Get Free IBD Newsletters: Market Prep | Tech Report | How To Invest IBD Live: Learn And Analyze Growth Stocks With The Pros Looking For The Next Big Stock Market Winners? Start With These 3 Steps Want More IBD Insights? Subscribe To Our Investing Podcast 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}