{
    "title": "Chinese company poised to overtake Tesla as biggest EV maker on path to \nglobal leadership: report",
    "date": "1/3/2024",
    "url": "https://www.foxbusiness.com/industrials/chinese-company-poised-overtake-tesla-biggest-ev-maker-path-global-leadership-report",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Auto expert Mike Caudill argues Elon Musk's design of the Tesla Cybertruck will push potential buyers away on 'Cavuto: Coast to Coast.' Chinese electric car company BYD may overtake Tesla as the world’s biggest electric vehicle maker after it surpassed Tesla’s fourth-quarter production. Tesla produced around 484,000 units in the final quarter of 2023 – an increase of 19.5% from the same period last year – but BYD sold more than 526,000 vehicles in the same quarter. The sales account for pure EV units. When accounting for plug-in hybrids, BYD has already surpassed Tesla, Axios reported. Tesla announced sales of 1.84 million pure EV cars, while BYD has sold 1.6 million pure EV and 1.4 million hybrid EV cars. China wants to have its two biggest EV makers to generate 10% of their sales overseas by 2025 but has not indicated which companies that would include – though, analysts believe BYD must be one of those two due to production and sales volume, The South China Morning Post reported. BIDEN'S EV PUSH IS AN ‘ABSOLUTE’ AND ‘DANGEROUS’ BUST: MARC MORANO Electric carmaker Tesla CEO Elon Musk meets with French Minister for the Economy and Finances Bruno Le Maire on the sidelines of the 6th edition of the \"Choose France\" Summit at the Chateau de Versailles, outside Paris on May 15, 2023. (LUDOVIC MARIN/Pool via REUTERS / Reuters Photos) BYD also benefits from backing from Berkshire Hathaway which, as of October 2023, owns 7.98% of the manufacturer even after selling off significant amounts of its initial holding. The industry-leading investment firm owned 10.9% of the company in May 2023, even after selling off some of its holding. Some of BYD’s success came as a result of aggressive discounting programs in Europe to help boost its presence in key foreign markets. BYD dropped the price by about 8% on its Han-branded sedans, with a much smaller discount on its Dynasty series of pure and hybrid models. TOYOTA SUBSIDIARY SHUTS DOWN PRODUCTION AFTER ADMITTING TO DECADES OF SAFETY TEST ‘IRREGULARITIES’ Visitors learn about new energy vehicles of Chinese carmaker BYD during the 27th Guangdong-Hong Kong-Macao Greater Bay Area International Auto Show at the Shenzhen Convention and Exhibition Center in Shenzhen, south China's Guangdong Province, June 1 (Liang Xu/Xinhua via Getty Images / Getty Images) European Commission President Ursula von der Leyen argued that the price for vehicles remained \"artificially low\" thanks to state subsidies. Europe is the prime target for rising Chinese manufacturers. BYD plans to build a new factory in Hungary and launch sales for three more models on the continent, with plans to sell 800,000 annually in Europe alone by 2030, The Guardian reported. GM SUES SAN FRANCISCO OVER $121 MILLION TAX BILL LINKED TO CRUISE President of the European Commission Ursula von der Leyen attends the weekly meeting of the EU Commission in Berlaymont on Nov. 30, 2022 in Brussels. (Thierry Monasse/Getty Images / Getty Images) Tesla also suffered a few significant setbacks, including a recall of just over 2 million vehicles in the U.S. fitted with autopilot driver assistance to install new safeguards. The still-biggest EV automaker will not have to worry about facing competition in the U.S. from Chinese rivals as tariffs and trade restrictions remain in place, which may also contribute to the intense focus on European markets. GET FOX BUSINESS ON THE GO BY CLICKING HERE Despite its successes, BYD shares fell almost 24% in 2023, with an accelerated decline in price since mid-November due to competitive pressures, price cuts, and concerns about the company’s ability to meet sales targets, Automotive News Europe reported. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}