{
    "title": "A key Tesla metric is ‘under threat.’ Wall Street will soon learn more.",
    "date": "1/22/2024",
    "url": "https://www.marketwatch.com/story/a-key-tesla-metric-is-under-threat-wall-street-will-soon-learn-more-40edd533",
    "text": "Tesla Inc.’s price cuts have led Wall Street to lower estimates for the electric-vehicle maker’s profit, and to question its prospects. On Wednesday, investors will have a chance to see just how much the cuts have mattered in a larger context for Tesla \n        TSLA,\n        +5.73%,\n       which is scheduled to report fourth-quarter earnings then. “With the increased competition around the world, Tesla’s profit margins are definitely under threat,” said Sam Fiorani, vice president of global vehicle forecasting at AutoForecast Solutions. “Tesla needs to show excellent revenue growth and continued profit per vehicle to keep its investors happy. However, the downward trend in the stock price since Christmas hints that stockholders are not expecting overly rosy results” for the fourth quarter, he said. The EV maker got off to a rough start in 2024, cutting prices in China and disclosing plans to temporarily halt production in Germany due to the Red Sea conflict and supply-chain disruptions. One piece of good news came earlier this month, when Tesla beat Wall Street expectations for its fourth-quarter production and deliveries. Analysts polled by FactSet expect Tesla to report adjusted earnings of 73 cents a share on sales of $25.6 billion, compared with adjusted EPS of $1.19 on sales of $24.3 billion in the fourth quarter of 2022. Tesla “will likely continue to face headwinds from pricing actions … and questions of how it will support growth until its entry level/mass market vehicle arrives in late 2025/2026,” BofA Securities John Murphy said in a note Monday. Lower lithium prices, however, might benefit the company, Murphy said. Also read: The U.S. sold 1.2 million EVs last year. Why are lithium prices down almost 40%? Adam Jonas at Morgan Stanley, a known Tesla bull, on Monday dialed down his expectations on Tesla’s stock price, lowering his price target on the shares to $345 from $380. The new price target represents an upside of around 67% over Monday prices and is among the highest. The average price target on Tesla shares is  around $237, according to FactSet. Global EV momentum is stalling and the market is oversupplied relative to demand, Jonas said. “We anticipate Tesla’s 2024 outlook to be cautious on volume and profitability,” he said. Tesla shares have gained 45% in the past 12 months, compared with an advance of around 21% for the S&P 500 index \n        SPX.\n       So far this month, however, the stock is off 16%, contrasting with gains of nearly 2% for the equity index. Boeing CEO Dave Calhoun is stepping down at the end of the year, the FAA is stepping up scrutiny of United Airlines after recent safety problems, and analysts at J.P. Morgan call Super Micro Computer the leading company in the AI compute market. Claudia Assis is a San Francisco-based reporter for MarketWatch. Follow her on Twitter @ClaudiaAssisMW. Visit a quote page and your recently viewed tickers will be displayed here. "
}