{
    "title": "Tesla Declines on China Price Cuts and German Plant Shutdown",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/news/tesla-cuts-china-prices-world-013559749.html",
    "text": "(Bloomberg) -- Tesla Inc. shares dropped after the carmaker cut prices again in China and said its lone European factory will be disrupted by attacks in the Red Sea. Most Read from Bloomberg Blinken Stranded After Boeing 737 Breaks Down on Davos Trip Stocks Drop as Solid Data Fuel Fed-Pivot Repricing: Markets Wrap Apple Must Stop Selling Watches With Blood Oxygen Feature JPMorgan Says Hacker Attempts Have Increased This Year Trump Back in White House? Lagarde Says ‘Let Me Have Some Coffee’ The company reduced starting prices of the Model 3 sedan by 5.9% to 245,900 yuan ($34,300) and marked down the Model Y sport utility vehicle by 2.8% to 258,900 yuan, according to its website. Hours earlier, Tesla told Reuters it will suspend most production at its Model Y plant near Berlin from Jan. 29 to Feb. 11, as suppliers shift transport routes in response to attacks on vessels in the Red Sea. Tesla fell as much as 4.2% as of noon New York time Friday, putting the shares on course for an 11th decline in 12 sessions. The stock slumped Thursday after Hertz Global Holdings Inc. announced plans to sell off a third of its US electric-vehicle fleet. Read More: Tesla Boosts US Plant Worker Pay as UAW Momentum Builds Tesla has repeatedly cut prices in China since late 2022, leading other manufacturers to respond and squeezing profit margins industrywide. Domestic manufacturers including Xpeng Inc. and BYD Co., and leading international players like Volkswagen AG, have marked down their vehicles to defend market share. Even then, less than a third of local carmakers met their annual sales goals. Growth in China’s EV market is projected to slow for a second year in 2024 as the nation’s patchy recovery from the pandemic weighs on consumer sentiment. Shipments of battery-electric and plug-in hybrid vehicles to dealers are projected to increase 25% to 11 million units this year, the China Passenger Car Association said this week. This compares to 36% growth in 2023 and 96% in 2022. Tesla sold 1.81 million vehicles globally in 2023, with over half shipped from its Shanghai factory. While the Elon Musk-led company met its annual deliveries goal, BYD became the world’s top seller of battery-electric cars in the fourth quarter. “The gap between Chinese automakers and Tesla has been unprecedentedly small,” UBS Group AG analyst Paul Gong said at an event earlier this year, noting the pace at which Chinese companies have launched new models and focused on advanced technology. Read More: Five Things to Watch in China’s Car Market This Year Tesla revamped the six-year-old Model 3 in September and is preparing a refreshed Model Y that may come to market as soon as mid-2024, Bloomberg News reported late last month. Chinese automakers have been much more active in rolling out new models, with Guangzhou-based Xpeng launching five in 2023, and Li Auto Inc. planning a lineup of 11 models by 2025. Tesla’s German factory opened in March 2022 and has the capacity to produce 375,000 vehicles a year. The company cautioned in October that it was going to ramp up output at its plants near Berlin and in Austin gradually to keep costs contained. --With assistance from Danny Lee. (Updates share move in the fourth paragraph.) Most Read from Bloomberg Businessweek Japan’s Market Roars Back to Life—With Old-Timers Leading the Way Elon Moves Further Right; Hertz Ditches Tesla There’s a Toxic Employee—and the CEO Is Ignoring the Issue Chinese Tycoon on the Rebound After $10 Billion Debt Deal ©2024 Bloomberg L.P. Related Quotes "
}