{
    "title": "Wedbush's Dan Ives Says 'Pivotal To Make Sure Musk Stays At Tesla Through \n2030,' Urges Board To Resolve C",
    "date": "2/9/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37026033/wedbushs-dan-ives-says-pivotal-to-make-sure-musk-stays-at-tesla-through-2030-urges-board-to-reso",
    "text": "Well-known tech analyst Dan Ives has urged Tesla Inc.’s TSLA board to secure Elon Musk‘s position in the company with a new compensation package. What Happened: On Thursday, in a post on X, formerly Twitter, Ives emphasized that it was time for Tesla’s board to take action regarding the ongoing compensation dispute involving Musk. Posting a clip on X from his interview with CNBC, he suggested that Musk should be offered a new compensation package, ensuring his continued leadership role with the company, particularly in the areas of Artificial Intelligence (AI) and Full Self-Driving (FSD) through 2030. During the interview, Ives was heard stating, “Musk is the heart and lungs of Tesla. Tesla is Musk, Musk is Tesla. “ Ives also commented on Tesla moving headquarters from Delaware to Texas and Musk getting 25% of the shareholder voting rights. He noted that the Tesla board needs to take these steps in order to keep AI in-house. “It's a pivotal point to make sure that Musk stays at Tesla through 2030,” he added. See Also: Elon Musk’s 75-Year-Old Mother Says She Sleeps on ‘Mattresses Or Blankets On The Floor Or In The Garage’ Why It Matters: The call to action by Ives comes in the backdrop of a tense climate surrounding Tesla and Musk’s compensation plan. A Delaware court’s decision to nullify Musk’s $56 billion stock compensation plan has stirred up activist investors who are now pushing for significant governance changes at Tesla. This court ruling could potentially reshape Tesla's corporate governance, thereby limiting Musk's influence. These investors have been advocating for changes at Tesla's annual shareholder meetings, such as director term lengths and voting thresholds for new bylaws. However, these efforts have so far seen little success. In a recent note, Ives raised an alarm stating, “We believe the Tesla narrative is as negative we have seen in the last few years with Musk and Tesla getting attacked by the bears from all directions.” Read Next: Elon Musk Almost Sold Tesla To Google for $11 Billion — But He Called The Deal Off When He ‘No Longer Needed A Savior’ After Sales Surged Image made via pictures on Shutterstock Engineered by Benzinga Neuro, Edited by \nPooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}