{
    "title": "Musk Retaliates After Pay Deal Judgement: Neuralink Moves Legal Home To \nNevada From Delaware",
    "date": "2/11/2024",
    "url": "https://www.freepressjournal.in/business/musk-retaliates-after-pay-deal-judgement-neuralink-moves-legal-home-to-nevada-from-delaware",
    "text": "In what is seen as a retaliation against a judicial ruling from the eastern US state of Delaware, Elon Musk has decided to shunt the headquarters of his newest venture Neuralink to the largely dry (Arid) western state of Nevada, from Delaware. The Judgement That Irked Musk Earlier, a judge from the state of Delaware had thrown out his pay deal of a whopping USD 55.8 billion from his EV company, Tesla. The judge shunned the deal and the remuneration package, calling it 'unfathomable' and 'inappropriately set' . The said deal was conceived in 2018, for a period of 10 years. This judgement also meant that Musk and Tesla's board will require a reinitiation of the process of negotiation, for a new pay package. Ross Gerber, a Tesla investor claimed the company needs to replace at least three directors with independent board members before it can negotiate a new pay package. Elon Musk's Powerplay Neuralink, which has its physical headquarters in California, turned into a Nevada company on Thursday, according to state records. Delaware records also list the firm's legal home as Nevada. This is seen by some as another instance of corporations, that already have a great amount of influence in the vestibules of power in the US, further leveraging their credentials to impact changes. Delaware is also a Democratic party stronghold, as it is the incumbent president, Joe Biden's home state. The political repercussions of the move are yet to be directly determined. Neuralink Corp. is a neurotechnology company, founded by Elon Musk himself. The company develops implantable brain–computer interfaces, after getting an FDA approval in 2023, it completed it's first transplant in January 2024. This is not the first time, Musk has resorted to this 'state-shuttling', previously the EV-giant Tesla had also moved its headquarters from Palo Alto, California, another Democratic stronghold, to Austin Texas, a state, that is regarded as a Republican fortress in 2021.  "
}