{
    "title": "Elon Musk Says 10-Fold Increase In Deliveries 'Doable,' But There's A \nCatch: 'It Is An Immense Amount Of",
    "date": "2/19/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37203641/elon-musk-says-10-fold-increase-in-deliveries-doable-but-theres-a-catch-it-is-an-immense-amount-",
    "text": "Tesla, Inc. TSLA is struggling to increase sales amid an inclement economy and intense competitive pressure, and this has weighed down on the stock. Despite the headwinds, the electric-vehicle giant’s CEO Elon Musk on Monday raised the specter of the company achieving a 10-fold increase in volume. What Happened:  A Tesla influencer shared a video clip of a number of Tesla vehicles in transit in a post on X and suggested that Tesla achieving annual deliveries of 10 million to 20 million is a certainty and the only uncertainty here is regarding the timing of the company hitting the goal. Responding to the post, Musk said, “It will be a very hard climb to 10X output. Doable, but it is an immense amount of work.” See Also: Best Electric Vehicle Stocks Why It’s Important: In 2023, Tesla sold 1.809 million EVs, up 37.7% year-over-year. The annual deliveries, though meeting the company’s tempered 1.8-million-unit goal, trailed its long-term 50% growth target. The underperformance is all the more stark because a slew of price cuts did not improve demand. The multiple downward price adjustments only served to erode Tesla’s margin, which in turn impacted profitability. Also, the price reductions hurt the startup ecosystem per se, as they were forced to either match the price cuts and sink further into the red, or maintain prices unchanged and see their market share shrink. Tesla currently sells the all-electric Model Y SUV, which was the best-selling vehicle, globally in 2023, and the mass-market Model 3 sedan as well as the high-end Model S and X EVs. The company also markets the Tesla Semi Class 8 truck and the Cybertruck. Given the slow production ramp-up of the Cybertruck and its pricier nature, the newest vehicle from Tesla’s stable is unlikely to be a big volume driver in the near- to medium-term. Any hopes of achieving a significant increase in volume hinges on the affordable EV the company is currently working on. In an interview with tear-down expert Sandy Munro in early December, Musk said the company is far advanced in the manufacturing of the smaller, low-cost EV, which has been referred to as Model 2 by the media and analysts. The EV will likely be manufactured in Giga Texas and also in the upcoming factory in Mexico. Musk confirmed on the earnings call in late-January that production could start in the second-half of 2025. Tesla ended Friday’s session down 0.25% at $199.95, according to Benzinga Pro data. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Tesla Investor Questions Rationale Of EV Maker Building Up Cash At ‘Stupid Rate,’ Suggests This ‘Sensible’ Alternative Image created using artificial intelligence with MidJourney. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}