{
    "title": "The 'News' That Elon Musk Has Acquired 20.5% Of Tesla Is A 'Nothingburger' \n(NASDAQ:TSLA)",
    "date": "2/16/2024",
    "url": "https://seekingalpha.com/article/4671004-the-news-that-elon-musk-has-acquired-20-5-percent-of-tesla-is-a-nothingburger",
    "text": "albertc111/iStock via Getty Images albertc111/iStock via Getty Images The February 14 SEC filing by Tesla, Inc. (NASDAQ:TSLA) indicating CEO Elon Musk has a 20.5% stake in Tesla has been treated by some as significant news. It is not; it is a standard SEC filing which must be done periodically. In fact, in the form that was filed a year ago, it was reported that Musk had a beneficial ownership of 20.6% of Tesla stock, so the percentage actually decreased by a minor amount. There was simply no significant public commentary regarding the filing last year. The two relevant sections of the recent filing are below: Tesla 13 G/A filing as of December 31, 2023 (Tesla SEC filing)Tesla 13 G/A filing as of December 31, 2023 (Tesla SEC filing) Tesla 13 G/A filing as of December 31, 2023 (Tesla SEC filing) Tesla 13 G/A filing as of December 31, 2023 (Tesla SEC filing) Although the filing shows on multiple lines that Musk beneficially owned over 715 million shares, the figures reference Item 4-Ownership. Item 4 indicates that only 411 million shares were owned outright while the remaining 304 million shares \"beneficially owned\" simply represent the options Musk currently has the right to exercise. The ownership disclosure for December 31, 2022, shows exactly the same number of shares beneficially owned, although the shares actually owned increased by 10,500 shares and the options decreased by the same amount, which obviously must have been due to 10,500 options being exercised during the year: Tesla 13 G/A filing as of December 31, 2022 (Tesla SEC filing) Tesla 13 G/A filing as of December 31, 2022 (Tesla SEC filing) The term \"Beneficial Owner\" does not actually mean what an investor might think it means. It is defined by the SEC as follows (emphasis added): (i) A person shall be deemed to be the beneficial owner of a security, subject to the provisions of paragraph (B) of this rule, if that person has the right to acquire beneficial ownership of such security, as defined in Rule 13d-3(a) (§ 240.13d-3(a)) within sixty days, including but not limited to any right to acquire: (A) Through the exercise of any option, warrant or right; (B) through the conversion of a security; (C) pursuant to the power to revoke a trust, discretionary account, or similar arrangement; or (D) pursuant to the automatic termination of a trust, discretionary account or similar arrangement; Tesla's filings were exactly in line with this requirement. Also, as I previously stated, the number of shares \"beneficially owned\" did not change by even one share during 2023. The only reason the percentage decreased from 20.6% to 20.5% is because Tesla's total share count increased a bit during the year. As a result, this whole topic is a \"nothingburger.\" Obviously, a reason this filing received the attention this year which it didn't receive in past years is due to the recent Delaware Court ruling invalidating the 2018 option grant award. What would Tesla's filing look like if it were made as of today's date rather than prior to January's court ruling? Should Tesla have footnoted this subsequent event in its filing? As a bit of a side note, I find it interesting that, although the trial ended well over a year ago (November 2022), the ruling was only handed down a few weeks ago, two days after Tesla's 2023 10-K was filed. I wonder if the judge purposely did this to give Tesla as much time as possible to sort this issue out and make acceptable modifications to either the compensation package or the approval process prior to the next audited report needing to be filed. Depending upon the ultimate resolution, there could be some significant issues the auditor will need to address when the 2024 10-K is issued about a year from now. With the pay package having been voided by the court, there is a possibility that much of the remainder of this article could be an academic discussion. However, there is a reasonably high probability that much, if not all, of the original terms, could be reinstated via multiple possible paths. I am therefore working on this assumption in the remainder of my analysis. One of the possible paths relates to Musk's proposal to move Tesla's state of incorporation from Delaware to Texas, although the fact that this is being proposed by him rather than the chairperson of Tesla's board does reinforce the Delaware court view that the Tesla board is not the independent ultimate authority at Tesla that it is legally supposed to be. Also, Gary Black, who manages a fund that invests in Tesla and is a frequent Twitter/X poster, believes that there may simply need to be an appropriate process to reconfirm the original plan. Others have expressed similar sentiments. An issue related to this option package is Musk's desire for 25% voting control. Some investors might assume that simply means Musk would be satisfied with a mechanism that would give him an additional 4.5% voting control, whether via additional options or otherwise. It is not that simple, though. Although Musk currently beneficially owns 20.5% of Tesla stock per the filing, it is only the shares he actually owns that give him voting rights. The 411 million shares he currently owns represent less than 13% of currently outstanding shares. To reach 20.5%, he would need to exercise all his vested options and retain the underlying shares. As indicated on page 8 of Tesla's 2018 proxy statement, Musk's options are \"non-qualified\" as opposed to \"incentive stock options,\" as most option grants are these days. Tax is due at the ordinary income tax rate when exercised rather than when sold. This could potentially be quite material for Musk. The marginal federal income tax rate is 37%. In addition, there is a 3.8% net investment income tax and a 1.45% Medicare (Social Security) tax. Although Musk is now a resident of Texas, which has no state income tax, California's marginal rate is 13.3%. It is highly likely that California would make the case that the options were earned while Musk was a California resident and would expect its pound of flesh. The total tax on the gain on exercise could be as much as 55%. The options have an exercise price (cost basis) of $23.34. At the current price of about $200, close to 90% of the share value resulting from the exercise would be taxable upon exercise. This means that Musk could potentially sell 40-50% of the shares resulting from the option exercise, possibly as many as about 150 million shares. In theory, Musk could pay the income tax without selling Tesla shares. However, he does not have the liquid assets to do so and in fact has already borrowed a substantial sum against the TSLA shares he owns, so borrowing substantially more to pay the income tax does not appear to be an option for him. An additional 120 to 150 million Tesla shares dumped into the market would unquestionably have a detrimental impact on the market price of TSLA. We all saw how much TSLA stock decreased in market price in late 2022 when Musk sold a much smaller number of shares to finance the Twitter acquisition. After exercising the options and selling enough to pay the tax bill, Musk would likely have about 16-17% voting control. Would this be his starting point for his desire for 25% voting control or some other figure? Assuming the option award (or a reasonable facsimile) is ultimately certified or reapproved in some fashion, there is still the question as to its value. The only fact that was ever true about the option grant was that if it fully vested, it would allow Musk to buy 304 million shares at a bit over $23. The $56 billion figure generally quoted assumes that the market price of TSLA reaches just barely high enough to result in a total market capitalization of $650 million. If Tesla's price skyrockets before the options are exercised and the five-year holding period for them expires, the ultimate value could be a multiple of that. On the other hand, if the price decreases substantially, it could ultimately be worth a lot less. The various issues surrounding Elon Musk's Tesla, Inc. option grants have placed us in uncharted territory. These issues include not only the unprecedented size of the 2018 grant but also the fact that it has been voided. The question then becomes what will replace it. Further complicating the issue is the extremely inaccurate reporting regarding Elon Musk's current ownership position and recent changes in it, as well as Musk's expressed desire for 25% voting control. I hope I have clarified some of these issues in this article. This article was written by Analyst’s Disclosure: I/we have a beneficial short position in the shares of TSLA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I have a hedged net short position in TSLA Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}