{
    "title": "Siblings help China's BYD grab early lead in Thai EV market",
    "date": "2/27/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L4N3EU20Q:0-siblings-help-china-s-byd-grab-early-lead-in-thai-ev-market/",
    "text": "After launching BYD in Thailand as the Chinese electric vehicle maker's sole national distributor a little more than a year ago, siblings Pratarnwong and Pratarnporn Phornprapha were forced to rip up business plans frequently because sales kept rocketing. \"The numbers were just moving way faster than we anticipated,\" said Pratarnwong, CEO of Rever Group, describing demand that was so strong that they asked BYD 002594 to ramp up supply. Pratarnwong and his sister Pratarnporn, in a rare joint interview last month, detailed how Rever helped BYD build out Thailand into its biggest international market in just 15 months. By aggressively building a dealer network, adopting uniform pricing and deploying conventional but effective marketing strategies, Rever helped BYD upstage EV competitors, including Tesla TSLA and Great Wall Motor 601633, and loosened the decades-long grip of Japanese auto giants Toyota 7203 and Honda 7267 on Southeast Asia's second-biggest auto market. Rever's rapid success offers a window into the gameplan of BYD, as the world's top-selling electric vehicle maker steps up a hunt for growth outside of its mainstay but slowing China market. BYD did not respond to questions from Reuters. The Chinese automaker currently leads the Thai EV market with more than 46% share and is the third-largest player in the nation's overall passenger car market with an over 9% share, according to research firm Counterpoint. Thailand's domestic passenger car market recorded sales of around 407,000 vehicles in 2023, according to the Federation of Thai Industries. Thailand, a regional auto manufacturing hub where BYD is building a $490 million facility to produce 150,000 EVs a year, contributed a fifth to the automaker's international sales in the third quarter last year, according to Counterpoint. Scale was an important factor in Rever's playbook - it only signed on dealers that could commit a minimum of five outlets, so when demand for BYD EVs soared, the distribution network was able to expand rapidly, Pratarnwong said. Rever currently has around 100 BYD showrooms, which it plans to triple within two years. \"We were thinking 100 showrooms in probably two or three years,\" said Pratarnwong, 39. \"That was our original plan prior to our first sales.\" Pratarnwong and his sister are part of the Phornprapha family that established the Siam Motors Group (SMG), which helped develop Thailand's automotive industry as a dealer and manufacturing partner for Nissan Motor 7201. Rever, which is independent from SMG, started with an initial investment of 3 billion baht ($83 million) with the goal of pushing BYD into the top tier of Thailand's auto market within five years, they said in an August 2022 launch event. Rever has a one-price policy - introduced by Chinese car makers in Thailand - across all its outlets, among the factors that convinced Natthakul Pingclasai to convert one of his Mazda showrooms into a BYD one. The arrangement prevents \"price wars\" between dealers, helping them to secure full margins on vehicle sales, Natthakul, 32, told Reuters. \"BYD and Rever had nearly perfect timing for their market launch, coming just a few months after the introduction of subsidies that made their product very competitive,\" said Krzysztof Tokarz, manager for automotive and manufacturing at ABeam Consulting in Thailand. In early 2022, Thailand introduced its first subsidy package to help reduce prices of each EV by up to 150,000 baht ($4,160.89) to reach a government target of converting 30% total automobile production to electric by 2030. JAPANESE COMPETITORS Rever's partnership with BYD was around five years in the making. \"If you look at China, you can see probably 20-30 EV brands there. Not all of them will survive ... only big ones with a big production capacity and ability to innovate will stay,\" Pratarnwong said, outlining why he focused on BYD. To build the BYD brand, Rever's marketing plan heavily focused on old-school advertising techniques, unlike rivals such as Tesla that for years shunned traditional advertising to sell cars. \"We underestimate how much of out-of-home media actually initiates trust,\" said Rever Vice CEO Pratarnporn, 38. For instance, it strategically placed big BYD billboards in heavy traffic routes in Thai capital Bangkok and around provincial capitals in the hinterland, such as one near Thailand's border with Laos seen by a Reuters reporter last year. \"This strategy proved effective, as seeing BYD cars is now a common sight even in rural areas,\" said ABeam's Tokarz. Rever currently ploughs back between 2%-3% of revenue into marketing. With the support of government subsidies and an expanding stable of EV options, BYD is poised to gain market share against Japanese automakers, said Counterpoint senior analyst Soumen Mandal. \"However, in the longer term, as Toyota, Honda, and the Renault-Nissan Alliance introduce more EVs, BYD will face stronger competition.\" ($1 = 36.0500 baht) Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}