{
    "title": "Tesla boss Elon Musk starts to “make things good” after San Jose pie fiasco",
    "date": "2/25/2024",
    "url": "https://www.mercurynews.com/2024/02/25/tesla-elon-musk-san-jose-baker-pie-buy-sell-store-green-electric-car/",
    "text": "Today's e-Edition Get Morning Report and other email newsletters  Get Morning Report and other email newsletters Today's e-Edition Trending: SAN JOSE — Tesla has offered to reimburse thousands of dollars that a San Jose bakery lost when the electric vehicle maker abruptly canceled a huge order of mini pies without explanation, the store’s owner says. The Giving Pies, a fixture in San Jose’s Willow Glen district, has become a small-business David going up against a corporate Goliath that now appears to have shifted gears into full mea culpa mode after the tech titan’s order cancellation that left the local merchant in a financial squeeze. “I got contacted by Tesla to cater two of their events on March 5 and 7 for 1,800 pies each day, individually wrapped,”  Voahangy Rasetarinera, owner of The Giving Pies, said in an email she sent to this news organization. “They also offered to pay the $2,000 loss that I experienced because of the cancellation.” Tesla Chief Executive Officer Elon Musk entered the fray after the corporate behemoth encountered a firestorm of disdain due to the company’s cancellation of the huge order of mini pies. “Just hearing about this,” Musk stated in a tweet on Feb. 23. “Will make things good with the bakery.” At the time of the tweet, Tesla wasn’t offering any specifics as to how the company would accomplish a “make good” for the canceled order. Until now, apparently. “I was really surprised that it had reached him,” Rasetarinera said in the emailed comments, referring to the unexpected turn of events that caused the controversy to wind up on the radar screen of Musk, one of the world’s wealthiest captains of industry. Related Articles\nRestaurants, Food and Drink |  \n\n\t\t\tLivermore gets a new natural wine and tinned-fish bar, The Black Cat\t\t\n\n\nRestaurants, Food and Drink |  \n\n\t\t\tBehind the scenes at the SF Giants’ exclusive ballpark club\t\t\n\n\nRestaurants, Food and Drink |  \n\n\t\t\t‘They stole everything’: Fremont diner Skillet’z burglarized\t\t\n\n\nRestaurants, Food and Drink |  \n\n\t\t\tHumphry Slocombe arrives in Contra Costa (with boozy ice cream)\t\t\n\n\nRestaurants, Food and Drink |  \n\n\t\t\tIn-N-Out Burger’s Oakland restaurant closure, called the chain’s first, looms this weekend\t\t\n\nBut Musk, according to his tweet, did become aware of the fiasco that had embroiled both his electric vehicle company and the San Jose bakery. The next step was what action would Musk take. “He (Musk) didn’t have to get involved,” Rasetarinera said in the email. “But I understand that in the face of so much pressure, he had to put a stop to it by getting involved and showing some type of care.” The debacle began when The Giving Pies received a phone call on Feb. 14 from “Laura at Tesla” who wished to place an order for 2,000 mini pies that would be delivered the following week, Rasetarinera disclosed in a post on the bakery’s Facebook page. “Complications arose when the payment process was redirected through Tesla’s vendor, City Flavor,” Rasetarinera stated in a Facebook post. “Despite this hurdle, I remained optimistic as I awaited payment. Yet, when payment failed to materialize, I grew concerned.” Next, on Feb. 15, Laura from Tesla contacted the bakery again. Laura apologized for the mixup and promptly doubled the order to 4,000 pies. The Giving Pies staffers told Rasetarinera that they would be able to scramble to fill the dramatically increased request from Tesla. The Giving Pies sent Tesla an invoice on Feb. 16 that reflected the revised order, but soon after that, Laura texted the bakery shop owner that Tesla was going to cancel the order — yet again. “This abrupt reversal left me reeling, realizing the extent of the impact on my small business,” Rasetarinera stated in the Facebook post. “I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry. In a heartfelt message to Laura, I expressed the profound disappointment and damage inflicted on my business.” Customers, new and old, also have flocked to The Giving Pies, in person, on the phone and via the Internet to help buoy the bakery’s fortunes in the wake of Tesla’s blunders regarding the mini pie order. The deluge of demand is reflected in the bakery’s voicemail message. “Due to the overwhelming support” from customers “we are unable to answer all incoming calls,” The Giving Pies voicemail states. “Please note, if you come to the store, we might have already sold out of all of our pies.” The reaction by customers stunned Rasetarinera, she said. “I was blown away,” Rasetarinera said in her emailed comments. “It feels so overwhelming.”  Copyright © 2024 MediaNews Group "
}