{
    "title": "Elon Musk Fostered Culture Of Drug Use Among Senior Leaders At Tesla And \nSpaceX, Report Says",
    "date": "2/4/2024",
    "url": "https://www.tradingview.com/news/benzinga:76f11be48094b:0-elon-musk-fostered-culture-of-drug-use-among-senior-leaders-at-tesla-and-spacex-report-says/",
    "text": "Tesla Inc. TSLA and SpaceX CEO Elon Musk has reportedly created an environment where drug use is seemingly normalized among his business associates. Directors and board members at the companies, many of whom have significant financial stakes in Musk's companies, are said to have participated in drug use with the billionaire, according to The Wall Street Journal. This has reportedly led to a culture where declining to use drugs with Musk could result in fears of losing wealth and social standing. Also Read: Elon Musk Says You Need 2 Things To Be 'Fully Happy,' If You Lack 1 You'll Be 'Half Happy' Larry Ellison, a former director at Tesla and a prominent co-founder of Oracle, who has close friendship with Musk, advised him to consider a trip to Hawaii during the winter of 2022 for relaxation and rehabilitation from substances, according to sources cited by the publication. During a gathering in the Hollywood Hills around the same period as Ellison's recommendation, an attendee also revealed that Musk consumed ecstasy in a liquid form from a water bottle after having his personal security clear the immediate vicinity, the report noted. Following a January report by the Wall Street Journal, which detailed Musk's history with various illegal substances, Musk's response was dismissive, suggesting he saw no issue with his conduct. The implications of these allegations are particularly concerning for SpaceX, a major player in the aerospace industry with significant government contracts. Now Read: Concerns Mount As Elon Musk's Illegal Drug Use Sparks Alarm At Tesla And SpaceX This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}