{
    "title": "Short sellers lost more money betting against Tesla than any other company \nlast year",
    "date": "1/6/2024",
    "url": "https://www.cnn.com/2024/01/06/business/tesla-short-sellers-losses/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Here’s something sure to make Elon Musk smile – short sellers, those investors who placed bets that the value of Tesla shares were going to go down, lost a combined $12.2 billion last year, more than short sellers lost on any other company in 2023. That estimate, from markets analytics firm S3 Partners, isn’t a shock – Tesla shares slightly more than doubled during the course of the year. But for the shorts to take that kind of hit, there needs to be not only gains for the shares, but also a large group betting the other way. With US stock indexes ending the year near record highs – the S&P 500 rose 22% for the year - shorts had a bad year overall. S3 estimates overall short losses reached $194.8 billion. But the losses by those shorting Tesla were particularly bad – more than the losses they suffered at Microsoft and Faceboook owner Meta, combined. And Tesla, which is worth far more than any other automaker in the world – despite having sales that are a fraction of many established automakers – has long been a top target for shorts who believe the shares are overvauled. Last year, investors had an average short interest of $18.9 billion on Tesla shares, surpassed only by Apple, which has an average of $19 billion in short interest with a much larger market value than Tesla. To put the $12.2 billion in losses in context, the 6-plus week strike by the United Auto Workers union against General Motors, Ford and Stellantis cost the US economy as a whole a total of just over $10 billion, according to an estimate from Anderson Consulting Group, a Michigan think tank that tracks the cost of strikes. The losses by short sellers are a stark contrast to a year ago, when shorts made a $15.9 billion profit on Tesla shares as the company’s stock lost 65% of the value. But Tesla shares have been going up far more often then down since it went public in 2010. Since its shares started trading publicly, shorts have suffered a net loss of $61.8 billion, according to S3. “That going to leave a mark,” joked Ihor Dusaniwsky, managing director at S3, in an interview with CNN. Those shorting Tesla did even worse in the first half of the year than they did for the year as a whole, closing out $13 billion in losing short positions from January-June, but then making a $771 million profit in the final six months as Tesla shares lost about 15% of their value from their high in July through the end of the year. Even with that more recent decline, Tesla has a market capitalization of $756 billion, more than twice the value of the second most valuable automaker, Toyota. That’s despite the fact that Toyota’s global sales are more than six times greater than Tesla’s. Dusaniwsky and some analysts bullish on Tesla shares say that short sellers are waiting for Tesla to start trading far below its current valuation. “Every year the bears come out of hibernation mode and think ‘This is the year that Tesla shares collapse,” said Dan Ives, analyst with Wedbush Securities. “The bears view it as an automobile company that should trade at a valuation a multiple of GM or Toyota. The bulls such as myself believe it’s a disruptive technology company. And that’s the Wall Street consensus view.” But some critics of Tesla continue to insist that trouble could soon be catching up with its high flying share price. Analyst Gordon Johnson of GLJ Research, one of the more vocal critics of Tesla, points to a number of factors, including a smaller profit margin in the wake of a series of price cuts, excess production capacity at its factories given the current demand for its vehicles and growing competition from other automakers making EVs. His 12-month price target for Tesla shares is about $25 a share, which would be down nearly 90% from current levels. “Their fundamentals have already imploded,” he said. “That’s the reason why this is the year [Tesla’s] stock price implodes.” Beyond Tesla, short sellers are known to highlight problems with company finances and operations that has caused some to nearly go out of business. Nikola, an electric truck maker that many once saw as the “next Tesla,” was devastated by a report by Hindenberg Research, a firm that engages in short selling. Hindenberg’s report questioned Nikola’s claims about its products and its sales demand. Its founder, Trevor Milton, was forced out and recently sentenced to four years in federal prison for defrauding investors. Few if any CEOs like short interest in their company’s stock, but Tesla CEO Elon Musk hates it more than almost anyone else. He has argued that they have deliberately tried to hurt the company’s chances of success by making false claims about its prospects. And he has accused anyone critical of Tesla of doing so in an effort to help short sellers. He has suggested that the Securities and Exchange Commission, with which he has battled, should be known as the “Shortseller Enrichment Commission.” And he has mocked them by selling short shorts on the company’s web site. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}