{
    "title": "Elon Musk gives Tesla ultimatum: Another 12% of shares or no AI, robotics",
    "date": "1/16/2024",
    "url": "https://arstechnica.com/cars/2024/01/elon-musk-gives-tesla-ultimatum-another-12-of-shares-or-no-ai-robotics/",
    "text": "Front page layout Site theme Jonathan M. Gitlin\n    -    Jan 16, 2024 3:34 pm UTC Elon Musk says his ambitions to make Tesla more than just an automaker depend on him gaining far more control over the company. The controversial CEO took to his social media platform X to say that unless he is awarded another 12 percent of the company, which would give him ownership of 25 percent of Tesla, he would be \"uncomfortable growing Tesla to be a leader in AI & robotics.\" Failing that, Musk said he would \"prefer to build products outside of Tesla,\" then questioned why large institutional investors in Tesla like Fidelity \"don't show up to work,\" seemingly confused by the difference between an individual with a job and a company that owns assets. For 2022—the last year for which full financial results are available—95 percent of Tesla's revenues came from its automotive activities. Musk, who took over control of Tesla from its founders Martin Eberhardt and Marc Tarpenning a year after it was founded in 2003, has sold billions of dollars of Tesla shares in the past few years but now appears to want to reverse that trend. \"If I have 25% it means I am influential,\" he wrote, \"but can be overridden if twice as many shareholders vote against me versus for me.\" Musk then went on to say that he would like a dual-class voting structure similar to the one at Facebook that gives CEO Mark Zuckerberg control of that company but which would be an illegal restructuring post-IPO. At several investor events in the past, Musk has shown demonstrations of Tesla robotics, first with what many took to be a human being in a robot suit but more latterly with robots that appear to be actual robots. Previously, the company's main experience with robotics involved Musk's claims that the Tesla production line would be an \"alien dreadnought\" which moved too fast for the human eye to see. This pronouncement, like many of Musk's, did not come to pass—in 2018, he reversed his stance, saying that \"Humans are underrated.\" But Tesla released a demo of its latest robot iteration last month, which it showed off dancing and handling eggs. On X, Musk claimed that there was no rift between him and the Tesla board, but it's likely that investors may not be quite as copacetic. A well-sourced report from The Wall Street Journal alleges that the CEO has a worrying drug problem. The company has lost a quarter of its value over the last six months, and its once-envied profit margin making cars has shrunk during successive quarters to the industry average. Additionally, there are questions about Musk's diversion of Tesla resources and staff to work on his social media network, plus his split focus on SpaceX. Musk's previous $56 billion compensation package from Tesla is also the subject of an ongoing lawsuit in Delaware, brought by a shareholder who believes it to be excessive and a breach of fiduciary duty by Musk and his board. Other Tesla board members have to pay back $733 million to Tesla after another court case involving their own compensation by the automaker. Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox. Sign me up → CNMN Collection\n  WIRED Media Group\n  © 2024 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 1/1/20) and Privacy Policy and Cookie Statement (updated 1/1/20) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights |  Do Not Sell My Personal Information\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices "
}