{
    "title": "Hertz makes 'agile' decision to shift strategy and sell EVs, Teslas",
    "date": "1/14/2024",
    "url": "https://www.cnbc.com/2024/01/14/hertz-makes-agile-decision-to-shift-strategy-and-sell-evs-teslas.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  To learn more about the CNBC CFO Council, visit cnbccouncils.com/cfo In this article Hertz surprised many onlookers last week when the car-rental company announced it would be selling about a third of its global electric vehicle fleet, reversing course on several big bets it had placed on EVs. The move seemingly followed the rest of the auto industry, which has quickly shifted its position on EVs after years of aggressive plans and projections, with several automakers cutting production of vehicles or reducing prices as inventory has built up in recent months. In October, General Motors and Honda Motor announced that they were canceling plans to jointly develop affordable EVs in the face of slowing demand. Over the course of 2023, Tesla cut the prices of its cars across the world, aiming to reignite demand as consumer spending slowed and the EV market became even more crowded. Hertz CEO Stephen Scherr told CNBC's Jim Cramer on \"Squawk on the Street\" on Thursday that the company's move, which followed large purchase orders of Tesla and GM EVs, was \"responding to the reality, which is we're trying to bring supply in line with demand.\" \"The reality of EVs and Tesla's being the best-selling car will, at some point, render them the best rental car,\" Scherr said. \"It's not yet, so we may have been ahead of ourselves in the context of how quickly that will happen, but that will happen.\" Hertz said it would be selling about 20,000 electric vehicles. It would then use some of those proceeds to buy internal combustion engine cars. The company would also be taking a $245 million incremental net depreciation expense as a result. However, Hertz said in a regulatory filing that it expects to improve its bottom line by an amount equal to $245 million over the next two years by replacing those EVs with internal-combustion-engine cars. The company had already indicated on its third-quarter earnings call in October that it was slowing its purchase of EVs, citing MSRP declines in EVs driving down the fair market value of its cars. The company said about 11% of its entire fleet in October was EVs. On Oct. 25, 2021, Hertz first announced plans to grow its fleet of battery-electric vehicles with \"an initial order of 100,000 Teslas by the end of 2022.\" A commercial featuring repeat Super Bowl champion Tom Brady, alongside parked Tesla Model 3 electric sedans in a Hertz garage, accompanied the announcement. Wedbush analyst Dan Ives said on CNBC's \"Last Call\" on Thursday that the move to sell part of its Tesla fleet is a \"black eye for Hertz,\" adding that he believes Hertz miscalculated how its move to introduce EVs and Teslas to customers would play out from a marketing and roll-out standpoint. Part of Hertz's original thesis into investing in EVs is that customers would be eager to rent them for a variety of reasons, such as trying one for the first time, avoiding high gas prices or choosing a more environmentally friendly rental car. Scherr said that sort of experimentation was happening, but \"not happening at a level of demand that justifies us maintaining a fleet of this size at this moment in time.\" Tesla's recent decision to lower the price of its vehicles also weighed into Hertz's decision given the impact on deprecation, Scherr added. Hertz had previously set a goal to have a quarter of its fleet be EVs by the end of 2024. Scherr said taking this course instead was about financial performance and operational integrity. \"A smart company is one that's agile, makes an adjustment, takes away the distraction — financial and operational — and moves on,\" Scherr said. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}