{
    "title": "Tesla lost $141b market value in just two weeks. A ‘race to the bottom’ \nmight make matters worse",
    "date": "1/15/2024",
    "url": "https://www.smh.com.au/business/entrepreneurship/tesla-gets-a-141-billion-reality-check-as-ev-winter-sets-in-20240115-p5ex87.html",
    "text": "We’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Add articles to your saved list and come back to them any time. Tesla had a blockbuster 2023, as its shares more than doubled in 12 months. But 2024 is starting on a different note, with Elon Musk’s electric vehicle maker off to its worst start to any year — ever. The company has lost more than $US94 billion ($141 billion) in market valuation in just the first two weeks of 2024. It’s not hard to figure out why, as the Austin, Texas-based EV maker has been pounded by a barrage of negative news: an about-face on EVs from the car rental giant Hertz yet another price cut for its cars made in China, and signs of rising labour costs. Tesla CEO Elon Musk has big plans to keep the company growing in 2024. Credit: Marija Ercegovac All of this comes in the face of slowing growth in demand for EVs, especially in the US. “Investors’ main concern on Tesla is stagnating growth,” Cowen analyst Jeffrey Osborne said in an interview. The price cuts in China only fan those concerns, because it is starting to look like “a race to the bottom for the EV industry given intense competition in that market.” The hit to Tesla’s market capitalisation to start the year is the biggest the company has seen over a similar period since it went public in 2010. In percentage terms, Tesla’s 12 per cent drop since the start of January is the worst since 2016, when the stock fell 14 per cent over the first nine trading days of the year. To make matters worse, the odds of an imminent turnaround for the EV maker don’t look good. Tesla has been cutting prices on its cars aggressively since early 2023 in an effort to boost demand. But the result has been a steady erosion of its once-hefty profit margin. Tesla’s automotive gross margin ex-regulatory credits for the third quarter fell to 16.3 per cent from 27.9 per cent a year ago. And the pressure is only mounting, now that production workers at Tesla’s US plants are getting pay raises. “We are going through a cyclical downturn for EVs, but competitive dynamics are exacerbating the cyclical pressures,” said Ivana Delevska, chief investment officer at Spear Invest. “Price cuts and plummeting margins are all a function of these unfavourable competitive dynamics.” Adding to the woes, Tesla has had to re-route shipments destined for its Berlin plant after Western military actions and security concerns in the Red Sea, and is suspending most production at its plant near Berlin from January 29 to February 11, according to a person familiar with the matter. Tesla first warned about the deceleration in EV demand during its October third-quarter earnings report. Almost immediately after, automakers and suppliers across the globe chimed in with their own downbeat forecasts. Many carmakers dialled back their plans for expansion. Then, earlier this month, Tesla reported its fourth-quarter delivery numbers. While they were better than what analysts expected, they put the company behind China’s BYD Co. in global electric-car sales. The result has been a rude awakening for Tesla investors. Last year, the stock was the eighth best performer in the S&P 500. So far this year, it’s the eighth worst. Naturally, Musk is taking a big hit personally. The world’s richest person, who gained more wealth in 2023 than anyone else on the planet, has seen his net worth shrink by $US23 billion so far this year, according to the Bloomberg Billionaires Index. Musk regained the top spot on Bloomberg’s wealth index last year, overtaking Bernard Arnault, but now Jeff Bezos is rapidly closing in, with $US179 billion to Musk’s $US206 billion as of Friday’s close. The bulk of Musk’s net worth comes from his 13 per cent stake in Tesla and about 304 million exercisable stock options. He also owns about 42 per cent of SpaceX, which is valued at about $US53 billion, according to Bloomberg’s wealth index. With all that being said, Tesla remains a key player in the global transition from gas-powered vehicles to largely electric ones. The reason: It’s so far ahead of its potential rivals. China’s BYD may have surpassed Tesla in the number of units sold, but it still lags in revenue and profits. And BYD doesn’t sell cars in the US, where Tesla remains the market leader. In many ways, Tesla’s biggest problem may be its past success and the hope it generated. As investors piled into the stock, Tesla’s market capitalisation ballooned, making it way larger than any other car company in the world. However, with the shares priced for perfection, that also made them highly vulnerable to big reactions to any negative news. That’s why so many Tesla proponents argue that it shouldn’t be compared to regular car companies. To them, the ultimate true value of the company rests in the future and it’s hope to develop the first truly self-driving vehicles. The only problem is Tesla has been promising this for years, and most experts say the technology is still years, maybe even decades, away. “Tesla has not been able to deliver on fully autonomous driving and AI promises, which are already embedded in the valuation,” Spear’s Delevska said. “Being simply another automotive manufacturer is not going to cut it for a $US750 billion valuation.” Bloomberg Copyright © 2024 "
}