{
    "title": "Tesla's Q4 Results May Disappoint Investors (NASDAQ:TSLA)",
    "date": "1/17/2024",
    "url": "https://seekingalpha.com/article/4663293-tesla-q4-results-may-disappoint-investors",
    "text": "Slaven Vlasic/Getty Images Entertainment Slaven Vlasic/Getty Images Entertainment Tesla, Inc. (NASDAQ:TSLA) stock doesn't need much introduction here on Seeking Alpha or elsewhere: I can't think of an investor/analyst I know who doesn't have an opinion on this stock. As a rule, opinions on TSLA's future vary widely. It's always been this way: first skeptics questioned the electric vehicle (\"EV\") trend itself; then, as EV adoption became a globally spread reality, those same skeptics began questioning the company's margins, saying Tesla couldn't sustain them at already high levels for long. But the company has proven to the market and all the skeptics time and time again that it can handle a lot. But unfortunately, nothing lasts forever. Since April 2023, I've been one of the same skeptics questioning Tesla's medium-term future. Early in 2023, I was proven wrong after I made my first downgrade. Over time, however, my sell calls proved to be reasonable: since June 2023, TSLA stock is down ~20% while the S&P 500 Index (SP500) is up 9%, and since my last bearish call, the stock is down 0.55% while the broad market is up 11.82%: Seeking Alpha, my coverage of TSLA stock Seeking Alpha, my coverage of TSLA stock And I have reason to believe that Tesla's upcoming Q4 results schedule for post-market on January 24th and earnings commentary may disappoint investors and the downward trend of its stock price will continue. What we already know is that in the fourth quarter of 2023, Tesla had strong delivery volumes (484,507), producing 494,989 vehicles, a 13% increase YoY and a 15% increase QoQ. The total deliveries for the year reached 1,808,581 vehicles, surpassing the company's previous guidance of ~1.8 million. These are definitely strong results that cannot be disputed. But why did TSLA's stock price drop ~13% after the announcement? I assume that institutional investors began to reduce their long positions as they saw in Tesla's strong deliveries numbers the so-called \"pull-forward\" effect that occurs when consumers accelerate their planned purchases to take advantage of certain benefits before they expire. In this case, the increase in demand is linked to the impending expiration of EV subsidies in the United States, Germany, and France. Google SearchGoogle SearchGoogle Search Google Search Google Search Google Search Tesla's Model 3 SR (Standard Range) and LR (Long Range) trims in the U.S. are expected to lose the full $7,500 IRA credit at the year-end based on new IRA guidance. Tesla emphasized that deliveries must be completed by December 31 to guarantee the full credit (hence the jump in deliveries). This announcement represents an increase from the previously expected loss of $3,750, and it's noteworthy that the LR, which shifted to nickel-based batteries from LG sourced from China earlier in the year, is now also losing eligibility. Last calendar quarter, Tesla continued to focus on pricing strategies, implementing slight increases in China (+0.66%) and a rise in Model 3 Highland pricing outside North America. However, overall prices were reduced during this period. After initial 3-4% price cuts across Model 3/Y trims in the U.S. in early October, Tesla reintroduced discounts to inventory vehicles in mid-November. The entire quarter's sales of Model S/X at new lower average selling prices (ASP) post a mid-August price cut will pose a challenge for Q1 FY2024 sales numbers (and likely EPS, too), in my view. Additionally, there were incremental discounts on certain inventory vehicles in Europe and other soft discounts, such as six months of free supercharging in the U.S. and insurance subsidies in China. I have no doubt that demand on the market leaves a lot to be desired at the moment - otherwise, the company would not be cutting its sales prices so often and so sharply. Also, I infer from Elon Musk's answer at the Q3 earnings call regarding the expansion in Berlin and Austin that Tesla really doesn't see a pickup in demand yet (otherwise Musk's answer might sound more ambitious and promising, it seems to me): Analyst: Could you please provide an update on capacity expansion plans for company's factories in Berlin and Austin, and the opening schedule of Gigafactory Mexico? Elon Musk: Berlin and Austin factories, the current priority is actually maximize the output from our existing lines, by laser focus on efficiency improvement. As always, maintaining a high quality and the reducing per unit cost will be as critical as growing the production volume Source: TSLA's Q3 earnings call, author's emphasis added. In 2023, the EV market saw about 40-50 new models from different brands, so competition has become Tesla's biggest challenge for growth. As a result, by the end of the year, Tesla was among the underdogs in terms of market share dynamics ex-China: BofA Auto team's research [December 2023, proprietary source] BofA Auto team's research [December 2023, proprietary source] Market share in China has grown, but the company's share of this market is 22%, so growth in this market looks like a consolation prize. What puzzles me most is the market's reaction to the strong Q4 delivery numbers: Wall Street actually slightly raised its expectations for Q4 earnings after the release of those numbers, and the drop in all quarters FY2024 EPS estimates is too small, in my opinion, to account for all the risks that exist. Seeking Alpha, author's notes Seeking Alpha, author's notes Furthermore, no matter how one tries to justify it, I think the valuation of TSLA is still too high. Given the events in the auto industry (and idiosyncrasies) that I described above, I see no logical explanation for the consensus view that has developed regarding EBITDA growth over the next two years. In my opinion, it is very unlikely that Tesla will have two consecutive years of EBITDA growth in excess of 43% as shown below: YCharts, author's notes YCharts, author's notes And even if this happens, the implied FWD EV/EBITDA will still be above 30x - that's too much against the backdrop of the company's declining business growth we have seen in recent quarters. Data by YCharts Therefore, I do not expect the Q4 figures to be a disaster in terms of YoY or QoQ momentum: the published delivery figures point directly to a potentially strong last quarter of 2023. Nevertheless, I expect rather pessimistic guidance and comments from management for the reasons described above. If I am right, the value of the company should be revised downwards. I understand very well the thesis of the bulls who say that Tesla is not just a car company. Yes, it really isn't just a car company. Its business diversification is amazing, and the prospects of each niche are really intriguing. But Tesla manufactures and sells cars first and foremost, and then everything else. Therefore, TSLA is subject to cyclicality, which is clearly not on the side of bulls now. But the presence of other, faster-growing businesses poses some risks to my Sell thesis, and I'll admit that. Despite this upside risk, however, I expect the company's guidance for FY2024 as a whole to be fairly weak - perhaps significantly weaker than the consensus numbers are currently pricing in. In the medium term, the company does not look like a safe \"Buy.\" This is why I reiterate my sell recommendation a week before the Q4 report is released, but I want to be proven wrong if you're holding TSLA stock today. Thanks for reading! Now you can get access to the latest and highest-quality analysis of recent Wall Street buying and selling ideas with just one subscription to Beyond the Wall Investing! There is a free trial and a special discount of 10% for you. Join us today! This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}