{
    "title": "'Apple of China' starts new venture with bold aspirations to take down \nTesla: 'Starting late has its advantages'",
    "date": "2/21/2024",
    "url": "https://www.thecooldown.com/green-business/xiaomi-electric-car-tesla-ev-china/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. A huge company with a track record of success joining the EV race is a sign that the automotive industry is heading in the right direction. Photo Credit: Xiaomi Tesla may soon have some more competition in the electric vehicle market. Not that there aren't already plenty of other car manufacturers producing EVs, but so far, very few have been able to actually compete with Tesla. Chinese smartphone giant Xiaomi, sometimes referred to as \"Apple of China,\" is looking to change that. At an event in Beijing late last year, Xiaomi unveiled the SU7, its first electric car, and declared its intention to rival Tesla and become a top automaker within 15 to 20 years, as Electrek reported. One Xiaomi co-founder, billionaire Lei Jun, said the company plans to invest $10 billion to \"shake up the industry.\" The unveiling came just weeks before Tesla CEO Elon Musk praised Chinese car companies on a sales call and spoke of their ability to compete globally. This isn't the company's first time taking on an industry with established leaders. By 2013, just three years after launching, Xiaomi had sold 20 million smartphones, according to The Verge. The company is now one of the world's largest smartphone manufacturers. It also makes e-bikes and scooters, as well as other electronics, per Electrek. The SU7 will reportedly have intelligent driving features similar to those in the Tesla Model S. Despite multiple attempts, Tesla has struggled to perfect full self-driving, but Lei believes the technology Tesla has achieved so far will help Xiaomi develop its own. \"Self-driving technologies are changing very fast, and starting late has its advantages,\" Lei said, per Quartz. \"It means we can work from a higher threshold and build from there.\" It will have battery cells made by CATL, one of the world's largest EV battery manufacturers, that will give it a range of roughly 500 miles, per Electrek. The batteries will be made by CATL and BYD, the largest EV manufacturer in China by far and one of the largest EV manufacturers in the world. While another EV manufacturer joining the market with ambitions of competing with Tesla may not be good for other manufacturers, a huge company with a track record of success joining that race is a sign that the automotive industry is heading in the right direction. EV sales have continued to increase by large margins every year in the United States and China, which will only work to reduce the amount of harmful pollution released into the atmosphere by internal combustion vehicles. Although Lei said the goal is to compete with Tesla, Quartz noted that he stated in a lengthy post on X, formerly known as Twitter, \"The Xiaomi SU7 isn't built to chase any specific competitor.\" Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}