{
    "title": "Tesla CEO Elon Musk Renews Call For Companies To Exit Delaware Before 'They \nLock The Doors, As They Just",
    "date": "2/13/2024",
    "url": "https://www.benzinga.com/news/24/02/37086829/tesla-ceo-elon-musk-renews-call-for-companies-to-exit-delaware-before-they-lock-the-doors-as-they-ju",
    "text": "Tesla CEO Elon Musk is still smarting from the legal fallout that overturned his massive 2018 compensation plan, and on Monday, he expressed his frustration by urging companies to relocate out of Delaware. What Happened: Reacting to CNBC’s interview with former SEC Chair Jay Clayton on the matter, Musk stated, “Move your company out of Delaware before they lock the doors, as they just did with Tripadvisor.” Clayton mentioned that Tesla’s board is likely to appeal the decision of the Delaware Chancery Court. When asked if the ruling might prompt other companies to leave the state, Clayton pondered whether a flawed process could nullify a sound substance, assuming the original substance of the decision was sound. “If the Supreme Court of Delaware confirms the substance was sound and the process flawed, then that’s acceptable,” he remarked. Regarding Tesla’s shareholder vote on the pay plan, Clayton noted that although it was an exceptional and disproportionate package, shareholders reaped the benefits of the significant rise in the stock price. “Where are you gonna go? Validate the decision and then find some way to post hoc compensate which is going to be anywhere close. Are you gonna say, look, terrible process? This is not a board that’s functioning the way it should but on balance, the substance of the decision was right,” he said. See Also: Everything You Need To Know About Tesla Stock Why It’s Important: Online travel company TripAdvisor TRIP, referenced by Musk, sought shareholder approval to move its incorporation to Nevada last year. Despite two-thirds of shareholders supporting the move, the plan was thwarted when two minority shareholders sued the company in Delaware, according to a Wall Street Journal report. The Delaware court ruled in favor of the minority shareholders, asserting that excluding the votes of Greg Maffei, the company’s chairman, resulted in only 5.4% support for reincorporation. Maffei, holding 56% of the vote at Tripadvisor, primarily through supervoting shares, wielded significant influence. TripAdvisor’s parent company, Liberty TripAdvisor Holdings LTRPA LTRPB, faced a similar dilemma. The rationale behind TripAdvisor’s filing argued that relocating to Nevada would yield tax savings of $250,000 annually, reduce legal expenses, and “potentially greater protection from unmeritorious litigation for directors and officers.” Unlike Delaware, known for imposing stricter standards on companies pursuing transactions favoring a controlling shareholder, Nevada reportedly provides broad protections for directors and officers in many scenarios. Musk recently transferred the incorporation of his brain chip implant company, Neuralink, from Delaware to Nevada. Read Next: ‘Were There Any Half-Decent Ads?’ Asks Elon Musk While Tesla Bull Calls EV Giant’s No-Show At Super Bowl ‘Short-Term Thinking’ Image via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}