{
    "title": "Tesla bull argues for $7M Super Bowl ad instead of $1k Model Y price cut",
    "date": "2/11/2024",
    "url": "https://www.teslarati.com/tesla-bull-7m-super-bowl-ad-instead-1k-model-y-price-cut/",
    "text": "There were a number of notable events that transpired in the electric vehicle sector in the past few days. Tesla rolled out a minor $1,000 limited-time discount for the Model Y crossover until the end of February. And this Sunday, BMW, Volkswagen, and KIA aired their respective advertisements for the BMW i5, VW ID.Buzz, and the KIA EV9 at Super Bowl LVIII. The Super Bowl is the United States’ biggest sporting event, reaching nearly 100 million people every year since Super Bowl 44 in 2010, as per ratings agency Nielsen. It is then no surprise that ad spots for the premier sporting event are sold at a premium, with Automotive News noting that a 30-second advertisement for this year’s Super Bowl costs about $7 million on average. Now, $7 million is definitely not a small amount, but it does help a company reach 100 million people. That’s invaluable, and likely well worth it for automakers looking to highlight their electric vehicle offerings. This was evident in BMW’s star-studded ad with actor Christopher Walken, Volkswagen’s nostalgic advertisement for the ID.Buzz, and KIA’s heartwarming commercial for the EV9. And as per Wall Street veteran and Tesla bull Gary Black, Tesla could have easily benefitted from a Super Bowl ad this year. At $7M for a 30 second Super Bowl ad, $TSLA would have to sell 875 incremental cars (@$8k gross profit per car) to justify the cost of the ad. And the follow up interest from TSLA paying for a Super Bowl ad would be huge. Instead $TSLA cuts price by $1,000 per Model Y in the US… https://t.co/ZrqxUpRCcB As explained by Black in a post on X, the social media platform formerly known as Twitter, a $7 million Super Bowl ad for Tesla would result in massive follow-up interest in the electric vehicle maker. Black also highlighted that at $7 million, Tesla would only have to sell 875 incremental cars at $8,000 gross profit per unit to justify the cost of a 30-second Super Bowl advertisement. In comparison, Tesla’s $1,000 discount for the Model Y, which is generally unknown to conventional car buyers outside X and the EV community, will cost Tesla about $40 million, Black estimated. What’s worse is that avid Tesla critic Dan O’Dowd, who is on a crusade to ban Full Self-Driving on public roads, is paying for two Super Bowl ads. Thus, not only will Super Bowl viewers not see an ad supporting Tesla during the premier sporting event. They will instead see two ads encouraging them to boycott the company’s products. Do you think @Tesla spending $7 million on a 30 second Super Bowl ad would be a good investment for the company?Explain your reasoning below. What is interesting is that Tesla has a ton of advertisements that could have worked for the Super Bowl as well. Tesla’s Cybertruck commercials alone would be very interesting, such as the company’s 60-second “all-features” ad or the vehicle’s dedicated Basecamp advertisement. One could even argue that some fan-made Tesla commercials that have been created by enthusiasts over the years are good enough for such an event. It was thus unsurprising that numerous EV fans and TSLA investors supported Black’s suggestion. After all, a good number of car buyers are still very unfamiliar with Tesla’s vehicles, such as the fact that they start below $40,000, that they are the safest cars on the road, or that they are the most American-made, among others. This was quite evident in a poll that was posted on X which asked users if Tesla would benefit from a Super Bowl ad. While those who support and those who do not support the idea are pretty much equal, one cannot deny the fact that the voices calling for Tesla to advertise are getting notably louder. Check out BMW, Volkswagen, and KIA’s EV ads for Super Bowl LVIII below. Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... Tesla Summon and Autopark are set to gain major improvements next month, according to... Tesla appears to be ready to roll out wireless EV charging, according to the... Hertz CEO Stephen Scherr has decided to step down following the rental firm’s big... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Copyright © TESLARATI. All rights reserved. "
}