{
    "title": "Elon Musk says Rivian needs to ‘cut costs massively’ and its execs should \n‘live in the factory’ for the struggling Tesla rival to survive",
    "date": "2/22/2024",
    "url": "https://fortune.com/2024/02/22/elon-musk-tesla-evs-rival-rivian-will-die-without-massive-cost-cuts/",
    "text": "Elon Musk is not surprised by the bad news hitting Tesla rival Rivian. He’s been warning about it for some time. On Wednesday, Rivian announced a disappointing quarter and outlook and said it would cut its salaried workforce by roughly 10%. Shortly after, Musk wrote on X that the rival maker of electric vehicles would go bankrupt in about six quarters on the current trajectory, adding, “Maybe that trajectory will change, but so far it hasn’t. “They need to cut costs massively, and the exec team needs to live in the factory or they will die,” he wrote. Musk, having gone through “production hell” and “sleeping at the factory” himself at Tesla, should know. The billionaire has warned about Rivian’s challenges before. In June 2022, he said his advice for the company would be “to cut costs immediately across the board dramatically or they’re doomed.” Read more: Apple buying Rivian? Nissan with Fisker? Tesla rivals’ woes spark speculation as EV growth slows After markets opened on Thursday, Rivian shares fell by as much as 26%, their biggest drop and lowest level since the company went public in 2021. Rivian CEO RJ Scaringe pointed to high interest rates as one of the EV maker’s key challenges, something Musk has described as hampering Tesla as well. “Our business is not immune to existing economic and geopolitical uncertainties, most notably the impact of historically high interest rates, which has negatively impacted demand,” Scaringe said on an earnings call. That’s not the only challenge. Sales growth of EVs, while still strong, has recently slowed, spurring Ford and GM to pare back their production plans. This is partly because early EV enthusiasts have already bought their vehicles, and regular car shoppers are more likely to be turned off by the higher prices, range anxiety, and poor resale value associated with EVs, among other concerns. Tesla, in a call with investors, warned of “notably lower” sales growth this year after a disappointing fourth quarter. Musk said his EV maker is “between two major growth waves” as it aims to start production of a more affordable model late next year. Meanwhile Toyota, the world’s top carmaker for four years running, and other legacy automakers are enjoying surging sales of hybrid vehicles, which many car buyers see as a more practical alternative to EVs. On March 7, Rivian will unveil its R2, a midsize SUV that will take on Tesla’s popular Model Y and be priced at around $50,000. The model will be smaller and cheaper than what Rivian has offered so far. “There is a lack of choice of highly compelling EV products in that $45,000 to $55,000 price range, recognizing the average price of a new vehicle transaction was around $48,000,” Scaringe said. “We remain very bullish on the R2 segment and the R2 product itself.” But the R2 is expected to launch in 2026. Asked on CNBC whether a capital raise would be required to get to R2 production, Scaringe replied, “We are very confident in the capital we have supporting operations through the end of 2025.” He added the company is “driving efficiency into everything we do” and expected a fourth-quarter gross profit later this year. But Rivian has a long way to go. It accounted for 4.2% of EV sales in the fourth quarter last year, compared with Tesla at 55.1%, according to Kelley Blue Book estimates. The Tesla Model Y alone had 33.2% of the market. And Tesla itself, of course, was recently topped in global EV sales by China’s BYD, chief among the Chinese EV makers striking fear into legacy automakers with their low production costs and rapidly expanding exports. Musk, in another post following Rivian’s earnings call, wrote: “Their product design is not bad, but the actual hard part of making a car company work is achieving volume production with positive cash flow.” Read more: The BYD of Vietnam just reported a huge loss for 2023—a whopping $2.4 billion © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}