{
    "title": "Cathie Wood Buys Tesla Stock, Unloads COIN Shares Amid Market Turbulence",
    "date": "1/4/2024",
    "url": "https://www.investors.com/news/cathie-wood-buys-tesla-stock-unloads-coin-shares-amid-market-turbulence/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     Cathie Wood and her Ark Invest purchased TSLA stock for the first time since in 2024, picking up more than 100,000 shares Wednesday as Tesla (TSLA) stock tumbled 4%. Meanwhile, as bitcoin and crypto stocks came under pressure Wednesday, Wood also decided to sell shares of Coinbase (COIN). Cathie Wood's Ark Investment Management bought 105,201 Tesla shares Wednesday, according to the company's daily trade disclosure. Based on the closing price of 238.45, Wood spent $25.09 million on the Tesla purchases. Wood's Tesla trades were done through the ARK Innovation ETF (ARKK) and ARK Next Generation Internet (ARKW). Wood also pulled the trigger on cryptocurrency exchange Coinbase, selling 166,135 shares for around $25.29 million based on COIN stock's Wednesday's close. As of Jan. 4, COIN ranks first in ARKK with a 10.22% weight with TSLA second with a 7.96% weight. Meanwhile, COIN also is the top holding in ARKW, with a 10.48% weight. Tesla stock is the sixth ranked holding in ARKW, with a 5.27% weight. Tesla stock pared early gains, edging down nearly 0.2% to 238.05 while COIN advanced 2.2% to 155.63 Thursday during market action. On Wednesday, TSLA dropped 4% to 238.45 while Coinbase declined nearly 3% to 152.24. Crypto stocks broadly angled lower Wednesday as the market awaits spot bitcoin ETF approvals by federal regulators, which could reportedly come as soon as Friday. Bitcoin, which fell solidly Wednesday from 20-month highs, rose slightly Thursday. The relative strength line for TSLA is off short-term lows in October but still in a downtrend since July. Tesla stock sank after the EV giant reported worse-than-expected Q3 earnings and revenue on Oct. 18. However, Tesla stock is building the right side of a double-bottom base giving it a 278.98 buy point, according to MarketSmith analysis. Tesla stock does have a 265.13 entry from a weekly handle, which now has some depth. That handle could be proper on a daily chart after Thursday. In 2023, Tesla doubled, easily outperforming the broader S&P 500 index. Tesla stock ranks fifth in the 35 member IBD Auto Manufacturers industry group. The Cathie Wood stock has a 78 Composite Rating out of a best-possible 99. The stock also has an 85 Relative Strength Rating and an 88 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla Stock A Buy Or A Sell? Stocks Near A Buy Zone Learning How To Pick Great Stocks? Read Investor's Corner Is Rivian A Buy Right Now After The Cybertruck Delivery Event? Bulls, Bears Duel Ahead Of Jobs Data; 6 Stocks To Watch 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}