{
    "title": "Is It Time To Buy Tesla Stock After Thursday's Bloodbath? Here's What One \nLong-term Technical Chart Says.",
    "date": "1/28/2024",
    "url": "https://www.benzinga.com/markets/equities/24/01/36817515/is-it-time-to-buy-tesla-stock-after-thursdays-bloodbath-heres-what-one-long-term-technical-chart",
    "text": "Tesla, Inc. TSLA shares fell sharply on Thursday following the release of the company’s fourth-quarter results and made a marginal recovery on Friday.  With the stock trading in the oversold zone, is it attractive at current levels? What Happened: Tesla settled Thursday’s session down 12.13% at $182.63, according to Benzinga Pro data. This marked the lowest level since May 25, 2022. The stock rebounded by 0.34% on Friday before ending at $183.25. The 14-day relative-strength index of the stock is currently in an area suggesting oversold levels. Chart Courtesy of Benzinga See Also: Everything You Need To Know About Tesla Stock A post on Stocktwits showed that despite the pullback, Tesla’s stock has continued on a long-term upward trending line. According to the chart, which traces back to the start of 2020, every time the stock crashed, formed a long-tailed candle and hit this trendline, it has bounced back with vigor. A long-tailed candle suggests rejection of lower prices. Why It’s Important: Tesla faces a near-term deceleration without any meaningful catalysts, although vehicle price cuts and increases may create occasional flutter. First-quarter deliveries due in early April — or any update regarding the company’s next-gen electric vehicle, the timeline of the Giga Mexico factory or a launch in India — could move the stock in the near term. Following the fourth-quarter earnings release, analysts have dropped their estimates for the company and price targets for the stock. Despite the downward price target adjustments, the average analysts’ price target of $222.36, based on data compiled by TipRanks, suggests upside potential of over 21%. Read Next: Tesla Alienates Investors With Sketchy Near-term Outlook, Rivian’s Rumored R2 Global Premiere, Canoo On A Roll: Biggest EV Stories Of The Week Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}