{
    "title": "Pharrell Williams didn't get lucky parking Tesla's Cybertruck",
    "date": "1/6/2024",
    "url": "https://www.businessinsider.com/pharrell-williams-parking-tesla-cybertruck-miami-2024-1",
    "text": "       The internet jokesters are calling it \"Pharrellel parking.\" Pharrell Williams is the latest public figure to be seen with the new Tesla Cybertruck, which was released in November to a small group of customers. Related stories This week, the influential record producer and musician was spotted attempting to parallel park the vehicle outside a Louis Vuitton store in Miami. And in a situation that might feel familiar to many drivers, he ended up dangerously close to crunching another car. According to Roxana Gonzalez, the woman who captured his parking skills, Williams — who's also the creative director for Louis Vuitton — tried for 10 minutes to get the car into the space before abandoning the effort and letting the valet handle it. \"That truck was never going to fit,\" Gonzalez told Business Insider. The photo below is his reaction to how close he got to the red car behind the truck. The Cybertruck went out to the first group of owners on November 30, 2023. For size comparison, it's slightly less than 19 feet long and about 80 inches wide, shorter and more narrow than Ford's F-150 Lighting, though much larger than, for example, a Toyota Prius. The cheapest Cybertruck model costs $60,990, while the all-wheel drive option costs $79,990, and the \"Cyberbeast\" option costs $99,990. Tesla had originally not wanted to add side mirrors to the Cybertruck, seeking to keep the design as streamlined and angular as possible. Elon Musk had said that drivers could rely on side-mounted cameras. However, US regulators said drivers aren't ready to rely solely on those just yet and required Tesla to add mirrors. The futuristic vehicle has attracted a few famous drivers. While Williams wasn't among the owners who rolled away in it in November, Alexis Ohanian, cofounder of Reddit, was seen getting into a brand new Cybertruck then. Ohanian said the truck is the \"first car that really feels comfortable to me\" as a tall person. Meanwhile, an automobile competitor used Williams' parking snafu as an excuse to market its own brand. Underneath an Instagram post of pictures of the incident, Mercedes-Benz commented: \"Our Active Parking Assist can help with that 😏,\" the official Mercedes account commented. Read next Jump to "
}