{
    "title": "Judge strikes down Elon Musk’s massive Tesla pay package",
    "date": "1/30/2024",
    "url": "https://www.mercurynews.com/2024/01/30/judge-strikes-down-musks-massive-tesla-pay-package/",
    "text": "Today's e-Edition Get Morning Report and other email newsletters  Get Morning Report and other email newsletters Today's e-Edition Trending: By Chris Isidore | CNN A Delaware state court judge has thrown out the 2018 pay package that helped to make Tesla CEO Elon Musk one of the richest people in the world. Delaware Chancery Court Chancellor Kathaleen McCormick, who oversaw the bench trial that concluded in November 2022, ruled Tuesday that Musk and the Tesla board “bore the burden of proving that the compensation plan was fair, and they failed to meet their burden.” The 303 million split-adjusted stock options that Musk had received as part of the package are worth $51 billion today, when calculated using Tuesday’s closing price, less the modest exercise price of $23.34 a share. The case was argued in Delaware, where Tesla and many other major US corporations are incorporated. While Musk did not have an immediate comment on the decision, he did tweet Tuesday, “Never incorporate your company in the state of Delaware.” Attorneys for the shareholders who brought the suit had argued that the package of stock options was excessive and that the directors on Tesla’s board were not truly independent and were too close to Musk to protect shareholders’ interests. They also argued that the financial targets the company had to hit for Musk to qualify for each of the 12 separate blocks, or “tranches,” of stock were not the “stretch performance goals” as the company told shareholders when seeking their approval of the package. Instead, they argued the milestones were essentially the same as the company’s internal growth projections that were being shared with banks and rating agencies. Attorneys for Musk and the Tesla board argued the pay package was approved by a shareholder vote. Excluding the votes owned by Musk and his brother, 73% of the shares voting in that election supported the pay package. Related Articles\nNational News |  \n\n\t\t\tJudge tosses Elon Musk’s case against hate speech watchdog in excoriating rebuke\t\t\n\n\nNational News |  \n\n\t\t\tApple co-founder Steve Wozniak wins latest round in lawsuit vs. YouTube over Bitcoin scam\t\t\n\n\nNational News |  \n\n\t\t\tElon Musk details his prescription ketamine use, says investors should want him to ‘keep taking it’\t\t\n\n\nNational News |  \n\n\t\t\tFormer Tesla worker settles discrimination case, ending appeals over lowered $3.2 million verdict\t\t\n\n\nNational News |  \n\n\t\t\tOpinion: Tech companies must be held accountable for abuse of kids\t\t\n\nThey also argued that the shareholders had seen their Tesla shares massively increase in value since it was granted. The company’s market cap was valued at $54 billion at the time the pay package was approved. It had risen to $607 billion as of the close of trading Tuesday, a gain of more than 1,000%. The Tesla attorneys argued that Musk was a key to that rise in the company’s value and that the pay package was therefore reasonable compensation. The Tesla attorneys also argued that Musk, who does not receive a cash salary or bonus, would be uncompensated if the package was thrown out. But McCormick rejected the argument that Musk would be uncompensated if the package was thrown out, writing, “Musk’s preexisting equity stake provided him tens of billions of dollars for his efforts.” The decision can be appealed to the Delaware Supreme Court. Copyright © 2024 MediaNews Group "
}