{
    "title": "Dave Portnoy Continues Losing Streak With Tesla Investment",
    "date": "1/27/2024",
    "url": "https://thedeepdive.ca/dave-portnoy-continues-losing-streak-with-tesla-investment/",
    "text": "Providing stock analysis for investors of the Canadian junior markets  In a bold move on January 24, David Portnoy, the founder of Barstool Sports acquired call options ahead of Tesla’s (NASDAQ: TSLA) earnings report. However, these investments have taken a hit, with Portnoy witnessing a substantial decline in the value of his options. The Barstool Sports magnate bought $220 and $240 call options for March, aligning his investments with Tesla’s future performance. Unfortunately, the immediate aftermath was not favorable for Portnoy, as his $220 calls were down by a significant 70%, while the $240 calls plummeted by 75% by the next morning following the cratering of the equity post-earnings. Yesterday, David Portnoy of Barstool Sports bought $220 and $240 $TSLA calls for March before earnings.He is down 70% on his $220 calls, and down 74% on his $240 calls this morning.Tesla has hit its lowest level in eight months.You can see all his plays on Unusual Whales. https://t.co/52CnxX3d3P This downturn in Tesla’s stock value is noteworthy, as the electric vehicle (EV) giant hits its lowest level in eight months. The automaker closed the week out at $183.25, down 13.64% over the last five sessions. The decline in Tesla’s stock is attributed to its recent earnings report, which fell short of expectations. Analysts had anticipated a slight increase in Tesla’s gross profit margins to 17.7% in Q4, but the reported figures were significantly below the high margins achieved in 2022. Investors were keen on understanding CEO Elon Musk’s vision for demand, future sales growth targets, and profit margins. Despite delivering 1.81 million vehicles with 38% year-over-year growth and producing 1.85 million units in 2023, Tesla’s start to 2024 has been tumultuous. Challenges such as recalls and supply chain disruptions, particularly due to the conflict in the Red Sea impacting German factories, have hindered operations. Additionally, Musk’s desire for more voting control over the company, particularly in leading Tesla’s AI and robotics initiatives, has sparked discussions within the industry. READ: Tesla: FinTwits’ Analysis On The Q4 2023 Financials Portnoy’s recent investment strategy also includes a strategic move into Spirit Airlines (NYSE: SAVE). However, this move proved to be high risk, with the company experiencing a swift 25% decline as the airline revealed its restructuring plans. Despite this setback, Portnoy has since seen positive returns on his Spirit Airlines position. Information for this briefing was found via Unusual Whales, Finbold, and the sources mentioned. The author has no securities or affiliations related to this organization. Not a recommendation to buy or sell. Always do additional research and consult a professional before purchasing a security. The author holds no licenses. In this interview, David Kideckel, CEO of PharmaDrug (CSE: PHRX), discusses the company’s groundbreaking biosynthetic manufacturing method for pharmaceutical-grade cocaine for safe supply. Pegasus Resources (TSXV: PEGA) has seen success in a recent sampling program conducted at its Energy Sands project in Utah. Welcome to The Deep Dive, where we focus on providing investors of Canadian junior stock markets the knowledge they need to make smart investment decisions. We take a closer look at all data relating to organizations listed on the CSE and the TSX Venture to create quality stock analysis for investors. Not a recommendation to buy or sell securities. Always do additional research and consult a professional before purchasing a security. "
}