{
    "title": "Tesla's Magnificent 7 Place at Risk As EV Maker Sheds $90B in Valuation",
    "date": "1/17/2024",
    "url": "https://markets.businessinsider.com/news/stocks/tesla-elon-musk-big-tech-magnificent-seven-stock-market-outlook-2024-1",
    "text": "       Tesla's 2024 is off to a rough start, as Wall Street ponders whether Elon Musk's EV maker deserves its place among the so-called \"Magnificent Seven\" group of mega-cap tech stocks. Shares of the company have tumbled nearly 12% over the first two-and-a-half weeks of the year in a skid that's wiped out $91 billion in market capitalization, according to data from Refinitiv. That plunge means Tesla now trades at a valuation of under $700 billion – way below the rest of its peers. Apple, Microsoft, Google owner Alphabet, Amazon, and Nvidia are all worth more than $1 trillion, while Facebook parent Meta Platforms was valued at $940 billion as of Tuesday's closing bell.  As impressive as Tesla's meteoric rise has been, its early 2024 slump is a reminder that it doesn't always make sense to lump the carmaker into a group with the US's other Big Tech behemoths, according to analysts. Tesla's start-of-year skid has come despite it capping off 2023 by posting fourth-quarter delivery numbers that topped Wall Street's expectations. Although the company lost its place as the world's top EV seller to China's BYD, it shipped a record 308,600 cars over the three months ending December 31, taking its total deliveries for the year to over 930,000. But rather than seeing those numbers as a reason to be cheerful, shareholders are fretting about the risk of weaker future sales. Legacy automakers like Ford and GM have struggled to drum up demand for their own EVs, and economists are forecasting a slowdown in global growth that's expected to drag on consumer spending. \"I think the market is trying to price in growth rates for next year and might be assuming that slowing EV sales will translate to slowing Tesla sales,\" Seth Goldstein, an equity strategist for Morningstar who chairs the firm's electric vehicles committee, told Business Insider. \"Because Tesla is such a high-growth stock, even small revisions downward can have a large impact on its valuation,\" he added. Tesla's stock price have now slid almost 27% from a peak of $299.29 reached last summer. Axel Springer, Business Insider's parent company, has a global deal to allow OpenAI to train its models on its media brands' reporting. Read next Indices Commodities Currencies Stocks Jump to "
}