{
    "title": "Tesla, Netflix, GE Earnings: Investing Action Plan",
    "date": "1/19/2024",
    "url": "https://www.investors.com/research/investing-action-plan/tesla-netflix-ge-earnings-investing-action-plan/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     The Nasdaq set a hot pace as the market's rally hammered out yet another weekly gain. The S&P 500 turned early-week losses into a 1.5% advance, taking a record high. The Dow rose 0.7% to test resistance just below 38,000. IBD continues to hold its exposure recommendation to between 80% and 100%. In the coming week, Tesla (TSLA), Netflix (NFLX) and General Electric (GE) command the earnings calendar. But scores of others, from defense names, to airlines and a roster of Dow Jones names including Johnson & Johnson (JNJ), Intel (INTC) and American Express (AXP) also report. Even the fastest runners can't run forever. Leading stocks will go on runs, but then will often pull back and perhaps set up again. That's what Royal Caribbean (RCL), GitLab (GTLB), Affirm Holdings (AFRM), Intuit (INTU) and Skechers (SKX) have done. Intuit and Skechers have pulled back to find support at their 21-day exponential moving averages. So did GitLab and Royal Caribbean. For GitLab 67.55 could also act as a buy point in a brief consolidation. RCL stock and Intuit also sit in a shallow consolidations. Both are also actionable from both the 10-week and 21-day levels. Affirm has pulled back to test support at its 10-week line. The stock isn't yet actionable, but is testing key support at a hug Big inflation and spending reports in the coming week offer a reality check for Wall Street's shifting rate-cut expectations. Views see the first official estimate of Q4 GDP growth, on Thursday, downshifting to 1.8% growth from 4.9% in Q4. The report from the Bureau of Economic Analysis will include quarterly reads on consumer spending and the Fed's key inflation gauge, the core PCE price index. The December personal income and outlays report, out Friday, with break out inflation and spending data by month. Wall Street expects that the core PCE price index rose 0.2% in the final month of the year, lowering the 12-month core inflation rate to 3% from 3.2%. Fresh housing data is also due, with new home sales for December out Thursday at 10 a.m. ET. Pending home sales, a tally of existing home sales early in the drawn-out closing process, are out Friday at 10 a.m. ET. Chipmakers Intel and Texas Instruments (TXN) will report fourth-quarter results in the week ahead, as will semiconductor equipment suppliers ASML Holding (ASML), KLA (KLAC) and Lam Research (LRCX). Texas Instruments will post its Q4 results late Tuesday amid slumping sales of chips for personal electronics and industrial applications. Intel reports late Thursday. Notably, Intel is seen returning to sales and earnings growth after at least seven quarters of declines. It's benefiting from a resurgence in PC shipments. ASML delivers its Q4 results early Wednesday. Lam Research reports late Wednesday. And KLA will deliver its fiscal Q2 results late Thursday. Tesla reports Q4 and full-year earnings and revenue late Wednesday, closing out 2023 with analysts focusing on vehicle pricing and margins for 2024. Ahead of the earnings announcement, Tesla stock has declined around 14%. Wall Street forecasts EPS falling 39% to 73 cents with revenue increasing 5% to $25.61 billion in Q4. Tesla reported that deliveries in the fourth quarter exceeded predictions, with the global EV giant selling a record-setting number of vehicles. Streaming video leader Netflix will report its fourth-quarter results late Tuesday. Analysts polled by FactSet expect the internet television network to add 8.72 million new subscribers in the December quarter. They predict Netflix will earn $2.21 a share on sales of $8.72 billion. In the year-earlier period, Netflix earned just 12 cents a share on sales of $7.85 billion. Netflix stock received at least three price-target hikes in recent days on improving prospects for the video streamer amid reduced competition. The big defense names roll out earnings this week as Middle East tensions boil and the war in Ukraine rages on. Baird on Tuesday downgraded RTX (RTX) to neutral Tuesday on expectations of a mixed quarter for most defense stocks. Still, Baird lifted its price target on RTX to $94 from $88. Lockheed Martin (LMT) reports Tuesday morning, facing views for a weak quarter. Textron (TXT) reports Wednesday followed by Hexcel (HXL) on Thursday. Analysts see Textron earnings jumping nearly 43%. Hexcel earnings are predicted to increase 25% on a 10% gain in revenue. Booz Allen Hamilton's (BAH) Q3 earnings, on Friday, are expected to rise after a fiscal Q2 dip. Analysts expect a soft quarter as the airline industry earnings take off on Tuesday. United Airlines (UAL), American Airlines (AAL), Spirit Airlines (SAVE) and JetBlue (JBLU) are among those reporting. Southwest AirlinesLUV is the only one in the group expected to deliver both an earnings and revenue increase. Investors will be keenly interested in an update on Spirit/JetBlue's views toward their court-thwarted merger. Logitech (LOGI) will release its fiscal Q3 results late Monday. The PC peripherals maker is seen earning $1.14 a share, unchanged from a year earlier, on sales of $1.25 billion, down 2%, in the December quarter. The stock is extended after an October breakout. Shares of General Electric (GE) are sitting on a 12-month run of 70% ahead of its report on Tuesday. The forecast for a 28% earnings decline and an 18% drop in earnings would be GE's first declines in more than four quarters. Q3's results showed ongoing strength in both its Power and Aerospace units. And investors will be tuned to any further information on the spinout of the Vernova energy as a separate company, expected sometime this year. Intuitive Surgical (ISRG) will report its fourth-quarter earnings after the stock market closes on Tuesday. The company already pre-announced some of its results. Sales climbed 17% to $1.93 billion. The number of procedures performed using Intuitive's da Vinci robotic surgery system rose 21%. Analysts also expect adjusted profit to come in at $1.48 per share, up 20% over the year-earlier period. American Express reports Q4 results early Friday. FactSet expects the credit card company's earnings to increase 27.5% to $2.64 per share. Revenue growth is seen slowing for the third straight quarter, rising 12.9% to $16 billion. Stock Market Forecast 2024: A Soft Landing May Not Bring The Gains You Expect These Are The Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today AI Stocks: Tech Giants, Cloud Titans, Chipmakers Battle For An Edge Futures: Three Stocks Near Buy Points 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}