{
    "title": "Elon Musk Not Coming To Vibrant Gujarat Summit; Tesla Welcome To Invest \nSays Govt",
    "date": "1/12/2024",
    "url": "https://www.vibesofindia.com/elon-musk-not-coming-to-vibrant-gujarat-summit-tesla-welcome-to-invest-says-govt/",
    "text": "Light Dark Elon Musk, the billionaire-founder of Tesla, is not coming for the ongoing Vibrant Gujarat Global Summit, a senior government official said, adding the company was welcome to invest in the state. The state is very keen to get Tesla if it comes to India, Managing Director of Gujarat Industrial Development Corporation Rahul Gupta said. He also said the state was already home to a slew of electric vehicle manufacturers. To a specific question on whether Musk is expected to attend the three-day event inaugurated by Prime Minister Narendra Modi earlier in the day, a state government official replied in the negative. “Musk is not expected. If he were to come, would he not attend the inaugural session? Will he be attending the seminars on day 2 and day 3?” the official said on the condition of anonymity. Speculation was rife that Musk might attend the summit. “You will appreciate that it is the prerogative of any particular company on where to invest and what to invest. So as far as Tesla is concerned, the government of Gujarat will be more than happy to facilitate them in case if they decide to come to the state,” Gupta said. He also said the state’s industrial landscape and robust infrastructure were among other draws that can entice a company like Tesla. Earlier, Foreign Secretary Vinay Kwatra alluded to a meeting between Modi and Musk during the PM’s last visit to the US. “There were many elements of value chain, economic and commercial investment driven opportunities that were discussed between the Prime Minister and the leaders. “And Tesla leadership had extensive meetings with a focus on how exactly can Tesla partner more strongly in the period of investment and manufacturing partnership with India so that it strengthens that segment of the automobile manufacturing in India,” Kwatra said. Also Read: Advantage BJP Again As Congress Shuns Jan 22 Ayodhya Event Your email address will not be published. Required fields are marked * Name * Email * Comment * Notify me of follow-up comments by email. Notify me of new posts by email.  Just tell us a hi.\nGive us your feedback on our articles or how we can improve or enhance our customer experience.   "
}