{
    "title": "Tesla cancels $16K pie order at last minute — leaving California bakery \nowner 'high and dry'",
    "date": "2/22/2024",
    "url": "https://nypost.com/2024/02/22/business/tesla-cancels-16k-pie-order-at-last-minute-leaving-california-bakery-owner-high-and-dry/",
    "text": "Submit Δ Thanks for contacting us. We've received your submission. A California bakery owner was left “high and dry” after electric car maker Tesla placed an order for $16,000 worth of pies — only to cancel just before the delivery went out the door. Voahangy Rasetarinera, owner of The Giving Pies in San Jose, received the order on Valentine’s Day for 4,000 pies from a rep at the Elon Musk-owned company, she told NBC Bay Area. The Tesla worker reportedly told the black business owner — beloved by other Silicon Valley heavyweights — that the company wanted the pies delivered the following week for an event to commemorate Black History Month. Rasetarinera sent Tesla a quote, which the company rep approved, she said. But Tesla’s vendor did not send payment. The next day, Rasetarinera said she inquired with Tesla about the lack of payment. “She said, ‘Oh, I’m so sorry that vendor hadn’t paid you yet, I think they’re kind of new’,” Rasetarinera said. “‘And I have a question for you, can we double the order?'” Rasetarinera agreed, though her staff had to work around the clock to complete the job. The bakery owner said that to accommodate Tesla, she had to cancel other orders as well as buy more ingredients. After taking on the heavier workload, Rasetarinera then said she received a text message from the Tesla rep, which read: “It unfortunately sounds like we will be changing plans and will not be needing this order. Thank you so much for your support I appreciate it.” Rasetarinera said that her business suffered a loss in excess of $16,000 as a result of the last-minute cancellation. “This abrupt reversal left me reeling, realizing the extent of the impact on my small business,” Rasetarinera wrote on her Facebook page. “I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry.” When she inquired with Tesla about the cancellation, she was told the decision came from upper management. The “attempt to shift blame to upper management only compounded the betrayal I felt,” she said “To me, it was clear that Tesla’s corporate culture prioritized convenience over accountability, disregarding the livelihoods of small business owners like myself,” she wrote on her Facebook page. The Post has sought comment from Tesla. Advertisement "
}