{
    "title": "Most Americans mistrust self-driving technology, survey finds, though some \nsee potential",
    "date": "2/13/2024",
    "url": "https://www.marketwatch.com/story/most-americans-mistrust-self-driving-technology-survey-finds-though-some-see-potential-a4910b95",
    "text": "Americans have some concerns about self-driving car technology — 93% of them do — according to a new survey. The idea of the self-driving car took a particularly severe hit when Tesla \n        TSLA,\n        +5.72%\n       was forced into a pair of high-profile recalls of the systems it calls Full Self-Driving and Autopilot last year. Those are the results of a new survey from Forbes Legal, which interviewed 2,000 Americans “to better understand attitudes toward self-driving cars.” Many automakers are researching how to build cars that drive themselves. But none offer such a system today. Manufacturers use what many consider misleading names to describe their early attempts at autonomous driving. Kelley Blue Book refers to these technologies as advanced driver assistance systems (ADAS) because they always require the driver’s active supervision. But automakers market them under names like Autopilot or Full Self-Driving (Tesla), ProPilot Assist (Nissan \n        NSANY,\n        -2.82%\n      ), and Pilot Assist (Volvo \n        VLVLY,\n        +1.25%\n      ), which may imply that the driver can just let the car drive. You might like: Some cool future car tech from this year’s CES A version of Mercedes’ Drive Pilot sold only in California and Nevada is the only one that ever allows a driver to look away from the road. It works only under specific conditions and at limited speeds. Last year, a coalition of car safety groups called for industry standards on the names to avoid confusing consumers. Just 12% of survey respondents described themselves as “very trusting” of self-driving technology. Another 22% described themselves as “somewhat trusting.” Twenty-five percent chose “very untrusting,” making that the most common response. Just 20% hadn’t made up their minds. “Skepticism and concern are the two leading emotions Americans feel surrounding self-driving cars, with nearly half (45%) of all consumers expressing one of these emotions,” Forbes Legal says. “By contrast, just 16% of consumers are excited, and just 8% have an overall positive outlook about these vehicles.” Read: Self-driving cars: Are we there yet? Here’s an explainer on the types of technology and what the future holds. Tesla was forced into two high-profile recalls of its ADAS last year. Tesla markets its systems under three names. Full Self-Driving, its most advanced system, is a $12,000 option on all Tesla products. The company considers the system to be in “beta testing,” like unfinished software, but has allowed tens of thousands of owners to use it on public roads if they sign waivers. Plus: Authorities reportedly probing crash between Waymo driverless car and bicyclist Last year, the federal government’s National Highway Traffic Safety Administration (NHTSA) forced Tesla to issue a recall making changes to the software’s behavior but declined to order the company to stop public beta testing. Autopilot, a less-advanced system, is standard on every Tesla product. NHTSA likewise forced a safety recall of Autopilot last December. Autopilot is still on the road, but the updated software prompts drivers to intervene more often and shuts off their access to it if they don’t. The publicity, Forbes Legal finds, “prompted significant consumer concerns, with 62% of survey respondents indicating they are not confident in Tesla’s technology following the recalls.” Despite negative reactions toward the current technology, almost a third of respondents said they were “very likely” or “somewhat likely” to “use or own a self-driving car in the next five years.” Twenty-nine percent said they would pay a premium to own the technology. “Among consumers who do see positives, however, most believe the biggest benefits will be enhanced mobility for the elderly and people with disabilities, as well as increased efficiency in transportation logistics,” the researchers say. This story originally ran on KBB.com. This mother of all house flips has ended up in a bank-owned short sale less than one year later. Visit a quote page and your recently viewed tickers will be displayed here. "
}