{
    "title": null,
    "date": "2/12/2024",
    "url": "https://www.businessinsider.com/how-to-charge-non-tesla-ev-at-supercharger-models-adapters-2023-7",
    "text": "2023 was a pivotal year for Tesla and competing electric automakers. A key factor in all of that? Whether companies planned to switch to Tesla's charging standard, now rebranded as the North American Charging Standard or NACS. More car companies are shifting to the charging pioneered by Elon Musk in the hopes of boosting their customers' confidence in going electric. If you currently drive a Tesla, you can keep charging at Tesla charging locations that use the company's North American Charging Standard (NACS), which has long served it well. The chargers are thinner, more lightweight and easier to wrangle than other brands. If you currently drive a non-Tesla EV, you have to charge at a non-Tesla charging station like that of Electrify America or EVgo — which use the Combined Charging System (CCS) — unless you stumble upon a Tesla charger already equipped with a Magic Dock adapter. For years, CCS dominated EVs from everyone but Tesla. Starting in 2024, if you drive a non-Tesla EV (from the automakers that have announced they'll make the switch), you'll be able to charge at 12,000 Supercharger locations with an adapter. That's not all Superchargers — some (the original and V2 chargers) are not compatible with CCS, but the V3 chargers are. But by 2025, EVs from several automakers won't even need an adapter. Non-Tesla stations will increasingly incorporate NACS in addition to CCS. Here's how to charge up, depending on which EV you have: Ford was the earliest traditional automaker to team up with Tesla for its charging tech. Current Ford EV owners — those driving a Ford electric vehicle already fitted with a CCS port — will be able to use a Tesla-developed adapter to access Tesla Superchargers starting in the spring. That means that, if you own a Mustang Mach-E or Ford F-150 Lightning, you will need the adapter in order to use a Tesla station come 2024. But Ford will equip its future EVs with the NACS port starting in 2025 — eliminating the need for any adapter. Owners of new Ford EVs will be able to pull into a Supercharger station and juice up, no problem. GM will also allow its EV drivers to plug into Tesla stations. Much like Ford, GM EV drivers can start to use the Tesla charging network even before the automaker equips its cars with NACS. Starting next year, whether you're driving a GMC Hummer, Cadillac Lyriq, or other GM electric car, you can use a Tesla charger, so long as you have an adapter. GM will build its EVs with the NACS port starting in 2025. From that point on, GM EV drivers won't need an adapter to charge at a Tesla location. As for Rivian drivers, an adapter will also be available, in the spring. Then, Rivian will build its R1T vehicles and upcoming R1S platform with the NACS port as standard beginning in 2025.  Current drivers of Volvo EVs can start to use an adapter to use Tesla chargers sometime mid-next year. Those who buy an electric Volvo starting in 2025 can expect the cars will be made with the NACS port from then onward. The same rules apply for owners of Polestar EVs. You can start using the chargers in 2024 with an adapter, and expect the full experience a year later with a model year 2025 Polestar. The German automaker just announced it will adopt Tesla's NACS. Mercedes-Benz EV drivers will have access to the Tesla network via an adapter beginning next year. Mercedes will implement the NACS port into its vehicles built starting in 2025. Nissan is the first of the Japanese automakers to adopt Tesla's NACS. Starting next year 2024, Nissan models that currently have CCS will get access to adapters that allow those vehicles to connect to NACS plugs. Nissan said in a release that it will build its EVs for the US and Canadian markets with a NACS port beginning in 2025. Fisker is following suit and announced in August it will adopt NACS. Starting in the first quarter of 2025, Fisker customers can use adapters to access Supercharging. The EV startup said it \"will later update\" its vehicles to include the NACS inlet. Fisker said it will also continue to include a CCS adapter so customers can still charge at sites with that standard, too. Honda announced early September it, too, would adopt Tesla's NACS. The automaker will launch a new EV in North America, equipped with the port, in 2025. EVs launching before then with the traditional CCS port will have NACS compatibility with an adapter. The same should apply to Honda's luxury brand, Acura. All new Jaguar electric vehicles sold in the US, Canada, and Mexico from 2025 and beyond will come equipped with NACS, the luxury automaker said late September. It will also give its existing customers and future buyers of its pure-electric vehicles not yet equipped with NACS an adapter to charge at Tesla locations. Jaguar is planning on going all-electric by 2025. Hyundai will debut NACS on its new or refreshed EVs in the US starting in the fourth quarter next year, the automaker announced early October. Vehicles in Canada will have access to Tesla Superchargers in the first half of 2025, the company said. An adapter to access the Tesla network will be available to drivers of existing and upcoming Hyundai EVs with the CCS tech starting in Q1 2025. The automaker \"will also make adapters available to charge NACS-equipped vehicles at CCS chargers.\"   BMW announced mid-October it will adopt NACS across all of its brands, which also includes Mini and Rolls-Royce. The German automaker said that owners of its EVs made with the CCS outlet will get access to Tesla's network in early 2025, likely via an adapter. BMW already has six pure-EVs across the three brands and is planning on a substantial electric future lineup. In 2025, BMW will also start to produce its EVs with the Tesla standard built in. Not long after Hyundai and BMW announced their upcoming switch to NACS, Toyota announced it would do the same. Beginning in 2025, Toyota and Lexus EVs will come equipped with the standard so drivers can plug into the Tesla network. Customers of Toyota and Lexus EVs that come equipped with the CCS port will be able to use an adapter to charge there as well, also starting in 2025. Lucid CEO Peter Rawlinson recently said he's not yet convinced about the industry-wide switch to the Tesla NACS tech, but it's likely the startup will eventually follow suit. That means Lucid drivers have to charge at a location where CCS is readily available. The Jeep-maker told Reuters in a recent statement it would evaluate a potential switch to NACS. Currently, non-Tesla EV drivers can plug in at an Electrify America or EVgo charger given both the vehicles and the stations are equipped to handle CCS-enabled charging. Several charging companies are now planning to convert their equipment to NACS. (You can keep an eye on which companies that is with this helpful tracker from consultancy EVAdoption.) That means that for drivers of non-Tesla EVs, built with the NACS port in the future (for many of them, starting in 2025), these non-Tesla stations will also be able to accommodate them. There's a lot to keep track of in the world of EV charging. But given how important charging is to an EV owner's experience, the space is bound to get more exciting in the coming years. Are you a non-Tesla EV owner? Are you planning to use the adapter to be able to charge at Tesla stations starting next year? Do you wish you waited to buy your EV until after it was built with the NACS port? Do you have a tip or opinion to share? Contact this reporter at astjohn@businessinsider.com.   Stellantis was one of the last major holdouts to adopt Tesla's charging tech. The Jeep maker announced in February 2024 that all its 2026 model-year electric cars would support the infrastructure. Correction: July 10, 2023 — An earlier version of this story misstated which Tesla chargers that cars from other automakers can use with an adapter. They cannot use all Superchrgers, only those that are V3, not V2 or original. Read next Jump to "
}