{
    "title": "Nvidia, the WTF Chart of the Year. Tesla also Had WTF Charts of the Year \nbefore Shares Plunged",
    "date": "2/24/2024",
    "url": "https://wolfstreet.com/2024/02/24/nvidia-the-wtf-chart-of-the-year-tesla-also-had-wtf-charts-of-the-year-before-shares-plunged/",
    "text": "IMPLODED STOCKS Brick & Mortar Meltdown Banks\nCalifornia\nCanada\nCRE\nCredit Bubble\nCryptos\nDebtor Nation\nDrunken Sailors\nEurope\nFederal Reserve\nHousing Bubble 2\nInflation & Devaluation\nJapan\nJobs\nMarkets & Companies\nOil, Gas, Power\nRetail\nTrucks & Cars Nvidia is special because the dollars are suddenly so huge – a hair over $2 trillion at the open on Friday, and just a little below $2 trillion at the close. Over the past 12 months, market cap has spiked by $1.46 trillion, including the biggest-ever-for-any-stock one-day spike of $277 billion on Thursday, on exceeding revenue expectations by $2 billion. There are other charts that look even wilder because these are crazy times, and all kinds of stuff has been spiking and in crazy ways. And Tesla’s chart used to look like this too, before the shares plunged 70% in 2022. Crazy spikes like this generally don’t lead to a permanently high plateau. But Nvidia is now huge, and it’s floating on top of a mindboggling AI-mania. Nvidia has always been a volatile stock because something always derails the latest GPU-to-the-moon narrative. For example, between November 2021 and October 2022, Nvidia shares plunged by 65%, barely dodging our Imploded Stocks pantheon (minimum requirement: -70% from high). And now the numbers are much bigger. We show the market cap in the chart because the dollars are now so huge that they really matter for the overall market:  The utter mania around generative AI that has suddenly gripped corporate America led to an explosion in sales of high-dollar and high-margin systems of GPUs for Nvidia. Just about every major company is touting its progress with AI – for now, mostly just spending money on it – and periodically there are hilarious stories about generative AI’s not so intelligent work. I mean, can you fire AI if it screws up badly enough? Or is that suddenly a human’s fault? The amounts of money thrown at generative AI from all directions are just vast. And Nvidia is getting its share of the pie. Nvidia’s revenues might hit $100 billion in 2024, knock on wood, up from $27 billion in 2022. And it just might, or might not, surpass Tesla’s revenues, which were already $97 billion in 2023. So we just accidently remembered that Tesla’s stock too went through these WTF spikes until it hit $414.50 on November 4, 2021, and then plunged 70% over the following year and was inducted into our pantheon of Imploded Stocks in December 2022, when its shares hit $123, after which they dropped some more. These spikes unwind brutally. Then came the big rally through mid-July 2023, and then the shares spiraled down again, and today they’re down 54% from the peak in November 2021, and they’re still overvalued though Tesla has become a much bigger and a much more successful automaker since the all-time high in November 2021. Since that all-time high, Tesla has become very profitable. Its Model Y has become the #1 best-selling model in the world, blowing away Toyota’s Corolla, and it has become the #2 best-selling model in the US, just behind Ford’s F-series truck. And since the all-time high, Tesla opened two new factories, one in Germany and one in Texas, and production and deliveries have soared, and it’s eating market share of the legacy automakers in big gulps, and despite its already substantial size, its global deliveries jumped by 38% in 2023. And yet, over those two years when Tesla’s business continued to boom, Tesla’s market cap plunged by over $600 billion. Turns out, these WTF spikes are a state of mind. And when that state of mind changes, the spikes unwind.  Will Nvidia have a monopoly on AI-suitable GPU systems? Will no one figure out how to make something competitive and sell it a lower price? And will Meta, a gigantic customer of Nvidia’s GPU systems, suddenly discover that it has all the GPUs it’ll need, just like it had suddenly discovered that it had way too much office space and way too many employees? Companies are kind of weird in what they suddenly discover. All kinds of things can change that might rattle that overstretched state of mind – same thing that Tesla went through to get off its WTF spike. Enjoy reading WOLF STREET and want to support it? You can donate. I appreciate it immensely. Click on the beer and iced-tea mug to find out how:  Would you like to be notified via email when WOLF STREET publishes a new article? Sign up here.   Tags:Tesla Email to a friend Today, let’s take stock in the crazy good that generative AI is brining to bear, but let’s not forget the vast downside that’s coming. Whether it’s the racial bias being programmed into Gemini, the eventual collision course of massive job loses, or the eventual sentient AI that will rise up at some point, we’re watching the beginning of the end. Today, people are making boat loads of money. Not too far down the road, the other side rears its ugly head. And during the in between time, I’m sure that AI will do some amazing things, probably contributing greatly to all sorts of medical advancements. No irony in that AI could eliminate tons of BS jobs(or where a solid portion of a necessary job is BS) but we have built a society mostly around those which are not essential by definition but just so people can survive and pay rent, put food on the table, and so on.  Just another leap in productivity where mostly the wealthy will benefit. AI will create Millions of new jobs! Not one person employed currently  will become unemployed. AI is here to “assist” workers become more “productive” Very comforting bedtime story.  No Chicken Little story this AI, I say. Mother Goose’s soothing voice becalms everyone that that sky is not falling.  But.\nHistory reveals’ a story with more unsettling, disruptive episodes, plot line twists. Whenever mechanization took place in industry, in the short term,  after the new technology, was adopted workers became displaced, at times in large numbers.\nSteam engine powered ships – what happened to the large force of “sailors” who tended the sails; fixed them; made the masts; sewed the sail?.  Yep… their numbers increased exponentially  after steam engines turned the propellers and sails were tossed to the shore based ragmen, many former sailors.! Just kidding\nDiesel powered ships … Adieu Mon Amis  … we do not need you or  your coal shovels…\nContainer ships … Longshoremen, stevedores … “…could have been somebody…  could have been a contender”\nMechanized looms … Farewell artisan weavers. Time to leave the  Emerald Isle and head to America.  The stockyards are hiring, if one is not aged out, right Mr Carnegie?   Well, at least  Dale lucked out and built the largest steel mill in the world, at the time.\nHorse drawn carriages … their numbers exploded exponentially every time a newer mode of public transportation became adopted.\nPBX telephone systems … Hello, Hello Operator!!  Long Distance?   Good Bye, switchboard Operators… Good Bye Receptionists … we  right sized the company. It was fun having you during last  40 or so years.\nRailroad trains… subways…buses…trams…etc. In fact yesterday, I was delayed 3 hours by extreme traffic congestion of horse drawn carriages on the way to the office. Hordes, mules, donkeys, carriages – more reasons to defy my Boss and WFH. The steel tycoon was Andrew Carnegie.  Dale was the author of “How to Win Friends and Influence People,” among other self-help bestsellers. Thanks, BC.  Good commentary and retrospective. If productivity gains always led to dispersed wealth and societal benefit, I don’t think wealth concentration would be at all-time highs today.  Productivity gains are great, but they need to be accompanied by progressive tax rates, worker rights (unions), enforceable anti-trust competition policy, etc., to be of larger societal benefit. Today’s taxing and governance systems are woefully inadequate in the face of AI.  We haven’t had much productivity gain the past 30 years, yet look at the huge increase in wealth concentration during that time frame.  Future productivity gains from AI will be disastrous to society if governance systems aren’t improved. Just like… The Telegraph displaced the Pony Express The Telephone displaced the Telegraph The Internet displaced the Telephone Jobs will be lost.  Jobs will be gained Yes, but…\nMore people used Telegraphs than the Pony Express.\nMore used Telephones than Telegraphs.\nMore used the Internet than ever had Telephones. Jobs were created by demand for the new that outpaced the loss of jobs of the old. As populations stagnate or decline, that demand is not available to outpace the loss of the old.\nCountries will be going though a right-sizing due to not enough people. Hopefully America can remain a place where people want to be and we avoid the need to right-size. AI is an opportunity to make that right-sizing more graceful for those that remain. Hundreds of billions of dollars have been invested in name of AI. However if AI had really earned even a single billion dollar worth of business, you would be seeing big layoffs of unnecessary staff. Clearly it’s not happening based on unemployment numbers. So, it looks like more human time is going into building AI models and training it, than the time AI is saving via automation. Please note that thanks to pure stupid accounting standards, companies can book Billions of revenues of future unconfirmed orders that are conditional to AI becoming useful. So, either you will see unemployment numbers explode due to use of AI or you will see this ponzi scheme crash the stock price. For now it looks like Magnificent 7 have gone on hiring and spending spree thanks to bubble stock pricing. Let’s recall the dot com bubble.  Companies bought a ton of computer hardware because of the POSSIBILITY of a crash situation when the clocks turned to 2000.  It was all based on fear and speculation.  When nothing much happened, suddenly hardware sales crashed back to reality. AI looks like the same thing.  Companies are spending billions buying GPUs and software, bulking up on tech staff.  It’s based on the fear of missing out, or having your competitors leave you behind.  Most likely AI will amount to very little, or it will actually increase business costs.  If so, there will be a reconing for hardware sales when they all breathe a sigh of relief and go back to doing business as usual. H, And it isn’t really “companies” – it is a tiny handful of flush “Mag 7” companies pouring oceans of cash for Nvidia chips. So we have a tight little coterie of companies with tightly linked “fortunes”. If Microsoft or FacebookMeta have a crappy biz year (Meta anyone?) or wake up from an overly hyped biz delusion (Meta anyone?) then that oceanic flow of cash to Nvidia…stops. This is practically the perfect cascade failure set-up…interlocking delusions among a tiny group of interlocked companies, huffing each other’s carbon dioxide. No one has ever made me understand the significance of Bitcoin except for speculation and mania. Same with AI. Brant, At least in the abstract, the point of Altcoins is to provide an escape hatch away from infinitely dilutable fiat currencies controlled by the usual pathological political types (ie, endless printing to “fix” endless G debt). In practice, a lot of potential risks…but at least some operational progress (at least for Bitcoin…and perhaps for future follow-ons tied to a diversified set of real utility assets). AI, in the abstract too, could have significant value…but the difference here is that the actual operational progress seems vastly overhyped (at a suspicious time when the equity markets need the “next new hazy thing” to justify huge overvaluations). AI progress has been overhyped *multiple times* over many decades…and, again this time there is a lot more “golly, just imagine” relative to “how” (it supposedly works). I’m genuinely curious, what is the 5-step revenue recognition process under ASC 606 or IFRS 15 that companies have come up with (and had auditors sign off on) to record revenue as you stated? I would be interested to know how companies are booking billions in revenue on unconfirmed orders, as you state. AI should be seen as a person. In that sense, AI has skills and those skills are of varying levels.\nLets say that AI is used as a computer code writer. Its not likely going to be your best code writer. But having a second code writer can get significantly more done. I’ve seen AI increase productivity or top tier coders and actually enable the uninitiated to write usable code. I’ve heard the same is happening in Finance. There are many accounting function that can be automated. It will still be some time before that automation moves from a second pair of eyes, to the only eyes watching your books. Today making boatloads of money?  Yes.\nTomorrow too, if one has the courage and capital to take option positions for NVDA to drop, as it likely to do so – question is when.\nInstitutional trader will make huge profits.\nIddy biddy retail investors will lose their   boxer shorts and tong bikinis, whether invested directly or indirectly via IRA, 401K’s. Let me spin you a tale of option trades, I bought long dated call options on a stock that I was certain was undervalued (it was and still is) I sat on the leaps for 2 years and lost about 50% on them, the stock moved 1 month later well above my strike price and would have netted me about a double in my option investment… my point is that being right on price and being right on the time for the market to recognize it, is very difficult to pull off. (If you care I still made money because I also went long the equity which doesn’t expire) Recently I’ve been reading about some of NVIDIAs clients making these H100 GPU purchases for “AI”, one of the standouts is a company that used to be the “American Cannabis Company” which apparently provided “consulting” to weed growers, prior to that the company was a “Media Production Company” producing interactive content in Brazil.  Now this canabis, formerly media production, company is merging with Hyperscale Nexus to provide “data center services”.  They signed some kind of deal with a Singapore company to lease 30,000 H100 GPUs, these GPUs cost something like $40,000 each, so that would be $1.2B in purchases for NVIDIA.  What’s curious aside from a Cannabis Company buying 1.2B worth of hardware is that Hyperscale Nexus, the datacenter Company, has 0 employees as far as I’ve been able to read.  So, the question is, why does anyone need this company to purchase 1.2B worth of gear for them when they have 0 employees and likely nowhere near $1.2B to spend LOL, are they just fronting for Chinese companies to skirt sanctions?  I’m not smart enough to figure it out, but I hope someone here is.  You can look these company names up yourself if you’re curious “So, the question is, why does anyone need this company to purchase 1.2B worth of gear for them when they have 0 employees and likely nowhere near $1.2B to spend LOL, are they just fronting for Chinese companies to skirt sanctions? ” This is a very interesting observation. False overseas invoicing has long been used by Chinese wealth holders to evade CCP capital controls and get their wealth out the hell from under CCP control. Anytime a seemingly nonsensical transaction is taking place, it is worth asking if it is simply a front for Chinese capital flight. Generative AI is not the end of the world- it’s a parlor trick- trained on human inputs. It’s an enabler and perhaps a productivity enhancer, as an example my son is a software engineer working on this for a large large large AI software company- he’s on the front lines- this is how he uses it. So it will likely mean rather than needing 10k engineers they only need 7k. In this way, it’s no different than any other Industrial/information Revolution invention. At some point, the military will automate killing via an AI and THAT might be the end of the world. I am glad someone mentioned this, It’s here understanding how to use it will make it worth using. I do automation for alot of my work, my next step is turning prompts into automation action. This won’t cut jobs because as the company is large in size, 2 things happen 1. They pile more work onto a more expensive employee high skilled 2. They split a high skilled task into 2 parts and hire 2 low skilled employees. If you have a high skilled employee then you have automation you’re more inclined to hire more higher skilled employees because you are scaling the model of sucess Pablo – inferred in an Economist article of a few years ago: ‘The Advent of the Slaughterbots’. (At the time commenting in part on the novel ‘new’ tactical use of drones by the Azerbaijanis to decimate Armenian armored forces…). may we all find a better day. I really love that “DEEP Neural Networks” image. Ya think AI came up with that one, Guess What, or just a run of the mill creepy salesman/hustler? You know, one thing IS CERTAIN. This AI creature is providing Wolf with good Lewis Carroll type material for (of all things) Financial articles. I think he owes it a couple kilowatts, wherever it is. It’s definitely a mania (unless it really is different this time, and earnings EXPLODE upward and stay there). The translation to that is not apparent (or in sight).\n“[A] a permanently high plateau” – a classic, Irving Fisher ,1929! 1929… nahhh ….  this time is different!  Until, it is not. Esoteric comment earnings may explode upward but then go downward, since consumers without a job won’t be able to buy much If one was a gambler, the question might be: Will there be one more WTF like with TSLA?\nThe entire AI ‘thing’ reminds me of dot coms/blockchains/etc. Way way over blown, with sorrows to come.\nMany thanks to our host for all the informative charts. AI is certainly being used as a talking point from tech companies as something to try and build hype and ride it, and Nvidia is benefiting from this in a disproportionate way, but not entirely without warrant, due to the ability of their products to address the type of computing that is happening currently. AI itself is neither overblown, nor a short term trend. It’s been affecting markets, businesses, sciences and all sorts of industries for a long time now, in a completely indispensable way, and the current hype around generative AI rather undersells just where we are in the development of it all, rather than overstates anything. That’s where it gets difficult to judge anything with Nvidia. Long term the only thing I can think to look out for would be competition either regarding other businesses with out performing products, or from a mathematical/scientific perspective that might negate the effectiveness of GPUs to solve the problems that need to be solved compared to some other type of computing product. Short term, this current WTF spike is eye raising and I wouldn’t hold my breath it lasts like this without a sizable correction. “AI itself is neither overblown, nor a short term trend.” Apart from, of course, that it isn’t AI. Agreed…it is AAI (Artificial Artificial Intelligence)…as in artificially inflated by hype starved “journalists”…again. It is difficult to compare TSLA to NVDA, NVDA has a history of making profits by supplying chips for gaming and now AI.  TSLA has a lot of debt and made money by selling emissions credits.  No matter what you call TSLA it primary is to manufacture and sell EV automobiles. “TSLA has a lot of debt” No, Tesla has relatively little debt ($2.7 billion), but sits on $30 billion in cash. And in recent years, it has financed its factory construction out of operating cashflow, instead of borrowing. There is a big difference between the two; Tesla is a designer, software company, and a manufacturer (among other things); Nvidia is a designer and software company (among other things), but someone else manufactures its products. Yes, Tesla made some money from emissions credits (paid for by automakers that don’t build EVs, etc.) around the world; but it makes a lot more money from selling cars. And chip makers are going to get $60 billion from the government to build factories in the US. Not sure if Nvidia is going to get any of it. I played cards this week with a lady who bought Nvidia in 2020, so she’s quite happy right now.  I asked her if she will sell a portion to lock in some of those gains.  Nope, she’s letting it all ride. The chip makers are notoriously unstable in their levels of prosperity: Nvidia may look good this decade, but long term it’s anybody’s guess who will be AI chip supplier to the world. Nvidia isn’t a foundry. They are a designer. Worth repeating here: If people regard Nvidia only as a chip company, that is their first mistake, a sign that their knowledge about the company is superficial. They are primarily a software company that just happen to make the best chips, which are assembled into SYSTEMS that only they have, which can be designed to tinker in any field. Oh, and they also look like their slowly morphing into a CSP that will generate recurring SaaS from leasing their systems and software stack. While expensive, not exactly outrageous with 55% net margins. Forward PE = MSFT. A friend of mine in the Reserves did the same thing back in the early 2000s with Nortel. He had been a Nortel engineer in the early 90s when it was just a small phone company and had been given stock in his retirement portfolio (not even six-figures worth). Then it exploded in value to being worth a couple of million.  He had another Reserve officer in our unit as his broker and the broker BEGGED him to bank some profits.  He didn’t do it and rode it all the way to the bottom. My rule of thumb on moonshot stocks is to sell it in quarters (or thirds depending on how fast a stock rises). The first quarter is sold when it will get you to break even… now you are gambling with house money. The next quarter gets sold on the first real dip. The next quarter gets sold as price growth slows. The last quarter NEVER gets sold unless you think it is totally played out (although another way to do that is to divide the last quarter into a new set of thirds or quarters). Sadly I have never followed my own advice to the end… Had friend who worked for Nortel around this same time. He briefly was worth 40 million in stock options. It ended up being about 250K instead. At a Christmas get-together, a group of relatives was speculating about what Nortel stock would be going to; I think it was in the ’50s at that time. Everyone except me predicted lofty numbers; I said 2 bucks.\nI was dismissed with The Look.\nSometime later I had to listen to their agonizing about how their savings plans had been decimated. Happy1’s comments always make me cry. “If you don’t book your profits, someone else will.” Tell her if it’s a double .sell half .Then she can let the rest ride .All these eventually blow up Yes market cap is astronomical but what would have more sense is if you compared PEG or even PE (forward 12 month). The mania maybe in orders being placed in last 6 months and maybe for another 3-4 quarters as well but in terns of FCF multiple, PE multiple (forward) or PEG (forward) its a flatline for NVIDIA. Same couldn’t havebeen said about Tesla multiples. Anything “forward” is fiction and part of the “state of mind” of a stock price. That’s pure bull$hit. Correct, I just didn’t want to call it “bull$hit” so I called it “fiction.” 🤣 No, it’s not. Companies often have rosy projections that don’t line up with reality. So say, as an example, a company’s “forward projections” are that the company will have annual earnings of $5 billion the following year. So investors will hear them say that this is a forward PE of let’s say 26.  Then, along the way, the company will quietly revise its projected earnings to $2 billion, which would be a P/E of 65.  Not so good anymore! But the financial media which does nothing more than cheerlead for the stock market will never say “Ahh, Company X projected earnings of $5 billion, which they’ve reduced by 60%!” Instead, when the company reports earnings of $2.4 billion, while the analysts were “expecting” the $2 billion they quietly revised it to, they’ll scream loudly about the earnings “beat,” even though the $2.4 billion is less than half of the original $5 billion that served as the basis for the forward P/E of 26. It’s a pathetic, criminal game, that no one should still be falling for. Wolf is always the voice of reason, that’s why I read his articles. Selling covered calls on NVIDIA… Yes. Forward is speculation, prediction, crystal ball gazing, or as Wolf said…fiction. GPU’s are not steady state.  The key to AI is speed and when faster GPUs come out, the heavy hitters will upgrade. Nope. Do your homework. The speed improvement vs price is a major disappointment. NVDA has been good in pricing it’s products according to market mechanisms but their GPUs have not imrpoved that much. Just research the throughput of their graphics cards (e.g. see tomshardware.com which has an excellent list of all GPUs going back over 15 years). It used to be that with newer GPUs the price of the newer would take the price of previous generation and previous would drop in price according to their relative lower performance. Instaed, the older keep their price and the newer are priced at even a premium in their performance difference. That may be good sales business but it also is the end of the price performance improvement cycle that warrent upgrades to newer products. The datacenters now buying will keep what they have and not spend or retire older products or at least not very fast. We have seen similar behaviour at Intel when they no longer could keep up with Moore’s law. Apple is now hitting the iphone sales glut because upgrades do not have that big benefit to justify the expense. Same with their macbooks and ipads, no longer you need to upgrade but that 5 year old thing easily can do for another few years. There was an interesting comment ‘fear of missing out’’ would push things further up, another 16000% increase, why not. But the little detail is that the company already is reaching the valuation maximum and going to $320T value from current $2T, unlikely. More likely is a continuation of BS from the so called ‘free’ financial news sources like yahoo finance , marketwatch to the gullible to urge them to buy what they are currently trying to sell at ridiculous price levels. We had the ponzi fake gold coin crypto cycle and clearly this NVDA pumping is just another of those schemes. Only difference is that we now have some value in the underlying company (nothing negative on them and product) but their share price is just another ponzi scheme unfolding before our eyes Yep, I added more memory to my 15 YO laptop.  Software is much more bloated now.  The computer would run out of memory with only a few browser windows open.  Now it opens many more, making it a useful computer again.  The *old/slow CPU rarely matters. The big buyers/players will all build data-centre AI specific ASICs if this stuff really takes off. It’ll be open season in the AI space shortly if it takes off properly. Nvidia had a head start with parallel processing optimised GPUs and their fairly broad programming flexibility. But once Google and MS etc know exactly what they need they’ll build specifically for it. Nvidia likely won’t capitalise on their advantageous position now.\nToo much risk and “why do xyz when we’re selling loads of UVW for the next few quarters?” Who knows. The future of AI might come along but not even be on silicon… it might be done in chimp brains with teslas neuralink… bullish chimp breeders! AI applications are boundless. Does this mean the big CSPs will design and build boundless ASIC chip designs that need to be different for every application? That is the very definition of ASIC. Not to mention the fact this not their wheelhouse. Plowing money into R&D for improved variations in perpetuity is another drawback. AI applications are bounded in this case by being NNs. There is a good chance some novel computing or programming advancement makes the GPU AI NN model out-moded in a moment. Just look how 3dfx succumbed to Nvidia doing almost exactly the “same thing” in 3D graphics 25 years ago. You don’t even need a big difference in deliverable output (in that case rendering 3D gfx), in a market with much smaller value at that time, to see a big disrupter emerge/dominate. There are, at current valuations, trillions of dollars on the table.\nTo think no one will try disrupt this market or specialise to gain percentage points of advantage, is wishful thinking, shirley? Usually and Super – copy that? may we all find a better day. Generative AI works by running a huge number of GPUs in parallel, each processing a small amount of information. Because each is processing a small amount of information they don’t have to be particularly fast. They are all also interconnected, sending their outputs to each other, which is what NVidia brings to the table (among some more esoteric applications). Speed improvements necessarily come from software improvements riding on top of the application. Google’s latest gen ai app blows away everyone else’s in speed. Two thoughts:\nA friend of mine once said “figure out which way the horse is running and ride it”.  That has always worked well for me in my stock investing. I have a Ford F-150 and a Toyota Corolla.  I guess I need to trade in the Corolla for a Tesla Model Y to be stay with the top two vehicles. :) In the US, the Corolla wasn’t the top-selling car; the Camry was. And the other bands’ pickups and SUVs have outsold the Corolla also. So you already missed the boat 🤣 But it might be a good idea to hang on to your Corolla until it starts giving you problems. Wonder if it will be like Intel.  I was there in the 90s during the every 18 months stock split and rise and then suddenly it missed the mobile market and didn’t see the sub $1000 laptop ever being possible.  Now there are just commodities and while profitable, it is nothing like before.  Don’t see how this future would be different once the AI boom and bust is complete with winners and losers.  Don’t think AI boom will be same as .com but never thought FB could make it as stock so what do I know?! What one man can do, another man can do equally or better – very old but relevant observation proven true countless time.  NVDA not likely to escape it.\nBTW … how many of the mighty industrial companies that composed the DJIA index on May 26, 1896, its forming day, are still in existence?\nThe “Original 12” Companies\nTHE MIGHTY 12…\nAmerican Cotton Oil\nAmerican Sugar\nAmerican Tobacco\nChicago Gas\nDistilling & Cattle Feeding\nGeneral Electric\nLaclede Gas\nNational Lead\nNorth American\nTennessee Coal and Iron\nU.S. Leather\nU.S. Rubber Motley Fool has an article that says all but one have morphed (GE is the only one left in original name), but also that all but one are still around in some form. Google used to do AI on GPUs.  They’re now running (at least) 3rd generation T(ensor)PUs they’ve designed and produced themselves.  These chips are cheaper and use less power per operation because they’re highly specialized. Meta will certainly go the same way eventually and some company will start selling the same to be used instead of GPUs for AI.  If Nvidia management is smart, it’ll be them – better to canabalize your own business than have someone else do it. For most companies, it’s likely cheaper to run your AI work on Google TPU Clusters than they to manage the hardware yourself. Nvda has earnings and a decent PE to the growth potential while tsla did not! Like it or not companies and countries are being forced into AI or they will be outa biz! I have to agree. AI is something that has no real limiting principle in terms of long-term adaptation. There is no “top” to knowledge work. That doesn’t mean you can’t have bubble, in practice AI will probably not replace human judgment and thinking power, but the potential is absurdly high. This bubble has distance to run. Compare this to electric vehicles. There is an obvious ceiling to EV demand,  and it is well less than total world market vehicles, which is a mature and even declining market in many parts of the world. The Tesla bubble never even made theoretical sense. There is a top to it. Current demand for “thoughtful” output is largely fulfilled. To fill more of it you need more demand. But if all your employees who did thoughtful work are displaced by AI, the economy will shrink, as half the population won’t have jobs. So there is a very clear top to AI demand/output. Sufficient to displace some jobs, but create sufficiently more to not hurt overall demand for AI thinking… which, erm, largely means the ‘value’ of AI is what it can add to GDP? Nvidia $1.5Tn boost in market cap alone is already a hefty global gdp boost expectation, never mind ARM, TSMC, MS, etc. Nicely put and thought-provoking. The revenues of one company are somebody else’s expense.  When productivity grows less than 2% per year, it’s largely a zero-sum game. Wealth inequality is already setting records. Will productivity gains be allowed to enrich the top players even more?  It seems AI won’t work without massive corporate tax increases or other distributions to the working class. KL/Bobber – “…I love being in business, it’s just the necessity for customers I can’t stand…”. may we all find a better day. AI companies can buy advertising developed by AI companies to sell to AI companies.  And the increased buying and selling will send GDP through the roof.  And if it slows down for some reason the government can just print some money and fire it right up again.  A true utopia. Can’t wait. Will we get the fireworks on the house as well? Classic!  What the Fed hath wrought:  assets no longer have a value.  They have a price, and is so well put in this piece’s subtitle, those prices are a “state of mind.”  (I’m gonna borrow that, Wolf)!  Eventually, actual valuation will matter.  ‘Til then, capital flows simply swamp fundamental anything. For optimal AI power you need AI software and the only company that has the cutting edge software to drive AI is NVDA with its CUDA operating system. Think msft for the x86 architecture. Yes, AMD is working on open source sftw but they are a far second place and have a small slice of the market.\nThis is not a fad and is the first innings of a teck leap forward. Since it is the first inning there will be misteps but they will be fixed and more powerful and useful application will be incorporated! I write in CUDA.  It’s just a constrained language that reuses a C compiler and provides some globally accessible facilities.  It’s not an OS.  An OS manages files.\nAll nVidia code is embedded.  It’s like putting a program in a place in memory, and then telling 2048 little calculators to run it. Thank you Jeff.  I imagine we’re just a few good code libraries away from seeing Nvidia’s competitive moat erased.  Nvidia has always been stronger in software than their competitors, but how long can that last in the current environment?  Not long I would guess. The only questions in my mind is how fast will enterprise adopt new frameworks, how fast will frameworks adopt new libraries, etc. Wolf, of course there are risks. INTC had a lock on the desktop and server market and they got complacent and failed to inovate and AMD seized the opportunity, however, unlike NVDA they didn’t own the Windows OS like NVDA has with CUDA. Right now China says they have the accel chip that is superiour for AI but it’s all talk right now. Right now NVDA is the 800 lb gorilla that controls the banana plantation and the monkeys will need to step up their game to steal more than a few bananas.\nIf you notice NVDA is investing in dozens of AI startups and opened its teck dept to work with data centres that want to produce their own chips. They are also developing other infrastructure gear that AI stacks need which is putting pressure on Broadcom and Marvel. Huang’s actions says he’s more than 2 steps ahead of the competition– afterall, Huang put NVDA to work on AI many years ago before anyone had heard of AI. Sorry to tell you: Work on AI is already 40-50 years old. Ever heard of lisp, prolog; Inference Corp, Quintus? And before that, concepts like cellular automata are from the ‘60 so 60 year ago No, NVDA got a headstart thanks to computer graphics requiring massive parallel processing pipelines. Intel also got in the game but each time f$cked up by bloating everything at cost of that paralellism. AMD also in the graphics did not make that mistake but they are the worst towards their own profit making, a mistake nvda wisely did not Nvda is showing signs of hitting limits, performance improvements no longer appear as much as used to be and they are now following Intel’s sales model that older processors no longer are sold for less but newer are just more expensive relational to their improvement.  That will work great until you hit saturation. And regarding they have now money to invest in other startups: no they do not. You confuse the market cap of the company with working capital. Yes they will be able much easier to buy other companies while paying with their immensely overvalued stock. But once that happens, part of that stock will be sold and the house of bid up stock price will come crashing down. And regarding buying startups , there are many other buyers with extremely deep pockets and cash they have no idea where to put it. I strongly believe that you believe strongly. They said the same about Cisco in 1999. Know a guy in Europe who’s become a millionaire from a 3 x long bet on Nvidia since just before Covid. He loves AI mania. He’s now got a US flag on the wall in his kitchen. What has he produced in life? Thanks Depth for giving me the right frame of mind when I read these kind of stories and sometimes wish it was me. I know its the completely wrong thing to want, but always need/welcome a reminder. Just chose your pill you can swallow and sleep well:\n1. Bet On NVIDIA, or\n2. Bet on semis (SOXX), or\n3. Bet on Technology sector (VGT), or\n4. Bet on S&P 500 (SPY), or\n5. Bet on Total Market (VTI), or\n6. Bet on world (VT), or\n7. Throw some bonds… etc #1 Should not be the answer for most (including me). But some would get NFTs, go figure. Disclaimers: Many, many years ago I did my Masters degree in SW in AI neural networks.  And I respect the technology. Many years ago I spent time with blockchain and BTC from technology side. My conclusions were: CRAP! So, where are you now? Where investment wise or technology? I do mixture of 2-5.  Chips have been cyclical, they used to be. But history does not have to repeat itself for this. There is a risk of (major?) corrections in the short-mid term. But for the long term chips (or equivalent) will power the future economy including VR/AR, and this is my bet. I don’t bother much with timing (just having OK the entry point and hold). Just having enough extra margins/buffers makes me quite at peace.\nWhy I don’t hold NVDA directly? Just not feeling like I need the rollercoaster ride because I don’t have to. In few years competition can overtake NVDA. Re Tesla: Crazy that there’s almost a negative correlation between share price & profitability. NVDA frustrates me. No way its worth that much. But I have faith its share price will fall back to reality soon, just like Wolf points out w TSLA. No need to be frustrated. Short nvidia or even soxx. What I’m missing? The problem  Is market can remain irrational  long-term than you can remain solvent Stocks can stay irrational longer than a short can last Very true and I would not short NVDA, I’m just a little more smart than the Fossil Michael Burry looks like LOL! But if someone is sure about “NVDA frustrates me. No way it’s worth that much. But I have faith its share price will fall back to reality soon, just like Wolf points out w TSLA.” then has to short. I believe in science and logic. I wanted short Tesla at 75$… “The market can stay irrational longer than you can stay solvent.”\n— John Maynard Keynes Is there a correlation between the gamblers bank roll and teh outcome resulting from teh roll of the dice?\nCurious animal that stock market  … at times it discounts the present, the  future, and even defies the law of gravity, but never more than a few years.\nI like Wolf’s phrase  …. “consensual hallucination” Before AI hijacked what little rationality existed on Wall Street investment pundits, only humans were hallucinating. With AI being implemented, both humans and computers will be hallucinating.\nIt will be entertaining how Dave and Hal will eventually settle their dispute over future dominance of investment, speculating practices. @Biker Chique 01 are you @Biker’s wife? “With AI being implemented, both humans and computers will be hallucinating.” 👍😂 I work in CA government and told to cut back on all but essential expenses.  State is hugely dependent on capital gains so while it was flush a few years back it  is in the hole until another big sell off.  Admittedly CA is hugely irresponsible with its money but at this point, barring something unseen, there will be none of like that with COVID collapse.  Be interesting how the next few years are navigated as each exiting governor always leaves the incoming one a deficit and this appears no different.  Strange a 20% correction in the markets could make California flush again in 2025 but simply would start the cycle all over again. Nothing to worry about.\nCA will; be rescued by Julie Su, formerly EDD Secretary, currently Acting US Secretary of Labor.\nUnder her watch, CA lost possibly as much as  $40 Billion to COVID unemployment fraud, while inconvenienced hundreds of thousands of unemployed workers desperately short of money to pay for basic necessities through her completely inept, incompetent’ style of management and leadership.\nWell California, Julie Su, at least you have her to look forward to. Confused on how you spend money in CA that’s not essential can you provide an example of something you could buy before but dont now.  Other than travel I don’t see any way to cut state expenses If I hear “AI” one more time… ai this ai that. The intrest in “ai” coincided with the 2000s boom as well. I keep putting “ai” in quotes because really this is still computing. People keep thinking we’re going to have sentient ai. These models don’t think. They are based on patterns. Just like the algorithms that calculate the shortest path when using Google maps to go somewhere. I don’t know of anyone getting much of a huge productivity boost beyond some neat tools like summarizing meeting notes and generating the boiler plate code you need. It’s a neat tool but doesn’t warrent this level of enthusiasm. Wolf hit the nail on the head in terms of meta or any of these large data centers buying up graphics cards. They’ll eventually make their own or a competitor will. Remember Cisco in the 2000s? Wasn’t long before it was replaced by Juniper! Another point is maybe there will be a huge efficiency in these algos where the compute requirements are much less. Exactly many people don’t understand the fundamental comp-sci 101 concept of weak vs strong AI. A weak AI is basically machine learning that can generate things based on its own programming. A strong AI is a machine that can rewrite its own code better and mold it’s “mind” own its own essentially. Don’t get me wrong, the current wave of “AI” systems are quite impressive but they’re not ground breaking. This isn’t the point of the monkey picking up a rock and hitting another rock and making fire. This is all still weak AI. We’ve yet to reach the point where a machine is self-aware and can generate its own ideas and corrections without external input. This is just the latest tech-bro silicon valley fleecing that’s always been going on. Same as how 2-3 years ago every company was a part of the block chain. Everyone threw billions at “innovative block chain technology” without even knowing what the hell that even meant. I’ll give you that many jobs will likely be lost and done away with in the coming years. If I was an accountant, voice actor, writer, or something like that, I’d be worried. The hype of nearly every white collar job vanishing in 2 years is utter nonsense though. You grossly underestimate what you’re looking at. This distinction between “strong” and “weak” AI is a misunderstanding, as what you write as strong AI is not what it is. The better terminology that is less confusing is between specialized AI and generalized AI, and for any definition of generalized AI that we, for example, would fall under for intelligence, it’s only a matter of training a variety of specialized AI models together in an applicable domain to which we want it to function in. This latest wave of chat based AI systems are actually remarkable, and by and large the biggest type of specialized AI we could get for advancing a generalized AI that lay people such as yourself couldn’t argue against (as seems to be the wont). What’s coming out of large language models is wholly unexpected, and training other models alongside LLMs yields remarkable results. Anyone who looks at these and thinks “Oh, they’re ok, nothing ground breaking” doesn’t really know what they’re looking at, and hasn’t taken a peak at the academic literature being generated around them. It’s people seeing consumer targeted goods and assuming industry targeted goods are of the same worth having zero knowledge of the industry use. Anyone comparing AI to blockchain technology is just reaffirming they don’t know what they’re looking at. Blockchain was only ever going to be useful for a tiny subset of uses. Specialized AI alone is changing so much as we speak that most people have no direct view of, never mind what actual AI research and development is doing. Not commenting on Nvidia here, but scoffing at the current state of AI is almost like looking at an iPhone and thinking “this won’t last, what use does this thing have.” Yes I said many jobs are going to be lost. I was more directing this as the crowd of people who run around saying we’ve basically created Terminator or HAL 9000. Then again, I’m a truck driver surrounded by AM radio listening boomers who can’t dim the screen on their phone. All I hear is how ChatGPT is about to become basically Animated Mastercomputer from I Have No Mouth and Must Scream. This current artificial intelligence isn’t that. This generative AI isn’t the point of singularity and it isn’t strong AI. I’d call something like the invention of language, invention of numbers, discovery of fire, printing press, nuclear weapons, etc as ground breaking. Those are things that completely reshaped every single human life and changed the entire structure of society. The singularity will cause that and possible be the biggest event in human history to that point. This recent wave of AI won’t do that from what I’ve seen. Granted I’m not studied on it but I think this is mostly more hype driven crap from marketing execs. It’ll be big on some sectors just like buttcoins was big for pump and dump artists and scammers. Just like how all those jobs of shuffling around punch cards vanished or the beehive hair ladies operating company switchboards being moved or laid off. Don’t miss the forest from the trees. Even 30 or so million jobs being automated away isn’t going to change the way society works globally. There will be a lot of growing pains as a lot of middle class or upper class people suddenly find themselves worthless in their field and the job market, but again, it’s not comparable to faster than light travel or built a base on Mars. NF Can you enlighten us more please?\nIsn’t the very soul of ai the global data base it assesses? Considering there is a great deal of bogus data out there, how does ai deal with that bogus data. In other words, how is it expected to sort the black pepper from the fly $hit and generate useable outputs? Seriously. Most entry level knowledge jobs will be eliminated in 5 to 10 years. A single experienced professional can boost productivity 5x with the existing tools. Management doesn’t have a clue about AI, but the push is coming from the top and they only care about ‘efficiency’ and cost cutting. In the coming recession, AI will be used as an excuse to halve the workforce. At least 40% of office jobs are BS anyway (see David Graeber). Niall – …and every one of those displaced will simply vanish into the ether, their labor or custom from that labor no longer necessary, yes? may we all find a better day. This could be the right thread to post this. \nOver the years reading the comments here is that the majority of commentators are averse to risks and have a “the end is near” mentality.\nHow the market behaves is the reality, not much we have control over. So rather than being frustrated it is better to act. Instead of fearing, learn, expand your knowledge. That would prevent you from buying the meme stocks/BTC etc in the first place.\nI really mean it, this is not a “look at me i got lucky” post. People that take no risk in their lives cannot be successful. One should take as much risk as they are comfortable with (aka what the worst can happen safeguards). In many forums the “panic” is self-fulfilling. One’s fears grow on other frears. This is not the way to live. I would hate it if I had most of my $ in bonds or gold and then frustrate myself when there is no recession. I refuse to live my life under constant fears. I do not claim I know what happens in the future, but I take calculated risks. There is zero fear in holding a safe, appreciating investment. Your definition of success may be different. “holding a safe, appreciating investment” sounds like oxymoron.\nHolders of TLT and BND could tell their story. I’d be surprised if non-traders here hold TLT or BND. @Biker I have not listed the name of every WS poster in Excel and sorted the list for “likes risk”, “risk averse” and “risk averse with a the end is near mentality”, but I don’t think that the “majority” (or even one in four) have a “the end is near mentality” (unlike on other sites I have not read about a WS poster saying that he is selling his gold to buy food and ammo to get ready for the end of civilization).  Most people posting here seem to be older than average with more assets than average and only a fool would not be a little “risk averse” if they are older and already have a decent net worth (I would not recommend that a 75 year old guy sell the $5mm in stock he has in a S&P500 index fund to put it all into NVDA) Good points. Thanks! Will try to have it in mind. I am probably younger than average for this site – 28. I mostly hold bonds because I’m a highly strung person and I value my sanity above all else. When the market is not insane (inflation is nominal and unemployment is low) I put money in the market. I don’t feel nervous about it then because returns are realistic – 6-7% YoY is reasonable. But when the market goes topsy-turvy it makes me nervous. Thus when CD, HYSA, Tbill yield is so high why would I bother with a market that is going to stress me out? I would rather make less money for lower stress. I was 28 years old once and did the same. I’m 62 now and know, without a doubt, that I was wrong to have that philosophy. I ended up okay, but have probably 1/5th of what I could have had. That is assuming the next 40 years will be like the ones you lived through. My bet is they won’t be. I have rarely heard any commenters on this site talk about gold, guns, ammo, and beans.  That is ZH stuff (which is sometimes an amusing site).   People ask me why don’t I take on more risk.  I tell them because I don’t have to.  Risk-taking is for people trying to make their pile.   Once you have made it, risk-taking just to make more seems almost stupid. That makes a lot of sense to me.  If you’ve reached your goals, then be grateful for your good fortune and enjoy your life. Biker- “The weeping philosopher too often impairs his eyesight by his woe, and becomes unable from his tears to see the remedies for the evils which he deplores.”\n  — Charles Mackay, Extraordinary Popular Delusions and the Madness of Crowds Nice! Was reading something about how this crazy bubble with Nvidia is very similar to Cisco before it imploded and never got back to its all time high.  Both companies have strong profit and revenue but that didn’t stop the fact that the bubble still popped. I am sure Nvidia fanboy will say this time is different.. Once again,  it’s funny to see this kind of insanity in a supposedly tightening financial condition QT environment… good luck to Pow Pow on fighting them inflation.. A lot of the apps for AI seem just like dog work, eg scanning resumes, looking for the magic words or phrases. Bet ‘AI’ itself will be one. No doubt this is just for screening, because anyone who hires via AI alone is in for some nasty shocks. The other app getting attention is manipulating images and sounds including voices to create alternate ‘realities’: Many will be criminal, using fake videos or voices to defraud. Others will create great entertainment. Maybe Elvis’s movie career has just begun, subject to legal issues No doubt there are real and useful apps. This differs from another darling, where the hype is pure: Bitcoin. There is only one actual use for BC: ‘ransomware’. The ransom is perhaps the ONLY transaction where the payer has to trust the payee, and where there is no third party handling and verifying the payment. And no rush, because all the victim can do is hope. The theoretical max speed of BC is six transactions per second, laughable as a medium of exchange, aka ‘money’ A day or so ago a DB market analyst noted that the US tech markets are the most concentrated since 1929. The one day 250 billion bump in NV looks like the high water mark. Ransomware is not the only use. Just one of a number of criminal activities. To be clear, Criminal activity is the only use. Also, to be clear, politicians love BTC because of that feature. Nothing like an anonymous method of executing this kind of behavior. Look at the Senator who is on the ropes for illegal payments using gold as an example. No politician is going down that road again now that BtC has been found useful. This is also the only reason politicians have not legislated it to be a fraud. Bitcoin, and crypto in general, is readily trackable.  That’s what the blockchain does (gross simplified).  Every transaction, including theft and/or remuneration for criminal activity is traceable to a specific coin or fraction thereof, and that ledger entry follows said coin in perpetuity.  When the rogue agent converts crypto to fiat they’re outed in the real world, assuming law enforcement is interested. True anonymity only exists with cash (my preference) or in a cyrpto-only economy, which is not something we have to worry about in the short term.  Plenty of problems with crypto, but anonymity ain’t one of them – yet. I guess I don’t understand how a crypto -only economy could be anonymous if the blockchain address is tied to a transaction and specific quantity with timestamp in a public ledger. Or why a more durable money like physical gold bought for cash is not anonymous, if it’s a private transaction in person with your trusted coin dealer. Selling is just as discreet as those involved.\n     I think that most governments have few objections to financial speculation in crypto because it’s relatively easy for them to keep an eye on it and tax the profits.\n     If there are no alternatives, money can be whatever the One World Government decides it is. Globalism isn’t doing so well, for good or ill. I must have made a lot of multimillionaires anyone who read ant of my comments back in August 2015 and never sold. I put it on youtube, Usenet and various blogs. I also parlayed Nvidia (bought at $20) onto AMD at $120 and $6.25. Trump’s trade war with China cost me millions on that parlay. I was out at $80 on AMD. Hmmm – all the AI bubble hype is hard to believe but under sober consideration AI is amplifying winner-take-all dynamics that always exist in markets and even more so in the digital economy. We see the S&P 500 narrowing down to the Mag 7, then narrowing down to the Mag 2, until NVDA even leaves META in the dust? The narrowing of markets cause these euphoric bubbles based on beliefs rather than reality as price multiples expand due to exuberance and FOMO, but the process will continue on steroids until it breaks. That requires some kind of breakdown in liquidity and a reality check.\nBig Data tech companies can actually boost productivity and stock prices by shedding employees made redundant by AI, so the tech layoffs are not necessarily bad for earnings and stocks prices. I suspect that’s why market action is flowing in their direction. I guess one needs to see small and midcaps advance to confirm any of this bubble mania, but the Fed and UST seem determined to keep it flowing. > Big Data tech companies can actually boost productivity and stock prices by shedding employees made redundant by AI, so the tech layoffs are not necessarily bad for earnings and stocks prices. Just want to push back on this, while layoffs are happening these companies are generally not contracting. They’re laying people off but then hiring more people a few months later. I don’t really think that’s indicative of AI induced layoffs, unless your read is that they’re laying people off in favor of AI and then finding out that AI isn’t good enough. It’s highly unlikely that the layoffs were done “in favor of AI” and then that experiment was found to be a failure in a matter of weeks.  Corporate reshuffling happens all the time and as WR has noted the highly public layoffs were a good way to remind folks that management still has some leverage in the fights over pay, WFH, etc. I am someone who works in the chip industry and can tell you more and more competition for nvda  is coming . As wR said.. forward guidance is pipe dream which may or may not materialize. Exactly. I posted this in another thread: “Third, and while this is somewhat dependent on market forces and the competition from other chip makers, but I’m skeptical that NVidia will be able to maintain its enormous profit margins (75%?! or so) going forward. Look at Tesla. While they have expanded their market share enormously, they had to reduce their prices (and thus, their margins) significantly to do that.” Nature abhors a vacuum. The nature of the free market means that grotesque margins won’t survive long term, not unless the government puts its hand on the scale somehow. I agree that NVDA is a bubble, but Tesla isn’t remotely comparable, during the peak of the Tesla bubble it was unprofitable, and there isn’t anything unique about Tesla that a motivated competitor can’t copy in short order (see BYD). At least NVDA is profitable (enormously) and has a short-term position in AI that will take a few years for competitors to match. Still way overvalued of course. What goes up hard and fast comes down harder and faster.  NVDa sells to the mag 7. Will they keep spending at this rate for the coming quarters. Chips are cyclical.  Will NVDa growth be at 265 percent or greater from this quarter ?   Watch for the negative divergences.   There be bag holders and muppets to come As I recall, this: “NVDa sells to the mag 7.” was a feature during the .com ascent.  Internet companies were buying out others, investing in others,\nbased on their inflated valuations.  Same with the S & L collapse:  real estate was being jacked-up with daisy-chain appraisals.  Similar to the lead-up to the housing collapse in 2008. When Cathie Wood was asked to justify Tesla’s insane valuation, she gave an answer that implied that they would own a majority or even nearly all of the entire automotive industry in the future.  The reality was that they would eventually face competent competition. The current Nvidia valuations assume that the hardware needs of the future growth of AI will all land in Nvidia’s pockets.  Even the possibility that Nvidia will face competent competition in the future doesn’t seem to be priced in.  Google builds AI chips in-house (https://cloud.google.com/tpu), and if Nvidia chips start being expensive or difficult enough to acquire, that will motivate various players in the AI software stack to integrate with AMD ROCm. At the peak of the craziness in 2021, the “market” was pricing in that every car on earth would be made by Tesla, every person on earth would do nothing for entertainment but use Facebook, every person on earth would get all exercise on a Peloton, and every person on earth would eat nothing but Beyond Burgers “meat.” Ha ha so true! Does Nvidias positive results suggest anything about the effectiveness of US tech sanctions to prevent shipments to China ?  Has China’s Nvidia market disappeared with enough non-China demand to make up the difference or is China still getting Nvidia product by other means ? The fact is NVDA has a market cap of 2 trillion without the current or future sales to back up the value unless something changes then all bets are off .   Thank goodness NVDA is a USA company ! DM: WARNERBROSDISCOVERY shares plunge 10% as company bleeds… DM: PARAMOUNT put on negative watch… The commercial real estate markets are slumping, residential real estate markets are stagnate and look to roll over, reverse splits everywhere, the fed is ongoing with QT,  And the markets are at all time highs? Now that’s a big WTF. Im scratching my noodle trying to figure out where is all this pent up liquidity still coming in from?\nDid the fed just pull another tool out of its tool box, kind of a ‘hide the peperoni’ moment, or has the PPT suddenly arrived to the scene with its tools to?  Haven’t heard much from the presidents working group lately, formerly called the plunge protection team… But im sure they got a big ear to the curb here. I remember when reagan first came out with the ppt in 1988, just after that 1987 crash.. I think it was presidential order 12631  under reagan, if memory serves. But you can bet your bippy, something is cookin in these parts. “Now that’s a big WTF. Im scratching my noodle trying to figure out where is all this pent up liquidity still coming in from?” Yes, it does seem weird but setting aside IPOs and buybacks it’s just a circular flow. For every buyer putting in cash there’s a seller taking the same amount out. What moves prices is the relative eagerness of buyers vs sellers. In other words, is it mostly the offer being taken out or the bid being hit? About the only complicating factor is that the use of leverage tends to rise along with the price, which creates inherent fragility. As Wolf puts it: “Turns out, these WTF spikes are a state of mind. And when that state of mind changes, the spikes unwind.” By end of year, Nvidia could have between $80-$90 billion in cash, depending on what they do with net income.  That is Apple type money, without the debt. They officially have very deep pockets now. I can see how future demand might be an issue, competition is not. Competition  would definitely  be an issue. It’s a matter of time. Tesla thought the same about no Competition. The dot.com bubble was popped by Greenspan.  It was designed to be popped.   Greenspan injected too many excess reserves into the banking system in preparation for Y2K.  Then he had to wash them out.  But Greenspan didn’t learn from his mistake, “Black Monday”. Likewise, Powell has increased reserves by the draining of the O/N RRP facility.  The increase in liquidity has been associated with a rising stock market. Between November 2020 and October 2022, Nvidia shares plunged by 65% Wolf, I think you mean November 2021, going by the graph. It went up in 2020. Yes, typo, thanks 2020 should be 2021. Fixed When I was a kid I remember the run that video game systems had. Every 2-3 years a new one came out the made all the old ones entirely worthless. Then eventually, the hardware surpassed the software and now you could play just about any game on a 5-10 year old gaming console (or even a phone for some). But during that run a $300 gaming system would be worthless when the new generation came out and everyone would run out to go upgrade. This is what’s happening with NVIDIA but instead of a $300 Xbox they make $30,000 H100 GPUs. Much cheaper specialized inference hardware will be competing against the bloated GPUs.\n“Startup Groq has developed an machine learning processor that it claims blows GPUs away in large language model workloads – 10x faster than an Nvidia GPU at 10 percent of the cost, and needing a tenth of the electricity.” MARK…are you serious re GROQ?\nREALLY?\nHave yo invested in this Co….or is this not possible now? “Turns out, these WTF spikes are a state of mind. And when that state of mind changes, the spikes unwind” May be. But seeing Tesla’s chart – 6-8 times (say $100B in 2020)  in 4 years is still not bad. Basically 100 to 1000 (this happens fast) and back to 400 (happens in 3-4 years) is not a bad deal. Amazon was $9 at the end of dot com bust when it started its travel to the moon what specifically relates to nvidia’s stock prices in addition to market hysteria is the actual GPU chip market that they compete in. supply has been constrained relative to demand, which I believe will continue to grow steadily even if some investors grossly overvalue stock prices, but look at nvidia’s competitors on the chip supply side for what will impact its stock price despite today’s hysteria. AMD’s new chip is better and lower cost than  nvidia’s. they will give nvidia a run for its money. It’s an interesting one. If you look at Steam game platform, their average user is still running nvidia gtx 1060 level graphics.\nThe pandemic market silliness messed this up further with high price rises so a great deal of possible upgrades never happened. Along with console graphics performance and their market abundance, most games are designed to look good at around that level of graphics power. You basically can spend about $250 on your graphics card from nvidia or amd and get ‘good enough’\n$500 is top end. Over that is just not required in practice. I can’t see how real market demand will lift in this segment while prices remain so high and generational advancements remain so low.\nNothing is driving the need to upgrade. And in the professional gpu markets, if AI really is going to take off in visual creative sectors and displace many seats (if not jobs), then the AI industry GPU sales is eating into pro GPU sales in lots of creative areas. Interesting times ahead. I think copyright issues and the training data issues are going to kill this phase of generative AI.\nMost of the people who’ll lose out from generative AI (artists, actors, designers, etc), are the ones who’ve had their work scraped or copied to make all this possible in a way that makes it all look as convincing as it does. AI leaves much to be desired so far.  I am an expert in a very specific field.  When I asked ChatGPT a question concerning it, it responded at pretty much a high school level and left out some very important references.  If you don’t expect much more from AI than Wikipedia level knowledge, then I guess it is okay.  Maybe it will get better.   I turned off the Brave browser Summarizer (a kind of AI) as it was just wasting space on my monitor. William Leake, one should not underestimate how quickly these things get better. Having built ML and AI models personally I can tell you that this is just the beginning and this technology will transform several things. AI is a bubble because these changes will take time and the winners are yet unknown. It is like every other technical revolution in history from canals, railroad, electricity, locomotive, internet, etc.Likely this will first collapse before pieces are put together and actual useful solutions are created. But for now the Silicon valley hype industry is winning. Few people are getting rich at the expense of everyone else. So the usual stuff boring boring…. I am part of an expert advisory network and often speak to financial analysts who are interesting in this technology when evaluating some tech companies. And the fantasies they have built (and looking to validate) are mind blowing to say the least. Will never understand why they are paid so much. Aman- “… this technology will transform several things.” Could you elaborate on which things you are referring to here, if I’m not being too nosey? Thanks. Conceptually any job that requires subjective judgment with a clear outcome can be automated using the right model. Examples could include\n1. Analyzing medical reports, correlating with prior known illness and diagnosing likely problems\n2. Administrative work of managing schedules, meetings, note taking etc.\n3. Summarizing or proof reading legal paperwork\n4. Troubleshooting operational bottlenecks in supply chains and recommending course of action\n5. Risk assessment in insurance, portfolios etc.\n6. Predicting likelihood of commercial success of new media content (movies, songs etc.)\n7. Digital interfaces and peripherals\n8. Translation, real time transcription (already there but better quality)\n9. Tax filing, audits etc. In a way it will transform mid to low skill work which requires judgment and subjectivity. My view is that the impact of this technology is going to be limited not by the availability of chips but availability of trained engineers to train models. Hope this helps. Happy to discuss further. Good info.  Thanks, Aman. Wolf,\nI know you’re following fin news in Nippon….thought you might have perhaps missed these 4 news articles in Bloomberg by Howard Chua Eoan in the OPINION section yesterday. FYO (For Your Eyes Only)\np: Alas I couldn’t share the screen shot! 1) Nvidia sentiment had a 7 sigma (!) spike. That’s top 0.00….1% percentile. The good news, this drama started cooling down a bit on Friday.\n2) As an insider and many years hands-on practitioner of AI must admit GenAI is a fancy autocomplete: autocomplete words, pixels, voice, etc. No intelligence whatsoever. Don’t get duped in this. Investing in it you pay dollars for pennies. I would never own an individual stock like NVDA because it’s well outside of my risk profile. My only concern with it right now (along with other Mag7 stocks) is the extent to which it’s distorting index funds that I do own. The trick is keeping AI from getting ‘inside’ your risk profile. A couple of big books from a few years ago by Yuval Noah Hatari:\nSapiens A Brief History of Humankind and Homo Deus. I see the future of AI doing everything and as long as governments prohibit it from taking our sperm and eggs we will be relaxing, getting high and having sex while the money shows up in our bank accounts. I hope the future manifestation of myself enjoys it. Will AI be able to do my laundry in the future, or cut my grass? Probably both. Your AI self-driving lawn mower will mow your lawn to perfection while you sit and watch the football game.  Over time, it will learn to not run over your neighbor’s poodle or cat. What is this worth to us? I am old enough to compare this to the internet dotcom bubble. Valuations went through the roof with any company with .com or E in their name. Then everything crashed because the internet isn’t THAT valuable. The internet is here to stay and I use it every day but the value of it in 2000 was vastly overrated.  AI will be with us just like the internet. Rico – my concern is that it eventually develops itself to a point that it can experience boredom (oh, the mischief that will ensue!)… may we all find a better day. Wolf, Only you could write this article. brilliant. Thank you.\nIts the future reality that matters, When this parabolic NVDA “bubble bursts”, ( See Chart )\nthe consequences will cascade like domino’s,\nspreading like wildfire thru this stock, the entire AI  Bubble,\nand ultimately thru the entire hallucinatory US stock market. Forewarned. I recently had a “chat” with an AI driven “chat session”.  Asking why one of my accounts with a firm I deal with showed that it was “inactive” when I’ve paid every account subscription payment on time and without fail. As confirmed by their payment history window. I got a lot of chat replies on how I could become more active, and several links to articles about exercise routines.  After again trying to clarify the question, more links to “leisure activities” and “activities for seniors” arrived. After 10 minutes of this, and exhausted from all this I quit the chat.   Then come the email surveys asking me if my chat session helped me with my “inactive” status.  Now I’m getting ads for gyms, and exercise bikes.      AHHHHHH!!!!! That’s funny! More and more E seems like something to deal with. The promise of AI in fields where pattern recognition plays a role, and in basic knowledge work like accounting and financial analysis is enormous, NVDA is a bubble for sure but AI will totally transform knowledge work in 5 years. “Once men turned their thinking over to machines in the hope that this would set them free. But that only permitted other men with machines to enslave them.” — From Frank Herbert, Dune From the OC Bible in Dune: “Thou shalt not make a machine in the likeness of a human mind.” Government and religion got involved and that was the end of AI. We only need a click through prompt from Windows CoPilot to designate our AI voting proxy for the US political parties to 100% support AI. Who better to decide, who I should vote for, than the company that knows more about me than my spouse? If you think AI is a bubble, then tell the Chinese gang that they are wrong when scrambling to catch up with AI and possibly use it in military against us. I don’t recall that Xi was big on blockchain. In such short time, “unlimited” used cases are being created daily. Some of them fakes, normal. And the progress with the technology is very fast.\nBlockchain, after 10+ years, does not have any use cases with decent meaning. No progress with blockchain, and never been. The “progress” was about hacking around the building-in inefficiencies. Not doable since the protocol is by its very nature inefficient. And it MUST waste the tons of energy for validations. Since the AI innovation is so fast there, the growth will have some pullbacks in the sort/mid term, for sure. Now the financial market is tight. If now would be 0% interest rates then it would be easier to call it a typical bubble. My definition of bubble: Fast growth in asset value. It bursts and whatever is left has not much value. For investors better is wait it out. In the long time span just a blip and burned. e.g. tulip mania. With AI, the growth is fast (the first part). I don’t think that the rest is applicable. I don’t see that one can wait it out. There will be winners and losers and everyone is spending to be a winer. Now NVDA is making a lot of money, but the companies buying their chips need to pass the cost on to their customers.   Will Meta be able to charge more for every new AI ad?   Do their customer have more money to spend on AI ads.  Will AI ads be so much better that a customer only need to buy 5 ads to be as effective as 20.  Now Meta may charge more for those 5 ads but they are selling 15 less to the same customer.  It could be a wash in revenue?    Their AI investment may just mean they are a survivor?  But then again, would Facebook disappear if they did have AI ads.  Would people quit using Facebook if Meta did not buy 350k AI chips? It will be interesting to see how this plays out. Let’s say I want to buy a home blueprint.  Will I pay more for an AI generated blueprint over a human made blueprint.  No.  But the company that sells the AI blueprint did remove an expense of having a human architect.    They may see a bigger profit as long as the AI expense is less than a human.  Also, AI may be able to generate 1000s of more blueprint designs than one human, but I will still only buy one blueprint and may actually demand to pay less since it was easily built by AI.   Better yet, what if there is  an open source home blueprint AI that will create my blueprint for free? ru82 – sounds like-what was that word of recent memory? Oh, yeah: ‘disruption’ (…only that things appear to be drifting towards more ‘self-disruption’…). may we all find a better day. I wrote this comment in a previous thread unrelated specifically to AI and NVDA… The comments here tell me this is why there are only a few truly visionary entrepreneurs in the world who can SEE what might be possible, while the VAST unwashed (like me) can only see what’s right in front of us… The possibilities of where this technology can lead is BEYOND most of us’ ability to imagine. Science fiction often becomes reality over periods of time. I could give examples, but I’m sure most here can think back to things that seemed impossible only to become staples in day-to-day life. As to AI, for one example, I think something along the lines of the movie “Blade Runner” and much of its futuristic tapestry is one of the eventual outcomes of an AI-infused world. But it’s only one thread of many of where it might lead…But it will lead somewhere that most of us can’t imagine today. The question is not if, but when, as technology feeds on itself and grows exponentially. Pets.com. So-called ‘technology’ is headed to shrinking exponentially. I’m assuming you are shorting it. This is helpful for the market. Thanks. I disagree, there are millions of them who can see the future, the thing is there wrong and fail in equal proportion to the unwashed masses and we only learn of the winners. The national security state will clamp down on Ai and that will be the end of that.\nNo way, no how will they allow this to take hold and lose complete control of the narrative.  This is such a setup.  Allow the money to come in, make billions, and then pull the plug.  Anybody who complains is a traitor.  Perfect. if using AI to help us make daily decisions is going to be a “benefit” to us, I suspect AI will take those opportunities to see that we are fed even more marketing emails and texts than we get now.  i hope my ISP upgrades their spam filters accordingly. Here’s a big problem in my opinion. Stocks like NVDA may not be worth what they currently trade for, but people who own them have made tons of paper wealth. They are encouraged to spend more in the real economy, and so the Fed thinks it is obligated to protect outrageous asset prices via lower interest rates and QE to avoid deflation in the real economy.  It’s another form of too-big-to-fail, safety in numbers, etc. What starts out as a harmless speculation becomes a wealth-effect and systematic economic risk, assuming joblessness and price deflation are to be avoided.  It’s not just NVDA.  It’s MSFT, AAPL, FB, GOOG, many other cash flowing stocks, homes, and other overpriced assets that form this systematic risk (the “everything bubble”).  This wealth effect has been supported far too long. Sure, the Fed let some small high-flyers fail in 2021 and 2022, as well as Bitcoin, but this didn’t pose a systematic threat.  Letting larger parts the everything bubble collapse, like the NASDAQ or S&P 500, is a different matter. The Fed has always come to the rescue after a significant drop in the stock market indices.  Given the Fed’s formal policy of annual 2% inflation, the Fed must respond in the face of an overall asset price decline. It’s built into policy. If anyone disagrees, please tell me how asset prices can suffer a meaningful decline WITHOUT triggering deflation in the real economy (i.e., a meaningful recession)?  If it were possible, I don’t think the Fed would be so careful when pursuing its soft landing.  The Fed seems to be accepting 3-5% inflation for many future years, despite the recent three-year 20% inflationary spike.  That evidences a real fear of deflation in my opinion. Some people might accuse me of wanting a “blow-up”, when it’s really the Fed’s refusal to accept periodic cleansing recessions that promotes these blow-ups.  Our experiences of 2000 and 2009 were not unforeseeable events, unless the long-term blinders are on.  Playing around with moral hazards has real consequences. Continuously rising asset prices and p/e ratios are a systematic problem.  The Fed needs to understand that and start considering that as part of policy. The Federal Reserve has nothing whatsoesvewr to do with NVIDIA or any other equities (stocks) that speculators bid up far beyond any realistically conceivable net worth and that has always been the case. Fed does not want the assets to go down as they themselves are deeply invested in assets. I Remember few months back Powell said financial markets are doing the job of rate hikes when stock market was down and financially conditioning were tight.\nNow financial conditions are much loose.. woupd Powell come out and say financial  conditions are not helping feds cause ? “Given the Fed’s formal policy of annual 2% inflation, the Fed must respond in the face of an overall asset price decline.” Asset prices are not included in PCE or CPI, and those are the measures of inflation. If asset prices were included in the Fed’s inflation target decisions, financialization would never have been able to reach the level that is at now. That said, I agree with you that the Fed won’t allow asset prices to decline without acting, even if it is after the fact. “people who own them made tons of paper wealth”.  The profits (or losses) are not real until they sell.   When people brag to me how much money they have made, I ask them “Did you sell?”   The answer is usually no.  I tell them it ain’t real until it’s sold. Agree, but doesn’t the Fed’s fear of deflation essentially secure those gains, moreso than in the past when QE and long-term interest rate suppression were not tools in the toolbox? How can the Fed let people suffer significant (albeit well-deserved) asset price declines while avoiding systematic risk to employment and price levels?  A reasonable conclusion is that it’s not possible, and the Fed stock market put is a tight stop.  Overvalued herds of assets get protections (stock indices, housing, etc.), but individual members of the herd do not (Bitcoin, Wolf pantheon names, etc.), particularly when these individuals are young. “The ban includes top policymakers such as those who sit on the Federal Open Market Committee, along with senior staff. Future investments will have to be confined to diversified assets such as mutual funds.  Fed officials can no longer have holdings in shares of particular companies, nor can they invest in individual bonds, hold agency securities or derivative contracts. The new rules replace existing regulations that, while somewhat restrictive, still allowed officials such as regional presidents to buy and sell stocks.” I think Fed family members are also restricted.  But Fed members have friends, lawyers, and others to buy stock for them.  The Fed’s mandate has nothing to do with the stock market.  But we all know they are involved in it (wink wink nudge nudge).  My guess is Fed members are worried about banks, pension funds, and their own portfolios.  They really do not care at all about individual investors. Can variations in the prices of stocks be considered a “systematic risk to employment and price levels”?  Well, they were in 1929.  I am not sure if they have been since.  The FDIC has prevented, or postponed, systemic risks associated with failed banks.  Personally, I am drawing down my bank deposits and moving them to T-bills.  I get a better rate and I don’t have to deal with a systemic collapse of banks, which is unlikely, but not a zero probability. “The Fed’s mandate has nothing to do with the stock market. But we all know they are involved in it (wink wink nudge nudge).” Agree, but assuming the Fed is supporting asset prices to prevent recession and deflation, shouldn’t the Fed explicitly admit to it and explain how it impacts Fed policy?  As it stands now, people who listen to the Fed might think the Fed will let the stock market drop significantly.  These trusting individuals might not invest in the stock market (due to overvaluation), and they become victims of inflation when the Fed “surprises” everybody with stimulus every time there is a market hiccup. Right now, lots of people think the Fed will not resort to QE next time stock indices drop.  Others think they will.  Which is it?  A transparent Fed would communicate its intentions in this area.  How can people plan and invest not knowing whether the Fed is going to intervene with massive stimulus, on the short or long end?  Isn’t the lack of transparency around the Fed’s intentions and tools a major source of uncertainty that benefits insiders at the expense of the public? “Isn’t the lack of transparency around the Fed’s intentions and tools a major source of uncertainty that benefits insiders at the expense of the public?” Of course. No. @ William, I bought 100 shares in Dec ’17 at just under 200. It later split 4-1, so 400 shares @ 50. After the split, i’ve sold 300 shares on the way up and still hold 100. I’ve done well, but EVERY now and then I whink but what if I hadn’t sold any… and then I remember my experience w/ Nokia stock. I’d bought 100 at 129. It split 2-1, then 4-1, so I had 800 shares @ 16 1/8, which eventually hit a high of 65/share. I rode it all the way up… then all the way down…then I did it again when it had one more run left in it going from about 15 to 45.. Didn’t sell then either. It’s been in the low single digits for years and I’ve been selling some shares for the tax loss… So, w/ NVDA I learned my lesson, and Have taken profits, even though this time I’d be up 16x in just over 6 years. But I ain’t complaining… :-) Wolf, How often do you see incidents like NVDA hitting a bubble top, then crashing almost 70%, then going right back into a bubble? This appears to be a very rare incident in history– it happened during Dutch Tulip Mania, South Sea and related bubbles in the 1700s, and a few times during the 1800s. A few stocks did this in the 1920s. [Clearly this doesn’t mean go out and short the market as the timing is viciously difficult] Can you think of any other examples? And what are your thoughts about what this says of the economy/financial markets? Do you have any thoughts about the long bond trade (TLT) being in a bear market for almost 4 years? Does this have any application to the market’s behaviour? What’s being restricted. I understand the Fed went from 0-5 percent interest rates but so what. Housing is at a high, stocks are at an all time high, auto insurance is up 40 percent, my home insurance jumped 100 percent, Government debt is high, government spending is all time high, food is double from 2020, gas is still high so how exactly is the Fed being restrictive. Bill, the Fed is not being restrictive, historically.   Note that the average Fed funds rate over the last 50 years (1971-2022) was 4.86%, median 4.97%.  This is about what it is now.  If you leave out the perverse ZIRP years, the average 1971-2008 was 6.43%, median 5.62% (FRED), well above today’s rate.   My point is from an historical perspective (we have no other), the current Fed funds rate is not restrictive and is about normal.  If you exclude the bizarre ZIRP years, the current Fed funds rate would be characterized as loose. This is why all economic indicators are looking good and core inflation is still supposedly high.  But in fact, the average core cpi 1971-2022 was 3.90% (FRED), exactly the same as the year ending Jan 2024 .   Rates have to go much higher to get inflation down to the Fed’s desired 2%.  Powell and his cronies do not have the guts or intelligence to do this. So historically speaking, our economy is pretty much normal and will plug along as it always has.  MSM screeching for lower rates is just a reflection of greed and stupidity.  Lowering rates from the current 5% will likely inflame inflation. I have been in computers over 50 years and seen, used, and read about the tech everyday, and have built supercomputers using NVIDIA GPU cards for the COVID project(s), and have tested ChatGPT. The AI term is being used loosely and I tested it using plain Google searches, side-by-side against ChatGPT and was impressed somewhat by it, but it isn’t real artificial intelligence because it isn’t “thinking” it is aggregating and combining several Google and other search engines  together and typing out in essay form what you ask, and I found using manual Google searches the exact same thing, but it was raw data that I would have to discern what was best – I liked my searches better. Real artificial intelligence will be when we reach “Singularity” where a robot or computer is as smart as human being, and this is MOST important part because it won’t happen until about 7-10+ years away, at best, probably more, and is being worked on by NVIDIA, Google, Amazon, IBM, AMD, Intel, Tesla, and a lot of small startups – so competition will be fierce, along with the hype. The stock price reminds me of Cisco at the dot com era around 2000, and the price can remain irrational for a very long time, until the competition catches up and or supersedes NVIDIA tech, maybe they won’t, – but IMO it will. One thing that hasn’t been talked about and is real important too is the amount of electricity these GPU’s gulp down and this will become a bigger issue when factored in with EV’s and all the demands of other computing, electronics needs. The (5) supercomputers I built for COVID projects, plus (5) others tripled my electric bill, and put out huge amounts of heat, another factor is cooling these CPUs and GPUs down running at about 180-210 degrees F. In summary there will be lots more competition, hype, controversy, etc, and the likes of Google, Bing, etc are already concerned about the data that ChatGPT(s) uses from their databases, – then you have the people who published the info that’s available, and guess what? – here comes the lawyers about infringements, patents, regulations, ownership, etc, etc We are a long way off from true Artificial Intelligence, but it will happen, this tech has just scratched the surface. Two comments on the value of AI:\nFirst, jet airplanes piloted by autonomous AI can perform maneuvers at G’s that cause human pilots to lose consciousness. There is no contest. These systems are under development now by many countries.\nSecond, the game of Go, popular in Asia, is more complicated than chess meaning it has more possible moves. The AI model that beat the highest ranked player in the world several years ago performed moves that have never been seen in the several hundred-year history of the game.  Books are being written on the moves.\nAI is the most significant development in human history since the printing press. But unlike the centuries it took for the printing press to transform mankind, it will take decades, or years, for AI to transform mankind to something we cannot imagine.\nNvidia is a once in several lifetimes’ opportunity. I have shares in NVDA, ARM, and NOW, all with 100% plus gains. I have taken some profits to play with the house’s money. Most significant development since the printing press? LOL, okay. According to Larry Summers. What does he know? AI is based on spellcheckers.  Seek mental assistance. Different opinions, no bubble then, yet LOL AI is just another mania. It has been around for at least 25 years. Software analyzed situations, made decisions in a nanosecond, and communicated with humans like Hal in the movie 2001: Space Osyssey. It has just steadily improved. Some hype-slinging stock jockeys have flogged stocks like Nvidia like it is the Second Coming Of Christ On A Cracker. Reminds me of not long ago when “block chain” were the words inscribed on golden tablets brought down from the mountain by Moses. Companies were changing their names to include block chain and the stock would jump. Insane. I had promised myself that I would jump on the next mania after block chain died a merciful death, but 3 family deaths and funerals and moving back to China all at the same time made me miss the boat. However, I’m ready for the next tulip. Bring the insanity! AI has been around for 25 years, but its growth went asymptotic around 2018 when transformers were developed. GPT = Generative Pre-Trained Transformer. MW:  Tech stocks likely headed for a pullback. These 5 charts show their momentum is starting to fade. Well, I would welcome a pullback in tech, and let the small caps fire up? I’m just LONG term investor thinking that the tech importance (owned it for years) will grow over the next 10y. I’m not going to quit the tech because NVDA is maybe overpriced. if indeed nvidia will behave like tesla and the other imploded stocks… shouldnt everyone short nvidia? It seems so clear, what am I missing? You’re not missing anything. You are just earlier than most people. Shorting a stock like this is dangerous, because you have to get the *timing* right, not just the valuation, and there can be further melt-ups. It can be tempting sometimes due to our tendency to become careless but shorting any stock risks losing your entire life savings and, if you have one, your family’s financial stability.  Wall street loves to take the other side of the bet on anyone who short sells.  They will do everything they can to squeeze you and make you cover at a higher price.  You win by not playing a crooked game.  A substantial part of massive spikes such as nvda could be due to short squeezes. Real “Artificial Intelligence” hasn’t arrived yet, the programs I created many years ago would be considered AI today.  —  Read my prior post. Do a Google search  – “Singularity explained AI” and understand!! I’m a bit skeptical of the value because I’ve been in the corporate world and understand it’s much easier to make a case for an investment than it is to actually create value from the investment. Tech companies are flush with cash, it’s not a scarce capital environment, it’s a scarce opportunity environment for new revenue and margin. This company’s numbers are real so long as the investment cycle continues — it seems entirely unsustainable though because LLMs are hard to monetize and it’s not cheap. Microsoft copilot is fine, it’s not the new iPhone. LLMs tell you what you want to hear, not the truth. It’s interesting, but the reality doesn’t match the hype in my experience. There is just no alternative to liquidating every penny of investable capital and purchasing NVDA.  What could possibly go wrong? Apple dropping its EV plans to focus on AI.\nIt tells something about nvidia vs Tesla.\nTesla has big management issues as well. Comments are closed.   Prices of New Houses v. Existing Houses: Price cuts and mortgage-rate buydowns make new houses more attractive.  Reserves, Domestic ON RRPs, Currency in Circulation, the TGA, and official foreign RRPs determine how far QT can go.  Germany is an example of what interest-rate repression and QE do to home prices, and what happens when inflation causes those policies to be reversed.  “Many potential buyers are postponing their purchasing plans in hopes of securing lower rates. Consequently, lower buyer competitions exerted downward pressure on prices”: Realtor.com  They learned a lesson from the mess in 2019, which Powell referred to several times.  Copyright © 2011 - 2024 Wolf Street Corp. All Rights Reserved.  See our  Privacy Policy "
}