{
    "title": "Ashneer Grover shares pic of Tesla car in Delhi, users react",
    "date": "2/4/2024",
    "url": "https://kalingatv.com/automobile/ashneer-grover-shares-pic-of-cross-breed-tesla-car-in-delhi-users-react/",
    "text": "Publisher - New Delhi: BharatPe’s former MD Ashneer Grover has shared a picture of the first “cross-breed” Tesla car in Delhi on the social media platform X. According to the entrepreneur post, the car, a BYD (Build Your Dreams) Atto 3 in Boulder Grey, was spotted in Karol Bagh and has the word “Tesla” on its back. “World’s first ‘cross-breed’ Tesla! Some Delhi boy literally ‘built his dream’ in Karol Bagh @Tesla,” Grover wrote on Saturday. Since being shared, his post has received over two lakh views and more than four thousand likes on X. Reacting to his post, several users shared their thoughts. “Karol Bagh has the answer to everything. Nirvana stays here,” a user wrote. “After looking at this, Elon will set up his Indian plant in Karol Bagh Delhi,” another user said. One more user mentioned, “We are Indians, Sir. We can make our dreams come true in any way”. The BYD Atto 3 is an electric SUV manufactured by BYD Auto. The price begins at Rs 33,99,000. In December last year, a Tesla Model X sports utility vehicle (SUV) was sighted on a road in Bengaluru, and pictures of it quickly went viral on social media. A red-coloured Model X was spotted on Minsk Square near the Cubbon Park metro station, and two separate photos were shared on X — one with the car halted at the traffic signal, the other on the move. 1.16 lakh vehicle of Mercedes-Benz recalled due to potential fire risk 2025 Nissan Kicks unveiled; Packs new design, a 2.0-litre powerful engine, and more Kia price hike: Seltos, Sonet, and Carens cars to be more expensive from April 2024 Maruti Suzuki recalls 16,000 units of Baleno and Wagon R in India; Know why Your email address will not be published.     Save my name, email, and website in this browser for the next time I comment.   Δ TRENDING POSTS IPL 2024: Gujarat Titans win toss, elect to bowl first… IPL 2024: Rahul, Pooran half-centuries in vain as Royals… Heatwave condition returns to Odisha, 3 places record 38… BJP announces MP candidates for Lok Sabha elections in… 2 killed, 3 others critically injured in road accidents in… Career News UPSC Recruitment 2024: Vacancy out for 147 Assistant… NRRMS Recruitment 2024: Vacancy out for 3826 posts, apply… SEBI Recruitment 2024: 97 vacancies out for Grade… OICL AO Recruitment 2024: Vacancy out for 100 posts, details… OSSSC Recruitment 2023: Number of Radiographer posts revised… Kalinga TV a 24-hour Odia news channel is part of Kalinga Media & Entertainment Pvt. Ltd. was founded by philanthropist and educationist Dr. Achyuta Samanta with Mr. Himansu Sekhar Khatua, the noted film maker at it’s helm as the Managing Director. "
}