{
    "title": "Reuters wins Polk Award for coverage of Elon Musk's business empire",
    "date": "2/19/2024",
    "url": "https://ca.news.yahoo.com/reuters-wins-polk-award-coverage-153541793.html",
    "text": "(Reuters) - The staff of Reuters has received a George Polk Award for its coverage of how Elon Musk’s manufacturing operations harmed consumers, workers and laboratory animals. The prestigious Polk Awards, presented by Long Island University in the United States, honor special achievement in journalism, with a particular focus on investigative reporting in the public interest. A global team of Reuters journalists was honored in the business reporting category for reports about Musk companies SpaceX, Tesla and Neuralink. The series of scoops and investigations exposed a mounting toll of worker injuries and one death at rocket builder SpaceX and mistreatment of laboratory animals at Neuralink, Musk’s brain-implant company. Other stories found that Tesla, the electric-car pioneer, covered up dangerous defects in steering and suspension parts; rigged its cars’ in-dash driving-range estimates; invaded drivers’ privacy by sharing sensitive images recorded by their vehicles; and made Tesla Insurance customers wait months for claim payouts. The exclusive reports had broad impact, sparking investigations in the United States and Europe and calls for action from U.S. senators and congress members, along with several class-action lawsuits filed by consumers. Federal prosecutors launched a probe into whether Tesla inflated driving-range estimates after Reuters reported it had manipulated the algorithm in its vehicles’ range meters. Other news organizations recognized with a Polk Award this year included ProPublica, honored for its coverage of secret gifts received by U.S. Supreme Court Justice Clarence Thomas from wealthy donors, and the New York Times, for its coverage of the war between Israel and Hamas. (Reporting by Brian Thevenot; editing by Michael Williams) The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein 2024 Subaru Crosstrek Review, Pricing, and Specs Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises.  Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr.,  (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer “The Daily Show” host tears into the former president’s claim ― and shows why the case matters. 我們致力透過體育推動全民運動，作為官方社區合作夥伴，讓逾一萬名巿民有機會體驗七欖。 The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit.  The former president appeared before a New York judge in an unsuccessful push to delay his hush money trial or dismiss the charges. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Dame Joan Collins has refused to talk about the Duke and Duchess of Sussex after paying tribute to Catherine, Princess of Wales.  The president has been going after his presumptive 2024 opponent with a little more venom than usual The collection launches March 25. President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… "
}