{
    "title": "Musk fights US state of Delaware after Tesla pay debacle",
    "date": "2/15/2024",
    "url": "https://www.legit.ng/business-economy/economy/1579054-musk-fights-state-delaware-tesla-pay-debacle/",
    "text": "Global site navigation Local editions PAY ATTENTION: The 2024 Business Leaders Awards Present Entrepreneurs that Change Nigeria for the Better. Check out their Stories! Elon Musk is on the warpath against Delaware and its powerful business court, moving his SpaceX company out of the eastern US state after a judge struck down his $56 billion compensation package at Tesla. For more than a century, the Delaware Chancery Court has been a pillar of US capitalism, the jurisdiction where roughly two thirds of American Fortune 500 companies register their company. And according to state data, nearly 80 percent of initial public offerings in 2022 were registered in Delaware, seeking the reliability and stability of its court and the expertise of its judges. But Musk is furious at the court, seeing it has a haven for over-litigious lawyers and meddlesome judges that are getting in the way of his business decisions and vision. Read also More hunger, less money: Argentine soup kitchens count rations \"SpaceX has moved its state of incorporation from Delaware to Texas!\" Musk said on X on Wednesday. \"If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible,\" he added. PAY ATTENTION: Сheck out news that is picked exactly for YOU ➡️  find the “Recommended for you” block on the home page and enjoy! The move came just weeks after Judge Kathaleen McCormick voided his eye-watering compensation package at Tesla, taking sides with a shareholder who claimed the entrepreneur was overpaid. The very first state to join the union, Delaware and its courts have long played an integral role in American industry. The Chancery court \"is almost like a de facto government agency in its own right\" that sets the rules for corporate America, said Omari Scott Simmons, a law professor at George Washington University Read also Body Shop's UK business slides into administration A pillar of business, it is the agreed upon institution that guides the internal running of US corporate behemoths and that is not, crucially, the federal government. \"It's a very curious situation in the United States, where if you form a company, you can decide what laws will apply to it, and what courts will hear those laws,\" said Simon Lorne, Vice Chairman and Chief Legal Officer at Millennium Management LLC. \"The only alternative could be federal law, which I think would be a big mistake for the system. Delaware has done a very good job for over 100 years,\" added, Lorne, who also teaches law at the University of Texas. On matters like conflict resolution and governance, US big business abides by the decisions of the court and its decades of jurisprudence. Also a selling point, Delaware judges are not nominated by elections or direct political appointment, but get picked by a non-partisan commission that values expertise above all else, said Simmons. Read also From tourism to energy, Senegal economy braces for fallout And unlike a federal agency, Delaware courts are shielded from the whims of interest group pressure or shifting political winds and the judges are left to give their decisions impartially. Moreover, unlike many US states, there is no chance of facing a runaway jury in Delaware: decisions are reasoned and handed down by the judges alone. Musk's wrath has brought him to Texas, one of a few states along with Nevada that are trying to build up a legal system that could eventually compete with Delaware. While unseating the East Coast state seems a longshot, some observers worry that the trend could instigate a race to the bottom, with companies shopping for jurisdictions with the lightest corporate oversight. Besides SpaceX, Musk is moving his brain chip startup, Neuralink, from Delaware to Nevada, where he moved X, formerly Twitter, after he bought the social platform. Those are private companies where Musk has complete control. Read also Big trade deals likely elusive at WTO meet in Abu Dhabi But lifting stakes at the publicly traded Tesla could prove much trickier, with only the smallest of shareholders able to object and potentially block the move. This has been the fate of Trip Advisor, where the parent company’s CEO has so far failed to move the business out of Delaware because of the objections of a few shareholders. The Delaware court is expected to give its decision on the matter this month. PAY ATTENTION: Donate to Legit Charity on Patreon. Your support matters! Source: AFP Recommended for you      Check more articles for you "
}