{
    "title": null,
    "date": "2/20/2024",
    "url": "https://seekingalpha.com/article/4671725-tesla-stock-may-be-a-star-but-i-still-would-not-buy-it",
    "text": "Xiaolu Chu  Xiaolu Chu I previously covered Tesla, Inc. (NASDAQ:TSLA). In my last article, I mentioned that Tesla's sales and auto deliveries, as well as its profit margins, were not going through the company’s best days, while its stock was overvalued. My view remains unchanged. The most recent earnings report for Q4 just confirms this. Obviously, Tesla is now one of the most popular companies to invest in. It is among the leading electric vehicle, or EV, makers in the world, and it operates in a fashionable and high-growth industry. Its sales have been rising for a while. But I still would not buy this stock due to the company's falling margins and extremely high valuations. In my earlier article on Tesla, I highlighted the fact that the energy generation division was the strongest part of Tesla’s business, showing quite strong growth. However, it is only accountable for 15% of the company’s sales. I also said the third-quarter margins were quite poor. These decreased due to multiple EV price cuts. At the same time, I noted that investors’ enthusiasm remains broadly intact. It is mostly fueled by great expectations, namely of the company’s Cybertruck’s success and fully autonomous self-driving. I noted that it was impractical to rely on these. The company’s valuations were also very high at the time. And well, my thesis remains intact because none of the points made have actually changed. TSLA stock is still overvalued, and its margins are not great. In fact, it resembles popular companies investors massively overbought in the 1990s. A lot of Seeking Alpha contributors have already done plenty of analysis on Tesla's January 24 earnings. I will just do a short recap of the company’s earnings report. Tesla Tesla Tesla Tesla In the release, management highlighted Model Y’s success. In 2023, it became the best-selling vehicle in the world. Free cash flows also remained quite strong in 2023, totaling $4.4 billion, in spite of the company’s immense capital expenditures and research and development expenses. Energy generation and storage profits almost quadrupled in 2023. The cost of goods sold per vehicle also declined somewhat in Q4. So, indeed, there were some positives in this earnings report. But in spite of the cost cuts and economies of scale, Tesla’s profits, namely its adjusted EBITDA and operating non-GAAP margins, have been declining for a while. This is true of the company’s quarterly results and also of its annual earnings. The revenues, however, increased between 2022 and 2023, albeit at a much slower rate compared to the previous periods. The excerpt below, borrowed from the company’s annual report submitted to the SEC, clearly shows the company’s gross profit margins reported for each of its divisions. The data is given for the period between 2021 and 2023. We can see that the total generation and storage segment has been Tesla’s strongest performer, unlike its services, but most importantly, its automotive business. Tesla annual report Tesla annual report Amazon (AMZN) stayed unprofitable for many years but traded very well and at high multiples. But unlike many other high-tech companies during the dot.com crisis, the Amazon did not go bankrupt. In fact, it turned into an e-commerce leader and one of the most popular American corporations listed on the U.S. stock exchanges. It currently is the 5th company in the world in terms of market cap. It has been a mega cap for many years already. Although Tesla is already the leader in EV production, and the industry it operates in has plenty of growth potential, I do not think Tesla is exactly like Amazon. Indeed, Tesla earned a positive net profit in 2020 and is not loss-making right now. At the moment, it is the industry’s leader and is trading at very rich valuations. But it is very challenging to do so forever. Very few companies manage to do so. Right now Tesla is struggling with its profit margins, not to mention the company has strong competitors. I won't go into too many details about Tesla's rivals in this article. This topic was discussed in the “Is Tesla overpriced? Tesla Stock Overview” video. Indeed, we do not know the future. Moreover, a lot of companies went bankrupt after the dot.com bubble burst. Lots of corporations decreased in size but stayed afloat for a while. So, we can safely say that Amazon was rather an exception, and we should not rely on this example to say that Tesla will become the next Amazon and stay at this level for a while, in my view. For the sake of objectivity, I must say that the corporation’s debt and liquidity position are strong. The net debt has been negative since 2020. That is quite rare for a high-growth company like Tesla. Interesting also is the fact that its liquidity position has been improving since then. Net debt Seeking Alpha Seeking Alpha The debt-to-equity ratio is very low. A “good” debt/equity ratio is less than 2. Tesla’s is just 0.676. Debt-to-equity 2021 2022 2023 0.967 0.974 0.676 Source: Prepared by the author based on Seeking Alpha's data. The current ratio is not ideal. A good one should be about 2. But it is still above the critical level. Current ratio 2021 2022 2023 1.38 1.53 1.73 Source: Prepared by the author based on Seeking Alpha's data. The working capital has also been improving for a while, which is another positive, of course. Working capital (in dollars) 2021 2022 2023 7395 14208 20868 Source: Prepared by the author based on Seeking Alpha's data. However, I am still skeptical of what the bulls say about Tesla. Below, I have presented the key bullish arguments. Some of them are direct comments from a very fine article by my fellow Seeking Alpha contributor, Dair Sansyzbayev. I have also put some of my comments below each bullet point. Tesla’s valuations are sky-high if you compare them to the sector’s medians. Interestingly, all of Tesla’s ratios are much higher compared to the sector’s averages. The P/E ratio alone is a whopping 64, while the forward price/cash flow ratio is just over 40. So, according to Seeking Alpha, Tesla’s valuation grade is “F.” Seeking Alpha Seeking Alpha However, we can safely say that most of Tesla’s valuation ratios, including the P/E and the P/S, are not near their all-time highs. But the P/FCF ratio is almost record high. Main Street Data Main Street Data Main Street Data Main Street Data Main Street Data Main Street Data So, we can say that Tesla’s stock is somewhat cheaper than it used to be but still extremely expensive compared to the sector’s medians. Below, I have summarized the company’s upside and downside risks. My Hold rating on Tesla remains intact. The company is trading at very high valuations; investors feel highly enthusiastic about the company, while its profit margins are low. These decreased in 2023 compared to 2022. Many stockholders assume Tesla’s innovations will turn out to be extremely profitable for the company. But this might not necessarily be true. After all, it is hard to get the timing right. However, Tesla’s energy business is doing well, revenues are rising, and the debt position is pretty strong. But in my opinion, investors should not assume that Tesla, Inc. is the new Amazon. Very few companies manage to be very successful, keep growing and trade at extremely high valuations for such a long time period the way Amazon did. So, Amazon is rather an exception, not a common story. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}