{
    "title": "Ahead Of Tesla's Q4 Earnings, Analyst Positive Despite Muted Outlook For \nMargin, New Product Ramp-up - Te",
    "date": "1/21/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36709680/ahead-of-teslas-q4-earnings-analyst-positive-despite-muted-outlook-for-margin-new-p",
    "text": "Tesla, Inc.’s TSLA fourth-quarter results due Wednesday is key for the electric-vehicle maker, given investors’ worry over the company’s fundamentals. Ahead of the results, a venture capitalist and Tesla bull Gene Munster weighed on the aspects that will likely be on investors’ radar. Margin Is The Key: There is risk to the consensus core auto margin estimate of 17.1% for the December quarter due to the ramp in Cybertruck, said Munster, Managing Partner at Deepwater Asset Management. He expects core auto margin, which excludes regulatory credits, to come in at 16.7%, up from 16.3% in the September quarter. Despite the decline, Munster said this is a “directional positive” as it would end Tesla’s four-quarter declining margin streak. He noted that margins peaked seven quarters ago at 29%, and despite the contraction seen since then, Tesla has outperformed the other automakers with 10-14% gross margin. Munster expects CFO Vaibhav Taneja to guide to stable margins during 2024. He, however, sees core auto margins to come in at 17-18%, below the current consensus of about 18.5%. Long term, the analyst sees operating margins trending at 25% or greater. New Product Ramps: Tesla investors will likely be keen on knowing the ramp of the Cybertruck and the Model 3 refresh, Munster said. He expects Cybertruck sales of 35,000 units in 2024, 125,000 units in 2025 and 250,000 units in 2026. The electric pickup truck is expected to account for just under 2% of its total deliveries in 2024 and 5% in 2025, he said. By 2025, Cybertruck pricing will likely come down as production efficiency improves, the analyst said. This, in turn, will result in ramping up of sales, he said, adding “The first big year for Cybertruck will likely be 2026.” On the Model 3 refresh, Munster said the price, motor and range are all essentially the same but the refreshed Model 3 does not qualify for the U.S. tax credit. The price of the Model 3, which makes up 40% of all deliveries, will increase by about 15%, he said. Not considering the loss of tax credit, the analyst expects buyers who were holding off in anticipation of the new Model 3  since the middle of 2023 to return. See Also: Everything You Need To Know About Tesla Stock Other Focal Points: Munster said investors will also be keen to know about the full-self-driving timeline, an update on the Giga Mexico, and the timing of new model launch. The fund manager said he agreed with Tesla CEO Elon Musk’s view that a polished FSD would become a reality as the company has the best “real-world AI team in the world.” “We will see a ChatGPT moment when it comes to FSD, when the product quickly moves from a science product to a must-have mainstream feature,” Munster said. He, however, questioned whether FSD will become a reality in three years. Munster does not see an announcement concerning the lower-priced human driver model or robotaxi in 2024. “The new vehicle's selling ‘feature’ is its price and Tesla showcasing the upcoming vehicle would likely have a cooling effect on current low-priced Model 3 sales, a risk not worth taking in a year where EV sales will continue to be muted,” he said. Additionally, the Giga Mexico, where the car is planned to be made, won’t open until 2027, he added. The fund manager expects the Giga Mexico construction to be completed by mid-2025 and the Optimus bot to be launched only by 2030 or later. Tesla ended Friday’s session up 0.15% at $212.19, according to Benzinga Pro data. The stock has lost about 15% so far in January. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Elon Musk Slammed For Wanting More Tesla Control, Rivian Skids On Prospect Of Significant Losses, Fisker Faces Braking Issue Probe And More: Biggest EV Stories Of The Week Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}