{
    "title": "Tesla loses US$94 billion in market valuation amid slow global EV market \ngrowth",
    "date": "1/14/2024",
    "url": "https://www.scmp.com/business/china-business/article/3248400/elon-musks-tesla-loses-us94-billion-market-valuation-winter-sets-global-electric-vehicle-market",
    "text": "“Investors’ main concern on Tesla is stagnating growth,” Cowen analyst Jeffrey Osborne said in an interview. The price cuts in China only fan those concerns, because it is starting to look like “a race to the bottom for the EV industry given intense competition in that market”. The hit to Tesla’s market capitalisation to start the year is the biggest the company has seen over a similar period since it went public in 2010. In percentage terms, Tesla’s 12 per cent drop since the start of January is the worst since 2016, when the stock fell 14 per cent over the first nine trading days of the year. To make matters worse, the odds of an imminent turnaround for the EV maker do not look good. Tesla has been cutting prices on its cars aggressively since early 2023 in an effort to boost demand. But the result has been a steady erosion of its once-hefty profit margin. Tesla’s automotive gross margin ex-regulatory credits for the third quarter fell to 16.3 per cent from 27.9 per cent a year ago. And the pressure is only mounting, now that production workers at Tesla’s US plants are getting pay rises. “We are going through a cyclical downturn for EVs, but competitive dynamics are exacerbating the cyclical pressures,” Ivana Delevska, chief investment officer at Spear Invest, said in an interview. “Price cuts and plummeting margins are all a function of these unfavourable competitive dynamics.” Adding to the woes, Tesla has had to divert shipments destined for its Berlin plant after Western military actions and security concerns in the Red Sea, and is suspending most production at its plant near the German capital from January 29 to February 11, according to a person familiar with the matter. Tesla first warned about the deceleration in EV demand during its October third-quarter earnings report. Almost immediately after, carmakers and suppliers across the globe chimed in with their own downbeat forecasts. Many carmakers dialled back their plans for expansion. The result has been a rude awakening for Tesla investors. Last year, the stock was the eighth best performer in the S&P 500. So far this year, it is the eighth worst. Naturally, Musk is taking a big hit personally. The world’s richest person, who gained more wealth last year than anyone else on the planet, has seen his net worth shrink by US$23 billion so far this year, according to the Bloomberg Billionaires Index. With all that being said, Tesla remains a key player in the global transition from petrol-powered vehicles to largely electric ones. The reason: the company is so far ahead of its potential rivals. China’s BYD may have surpassed Tesla in the number of units sold, but it still lags in revenue and profits. And BYD does not sell cars in the US, where Tesla remains the market leader. In many ways, Tesla’s biggest problem may be its past success and the hope it generated. As investors piled into the stock, Tesla’s market capitalisation ballooned, making it way larger than any other car company in the world. However, with the shares priced for perfection, that also made them highly vulnerable to big reactions to any negative news. “Tesla has not been able to deliver on fully autonomous driving and AI promises, which are already embedded in the valuation,” Spear’s Delevska said. “Being simply another automotive manufacturer is not going to cut it for a US$750 billion valuation.” "
}