{
    "title": "Dow Jones Up 138 Points As Tesla Suffers This Blow; Cathie Wood Buys \nBitcoin Play Amid 23% Plunge",
    "date": "1/22/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-gains-as-tesla-stock-suffers-blow-cathie-wood-buys-this-bitcoin-play-amid-23-percent-plunge-apple-stock-disney-stock/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     The Dow Jones Industrial Average posted an all-time high Monday as components Walt Disney (DIS) and Apple (AAPL) outperformed. Tesla (TSLA) fared worst among the Magnificent Seven after it suffered another blow. And famed investor Cathie Wood bought a Bitcoin play despite recent sharp negative action. There was also a plethora of breakouts amid the encouraging action. Gartner (IT), Meritage Homes (MTH) and Tempur Sealy (TPX) were among the notable names testing buy points. The Nasdaq composite ended the session up 0.3%. Synopsys (SNPS) was among the best performers as it surged 4.7%. Leaderboard stock Zscaler (ZS) also impressed with a lift of 4.1%. The benchmark S&P 500 notched another all-time high as it ended the session up 0.2%. VF Corp. (VFC) stood out here as it jumped 5%. The S&P 500 sectors mostly closed higher. Real estate, financials and industrials fared best on the stock market today. Consumer discretionary and utilities struggled the most. Small caps outperformed, with the Russell 2000 jumping 1.9%. Growth stocks gave the bears a bloody nose and the Innovator IBD 50 ETF (FFTY) closed with a 1.4% gain. Dipping yields aided stocks. The 10-year Treasury note slipped 4 basis points to 4.10% while the 30-year skidded 3 basis points to 4.32%. The 5-year yield fell 4 basis points to 4.03% while the 2-year dipped 2 basis points to 4.39%. The Dow Jones Industrial Average also hit an all-time high and ended up being the strongest of the major indexes as it closed the session up 138 points. This translates to a 0.4% gain. Apple stock was among the top performers as it rose 1.2%. Apple is back above an old buy point of 192.93 and has retaken its 50-day moving average. Disney stock was another strong component on the Dow Jones today as it turned in a gain of 2.2%. But Walgreens Boots Alliance (WBA) ended up posting the best gain on the much-watched index as it rallied 2.5%. Home Depot (HD) lagged as it fell 1.6% following a downgrade from Oppenheimer to perform from outperform. Bitcoin has been struggling since spot exchange traded funds dealing in cryptocurrency were finally approved. The digital currency fell 3.6% Monday, falling to around $40,000 per token. Recent negative action has not dissuaded ARK Invest Chief Executive Cathie Wood from using it as a buying opportunity though. In fact, she bought nearly 317,000 of her firm's ARK 21Shares Bitcoin ETF (ARKB) for the ARK Next Generation Internet ETF (ARKW) on Friday. At Friday's low ARKB had fallen around 23% from its Jan. 11 high of 52.22. It remains down about 23% from this level after skidding 3.6% Monday. At the same time, Wood sold more than 510,000 of the fund's shares in the ProShares Bitcoin Strategy ETF (BITO). Wood also jettisoned just over 45,000 shares of Advanced Micro Devices (AMD) from ARKW's holdings. The firm's flagship ARK Innovation ETF (ARKK) fund was also snapping up some stock. The Cathie Wood fund bought nearly 323,000 shares of Recursion Pharmaceuticals (RXRX), nearly 663,000 shares of penny stock Ginkgo Bioworks (DNA) and almost 28,000 shares of Cerus (CERS). Buying on the dip or snapping up cheap stocks can result in heavy losses though. Investor's Business Daily recommends buying stocks with strong earnings and price performance. Look for leaders in strong industries that are showing superior earnings growth and sales. The other so-called Magnificent Seven stocks outside of Apple generally fell Monday. Tesla stock lost ground on the 200-day moving average as it fell 1.6%. It is now down 16% so far this month. TSLA stock was hit after Morgan Stanley analyst Adam Jonas cut his target to 345 from 380. The usually bullish analyst did keep an overweight rating on the shares for now. Artificial intelligence play Nvidia (NVDA) was among the best performers here, despite a paltry 0.3% gain. The Leaderboard stock is well extended from its most recent buy point. Google parent Alphabet (GOOGL), Microsoft (MSFT), Meta Platforms (META) and Amazon.com (AMZN) gave up slight ground. GOOGL fell 0.3%, AMZN dipped 0.8% and META ceded 0.4%. MSFT stock lost 0.5% but remains in a buy zone above a flat base with an ideal buy point of 384.30, MarketSmith analysis shows. Market Rally Shows Bullish Breadth; Apple Leads 6 New Buys With the stock market uptrend continuing to impress, it is key to keep an eye out for breakouts. There was no shortage on Monday. Gartner sits just below a buy zone after earlier testing a second-stage weekly chart cup base. The ideal entry point here is 469.58. The relative strength line is making progress again for the market research stock. It holds a stout IBD Composite Rating of 94 out of 99. Meritage Homes saw its relative strength line hit fresh highs as it cleared a flat base entry of 178.82. It closed just below this level despite a 1.4% gain. Meritage resides in the top 5% of stocks in terms of price performance over the past 12 months. With earnings due in nine days, buying now carries additional risk. Mattress stock Tempur Sealy is just below its buy point after earlier clearing a flat base entry of 51.68. It ended the day up 1%. Both earnings and stock market performance appear to be solid here. Investors have to be careful about buying breakouts amid earnings season. An approach highlighted by Investor's Business Daily is to use options as a strategy to reduce risk around earnings. It's a way to capitalize on the upside potential of a stock's move around earnings, while reducing the downside risk. Please follow Michael Larkin on X, formerly known as Twitter, at @IBD_MLarkin for more analysis of growth stocks. YOU MAY ALSO LIKE: This IBD Stock Of The Day Clears Key Level These Are The 5 Best Stocks To Buy And Watch Now Join IBD Live Each Morning For Stock Tips Before The Open This Is The Ultimate Warren Buffett Stock, But Should You Buy It? This Is The Ultimate Donald Trump Stock: Is DWAC A Buy? 3:15 AM ET\nNvidia gained 240% in 2023. Analysts have a price target of 700 for the stock. Is Nvidia stock a buy... 3:15 AM ET\nNvidia gained 240% in 2023. Analysts have a price target... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}