{
    "title": "Tesla India Plans Hinge On Fast-Charging Infrastructure For Entry-Level \nVehicle With Smaller Battery",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/tesla-india-plans-hinge-fast-075612891.html",
    "text": "This story was first published on the Benzinga India portal. Tesla Inc. (NASDAQ: TSLA) is considering a cost-effective solution for its planned entry-level car, specifically aimed at the price-sensitive Indian market. The company is mulling over the use of smaller, quick-charging batteries, a strategy already implemented in China, to significantly lower the vehicle's price. According to a report by Mint, the feasibility of these smaller batteries depends on the accessibility of an extensive network of fast chargers. In recent discussions with the Indian government, Tesla executives underscored the necessity of such an infrastructure and requested support for the development of chargers and battery production. See Also: Reliance, Disney Initiate Legal Steps For India Media Merger Tesla's goal is to introduce an electric vehicle (EV) priced at around $24,000, a sharp contrast to its current base model, the Model 3, starting at about $40,000. The Model 3 comes with a 57.5-kilowatt-hour battery, offering a range of approximately 435km. The new strategy would focus on smaller batteries that would need frequent charging at public stations, similar to refueling conventional vehicles. However, India's current charging infrastructure, with merely about 9,300 public chargers compared to over 138,000 in the US, presents a considerable challenge. There's an urgent need for a broader and faster charging network for EV adoption in India. Some existing chargers can add 180-200km range to a Tata Nexon EV in about an hour; however, Tesla's existing fast chargers and potential new technologies promise even speedier charging times. Tesla's plans for India accelerated post Elon Musk's meeting with Indian Prime Minister Narendra Modi in June. The company is willing to invest up to $2 billion in an Indian factory, provided there's a reduction in import duty rate for its cars. Discussions with Indian authorities are ongoing as Tesla navigates the complexities of entering an emerging yet challenging EV market. Read Next: Tesla's Rival VinFast To Launch EV Battery Plant In India \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article Tesla India Plans Hinge On Fast-Charging Infrastructure For Entry-Level Vehicle With Smaller Battery originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}