{
    "title": "Tesla (finally) releases updated Model 3 for North American buyers",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/news/tesla-finally-releases-updated-model-3-for-north-american-buyers-172122971.html",
    "text": "After waiting for several long months, Tesla (TSLA) finally gave its US and Canadian-based buyers and fans the updated Model 3 they have all been waiting for, and with an unchanged price. Last year, Tesla updated its Model 3 sedan — which came out in 2017 — with a refreshed version that initially sold this summer in China, and was then exported to other regions such as Europe. Dubbed \"Project Highland,” Tesla aimed to cut production costs for the Model 3 and increase the appeal of the sedan by revamping the car's exterior, powertrain, and interior components. At the time it was reported Tesla would cut costs by reducing overall complexity. Though the Model 3 has been periodically updated with under-the-skin enhancements to mechanical components and battery materials, this is the first major revamp. Premium Tesla models like the Model S and Model Y have already been revamped with exterior styling, new touchscreen tablets, and yoke steering wheels. Read more: Are electric cars more expensive to insure? On the surface, the refreshed Model 3 features a new streamlined front end with slimmer front headlights, new daytime running lights (DRLs), and updated rear headlights. The exterior design has been nipped and tucked in other areas but otherwise looks similar to the outgoing model, though Tesla says the exterior styling has been “optimized for maximum aerodynamics” as well. New wheels and two new color options are on offer too. Under the skin is where more of the bigger enhancements have been made. Tesla did not disclose these details, but reviewers say the Model 3 features new suspension components and tuning, leading to a more comfortable ride as well as better handling. Tesla CEO Elon Musk had complained in the past that the Model 3 went through “production hell” during its initial industrialization and development, and this new mid-cycle update is a way to address some product concerns. Chief among those concerns was the interior, which has been criticized as somewhat spartan in nature. Tesla said it has included “softer, more sophisticated” materials in the interior, as well as new seats, and ambient lighting. Tesla says the new interior is quieter as well, thanks to “acoustic glass,” as the company calls it, and likely more sound-deadening materials throughout. Though the big center touchscreen remains the main interface for the vehicle's functions, Tesla added a second display for rear-seat occupants for entertainment purposes and rear climate controls. The biggest feature here — and what will have fans rejoicing — is the new Model 3 costs the same as the old one. The Model 3 Rear-Wheel Drive costs $38,990, just like the outgoing model, and features the same 272-mile range. The Model 3 Dual Motor All-Wheel Drive remains priced at $45,990, but its range increases by eight miles to 341 miles on a full charge. Pras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Related Quotes "
}