{
    "title": "Tesla bulls hoping for rosy 4Q earnings as Elon Musk's latest posts send \nshares lower",
    "date": "1/17/2024",
    "url": "https://www.proactiveinvestors.com/companies/news/1038710/tesla-bulls-hoping-for-rosy-4q-earnings-as-elon-musk-s-latest-posts-send-shares-lower-1038710.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Andrew is a financial journalist with experience covering public companies in a wide breadth of industries, including tech, medicine, cryptocurrency, mining and retail. In addition to Proactive, he has been published in a Financial Times-owned newsletter covering broker-dealer firms and in the Columbia Misourian newspaper as the lead reporter focused on higher education. He got his start with an internship at Rolling Stone magazine. \r\n Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 14:13 17 Jan 2024 EST Tesla Inc (NASDAQ:TSLA) is expected to post declining earnings when it reports its fourth-quarter results on January 24, and CEO Elon Musk just gave investors one more thing to worry about. The electric carmaker is projected to post earnings of $0.74 per share, down about 38% year-over-year, on revenue of $25.51 billion, up nearly 7% over the same span. Earlier this month, Tesla said its fourth quarter 2023 EV deliveries totaled 484,500, edging past company expectations of 480,500. Investors will also be watching for the impact of Cybertruck, which recently saw its first deliveries to customers, as well as potential updates on the company’s Full Self-Driving technology. Meanwhile, Musk has shaken expectations in the long term, threatening to develop artificial intelligence technology outside of Tesla if his compensation isn’t increased. Responding to a post on X discussing the issue, Musk said he was “uncomfortable growing Tesla to be a leader in AI and robotics without having [around] 25% voting control.” I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control. Enough to be influential, but not so much that I can’t be overturned.\n\r\nUnless that is the case, I would prefer to build products outside of Tesla. You don’t seem to understand… Analysts at Wedbush, however, are unfazed, calling Musk’s comments, “just more drama in the Tesla story,” with the expectation that he and the board will ultimately agree on a new compensation structure. That said, “[i]f Musk ultimately went down the path to create his own company for his next generation AI projects this would clearly be a big negative for the Tesla story,” the analysts acknowledged. Wedbush held its Outperform rating and $350 price target. Tesla shares dipped 3.3% Wednesday afternoon to $212.68. Sign up to receive alerts and news direct to your inbox Northstar Gold Corp's CEO, Brian Fowler joined Steve Darling from Proactive to announce the commencement of borehole electromagnetic (BHEM) and surface electromagnetic (EM) surveys at the Cam Copper Mine area on the Company’s Miller Copper-Gold Property in Ontario. The Cam Copper Mine is a... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive North America Inc., Proactive Investors LLC. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}