{
    "title": "Tesla Falls As Judge Voids Elon Musk's $56 Billion Pay Plan",
    "date": "1/31/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/tesla-falls-as-judge-voids-elon-musk-56-billion-compensation-plan/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     Tesla (TSLA) fell modestly Tuesday night as a judge voided CEO Elon Musk's $56 billion stock compensation plan. A Delaware judge voided Elon Musk's $56 billion compensation plan, siding with plaintiffs who argue that Tesla's board acted improperly in setting the pay deal. The problem wasn't the unprecedented size of the 2018 compensation plan, but improper disclosures and conflicts of interest by the Tesla board, which has never shown much independence vs. Musk. \"Musk launched a self-driving process, recalibrating the speed and direction along the way as he saw fit,\" Delaware Chancery Court Chief Judge Kathaleen McCormick wrote in her ruling. \"The process arrived at an unfair price. And through this litigation, the plaintiff requests a recall.\" On the one hand, voiding the compensation plan reduces potential dilution for shareholders. So arguably the news could be viewed as a positive for TSLA stock. The Tesla board could craft a new compensation plan for Musk in a relatively short order. Meanwhile, Musk recently called for a big jump in voting power to 25%, above and beyond the now-voided compensation plan. He threatened to move AI and robotics tech from Tesla to another company if he doesn't get that added control. Following the verdict, Musk posted on X, \"Never incorporate your company in the state of Delaware.\" Judge McCormick oversaw the Musk vs. Twitter case, which ended with the billionaire acquiring the social site for $44 billion. Tesla stock fell 3% early Wednesday. In Tuesday's trade, shares rose 0.35% to 191.59. TSLA stock hit an eight-month low of 182.63 on Jan. 25 following disappointing Tesla earnings and guidance. Please follow Ed Carson on Threads at @edcarson1971 and X/Twitter at @IBD_ECarson for stock market updates and more. YOU MAY ALSO LIKE: Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Futures: 3 AI Giants Report Earnings; Judge Voids Musk's $56 Bil Pay Plan 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}