{
    "title": "If Elon Musk and His Buddies Think Delaware Is Too Strict, We've Got a \nProblem – Mother Jones",
    "date": "2/11/2024",
    "url": "https://www.motherjones.com/politics/2024/02/elon-musk-tesla-delaware-corporations-texas-nevada-south-dakota-kleptocracy/",
    "text": "Mother Jones illustration; Patrick Pleul/Pool/AP; Getty There’s a piece in today’s Wall Street Journal about how billionaires like Elon Musk are now whining about Delaware—which literally has more corporations than people—because it imposes too many rules. Musk is fretting because a Delaware business court ruled that his $50 billion-plus Tesla compensation package, which was approved by a loyalist board, was excessive and therefore unfair to shareholders who had sued to stop it. As the New York Times reported, the judge deemed the approval process “deeply flawed” and voided Musk’s contract, calling it “the largest potential compensation plan in the history of public markets.” The Times noted in a follow-up piece that Musk owns about 411 million Tesla shares, worth around $78 billion, and that he’d pledged 238 million shares for personal loans. Borrowing against their vast portfolios, as ProPublica has detailed, is how Musk, Jeff Bezos, Michael Bloomberg, Warren Buffett, and other ludicrously wealthy Americans have managed to legally avoid the lion’s share of income taxes. Musk publicly lamented the Delaware decision that would dislodge him from the “world’s richest man” perch. He says he’ll seek to reincorporate in Texas, where Space X is headquartered, and where, as my colleague Abby Vesoulis reports, Musk has been flexing his plutocratic power at the expense of longtime residents. Never incorporate your company in the state of Delaware — Elon Musk (@elonmusk) January 30, 2024  The Journal points out that Musk isn’t the only major shareholder chafing at Delaware’s rules, noting that Texas is among the newbies vying to attract more corporate registrations and that another contender, Nevada, offers “broad protections for directors and officers in many cases that Delaware wouldn’t, including involving improper personal gain.” A state going out of its way to protect corporate crooks may shock you—or should—but Musk’s hissy fit is merely the latest skirmish in the race to the bottom for state corporate oversight. Both Vesoulis and Casey Michel, author of the book American Kleptocracy, detailed in our American Oligarchy package how competition between states to attract companies—which tend to overpromise and under-deliver on jobs and economic development—has resulted in a downward spiral that gives unelected billionaires power over local affairs and has made the United States the go-to destination for illicit wealth, foreign and domestic. Need a tax haven? A place to hide and launder stolen cash?  Why bother with the Caymans or the Bahamas when you can get those services in South Dakota—and you don’t even have to relocate there. If you’re looking for other options, check out Alaska, Illinois, Florida, Ohio, Missouri, Nevada, Florida, New Hampshire, Rhode Island, Tennessee, Wyoming, and the original culprit: Delaware. During the 1910s, Michel writes: Not only did Delaware’s legislature up the ante on enticements—exempting corporations from taxes and reimbursing their directors for damages incurred by litigious shareholders—but its Chancery Court began producing the most pro-corporate rulings in the country. For good measure, the state also granted anonymity to anyone who wanted to register a company there. By 1929, 42 percent of state income came from corporate registration fees and taxes. With a population of a tad more than 1 million, Delaware is now home to 1.9 million corporations, including more than 300,000 registered in 2022 alone. Each year, it rakes in some $2 billion in corporate taxes and fees, far more than any other state. The constituents of Delaware lawmakers, “in a very real sense, are companies,” as the University of Cambridge’s Jason Sharman, an expert on money laundering and corporate regulation, has noted. Now Texas is in the running too? All I can say is, when a few overpaid moguls can move the impunity needle by griping that Delaware isn’t permissive enough, we’ve got a problem. Subscribe to the Mother Jones Daily to have our top stories delivered directly to your inbox. By signing up, you agree to our privacy policy and terms of use, and to receive messages from Mother Jones and our partners. We’re falling behind our online fundraising goals and we can’t sustain coming up short on donations month after month. Perhaps you’ve heard? It is impossibly hard in the news business right now, with layoffs intensifying and fancy new startups and funding going kaput. The crisis facing journalism and democracy isn’t going away anytime soon. And neither is Mother Jones, our readers, or our unique way of doing in-depth reporting that exists to bring about change. Which is exactly why, despite the challenges we face, we just took a big gulp and joined forces with the Center for Investigative Reporting, a team of ace journalists who create the amazing podcast and public radio show Reveal. If you can part with even just a few bucks, please help us pick up the pace of donations. We simply can’t afford to keep falling behind on our fundraising targets month after month. Editor-in-Chief Clara Jeffery said it well to our team recently, and that team 100 percent includes readers like you who make it all possible: “This is a year to prove that we can pull off this merger, grow our audiences and impact, attract more funding and keep growing. More broadly, it’s a year when the very future of both journalism and democracy is on the line. We have to go for every important story, every reader/listener/viewer, and leave it all on the field. I’m very proud of all the hard work that’s gotten us to this moment, and confident that we can meet it.” Let’s do this. If you can right now, please support Mother Jones and investigative journalism with an urgently needed donation today. We’re falling behind our online fundraising goals and we can’t sustain coming up short on donations month after month. Perhaps you’ve heard? It is impossibly hard in the news business right now, with layoffs intensifying and fancy new startups and funding going kaput. The crisis facing journalism and democracy isn’t going away anytime soon. And neither is Mother Jones, our readers, or our unique way of doing in-depth reporting that exists to bring about change. Which is exactly why, despite the challenges we face, we just took a big gulp and joined forces with the Center for Investigative Reporting, a team of ace journalists who create the amazing podcast and public radio show Reveal. If you can part with even just a few bucks, please help us pick up the pace of donations. We simply can’t afford to keep falling behind on our fundraising targets month after month. Editor-in-Chief Clara Jeffery said it well to our team recently, and that team 100 percent includes readers like you who make it all possible: “This is a year to prove that we can pull off this merger, grow our audiences and impact, attract more funding and keep growing. More broadly, it’s a year when the very future of both journalism and democracy is on the line. We have to go for every important story, every reader/listener/viewer, and leave it all on the field. I’m very proud of all the hard work that’s gotten us to this moment, and confident that we can meet it.” Let’s do this. If you can right now, please support Mother Jones and investigative journalism with an urgently needed donation today. By Abby Vesoulis; Photography by Christopher Lee Casey Michel Michael Mechanic Kalena Thomhave Nina Martin Madison Pauly Julia Métraux Stephanie Mencimer Russ Choma Taylar Dawn Stagner Marianne Szegedy-Maszak Noah Lanard Subscribe to the Mother Jones Daily to have our top stories delivered directly to your inbox. By signing up, you agree to our privacy policy and terms of use, and to receive messages from Mother Jones and our partners. Save big on a full year of investigations, ideas, and insights. Help Mother Jones' reporters dig deep with a tax-deductible donation. Inexpensive, too! Subscribe today and get a full year of Mother Jones for just $14.95. Award-winning photojournalism.  Stunning video. Fearless conversations. Subscribe to the Mother Jones Daily to have our top stories delivered directly to your inbox. By signing up, you agree to our privacy policy and terms of use, and to receive messages from Mother Jones and our partners. This site is protected by reCAPTCHA and the Google Privacy Policy and\n\t\t\t\tTerms of Service apply.\n                Privacy Manager Copyright © 2024 Mother Jones and the Foundation for National Progress. All Rights Reserved.Terms of Service\nPrivacy Policy Can you pitch in a few bucks to help fund Mother Jones' investigative journalism? We're a nonprofit (so it's tax-deductible), and reader support makes up about two-thirds of our budget. We noticed you have an ad blocker on. Can you pitch in a few bucks to help fund Mother Jones' investigative journalism? Sign up for the free Mother Jones Daily newsletter and follow the news that matters. "
}