{
    "title": "Elon Musk Melts Down in Baffling Answer on Tesla Supercomputer",
    "date": "2/10/2024",
    "url": "https://futurism.com/elon-musk-baffling-answer-tesla-supercomputer",
    "text": "A few years back, Tesla was talking a huge talk about a supercomputer that it called Dojo, which was supposed to be key to the company's self-driving efforts. Musk himself called it a \"super power training computer\" and a \"beast.\" The car company claimed it was the fifth most powerful in the world. In 2022, the company's early prototype drew so much power that it tripped the power grid in Palo Alto, California. Is the much-hyped supercomputer still a going concern? You'd think so, given all that braggadocio — but as highlighted by CleanTechnica, CEO Elon Musk was asked about it at a January investor meeting and his answer was absolutely baffling. \"I mean, the AI auto question is — that is a deep one,\" he said, tripping over his own words again and again. \"So, we're obviously hedging our bets here with significant orders of Nvidia GPUs — or GPUs is the wrong word.\" \"Really needs to be — there's no — it doesn't even — it doesn't mean — you can't, like, produce graphics,\" he said. \"So, that's what's — sort of a graphical processing unit, neural net processing unit or something like that.\" \"But I would, you know, think of Dojo as a long shot,\" he eventually admitted, after proffering that training a car is \"much like\" training a human. \"It's a long shot worth taking because the payoff is potentially very high,\" he mused. \"But it's not something that is a high probability.\" Dissecting Musk's largely nonsensical remarks, it's hard to believe the company is making much concrete progress on Dojo after all this time — or, if it is, it sounds like Musk has no idea about it. In fact, it calls to mind an anecdote about Musk during his time at Zip2, one of his early companies. There, according to an employee, he put a normal PC inside a giant pompous wheeled case, which he would show off to potential investors and tell them it was a \"mini supercomputer.\" In other words, it sounds a lot like Musk is the same as he's always been: a talented marketer who leads with the hype, adjusting the story as he goes in response to reality. Remember when he first showed off a Tesla \"robot\" called Optimus, except that it was just a person in a suit? Sometimes, these stories can take on a life of their own. Optimus is now an actual robot that can shuffle around and perform rudimentary tasks, though not without controversy. Some of Musk's magic, though, may be starting to fade. Tesla's shares have been put through the wringer this year, in large part due to the mercurial CEO's racist antics. Earlier this month, Quartz reported that the company is now officially the worst-performing stock in the S&P 500, a market index tracking the 500 largest companies in the US. There's still at least some lingering hype for Dojo. A September report by investment bank Morgan Stanley predicted that it could add a whopping $500 billion to the company's value. Shares jumped at the news, indicating some optimism about the project. At the same time, as Clean Technica points out, Musk's most recent comments about Dojo are markedly different than how he was talking about the project a few years ago. In fact, just six days before hopping on the earnings call, Musk threatened to pursue AI ventures \"outside of Tesla\" unless he was allowed to claw back a 25 percent stake, an increase of 12 percent given his standing at the time. Incensed, some long-time investors accused Musk of \"blackmailing\" shareholders. More on Tesla: Tesla Is Officially the Worst-Performing S&P 500 Stock of the Year Share This Article DISCLAIMER(S) Articles may contain affiliate links which enable us to share in the revenue of any purchases made. Registration on or use of this site constitutes acceptance of our Terms of Service. © Recurrent Ventures Inc, All Rights Reserved. "
}