{
    "title": "Tesla-beating BYD and other Chinese carmakers using Mexico as back door \nposes 'extinction-level' threat to U.S. auto ...",
    "date": "2/24/2024",
    "url": "https://finance.yahoo.com/news/tesla-beating-byd-other-chinese-231214177.html",
    "text": "China has become a powerhouse in electric vehicles. Its automaker BYD recently topped Tesla in global EV sales, with Elon Musk warning of Chinese carmakers, “If there are no trade barriers established, they will pretty much demolish most other car companies in the world. They’re extremely good.” On Friday, the Alliance for American Manufacturing sounded the alarm, issuing a report entitled: “On a Collision Course: China’s Existential Threat to America’s Auto Industry and its Route Through Mexico.” The report, which lists policy recommendations to combat overcapacity and unfair trade practices, notes that BYD is building factories in Thailand and Hungary designed to be regional export hubs. It then adds: “More alarming, however, are Chinese firms’ heavy spending on plants in Mexico, through which they can access the United States by way of the more favorable tariffs under the United States-Mexico-Canada Agreement (USMCA). This strategy is, in effect, an effort to gain backdoor access to American consumers by circumventing existing policies that are keeping China’s autos out of the U.S. market.” In the U.S., made-in-China EVs are currently subject to a 25% tariff, which goes atop a 2.5% tariff on imported cars. That’s prevented them from making significant inroads. Manufacturing in Mexico, however, could change the equation. House lawmakers recently warned about China’s “industrial strategy to dominate the global automobile market” and its EV makers “gaining a back door to the U.S. market through our key trading partners.” Calling for existing tariffs on made-in-China cars to be maintained or even increased, they described a “coming wave” of Chinese vehicles that “will be exported from our other trading partners, such as Mexico.” The Financial Times recently reported that Chinese carmakers including MG, BYD, and Chery have been scouting for manufacturing locations within Mexico. Meanwhile imports of Chinese cars into Mexico have been surging. While Musk credits Chinese EV makers for being “extremely good,” the Alliance for American Manufacturing focuses more on the government support they receive, writing: “Backstopped by heavy state support, Chinese automakers and suppliers have grown into industrial powerhouses that control the nodes of production for virtually the entire electric vehicle value chain.” BYD, backed by Warren Buffett’s Berkshire Hathaway, keeps its costs low partly by owning the entire supply chain of its EV batteries—significant since a battery accounts for roughly 40% of an electric vehicle’s price. “No one can match BYD on price. Period,” Michael Dunne, CEO of Asia-focused car consultancy Dunne Insights, recently told the Financial Times. “Boardrooms in America, Europe, Korea, and Japan are in a state of shock.” Ford CEO Jim Farley recently said that, to address the Chinese threat, he’s open to cooperating with rivals on battery production. His GM counterpart Mary Barra made similar comments. That threat, according to the Alliance for American Manufacturing, is scarier than many people realize. It writes: “The introduction of cheap Chinese autos—which are so inexpensive because they are backed with the power and funding of the Chinese government—to the American market could end up being an extinction-level event for the U.S. auto sector.” This story was originally featured on Fortune.com Related Quotes "
}