{
    "title": "Tesla rival BYD 'not planning to come to the US,' exec says",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/tesla-rival-byd-not-planning-to-come-to-the-us-exec-says-212306507.html",
    "text": "Chinese automaker BYD (BYDDY) dethroned Tesla (TSLA) to become the world’s top seller of electric vehicles last year. To get to that position, BYD has relied on its home market of China for more than 80% of its sales. But now, with China’s EV boom projected to slow for a second straight year, the company is eyeing rapid international expansion. Just don’t expect an entry into the US anytime soon. “We’re not planning to come to the US,” Stella Li, executive vice president of BYD and CEO of BYD Americas, told Yahoo Finance Live (video above). “It’s an interesting market, but it is very complicated,” she added, citing growing political pushback on Chinese companies and the slowing rate of growth for EV adoption. Chinese carmakers, faced with a 27.5% tariff on car imports from China, have largely been shut out of the US market. But BYD’s rapid growth in Mexico and plan to build out a factory there has raised alarms among Western competitors worried that the company may be positioning itself for a US entry by establishing an export hub in Mexico that would help it avoid high tariffs. Li dismissed that speculation, saying the company’s plant would be located within 200 miles of Mexico City to focus solely on Mexico's domestic market. An official announcement on the plant is expected in the second half of this year, she said. “We’re not even considering any northern state [in Mexico],” Li said, alluding to brands that typically set up operations near the US-Mexico border to target the American market. “We are targeting the local market. That is the BYD strategy.” In recent weeks, executives at Western car companies have warned that they would be unable to match Chinese carmakers' price advantages should they enter the US. During Tesla’s (TSLA) most recent earnings call, CEO Elon Musk said Chinese carmakers would “pretty much demolish most other car companies in the world” without trade barriers in place. Meanwhile, Stellantis CEO (STLA) Carlos Tavares likened the impending entry of Chinese companies to that of Japanese and South Korean automakers in the 1970s and 1990s. “The Chinese are the major threat right now because they are the only guys that can sell [battery-electric vehicles] at the price of ICE [vehicles],” Tavares said, referring to gas-powered cars. According to Tom Narayan, lead equity analyst at RBC Capital Markets, BYD's cost advantage amounts to roughly 40%, compared to Stellantis. The vertical integration of its business has helped drive costs lower. Roughly 75% of the parts and components that go into its vehicles are manufactured in-house, allowing the company to control costs and timelines, according to Li. “The threat isn’t small,” Narayan said. “Chinese [original equipment manufacturers] have some very compelling products.” On Friday, the Alliance for American Manufacturing released a report warning about “China’s existential threat to America’s auto industry.” The report characterized Chinese investments in Mexico as “an effort to gain backdoor access to American consumers by circumventing existing policies that are keeping China’s autos out of the U.S. market.” “I think they are a little bit [overreacting],” BYD's Li said. “A little bit too scared about Chinese competition. I never believe that trade protection will help any company.” Regardless, Congress and the White House are monitoring Chinese investments. Representatives Mike Gallagher and Raja Krishnamoorthi have called on US Trade Representative Katherine Tai to raise existing tariffs on Chinese car imports while Treasury Secretary Janet Yellen visited Mexico in December to discuss ways to strengthen cooperation on screening of foreign investments in North America. Founded in 1995 as a battery manufacturer for cellphones and other consumer electronics devices, BYD has undergone rapid expansion since 2019, growing from 500,000 deliveries to more than 3 million in 2023. Government subsidies and tax breaks in China have also played a key role in BYD's expansion. The US has looked to counter that through President Biden's landmark climate and energy law, which set aside billions of dollars in incentives to spur EV adoption while also aiming to bring the manufacturing of EV parts and components back to the US. But the country still trails well behind China and Europe in the transition to go all electric. New electric vehicles sales accounted for just 7.6% of the overall market, according to data from Kelley Blue Book. The EV penetration rate in China climbed to 35.7% despite a slowdown, according to data from the China Association of Automobile Manufacturers. “The Chinese make EVs predominantly — full electrics,” Narayan said. “And in the US, full electric penetration is slowing. ... It's not as robust as it is in Europe. ... I'm less worried about the US for the Chinese threat. More worried for Europe.” Li said BYD’s focus remains firmly on expanding market share outside of the US. The firm has already announced the establishment of new factories in Hungary, Thailand, and Uzbekistan. BYD exported roughly 243,000 cars out of the 3 million vehicles sold last year, with Australia, Brazil, and Israel among its biggest markets. “The Chinese market is the most competitive market,” Li said. “If you are the winner in the most competitive market why [can’t you win] in other [countries]? It’s just a timing issue.” Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Related Quotes "
}