{
    "title": "Elon Musk's Tesla Ownership Stake Is Worth Over $120 Billion",
    "date": "2/16/2024",
    "url": "https://www.entrepreneur.com/business-news/elon-musks-tesla-ownership-stake-is-worth-over-120-billion/469827",
    "text": "Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            matthew fox\n          \n                                                    •\n            \n            \n              Feb 16, 2024 Share This article originally appeared on Business Insider. Elon Musk owns a 20.5% stake in Tesla that is worth just over $120 billion, according to a filing made with the SEC on Wednesday. The 20.5% stake is a sizable increase from Musk's 13% stake in Tesla that was reported in May 2023, but slightly below the 22% stake Musk held before he started to sell stock to fund his $44 billion purchase of Twitter. According to the filing, Musk's stake is comprised of 411.06 million shares of Tesla common stock, as well as options to purchase 303.96 million shares that are exercisable within 60 days of December 31. The SEC filing shows that Musk is not far off from reaching the 25% stake he desires, as he wishes to have more influence over the company to keep him incentivized to work on various projects underneath the Tesla brand, such as robotics and artificial intelligence. \"I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control. Enough to be influential, but not so much that I can't be overturned,\" Musk tweeted last month. \"Unless that is the case, I would prefer to build products outside of Tesla.\" Musk's massive ownership stake in Tesla has in part been driven by his 2018 compensation package, which has since faced challenges in court. The $55 billion pay package awarded Musk tranches of Tesla stock if he hit certain milestones in growing Tesla's market capitalization. Musk's massive stake in Tesla, combined with his ownership stakes in SpaceX and X, make him the richest person in the world, with a net worth of just over $200 billion, according to data from Bloomberg. Tesla stock rose 2.3% in Thursday morning trades. Want to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join. At 41, Josh Grinstead knew he was at a crossroads. Sarah Michelle Boes knew there had to be a better way to prepare for her stress-inducing nurse practitioner's exam — so she created it. We put together a list of the best, most profitable small business ideas for entrepreneurs to pursue in 2024. The winning applicants span 38 states, Washington, D.C., and Puerto Rico. We are constantly told what to do if we want success — but what about the habits to avoid? Here are three value-add products and services that can help your business scale. Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  "
}