{
    "title": "Elon Musk Cries Foul Over Pay Package Voidance, Lucid's 25% Rally, Ford's \nStruggling EV Sales And More: B",
    "date": "2/3/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36922885/elon-musk-cries-foul-over-pay-package-voidance-lucids-25-rally-fords-struggling-ev-sales-and-mor",
    "text": "The week saw electric vehicle giant Tesla, Inc. TSLA rebound modestly from its post-earnings weakness even as the market awaited earnings from startups. Monthly deliveries reported by Chinese EV makers as well as Tesla showed the effect a slowing domestic economy has had on these companies. Here are the key events that happened in the EV space during the week: Musk’s Compensation Plan Verdict And More: Delaware Chancery Court Judge Court Chief Judge Kathleen McCormick’s verdict invalidating Tesla CEO Elon Musk’s $55 billion 2018 compensation plan polarized social media users this week. Tesla analysts saw the verdict as an opportunity for the board to announce a new compensation plan for its top man and in the process cede him more voting control — something he has  demanded recently. Meanwhile, Musk reacted by running a poll on X that asked whether the company should shift its place of incorporation from Delaware to Texas, where it is headquartered. Voters overwhelmingly supported a move to Texas. The billionaire also vented his frustration on the platform, decrying the perils of being a public company. On the operational front, Tesla’s Giga Berlin made strides as it hit the weekly production milestone of 6,000 Model Y EVs, according to LinkedIn posts from executives at the plant. In other news, Tesla recalled about 2.2 million vehicles, including the Cybertruck, due to concerns about a smaller font size for warning lights, compromising the visibility of crucial safety information. Ford EV Sales Fall: Legacy automaker Ford Motor Co.‘s F reported that sales of its battery EVs, namely the Mustang Mach E and the F-150 Lightning EVs, declined in January. The former’s sales slumped 50.7% year-over-year to 1,295 units and the latter’s edged down 0.3% to 2,258 units, while E-transit electric van sales rose from 357 units a year ago to 1,121 units. BEV sales fell 11% overall, but the company offset the weakness by a 43% jump in hybrid sales. See Also: Best Electric Vehicle Stocks Lucid Amid Positive Tidings: Shares of luxury EV maker Lucid Group, Inc. LCID jumped nearly 25% this week, thanks to a few catalysts. Ma'aden Rolling, a subsidiary of Saudi Arabian Mining Co., announced on X that it struck a new agreement with Lucid to supply aluminum sheets to the latter’s U.S. plants. A Drive Tesla report also said that Lucid will likely roll out a security vehicle specifically for the Saudi police. Incidentally, Lucid is majority-owned by Saudi Kingdom's sovereign wealth fund. Canoo Drives Into Zeeba’s Fleet: Following deliveries to Kingbee and a contract with the U.S. Postal Service, Canoo, Inc. GOEV said this week that it added EVs to the fleet of Zeeba as part of an existing agreement with the fleet management company regarding 5,450 vehicles, with a binding commitment of 3,000 LifeStyle Delivery Vehicles. Tony Aquila, CEO of Canoo, said, “With an impressive revenue growth, Zeeba has increased its number of clients by 10 times in the last two years and has a large backlog of clients waiting for Canoo vehicles. We are excited to work with a dynamic, skilled team that is expanding its national fleet.” Check out more of Benzinga’s Future Of Mobility coverage by following this link. Arrival Booted Out Of Nasdaq: Shares of Commercial EV startup Arrival plc ARVL, which have long been trading in penny stock territory, were delisted from Nasdaq this week, as the company was not in compliance with the exchange’s continued listing standards and failed to submit a remediation plan. The company announced that it received a notice from the trustee regarding the acceleration of default on interest payments for its 3.50% convertible senior notes due in 2026. The KraneShares Electric Vehicles and Future Mobility Index ETF KARS ended Friday’s session down 1,84% at $20.76, according to Benzinga Pro data. For the week, the ETF fell 3.35%. Read Next: Tesla Buying AMD Chips To Nadella Sounding The Alarm On AI-Generated Deepfakes: This Week In AI EV Stock Performances For Week Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}