{
    "title": "Elon Musk Might Become The Richest Person In The World Again",
    "date": "2/17/2024",
    "url": "https://www.techjuice.pk/elon-musk-might-become-the-richest-person-in-the-world-again/",
    "text": "News The recent rise in Tesla’s stock prices and recent share declines in the world’s largest luxury company can follow up to Elon Musk becoming the world’s richest man again. Tesla stock has been on a roll this year, up 68% so far in 2023 after a brutal 2022 that saw the shares lose 65%. Last year’s declines dragged down the value of CEO Elon Musk’s personal wealth, much of which is tied up in Tesla stock. Elon Musk’s net worth has surged to $45 billion this year. This is mostly because Musk’s net worth is tied heavily to TSLA shares, which rose for the eighth consecutive day on Thursday. It was also the steep 65% drop in Tesla stock last year that brought Elon Musk’s net worth down. As Tesla shares dropped in 2022, Elon Musk, who was then listed as the world’s wealthiest person by net worth, was overtaken by Arnault. This happened in December, as Tesla investors called out Musk’s behavior on Twitter and shutdowns in Gigafactory Shanghai fueled demand concerns. Following its 65% drop in 2022, Tesla shares saw a notable boost after the company lowered the prices of its vehicles, including best-selling cars like the Model 3 sedan and the Model Y crossover. Tesla also reported better-than-expected quarterly results last month, and during the Q4 and FY 2022 earnings call, Elon Musk and other executives of the electric vehicle maker highlighted that the demand for the company’s products is extremely healthy. Tesla may soon see other tailwinds, especially with the upcoming Investor Day event on March 1. As per CEO Elon Musk on Twitter, Investor Day would include discussions on Master Plan Part 3, which is focused on Tesla’s growth to an extreme scale. Master Plan Part 3 will also include sections dedicated to Elon Musk’s other ventures, such as SpaceX and The Boring Company. This rise has put Musk back within striking distance of the world’s richest person title, with his net worth rising from almost $50 billion in 2023 to $186 billion, according to the Bloomberg Billionaires Index. Musk is now just $3 billion short of LVMH Moët Hennessy Louis Vuitton (MC.France) CEO Bernard Arnault’s $189 billion net worth. The wealth of the LVMH and Tesla CEOs is​closely tied to their company’s stock. The fortunes of both men live and die on the stock prices of the companies they control. Arnault, the 73-year-old French luxury goods magnate behind brands including Dior, TAG Heuer, and Tiffany, hasn’t done so badly himself—his fortune has gained $27 billion this year, with LVMH stock rising 17% over the same period. Amid a wider rally in the stock market to start the year, Musk has so far just been chasing Arnault higher in the game of billionaire riches. But a recent divergence in the performance of Tesla and LVMH could help seal the deal and put Musk back on top. While Tesla was trading down 4.9% Friday, the stock has otherwise been accelerating, up more than 9% in just the past five days. LVMH’s gains, meanwhile, look to have petered out, with the shares down 3% over the same period. If that momentum continues—with Tesla stock continuing to beat LVMH—Musk will be the world’s richest person again. At least until the winds of the market shift again. Read More:  Share Reply  "
}