{
    "title": "Tesla names new head of trucking division as the company nears its first \nSemi deliveries",
    "date": "2/26/2024",
    "url": "https://www.aol.com/tesla-names-head-trucking-division-192759597.html",
    "text": "For premium support please call: Live Updates Multiple people rescued following Baltimore's Francis Scott Key Bridge collapse Jerome Guillen, formerly Tesla's president of automotive, will head up its trucking division. The change was announced in a regulatory filing dated March 11. Tesla unveiled its class 8 truck, the Semi, back in 2017 and says deliveries will begin this year. See more stories on Insider's business page. Elon Musk's new title of \"Technoking\" isn't the only leadership change happening at Tesla. As of Thursday, the company has a new head of its trucking division. In a regulatory filing dated March 11, the electric automaker said it had appointed Jerome Guillen, who had served as Tesla's president of automotive since 2018, to lead the division. Guillen has worked at Tesla in various leadership roles since 2010, according to his LinkedIn profile. Starting in January 2016, he assumed the role of vice president of trucking and programs, leading the Tesla Semi project. The move comes as Tesla prepares to deliver its first Semi trucks later this year. Read more: It's time to retire comparisons between Apple and Tesla, once and for all \"As Tesla prepares to enter the critical heavy trucks market for the first time, Mr. Guillen will now leverage his extensive background in this industry to focus on and lead all aspects of the Tesla Semi program,\" the company said in the filing. Tesla unveiled the Semi, a battery-powered class 8 truck, in 2017 to much fanfare. But its production has been postponed several times since. Tesla initially eyed 2019 for the first deliveries and later pushed production to 2020 and finally to 2021. During a conference call in January, Musk said Tesla could theoretically start producing Semi trucks at any time, but that it doesn't have enough batteries to put in them. Still, Tesla plans to start building Semis in limited numbers this year. It has racked up thousands of preorders for the $150,000-$200,000 truck from shipping giants like Walmart. Tesla also said Guillen will lead the deployment of the \"related charging and servicing networks\" for the Semi. Read the original article on Business Insider Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}