{
    "title": "How much does Tesla’s tequila cost? All the products the company sells \nbeyond cars",
    "date": "2/25/2024",
    "url": "https://english.elpais.com/economy-and-business/2024-02-25/how-much-does-teslas-tequila-cost-all-the-products-the-company-sells-beyond-cars.html",
    "text": "Tesla is famous for being one of the leading electric carmakers in the world. The company was a pioneer, paving the way for those who came after. However, cars are far from being the only Tesla product you can buy: through the years, Elon Musk’s company has ventured into many new sectors, giving rise to all kinds of products that bear the brand’s logo. Some are related to the automotive world, but others are more imaginative, like the flamethrower that was launched by Musk’s The Boring Company. The latest to cause a stir is the Tesla Cyberhammer, whose trademark application (discovered by Electrek) refers to it as “exercise equipment.” It’s a gym hammer, an increasingly popular device used in various types of strength and balance exercises. But that is only the tip of the iceberg. One of Tesla’s first forays outside the EV sector was a surfboard, a success that opened the door for all the products that came after it. It was a limited edition; only 200 were made. The surfboards cost $1,500, and they sold out in less than 24 hours. In 2020, the company released a pair of short shorts with the word “S3XY” on the back, a reference to the initials of each of the models that the brand was selling at the time. The price tag was $69, and they sold out quickly. Afterward, resellers started offering them for over $400. That same year, Tesla launched its first alcoholic beverage: a tequila that came in a striking lightning bolt-shaped bottle that the brand claimed to have aged in oak barrels for 15 months. It cost $250 and also sold out in a matter of hours In 2023, Tesla tried its hand at alcoholic beverages again, this time opting for beer. The very elegant, carefully-designed package contained three 330-milliliter bottles; it was only available in Europe for €89 (approximately $98) and also sold out almost immediately. The company’s latest creation is a $50 whistle that looks like a tiny Tesla Cybertruck. Like the rest of the products, it is sold out. The CyberSpoon is a particular case, because it was a collaboration between Tesla and McDonald’s. It was only available in China, where 50,000 units were specially manufactured for the McFlurry (the ice cream also came in a special container). The company’s humanoid robot is not for sale yet, but it is further proof that Tesla has no problem foraying into uncharted territories. First, it will be used it in the company’s factories; then it will also be sold to whoever is interested in it for approximately $20,000. Sign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition Suscríbete y lee sin límites "
}