{
    "title": "Tesla Screws Small Business by Canceling Order for 2,000 Pies",
    "date": "2/23/2024",
    "url": "https://ca.news.yahoo.com/tesla-screws-small-business-canceling-140805702.html",
    "text": "The electric carmaker Tesla is facing community backlash after the company suddenly canceled an order for 2,000 pies — allegedly leaving a charitable small business out of a few thousand dollars, local San Francisco outlet ABC7 reports. Per ABC7, Tesla sought the pies in question from a small San Fran pie shop called The Giving Pies, which donates a portion of its proceeds to local charities. According to shop owner Voahangy Rasetarinera — who took to Facebook yesterday to share her negative experience — Tesla had contacted her shop on February 14 to place its 2,000-pie order. As she and her staff started work, Rasetarinera said, she noticed that Tesla's vendor hadn't yet paid — even though a Tesla representative had approved The Giving Pies' quote. \"I'm like, 'Okay, I'm gonna wait, you know,\" Rasetarinera told ABC7, \"'they are professional, they are a big company.'\" Per the report, Tesla finally got in touch with The Giving Pies late in the evening on February 15. The representative reportedly apologized, explaining that the vendor was new — and then, incredibly, asked to double the order. The shop owner organized her staff at the last minute and in the morning sent a revised invoice to the carmaker's rep, explaining that she would need payment to secure extra supplies. (All the while, Rasetarinera told ABC7, she was turning down other orders to ensure that she and her small team could complete Tesla's.) That's where things took a turn. The next day, after reassuring Rasetarinera that morning that she'd requested approval for the pie purchase, the Tesla rep — hours later, around 2 pm — canceled the order outright, telling the piemaker that \"it unfortunately sounds like we will be changing plans and will not be needing this order.\" \"Thank you so much for your support,\" the rep added in the unhinged message, \"I appreciate it.\" All in all, per the report, Rasetarinera calculated that her experience with Tesla put her out of $2,000 —  a consequential amount of cash for a small business. It also wasn't until the next day that Tesla gave her a reason for the cancellation, which it chalked up to a \"miscommunication\" between the rep and upper management. ABC7 does note that Tesla eventually volunteered to find another way to buy Rasetarinera's pies, but the baker was reportedly hesitant to trust the offer. Understandable! If there's any silver lining, community members reportedly flocked to The Giving Pies to clear out its shelves upon hearing the news. Still, Tesla is a multibillion-dollar company, and this isn't the first time that a venture helmed by Elon Musk — who, of course, also happens to be the world's richest person — has stiffed its vendors. Backtracking on pie payments is just a new low. More on Muskian companies not paying for things: Broke Boy Elon Musk Struggling to Pay Bills The former president delivered a rambling performance as his legal battles heat up. Carl De Souza / Getty ImagesPrince Harry’s party days with Sean “Diddy” Combs could be coming back to haunt him after it emerged that he was named in court documents filed against the rapper, who is facing a litany of shocking sexual assault allegations in a case being brought by one of his former producers Rodney Jones.Federal law enforcement raided two of Diddy’s properties on Monday as part of an investigation into sex trafficking allegations.While Harry is not accused of any wrongdoing, bein  Traylor hit the sun and surf. The Prince and Princess of Wales have now shared a new statement to thank the public for the support and well wishes since she shared the news. A Toronto woman refused to give up the key to her husband’s Rolls-Royce at gunpoint Saturday telling carjackers they were using a toy gun. The woman told Global News thieves then removed the bullets to prove it was real. As Sean O’Shea reports, the car was stolen after the woman was thrown from the car and she was left with painful bruises. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ Family members said the 21-year-old suffered brain injuries and bruising throughout her body. When trying curb ultra-processed foods, finding minimally processed grocery-store snacks might be challenging. A nutritionist shares what he buys. NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days. If he does, it will stop the clock on collection and prevent the state from seizing the presumptive Republican presidential nominee's assets while he appeals. The appeals court also halted other aspects of a trial judge's ruling that had barred Trump and his sons Eric Trump and Donald Trump Jr.,  (Bloomberg) -- Donald Trump’s business empire was supposed to be in peril like never before on Monday. Instead, it turned into the single-greatest day on record for the former president’s wealth. Most Read from BloombergTrump Vows to Pay Fraud Trial Bond Cut by 68% to $175 MillionTrump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest PeopleAfter Exposing Realtors, Eliminate the Mortgage Interest DeductionUS CEOs Extend China Stay on Last-Minute Invite to Meet XiMahathir Sons The Duchess of York, 64, was recently diagnosed with skin cancer after battling breast cancer “The Daily Show” host tears into the former president’s claim ― and shows why the case matters.  The 'Frida' star showed off the teen's photography skills by sharing a snapshot from their trip to the beach New York Times reporter and CNN political analyst Maggie Haberman joins CNN’s Kaitlan Collins to detail her takeaways from former President Donald Trump’s latest legal developments. As some celebrities issued apologies to Kate Middleton, people are demanding Kim Kardashian follow suit. Play this game for 1 minute and see why everyone is addicted. The former president appeared before a New York judge in an unsuccessful push to delay his hush money trial or dismiss the charges. Hannah McKay/File Photo/ReutersFriends of Prince William and Princess Kate Middleton have told The Daily Beast that they would not welcome the “drama” a visit by Prince Harry would entail, and said Kate and William are focused on protecting their privacy as she receives treatment for and recovers from cancer.The comments add to a sense that while Harry and Meghan Markle appear keen to paint themselves as eager to reconcile with the royals after over two years of very public attacks on them—indee Dame Joan Collins has refused to talk about the Duke and Duchess of Sussex after paying tribute to Catherine, Princess of Wales.  The president has been going after his presumptive 2024 opponent with a little more venom than usual The collection launches March 25. President Biden poked fun at former President Trump for boasting about winning two golf trophies at his own golf club’s awards Sunday. “Congratulations, Donald. Quite the accomplishment,” Biden wrote on X, the platform formerly known as Twitter. Biden attached a screenshot of Trump’s post earlier in the night on Truth Social. “It is my great… "
}