{
    "title": "A Tesla Cybertruck driver put the EV through its paces on a long trip",
    "date": "1/14/2024",
    "url": "https://www.businessinsider.com/tesla-cybertruck-driver-road-trip-issues-ev-2024-1",
    "text": "       The YouTuber Dennis Wang is one of the first drivers to document a cross-country road trip in the much-hyped Cybertruck, just weeks after the first vehicles were shipped to customers. Shortly after the Foundation Series version of the truck was released, Wang and his friend took it on a 27-hour road trip from Austin to Joshua Tree National Park in California. Wang, who runs DennisCW, a YouTube channel that focuses on Tesla, told Business Insider he wanted to put the Cybertruck through its paces and enjoyed the ride. But said he ran into some issues along the way — including difficulties with charging and a glitch in Tesla's infotainment system. \"It's the most comfortable Tesla that I've owned, but in terms of efficiency, it was definitely lacking in range, and we had to stop a lot along the way,\" Wang said, adding that he'd driven all four other Tesla models. The Cybertruck Foundation Series has an estimated range of 320 miles on its all-wheel drive option. But, Wang said, at times, it felt as if that range was cut in half. The pair stopped 12 times during the 1,340-mile trip, which rounds out to just more than 110 miles between charges, and Wang said they stopped every one to two hours to recharge. While the pair took turns driving straight through the night, he said, the stops turned what could have been a 20-hour road trip into a 27-hour one. Wang attributed the inefficiencies in range to the cooler temperatures in Texas and his tendency to speed. He said he'd seen improved range since driving the car in California's more temperate climate. He also said that closing the tonneau, the cover that spans the back of the truck, helped improve the Cybertruck's range. A spokesperson for Tesla did not respond to a request for comment. Related stories Wang isn't the first to point out some potential issues in the Cybertruck's estimated range. Last week, Out of Spec Reviews performed an unofficial highway range test on a Cybertruck Foundation Series vehicle that showed the vehicle clocked in at just 254 miles of range when driven from a full charge until the battery died, only about 80% of its estimated range. Wang, on the other hand, said he tended to charge the vehicle from a 10-30% range up to a 70-80% charge. Many factors can impact an electric car's range, including tires, weight load, speed, and cold weather conditions. A 2023 study from Recurrent Auto cited by Bloomberg found that many electric vehicles lost about 30% of their range in temperatures below freezing. One unexpected difficulty: charging the car. Wang said that when he stopped to use Tesla's Superchargers, many didn't appear to be designed with the Cybertruck's larger size in mind. \"You had to back up as far as possible to the parking stop for the cable to reach, and sometimes the cable was barely long enough to plug into the car,\" he said. Plus, he said the Cybertruck's infotainment system in the front of the car glitched about 12 hours into the trip, and the screen went black. The YouTuber said the screen still appeared to be responsive when they tapped on it but was no longer backlit, so the two men had to rely on the Tesla app to control some of the vehicle's features. He said the infotainment system did light back up after they arrived at their destination and turned the truck off for several hours. \"It was annoying, but we could still function,\" Wang said. But despite the hiccups along the way, Wang said he enjoyed the experience, especially the spacious cabin and comfort of the vehicle. \"It's a fantastic truck,\" Wang said. \"The interior and build quality are definitely one of Tesla's best. It makes me really excited for what future Teslas will look like.\" Read next Jump to "
}