{
    "title": "The Economy Outperforms And Earnings Improve",
    "date": "1/28/2024",
    "url": "https://www.forbes.com/sites/bill_stone/2024/01/28/the-economy-outperforms-and-earnings-improve/",
    "text": "The returns from the Magnificent 7 were dented last week as Tesla (TSLA) declined by 13.6% in the ... [+] wake of poor earnings and outlook.  (Photo by Justin Sullivan/Getty Images) The earnings season kicked into gear last week, with 74 S&P 500 companies reporting. The S&P 500 rose 1.1% for the week and closed slightly lower than the all-time high set on Thursday. The 10-year Treasury yield was fractionally changed at 4.1%. With Tesla’s\nTSLA\n bad week, the Magnificent 7 lagged this with a gain of 0.3%, while the equal-weighted S&P 500 rose by 1.0%. Recall the Magnificent 7 consists of Microsoft\nMSFT\n (MSFT), Meta Platforms\nFB\n (META), Amazon.com (AMZN), Apple\nAAPL\n (AAPL), NVIDIA\nNVDA\n\nDIA\n (NVDA), Alphabet\nGOOGL\n (GOOGL), and Tesla (TSLA). The fourth-quarter earnings season starts the first of its two busiest weeks, with 106 S&P 500 companies scheduled to report. A more detailed preview of the earnings season is available here. Last week, the fourth quarter GDP release showed an economy performing better than consensus expectations, with 3.3% annualized growth. The underlying details, especially the robust personal consumption, supported expectations of continued growth. Inventories and trade will likely hurt future economic growth on the margin, but the headline should remain positive for at least the short term. 4Q 2023 GDP Crucially, better inflation data accompanied robust economic growth, with the GDP price index rising at only a 1.5% annualized rate. This quarter exhibited the most attractive mix to markets, better economic growth with no inflation pressures. GDP Inflation Readings Thanks to the better inflation readings, the probability of a March interest rate cut from the Federal Reserve did not plummet despite the robust GDP growth. The odds of a March easing are hovering just below fifty percent. The rate decision from the Federal Reserve meeting on Wednesday holds little suspense as it is almost certain that no action will be taken on short-term interest rates. Instead, market participants will parse Chair Powell’s comments for any clues as to the timing of the first rate cut. Probability Of A Fed March Rate Cut Blended earnings, which combine actual with estimates of companies yet to report, remain below forecasts at the end of the quarter. Last week saw some improvement as the industrial and technology sectors began to help us dig out of the hole caused by bank earnings. S&P 500 Earnings Season According to FactSet, the industrial and technology sectors were the most significant contributors to the improvement in the headline growth rate last week. A few airlines were among the biggest contributors to industrials. Though the market did not like their outlook, Intel\nINTC\n (INTC) positively contributed to technology earnings. Among the companies scheduled include Pfizer\nPFE\n (PFE), Alphabet (GOOGL), Microsoft (MSFT), Starbucks\nSBUX\n (SBUX), Amazon.com (AMZN), Meta Platforms (META), Chevron\nCVX\n (CVX), and Exxon Mobil (XOM). Earnings By Sector Sales growth is closely tied to nominal GDP growth, combining after-inflation economic growth (real GDP) with inflation. With nominal GDP growth likely solid year-over-year for the fourth quarter, topline revenue growth for companies should have some tailwind. Sales growth is fractionally higher than expectations going into the earnings season after another boost last week. Sales By Sector So far, the blended earnings performance has underperformed expectations at the end of the quarter. Combining actual results with consensus estimates for companies yet to report, the blended earnings growth rate for the quarter is at -1.4% year-over-year, below the expectation of +1.6% at the end of the quarter. Earnings Estimate Summary The returns from the Magnificent 7 were dented last week as Tesla (TSLA) declined by 13.6%. Luckily, the divine combination of robust growth and tame inflation in the GDP report boosted the breadth of the markets, with stocks below the mega-caps benefitting from the higher probability of avoiding a recession. Getting the bank reports behind us provided the expected earnings lift last week. Investors should continue to expect better year-over-year earnings growth for the rest of the earnings season. While the Fed meeting on Wednesday is almost sure to have no change to rates, Chair Powell’s comments will be watched closely for clues as to the timing of the first cut. Disclosure: Glenview Trust currently has holdings of Microsoft (MSFT), Meta Platforms (META), Amazon.com (AMZN), Apple (AAPL), NVIDIA (NVDA), and Alphabet (GOOGL) Pfizer (PFE), Starbucks (SBUX), Meta Platforms (META), Chevron (CVX), and Exxon Mobil (XOM) within its recommended investment strategies.  "
}