{
    "title": "Dow Jones Futures Fall; Updated Tesla Model 3 Launched In North America",
    "date": "1/10/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-fall-updated-tesla-model-3-launched-in-north-america/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     Dow Jones futures were little changed Wednesday morning, along with S&P 500 and Nasdaq futures. Tesla (TSLA) launched the updated Model 3 in North America Tuesday night. Taiwan Semiconductor (TSM), Hewlett Packard Enterprise (HPE), Intuitive Surgical (ISRG), Aehr Test Systems (AEHR) and Lennar (LEN) also were in the news. Investors also are still awaiting possible SEC approval of spot bitcoin ETFs. Amid megacap techs, Microsoft (MSFT), Meta Platforms (META), Nvidia (NVDA), Amazon.com (AMZN) rose a fraction. Google parent Alphabet (GOOGL) was little changed. Dow Jones futures fell less than 0.1% vs. fair value. S&P 500 futures edged lower. Nasdaq 100 futures rose about 0.1%. The 10-year Treasury yield dipped to 3.99% after edging up to 4.02% on Tuesday. Bitcoin fell to just below $45,000. Remember that premarket action in Dow futures and elsewhere doesn't necessarily translate into actual trading in the next regular stock market session. The Dow Jones Industrial Average declined 0.4% in Tuesday's stock market trading. The S&P 500 index fell 0.15%. The Nasdaq composite edged up 0.1% after briefly testing the 21-day line. The small-cap Russell 2000 fell 1.05%, but closed above the 21-day line. Taiwan Semiconductor early Wednesday reported December revenue fell 8.4% vs. a year earlier in local currency, or 14.4% vs. November. But Q4 revenue still topped estimates slightly, as AI chip demand offset weakness elsewhere. Full-year revenue declined 4.5%. The chip foundry makes chips for Apple (AAPL), Nvidia and many others. TSM stock was little changed before Wednesday's open. Shares are working on a 105.52 handle buy point. Hewlett Packard Enterprise (HPE) will buy Juniper Networks (JNPR) for $14 billion, following Monday night reports of late-stage talks. HPE stock nudged higher after plunging 8.9% on Tuesday. JNPR stock rose a fraction after soaring 22% to a two-year high on Tuesday. Aehr Test Systems (AEHR) topped fiscal Q2 views slightly, but the EV chip-testing equipment maker slashed full-year guidance. AEHR stock plunged more than 15%, set to hit a 52-week low. Intuitive Surgical (ISRG) reported preliminary Q4 revenue up 17% to $1.93 billion, slightly above consensus. It credited strong demand for procedures using its da Vinci robotic surgical systems. ISRG stock jumped early Wednesday, clearing alternate handle buy point of 340.49. Lennar (LEN) hiked its annual dividend to $2 a share from $1.50 and increased its buyback by $5 billion. LEN stock rose 2% within a short consolidation. KB Home (KBH) reports fiscal fourth-quarter results Wednesday night. Meanwhile, the SEC is expected to approve spot bitcoin ETFs soon. There have been reports that Jan. 10 was a deadline. The SEC's account on the X social site declared that bitcoin ETFs had been approved. But the financial watchdog agency said the account was compromised. Cryptocurrency exchange Coinbase (COIN) and bitcoin miner Marathon Digital (MARA) fell solidly early Wednesday. Coinbase and MARA stock fell sank 4.7% and 1%, respectively, on Tuesday. The updated Model 3 is now available in North America, Tesla announced via Elon Musk's X social site Tuesday night. The \"Highland\" Model 3, with has limited exterior changes and some internal refinements, had already been available in China and Europe late last year, from sedans made  at the Tesla Shanghai plant. The Fremont-made updated Model 3 for the U.S. will start at $38,990 for the base-model RWD variant and $45,990 for the Long Range, unchanged from the older Model 3. The RWD and LR trims are not eligible for IRA tax credits of $7,500 due to tougher battery sourcing rules. Tesla, at least for now, is not offering a Model 3 Performance. The old Performance had a $50,990 price tag, but only $43,490 including tax credits. Notably, the Model 3 Long Range is effective more expensive than all Model Y variants, which are eligible for tax credits. TSLA stock edged higher early Wednesday. Tesla stock sank 2.3% on Tuesday to 234.96, undercutting the 50-day moving average but still holding above the 200-day line. Microsoft stock rose a fraction in premarket trade. Shares are working on a 384.30 flat-base buy point, but is already flirting with early entries. Google stock was little changed. Shares moved back into a buy zone Tuesday. Amazon stock nudged higher, moving within a buy zone. Meta stock ticked up, extended from a buy zone. Nvidia stock advanced 1% after big gains to start the week. Shares are fractionally above break-even. Please follow Ed Carson on Threads at @edcarson1971, X/Twitter at @IBD_ECarson and Bluesky at @edcarson.bsky.social for stock market updates and more. YOU MAY ALSO LIKE: Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Tesla Vs. BYD: Tesla Tests Key Levels; Big News Looms For New EV King HPE To Buy Juniper Networks For $14 Billion Futures: MSFT Eyes Apple's Title; SEC OKs Bitcoin ETFs 3:15 AM ET\nNvidia gained 240% in 2023. Analysts have a price target of 700 for the stock. Is Nvidia stock a buy... 3:15 AM ET\nNvidia gained 240% in 2023. Analysts have a price target... Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}