{
    "title": "Tesla Q4 Preview: Rich Margins And EV King Status May Be History \n(NASDAQ:TSLA)",
    "date": "1/20/2024",
    "url": "https://seekingalpha.com/article/4663730-tesla-q4-preview-rich-margins-and-ev-king-status-may-be-history",
    "text": "Gerasimov174 Gerasimov174 We previously covered Tesla, Inc (NASDAQ:TSLA) in October 2023, discussing its decelerating Full Self-Driving (\"FSD\") adoption, as demonstrated by the moderating service revenues and declining gross margins. Combined with the reversal in sentiments from the automaker's impacted electric vehicle (\"EV\") revenues and elevated inventory levels, we at that time believed that the stock's elevated P/E valuation was unwarranted, explaining our Hold rating then. In this article, we shall discuss why TSLA's EV King investment thesis has faded, with it no longer the largest global volume producer by Fiscal Q4 2023 (to be reported post-market on Wednesday, January 24th), with its profit margins likely to continue suffering as an adverse effect of the sustained price cuts. While improved manufacturing scale may be possible in the long term, we believe that there may be more near-term uncertainty, arising from the increased operating expenses and potential unionization of its labor force. With TSLA being inherently more expensive than its Magnificent Seven peers, we believe that the stock may likely trade sideways for a little longer, before it grows into its premium valuations. For now, TSLA has already been dethroned as the king of EVs, as it produced 494.9K units (+14.9% QoQ/ +12.5% YoY) and delivered 484.5K in FQ4'23 (+11.3% QoQ/ +19.5% YoY), or the equivalent annualized total of 1.97M and 1.93M units, respectively. These numbers are underwhelming indeed, when compared to BYD Company's (OTCPK:BYDDF) excellent pure EV production of 518.96K units (+18.2% QoQ/ +59% YoY) and sales of 526.4K units in FQ4'23 (+21.8% QoQ/ +60% YoY), or the equivalent annualized total of 2.07M and 2.1M, respectively. With TSLA expecting to deliver 2.2M units in 2024, it appears that BYDDF may very well boast the honor of being the EV King ahead, triggering further uncertainty in the former's prospects as the latter also enters the North American market through Mexico. Combined with the sustained price cuts in the U.S., the EU, and China in 2023, it is unsurprising that TSLA is expected to generate underwhelming revenues of $25.76B (+6.7% QoQ/ +17.7% YoY) in the upcoming FQ4'23 earnings call on January 24, 2024. Its decelerating rate of growth is alarming indeed, when compared to its FQ4'22 sales growth rate of +13.3% QoQ/ +37.2% YoY, and FQ4'21 growth rate of +28.8% QoQ/ +64.9% YoY. PPI Index For Transportation Equipment Manufacturing Industry Trading Economics Trading Economics At the same time, inflation is still raging, with the Producer Price Index for the Transportation Equipment Manufacturing industry at record high of 140.563x by December 2023 (-0.089 MoM/ +2.579 YoY/ +16.163 from 2019 averages). This implies that the consensus FQ4'23 adj EPS estimates of $0.74 (+1.3% QoQ/ -38.1% YoY) are not overly bearish as well, with TSLA's price cuts directly impacting its profit margins despite the volume growth. The Consensus Forward Estimates Tikr Terminal Tikr Terminal The same has been observed in the consensus EBIT margins estimates of 10.9% in FY2024 and 13.1% in FY2025, with these numbers falling short of TSLA's hyper-pandemic peak margins of 16.8% in FY2022. It is apparent that the automaker may face more top and bottom line headwinds in the intermediate term, as the EV price war deepens from the inventory clearance of its outdated models and the flooded market from Hertz's (HTZ) sale of 20K units. On the other hand, TSLA is still expected to generate a sustained expansion in the adj. EPS profitability at a CAGR of +9.3% despite the elevated interest rate environment. While it remains to be seen when the automaker may introduce the $25K EV, the CEO has confirmed that the Berlin plant will be manufacturing its future mass market offerings, implying its expanded operational scale and efficient global supply chain over the next few years. It makes sense, then, why TSLA has applied for an expansion in Berlin Gigafactory's manufacturing capacity from the annualized sum of approximately 260K in March 2023 to the approved capacity of 500K, and to the eventual long-term plan of 1M units. The same may also be observed in the Texas Gigafactory, with approximately 520 Cybertrucks already rolling out of the production line by the end of 2023, with demand gated by supply. This is based on the 1.9M pre-orders recorded by July 2023 and the management's commentary of over 1M in pre-orders by the latest quarter. Demand may continue to grow as well, thanks to the reopened Cybertruck pre-order website with $250 refundable deposit, as the automaker targets an annualized production capacity of 250K by 2025. This trend may also be aided by the declining lithium spot prices, with the EV market growth expected to grow to $906.7B by 2028, and Goldman Sachs already projecting price parity to internal combustion engine (\"ICE\") vehicles by mid-2026. This means that energy storage costs are likely to moderate, further triggering tailwinds in the EV adoption in the second half of the decade, as inflation normalizes by Q4'26. As a result, with TSLA's gross/ EBIT margins diluted over the next \"year to 18 months before Cybertruck is a significant positive cash flow contributor,\" further impacted by the refreshed New Highland Model 3 and Juniper Model Y to be launched in 2024, it appears that our previous Ford Motor Company (F) observation may hold true. In that, multiple automakers are likely to report underwhelming EV margins and stock performance over the next few years, until the Gen 2/ 3 offerings are launched and demand returns. TSLA Valuations Seeking Alpha Seeking Alpha As a result of these near-term headwinds, we are not certain if TSLA may be able to maintain its premium FWD EV/ EBIT valuation of 73.17x and FWD P/E valuation of 68.73x, compared to its 1Y mean of 51.69x/ 58.22x and the sector median of 13.96x/ 15.42x, respectively. Most importantly, the automaker has had to hike the wages of most of its U.S.-based workers by +10% from January 2024 onwards, in an effort to stave off the potential unionization of its workers. Readers must note that TSLA is also facing a growing labor dispute in the EU, with things potentially escalating in Berlin. Assuming a similar hike in wages ahead, we may see its margins further compressed, as similarly observed for multiple legacy automakers after the historic UAW successes with Ford, General Motors (GM), and Stellantis (STLA). This means that TSLA's premium FWD valuations may not be sustainable until the margin headwinds are fully resolved, with any negative news likely to be trigger moderate volatility ahead. Otherwise, the stock may at best trade sideways as it has over the past few years, before it eventually grows into its premium valuations. Only time may tell. TSLA 3Y Stock Price Trading View Trading View And it is due to the mixed bag of pessimistic news discussed above, that TSLA has recorded another volatile rise and fall since the October 2023 bottom, with the stock losing much of its recent gains. Magnificent 7's 1Y & YTD Stock Prices Trading View Trading View In addition, if we are to look closer, TSLA's stock performance has also paled in comparison to the Magnificent Seven's, SPDR® S&P 500 ETF Trust (SPY), and Invesco QQQ Trust ETF (QQQ) outperformance on a one year and YTD basis, with multiple EV stocks negatively impacted by the ongoing winter storm in the U.S. Magnificent 7's FWD P/E Valuations Tikr Terminal Tikr Terminal If anything, TSLA has recently overtaken Amazon (AMZN) and Nvidia (NVDA) as the most overvalued stock amongst the Magnificent Seven as well, with the elevated expectations likely to bring forth increased volatility. Furthermore, we believe TSLA's EV demand may remain impacted in the near term, with borrowing costs for used vehicles still elevated at 11.4% and new vehicles at 7.1% by December 2023, compared to 8.2% and 5.4% in December 2019, respectively, implying that the price cuts may be a norm for a little longer. On the one hand, the TSLA stock appears to be trading near its fair value of $207.60, based on the 1Y P/E mean valuation of 65.29x and the consensus FY2023 adj EPS estimates of $3.18. Based on the consensus FY2025 adj EPS estimates of $5.31, there seems to be a more than decent upside potential of +60.7% to our long-term price target of $346.60. On the other hand, TSLA has charted painfully lower highs/ lower lows since the July 2023 peak, with it remaining to be seen if bullish support may materialize at its previous support levels of $200s. If these support levels are breached, we may see a further correction to its next support range of between $180s and $190s, implying a -14% downside from current levels. As a result of the potential upcoming volatility, while Tesla, Inc.'s long-term prospects may appear to be bright, we prefer to continue rating TSLA as a Hold (Neutral) here, with the market's elevated greed index likely contributing to the stock's inflated valuations at a time of uncertain macroeconomic environment. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSLA, AMZN, NVDA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The analysis is provided exclusively for informational purposes and should not be considered professional investment advice. Before investing, please conduct personal in-depth research and utmost due diligence, as there are many risks associated with the trade, including capital loss. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}