{
    "title": "Tesla CEO Elon Musk denies drug use allegations",
    "date": "1/8/2024",
    "url": "https://www.businessinsider.com/elon-musk-tesla-ceo-denies-drug-use-allegations-2024-1",
    "text": "       Elon Musk has fired back at a bombshell Wall Street Journal report over his drug use. The Tesla CEO said that \"not even trace quantities\" of drugs were found in his system during three years of random testing mandated by NASA after he famously smoked marijuana on the Joe Rogan podcast. \"After that one puff with Rogan, I agreed, at NASA's request, to do 3 years of random drug testing,\" wrote Musk in a post on X. \"Not even trace quantities were found of any drugs or alcohol.\" The SpaceX founder slammed the WSJ report as \"not fit to line a parrot cage for bird 💩.\" When contacted by Business Insider, a spokesperson for the Journal said: \"We stand by our reporting.\" Related stories Senior figures across Musk's companies have raised concerns about the billionaire's drug use, which reportedly includes cocaine, LSD, ecstasy, and ketamine, according to the WSJ. One Tesla board director was reportedly so alarmed they decided not to run for reelection. The WSJ also reported that SpaceX executives feared Musk may have been under the influence during an \"unhinged\" and \"cringeworthy\" SpaceX staff meeting, and that Tesla board members had similar concerns when he tweeted that he was considering taking the company private in 2018. Musk famously smoked a joint on Joe Rogan's podcast in 2018, and has reportedly told people he has taken small doses of ketamine for depression. His appearance on Joe Rogan's show saw NASA, which partners with SpaceX, launch a $5 million investigation into drug use at the company, the results of which are unknown. Musk has previously said that both he and SpaceX employees were required to take random drug tests for a year following the Rogan incident, as companies that do business with the federal government are required to have drug-free workplaces. \"SpaceX was a NASA contractor, and they are big believers in the law,\" Musk told his biographer Walter Isaacson. \"So I had to be subjected to random drug tests for a couple of years.\" \"Fortunately, I really don't like doing illegal drugs,\" he added. SpaceX and Tesla did not immediately respond to a request for comment from BI, made outside normal working hours. Read next Jump to "
}