{
    "title": null,
    "date": "1/29/2024",
    "url": "https://www.telegraph.co.uk/business/2024/01/29/driverless-cars-ai-artificial-intelligence-tesla-apple/",
    "text": "The dangerous self-driving experiment is turning us all into human guinea pigs Who wants to be a human guinea pig? It involves a new kind of robot which may maim and kill you, but on the plus side, you’ll get a chance to participate in an exciting foray in innovation. Don’t all rush at once. The ethics of medical experiments that pose a danger to participants, such as challenge trials, are debated at great length. And rightly so. Yet we may soon become unwilling test subjects for a technology that looks more dubious by the day. Parliament has begun debating the Automated Vehicles Bill, announced in the King’s Speech last year. It’s intended to coax self-driving vehicles onto our roads by providing a clear legal framework. The Government touts autonomous driving as “the future of transport, aiming at safer, greener and more efficient travel for all”, and it doesn’t want Britain to miss out on either the consumer benefits or the economic potential. In reality, we’ve been here before. Steam locomotives caused a death on their very first day of public operation, when the MP William Huskisson fell under Stephenson’s Rocket. The first pedestrian to be killed by an automobile in the UK was struck with a vehicle moving at just 4mph. Extinguishing the risk to the public from innovations in mass transportation is clearly impossible - they’re designed to go everywhere, so accidents can happen anywhere. A balance is needed. But recent developments in the US have made regulators think twice. Not so long ago, pundits and image-conscious policy wonks regarded autonomous driving as the cornerstone of a “fourth industrial revolution” encompassing AI and smart cities. But no sooner had the dream inched towards reality than things became ugly. Just weeks after San Francisco permitted the deployment of General Motors’ Cruise robo-taxis last August - after years of human-supervised trials - then a grisly incident obliged it to call a halt. A pedestrian was dragged 20 feet under a Cruise taxi which had failed to stop. Regulators had only received partial footage of the collision from GM – and not the really nasty part – and so suspended the company’s licence. A third party report into the incident last week suggested that ropey internet was probably why regulators didn’t get the full details. But nevertheless, it found serious management failings at Cruise on multiple levels. The worst of these was an ingrained hostility to co-operating with a regulator. Cruise was banned from operating in the state in October, and in December announced 900 job cuts. It’s just the latest in a long line of industry retrenchments. Some $100bn (£79bn) has been spent on self-driving vehicles over the past decade. Only last week, Bloomberg reported that Apple is scaling back its autonomous driving software project Titan, and pushing back the internal launch date to 2028. The report states that at best the software will perform what the industry classifies as Level 2 functions - partial automation such as steering and acceleration assistance. Big deal. Partial driving is a widely recognised problem, as the RAC Foundation notes. Humans who have turned off their attention can only switch it back on very slowly. Such problems have obliged Tesla to recall cars over its partial self-driving tech, the most recent a giant two million-vehicle recall in December following a safety agency investigation. Despite the many billions of dollars spent on self-driving technology projects over more than a decade, not one truck driver has yet been replaced. “Progress in this technology has failed to meet many of its promoters’ predictions,” the Transport Select Committee observed last November. Edison analyst Richard Windsor says that the fundamental technical issue is a reliance on deep learning, the basis of generative AI systems. This just isn’t reliable enough to create a safer-than-human robot driver in real world conditions. We shouldn’t allow the astonishing mimicry of large language models such as ChatGPT to distract us from the corresponding progress in machine vision. To borrow an idiom: if you’re so smart, how come you keep crashing? It’s also exposed a moral black hole. Only a few years ago, the venture capital class and their lackeys were arguing that “we’re going to have to be more forgiving of a car causing a fatality” if it was a self-driving car. Because progress. As the Tesla biographer Ed Niedermeyer observed in 2019, “the tech sector has lost its ability to anticipate the negative consequences of its innovations”, and was instead “blitz-scaling its way toward a technological dystopia”. The story reverses the familiar mythology of innovation and regulation. We know all about regulators inhibiting innovation – but these days, they are so keen to be seen as the first, and polish their resumes, they risk putting the public in danger for no good reason. Fortunately the Autonomous Driving Bill is aware of these issues. It calls out mis-labelling of autonomous features – something Tesla has been criticised for – and there’s a requirement to provide information to regulators. But not enough, according to the select committee. Lords confirmed to me last week that much more detail is needed.  As is continuing scrutiny. Regulators are rueing the decision to let the companies mark their own homework. The Department for Transport still hopes that half of our car journeys by 2047 could be autonomous. But it may turn out to be like a 1970s council skateboard park, built for skateboarders who never come. "
}