{
    "title": "Stellantis CEO warns of EV ‘bloodbath’ and ‘race to the bottom’ if car \nmakers follow Elon Musk’s lead and start cutting prices",
    "date": "1/19/2024",
    "url": "https://fortune.com/2024/01/19/elon-musk-tesla-stellantis-ev-bloodbath-race-to-bottom/",
    "text": "As EV demand cools, Elon Musk has stayed ahead of the field by cutting prices for Tesla’s flagship cars and sacrificing profitability to boost demand. But a competing CEO warned of a possible “red ocean” if its competitors follow suit. Carlos Tavares, CEO of Chrysler parent company Stellantis, cautioned against a “race to the bottom” among EV manufacturers after competitor Ford announced it would cut back production and lay off workers making its F-150 Lightning electric truck. “If you go and cut pricing disregarding the reality of your costs, you will have a bloodbath. I am trying to avoid a race to the bottom,” Tavares said at an Amsterdam event on Friday, where he also unveiled Stellantis’ new large-platform battery system. Tavares’ comments coincide with an EV market slowdown that’s forcing manufacturers to pull back on their onslaught of investment into the new automotive tech. Last year, American carmakers scrambled to catch up to market leader Tesla, spending billions on new EV lines. But sales are slowing down and profits are taking a hit, too. Notably, not one of the top four automakers in the U.S., comprising Detroit’s Big Three along with Toyota, is ponying up for a Super Bowl ad for the first time since 2001. Read more: With Germany in recession and Detroit reeling over ultra-cheap Chinese EVs, Beijing vows to crack down on ‘blind’ construction of new EV projects Ford has admitted that its EV line is losing money, to the tune of an estimated $4.5 billion last year. GM pulled back on its EV production target last October. As the costs of owning a car continue to rise, lowering sticker prices is a way for automakers to temporarily keep demand up – but it can be risky. “I know a company that has brutally cut pricing and their profitability has brutally collapsed,” said Tavares, without calling out Tesla or Musk by name. Indeed, this January has seen the worst start for any year since Tesla has been publicly traded. Elon Musk’s EV giant began lowering prices last year in an effort to stay ahead in a slowing market full of new competitors. Those cuts saw Tesla’s profit margin decrease by over 40% year-over-year, as of last year’s Q3 earnings report. Musk said in a subsequent earnings call that with interest rates remaining high, Tesla will need to keep cutting prices in order to keep monthly payments low enough to be attractive to consumers. It reduced the price of its Model Y SUV by over $5,000 for some European buyers this week, after recently doing the same in China. Stellantis announced earlier this month that it will reduce its operating costs by closing factories and laying off about 1,350 workers. So far, though, it hasn’t budged on the sticker price for its electric Dodge and Jeep vehicles. “When you do that, things become very difficult in the future,” said Tavares. Representatives from Tesla and Stellantis could not be immediately reached for comment. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}