{
    "title": "Tesla Investor Relation's Head Says Jump Brokers If Current One Doesn't \nAllow Voting At 2024 Shareholder Meeting",
    "date": "2/27/2024",
    "url": "https://www.tradingview.com/news/benzinga:24a462490094b:0-tesla-investor-relation-s-head-says-jump-brokers-if-current-one-doesn-t-allow-voting-at-2024-shareholder-meeting/",
    "text": "Tesla Inc TSLA Investor Relations Vice President Martin Viecha on Tuesday recommended that shareholders who hold the EV giant’s shares jump to a different broker if their current one doesn’t allow voting at the annual shareholder meeting. What Happened: “Everyone who owns TSLA shares through a broker can vote at every annual meeting,” Viecha clarified in a post on X (formerly Twitter) while adding that voting requires no registration with Tesla investor relations. However, some brokers in Europe don’t allow voting, the executive noted. “...If that’s the case, consider moving your TSLA shares to another broker,” Viecha wrote. He was responding to a Tesla enthusiast who enquired on voting status ahead of Tesla’s 2024 shareholder meeting wherein they expect shareholders to vote on “sensitive subjects.” Everyone who owns TSLA shares through a broker can vote at every annual meeting. No need to be registered with Tesla IR. I'm aware that some European brokers don't allow voting, if that's the case, consider moving your TSLA shares to another broker. Why It Matters: Tesla’s annual shareholder meeting in 2023 was held on May 16 at Gigafactory Texas. The date for the current year is not confirmed as of now. Tesla CEO Elon Musk‘s new compensation might be one of the proposals that shareholders vote for this year given that he is no longer covered by any compensation package. Furthermore, Musk’s 2018 compensation plan with a maximum value of about $56 billion was struck down by a Delaware judge last month as an “unfathomable sum.” Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Tesla CEO Elon Musk Reflects On Hardships After Apple Calls It Quits: ‘The Natural State Of A Car Company Is Dead' © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}