{
    "title": "‘Next Tesla’ EV startups struggle as demand sags and once-bullish investors \nflee: ‘Whoever finds a sponsor has the best chance’",
    "date": "2/24/2024",
    "url": "https://fortune.com/2024/02/24/next-tesla-ev-startups-struggle-as-investors-flee/",
    "text": "There was a time when the backing of some of the world’s deepest pockets and the mere ambition to sell electric cars was enough to inspire confidence in the stocks of upstarts Rivian Automotive Inc. and Lucid Group Inc. Now investors have all but thrown in the towel on the shares. All it took was a fresh dose of reality from the two companies this week around cooling demand for EVs. Rivian, which makes electric pickups, SUVs and delivery vans and counts Amazon.com Inc. as its top shareholder, said its production will stay flat at last year’s levels. It also announced plans to shrink its workforce again. Lucid, majority-owned by Saudi Arabia’s sovereign wealth fund, projected only a slight increase in output over 2023. Both forecasts fell far short of analysts’ expectations. For investors, the sense of gloom has been building since October, when Tesla Inc. warned of sagging interest in EVs. Though shares of the EV giant have fared poorly since then, losing around 20% and massively underperforming the broader market, the impact on smaller rivals like Rivian and Lucid has been nothing short of disastrous. Read more: Tesla has chance to ‘grow their market share even more’ thanks to EV startups faltering and legacy automakers focusing on hybrids “If you are a hyper-growth company in what is seen as a disruptive industry and you are not growing your topline, you are in trouble,” said David Mazza, chief strategy officer at Roundhill Investments. “Having an anchor investor like Amazon or the Saudis gives them a longer runway from a capital perspective, but their growth will still be slower and margins thinner than what was once expected.” Shares of Irvine, California-based Rivian are down by about 44% since Tesla’s October warning — the first in a series of grim outlooks from global EV-makers and suppliers — and closed Friday at a record low. Newark, California-based Lucid has dropped some 33% in the same period, and isn’t far above its own nadir. Still, had it not been for their wealthy backers — Amazon has a 17% stake in Rivian, and Saudi Arabia’s Public Investment Fund holds roughly 60% of Lucid, data compiled by Bloomberg show — the stocks could be looking far uglier. “The presence of these names is a comfort to investors and a cushion to the price,” Mazza said. “If these stocks were just relying on the EV hype, then they will be down much worse.” Amazon in an emailed statement said that the recent results from Rivian don’t change anything about the e-commerce company’s “existing investment, collaboration, or order size and timing.” Rivian has a deal with Amazon to sell it 100,000 electric delivery vans by 2030. Saudi Arabia’s PIF didn’t respond to an email seeking comment outside of the fund’s regular business hours on Friday. Overall, the biggest concern is that these cash-burning, unprofitable companies will struggle to sell cars at a time when even industry-leader Tesla — by far the biggest seller in the US market — is cutting prices to boost demand. And while Tesla’s profits and large-scale production allow it to compete by lowering prices, Rivian and Lucid have neither of those advantages. “For these car manufacturers, investors want to see demand,” said David Wagner, portfolio manager at Aptus Capital Advisors. Rivian’s latest results suggest it will take several quarters to emerge from its production stoppage with a leaner cost structure and a redesigned platform, he said. “In the meantime, I think skeptics will be scrutinizing the cash balance and ringing alarm bells,” Wagner said. “So if there is no multiple expansion and no growth — what else is the stock supposed to do?” Both Rivian and Lucid are now worth a fraction of the prices they fetched at their public-market debuts in 2021. Rivian’s market value is around $9.6 billion, and Lucid’s is about $6.9 billion. That’s a long way down from their $153 billion and $91 billion valuation peaks, respectively, in 2021. Wall Street analysts are losing confidence as well. Analysts’ average 12-month price targets for Rivian and Lucid fell nearly 20% just this week. Meanwhile, the outlook for EVs broadly just keeps getting worse. Global sales of EVs are estimated to grow 20% this year, to about 16.7 million units, according to BloombergNEF’s most recent analysis. That’s a marked cooling from the 33% jump seen in 2023. Read more: The BYD of Vietnam just reported a huge loss for 2023—a whopping $2.4 billion “Trying to be the ‘next Tesla’ is turning out to be an expensive strategy,” Morgan Stanley analyst Adam Jonas wrote in a note Friday. “As EV startups turn into restructuring stories, whoever finds a sponsor has the best chance.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}