{
    "title": "Former Tesla exec Kelty joins General Motors in newly created role of vice \npresident of batteries",
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/news/former-tesla-exec-kelty-joins-155036978.html",
    "text": "General Motors has hired a former Tesla executive, Kurt Kelty, to serve in the newly created role of vice president of Batteries as the automaker continues to work on its electric vehicle strategy. GM is still seeing strong demand for the EV products it has on sale now. The company expects EV losses to ease this year and hit low-to-mid single digit profit margins in 2025 as it adds more EVs to its lineup. Kelty will be charged with GM’s battery cell strategy and a new end-to-end approach. This will include the use of raw materials, research, developing and investing in new technology, commercialization of cells and packs, and end of life opportunities. “For more than 30 years, I’ve been focused on helping develop and commercialize battery technologies that will aid in the transition to electric transportation. Joining GM creates an even bigger opportunity to help the industry make the switch and have a lasting impact on our planet,” Kelty said in a statement. Kelty will report to GM President Mark Reuss. “The foundation that GM has established coupled with Kurt’s exceptional battery expertise in leading battery chemistry development, establishing partnerships, building out supply chains and partnering closely with teams that have developed leading battery systems will help us achieve our electrification goals and position GM as a leader in EV technology,” Reuss said in a statement on Thursday. Kelty most recently served as vice president at Sila, where he was responsible for sales, business development, battery cell manufacturing partnerships and battery engineering involved in the adoption of Sila’s silicon anode material in electric vehicles requiring high energy density and fast charge. Before that, he led the Tesla battery development team for 11 years. He was a key driver in the creation of Tesla’s first gigafactory, the largest lithium-ion battery and EV component factory in the world. Related Quotes "
}