{
    "title": "Tesla Persists With Price Nudges, Rivian's R2 Teaser, Lucid CEO's Cash \nBonus Raises Eyebrows And More: Bi",
    "date": "2/17/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37193238/tesla-persists-with-price-nudges-rivians-r2-teaser-lucid-ceos-cash-bonus-raises-eyebrows-and-mor",
    "text": "Electric vehicle stocks turned in a mixed performance in the week that ended on Feb. 16 amid the stock market volatility. Tesla, Inc. TSLA advanced for a third straight week, although it still bounced around the bottom, while shares of Rivian Automotive, Inc. RIVN pulled back after a solid run in the previous week. The upcoming week is pivotal as it will feature earnings reports from startups like Rivian. Here are the key events that happened in the EV space during the week: Tesla Model 3 LR Price Hikes, Growing NACS Adoption And More: After a temporary $1,000 price cut for the Model Y Long Range in the U.S. on Feb. 10, Tesla tinkered with prices once again as it raised corresponding Model 3 variant’s prices by $500. An existing Model Y LR inventory vehicle (with the tax credit) is now even more economical compared to the custom-made Model 3 LR, coming in roughly $1,000 cheaper. Stellantis N.V. STLA announced that it would adopt Tesla’s North American Charging Standard. The legacy automaker said it would incorporate Tesla’s NACS plug into select battery electric vehicles in North America starting in 2025. Until then, the company will provide adapters for vehicles equipped with the combined charging system port to utilize Tesla's supercharger network, it said. This week, Swedish labor union IF Metall announced a temporary relaxation of its ongoing strike against Tesla, allowing certain workshops to repair critically damaged Tesla vehicles from Feb. 19 to April 30. The exemption, however, will only apply to independent workshops impacted by the sympathy blockade, not Tesla's own service centers. Rivian R2 Teaser: On Thursday, Irvine, California-based Rivian teased the global launch of its next-gen, low-cost electric-vehicle platform, codenamed R2, which is scheduled to be unveiled next month. The 30-second clip portrays the R2 as a vehicle designed for exploration, with a voice posing the question, \"What's adventure?\" The vehicle’s front is depicted, lit solely by headlights resembling those of the R1, alongside the text “R2” and the launch date. See Also: Best Electric Vehicle Stocks Lucid Price Cuts, CEO Cash Bonus: Luxury EV manufacturer Lucid Group, Inc. LCID, which is struggling to push out its high-end vehicles, reduced the prices of most of its variants and offered $1,000 to customers to buy charging equipment. The base rear-wheel-drive Air Pure variant now has a starting price of $71,400, which includes a $1,500 destination fee, down from its earlier price of $78,900. The all-wheel-drive versions of Lucid Air Touring and Lucid Grand Touring saw prices decline to $79,400 and $111,400, respectively. The price cuts announced this week ranged between 1% and 10%. Separately, Lucid said in a filing with SEC that its board approved a $6 million cash bonus to CEO Peter Rawlinson, which was a reward for the launch of the Lucid Gravity SUV. The company unveiled the vehicle in November, and the car has a starting price of $80,000. Given that the EV maker is still struggling with ramp-up and demand softness, the move drew mixed reactions from investors and industry people, including Tesla CEO Elon Musk. Ford, GM Raise Specter Of Partnerships To Take On Chinese Rivals: While speaking at the Wolfe Research conference, Mary Barra, CEO of General Motors Corp. GM, and Ford Motor Co.’s F Jim Farley separately expressed willingness to form partnerships to counter the threat from their Chinese rivals in overseas markets. “If there’s ways that we can partner with others, especially on technologies that are not consumer-facing, and be more efficient with R&D as well as capital, we’re all in,” Barra said, according to Reuters. Farley also suggested that Ford was open to collaborating with other automakers in order to cut EV battery costs. “If you cannot compete fair and square with the Chinese around the world, then 20% to 30% of your revenue is at risk,” he reportedly said. Chinese EV makers such as BYD Co. Ltd BYDDF BYDDY have been focusing on Europe and other emerging markets to expand their market share. Fisker Quick With Dealer Partnerships: Fisker, Inc. FSR said it has signed a total of four dealer partners in the U.S., as it undertakes a strategic shift in its business model. Those joining the Dealer Partnership program were Mills Automotive Group, Ourisman Fisker, Classic Fisker, and Long Island Fisker, the company said. “I'm excited by the rapid progress of the Dealer Partnership model, which we announced just over a month ago,” Chairman and CEO Henrik Fisker said. Check out more of Benzinga’s Future Of Mobility coverage by following this link. The KraneShares Electric Vehicles and Future Mobility Index ETF KARS ended Friday’s session up 2.07% at $22.15, according to Benzinga Pro data. For the week, the ETF added 3.36%. Read Next: Is Tesla Stock About To Take Off? Fund Manager Cites 2 Factors That May Allay Key Investor Concern EV Stock Performances For Week: Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}