{
    "title": "Tesla Stock Approaches 8-Month Low Amid Scrutiny of Directors' Ties to Musk",
    "date": "2/5/2024",
    "url": "https://www.investopedia.com/tesla-stock-approaches-8-month-low-amid-scrutiny-of-directors-ties-to-musk-8558898",
    "text": " Colin is an Associate Editor focused on tech and financial news. He has more than three years of experience editing, proofreading, and fact-checking content on current financial events and politics. He received his M.A. in journalism from The New School and his B.A. in history and political science from McGill University. Beata Zawrzel / NurPhoto via Getty Images Shares of Tesla Inc. (TSLA) fell Monday morning after The Wall Street Journal on Saturday outlined the blurry personal and professional boundaries between Chief Executive (CEO) Elon Musk and the directors responsible for overseeing his work. “Several current or former directors at Tesla and SpaceX attend parties with him, go on exotic vacations and hang out at Burning Man, the Nevada arts and music festival,” according to the Journal. They also have “amassed shares worth hundreds of millions of dollars from their seats over the years, significantly more than what board members at other companies make for their service.” The report comes just days after a Delaware court struck down Musk’s 2018 compensation package, which was valued at up to $55.8 billion. “The process leading to the approval of Musk’s compensation plan was deeply flawed,” wrote Chancellor Kathaleen McCormick, who cited his professional and personal ties to the directors with whom he negotiated the pay package. In response, Musk said in a post on X (formerly Twitter) that Tesla would hold a shareholder vote on transferring its state of incorporation to Texas from Delaware. The company relocated its corporate headquarters to Austin, Texas, from Palo Alto, California, in 2021 after Musk criticized California’s tax and regulatory environment. Adding to the bad news for Tesla investors Monday, German software giant SAP SE (SAP) will stop purchasing Tesla vehicles for its corporate fleet due to unpredictable deliveries and price swings, according to German newspaper Handelsblatt. It follows German rental company Sixt, which in December dropped Tesla from its fleet because the company’s price cuts on new vehicles were devaluing its used fleet. U.S. rental company Hertz said in January that it would reduce the size of its Tesla and electric vehicle (EV) fleet due to weak demand and price instability. Tesla shares fell almost 4% to $180.80, nearly an eight-month low, in intraday trading at 12:32 p.m. ET Monday. The Wall Street Journal. “The Money and Drugs That Tie Elon Musk to Some Tesla Directors.” Reuters. “SAP Removes Tesla From List of Company Car Suppliers-Handelsblatt.” "
}