{
    "title": "Ford sees ‘ultimate competition’ of Chinese EVs and affordable Tesla models \nas it projects $5.5 billion loss in battery-powered unit",
    "date": "2/7/2024",
    "url": "https://fortune.com/2024/02/07/ford-earnings-electric-vehicles-smaller-cheaper-tesla-china-ultimate-competition/",
    "text": "Ford Motor Co. is working on inexpensive, small electric vehicles to stem its electric vehicle losses and take on Tesla Inc. and Chinese automakers. Chief Executive Officer Jim Farley revealed the plans to analysts Tuesday after the automaker announced adjusted earnings per share of 29 cents, more than double the 13 cents analysts expected on average. Fourth quarter revenue of $46 billion surpassed the $40.3 billion analysts expected. Ford is recalibrating its EV strategy to move away from large, expensive EVs because high prices are the biggest barrier to convincing mainstream car buyers to go electric, Farley said. “We’re also adjusting our capital, switching more focus onto smaller EV products,” Farley told analysts on a conference call. He said Ford “made a bet in silence two years ago” to develop a team to create a low-cost EV platform. The small team is being led by Alan Clarke, executive director of advanced EV development, who came to Ford two years ago after more than 12 years developing models for Tesla. The new EV platform will be the basis of “several types of vehicles,” Farley said, which should generate a profit. Ford’s current battery powered models lost $4.7 billion last year, and projects the losses will grow to as much as $5.5 billion this year. “We are nowhere near our earnings potential,” Farley said. “All of our EV teams are ruthlessly focused on cost and efficiency in our EV products because the ultimate competition is going to be the affordable Tesla and the Chinese” model EVs. As electric vehicle sales slow, Farley is attempting to thread the needle between scaling back the company’s EV spending by $12 billion while dialing up output of traditional internal combustion engine models, which generate profits needed to fund future growth. Play Video For the current year, Ford forecast earnings of $10 billion to $12 billion before interest and taxes, compared with $10.4 billion on that basis in 2023. That result was on the high end of the $10 billion to $10.5 billion the company predicted in November, when it lowered guidance following a six-week strike the by the United Auto Workers union. As part of that initiative to wring out more profits, the carmaker plans $2 billion in cost cuts, targeting areas such as materials, freight and manufacturing operations. Read more: Ford Dumps Automated Parallel Parking Feature to Cut Costs “We expect the stock to trade up” on the better-than-expected quarterly results and bullish full-year guidance, Wells Fargo said in a research note written by analysts led by Colin Langan. Ford shares rose 5.5% at 9:39 a.m. in New York. Through Tuesday’s close, the stock was down 1% on the year. The automaker is giving investors a supplemental dividend of 18 cents a share, in addition to the regular 15-cent quarterly dividend, both payable on March 1 to shareholders of record on Feb. 16. In December, the automaker halved production of electric F-150 Lightning pickups, while boosting output of its highly profitable Bronco sport-utility vehicles and Ranger pickup trucks. Chief Financial Officer John Lawler told analysts the company no longer expects to reach its 8% margin goal on EVs by 2026. Ford’s 2023 EV deficit translated to a loss of roughly $28,000 on each battery powered model it sold, according to an analysis by Bloomberg Intelligence analyst Joel Levington, who noted those losses are “unsustainable.” A bright spot is hybrid gas-electric vehicles, which Ford has pivoted to in response to strong consumer demand. Farley said he expects sales of hybrid models to grow 40% this year, up from last year’s 25% jump in sales of those powertrains. The Dearborn, Michigan-based automaker also faces higher labor costs than its crosstown rival General Motors Co., which wowed Wall Street last week with a 2024 forecast of $12 billion to $14 billion in earnings before interest and taxes. GM has said the contract it struck with the UAW will add about $575 in costs per car, while Ford predicts an increase of up to $900 per vehicle due to the record deal that increases workers’ wages by 33% over four-and-a-half-years. “GM is better set up to absorb those labor costs because they already had a healthier cost base in North America,” David Whiston, an analyst with Morningstar Inc. in Chicago, said in an interview before Ford posted results. “And Ford has more UAW employees in the US than GM.” In its traditional internal combustion engine business, known as Ford Blue, the company earned $813 million before interest and taxes in the fourth quarter, less than the $866.5 million analysts expected. Ford’s US sales rose less than 1% in the fourth quarter as the UAW strike cost it production of high profit models such as the F-Series Super Duty pickup truck and the Explorer SUV. In its commercial business, known as Ford Pro, the automaker earned $1.81 billion before interest and taxes, more than the $1.43 Billion analysts expected. Bloomberg Intelligence predicts Ford Pro will see margins expand this year while its Ford Blue unit will experience margin pressure as pricing drops because dealers have replenished their lots with inventory after pandemic-related shortages. “Ford profit is on a tightrope as the transition to electric vehicles takes longer than expected, requiring right-sizing to cut EV losses while managing increased pricing competition for Ford Blue,” BI analysts Steve Man and Peter Lau wrote in a Feb. 2 note. “Our scenario sees US electric-vehicle sales climbing 9% this year after growing at a compounded annual rate of 65% over the past three years.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}