{
    "title": "Tesla and Mercedes-Benz earn roughly the same. Tesla's worth 7 times more.",
    "date": "2/22/2024",
    "url": "https://www.marketwatch.com/story/tesla-and-mercedes-benz-earned-almost-exactly-the-same-last-year-their-stock-market-valuations-are-slightly-different-44326e85",
    "text": "The numbers are in, and earnings last year from Tesla and Mercedes-Benz were almost identical. The legendary German automobile maker said it earned €14.26 billion ($15.47 billion) in 2023, a decline of 1.7% from last year. Tesla, meanwhile, earned $15 billion, a 19% improvement. What’s different, of course, is valuation. Heading into Thursday, Mercedes \n        MBG,\n        -0.20%\n       was valued at €71 billion, or about $78 billion. Tesla \n        TSLA,\n        +5.76%,\n       meanwhile, is valued at $617 billion, even amid a 22% stock-price decline this year. Mercedes’s stock was climbing on Thursday, thanks to a new stock-buyback plan of up to €3 billion. Granted, analysts are expecting a lot more sales growth out of Tesla. Tesla’s sales are seen rising 81% by 2027, compared with 11% for Mercedes, according to FactSet. Tesla also doesn’t have Mercedes’s problem of what to do with factories for combustion-engine cars, even as the switchover to EVs is taking a lot longer than many imagined. Mercedes-Benz CEO Ola Kaellenius said Thursday that that the German company will be able to produce combustion engines well into the next decade, according to Reuters. The EV company had been in talks with a big carmaker about a potential transaction, but that company has terminated negotiations. Steven Goldstein is based in London and responsible for MarketWatch's coverage of financial markets in Europe, with a particular focus on global macro and commodities. Previously, he was Washington bureau chief, directing MarketWatch's economic, political and regulatory coverage. Follow Steve on Twitter: @MKTWgoldstein. Steven Goldstein is based in London and responsible for MarketWatch's coverage of financial markets in Europe, with a particular focus on global macro and commodities. Previously, he was Washington bureau chief, directing MarketWatch's economic, political and regulatory coverage. Follow Steve on Twitter: @MKTWgoldstein. Visit a quote page and your recently viewed tickers will be displayed here. "
}