{
    "title": "Tesla in India soon? Govt close to finalising tax breaks for foreign EV \nmakers: Report",
    "date": "2/16/2024",
    "url": "https://www.businesstoday.in/technology/news/story/tesla-in-india-soon-govt-close-to-finalising-tax-breaks-for-foreign-ev-makers-report-417772-2024-02-16",
    "text": "Feedback Tesla, the electric car manufacturer led by Elon Musk, may finally enter the Indian market soon. A new report suggests that the Indian government is close to finalising new import duties for global EV makers like Tesla for cars priced beyond Rs 30 lakh. However, the offering of reduced import duties will be for a temporary period, according to a report by ET. The development comes after years of speculations about Tesla's entry into the Indian market. The report, citing sources, claims that the Indian government is working on a policy to offer Tesla a 2-3 year period of lowered import taxes. This would involve a reduction in the currently high import duties imposed on luxury cars, in exchange for Tesla's promise to start manufacturing locally in the future and provide bank guarantees. High import taxes\nIndia's current import tax structure is quite steep, with 100 per cent duties on cars worth more than USD 40,000 (approximately Rs 33 lakh) and 60 per cent on cars below that value. The proposed concession aims to make Tesla's entry feasible and encourage the company's long-term commitment to manufacturing within India. Objective to boost local manufacturing and job creation\nThe Indian government's strategy behind offering these concessions to Tesla and potentially other foreign electric car manufacturers is to incentivize them to build their cars in India. This is expected to boost the local EV market and create significant job opportunities.\n What domestic EV players have to say about it\nDomestic EV players in India are not very keen on the idea of special treatment for international EV makers. In the past, Ola CEO Bhavish Aggarwal has been against the idea of offering incentives to foreign EV manufacturers like Tesla. Mahindra & Mahindra Group has asked the government to maintain a level playing field between the domestic and international EV makers. Also read: EV firm VinFast to make India debut, will set up facility in Tamil Nadu Also read: Bengaluru Man Turns Alto K10 Into Self-Driving Car Using Smartphone Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}