{
    "title": "Takeaway owner loses £12k legal battle with Elon Musk's Tesla over \nrestaurant name",
    "date": "2/14/2024",
    "url": "https://www.mirror.co.uk/news/uk-news/takeaway-owner-loses-12k-legal-32124920",
    "text": "Amanj Ali, owner of Colorado's Chicken in Bury, registered the trademark 'Tesla Chicken and Pizza' before opening a new shop - but has incurred thousands in legal costs and fines A takeaway owner who challenged Tesla has ended up £12,000 poorer after losing a fierce legal fight. Amanj Ali, the boss of Colorado's Chicken in Bury, registered the trademark 'Tesla Chicken and Pizza' with plans to open a new shop. But when Tesla found out he had registered in the UK, the electric car giant launched a bid to protect its brand for food and drinks services. Tesla, owned by Elon Musk, applied to invalidate Mr Ali's trademark, arguing it would take unfair advantage of its reputation. After the UK's Intellectual Property Office (IPO) ruled in Tesla's favour, Mr Ali was slapped with a £4,000 fine as well as more than £8,000 in legal costs. \"It's a lot of money,\" he said. \"I just run a small takeaway. Tesla is owned by the richest man in the world. It's not easy to fight them. It's a small business versus a big business.\" Mr Ali initially applied for his trademark in May 2020 in the hope of opening a new takeaway business in Greater Manchester. He claims he settled upon the name 'Tesla Chicken and Pizza' in homage to the famed inventor Nikola Tesla. \"When I read about him, he was so clever and he invented a lot of things,\" Mr Ali added. \"He [Elon Musk] called his company Tesla because of Nikola Tesla, so did I. It's not a unique word that he's created.\" He registered the trademark but then the pandemic hit and stopped his plans. Then in November 2021, the IPO told Mr Ali someone else wanted the 'Tesla' name too, which turned out to be the car company. \"I thought it was someone else, but my friend Googled the address and it showed Tesla headquarters,\" he said. \"I was surprised Tesla was trying to register a restaurant. I never thought they would come into the restaurant business.\" Tesla's lawyers tried to buy his trademark for £750, reports the Manchester Evening News. Mr Ali's lawyers said he would sell for £750,000. He said: \"I didn't want to fight with Tesla. They made an offer of £750 but I spent more than £2,000 for the solicitor and to register the trademark and for the logo.\" He also said he offered Tesla £3,750 to withdraw their application, but they did not respond. Court documents showed how Tesla's lawyers argued that a tweet sent by Elon Musk in January 2018 made clear his ambitions to start up a restaurant franchise using the company's name. It read: \"Gonna put an old school drive-in, roller skates and rock restaurant at one of the new Tesla Supercharger locations in LA.\" They also suggested that Mr Ali was \"familiar with the trade mark system\" and that posts he had made on social media showed he was aware of Musk's huge $206bn fortune. But following the case, Mr Ali argued that many people were aware of Musk's wealth and questioned whether the tweet had been a legitimate business proposal. Mr Ali fumed: \"If he had a plan to open a restaurant in 2018, why did he not put an application in to protect his trademark?\" Mr Ali said he would have appealed the IPO's ruling but did not want to spend any more money, adding that the two-year long dispute had caused him many a sleepless night. \"The last 18 months have been hard for me,\" he said. \"I work very hard and sometimes I work more than 12 hours a day. I was scared and couldn't sleep at night while this was going on. I could appeal against the decision but why? I just want to let it go and save my money and focus on the business.\" He hopes to open a second branch of Colorado's Chicken, but says Elon Musk is no longer welcome. He said: \"If you asked me 'will you be inviting Elon Musk?'. No, I wouldn't. Hopefully I'm able to open my second branch before he opens his first.\" Tesla has been contacted for comment. Get email updates with the day's biggest stories "
}