{
    "title": null,
    "date": "2/20/2024",
    "url": "https://finance.yahoo.com/news/nvidia-beats-tesla-most-traded-225843803.html?fr=sycsrp_catchall",
    "text": "Nvidia has topped Tesla as the most-traded stock ahead of its earnings this week. Nvidia's earnings report is highly anticipated and results will come out February 21. Shares of the chip-maker have soared 47% in 2024. Nvidia's stock rally just won't quit — and it's now surpassed Tesla as the most traded on the market. In the last 30 trading sessions, traders have moved about $30 billion worth of shares of Nvidia per day, according to a Reuters report citing LSEG data. Tesla, which has led daily stock trading for the last several years, has averaged roughly $22 billion in the same stretch. The Magnificent Seven chip maker is coming off eye-watering gains in 2023, and it's off to a stellar start this year with a 47% year-to-date gain. Tesla stock, for its part, has tumbled about 19.5% year-to-date amid a cloudier outlook for electric vehicle demand, Elon Musk's ultimatums to the board for more control, and reports of partying and drug use among Musk and some board members. Nvidia will report earnings results for the final three months of 2023 after the closing bell on Wednesday. The quarterly results are hugely anticipated by investors, and analysts say surprise in either direction could send the stock whipsawing. Wall Street continues to bet big on the disruptive power of artificial intelligence, and Nvidia's emerged as one of the clear winners of the trend. The chip maker is now the third-most valuable US company, with a $1.8 trillion market capitalization, surpassing the value of Alphabet and Amazon this month. \"Can this momentum continue? The answer is simple. Yes. Yes, it can,\" Freedom Capital Markets strategist Jay Woods wrote in a note Tuesday. \"Here's a fun fact,\" he added. \"Shares were up 47% last year as it went into its first quarterly report. That's the same amount shares are up this year. Granted this was after a major drawdown in 2022, but most people didn't think the run could continue.\" Last week when a regulatory filing revealed Nvidia had a stake in SoundHound AI, meanwhile, shares of the smaller firm surged 55% in a single day as markets took Nvidia's stake as a vote of confidence. The AI euphoria has similarly sent Super Micro Computer stock up more than 900% in the last year.  Read the original article on Business Insider "
}