{
    "title": "Tesla, Plug Power, SoundHound AI: Trending Tickers",
    "date": "3/1/2024",
    "url": "https://finance.yahoo.com/video/tesla-plug-power-soundhound-ai-154739456.html",
    "text": "Tesla (TSLA) is rolling out incentives in its key Chinese market to stave off mounting competition there. It also opened its charging network to Ford (F) vehicles this week as a new revenue stream. Shares of energy company Plug Power (PLUG) fell as fourth-quarter results missed EPS estimates. However, CEO Andy Marsh notes the company aims to return to profitability this year despite current losses. SoundHound AI (SOUN) sees its stock slide after missing revenue expectations. While SoundHound narrowed losses, sales lagged behind analyst forecasts. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith BRAD SMITH: Let's take a look at how things are shaping up right now. Markets, they're mixed after closing out February in the green, notching a fourth straight winning month. NASDAQ hit its first record close in quite some time, continuing the upward momentum this morning here. We're also tracking shares of Tesla, edging lower as the EV maker rolls out new incentives in China, in an attempt to woo customers as competition heats up in the world's largest car market. Tesla also opening up its charging network to Ford this week, a move that could yield $6 billion in additional charging revenue by 2030, according to Autoforecast Solutions. Plus Plug Power shares, they're falling this morning after the alternative energy company posted a wider loss per share than anticipated in 2023. The company did say in its release, its ability to continue as a going concern no longer exists. The CEO Andy Marsh saying that the company is dedicated to boosting its financial profile in the year ahead. And lastly, let's talk a little SoundHound. SoundHound AI, sliding after missing revenue in its fourth quarter, though the company still managed to significantly narrow losses. The company's fall comes after an impressive run on the back of AI enthusiasm. Up more than 300% in the past month, however, down here today by about 15%. Related Quotes "
}