{
    "title": "Tesla rolls out upgraded Model 3 in North American markets",
    "date": "1/10/2024",
    "url": "https://www.foxbusiness.com/technology/tesla-rolls-out-upgraded-model-3-north-american-markets",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Auto expert Mike Caudill argues Elon Musk's design of the Tesla Cybertruck will push potential buyers away on 'Cavuto: Coast to Coast.' Tesla has brought its upgraded Model 3 to North American markets. The latest iteration of the all-electric sedan received upgrades on both the outside and inside, Elon Musk-run Tesla said Tuesday night in an X post. The exterior of the Model 3 now features an \"upgraded exterior styling optimized for max aerodynamics,\" as well as a \"stiffer body & updated suspension tuning,\" according to the electric vehicle maker. TESLA PLANNING TO ROLL OUT UPDATED MODEL Y FROM CHINA PLANT: REPORT Tesla also added \"Stealth Grey\" and \"Ultra Red\" as colors. A Tesla corporate logo hangs on the front of a store in Santa Monica, California, on April 10, 2023. (Gary Hershorn/Getty Images / Getty Images) Inside the car, Tesla incorporated things like ventilated seats, an 8-inch rear touchscreen and 360-degree acoustic glass, the company said. It also made improvements to the sound system and center touchscreen. AMERICANS' HESITATIONS FOR ELECTRIC VEHICLES REVEALED AS DEMAND WANES The Model 3 only features either long-range, all-wheel drive or rear-wheel drive. For the former, the range is an estimated 341 miles. The latter is expected to get 272 miles, according to Tesla’s website. In October, investors asked Tesla about the timeline for the upgraded Model 3 to launch in the U.S. It made its debut in some other markets in 2023, according to reports. A Tesla vehicle is charged at a Tesla supercharging station in Kettleman City, California, on Jan. 25, 2023. (Reuters/Mike Blake / Reuters Photos) Tesla said in early January that its Model 3 and Model Y production for 2023 amounted to over 1.77 million vehicles and its deliveries of those were nearly 1.74 million, figures that represented a significant portion of its annual totals. TESLA BEATS THE ODDS WITH YEAR-END DELIVERIES PUSH The electric vehicle maker put out its latest production and delivery figures in advance of its fourth quarter earnings. Those will come out Jan. 24. Shares of Tesla have posted a more than 97% rise in the past 12 months. Tesla Inc Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}