{
    "title": null,
    "date": "1/9/2024",
    "url": "https://www.proactiveinvestors.com/companies/news/1037907/tesla-lowers-mileage-range-estimates-due-to-new-regulations-requiring-default-driving-settings-1037907.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Andrew is a financial journalist with experience covering public companies in a wide breadth of industries, including tech, medicine, cryptocurrency, mining and retail. In addition to Proactive, he has been published in a Financial Times-owned newsletter covering broker-dealer firms and in the Columbia Misourian newspaper as the lead reporter focused on higher education. He got his start with an internship at Rolling Stone magazine. \r\n Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 13:57 09 Jan 2024 EST Tesla Inc (NASDAQ:TSLA) has reduced its range estimates for a variety of its electric vehicles in response to new US regulations on vehicle testing. The regulations are designed to make sure that listed mileage ranges accurately represent real-world performance. Tesla has had issues with this in the past, with a Reuters investigation last year finding that the company rigged the algorithm behind its dashboard range estimates to give longer range estimates. The investigation also uncovered a secret team at Tesla that suppressed driver complaints and canceled service appointments related to the issue. Tesla dropped the range estimates for its X, S, Y and 3 models, according to reports. For instance, the Model Y now has a listed range of 310 miles on Tesla’s website, down from 330 miles. The most dramatic change was the Model S Plaid, a luxury sport sedan, which had its range estimate lowered from 396 miles to 359 miles, according to a comparison of Tesla’s current site to an archived version. Specifically, the new regulations require tests be conducted in “default” mode, rather than more finely tuned modes that optimize efficiency or power. Tesla models have a feature called “Chill” mode that emphasizes efficiency and range and a “Drag Strip” mode that focuses on acceleration. Shares of Tesla fell 2.4% Tuesday afternoon to $234.66. Sign up to receive alerts and news direct to your inbox Northstar Gold Corp's CEO, Brian Fowler joined Steve Darling from Proactive to announce the commencement of borehole electromagnetic (BHEM) and surface electromagnetic (EM) surveys at the Cam Copper Mine area on the Company’s Miller Copper-Gold Property in Ontario. The Cam Copper Mine is a... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive North America Inc., Proactive Investors LLC. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}