{
    "title": "3 Stocks Riding the Wave of Electric Vehicles",
    "date": "1/26/2024",
    "url": "https://investorplace.com/2024/01/3-stocks-riding-the-wave-of-electric-vehicles/",
    "text": "Countdown to Luke Lango’s “2nd Trillion-Dollar A.I. Trade” The U.S. govt just unlocked an $8 trillion market to move in a new direction. See how it could unleash 6,000% potential upside. These EV stocks will grow bigger and stronger Advertisement Source: Sopotnicki / Shutterstock.com Within a long-term bull market, there can be intermediate corrections. A 30% to 40% decline in stocks before a fresh rally is not uncommon in high-growth industries. The reason is that markets always tend to react on extremes. A good example of my point is electric vehicle (EV) stocks. As the EV sector faces some near-term headwinds, EV stocks have been depressed. In my view, this is a golden opportunity to accumulate for the next five years and potentially beyond. Global electric vehicle adoption still has a long way to go and is being backed by policymakers. To put things into perspective, global EV sales were approximately 14 million units last year. It’s expected that global electric car stock will expand to 350 million vehicles by 2030. By the end of the decade, more than 60% of vehicles sold globally will be EVs. Therefore, there is a big growth opportunity ahead, and it’s a good time to buy some of the best EV stocks. This column discusses three names that can be massive value creators. I believe it’s the negative sentiments for the Chinese markets that have depressed Li Auto (NASDAQ:LI) stock. At a forward price-earnings ratio of 30, the high-growth name is trading at a deep valuation gap. With positive business developments sustaining, it’s a good time to remain invested in LI stock. For the last year, Li reported stellar deliveries growth of 182.2% on a year-on-year (YoY) basis to 376,030 vehicles. Strong deliveries growth will likely sustain in 2024. One reason is the impending mass delivery launch of LI MEGA in March. Further, Li Auto has been aggressively expanding its retail network within China. With greater reach in tier-two cities, there is ample headroom for growth. I also like the fact that Li Auto has a strong balance sheet. As of Q3 2023, the company reported a cash buffer of $12.13 billion. Additionally, Li reported free cash flow of $1.8 billion for the quarter. There is high financial flexibility to invest in innovation and potential international expansion. Tesla (NASDAQ:TSLA) stock slumped after the company announced Q4 numbers. I believe this presents a good opportunity to accumulate the stock over the next few months. With ambitious growth plans, Tesla has a positive long-term growth outlook. The first point to note is that Tesla reported adjusted EBITDA margin of 15.7% in Q4 2023. Margin contracted by 652 basis points YoY. Having said that, Tesla reported operating and free cash flow of $13.3 billion and $4.4 billion respectively. It’s worth noting that Tesla is working towards next-generation vehicles with half the cost compared to Model 3 or Model Y. Going forward, relatively low margins might be the new reality. However, Tesla is positioned to benefit from the perspective of volume growth if low-cost cars are launched for emerging markets. I must add here that the pipeline looks attractive. Cybertruck is in the mass production stage with Tesla Semi in pilot production. Roadster and the next-generation platform are in the pipeline. Therefore, there are multiple reasons to be bullish on growth in the next few years. Panasonic Holdings (OTCMKTS:PCRFY) stock has remained sideways in the last 12 months. I believe a strong breakout on the upside is imminent after the consolidation. At a forward price-earnings ratio of 9, the stock looks undervalued. Further, PCRFY stock also offers an attractive dividend yield of 2.46%. An important point to note is that Panasonic Holdings has ambitious growth plans. The company plans to quadruple EV battery capacity to 200GWh by 2031. This expansion will likely be associated with EBITDA margin expansion. I, therefore, expect healthy cash flow growth from the business through the decade. On the innovation front, Panasonic is targeting a boost in energy density of the 2170 cell. That is likely to translate into a reduction in overall EV cost. At the same time, battery productivity will be enhanced. Expansion coupled with innovation will ensure that Panasonic maintains or potentially increases market share. With these positives, PCRFY is positioned for multibagger returns in the coming years. On the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Faisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector. Consumer Discretionary, Automotive, Electric Vehicles   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/3-stocks-riding-the-wave-of-electric-vehicles/. ©2024 InvestorPlace Media, LLC Stocks to Buy Stocks to Buy Today's Market Stocks to Buy Today's Market Stocks to Buy Crypto & Blockchain Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}