{
    "title": "Is Tesla really an AI or robotics stock?",
    "date": "1/8/2024",
    "url": "https://www.irishtimes.com/your-money/2024/01/08/is-tesla-really-an-ai-or-robotics-stock/",
    "text": "According to Elon Musk Tesla is really “an AI/robotics company”. Tesla shares slipped last week after Chinese company BYD overtook it as the world’s biggest-selling electric vehicle (EV) maker in the fourth quarter of 2023. BYD and other Chinese companies “are set to conquer the world market” with low-cost EVs, said UBS, but Tesla’s $760 billion market capitalisation remains almost 10 times that of BYD. Tesla has many sceptics regarding its elevated valuation, but comparisons with BYD miss the point, says Elon Musk, who tweeted that Tesla “is an AI/robotics company that appears to many to be a car company”. Musk had made the same point just days earlier, responding to Roth Capital’s criticism that Tesla was “egregiously overvalued” compared to Toyota. Roth’s analyst “has the wrong frame of reference”, said Musk, because Tesla is really “an AI/robotics company”. Fanciful? Perhaps. After all, Tesla is invariably described in the financial media as an electric car company, not an AI/robotics company. Indeed, as American financial journalist Herb Greenberg notes in his Substack newsletter, Tesla’s own financial accounts confirm some 95 per cent of its revenue comes from “automotive” sources. Tesla uses the words “automotive” and “automobile” 138 and 49 times, respectively, in its 10-K filing, adds Greenberg – a lot more than “AI” (six) and “robotics” (three). Tesla’s regulatory filings contain various warnings about the competitive and cyclical nature of the global car market, but warnings about AI or robotics are conspicuous by their absence. Tesla bulls might say such snark ignores the fact markets have never valued Tesla as a mere car maker, but as a tech stock of sorts. True – but describing it as an AI/robotics company is pushing it. © 2024 The Irish Times DAC © 2024 The Irish Times DAC "
}