{
    "title": "Tesla's Last-Minute Cancellation Of Pie Orders Resembles A Bar Exam Essay \nQuestion",
    "date": "2/28/2024",
    "url": "https://abovethelaw.com/2024/02/teslas-last-minute-cancellation-of-pie-orders-resembles-a-bar-exam-essay-question/",
    "text": "Subscribe and get breaking news, commentary, and opinions on law firms, lawyers, law schools, lawsuits, judges, and more. Today is the last day of the February bar exam. But a recent business snafu involving Tesla might be an interesting way for test takers to apply what they studied so far. Last week, a story about Tesla cancelling a large order of mini-pies just before delivery went viral. A Tesla employee in San Jose made an order with a small business for 2,000 mini-pies to be delivered on what the business considered short notice. The owner quoted a fee, and the Tesla representative approved. But the owner didn’t get payment for the order. When she contacted Tesla about it, the representative apologized and said that it was because their vendor is new. The representative then asked if they could double the order. The owner agreed. She then purchased additional ingredients and turned down other orders to accommodate the new, larger order. Later, the Tesla representative contacted the owner to cancel the order. Apparently, it turned out that the employee had no authority to promise any payments. The order was billed at $16,000. But because of the cancellation, the owner lost more than $2,000 for expenses. Thankfully, the media published her plight and the people in the community came to support the business. The owner said that business has tripled since that incident. In addition, Elon Musk tweeted that he would make things right with the owner and Tesla gave her a check for $2,000. But suppose Tesla did nothing and the business owner is contemplating suing Tesla. What would happen? Under these facts, was there a contract between Tesla and the business? There does not need to be a formal written document signed by both parties to have a binding contract. The text message exchange between Tesla and the business owner seems to show that there was an offer and acceptance with adequate consideration. But does the representative have the authority to enter into a contract on behalf of Tesla? It is unclear what position this representative held at Tesla. Under California law, an employee of Tesla can have authority to enter into a contract in two situations. First, they either have the express or implied authority to do so. Or if Tesla’s actions give third parties the impression that an employee has authority to enter into a contract. This will be a matter of contention if litigated. Assuming there is a contract, the next issue is whether Tesla breached that contract. Tesla canceled the order just before the pies were to be sent out. As a result of this anticipatory breach, the business lost $16,000 in revenue due to turning customers away and spending on expenses. But the business owner must take steps to mitigate damages. When she posted her story online, it went viral and as a result business has tripled. So it is safe to assume that damages will be mitigated over time. So even though Tesla’s employees stiffed a small business at the last minute, resulting in the business owner losing $2,000 out of pocket, it would not be a slam-dunk case if it were to be litigated. As a practical matter, a lawyer is not likely to take this case due to the amount at issue unless he or she has a personal crusade against Tesla and Musk. Probably the most efficient way to litigate this would be to go to small claims court where it would be litigated a lot faster and without lawyers. Since California’s small claims court limit is $12,500, the plaintiff would probably do better there as opposed to superior court where attorneys fees can eat up the award. But the best way to avoid litigation is to not put yourself in a position to have to do it. The small business should have taken a deposit up front and not start work until the money is in the bank. Cancelling orders is not uncommon and in most cases, there are justifiable and understandable reasons for doing so. Even if you deal with trustworthy people, you should at least get a deposit to cover costs. As for Tesla, they will need to make sure that the person making orders also has authority to issue payments to vendors. Thankfully, this business owner got lucky thanks to media exposure and a significant number of the population hating Musk. But others will not be as lucky and will end up learning a business lesson the hard and expensive way. Steven Chung is a tax attorney in Los Angeles, California. He helps people with basic tax planning and resolve tax disputes. He is also sympathetic to people with large student loans. He can be reached via email at stevenchungatl@gmail.com. Or you can connect with him on Twitter (@stevenchung) and connect with him on LinkedIn. Bar Exams, Elon Musk, Law Schools, Pie, Steven Chung, Tesla We will never sell or share your information without your consent. See our privacy policy. Trump-Appointed Justice Isn’t Buying Trump-Appointed Lawyer’s Arguments: That’s rough, buddy. And Here’s Where I’d Put My Meaningful Action, If I Had Any!: Biglaw’s pro-DEI sentiments need some action behind them. Guess Who Is Taking A Bite Out Of Apple?: Pretty big firm. Like, really big. Goodbye, Property!: Which loss will hurt Donny Boy the most? You decide! Always Hard To Say Goodbye: Another Biglaw firm calls it quits on China. Our Sites © 2024 Breaking Media, Inc. All rights reserved. Registration or use of this site constitutes acceptance of our Terms of Service and Privacy Policy.  Friend's Email Address Your Name Your Email Address Comments Send Email "
}