{
    "title": "Elon Musk Is Moving SpaceX to Texas After Spat With Delaware Judge",
    "date": "2/15/2024",
    "url": "https://gizmodo.com/elon-musk-spacex-moves-state-of-incorporation-texas-1851260354",
    "text": "SpaceX CEO Elon Musk is so done with Delaware, packing up his business incorporations from the mid-Atlantic state  after a judge came for his paycheck. Musk’s rocket company has filed to move its incorporation location from Delaware to Texas, according to a Wednesday filing to the Texas Secretary of State. “If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible,” Musk wrote on X. The move comes shortly after a Delaware state judge ruled in favor of a Tesla shareholder who had filed a lawsuit in 2018 challenging the terms of Musk’s pay. As a result, Musk’s $55.8 billion pay package at Tesla remains in jeopardy, risking his position as the richest person in the world. Musk is expected to appeal against the ruling. Delaware is a highly desirable place for businesses, with more than 60% of Fortune 500 companies incorporated in the state due to its favorable tax laws. Musk, however, is ready to give that up. Prior to the SpaceX relocation filing, the billionaire had already filed to move his other company, Neuralink, to Nevada, Bloomberg reported. It might be a little bit more tricky to relocate Tesla out of Delaware, however, since it is a public company unlike Neuralink and SpaceX. SpaceX already has friends in Texas. The company’s spaceport, Starbase, is located in Boca Chica and SpaceX is reportedly building a $100 million office and industrial factory in Brownsville. SpaceX is also in the middle of a controversial land swap deal in Texas that was publicly endorsed by Texas Parks and Wildlife Chairman Jeffery Hildebrand. It’s clear that the red state can’t get enough of Musk. Want to know more about Elon Musk’s space venture? Check out our full coverage of SpaceX’s Starship megarocket and the SpaceX Starlink internet satellite megaconstellation. And for more spaceflight in your life, follow us on X (formerly Twitter) and bookmark Gizmodo’s dedicated Spaceflight page. "
}