{
    "title": "Analyst has a hot take on why Elon Musk really bought Twitter",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/news/analyst-hot-why-elon-musk-191158626.html",
    "text": "When Tesla CEO Elon Musk finalized his purchase of Twitter in Oct. 2022, many wondered why he chose to buy it — the famed social media website was losing millions, with many of its original users having already taken off for TikTok before his takeover. Musk expressed more than once that he intended to use Twitter to create X, an ambitious project he had previously called his \"everything app\". He changed Twitter's name to X in July 2023, effectively killing a 17-year-old brand which led to bigger declines in overall traffic. Related: Elon Musk's most ambitious project just made a major breakthrough After the news broke that Twitter's valuation had fallen to $19 billion (less than half of the $44 billion he paid for it) Musk's move seemed more confusing than ever. However, one Tesla bull has a theory about what's behind Musk's moves. And while it's a bold one, it certainly gives a new perspective on the billionaire's line of thinking. On Feb. 22, analyst Gene Munster shared his thoughts about where Musk is steering X, saying, \"It's getting more clear. @elonmusk is 80% genius, 20% master of good luck.\" It’s getting more clear. @elonmusk is 80% genius, 20% master of good luck.In a decade, his purchase of Twitter will power #XAI to rival $TSLA and #SpaceX as his greatest source of wealth creation.The reason is Twitter’s data is powerful (best source of real time intention),… — Gene Munster (@munster_gene) February 22, 2024 Munster went on to say that xAI (originally called Grok when Musk introduced it in Nov. 2023) will eventually grow to be Musk's greatest source of wealth creation, growing to rival Tesla and SpaceX. Munster cites Twitter's data as the \"best source of real time intention\" and says he believes Musk will use it to train xAI to be a \"top three Foundation Model\" (foundation models are what power ChatGPT). Michael Owens/Getty Images In January, Musk was reported to be involved in talks about raising $6 billion in funding for xAI. Despite voicing his reservations about AI in an open letter, Musk continues to press forward with his own project, which he says will be a safer AI system that is both \"curious\" and \"truth-seeking\" — a claim AI experts don't exactly agree with. \"It’s getting more clear. @elonmusk is 80% genius, 20% master of good luck.\" - Do you agree with @munster_gene's latest hot take on X? Full story: https://t.co/JLYVXPizqF — TheStreet (@TheStreet) February 22, 2024 Related: Tech News Now: Nvidia delivers 'game-changing moment,' Google launches Gemma, and more Related Quotes "
}