{
    "title": "Tesla And BYD Had 35% Of The Global EV Market In 2023",
    "date": "2/10/2024",
    "url": "https://insideevs.com/news/707935/world-top-ev-oem-sales-2023q4/",
    "text": "More than 13.6 million plug-in electric cars were sold in 2023, accounting for about 16% of total car sales globally. Today, we will take a look at the largest manufacturers (automotive groups or OEMs) of rechargeable cars. According to EV-Volumes data, shared by researcher Jose Pontes, five OEMs continue to be responsible for more than half of all plug-in car sales. 2023 Plug-in car sales results In 2023, almost 13.7 million new plug-in electric cars were registered globally. Out of that, almost 9.5 million were all-electric (11% of all cars). First, we will check out the volume and share of the top OEMs in the overall plug-in market and then in the battery-electric segment. The sales results of particular brands and models for December and 2023 can be found here. The plug-in category combines battery electric cars (BEV) and plug-in hybrid cars (PHEV). The top five in 2023 include BYD Group, Tesla, Volkswagen Group, Geely-Volvo, and SAIC. Those five groups account for over 7.5 million rechargeable car registrations (up 41% year-over-year), increasing their share in the segment to 55% (from 52.8% in 2022). This leaves over 6.1 million (up 29%) and a 45% share for the rest of the industry. BYD remains the largest group with over 3 million units registered and a 22% share (up from 18.4% in 2022). Tesla maintains its second-place position (offering only all-electric cars), with more than 1.8 million units sold and a 13.2% share (up from 13.0% in 2022). BYD and Tesla together represent 35.2% of the total plug-in market (up from 31.4% a year ago). The third largest OEM—Volkswagen Group—noted 994,403 new plug-in car registrations, while its market share decreased to 7.3% (from 8.2% in 2022). In 2023, Geely-Volvo replaced SAIC as the fourth top OEM in the plug-in car segment, expanding its share to 6.8% (925,111 units). SAIC's share decreased to 5.8%. Other OEMs are below five percent share: Stellantis (4.2%, down from 4.7% in 2022), BMW Group (4.1%), GAC (3.8%), and Hyundai Motor Group (3.7%, down from 4.6% in 2022). Plug-in car registrations in Q1-Q4 2023 (vs. previous year): Top 5 total: 7,531,757 and 55% shareOthers: 6,157,534 and 45% shareTotal: 13,689,291 In terms of all-electric car registrations, the BEV-focused Tesla is the top manufacturer (no change here). The company noted over 1.8 million registrations, 19.1% of the BEV segment (compared to 18.2% in 2022). It means that Tesla was growing faster than the BEV industry on average. BYD, which is second best, noted 1,570,388 units and a 16.5% share in the BEV segment (up from 12.6% in 2022). Here we can see a huge growth, which potentially—if continued—might put BYD as the #1 in 2024, ahead of Tesla. It already happened in the fourth quarter of 2023. Tesla and BYD combined are responsible for 35.6% of all BEV registrations, compared to 30.8% in 2022. The third-best OEM in 2023 is SAIC (incl. SAIC-GM-Wuling) with 748,159 units and a 7.9% share (down from 9.3% in 2022). The Chinese group once again ended ahead of the Volkswagen Group, which this time was much closer at 742,703 and 7.8% share (down from 7.9% in 2022). Geely-Volvo was fifth with 589,932 units and 6.2% share (compared to 5.3% in 2022). Overall, the top five were responsible for 57.5% of all BEV sales (compared to 53.3% in 2022). It means that the biggest OEMs are becoming even bigger in the all-electric car segment. The first outside of the top five is GAC (5.3% share, up from 4.0% in 2022). All-electric car registrations in Q1-Q4 2023 (vs. previous year): Top 5 total: 5,459,834 and 57.5% shareOthers: 4,033,206 and 42.5% shareTotal: 9,493,040 More sales reports Source: Jose Pontes (EV Volumes data) - CleanTechnica Trending Find a vehicle latest articles latest articles About this article "
}