{
    "title": "Drumroll signals a chunk out of Musk's Tesla pay",
    "date": "2/5/2024",
    "url": "https://www.leaprate.com/forex/market-news/drumroll-signals-a-chunk-out-of-musks-tesla-pay/",
    "text": "Home › News › Forex › Market News › Drumroll signals a chunk out of Musk’s Tesla pay According to a Delaware court ruling, Elon Musk, co-founder and CEO of Tesla, Inc. (TSLA), has to forgo $56bn of his Tesla stock benefits from a long-term compensation agreement. This comes after Richard Tornetta, a former heavy-metal drummer, challenged the tycoon’s pay package in 2018. At that time, Tornetta held only nine Tesla shares. This development puts Tesla on the back foot as the payment scheme was tailored to ensure Musk’s commitment to the company, despite his SpaceX and X ventures. In 2018, when this package was tabled, many regarded it as far-fetched. After the court decision, Musk took to his social media platform, X, and commented: Never incorporate your company in the state of Delaware. According to the Financial Times, the package contained 16 categories around profits, revenues and market capitalisation value. It gave Musk an estimated 10% stake in Tesla. Should he achieve 12 of these 16 targets, his vested shares would exceed $50bn. Tornetta sued Musk in 2018, contesting that this pay package was not fair to him and other Tesla shareholders. Musk launched a tirade of defamation and other accusations against the plaintiff when he filed. Don’t miss out the latest news, subscribe to LeapRate’s newsletter Tornetta’s case eventually went to trial in 2022. Judge Kathaleen McCormick ruled that the Tesla executives were “perhaps starry eyed” and focused on Musk’s “superstar appeal” when developing this elaborate compensation scheme. Reportedly, Tornetta seems more interested in audio customisations for cars than tackling corporate excess. Online speculations followed the Tornetta case and many questioned his motives. However, he had his day in court and the judge recognised the validity of his concerns. With over a decade’s experience as a finance writer, Elizabeth Anderson applies her knowledge and experience to keep a finger on the pulse of global trends. Specialising in forex, cryptocurrencies, and stocks, Elizabeth follows the movements that impact the world of trading. LeapRate is an independent research and advisory firm, specialized in covering\n\t\t\t\t\t\t\tthe world of Forex trading.\n\t\t\t\t\t\t\tWe are followed by hundreds of thousands of traders, investors and other\n\t\t\t\t\t\t\tFX industry participants via our website, Facebook, Twitter, LinkedIn,\n\t\t\t\t\t\t\tRSS and Email Newsletter.\n\t\t\t\t\t\t\tCopyright © All rights reserved Finaffiliates Limited Website:\n\t\t\t\t\t\t\thttps://finaffiliates.com\n\t\t\t\t\t\t\tCEO: Jason Hopgood\n\t\t\t\t\t\t\tCompany number: 14540579\n\t\t\t\t\t\t\tVAT identification number: GB 431522433\nLocation: Finaffiliates Limited, Lawrence House, 5 St. Andrews Hill, Norwich NR2 1AD, United Kingdom\nEmail: [email protected] Foreign exchange trading comes with high level of risk.\n\t\t\t\t\t\tBefore investing in foreign exchange, carefully consider\n\t\t\t\t\t\tyour level of experience and risk appetite.\n\t\t\t\t\t\tCFDs are complex instruments and bring high risk of\n\t\t\t\t\t\tlosing money because of the leverage they provide.\n\t\t\t\t\t\tNo information or opinion contained on this site should\n\t\t\t\t\t\tbe taken as investment advice, personal recommendation,\n\t\t\t\t\t\tor an offer of, or solicitation to buy or sell, any financial\n\t\t\t\t\t\tinstruments.\n\t\t\t\t\t\tPast performance should not be considered evidence or guarantee\n\t\t\t\t\t\tfor future performance.\n\t\t\t\t\t\tBetween 74 and 89% of retail investors accounts lose money. © 2024 Copyright LeapRate\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\tTerms of Use "
}