{
    "title": "Larry Ellison invited Elon Musk to Hawaii to 'dry out' from drugs: WSJ",
    "date": "2/3/2024",
    "url": "https://www.businessinsider.com/larry-ellison-elon-musk-hawaii-dry-out-drugs-report-2024-2",
    "text": "       Elon Musk's drug use so worried his business associates and company board members that they asked him to go to rehab and even take a break from working to \"dry out\" from various substances, including LSD, cocaine, ecstasy, and ketamine, a new report from The Wall Street Journal said. Larry Ellison, Musk's close friend, a former Tesla director, and the billionaire cofounder of Oracle, went so far as to urge Musk to travel to Hawaii during winter 2022 to pause his work and avoid drugs, the outlet reported, citing people familiar with the offer. Ellison's proposal came amid increasing concerns among Musk's friends and associates that Musk's drug use was getting worse, some of those people told the Journal. Related stories At a party in the Hollywood Hills neighborhood of Los Angeles around the time of Ellison's suggestion, the report added, one person who attended the event said Musk drank ecstasy in \"liquid form\" from a water bottle after having his personal security clear the floor for privacy. The Journal reported the \"volume\" of Musk's drug use had contributed to a culture of peer pressure among Musk's friends and board directors of his various companies that created an \"expectation\" for them to use drugs alongside him to maintain the social status gained by being close to the billionaire. Musk, Ellison, and their lawyers Alex Spiro and Christopher Muzzi did not immediately respond to requests for comment from Business Insider. The Journal previously reported Musk, who is reportedly one of several executives in Silicon Valley to try his hand at psychedelics such as ketamine, had also indulged in LSD, cocaine, ecstasy, and \"magic\" mushrooms. Despite proclaiming that he doesn't \"like doing illegal drugs,\" Musk's drug use has previously put him and his companies on notice. After he smoked marijuana on an episode of \"The Joe Rogan Experience\" podcast, NASA made SpaceX pledge in writing that the company was following federal guidelines on drug use in the workplace. The company spent $5 million in taxpayer money to properly train its employees on the rules, the Journal reported. The billionaire also said on X that he had a prescription for ketamine, which research has suggested can be used to treat depression. Experts previously told BI that the combination of hard drugs Musk is said to have used came with several health risks, especially at his age of 52. Those include irregular heartbeat and incontinence, as well as psychosis if the user has bipolar disorder. In 2017, CNBC reported Musk suggested to his Twitter followers that he had the disorder. Read next Jump to "
}