{
    "title": "LG Energy Solution recaptured the 400000 won level in more than a month \nthanks to Tesla's rise. .. - MK",
    "date": "2/16/2024",
    "url": "https://www.mk.co.kr/en/stock/10944255",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share  LG Energy Solution recaptured the 400,000 won level in more than a month thanks to Tesla's rise. According to the Korea Exchange on the 16th, LG Energy Solution was trading at 408,500 won as of 11:43 a.m., up 3.29% from the previous day. LG Energy Solution's stock price has been maintained in the 300,000 won range since closing at 400,000 won on the 16th of last month, but it has been strong again on the same day. LG Energy Solution's strong performance seems to have been attributed to Tesla's rise, which showed a sharp rise in the New York Stock Exchange over the long night, as a warm welcome to secondary battery-related stocks. Tesla closed at $200.45 on the 15th (local time), up 6.22% from the previous trading day. The previous day, LG Energy Solution also announced that it will mass-produce next-generation 4680 cylindrical batteries (46mm in diameter and 80mm in length) as early as August. Kim Dong-myung, president of LG Energy Solution, said the previous day, \"We will start mass production in the second half of the year in Korea,\" and added, \"We are considering various ways to mass-produce it at factories in Nanjing, China.\" LG Energy Solution has built a 4680 battery production line at Ochang Energy Plant and has been preparing for mass production. In addition, President Kim predicted that the mass production time of mid- to low-priced lithium iron phosphate (LFP) batteries will be around the second half of 2025. 2024-03-25 13:53:34 2024-03-26 06:15:52 2024-03-24 15:26:58 2024-03-25 08:57:22 2024-03-24 14:09:45 2024-03-25 17:22:19 2024-03-26 09:40:53 2024-03-25 14:47:31 2024-03-26 06:07:05 2024-03-25 20:31:33 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}