{
    "title": null,
    "date": "2/12/2024",
    "url": "https://www.thecooldown.com/green-business/byd-tesla-china-ev-manufacturer-sales/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. But Musk isn't sweating the competition. Photo Credit: Getty Images Elon Musk surprised some in a recent earnings call when he praised his electric vehicle competitors. Not his domestic competitors in the United States but EV manufacturers in China. \"Our observation is generally that the Chinese car companies are the most competitive car companies in the world. So, I think they will have significant success outside of China depending on what kind of tariffs or trade barriers are established,\" Musk said. \"Frankly, I think if there are no trade barriers established, they will pretty much demolish most other companies in the world. So, they're extremely good.\" Tesla does all right in China, but in October 2023, it came in fifth in sales among fully electric vehicles with the Model Y. The top four spots belonged to Chinese companies, with the top three spots going to BYD. While Tesla has enjoyed being the world's largest EV manufacturer for years and held the top spot in global sales, that may be changing. In sales numbers for the third quarter in 2023, BYD finally closed the gap after years of being a close second and matched Tesla with 17% of global sales, as a Counterpoint market research report showed. In Q4, BYD surpassed Tesla in global sales. Tesla, however, did outsell BYD for the year. Musk has good reason for his belief in the future of EV manufacturing in China, as the industry apparently has the full support of the Chinese government. According to CNN Business, China already reached its first goal, which was having at least 20% of new cars sold be new energy vehicles, which includes battery electric vehicles, plug-in hybrids, and hydrogen fuel cell vehicles. The Chinese government is looking for NEVs to become the norm when it comes to car sales by 2035. This is good news, as China is responsible for the most heat-trapping air pollution released annually into the Earth's atmosphere by far, dwarfing the second-worst annual polluter, the U.S., which contributes less than half of what China does on a yearly basis, according to Center for Climate and Energy Solutions data. But Musk isn't sweating the competition. In fact, he said that he's willing to help other manufacturers. \"We're obviously happy to give any electric car company access to our Supercharger Network,\" Musk said. \"We're also happy to license full self-driving, perhaps license other technologies, and anything that could be helpful in advancing the sustainable energy revolution.\" Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}