{
    "title": null,
    "date": "2/20/2024",
    "url": "https://inc42.com/buzz/upcoming-general-elections-to-slow-down-talks-for-teslas-india-entry/",
    "text": "Tesla’s plans for entry in India may see a slight delay due to the general elections scheduled for later this year However, the halt in talks will be temporary and the discussions will resume post the culmination of the elections Tesla has been in talks with the Centre as well as states to enter the Indian EV market and set up a manufacturing unit The ongoing talks between the Indian government and Tesla for the entry of the Elon Musk-led electric vehicle (EV) company in the country are reportedly likely to slow down due to the upcoming general elections. While the Election Commission of India (ECI) is yet to release the schedule for the Lok Sabha polls, the elections are expected to take place in April-May this year. The halt in talks is temporary and the discussions will resume post the culmination of the elections, a senior government official told MoneyControl. “The talks on Tesla’s entry into India are likely to happen after the elections, as electorally it may create controversies,” the official said. The development comes fresh nearly a month after it was reported that Tesla is open to committing nearly $30 Bn in direct and indirect investments in India over the course of the next five years. With the investment, the company is looking to set up a local factory in the country. The company is confident of its ability to set up the factory within three years of entry and roll out its first indigenously assembled car by 2026. The company will be making an investment of $2 Bn in India for setting up the factory. The capital infusion depends on the government’s decision to approve concessional duty of 15% on its imported vehicles during the first two years. However, the government earlier denied any plans to offer tax relaxation to a specific company. With adoption of EVs on the rise in the country, many global automakers, besides Tesla, are eyeing the Indian market. From Taiwanese tech giant Acer licensing its brand to mobility startup eBikeGo in India to VinFast signing an MoU with the Tamil Nadu government to set up a plant in the state, a host of companies have made a beeline for India. In addition, giants such as Audi, BMW and Mercedes-Benz have also launched a slew of EV offerings to tap into the burgeoning Indian EV ecosystem and cater to the growing demand. Not just this, two-wheeler EV startup Ola Electric filed its IPO papers with SEBI and is looking at a potential 2024 public listing. At the heart of this India push is the country’s burgeoning EV market, which is projected to balloon to a size of $110 Bn by 2029, as per a report. Become a Startup Insider in 2024 with Inc42 Plus. Join our exclusive community of 10,000+ founders, investors & operators and stay ahead in India’s startup & business economy. Unleash your potential by exploring unlimited articles, trackers, and playbooks. Identify the\nhottest startup deals, supercharge your innovation projects, and stay updated with expert\ncuration. Empower yourself with comprehensive playbooks, expert analysis, and invaluable insights. Learn\nto validate ideas, acquire customers, secure funding, and navigate the journey to startup\nsuccess. Access 75+ in-depth reports on frontier industries. Gain exclusive market intelligence,\nunderstand market landscapes, and decode emerging trends to make informed decisions. Stay ahead with startup and funding trackers. Analyse investment strategies, profile successful\ninvestors, and keep track of upcoming funds, accelerators, and more. Join a community of 10,000+ leaders & operators – unlock unlimited access to Inc42 stories,\nvideos, deals, member-only perks, and more. Unlock unlimited access to 500+ monthly new stories and Inc42’s complete archive of\n40,000+ stories. Unlock unlimited access to 500+ monthly new stories and Inc42’s complete archive of\n40,000+ stories. Over $250,000 worth deals on software & tools to help your business scale up. Network with industry leaders & operators with exclusive invites to Inc42’s\nmember-only virtual events Enjoy an ad-free and clutter-free\nexperience as a member, focus on\nwhat really matters to you Your contribution will go on to\nsupport and empower our unbiased\n& data-driven journalism Join 1000's of entrepreneurs, business leaders & makers and stay ahead with our sharp,\nincisive & data-driven analysis on India’s tech and startup economy! "
}