{
    "title": "Tesla fighting back against Oklahoma bills that could force gallery closures",
    "date": "2/21/2024",
    "url": "https://driveteslacanada.ca/news/tesla-fighting-back-against-oklahoma-bills-that-could-force-gallery-closures/",
    "text": "Tesla is mobilizing support against legislative efforts that threatens how the company operates in Oklahoma. While Tesla is still not allowed to sell directly to consumers in Oklahoma, two bills, Senate Bill (SB) 2022 and House Bill (HB) 3104,  could take it one step further, forcing the automaker to close its gallery locations in the state. Tesla’s sales model, which bypasses traditional dealership networks in favor of direct sales to customers, has long been a point of contention in numerous states. The current legislative framework in Oklahoma requires Tesla to operate galleries instead of full-fledged stores, limiting direct sales and focusing on providing educational and informational activities about Tesla’s products. The new bills however are seeking to take it even further, potentially banning these informational activities and jeopardizing Tesla’s ability to operate in the state altogether. At the heart of the bills is changing the definition of a salesperson to include repair technicians, thereby transforming repair shops into dealerships. Consequently, these shops must adhere to the regulatory requirements, including paying filing fees to secure an auto dealer license. And since Tesla is not a dealer, the company believes they would be forced to close their gallery locations in Tulsa and Oklahoma City. The authors of the two bills, State Rep. Mike Dobrinski and Sen. Roger Thompson, argue that the legislation aims to offer protections for dealers against auto manufacturers, without specifically targeting Tesla.  “This was in no way intended to be about Tesla,” state Rep. Mike Dobrinski told KOCO. Tesla however disagrees, and in response, has emailed owners in the state and added a new page to their ‘Engage Tesla’ site, asking people to contact Oklahoma lawmakers and express their opposition to the bills, which Tesla says will put jobs at risk. Companion bills SB 2022 and HB 3104, detrimental bills that could jeopardize Tesla’s ability to continue to operate galleries in Oklahoma, are currently being considered by the State Legislature. If passed, these bills could put Tesla locations and Oklahoma jobs at risks. This proposal would ban educational and informational activities about Tesla and its products. If you want to voice your support for Tesla, visit Engage Tesla and click on ‘Contact Legislators.’ Tesla finally launches new Tire Repair Kit Tesla Defends Giga Berlin Expansion Plans, Explains Benefits Founder and Editor-in-chief of Drive Tesla Canada | Darryn@DriveTeslaCanada.ca Have a Tesla tip? Email tips@driveteslacanada.ca, or DM us on Twitter @DriveTeslaca Rumours of Tesla’s plans to establish a factory in India have once again have resurfaced. Local media outlets have reported that talks between Tesla and the Indian government to build a Gigafactory, which had previously […] A senior Indian government official ruled out any possibility of granting Tesla company-specific incentives. This statement comes a day after Elon Musk tweeted out about India’s high import duties on Tesla vehicles and the possibility […] Many people are just getting Tesla’s 2019.36.2.4 software update today (like us). Just when you feel like you’re catching up to the latest version, which was until today 2019.40.1.1, the next version has already started […] Enter your email address to subscribe to Drive Tesla and receive notifications of new articles by email. Email Address Subscribe "
}