{
    "title": "Tesla Q4 earnings preview",
    "date": "1/15/2024",
    "url": "https://www.cmcmarkets.com/en-gb/news-and-analysis/tesla-earnings",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 67% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets, CFDs, OTC options or any of our other products work and whether you can afford to take the high risk of losing your money. Zhujun Li Market Analyst 15 Jan 2024,                             \n                                00:00      Tesla's share price jumped by 102% in 2023, primarily due to a price reduction at the beginning of the year, leading to a significant surge in deliveries in the first two quarters, with 440,808 and 479,700 vehicles delivered, respectively. However, in the third quarter, deliveries declined to 430,488 due to factory upgrades. Tesla's revenue for the last quarter was US$23.35 billion, showing a modest year-over-year growth of 8.8%. The adjusted EPS was $0.66, reflecting a 37% decrease compared to the previous year. The gross profit margin remained at 17.9%, staying below 20% for the third consecutive quarter. Due to the underwhelming performance in Q3, Tesla's stock price briefly dropped below $200 in late October. However, driven by expectations of a Federal Reserve interest rate cut, the stock has been steadily rebounding since November, recovering all the losses incurred after the Q3 financial report. In Q4, Tesla has exceeded Wall Street expectations regarding deliveries, producing 494,989 vehicles and delivering 484,507. Notably, Model 3/Y contributed 461,538 units. Despite achieving a record annual delivery of 1.81 million vehicles in 2023, surpassing the 1.8 million target, they fell short of Elon Musk's 2 million goal. As such, the market response has been muted. Tesla's stock experienced a 4.42% decline in the first week of January. Investors will likely closely watch the fourth-quarter gross profit margin performance, especially considering Tesla's four consecutive price hikes in November for vehicles sold in China. These were driven by profit concerns and increased competition from other electric vehicle manufacturers. The price adjustments might be aimed at leveraging the \"buy high, sell low\" psychology of investors to stimulate sales. However, Tesla also reduced prices for inventory vehicles sold in the US and Canada in the last quarter of 2023, likely to counteract the impact of high interest rates on consumer sentiment, indicating a potential further decline in gross profit margin in Q4. Looking ahead to 2024, the era of subsidies for new energy vehicles is ending. Germany's subsidy programme for electric cars concluded on 18 December 2023, and France tightened subsidies, limiting them to a maximum of €7,000 for electric cars manufactured in Europe as of 15 December 2023. The subsidy policy decline in European and American countries and low demand caused by high-interest rates may compel Tesla to sustain its low-price strategy. Profit margins may be challenging to improve significantly, and economic downturn expectations might impact sales. While Tesla may maintain its market share through a low-price strategy, Elon Musk acknowledged significant production challenges for the newly-released Cybertruck. In the Chinese market, several local manufacturers continued price reduction activities in 2024, indicating an ongoing price war. With new entrants like Xiaomi, competition is expected to intensify. Tesla's main competitor, BYD, surpassed Tesla for the first time in Q4, becoming the global leader, selling 526 409 electric vehicles in the quarter and achieving total annual sales of 3.024 million electric vehicles. Release date: After-market in US on 24 January 2024 / 25 January 2024 Asia-Pacific EPS: $0.74 Quarterly revenue: $242.1 billion, a 0.4% year-over-year decrease Data source: Earnings Whispers Learn about the four trading principles of preparation, psychology, strategy, and intuition, and gain key trading insights from some of the world's top investors. Disclaimer: CMC Markets is an execution-only service provider. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. Pricing is indicative. Past performance is not a reliable indicator of future results. Client sentiment is provided by CMC Markets for general information only, is historical in nature and is not intended to provide any form of trading or investment advice - it must not form the basis of your trading or investment decisions. Latest from CMC The Week Ahead: RBA rate meeting; China CPI; BP, Disney results Read our preview of major economic and company events in the week commencing 5 February 2024, and view our earnings calendar. Michael Hewson - 02 Feb 2024 Navigating market volatilities in February The Week Ahead: Fed, BoE rate meetings; US jobs; Microsoft, Apple, Meta, BT results The Week Ahead: ECB rate meeting; US Q4 GDP; Netflix, Tesla results Related articles Weekly outlook The Week Ahead: RBA rate meeting; China CPI; BP, Disney results Read our preview of major economic and company events in the week commencing 5 February 2024, and view our earnings calendar. Michael Hewson - 02 Feb 2024 Market outlook Navigating market volatilities in February Navigating market volatilities on Wall Street, ASX and China Tina Teng - 02 Feb 2024 Weekly outlook The Week Ahead: Fed, BoE rate meetings; US jobs; Microsoft, Apple, Meta, BT results Read our preview of major economic and company events in the week commencing 29 January 2024, and view our earnings calendar. Michael Hewson - 26 Jan 2024  With our intuitive trading apps, you can keep an eye on the markets and your open positions on the\r\n                    go Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 67% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets, CFDs, OTC options or any of our other products work and whether you can afford to take the high risk of losing your money. CMC Markets UK plc (173730) and CMC Spreadbet plc (170627) are authorised and regulated by the Financial\r\n                Conduct Authority in the United Kingdom. Telephone calls and online chat conversations may be recorded and monitored. Apple, iPad, and iPhone are\r\n                trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of\r\n                Apple Inc. Android is a trademark of Google Inc. This website uses cookies to obtain information about\r\n                your general internet usage. Removal of cookies may affect the operation of certain parts of this\r\n                website. Learn about cookies and how to remove them. Portions of this page are reproduced from work\r\n                created and shared by Google and used according to terms described in the Creative Commons 3.0\r\n                Attribution License. "
}