{
    "title": "Tesla, Southern Copper And A Ride-Share Giant On CNBC’s ‘Final Trades’ - \nTesla (NASDAQ:TSLA), Southern Co",
    "date": "1/26/2024",
    "url": "https://www.benzinga.com/trading-ideas/long-ideas/24/01/36796637/tesla-southern-copper-and-a-ride-share-giant-on-cnbcs-final-trades",
    "text": "On CNBC’s \"Halftime Report Final Trades,\" Stephen Weiss  of Short Hills Capital Partners said he is  short on Tesla, Inc. TSLA. The electric vehicle manufacturer's shares dipped more than 12% on Thursday. Austin, Texas-based Tesla reported worse-than-expected financial results, with fourth-quarter revenue of $25.17 billion — up 3% year-over-year. The revenue missed a Street consensus estimate of $25.62 billion, according to data from Benzinga Pro. The company reported earnings per share of 71 cents, which missed a Street consensus estimate of 74 cents per share. Bill Baruch of Blue Line Futures named  Southern Copper Corporation  SCCO as his final trade. On Nov. 27, Morgan Stanley analyst Carlos De Alba downgraded Southern Copper from Equal-Weight to Underweight and lowered the price target from $83 to $68. Don’t forget to check out our  premarket coverage here Joshua Brown  of Ritholtz Wealth Management picked Uber Technologies, Inc.  UBER, which rose to a new all-time high on Thursday. The ride-sharing company has emerged in the area of federal marijuana lobbying, as reported by Marijuana Moment. The company has shown interest in the Secure and Fair Enforcement Regulation (SAFER) Banking Act, marking its first foray into federal marijuana advocacy. The banking reform proposal, if passed, would safeguard financial institutions that work with state-licensed cannabis businesses from federal repercussions. On Wednesday, Gordon Haskett analyst Robert Mollins downgraded Uber Technologies from Buy to Hold and announced a $66 price target. Check This Out:  Insiders Buying Compass Minerals International And 2 Other Stocks Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}