{
    "title": "Tesla EV Prices Are Inverting. Why That's A Bad Sign.",
    "date": "1/19/2024",
    "url": "https://www.investors.com/news/tesla-stock-ev-giant-prices-are-inverting-why-thats-a-bad-sign/",
    "text": "TOP FUNDS: These Mutual Funds Beat Benchmarks Over A 10-Year Span     Tesla (TSLA) vehicle pricing has turned upside down with the historically more expensive Model Y now often cheaper than the Model 3 after the latest round of price cuts and with help from various subsidies. TSLA stock edged a fraction higher Friday, but fell on the week. Tesla customers throughout Europe and the U.S. can now get the Model Y, in many cases, for less than a Model 3 with Tesla continuing its strategy of offering vehicle discounts and slashing prices early in 2024 as the EV giant attempts to shore up demand. In January, Tesla has trimmed China vehicle prices on the Model 3 and two Model Y variants and then on Tuesday slashed Model Y prices in many European countries. The European price cuts come even with Tesla Berlin set to suspend production for two weeks, starting Jan. 29. The latest vehicle price action and IRA tax credits in the U.S. mean the Model Y is now cheaper than the Model 3 in some countries. In the U.S., a Model Y Long Range has a price of $41,490, including the $7,500 Inflation Reduction Act (IRA) tax credit. A Model 3 Long Range vehicle has a price of $45,990 and is not eligible for IRA tax credits. The Model Y Performance trim is also less than the Model 3 Long Range, coming in at an IRA adjusted price of $44,990. U.S. buyers also can take advantage of hefty discounts on inventory vehicles, with bigger deals for the Model Y. So the effective Tesla inversion is even stronger than list prices suggest. On Friday, Tesla unveiled new Model Y lease prices, up to 8% lower than before on a 36-month term. Meanwhile, in Germany, a Model 3 all-wheel drive model goes for €51,990, more than the €49,990 for the Model Y Long Range. Likewise in France, a Tesla Model Y Performance trim goes for €48,990-€50,990, after the €5,000-€7,000 subsidy based on income. A Model 3 all-wheel drive vehicle in France has a price of €50,990. The China-made Model 3 is no longer eligible for French subsidies. To maintain sales momentum in 2023, Tesla aggressively cut vehicle prices and offered discounts throughout the year. Auto gross margins, which peaked at 30% in Q4 2021 amid industry chip shortages, have plunged well below 20%. Tesla bulls in the latter half of 2023 repeatedly predicted that Tesla's price cuts were ending and that auto gross margins had bottomed. The Model Y is Tesla's most popular offering but with prices continuing to fall it appears there could be an inventory glut. In the fourth quarter Tesla delivered 53,868 Model Y vehicles in Europe, down 2% compared to 2022, according to data compiled by Troy Teslike. However, while Model Y deliveries declined year-over year it was not a supply issue with Tesla finishing Q4 with 32,000 unsold Model Y vehicles. Tesla Berlin, which will suspend production for two weeks starting on Jan. 29, is running well below capacity. Tesla Shanghai has reduced exports to Europe. Tesla may also have to now cut prices on Model 3 vehicles to realign pricing in Europe and the U.S. Barclays analyst Dan Levy on Wednesday lowered the firm's price target on Tesla stock to 250, down from 260, and kept an equal weight rating on the shares. Levy told investors the central theme for Tesla in 2024 is that it faces volume pressure in a demand constrained environment. Barclays view is that 2024 will be the first time in Tesla's history that volume will likely be more a function of demand than of the company's production capacity. Levy predicts Tesla delivering 1.97 million units in 2024. Tesla average vehicle prices in Q4 were $43,010, down 16% compared to $51,400 in 2022, according to FactSet. For Q1, Tesla average prices are expected to drop 7% to $42,670. FactSet projects the average selling price falling throughout 2024 to $41,670 in Q4 2024. Tesla stock pared early losses, edging up a fraction to 212.02 Friday during market action. TSLA fell 3% on the week and is below its moving averages following five straight weekly declines. So far in January, Tesla stock has tumbled below key levels of support, as analysts await news on auto gross profit margins, excluding regulatory credits, and watch to see if vehicle pricing has stabilized. On Jan. 17, Gary Black, managing partner of the Future Fund, posted on X that based on the January price cuts he was revising 2024 earnings estimates to $3.75 per share, down from $3.90 per share. The analyst consensus for 2024 EPS is down to $3.72 a share vs. $3.81 at the end of last year. It was $5.65 at the end of January 2023. Black wrote that Tesla management \"still does not see that cutting configurator prices and inventory discounts by the same amount is value destructive.\" \"Price cuts are a short term sugar high that pulls forward orders from those who already own or are interested in an EV,\" Black added Friday on X. With Tesla reporting Q4 earnings and revenue next week, closing out 2023, analysts are still focused on vehicle pricing and margins in 2024. Bernstein analyst Toni Sacconaghi wrote in early January that auto gross profit margins \"are a key question\" going into Q4 earnings. Sacconaghi models 15.7% auto gross profit margins for the fourth quarter but that they could drop lower given the impact of price cuts in September and October as well as significant discounting of inventory models in Q4. Tesla stock has retreated more than 14% in January. TSLA shares tumbled 7.8% to 218.89 last week, plunging below the 50-day and 200-day lines. Investors could use 265.13 and 278.98 as potential  buy points. Tesla stock is technically in an awkward double-bottom base,  according to MarketSmith analysis. The relative strength line, which tracks a stock's performance vs. the S&P 500, is at its lowest level since late May, according to MarketSmith. In 2023, Tesla doubled, easily outperforming the broader S&P 500 index. Tesla stock ranks fifth in the 35 member IBD Auto Manufacturers industry group. The stock has a 72 Composite Rating out of a best-possible 99. Tesla stock also has a 79 Relative Strength Rating and an 88 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla Stock A Buy Or A Sell? Stocks Near A Buy Zone Learning How To Pick Great Stocks? Read Investor's Corner MarketSmith: Research, Charts, Data And Coaching All In One Place Is Rivian A Buy Right Now With The Cybertruck Hype? Futures: Three Stocks Near Buy Points 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. 3:05 AM ET\nThe latest data from China shows Tesla registrations are down. Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}