{
    "title": null,
    "date": "1/11/2024",
    "url": "https://electrek.co/2024/01/11/bmw-spends-billions-to-push-its-next-gen-evs-into-tesla-territory/",
    "text": "On the heels of announcing its record year in sales of all-electric vehicles last year, BMW says it is now investing $711 million (€650 million) to convert its main factory in Munich to exclusively produce electric vehicles by the end of 2027. It’s all part of a multibillion-dollar effort to give its next-gen Neue Klasse EVs a competitive edge against the likes of Tesla. According to a press announcement, BMW’s Munich plant will be the first in the company’s existing production network to be transformed for all-electric cars. A new factory in Debrecen, Hungary, currently under construction, will also build only electric cars, with the upcoming Neue Klasse models planned to be built there in 2025. After completion of the Munich factory, the upcoming Neue Klasse sedan production will be moved there, as well as other next-gen models being built at BMW’s factory in China starting 2026, and its plant in Mexico from 2027. BMW’s all-electric i4 is currently built in Munich, a plant that has been making cars since 1922. A few months ago, BMW ended ICE production in Germany, moving ICE production from the Munich factory to the UK and Austria – a big step for the legacy automaker after cranking out polluting vehicles in its home country for 60 years.Unlike its rivals, BMW hasn’t set its own target for ending ICE production, so it may just have to fall in line with EU regulations, which bans the sale of petrol and diesel cars from 2035. BMW’s plan, however, is more about its electric and petrol cars happily coexisting, with heavy investments being poured into both (and this includes diesel engines too). Still, the automaker says it is right on target with its EV production goals, citing that all-electric vehicles made up 15% of BMW’s sales last year. It expects to sell half a million BEVs this year. Also, BMW has been pumping a lot of money into its Neue Klasse concept, which it says promises to bridge the technology gap and catch up the brand to rivals like Tesla, reports Automotive News Europe. Last September at the IAA Munich Mobility auto show, the automaker unveiled its Vision Neue Klasse concept, which it is currently testing and fine-tuning. From 2025, we can expect to see six Neue Klasse models rolling out, including a 3 Series-sized sedan and an SUV. BMW has high hopes for its next-gen innovation, describing it as a “benchmark in terms of range, charging speed, and pricing.” Back in September, the head of BMW Group Design said the design is “typically BMW and so progressive it looks like we skipped a model generation.” As for how much the 2025 Vision sedan will cost, it’s too early to say, but estimates predict anywhere from $35,000 to $45,000. While the sedan hopes to rival the Tesla Model 3, BMW has promised a range of vehicles to fit a range of customers, so we’ll stayed tuned. Read more:BMW nearly doubles its all-electric sales in 2023BMW halts its ICE production, in Germany at leastPhoto credit: BMW Group If you’re an electric vehicle owner, charge up your car at home with rooftop solar panels. To make sure you find a trusted, reliable solar installer near you that offers competitive pricing on solar, check out EnergySage, a free service that makes it easy for you to go solar. They have hundreds of pre-vetted solar installers competing for your business, ensuring you get high quality solutions and save 20-30% compared to going it alone. Plus, it’s free to use and you won’t get sales calls until you select an installer and share your phone number with them. Your personalized solar quotes are easy to compare online and you’ll get access to unbiased Energy Advisers to help you every step of the way. Get started here. FTC: We use income earning auto affiliate links. More. Subscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast. Jennifer is a writer and editor for Electrek. Based in France, she has worked previously at Wired, Fast Company, and Agence France-Presse. Send comments, suggestions, or tips her way via X (@JMossalgue) or at jennifer@9to5mac.com. "
}