{
    "title": "Tesla earnings, PCE inflation data: What to Watch This Week",
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/video/tesla-earnings-pce-inflation-data-173652088.html",
    "text": "The days ahead are set to be busy as fourth-quarter earnings results roll out. Yahoo Finance’s Rachelle Akuffo and Akiko Fujita break down the top companies set to report earnings this week, including Tesla (TSLA), as well as key inflation data like the Personal Consumption Expenditures (PCE) index due out Friday. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim RACHELLE AKUFFO: Well, of course, we have a big week ahead of us with key inflation data out ahead of the first Fed meeting of the year, as well as company results on deck as well. Now, investors will be watching all of this information closely as they try to maintain the momentum in this current market. Now I think investors should be focused on earnings this week. We have some big results from companies across multiple sectors, including United Airlines, Netflix, Tesla, Intel, and Amex. So just to give a quick roundup here. We're going to see United Airlines reporting after the bell today. We'll get a bit more clarity, hopefully, about the health of the industry. The street was a little bit unsettled after Delta reported their profit outlook was below its long-term target. So a look at that, plus, of course, on the heels of the JetBlue Spirit merger falling apart because of that court hearing. Tuesday. We have Netflix, of course, the streaming King. We'll get a closer look at some of those valuations. See if they're justified. Of course, they have been cutting costs on content and upping some of those third-party licensing deals. So we'll see how that's affecting margins. And, of course, Wednesday. Tesla. We'll hear possibly from Musk. But we'll hear from Tesla on that earnings call, especially, after he put that announcement out there, calling for 25% voting control. He wants to become a leader in AI and robotics-- wants that voting control to do that. And, of course, eyeing those margins after those price cuts on some models in China and Europe as well as some of these deliveries we'll be watching. And, of course, the broader story on EV demand. Thursday. We have Intel. We'll see how much of that enthusiasm over AI is already baked into valuations right now. This is a big-tech bellwether coming on the heels of Taiwan Semiconductor with solid earnings and a bullish forecast. And, of course, on Friday, we have Amex. A Warren Buffett favorite. A real pulse of the consumer there. Keeping an eye on what we see with credit card delinquencies, just last-- on January 16, they reported that it had remained steady at 1.4% in December. And it's still down from 2019. So a real overview. If we a bit of a taste of everything. These were just the five I picked. There's so many more, obviously. AKIKO FUJITA: Yeah, I mean, certainly going to be a big focus as we get into the heart-of-earnings season. JPM putting out a note today, saying that they're likely to be a deceleration in the momentum for Q4 earnings. Corporate profitability, under a bit of pressure here. They've highlighted a number of sectors Semis autos and banks. But a few things I've noted here. To me, it's interesting. Last week we spent, Rachelle, the week talking about the big banks. JP Morgan saying that those beats aren't necessarily being rewarded so far. So all those names you mentioned that are reporting this week, certainly, one of those things to be looking out for. I'm going to be watching economic data really closely. So much of what we've been seeing in the market's really fueled by this expectation of anywhere from 5 to 6 rate cuts. We've got the Fed's preferred inflation gauge. PCE coming out on Friday. That is going to be key here. Not just for setting the expectation for this upcoming meeting because there is an expectation that not much is going to change, but it is about March. That's the next marker here. Because the market has run up ahead with the expectation, there could be a rate cut on the table. But, Rachelle, when you look at some of the economic data that's come out so far, CPI already out earlier this month, core CPI, core inflation, which is what Fed wants to look at, much stickier than expected. And, of course, even if you look at where the labor market is, we have seen surprising resilience there. So it will be interesting to see how this all plays out. RACHELLE AKUFFO: Indeed, and we know the Fed said that they didn't want to jump the gun and start cutting rates before the job was actually done. So we know they'll be keeping a close eye on that data. And, perhaps, not jumping the gun, just on a month-to-month data. But really taking that holistic view of a downtrend in inflation that they're hoping to see. AKIKO FUJITA: Yeah, we've really seen Fed officials push back against the market expectation. Related Quotes "
}