{
    "title": "Tesla, SpaceX leaders concerned over Elon Musk’s drug use: Report",
    "date": "1/7/2024",
    "url": "https://fortune.com/2024/01/07/elon-musk-drug-use-worries-tesla-spacex-leaders-report/",
    "text": "Elon Musk’s drug use has worried executives and board members at businesses he runs, the Wall Street Journal reported, citing unidentified people familiar with the billionaire and the companies. Musk has used LSD, cocaine, ecstasy and psychedelic mushrooms, often at private parties, the Journal said, citing unnamed witnesses and others with knowledge of the matter. People close to the Tesla Inc. and SpaceX chief executive officer told the newspaper his drug use is ongoing, and that in particular he’s consuming ketamine. Musk said in August he has a prescription to use the drug as an antidepressant. After Musk puffed on a blunt containing marijuana on Joe Rogan’s podcast in September 2018, the Pentagon reviewed the federal security clearance tied to his role as CEO of Space Exploration Technologies Corp., which is certified to launch military spy satellites, Bloomberg News first reported in March 2019. “After that one puff with Rogan, I agreed, at NASA’s request, to do 3 years of random drug testing,” Musk, 52, posted Sunday on X, the social media company he owns. “Not even trace quantities were found of any drugs or alcohol.” Read more: Elon Musk took drugs with Tesla board members: Report Musk didn’t respond to a request for comment from Bloomberg News. Alex Spiro, an attorney for the billionaire, told the Journal that his client is “regularly and randomly drug tested at SpaceX and has never failed a test,” and referred to “false facts” in the article but didn’t detail them. SpaceX is now the only US company approved to transport NASA astronauts to and from the International Space Station. The Pentagon also has stepped up purchases of launches from the closely held company in recent years, and in June contracted with SpaceX’s satellite communications business Starlink to support Ukraine’s military. The Journal reported that Linda Johnson Rice, who became a Tesla director in 2017, didn’t stand for reelection two years later out of frustration with Musk’s behavior and her concerns about his drug use. Musk oversees six companies: Tesla, SpaceX and X, the social media company formerly known as Twitter; the tunneling venture The Boring Co.; brain implant developer Neuralink; and artificial intelligence startup xAI. His $219.4 billion net worth ranks No. 1 on the Bloomberg Billionaires Index. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}