{
    "title": "Tesla's plans for India: May set up factory, make new car for developing \nnations",
    "date": "1/13/2024",
    "url": "https://www.hindustantimes.com/india-news/tesla-makes-big-plans-for-india-may-set-up-factory-make-new-car-for-developing-nations-101705089954724.html",
    "text": "Subscribe Now! Get features like As India moves closer to drafting a new electric vehicles (EV) policy, Tesla is in advanced talks to make an entry into the country and may be open to committing nearly $30 billion in investments, directly and indirectly, over the next five years in a manufacturing plant, and battery ecosystem and ancillary industries, people closely involved with the company’s official business plans said. This may include a direct and immediate investment of $3 billion to produce a new small car from an Indian plant for the wider developing world, a $10 billion commitment from other partners to support this manufacturing venture, and a cumulative $15 billion in the battery industry ecosystem over a five-year period, the people added. Also read: Elon Musk changes his X bio to ‘Chief Troll Officer’, now ‘lives’ in a new location If the new EV policy — which is a broader policy and not specific to Tesla — meets Tesla’s ask of a rebate in the current structure of import duty for foreign-made EVs, the company first plans to bring a limited number of its standard brands to compete in the Indian luxury car market while begin building and testing a charging ecosystem. Simultaneously, Tesla may also invest in a factory in India to roll out the first small car within two years, with the facility completed within three years. The pricing structure of the car hasn’t been determined but it is likely to be a cheaper model that the usual Teslas to cater to the demands of countries in Asia, Africa and Latin America. This factory, with a high degree of local made-in-India content, may cater partially to the Indian market and substantially focus on exports, the people cited above indicated. “If it works out, this will the biggest foreign direct investment commitment in India. Tesla will invest $3 billion in the plant and other partners in its manufacturing ecosystem will invest another $10 billion. In parallel, there will be another $5 billion investment in batteries that will grow to $15 billion. We are looking at a total of $30 billion,” said a person close to the company and involved in discussions on the project. The person added this could well be “Suzuki moment” for India’s EV industry - alluding to how Maruti-Suzuki ushered in a small car revolution in the 1980s — and the “Apple plus moment” for India’s manufacturing aspirations — alluding to Apple’s more recent foray into production in India. “But unlike Apple, Tesla brings everything in one go. Don’t think of Tesla as just an auto company. It is a tech company. It is a critical minerals mining and refining company. It makes its own semiconductors. It is a design company. It brings in a huge ecosystem. The spillover from this to other industries is enormous.” Also read: Elon Musk's X shed 1,000 employees across team tasked to combat online hate Tesla did not officially comment on its specific plans for India. While not specifically commenting on the case of Tesla, a senior government of India official working in an economic ministry said, “India will consider providing incentive to all players in the EV sector. No company specific incentive will be given in any sector.” But this indicates that the door for import duty concessions, as a part of a wider policy, remains on the table. The ministry of road transport and highways has launched the EV30@2030 campaign, aiming to ensure that 30% of newly registered private cars, 40% of buses, 70% of commercial cars, and 80% of 2-wheelers and 3-wheelers will be electric by 2030. An official said that while there was no single India EV policy, the government’s “various policy measures and supportive actions” indicated a strong commitment to promoting EV adoption in the country. Like other American majors, Tesla’s India plans are a part of its wider diversification strategy beyond China. While Tesla is continuing to explore other Asian countries as a possible manufacturing location, those familiar with the company’s thinking said that Tesla founder Elon Musk admires both India and Prime Minister Narendra Modi, whom he met last June in New York, and remains committed to expanding Tesla’s presence in India. “Musk really admires what Modi has done for India and his energy. He spoke to Modi about his interest in Indian spirituality and meditation and expressed an interest in traveling there,” said the person quoted above familiar with Tesla’s thinking. Within India, Tesla is considering four major auto manufacturing hubs to set up its plant -- Haryana (which will help cater to the biggest market in NCR), Tamil Nadu, Maharashtra, and Gujarat. But given the major plans for export, it is likely that, if it does invest, Tesla may opt for a coastal state in the west or south. Also read: Tesla is raising factory worker pay as auto union tries to organize its electric vehicle plants In terms of the timeline, based on its record of setting up a plant within two years in Germany and one year in China, Tesla is confident that it may be able to roll out the first car in two years and build the entire factory within three years of entry. Tesla’s manufacturing module is predicated on a high degree of local content, with those close to the company pointing out that in its Berlin factory, the local content in Tesla’s EVs is higher than in that of Mercedes, a German company, while in Shanghai, its degree of localisation is 95%. Tesla’s investment, say advocates of the project, will help serve several of India’s goals on local manufacturing, the battle against the climate crisis, integration into new global supply chains, and the wider strategic partnership between India and the US. Prashant Jha is the Washington DC-based US correspondent of Hindustan Times. He is also the editor of HT Premium. Jha has earlier served as editor-views and national political editor/bureau chief of the paper. He is the author of How the BJP Wins: Inside India's Greatest Election Machine and Battles of the New Republic: A Contemporary History of Nepal. ...view detail   "
}