{
    "title": "Elon Musk is unfathomably rich. Here's where his money is stashed",
    "date": "2/3/2024",
    "url": "https://www.iol.co.za/business-report/companies/elon-musk-is-unfathomably-rich-heres-where-his-money-is-stashed-7453de9d-6913-4793-a002-ebd06152d4a6",
    "text": "Tuesday, March 26, 2024 SpaceX founder Elon Musk smiles at a press conference. File image. Published Feb 3, 2024 | Published Feb 3, 2024 Share  Elon Musk, the outspoken billionaire who leads electric automaker Tesla, has a tenuous hold on the title \"world's richest person.\" He grabbed the crown in 2021, ousting Amazon founder (and Washington Post owner) Jeff Bezos. But Musk's top position could be in peril after a Delaware court ruled this week that his $56 billion compensation package at Tesla was unfair, ordering him to return significant stock options he's received over the past five years. While the options return would likely knock him out of the top spot, Musk would still be a billionaire many times over. Musk derives most of his $202 billion net worth, according to the Bloomberg Billionaires Index, from his stakes in various companies. Musk lacks significant tranches of cash; his money is largely tied up in ownership stakes of his companies. To buy Twitter in 2022, he leveraged his large share in Tesla and solicited investors, rather than relying on liquid sums. Here's where the entrepreneur holds his wealth. Tesla Musk holds 411 million shares and about 304 million Tesla options, totaling about $127 billion - the majority of his wealth. These calculations do not include the impact of the judge's order this week, which would require Musk to return some of his options. Musk's compensation package - the largest ever at a U.S. public company - was the crux of the Delaware Chancery Court lawsuit after a shareholder sued. A judge ruled the package unfair, saying that Musk had cozy relationships with two of the board members that constructed the deal, and he controlled too much of the process. In response, Musk posted on X that he plans to hold a shareholder vote to incorporate the company in Texas. But even if he does, the court challenges in Delaware will not disappear. Musk has repeatedly asserted his commitment to Tesla, where he has served as CEO since 2008. The company has been called the crown jewel of Musk's portfolio. Tesla made electric cars mainstream, and it has global ambitions. After starting with a sporty convertible, the Roadster, Tesla has gradually expanded to sedans. Its Autopilot technology is one of the most widespread driver-assistance systems on the market, available in millions of cars on the road. However, Tesla recently recalled the feature to implement additional safeguards against misuse through a software update. The features have ignited controversy and have been involved in numerous fatal car crashes, according to Post investigations. SpaceX Musk's ambitions aren't limited to Earth - he wants humans to land on Mars. Musk founded SpaceX, a private firm that builds rockets and satellites, in 2002. The company has worked with NASA to conduct space launches and make trips to the International Space Station as it has pioneered reusable rockets. SpaceX intends to return astronauts to the Moon - working on NASA's first human mission to the moon's south pole, slated for 2026. Musk has characterized SpaceX as an extension of his mission at Tesla. \"We must safeguard the future of life by transitioning to sustainable energy on Earth & becoming multiplanetary via Mars,\" he wrote in a tweet. \"It's not clear how much time we have to do these things, but sooner is definitely better.\" X, formerly Twitter Musk bought Twitter for about $44 billion in a controversial deal in 2022 and renamed the company X last year. Since the acquisition, the billionaire has laid off the majority of the company's staff and hired a new CEO, Linda Yaccarino. Since the acquisition, X has struggled with waning advertiser confidence, as brands grow wary of Musk's controversial public comments. Investors have also expressed concern at the company's finances. X is now estimated to be worth less than half of what Twitter was valued at the time of the takeover. But Musk has said that user numbers on X are growing and has dismissed concerns about waning interest in the site. The Boring Company Musk is also extending his empire underground. Born in 2016 from Musk's exasperation with a traffic jam, the Boring Company is his proposed solution to congestion: \"personalized mass transit,\" via tunnels. The company aims to build a network of high-speed tunnels near some of America's most gridlocked cities. In 2017, Musk tweeted that he had \"verbal govt approval\" for a Hyperloop that would connect Washington, D.C., to New York City and could be traveled in 29 minutes. No such project has taken shape. The company's biggest project to date is the 1.7-mile loop below the Las Vegas Convention Center, which has been used by more than 1.5 million passengers since it opened in 2021, according to the company's website, \"with a demonstrated peak capacity of over 4,500 passengers per hour, and over 32,000 passengers per day.\" The Boring Co. has yet to prove its theory that tunneling can solve traffic on a larger scale. Critics point out that rather than increasing mobility, the strategic relocation of cars underground would simply remove the traffic from view. Musk is insistent, however: \"It's either traffic forever or tunnels,\" he once tweeted. The Washington Post Related Topics: Independent Online, popularly known as IOL, is one of South Africa’s leading news and information websites bringing millions of readers breaking news and updates on Politics, Current Affairs, Business, Lifestyle, Entertainment, Travel, Sport, Motoring and Technology. Read more © 2024 Independent Online and affiliated companies. All rights reserved. "
}