{
    "title": "Musk’s Neuralink moves to Nevada after Delaware judge blocks his Tesla pay \ndeal",
    "date": "2/10/2024",
    "url": "https://www.marketwatch.com/story/elon-musks-neuralink-moves-legal-home-to-nevada-after-delaware-judge-invalidates-his-tesla-pay-deal-294c8ad7",
    "text": "Elon Musk’s brain implant company Neuralink has moved its legal corporate home from Delaware to Nevada after a Delaware judge struck down Musk’s $55.8 billion pay package as CEO of Tesla. Neuralink, which has its physical headquarters in Fremont, California, became a Nevada company on Thursday, according to state records.  Delaware records also list the company’s legal home as Nevada. The move comes after Musk wrote on X, formerly Twitter, that shareholders of Austin-based Tesla \n        TSLA,\n        +5.74%\n       would be asked to consider moving the company’s corporate registration to Texas. “Never incorporate your company in the state of Delaware,” he wrote in one post after the court ruling. He later added, “I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters.” Legal experts say most corporations set up legal shop in Delaware because laws there favor corporations. “Delaware built its preferred state of incorporation business by being friendly to company management, not shareholders,” said Erik Gordon, a business and law professor at the University of Michigan. On Jan. 30, Delaware Chancellor Kathaleen St. Jude McCormick invalidated the pay package that Tesla established for Musk in 2018, ruling that the process was “flawed” and the price “unfair.” In her ruling, she called the package “the largest potential compensation opportunity ever observed in public markets by multiple orders of magnitude.” McCormick’s ruling bumped Musk out of the top spot on the Forbes list of wealthiest people. Musk, a co-founder of the privately held Neuralink, is listed as company president in Nevada documents. Messages were left Saturday seeking comment from Neuralink and Tesla. McCormick determined that Tesla’s board lacked independence from Musk. His lawyers said the package needed to be rich to give Musk an incentive not to leave — a line of reasoning the judge shot down. “Swept up by the rhetoric of ‘all upside,’ or perhaps starry eyed by Musk’s superstar appeal, the board never asked the $55.8 billion question: ‘Was the plan even necessary for Tesla to retain Musk and achieve its goals?'” McCormick wrote. Musk’s fans argue that he shouldn’t be paid like other CEOs because he isn’t like other CEOs. He and Tesla are practically inseparable, so keeping him as CEO is key to the company’s growth. He built the company from an idea to the most valuable automaker in the world, last year selling more electric vehicles than any other company. His star power gets free publicity, so the company spends little on advertising. And he has forced the rest of the auto industry to accelerate plans for electric vehicles to counter Tesla’s phenomenal growth. McCormick’s ruling came five years after shareholders filed a lawsuit accusing Musk and Tesla directors of breaching their duties and arguing that the pay package was a product of sham negotiations with directors who were not independent of him. The defense countered that the pay plan was fairly negotiated by a compensation committee whose members were independent and had lofty performance milestones. Musk wrote on X last month that the first human received an implant from Neuralink. The billionaire did not provide additional details about the patient. Slowing demand for electric vehicles is to blame. Visit a quote page and your recently viewed tickers will be displayed here. "
}