{
    "title": "Elon Musk shares video showing Tesla's Optimus robot performing detested \ntask: 'The project has come a long way'",
    "date": "2/2/2024",
    "url": "https://www.thecooldown.com/green-tech/tesla-robot-laundry-folding-video/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. The video is a snapshot of Tesla's latest EV and AI tech in one frame. Photo Credit: X Elon Musk's latest non-electric vehicle contraption has an uncanny resemblance to the villain automatons from I, Robot. Fortunately, these Tesla Bots (also called Optimus robots) appear to have more in common with Alice from The Brady Bunch than the artificially intelligent menaces from action movies. A video clip shared on X, formerly known as Twitter, shows an Optimus dutifully folding laundry. It's a task most of us would likely find repetitive and boring, which are the types of chores the bots are being built to handle. Optimus folds a shirt pic.twitter.com/3F5o3jVLq1 Musk assembled a team of software and engineering experts to build a \"general purpose, bi-pedal, autonomous human robot.\" The machine is intended to complete \"unsafe, repetitive, or boring tasks,\" according to a Tesla description of the project. And if Musk has his way, they will one day be building his EVs — before graduating to domestic duties, per Electrek. It seems, however, that Optimus still has a little way to go before it is ready to put the hood on Model 3s or to make afternoon tea. \"Important note,\" Musk commented on X about the laundry bit, \"Optimus cannot yet do this autonomously, but certainly will be able to do this fully autonomously and in an arbitrary environment (won't require a fixed table with box that has only one shirt).\" Be that as it may, the human-like movements of a human-looking machine are hard to ignore. \"When Optimus … was first announced, it seemed to be a half-baked idea … It also didn't help that the demo at Tesla AI Day in 2022 was less than impressive,\" Editor-in-Chief Fred Lambert wrote for the online tech publication. \"But the project has come a long way since then.\" AI is already at work in our world, generating images and messaging online. LaserWeeder, for example, uses machine learning, a branch of AI, to quickly identify and torch 100,000 weeds an hour in farm fields. It's an example of leveraging technological breakthroughs to benefit the planet. In LaserWeeder's case, the innovation is reducing the amount of toxic herbicides that are used. A photo shared by Electrek shows a group of Tesla Bots walking in formation toward the camera, with Cybertrucks on assembly lines in the background. The photo is a snapshot of Tesla's latest EV and AI tech in one frame. For those fearing a robot apocalypse, the photo could be perceived as a harbinger of doom. But that's certainly not the intent of Optimus designers. Bot engineer Milan Kovac defined a complex, yet monotonous work order for the machine in a comment on X. It includes neural nets, data diversity, and dexterity. \"And who wouldn't welcome help with folding cloths?\" he posted. Join our free newsletter for weekly updates on the coolest innovations improving our lives and saving our planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}