{
    "title": "3 Things You Need to Know If You Buy Rivian Today",
    "date": "2/26/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA/pressreleases/24342041/3-things-you-need-to-know-if-you-buy-rivian-today/",
    "text": "Tesla(NASDAQ: TSLA) was the electric vehicle (EV) manufacturer that did the unthinkable -- it broke the chokehold the big incumbents had on the automotive sector. After Tesla came a slew of electric vehicle upstarts that wanted to ride its coattails. One of those companies is Rivian(NASDAQ: RIVN). The problem is that not every electric vehicle maker can be the next Tesla. Here are three things to consider if you're thinking about buying shares of Rivian today. Tesla is the 800-pound gorilla in the U.S. electric vehicle market. But it's far from the only company operating in the space. There are upstarts like Rivian, but the legacy automakers are producing EVs, too. That means that Rivian has to distinguish itself from a large number of competitors, some of which already have large and profitable businesses. The auto sector is tough enough for the big players -- it's extra tough for smaller companies with fewer resources. Image source: Getty Images. Consider Rivian's small size in context. In the fourth quarter, it proudly announced, \"We more than doubled production and deliveries for full-year 2023 versus 2022 and exceeded our initial production guidance by more than 7,000 vehicles.\" That sounds great, but it is really just a bit of cheerleading. Rivian produced just over 57,000 units in all of 2023. Tesla produced nearly 495,000 EVs in the fourth quarter alone. For the year, it produced more than 1.8 million. Rivian's total output is a rounding error relative to Tesla's production numbers. That's not to suggest that Rivian hasn't achieved great things or that its products are unimpressive. But it will have to accomplish a lot more before it can claim to be competing toe-to-toe with the vehicle industry's most dominant companies. It costs a lot of money to build a company, particularly when in a business that's as capital-intensive as vehicle manufacturing. So it shouldn't be too surprising that Rivian has done nothing but lose money so far in its young life.  RIVN EPS Diluted (Quarterly) data by YCharts. To be fair, its revenue has been rising as it has expanded production. That's great, but Wall Street wants to see profits. That helps explain why, after the early excitement around the stock peaked, the shares have fallen by more than 90% from their all-time high. Investors who hoped Rivian would be the next Tesla have realized that it takes more than a good idea to build a profitable business. A lack of profits is a long-term problem because it means, at some point, the company might simply run out of money. As of the end of 2023, Rivian had around $9.4 billion in cash and short-term investments on its balance sheet, so there's no immediate concern on that front. However, that number was down from $11.5 billion at the end of 2022. Sure, management can keep spending down the cash hoard, but at some point, the money will run out if Rivian doesn't start making profits. Rivian expects production to be flat year over year in 2024. Management's focus is going to be on improving profitability, which is a good thing. But the projections on that front aren't exactly great, with management noting, \"We expect to achieve modest gross profit in the fourth quarter of 2024.\" Gross profit is revenue minus the cost of goods sold -- so, in this case, the revenue from selling cars minus what it cost to make those cars. A gross profit would be a good thing, for sure, but that won't happen for another four quarters. And the gross profit metric doesn't take into account the other big expenses that businesses face, like sales, general, and administrative costs, research and development expenses, and interest expenses. So even if the company posts a \"modest gross profit\" in the fourth quarter, it will still lose money for the year. And management has offered no guidance about when it thinks earnings will shift from red to black, which is what investors really care about. Rivian could very well turn out to be the next Tesla, but right now, it is still far from achieving that feat. It remains a tiny player in a large and competitive market. It's losing money and burning through its cash cushion. And there's no expectation that Rivian will turn profitable in 2024. In light of all that, investors should recognize that buying Rivian stock is a fairly high-risk gamble on a business with an uncertain future. Should you invest $1,000 in Rivian Automotive right now? Before you buy stock in Rivian Automotive, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Rivian Automotive wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 20, 2024  Reuben Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}