{
    "title": "Tesla Executive Says Fix For Vampire Drain In Sentry Mode Coming In Q2: \n'Power Consumption Needs Improvement'",
    "date": "2/22/2024",
    "url": "https://www.tradingview.com/news/benzinga:209bcce6e094b:0-tesla-executive-says-fix-for-vampire-drain-in-sentry-mode-coming-in-q2-power-consumption-needs-improvement/",
    "text": "Tesla Inc TSLA executive, Drew Baglino, on Thursday revealed that the company is working on releasing a software update for reducing power consumption in its sentry mode. What Happened: Acknowledging that sentry mode requires ample power, Baglino said, “Agreed, sentry mode power consumption needs improvement...” The team at Tesla is working on fixing the overt power consumption via a software update. The update, aimed at reducing power consumption by about 40%, will be deployed in the second quarter, he said. Baglino is the Senior Vice President of Power and Energy Engineering at Tesla. He was responding to a query on the initiative being taken by the company to fix the vampire drain in sentry mode. Vampire drain or phantom drain refers to the battery drain when vehicles are left idle. Agreed, sentry mode power consumption needs improvement, the team is working to reduce by ~40% in a Q2 software update. Why It Matters: Sentry mode is a feature on Tesla cars where the vehicle’s cameras and sensors remain powered on and ready to record any “suspicious activity” around the vehicle when it is in park. On detecting any suspicious activity around the vehicle, it will pulse the headlights and sound the alarm to alert the individuals outside. The vehicle driver will receive an alert on their Tesla app and the video footage recorded by the cameras will be saved to the USB drive installed in the car. The sentry mode has, in the past, faced privacy concerns. In February 2023, the Dutch Data Protection Authority, or DPA, concluded its investigation into the sentry mode for a potential privacy violation. The DPA, however, concluded the investigation with no fine or any other sanction for the EV maker. Photo via Shutterstock Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Elon Musk Says ‘Saudi Sugar Daddy’ Is Only Thing Keeping Lucid Alive, Warns Of Possible Rivian Bankruptcy Within 6 Quarters © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @Zeiierman Trading @Cenobar @TradingView @TradingView @iamcarlosbello @arakerbabian @dude_yugant @mytradingsetup @price_action_guru @akamenyar @garret_duke @fxdelta @mytradingsetup @ice.sef @thecurrencydon @fx.today @jesseforexmt5 @neo_inversion Whatever the trade "
}