{
    "title": "Tesla earned $1.8 billion last year from a side hustle",
    "date": "2/13/2024",
    "url": "https://www.businessinsider.in/thelife/news/tesla-made-1-8-billion-last-year-from-a-side-hustle/articleshow/107635014.cms",
    "text": "Liked the article? Share it with your friends... or copy link Elon Musk’s Tesla raked in $1.79 billion in regulatory-credit sales last year, according to a recent Securities and Exchange Commission filing, as it cashed in on rivals failing to sell enough electric vehicles to meet emission regulations. Tesla earns regulatory credits by making and selling electric vehicles. It can then sell them to automakers that have not produced enough EVs to meet emission rules imposed by regulators in the US, Europe, and China. It has proved an important business for Tesla, which does not disclose the recipients of the credits. Bloomberg, which initially reported on the filing, calculated that the company had pulled in almost $9 billion from selling regulatory credits since 2009. That might be as much a surprise to Tesla as it is to anyone. The company has expected revenue from regulatory credits to dry up as other automakers ramp up EV production. In a 2020 earnings call,  Zachary Kirkhorn, the company's chief financial officer at the time, warned as much. \"We don’t manage the business with the assumption that regulatory credits will contribute in a significant way to the future,\" Kirkhorn told investors, per Bloomberg. \"It will continue for some period of time, but eventually this stream of regulatory credits will reduce,\" he added. However, that scenario has largely failed to materialize, with Tesla’s earnings from selling regulatory credits slightly increasing from last year, when it earned $1.776 billion. The Musk-run automaker continues to dominate the US electric-vehicle market, though it's starting to lose ground to competitors. Still, many of its biggest rivals are scaling back their ambitious EV plans, with Ford postponing $12 billion in investment and General Motors reintroducing hybrids into its lineup. Right now, the biggest threat to Tesla’s dominance comes from China, with BYD overtaking the automaker as the world’s top seller of EVs at the start of the year. Tesla did not immediately respond to a request for comment made outside normal working hours. Advertisement "
}