{
    "title": "Jim Farley stresses Ford's 'Pro' fleet, urges investors to drop Tesla's FSD",
    "date": "2/16/2024",
    "url": "https://www.cbtnews.com/jim-farley-stresses-fords-pro-fleet-urges-investors-to-drop-teslas-fsd/",
    "text": "Your #1 source for auto industry news and content Farley emphasized that the future of the automotive industry lies in exploring Ford \"Pro\" On February 15, Ford CEO Jim Farley advised Wall Street to shift their focus away from Tesla’s Full Self-Driving (FSD) systems and concentrate on Ford’s thriving “Pro” fleet business. Speaking at a Wolfe Research conference, Farley emphasized that the future of the automotive industry lies in exploring Ford “Pro”, which boasts half a million subscribers and a robust 50% gross margin. Ford ‘Pro’ encompasses established fleet and commercial operations, along with newly developed telematics, logistics, and connected services catering to diverse business clients, from small-town tradespeople to multinational corporations. The unit’s pretax earnings are projected to reach $8 billion to $9 billion this year, surpassing estimated losses in the Model E EV business and earnings projections for the traditional “Blue” business. Ford anticipates revenue from telematics and non-traditional subscription services to reach $2,000 per vehicle year, or around $167 per month, by the upcoming years. Farley reiterated Ford “Pro’s” potential, highlighting its pivotal role in the company’s future. Ford is adjusting its EV spending, including domestic battery production, due to slower-than-expected consumer adoption and significant losses on current models. Despite this, Farley highlighted fleet customers’ faster-than-anticipated adoption of all-electric vehicles. As part of the “Ford+” restructuring, the “Pro” operations, led by Ted Cannis, play a crucial role. Ford is developing next-gen EVs, aiming for profitability within a year of launch. Farley emphasized the success and potential of the “Pro” business within the company’s strategic plan. Stay up to date on exclusive content from CBT News by following us on Facebook, Twitter, Instagram and LinkedIn. Don’t miss out! Subscribe to our free newsletter to receive all the latest news, insight and trends impacting the automotive industry. CBT News is part of the JBF Business Media family. Ford  Contact us: Info@CBTNews.com © Created by CBT News | Atlanta Web Design We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. "
}