{
    "title": "Can This Beaten-Down Stock Skyrocket More Than the \"Magnificent Seven\" Over \nthe Next 3 Years?",
    "date": "1 hour ago",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AMZN-Q/pressreleases/24947705/can-this-beaten-down-stock-skyrocket-more-than-the-magnificent-seven-over-the-next-3-years/",
    "text": "The \"Magnificent Seven\" refers to seven of the largest publicly traded tech companies in the world: Nvidia, Meta Platforms, Apple, Amazon, Microsoft, Alphabet, and Tesla. For what it's worth, this article is predicated on my belief that most of these companies are overvalued right now, and returns for the next three years consequently look modest to me. Against this backdrop, I believe Roku(NASDAQ: ROKU) has a much higher chance of skyrocketing over the next three years. Its market-beating potential isn't a guaranteed outcome. But there are several reasons to believe this stock is a coiled spring ready to be released. Here are three of them. If the \"Magnificent Seven\" is expensive as a whole, Roku stock is downright cheap. This is the first reason to be optimistic about its potential over the next three years. Roku stock is down nearly 90% from its all-time high in 2021. Since its high, the company's price-to-sales (P/S) valuation has dropped from almost 30 to where it trades now at a P/S ratio of 2.6.  ROKU PS Ratio data by YCharts This represents about a 90% drop in the valuation of Roku stock -- in other words, the drop in stock price is 100% valuation related. And this is a good thing for investors who buy shares today. A cheaper stock can be less risky than an expensive one, provided the business creates shareholder value in the future. Roku can create shareholder value with profitable growth, which brings me to my next reason why this stock can perform well over the next three years. Many skeptics question Roku's competitive advantage for providing a connected-TV operating system and hardware. And it's a fair question. Some Roku shareholders might point to the neutrality of the platform compared to companies such as Amazon, which provides similar products and services but also has its own streaming service. To me, this argument for Roku's competitive advantage isn't satisfying. Therefore, it's fair to worry about competition when it comes to Roku. That said, competition hasn't been a problem so far, and this is an important point. The company ended 2023 with 80 million active accounts, up 14% year over year, making it the largest connected-TV company. Roku's 80 million active accounts is significant for its growth potential for two reasons. First, it's still attracting new users at a compelling rate, which bodes well for its future revenue potential. Second, there's a strong case that its current accounts are undermonetized. Roku generates revenue by displaying ads. Active accounts are up, and streaming hours are up, too. But its average revenue per user dropped 4% year over year in the most recent quarter, reflecting a weak advertising market. I'm not sure when it will happen, but I expect a full advertising rebound within the next three years. Roku's revenue could go up by gaining new accounts and by increased advertising demand, which would lead to higher ad rates. These two sources of top-line growth could consequently lead to explosive revenue growth at some point in the near future. Roku had nearly an $800 million operating loss in 2023 -- when discussing shareholder-value creation, this is a problem. That said, the company has demonstrated profitability in the past, so it's possible. And the profit margin was actually quite good for a brief time.  ROKU Revenue (TTM) data by YCharts According to management, Roku's current losses are intentional -- it's aggressively lowered its hardware prices and is spending money to gain market share. One might disagree with the premise or the approach. But if true, this suggests that the company's losses are temporary and at some point, profits will improve. When it comes to Roku stock skyrocketing over the next three years, I feel very comfortable making two statements: The stock is cheap now, and its revenue will likely soar in coming years. That forms the basis for my conviction that it could outperform the Magnificent Seven. The third issue regarding Roku's profits is more of a wild card, but nonetheless important. Part of the reason the stock is cheap is the market doesn't believe the company has what it takes to sustainably generate positive cash flow. If Roku bucks the bearish narrative and turns the corner on profits, expect the market to finally give it more credit. On the other hand, if in three years Roku is still racking up losses like it is today, I'd expect Roku stock to be a market laggard. The company can't operate indefinitely with losses this large. Personally, I believe Roku has what it takes and believe its prospects will get better with scale. But it does still have a lot to prove. Should you invest $1,000 in Roku right now? Before you buy stock in Roku, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Roku wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 20, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Jon Quast has positions in Roku. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Roku, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Amazon.com Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}