{
    "title": "Reddit's IPO, Ether investigation, and Amazon's “Big Spring Sale”",
    "date": "43 minutes ago",
    "url": "https://qz.com/emails/daily-brief/1851353923/reddit-ipo-ether-sec-amazon-big-spring-sale",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Good morning, Quartz readers! Gucci sales plummeted in China. Investors didn’t like that news, and made nearly $8 billion in market cap for the luxury brand’s owner Kering disappear yesterday. The U.S. wants to know whether Ether is a security or not. To find out, the Securities and Exchange Commission reportedly subpoenaed three companies as part of a probe of the Ethereum Foundation. Meanwhile, the price of Bitcoin is all over the place. Mercedes and Chrysler are recalling more than 150,000 cars because of safety issues. Together, the two automakers have recalled nearly 950,000 vehicles in the U.S. this year (so far). Amazon kicked off what it’s calling a “Big Spring Sale.” Bank of America projected that the six-day event could generate billions of dollars in revenue for the company. Today’s the day — Reddit shares are expected to hit the market at $34 a pop, with the goal of raising $748 million. But is the stock a buy? The answer is complicated. 🤏 Reddit isn’t profitable, and hasn’t been since it was founded in 2005. But its losses are shrinking, slimming by ​​43% between 2022 and 2023. 🫨 Demand for Reddit’s stock far exceeds supply. Still, some experts say to wait and see how the stock performs, especially after its first quarter earnings. 🤪 Reddit could get memed by its own users. There has already been talk on WallStreetBets about short-selling Reddit stock on its first day of trading. 🤖 Reddit’s AI agreement with Google could be short-sighted. While it’ll initially generate revenue, the actual site could lose luster if its information becomes readily available through AI. Here’s what else to consider before buying, as well as five defining moments for Reddit, how much its CEO is paid, and pretty much everything else you need to know before its IPO. More American millionaires are becoming expats, even as the U.S. remains the place to be for millionaires hailing from other places. The grass, as they say, is always greener. Last year, a record number of American clients at Henley & Partners — a firm that specializes in helping uber-rich clients invest their way into gaining residence and citizenship elsewhere — were making inquiries. As in, 504% more compared to 2019. That’s a lot of rich people trying to jump the Good Ship America. “Motivations range from mitigating political risk, opening up business opportunities abroad, seeking lower taxes, and enhancing global mobility,” Mehdi Kadiri, managing partner and head of North America at Henley & Partners, wrote in a blog post. Bruce Gil has more, as well as where millionaires in the U.S. tend to drop an anchor (when they do stay, at least). It’s been a good spring for Nvidia. But it’s also been a good spring to be anywhere near Nvidia. Just ask the various companies Nvidia CEO Jensen Huang mentioned working with from the stage at the “Woodstock of AI.” Or ask Samsung, which is only reportedly working with Nvidia. It’s a little Taylor Swift-like — even being in Huang’s leather jacket-clad orbit is good for business right now. Which is a lot like Goldman Sachs analysts described in their note about phases to look out for when investing in AI. It won’t all be about Nvidia; there are a lot of other companies already feeling the effects. 🚘 Ohio thinks an app could replace driving instructors ⚠️ Mercedes and Chrysler are recalling more than 150,000 vehicles over safety issues 🌯 Chipotle is doing a 50-for-1 stock split. Here’s what that means 💰 Boeing’s brutal start to 2024 will cost it a ton of cash, executive warns 💸 Amazon co-founder MacKenzie Scott doubles her charitable donations after Elon Musk’s criticism 💎 The stock of the world’s largest diamond jeweler is tanking because people aren’t getting engaged KFC tried out the Chizza. Their pizza/chicken combo is not the only weird thing they’ve put on their menu over the years. Chick-fil-A is also trying out pizza. Down is up and up is down and nothing makes sense anymore. The solar eclipse isn’t the only space event happening April 8. The devil’s comet is scheduled to make an accompanying appearance. Super diamonds are something we definitely won’t use for engagements but are likely up in space. It may also be possible to grow them in a lab one day. Tail lights of the future could be QR-type codes for autonomous vehicles to read. If you think the future of tail lights sounds interesting, wait until you hear about the past. We have a whole Obsession email about them, and a podcast episode too. It’s that interesting. 🎧 Listen now on Spotify | Apple | Google | Pandora Did you know we have two premium weekend emails, too? One gives you analysis on the week’s news, and one provides the best reads from Quartz and elsewhere to get your week started right. Become a member or give membership as a gift! Our best wishes for a productive day. Send any news, comments, chicken that is chicken, and pizza that is pizza to talk@qz.com. Today’s Daily Brief was brought to you by Susan Howson and Morgan Haefner. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}