{
    "title": "How Amazon Relay in the UK enables women in the transportation industry to \ngrow their freight businesses",
    "date": "3 hours ago",
    "url": "https://www.aboutamazon.eu/news/transportation/how-amazon-relay-in-the-uk-enables-women-in-the-transportation-industry-to-grow-their-freight-businesses",
    "text": "This content is hosted by a third party (www.youtube.com). To view the content, you need to consent to cookies by selecting Accept all in the popup banner. Or you can go to the site footer, select Cookie Preferences, and then select On under Functional Cookies and Performance Cookies. Joana Singh, originally from Poland, is a remarkable businesswoman with an exceptional educational background. Her journey in the transportation industry is not just about building a successful business; it's about breaking stereotypes and carving a path where few women have tread before. Her story is a testament to resilience, determination, and solid belief in one's capabilities, even in the face of adversity. Joana joined Amazon Relay – a tool that gives carriers the opportunity to tap into the Amazon network and technology to build and grow their transportation business – in early 2020, and she believes Relay to be the main reason for the growth of her trucking company, Ontime Freight Ltd. “We found out that Amazon could give us loads in Europe as well as in the UK and we signed up for Relay!” said Joana. Having used Relay features like the 'Relay load board' to book and execute loads and 'Auctions' to secure and fulfil lanes, Ontime Freight Ltd. consistently leverages Amazon Relay’s suite of products and features, and she found them to be \"user-friendly for carriers, accommodating for drivers, and reliable in ensuring timely payments.\" From an early age, Joana had a passion for the dynamic world of transportation. She found the industry exhilarating, describing it as \"never boring\". Armed with enthusiasm and a thirst for knowledge, she pursued her education across different countries, mastering five languages along the way. Her academic journey culminated as she received her degree in International Law from the University of Milan. Despite her background and versatile skill-set, Joana faced challenges in entering the traditionally male-dominated transportation industry. As she encountered scepticism, she had to put in extra effort to gain recognition. Regardless, her perseverance never let up. In 2018, while managing a business portfolio in a transportation company, she made the decision to start Ontime Freight Ltd. With her determination and expertise in logistics, she paved the way to success. Starting with just one truck, her business rapidly expanded, exceeding all expectations. Joana's success inspired her husband to join his wife’s business while she steered Ontime Freight Ltd. toward greater heights. Today, Joana's business proudly operates three trucking companies - her own,  RH Freight & Consulting Ltd and J&M Transport - managing a fleet of nineteen trucks across two cities in the UK and one in Poland. Joana’s story symbolises a broader shift in the landscape of business, where gender barriers are gradually being dismantled. Her journey serves as an inspiration to aspiring entrepreneurs, particularly women, highlighting the power of determination and resilience in overcoming obstacles. She says: “To all women who are thinking of setting up their own business is to have lots of confidence in yourself and the best investment is to invest in you.” As we celebrate pioneers like Joana, we remind ourselves that with determination, perseverance, and self-confidence, anything is possible, even when the path ahead seems unachievable. "
}