{
    "title": "iRobot Shows Just How Risky Investing in Mergers and Acquisitions Can \nReally Be",
    "date": "1 hour ago",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AMZN/pressreleases/24947874/irobot-shows-just-how-risky-investing-in-mergers-and-acquisitions-can-really-be/",
    "text": "There's an investment tactic on Wall Street called merger arbitrage. It isn't meant to produce eye-catching home runs, instead focusing on getting a lot of reliable singles. On the surface, merger arbitrage seems like it would be easy, but iRobot(NASDAQ: IRBT) and Spirit Airlines(NYSE: SAVE) show it can be harder than it seems. Here's why you need to be careful buying into mergers and acquisitions, noting that United States Steel(NYSE: X) looks like it could be the next pain point for investors. The logic behind merger arbitrage is pretty simple. When one company agrees to buy another company, it usually has to pay a premium for that company's shares. Once the potential for a deal is leaked to Wall Street, the price of the company being acquired normally jumps higher. When a deal is actually announced, the price of the company to be acquired tends to rise right up to, but not actually all the way to, the offer price. Image source: Getty Images. So, there's often a small discount between the market price of a company being bought out and the buyout price. That discount is normally just a percentage point or two, nothing to write home about. But if you buy the shares and the deal is consummated as expected, that small discount turns into an easy profit. Repeat that process enough times and you start to create some real gains. At this point, you might think you could do this just as well as a Wall Street pro. And to some extent, that's true. But there's one small wrinkle here that you need to think about. Why does the discount between the market price and the offer price even exist? The answer is that, sometimes, deals fall through. And when that happens, that fallout can be very, very ugly. Mergers fall apart all the time and in every industry. Take a look at the price chart for technology stock iRobot below. Notice the big price jump at the beginning of the period when Amazon(NASDAQ: AMZN) agreed to buy the robot maker. And then, the stock started to trend lower before dropping drastically toward the end when the deal was called off. The companies strongly hinted that the problem was getting regulatory approval, a fact that weighed on iRobot's stock almost from the very start.  IRBT data by YCharts. As if that's not bad enough, the very same day that the deal was called off, iRobot announced a business overhaul. The list of moves included cost-saving initiatives, reduced research and development spending, and staff cuts, among other things. Simply put, iRobot appears to have been a struggling company that really needed Amazon to buy it or it was going to come under increasing financial strain. If you bought this stock thinking that the Amazon deal was in the bag, you would have found your bag had a giant hole in it. The deal between airlineJetblue(NASDAQ: JBLU) and Spirit Airlines was similar in that Spirit was a struggling company being bought by a stronger one. Spirit shares plunged when that deal was scuttled, largely because regulators appeared unlikely to approve it. Just recently, meanwhile, shares of U.S. Steel fell sharply over concerns that Japanese steel giant Nippon Steel won't receive the regulatory approvals needed to buy the iconic American steelmaker. This is just a quick list of recent deals that have gone or could go wrong. As each of the examples above shows, it simply isn't as easy as it looks to do merger arbitrage. You have to make an assessment of the chances that the deals you invest in will actually be completed as planned. Very often, that is what transpires, but calling one deal wrong could leave you with huge losses. The problems above were all related to regulatory issues, but financing and adverse business or industry developments can also lead to broken merger and acquisition agreements. To be fair, merger arbitrage specialists do more than just buy the stock of the company being acquired. The process can involve shorting shares, buying shares, and even options trades. The added transactions, which materially increase complexity, are mostly meant to protect against the risk of a failed deal. If you like the idea of merger arbitrage, you should check out a specialist like Merger Fund (MERFX), which allows you to invest in a diversified portfolio of merger arbitrage opportunities. Small investors, however, probably shouldn't try this approach on a one-off basis, as the risk/reward balance isn't skewed in your favor nearly as much as you may think. Should you invest $1,000 in iRobot right now? Before you buy stock in iRobot, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and iRobot wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 20, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon and iRobot. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Amazon.com Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}