{
    "title": "Jim Cramer Likes Jeff Bezos' Amazon Over Shopify, But Says It 'Does An \nAbsolutely Terrific Job...Stick By It'",
    "date": "37 minutes ago",
    "url": "https://markets.businessinsider.com/news/stocks/jim-cramer-likes-jeff-bezos-amazon-over-shopify-but-says-it-does-an-absolutely-terrific-job-stick-by-it-1033183610",
    "text": "In a recent segment of CNBC’s “Mad Money,” renowned market commentator Jim Cramer expressed his support for Shopify Inc. (NYSE:SHOP), positioning the company as a strong player in the e-commerce industry along with rival Jeff Bezos‘ Amazon. What Happened: On Wednesday, Cramer gave a nod of approval to Shopify during the Lighting Round segment of CNBC, emphasizing its strong performance with small and medium-sized businesses and comparing it with Amazon. \"I like e-commerce. I like Amazon more than Shopify, but I think Shopify does an absolutely terrific job with small, medium-sized businesses, consumer packaged goods companies. I would stick by it.\" See Also: Whopping $33.8 Million Worth Of Dogecoin Shifted To Robinhood — And People Suspect This Person Could Be Behind It Why It Matters: Cramer’s endorsement comes at a pivotal time for Shopify, following a tumultuous period where the company’s stock experienced a sharp decline after its Q4 performance. Despite surpassing revenue expectations with a 24% year-over-year increase to $2.14 billion, the stock took a hit, which may have been due to concerns over future growth prospects.  Additionally, before the earnings release, there was a sense of caution among analysts regarding Shopify’s valuation. An analyst report highlighted the challenges in justifying the stock’s valuation, suggesting that caution may be warranted. Price Action: As of the latest trading session, Shopify saw its stock price close at $81.33, marking a 4.90% increase from the previous close, according to data from Benzinga Pro. Read Next: Top 4 Tech Stocks That May Collapse In March Photo by Koshiro K on Shutterstock Engineered by Benzinga Neuro, Edited by \nPooja Rajkumari  The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. Indices Commodities Currencies Stocks "
}