{
    "title": "Meet Wall Street's Newest Stock-Split Stock, Along With the Artificial \nIntelligence (AI) Stock Likeliest to Follow in Its ...",
    "date": "2 hours ago",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AMZN/pressreleases/24946754/meet-wall-streets-newest-stock-split-stock-along-with-the-artificial-intelligence-ai-stock-likeliest-to-follow-in-its-footsteps/",
    "text": "Volatility is a given when putting your money to work on Wall Street. Since this decade began, all three major stock indexes have traded off bear and bull markets in successive years. While most investors are probably hoping for an end to this pattern in 2024, it nevertheless speaks to the unpredictable nature of stocks over the short term. Historically, when volatility and uncertainty crop up, professional and retail investors have a tendency to seek out companies that have consistently outperformed in virtually any economic climate. One perfect example of this is investors flocking to the FAANG stocks for more than a decade. But in recent years, it's stocks enacting splits that have been the cream of the crop. Image source: Getty Images. A \"stock split\" is a purely cosmetic event that allows a publicly traded company to alter its share price and outstanding share count. It's cosmetic in the sense that a stock split doesn't change a company's market cap or its operating performance. A forward-stock split can make shares more nominally affordable for retail investors who don't have access to fractional-share purchases with their broker. Conversely, reverse-stock splits are designed to increase a company's share price to ensure continued listing on a major stock exchange. With few exceptions, investors tend to focus on high-flying businesses conducting forward-stock splits. Companies that enact forward splits are usually highly profitable and on the leading edge of the innovative curve within their respective industries. Since the midpoint of 2021, just shy of a dozen high-profile companies have completed forward-stock splits, including Amazon(NASDAQ: AMZN), Tesla(NASDAQ: TSLA), and Walmart(NYSE: WMT). Amazon and Tesla conducted forward splits of 20-for-1 and 3-for-1 in 2022, respectively, while Walmart's 3-for-1 forward-stock split went into effect last month.  AMZN data by YCharts. The reason these businesses have outperformed is because of their well-defined competitive advantages: On Tuesday, March 19, another top-notch company announced that it would joining this exclusive group of stock-split stocks. Image source: Chipotle Mexican Grill. Following the closing bell on March 19, the board of directors of fast-casual restaurant chainChipotle Mexican Grill(NYSE: CMG) announced a 50-for-1 stock split, which is one of the largest forward splits in the history of the New York Stock Exchange. Assuming the split is given the green light by shareholders at the company's annual meeting in June, Chipotle will begin trading at a post-split price on June 26, 2024. Chipotle went public in January 2006 at an initial offering price of $22 per share, but has never split its stock. Shares of the company neared the $3,000 mark shortly after the announcement. A 50-for-1 stock split would reduce Chipotle's share price to just shy of $60 per share, based on where it's trading at the time of this writing. Said Chipotle's chief financial and administrative officer, Jack Hartung, This is the first stock split in Chipotle's 30-year history, and we believe this will make our stock more accessible to employees as well as a broader range of investors. This split comes at a time when our stock is experiencing an all-time high driven by record revenues, profits, and growth. Interestingly, Chipotle's desire to make shares more nominally affordable for its employees echoes what Walmart said when in late January when it announced its 3-for-1 stock split. Chipotle's continued outperformance, which led to this monumental stock split, can be summed up by three catalysts: food quality, its menu, and innovation. With regard to the former, Chipotle has strived to use locally sourced vegetables and responsibly raised meats. Just as grocery stores benefited from the organic food push two decades ago, Chipotle is enjoying exceptional pricing power and increased demand because of its use of fresh ingredients. Secondly, Chipotle tends to keep its menu relatively small. A small menu makes food preparation easier on its staff, which can expedite service times. A limited menu can also lead to more excitement when new food items are introduced. Lastly, innovation has played an important role in the outperformance of Chipotle's stock. A perfect example is the introduction of \"Chipotlanes,\" which are drive-thru lanes specifically designed for mobile orders. Management has done a phenomenal job of improving the operating efficiency of its stores over time. With Walmart completing its split in late February and Chipotle Mexican Grill on track to conduct its first-ever split in late June, it's just a matter of time before another high-quality company joins this exclusive club of stock-split stocks. Given the buzz surrounding artificial intelligence (AI) at the moment, the likeliest candidate to follow in Chipotle's footsteps is semiconductor company Broadcom(NASDAQ: AVGO). Did you think I was going to say Nvidia? Broadcom stock ended the trading session on March 19 at a whopping $1,238 per share. That's up more than 1,800% over the trialing decade. Although Broadcom conducted three stock splits prior to be acquired by Avago in early 2016 (Avago chose to keep the Broadcom name), Avago had never announced any stock splits. AI is a megatrend the likes of which we haven't seen since the advent of the internet. Though estimates are all over the place, researchers at PwC released a report last year that suggested AI could add $15.7 trillion to global gross domestic product by 2030. That's music to the ears of Broadcom. Broadcom's operating performance is liable to be fueled by its Jericho3-AI chip, which the company introduced last spring. Jericho3 has the ability to connect up to 32,000 graphics processing units at once in AI-accelerated data centers. In other words, Broadcom boasts the critical infrastructure that'll be needed to support generative AI solutions and large language model training. In addition to its undeniable AI ties, Broadcom's highly profitable foundation is its wireless chip segment. It's a leading provider of 5G wireless chips used in next-generation smartphones. A steady stream of consumers upgrading their wireless devices to take advantage of faster download speeds has led to a healthy backlog of orders for Broadcom. Although Avago's management team has never pulled the trigger on a stock split, a share price north of $1,200 may be the catalyst needed to make the company's stock more nominally affordable for everyday investors. Should you invest $1,000 in Chipotle Mexican Grill right now? Before you buy stock in Chipotle Mexican Grill, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chipotle Mexican Grill wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 20, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Sean Williams has positions in Amazon. The Motley Fool has positions in and recommends Amazon, Chipotle Mexican Grill, Nvidia, Tesla, and Walmart. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Amazon.com Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}