{
    "title": "Follow The Billionaire Trail: Unveiling The Stocks Shared By Bill Gates And \nOther Tycoons - Microsoft (NA",
    "date": "1/22/2024",
    "url": "https://www.benzinga.com/general/24/01/36717920/follow-the-billionaire-trail-unveiling-the-stocks-shared-by-bill-gates-and-other-tycoons",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Check out these featured investments from Benzinga's Real Estate Offerings Screener. Looking for additional offers? Sign up to get offers directly to your inbox! Bill Gates, currently the eighth richest man in the world with a net worth of over $121 billion, made his fortune from Microsoft Corp. MSFT. Since stepping down as CEO of Microsoft, Gates has invested across several assets to multiply his wealth. Gates's investment portfolio currently holds 75 stocks and is valued at $38.91 billion as of Nov. 14. Several renowned billionaires have also invested in the stocks Gates holds, reflecting the resilience of respective large-cap companies amid the volatile market backdrop. While each billionaire investor has a unique approach, the majority of them have a substantial stake in the biggest tech stocks in the market. These technology giants who have dominated the market have withstood the test of time. As the macroeconomic headwinds, including economic slowdown concerns and uncertainty regarding the rate cut timeline persist, following billionaires' cues might be beneficial. Take a close look at a handful of blue chip stocks that not only appeal to Gates but also capture the attention of fellow billionaires. Gates owns 1.38% of the total outstanding shares of Microsoft. The Magnificent Seven stock dominated the tech space last year, with its strategic investments in OpenAI and the acquisition of Activision Blizzard attracting investors. Shares of Microsoft have risen by over 6% year to date, outperforming the tech-focused Nasdaq Composite index's 2% gains so far this year. The company's growth potential has attracted several other billionaires as well. Billionaire portfolio manager Ken Fisher bought over 560,000 shares of Microsoft in the fiscal third quarter of 2023, bringing his total holdings to approximately 24.9 million shares. Microsoft is the second-largest holding in Fisher's portfolio. Fisher's Fisher Asset Management has over $236 billion in assets under management. Check out these featured investments from Benzinga's Real Estate Offerings Screener. Looking for additional offers? Sign up to get offers directly to your inbox! Steven Cohen, founder and CEO of hedge fund company Point72 Asset Management, also bought over 203,000 shares of Microsoft in the third quarter ended Sept. 30. Cohen owns 2.03 million shares of Microsoft, accounting for 2.18% of his total portfolio. Citadel Founder and CEO Ken Griffin also bought nearly 1.63 million shares of Microsoft in the third quarter, increasing his stake in the tech behemoth by 47.9%. Gates bought approximately 52,815 shares of Apple Inc. AAPL in the third quarter. The Microsoft co-founder joined the Apple bandwagon relatively late, as many billionaires already have significant exposure to the tech giant. Warren Buffett, one of the most influential investors of this generation, considers Apple to be one of his crown jewels, claiming the business is \"better than anything we own.\" Buffett has a 5.9% stake in Apple as he owns over 915 million shares, making it his largest portfolio holding. He last bought Apple shares in the first quarter of 2023. Fisher increased his stake in Apple in the third quarter, scooping up over 878,000 shares. Apple is the largest holding of Fisher Asset Management, accounting for 5.25% of its total portfolio. Concerns regarding slowing demand for Apple's products have caused the stock to plummet this year. Given concerns regarding Apple's sales in China amid tensions between the U.S. and China, the tech giant has been strategically shifting its production base to India. The company aims to produce nearly 25% of its iPhones in the Southeast Asian country. Bank of America upgraded Apple stock to Buy on Jan. 18, issuing a price target of $225. This indicates a potential upside of over 17%. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}