{
    "title": "Move over Apple: Microsoft is now the most valuable publicly traded company",
    "date": "1/13/2024",
    "url": "https://www.ctvnews.ca/business/move-over-apple-microsoft-is-now-the-most-valuable-publicly-traded-company-1.6724651",
    "text": "Microsoft is back on top. After trailing behind Apple for the majority of the past decade, Microsoft is the world’s most valuable publicly traded company as of market close on Friday. The tech giant’s stock (MSFT) closed at US$388.47 a share on Friday, giving it a market capitalization of US$2.89 trillion. Apple’s stock (AAPL) closed at US$185.92 a share, for a market capitalization of US$2.87 trillion. Market capitalization — or market cap — is the total value of all the shares of a publicly traded company. In other words, it’s the market value of the company. Microsoft’s rise to the top comes after the company had a stellar year thanks to its success with generative artificial intelligence. In 2023, the company’s CEO, Satya Nadella, made a multi-billion dollar investment in AI, including commercializing and adding AI tools like ChatGPT into its suite of products before rivals. He even strengthened Microsoft’s ties to ChatGPT maker OpenAI, a major pioneer in the field of artificial intelligence, during a board and leadership upheaval at the smaller company late last year. Apple, meanwhile, is facing a barrage of problems. iPhone sales are slowing in part because of the Chinese government’s reported efforts to restrict purchases (Beijing denies it has put any restrictions in place). That’s helped Chinese smartphone maker Huawei to gain market share. Apple also recently contended with a brief ban from selling the latest Apple Watch models in the United States. Microsoft declined to comment, while Apple did not return CNN’s request for a comment. Salmon farms have long been a point of contention between environmentalists and fish farmers in British Columbia, but a much bigger net is now being cast on the topic.  The Vancouver Canucks weren’t the only ones who stumbled during Thursday night’s game against the Dallas Stars.  After a number of failed IVF rounds, health issues and the death of their beloved dog, a U.S. couple was in need of a change of scenery. They took a short trip to Andalusia, Spain, but neither could have predicted they'd end up relocating there just months later.  Two men from Senegal froze to death were found in the snow of a wooded area close to the Canadian border, New York state police said.  There were no facilities to treat those with mental illness or developmental disabilities in what was then the Alaska territory, so they were sent — often by dog sled, sleigh or stagecoach — to a waiting ship in Valdez. The 2,500-mile (4,000 km) journey ended at Morningside Hospital.  An historic downtown Toronto bar is closing its doors next week after nearly 200 years in business.  Austin Hunter Turner died in 2017, on a night that his mother has rewound and replayed again and again, trying to make sense of what happened.  Not getting enough sleep may cause you to feel five to 10 years older than you really are, according to two new studies.  Ukrainian President Volodymyr Zelenskyy dismissed a longtime aide and several advisers on Saturday in a continuing reshuffle while Russia unleashed fresh attacks overnight.  Niagara Region says it has declared a state of emergency 'out of an abundance of caution' as it prepares for an influx of visitors for next month’s total solar eclipse.  An historic downtown Toronto bar is closing its doors next week after nearly 200 years in business.  Ontario's top doctor is calling on the province to immediately enact policy that will restrict access to alcohol, vapes and cannabis as the number of people who have died or visited a hospital due to using multiple substances has spiked in recent years.  A 17-year-old boy is dead and three youth suspects have been arrested after a stabbing in Prince George, B.C.  An \"indecent offender\" who allegedly exposed himself in view of children last weekend on Vancouver Island was arrested again days later for a similar offence, according to the RCMP.  An Edmonton broadcasting pioneer has passed away.  Dutch police have detained a man who walked out of a nightclub where hostages were being held after a tense hours-long standoff.  U.S. President Joe Biden's reelection campaign is raising gobs of cash. And it has an election-year strategy that, in a nutshell, aims to spend more — and spend faster.  Ukrainian President Volodymyr Zelenskyy dismissed a longtime aide and several advisers on Saturday in a continuing reshuffle while Russia unleashed fresh attacks overnight.  High winds and turbulence have forced a United Airlines flight from Israel to be diverted from its destination of Newark Airport in New Jersey to Stewart International Airport in New Windsor, N.Y..  Manhattan prosecutors suggested Friday that Donald Trump violated a gag order in his hush-money criminal case this week by assailing the judge's daughter and making a false claim about her on social media.  A bus carrying worshippers headed to an Easter festival plunged off a bridge on a mountain pass and burst into flames in South Africa on Thursday, killing at least 45 people, authorities said.  Salmon farms have long been a point of contention between environmentalists and fish farmers in British Columbia, but a much bigger net is now being cast on the topic.  Premier Wab Kinew and federal Conservative Leader Pierre Poilievre met at the Manitoba legislature Thursday afternoon.  The federal government is launching a new loan program to help child-care providers in Canada expand their spaces, and will be extending further student loan forgiveness and training options for early childhood educators, Prime Minister Justin Trudeau announced Thursday.  Ontario's top doctor is calling on the province to immediately enact policy that will restrict access to alcohol, vapes and cannabis as the number of people who have died or visited a hospital due to using multiple substances has spiked in recent years.  Not getting enough sleep may cause you to feel five to 10 years older than you really are, according to two new studies.  A breakthrough discovery made by doctors at the Montreal Children's Hospital about the causes of cerebral palsy is giving new hope to one West Island family.  The range of April Fools' Day marketing pranks gone awry is as varied as their reception. Met with everything from smiles and social media shares to confusion, derision or even fury and falling stocks, the puckish promotional tactic represents a risk that can endear customers to a brand as swiftly as it can sour them on it.  Neuroscientist Emma Duerden says social media can alter children's brains and have negative impacts on their mental health.  A new poll indicates 51 per cent of Canadians support banning the social media app TikTok, after a U.S. bill aiming to do just that passed in the House of Representatives.  A year after her reality TV mega-breakup “Scandoval,” life for “Vanderpump Rules” cast member Ariana Madix is better than ever.  A New Mexico judge on Friday rejected an effort by a movie set armourer to challenge her conviction of involuntary manslaughter in the 2021 fatal shooting of a cinematographer by Alec Baldwin on the set of the Western film “Rust.”  The estate of minimalist contemporary artist Donald Judd filed a lawsuit against Kardashian this week, claiming the fashion and beauty mogul promoted 'cheap knockoffs' of his furniture designs.  If you've been the victim of workplace harassment, it can be difficult to feel you're not alone - and even more difficult to know where to go with a complaint.  Canadian exports of thermal coal increased another seven per cent last year, reaching the highest level in almost a decade.  A federal judge on Thursday ordered Sam Bankman-Fried to repay more than US$11 billion as part of his sentence for defrauding customers and investors in his failed crypto exchange FTX.  After a number of failed IVF rounds, health issues and the death of their beloved dog, a U.S. couple was in need of a change of scenery. They took a short trip to Andalusia, Spain, but neither could have predicted they'd end up relocating there just months later.  An historic downtown Toronto bar is closing its doors next week after nearly 200 years in business.  Luxury operator Regent Seven Seas Cruises is raising their price tag to eye-watering levels, with a suite on an upcoming 140-day world voyage costing US$1.7 million.  Preparations are underway for the gardens of the Versailles Palace to welcome Olympic horse riders and tens of thousands of visitors when it hosts equestrian and modern pentathlon events during this summer's Paris Games.  The St. Paul Saints quickly found out that not everyone was amused by the pig's name, Ozempig, or the team's posting of a backstory about the pig's embarrassment at gaining weight and promise to try to remain trim.  The Toronto Maple Leafs have signed defenceman Simon Benoit to a three-year contract extension.  Infiniti, Nissan’s luxury vehicle division, just revealed a feature in its new full-sized SUV that can allow everyone else in the vehicle to keep listening to whatever they want while the driver takes a phone call and no headphones are needed.  Xiaomi, a well-known maker of smart consumer electronics in China, is joining the country's booming but crowded market for electric cars.  Ontario has among the highest rates for auto insurance premiums in Canada -- just below Alberta and Nova Scotia -- however, the introduction of an insurance reform in the provincial budget could soon lower prices.  A Toronto restaurant introduced a surprising new rule that reduced the cost of a meal and raised the salaries of staff.  The spring allergy season has started early in many parts of Canada, with high levels of pollen in some cities already. Experts weigh in on which areas have it worse so far this season.  It was a typical Tuesday for Mabel Beharrell, 84, until she got the call that would turn her world upside down. Her teenaged grandson was in trouble and needed her help.  B.C. conservation officers recently seized a nine-foot-long Burmese python from a home in Chilliwack.  A New Brunswicker will go to bed Thursday night much richer than he was Wednesday after collecting on a winning lottery ticket he let sit on his bedroom dresser for nearly a year.  The Ontario government is introducing changes to auto-insurance, but some experts say the move is ill-advised.  Newfoundland’s unique version of the Pine Marten has grown out of its threatened designation.  A Toronto man is out $12,000 after falling victim to a deepfake cryptocurrency scam that appeared to involve Prime Minister Justin Trudeau.  It started small with a little pop tab collection to simply raise some money for charity and help someone — but it didn’t take long for word to get out that 10-year-old Jace Weber from Mildmay, Ont. was quickly building up a large supply of aluminum pop tabs.  Salmon farms have long been a point of contention between environmentalists and fish farmers in British Columbia, but a much bigger net is now being cast on the topic.  One person was transported to hospital in serious condition Friday after a crash temporarily closed the Sea to Sky Highway.  Efforts to coax an orphaned whale calf out of a lagoon off Vancouver Island have been paused and fisheries officials are now monitoring the animal from afar until the tidal situation improves, Fisheries and Oceans Canada says.  Toronto Police Service’s (TPS) professional standards unit is investigating after video footage surfaced on social media of several officers arresting a man on a packed TTC subway train.  Niagara Region says it has declared a state of emergency 'out of an abundance of caution' as it prepares for an influx of visitors for next month’s total solar eclipse.  Just like the evil movie exes who can't get over her \"Scott Pilgrim\" alter ego Ramona Flowers, Mary Elizabeth Winstead can't get over Toronto.  The Calgary Police Service is asking for help finding a man who was last seen well over a week ago in Penbrooke Meadows.  Calgary is a top trending Canadian travel destination for those planning adventures for the summer, according to new flight data.  An Easter egg hunt held just outside of Calgary on Good Friday was not just for kids, but also for our furry friends.  As Catholic congregations commemorated Good Friday, one group could be found touring Ottawa’s downtown core, holding a Way of the Cross observance.  The Ottawa Police Service says its fraud unit has been seeing a rise in the numbers of Marketplace scams.  Mild temperatures with sunny skies are in the forecast for the Capital this Saturday.  A breakthrough discovery made by doctors at the Montreal Children's Hospital about the causes of cerebral palsy is giving new hope to one West Island family.  A major fire broke out at the Les Fruits de mer de l'Est du Québec shrimp processing plant in Matane Friday evening.  Future Hall-of-Fame Montreal Canadiens goalie Carey Price's home on Montreal' South Shore has sold for $1.5 million, about $300,000 less that the original asking price.  An Edmonton broadcasting pioneer has passed away.  A new store in Manchester Square is building up the small business community one shelf at a time.  Ottawa must make changes to a self-government deal it struck with the Métis Nation of Alberta, says a Federal Court ruling.  Feed Nova Scotia says ahead of the Easter holiday, many individuals and families are facing food insecurity and festivities can amplify their struggles.  Halifax Regional Police are investigating a robbery that happened Friday night at the Shoppers Drug Mart in the city's Fairview neighbourhood.  The Saint John Police Force are investigating a suspicious vehicle that was seen with a set of red and blue lights displayed in the windshield.  Hundreds of community members marked Good Friday with the 35th annual Public Way of the Cross, presented by the Archdiocese of Winnipeg.  Winnipeg Fire Paramedic Service responded to calls on Selkirk Avenue and Keewatin Street just over six hours apart.  A housing development south of Winnipeg’s Grant Park neighbourhood is one step closer to reality after years of back-and-forth in city hall and court.  The University of Regina’s Hill Business Students’ Society wrapped up their ‘5 Days for the Homeless’ campaign Friday.  As more snow dumps on some parts of the province, Saskatchewan RCMP is reporting poor road conditions.  A Saskatoon mother says the Ministry of Social Services ignored several requests to have black mold removed from her provincial housing corporation home.  It was a busy day at Morty's Pub on Good Friday, as people flocked to the Waterloo hot spot to get their fill of fish and chips.  In a story of discovery and connection, two musicians from southern Ontario have found themselves not just united by music, but by blood, thanks to DNA testing.  Another person has come forward claiming they were not paid what they were owed by Dutchie’s Fresh Market.  Good Friday in Saskatoon brought the Christian community out into the snow for the annual hallmark way of the cross prayer walk for the second time since the pandemic.  As more snow dumps on some parts of the province, Saskatchewan RCMP is reporting poor road conditions.  Heading to the Easter long weekend, the City of Saskatoon along with numerous partners hosted the very first community round dance and feast Thursday evening.  The range of April Fools' Day marketing pranks gone awry is as varied as their reception. Met with everything from smiles and social media shares to confusion, derision or even fury and falling stocks, the puckish promotional tactic represents a risk that can endear customers to a brand as swiftly as it can sour them on it.  A lot of concern and speculation is circulating in the small northern Ontario community of Field on Friday after a massive police search for \"dangerous\" suspects.  Officers in the Parry Sound area started the long weekend with an early morning call about a single-vehicle crash Friday, Ontario Provincial Police say.  After being called to two fires caused by unattended cooking in two days, London fire is spreading the message that, \"Cooking fires are preventable.\"  An investigation by the Ontario Special Investigations Unit has determined is was reasonable for a police officer to shoot her gun at a man in Aylmer, Ont.  The Knights ended the regular season on a seven-game winning streak, reaching the 50-win plateau for the seventh time in franchise history.  More than a hundred kids participated in Drysdale's annual Easter Egg hunt on Good Friday.  Two individuals have been arrested and charged after an impaired driving incident at a local care home in Orillia.  Huronia West OPP is asking for the public's help in identifying a suspect in a Wasaga Beach robbery.  A city committee has backed a new gated entry for a downtown parking lot that has prompted partying complaints.  The Downtown Windsor Farmers’ Market is opening this weekend.  Windsor police responded to a crash on Riverside Drive West on Thursday night.  A Victoria-area business association says the region is at risk of losing more than a quarter of its workforce in the next 12 years unless local municipalities allow greater housing density to provide more affordable homes for workers.  Efforts to coax an orphaned whale calf out of a lagoon off Vancouver Island have been paused and fisheries officials are now monitoring the animal from afar until the tidal situation improves, Fisheries and Oceans Canada says.  Salmon farms have long been a point of contention between environmentalists and fish farmers in British Columbia, but a much bigger net is now being cast on the topic.  A 49-year-old man has been charged with assault, uttering threats and possession of a weapon for a dangerous purpose after an incident in Kelowna Monday night.  A B.C. judge has given the City of Vernon 14 days to make a decision on a business licence application it has left pending without explanation for more than a year.  A protester who unleashed a \"race-based tirade\" outside a vaccination clinic in B.C.'s Okanagan at the height of the COVID-19 pandemic did not cause a criminal disturbance, a judge has ruled.  A Lethbridge policy committee heard a presentation Thursday on the future of the Enmax Centre and the possibility of replacing the facility in years to come.  A Magrath, Alta., grandmother has broken a Guinness World Record for the longest time in an abdominal plank position (female).  The Lethbridge Hurricanes began preparing for their playoff run as soon as their regular season wrapped up last weekend.  Officers in the Parry Sound area started the long weekend with an early morning call about a single-vehicle crash Friday, Ontario Provincial Police say.  A complaint about a 'suspicious' snowmobiler stuck on a trail in northern Ontario has resulted in impaired driving charges against a 43-year-old woman.  You could say 22 Wing/Canadian Forces Base Commander Col. Richard Jolette was born to be in the Royal Canadian Air Force.  Brad Gushue is approaching this year's men's world curling championships like it could be his last.  Roughly 50 children will gather in a St. John’s classroom for the first time on Saturday for unique lessons on Ukrainian language, culture and history.  Newfoundland’s unique version of the Pine Marten has grown out of its threatened designation.  The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. © 2024 \n\n All rights reserved. Use of this Website assumes acceptance of Terms & Conditions and Privacy Policy "
}