{
    "title": "Slack vs Microsoft Teams: Business messaging apps battle it out",
    "date": "1/11/2024",
    "url": "https://www.itpro.com/marketing-comms/business-communications/355389/slack-vs-microsoft-teams-business-messaging-apps",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Slack and Teams are leading business communications apps, but each caters to a different working style The pandemic changed everything. Managers were forced to rethink their opposition to home working, and colleagues discovered that, with the right tools, they could be as productive remotely as they were side by side.  Slack review: Free your business comms Slack and Microsoft Teams were two of the prime beneficiaries in the move to dispersed HQs, and they continue to underpin business today. Being so closely matched, it's not always obvious which is best suited to your needs. We've broken out their key features to see how they stack up. We'll look at core tools, integrations, and price, to help you select the best co-working platform for your business. Chat is the front-and-center feature of each platform. Log in and, unless you've been invited to a video call, it's the first thing you'll see. Channels and participants sit in the sidebar, with conversations taking up the remainder of the window. Both let you sign in to multiple workspaces simultaneously. That means you can keep an eye on notifications from several workgroups, and switch between them to answer questions and contribute to ongoing threads without logging out and back in. Where content isn't relevant across your team or group, each also lets you send and receive direct messages that remain segregated from the wider discussion.  As well as regular text, you can share files, link to external resources, and embed non-core data by integrating third-party applications (see below). They also have presence tools, allowing you to specify that you're away or set a bespoke status so colleagues know whether they're likely to get a swift response. Conversations among large groups can quickly grow, so both Teams and Slack have built-in search tools that quickly and efficiently pull out matches. These save you trawling several months' worth of posts and, more immediately, nascent AI features (see below) will help you catch up on content you've recently missed. Finally, where Slack has the Canvas, Teams has a Whiteboard. Slack's Canvases, which can stand alone or be attached to a conversation, are places to store assets relevant to an ongoing conversation, giving everyone a single point of reference. Teams' Whiteboards are subtly different. While colleagues can collaborate on a single Whiteboard to share files, images, text, and so on, they can also sketch on it directly. Teams also has Loop, which is a system of components that you can add to a chat, to which everyone can contribute. It could be a table or a list, for example, which you use to collect input from across your workforce.  Slack and Teams are equally matched here. They take a simple feature – chat – and improve upon the consumer-grade instant messaging tools that we'd otherwise have to rely on. If this is all you used them for, you'd be well served – but you'd also be missing out on some of their most compelling features. Keyboard chat is best for conversations that need to be archived, situations where you need an audit trail, or when a discussion is ongoing. However, when you need a quick answer, a voice or video call is often more efficient, so it's no surprise that both platforms integrate live media. In Slack, all calls (\"Huddles\") start as voice-only, within which participants can enable cameras and share screens. Calls can be initiated from inside a channel, or by clicking in the sidebar. Up to 50 participants can take part in a call on a paid plan, but if you're signed up to the free tier, that number is trimmed to two. Anything shared during a call, be it a message, link, document, and so on, is saved for future reference. If you don't want to place a call, Slack lets you do the equivalent of sending a voice message, with Clips. These are audio or video files, up to five minutes long, which are embedded in the ongoing thread for teams to play back when convenient. You can record them in the Slack client, so you don't need to switch to an external app.  Microsoft Teams review: A no-brainer for Microsoft shops Teams is a little more generous when it comes to voice and video meetings, allowing free plan users to call up to 100 people for a maximum of 60 minutes at a time. Calls can be initiated from within a chat or by typing /calling in the command box at the top of the window. You can share your whole screen when in a meeting or if you're giving a presentation, use PowerPoint Live, which displays your deck to other participants but shows you the presenter view that you'd work with if you were giving the presentation while connected to an external display. This way, you can see your upcoming slides and, perhaps more importantly, your presenter notes. It's possible to place calls to people not in your workspace through direct dialing. In Teams, this feature is built-in but must be enabled at the organization level. In Slack, it's achieved through the use of integrations. We feel Teams has the edge here. The free tier lets you make calls with larger groups of people and PowerPoint Live brings the best features of in-point presenting to the digital realm. Both Slack and Teams have the potential to sit at the heart of your organization's workflow. That's because they each integrate with third-party applications to significantly extend the base offering. Integrating third-party tools reduces the need to switch between applications, helping team members stay focused.  You can integrate up to 10 applications on Slack's free tier, and an unlimited number if you're on a paid subscription. There are more than 2600 to choose from in the Slack App Directory, you can build your own workflows, and there's an API to craft custom apps specific to your organization. Slack claims that more than 650,000 customized apps are used on its platform every week. Teams is linked to Microsoft AppSource, which includes more than 2100 add-ons (for Teams specifically) at the time of writing. Although this is slimmer picking than Slack offers, it does include business essentials, like Trello, RingCentral, Lucidchart, and Salesforce, the latter of which owns Slack. Organizations with the necessary skills can also produce their own apps – or contract out if they don't have the talent in-house.  On numbers alone, Slack wins here, with almost 20% more apps in its associated store. Two surprising absentees from AppSource are Teams connections to Dropbox and Google Drive, which do appear in the Slack App Directory. If the two are still evenly matched on your own tick-list, go through each store and check whether the apps on which you rely are included. Both services are available on a wide range of platforms. Teams has apps for Android, iOS, Windows, and macOS, although its Linux application disappeared in 2022. Slack continues to support Linux with a dedicated app, alongside Windows, macOS, iOS, and Android, although as of March 2002, it no longer supports Fedora Linux distributions. We find this surprising as Red Hat Enterprise Linux, which is one of the two named distros it does support (the other being Ubuntu LTS) draws code from the Fedora Project.  Discover how you can increase profitability and improve organizational resilience\n\nDOWNLOAD NOW Recognizing that business frequently takes place in the browser, they're both available as web versions. This is a handy workaround for users of either service who are tied to a Chromebook, as well as for Linux-based Teams users. Browser support, while good, isn't complete in either case. Teams don't support audio and video calling or screen sharing in Firefox (bad news again for Linux users for many of whom Firefox is the default browser), or to degrees in various releases of Safari on macOS. Slack huddles (calls) are officially only supported on Firefox and Chrome, which could be bad news for Edge and Safari users if taken literally, although we did manage to run a huddle in Opera which, although Chromium-based, isn't Chrome in the truest sense of the word. Slack has the edge here, as its Linux client opens it up to a wider range of platforms. However, as Linux still only claims about 3% of the desktop market, there's very little to separate the two. Unless you're a Linux user, platform support is unlikely to greatly influence your decision. AI is the buzzword that UCaaS platforms can't ignore. Slack AI is slated to appear this winter, with a waiting list currently taking applications. When it rolls out, it should help new arrivals and latecomers to catch up with channel activity by summarising missed threads. Slack's suggested use case is within support teams bringing on experts who need to quickly get up to speed to help resolve an ongoing issue. Separately, users will be able to generate channel highlights, identify themes, and ask natural language questions, which Slack will answer with reference to content in the workspace. This latter option is particularly interesting since, as a supplement to the existing search function, it should theoretically save a lot of clicking and scrolling in busy channels that might otherwise turn up a raft of similar answers. Microsoft has integrated Copilot into Teams. Again, you can ask it to draw out specific information from chats, which can help colleagues spread across time zones catch up with interactions they missed when they weren't working. It performs a similar trick in meetings with transcription enabled, and for late joiners, there's an option to see a summary of what's been missed. You can ask it where participants agree or disagree on a topic, which could be a neat way of rounding out a meeting and providing discussion points for the next agenda. In either case, it's too early to say how the integrated AI tools will develop, and although Microsoft may have more to show right now, we can't yet test what Slack has to offer. By the time you read this, that may have changed but, at the time of writing, we can't award this either way. Teams has a significant advantage here, in that it sits within an ecosystem of complementary products. Where Slack has to sell itself as a stand-alone service – albeit one that can integrate with third-party apps – Teams is available as part of Microsoft 365, which will inevitably make it a tempting proposition for existing users. Slack's paid plans start at £5.75 per active user, per month (and active means just that: Slack will monitor usage and rebate you pro-rata for any team members who aren't using your workspace). With a paid plan you can integrate an unlimited number of third-party apps, get access to the workflow builder, make calls between up to 50 users, implement OAuth sign-in with Google, and control how data is retained (but not necessarily where, as you need to upgrade to Business+ for data residency controls). You also get round-the-clock support. Teams Essentials is a little over half the price of Slack's entry-level tier. For £3.30 per user per month, you get unlimited group meetings of up to 30 hours per session, with up to 300 participants apiece; unlimited chat with co-workers and customers; live captions in meetings, so long as you're using English; Microsoft Whiteboard integration, plus integration with collaborative apps; meeting transcripts; and access to the web versions of Word, Excel, and PowerPoint. Teams looks like the more enticing deal overall, particularly if your business already subscribes to Microsoft 365. Note that neither of these entry-level paid plans includes an uptime guarantee. If that's an important consideration, you'll need to sign up for Teams Basic, at £4.90 per user per month, or Slack Business+, at £9.75 per active user per month. Each platform also supports a free tier, and they're so generous that for many small businesses, they will provide all the tools you need. Sign up for Teams free and you can join an unlimited number of one-on-one meetings for up to 30 hours apiece, or an unlimited number of group meetings, each lasting up to an hour. Group meetings can accommodate 100 or fewer participants; you can share files, create polls, and track tasks; and there's no cap on the number of customers and coworkers you chat with through the browser or client. On Slack Free, you're limited to 10 third-party app integrations, and your voice and video calls are strictly point-to-point. As with Teams, you can chat with external users, but this requires Slack Connect, so your external contact will need to be signed up to a Pro plan (or better) and you'll have to conclude your negotiations within 90 days if you don't want to take out a paid subscription yourself. Slack and Teams are formidable collaboration platforms, that facilitate both remote and side-by-side working by consolidating what were once discrete functions – messaging, file sharing, calling, and more – into a single interface. Use either and staff will spend less time switching between apps while, behind the scenes, the administrative burden is reduced as admins can contract to a single supplier with everything residing in the cloud. In truth, there's little to choose between them, although by breaking them down, differences do start to appear. For businesses in which some staff use Linux, Slack is the more tempting proposition, even if the majority of the workforce is tied to Windows or macOS. However, for organizations already signed up to Microsoft 365, Teams looks like better value, it has the edge where the free offerings are concerned and, if you're not yet tied to either platform but willing to take out a paid sub, it does appear to offer more for your money there, too. Ultimately, that pushes it ahead, but with each platform continuing to innovate and AI becoming increasingly important in UCaaS, we'll be keeping an eye on both to see what happens next. Receive our latest news, industry updates, featured resources and more. Sign up today to receive our FREE report on AI cyber crime & security - newly updated for 2023. Nik Rawlinson is a journalist with over 20 years of experience writing for and editing some of the UK’s biggest technology magazines. He spent seven years as editor of MacUser magazine and has written for titles as diverse as Good Housekeeping, Men's Fitness, and PC Pro. Over the years Nik has written numerous reviews and guides for ITPro, particularly on Linux distros, Windows, and other operating systems. His expertise also includes best practices for cloud apps, communications systems, and migrating between software and services. 2024 Strategic Imperative: Intelligent content delivery for channel-less commerce How Lush aligned its disjointed customer support operations Why Python is the programming language of choice for AI developers Posted Posted Posted Posted IT Pro is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}