{
    "title": null,
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/qdrant-vector-database-announces-availability-140000575.html",
    "text": "Berlin, Germany--(Newsfile Corp. - January 17, 2024) - Qdrant, the leading high-performance, open-source vector database, today announced the availability of Qdrant Cloud on Microsoft Azure, empowering developers with enhanced capabilities in similarity search, recommendation systems, anomaly detection, and data retrieval. Qdrant's open-source vector database, known for its ability to handle billions of vectors, is now integrated into the Microsoft Azure cloud ecosystem allowing businesses to leverage Qdrant's powerful vector database solution for their AI products with the reliability and global scale of Microsoft Azure. \"We are excited to bring the Qdrant vector database to the Microsoft Azure cloud platform. This partnership is an important milestone in our mission to enable our customers to build enterprise-grade AI solutions at scale and to provide unparalleled performance and efficiency in managing vector data workloads. Microsoft Azure's robust platform complements our solution, ensuring a seamless experience for our users at scale,\" - André Zayarni, CEO & Co-Founder, Qdrant. \"With the landscape of AI being complex for most customers, Qdrant's ease of use provides an easy approach for customers' implementation of RAG patterns for Generative AI solutions and additional choices in selecting AI components on Azure,\" - Tara Walker, Principal Software Engineer at Microsoft. Enterprises like Bosch can now use the power of Microsoft Azure to host Qdrant, unleashing unparalleled performance and massive-scale vector search. \"With Qdrant, we found the missing piece to develop our own provider independent multimodal generative AI platform at enterprise scale,\" - Jeremy Teichmann (AI Squad Technical Lead & Generative AI Expert), Daly Singh (AI Squad Lead & Product Owner) - Bosch Digital. Key Features and Benefits: Rapid Application Development: Deploying a cluster on Microsoft Azure via the Qdrant Cloud console only takes a few seconds and can scale up as needed, giving developers maximal flexibility for their production deployments. Billion Vector Scale: Seamlessly grow and handle large-scale datasets with billions of vectors by leveraging Qdrant's features like vertical and horizontal scaling or binary quantization with Microsoft Azure's scalable infrastructure. Unparalleled Performance: Qdrant is built to handle scaling challenges, high throughput, low latency, and efficient indexing. Written in Rust makes Qdrant fast and reliable even under high load. See benchmarks. Versatile Applications: From recommendation systems to similarity search, Qdrant's integration with Microsoft Azure provides a versatile tool for a diverse set of AI applications. About Qdrant:Qdrant is the leading, high-performance, scalable, open-source vector database and search engine, essential for building the next generation of AI/ML applications. Qdrant is able to handle billions of vectors, supports the matching of semantically complex objects, and is implemented in Rust for performance, memory safety, and scale. Contact: André ZayarniCEO & Co-Founder, Qdrant press@qdrant.com To view the source version of this press release, please visit https://www.newsfilecorp.com/release/194198 "
}