{
    "title": "With 72% ownership in Microsoft Corporation (NASDAQ:MSFT), institutional \ninvestors have a lot riding on the business",
    "date": "1/14/2024",
    "url": "https://simplywall.st/stocks/us/software/nasdaq-msft/microsoft/news/with-72-ownership-in-microsoft-corporation-nasdaqmsft-instit",
    "text": "Stock Analysis To get a sense of who is truly in control of Microsoft Corporation (NASDAQ:MSFT), it is important to understand the ownership structure of the business.  And the group that holds the biggest piece of the pie are institutions with 72% ownership.   That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn). Last week’s 5.6% gain means that institutional investors were on the positive end of the spectrum even as the company has shown strong longer-term trends.  One-year return to shareholders is currently 64% and last week’s gain was the icing on the cake. Let's delve deeper into each type of owner of Microsoft, beginning with the chart below. View our latest analysis for Microsoft Many institutions measure their performance against an index that approximates the local market. So they usually pay more attention to companies that are included in major indices. As you can see, institutional investors have a fair amount of stake in Microsoft.  This implies the analysts working for those institutions have looked at the stock and they like it. But just like anyone else, they could be wrong.  When multiple institutions own a stock, there's always a risk that they are in a 'crowded trade'. When such a trade goes wrong, multiple parties may compete to sell stock fast. This risk is higher in a company without a history of growth. You can see Microsoft's historic earnings and revenue below, but keep in mind there's always more to the story. Investors should note that institutions actually own more than half the company, so they can collectively wield significant power.    Hedge funds don't have many shares in Microsoft.      Looking at our data, we can see that the largest shareholder is The Vanguard Group, Inc. with 8.7% of shares outstanding.       Meanwhile, the second and third largest shareholders, hold 7.2% and 3.9%, of the shares outstanding, respectively. Our studies suggest that the top 25 shareholders collectively control less than half of the company's shares, meaning that the company's shares are widely disseminated and there is no dominant shareholder. While studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance.   There are plenty of analysts covering the stock, so it might be worth seeing what they are forecasting, too. While the precise definition of an insider can be subjective, almost everyone considers board members to be insiders.  Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO. Insider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances. Our most recent data indicates that insiders own less than 1% of Microsoft Corporation.   It is a very large company, so it would be surprising to see insiders own a large proportion of the company. Though their holding amounts to less than 1%, we can see that board members collectively own US$1.0b worth of shares (at current prices).  Arguably recent buying and selling is just as important to consider. You can  click here to see if insiders have been buying or selling. The general public, who are usually individual investors, hold a 28% stake in Microsoft.   While this group can't necessarily call the shots, it can certainly have a real influence on how the company is run. While it is well worth considering the different groups that own a company, there are other factors that are even more important.    Take risks for example - Microsoft has   1 warning sign   we think you should be aware of. If you are like me, you may want to think about whether this company will grow or shrink. Luckily, you can check this free report showing analyst forecasts for its future. NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures. Find out whether Microsoft is potentially over or undervalued by checking out our comprehensive analysis, which includes fair value estimates, risks and warnings, dividends, insider transactions and financial health. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Microsoft Corporation develops and supports software, services, devices and solutions worldwide. Flawless balance sheet with solid track record. Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. "
}