{
    "title": "Microsoft Teams releases new in-meeting UI share feature",
    "date": "1/15/2024",
    "url": "https://windowsreport.com/microsoft-teams-meeting-share-update/",
    "text": "Follow us Share this article Latest news 2 min. read Updated on January 15, 2024 updated on \n\nJanuary 15, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more Key notes Microsoft has finally made it happen after continuous testing and coming up with better ways to improve the in-meeting share experience. This new feature makes it much more easier to find what you are looking for and share it. Instead of this option being on the bottom left of your screen, it is now located on the top right menu. This new addition comes shortly after Teams already received the Webinar tool, earlier this moth. You can still share everything you already could with the old version, the major change being, as we mentioned above, that Microsoft made it a lot easier for users to find and share their desired content. When you click the new share button, located on the top menu, the dropdown will provide easy access to all the different screens that are available for sharing. As you can observe in the picture above, you have multiple sharing options. By selecting the first one, which is Screen, you allow all participants to the meeting to view your entire screen. When you click on Window, you will see a list of all the windows you have open, and you can choose which one you want to share with the others. You can also share PowerPoint files and, thanks to a new option added by Microsoft, you are able to Include computer sound. Further more, you now have the ability to share InVision’s content with the members of the call. What Microsoft is, most likely, working on now is an update that will fix the latency issues that some users have confirmed to deal with while in-meeting. The tech giant also promised new features for the Android and iOS versions of the app as well and we could see them hit live in the upcoming months. Have you tried the new UI share experience in Microsoft Teams? If so, tell us what you think about it in the comments section below. And if you happen to like the idea of finding Teams Meetings notifications in the Start Menu, take a closer look at our dedicated guide right away. More about the topics: Microsoft Teams Vlad Turiceanu Windows Editor Passionate about technology, Windows, and everything that has a power button, he spent most of his time developing new skills and learning more about the tech world.\nComing from a solid background in PC building and software development, with a complete expertise in touch-based devices, he is constantly keeping an eye out for the latest and greatest! Vlad Turiceanu Windows Editor Coming from a solid background in PC building and software development, he's a Windows 11 Privacy & Security expert. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}