{
    "title": "Microsoft, others helping small businesses capitalize on AI",
    "date": "1/29/2024",
    "url": "https://omaha.com/article_be5315ed-caa8-5535-b27e-39666d0238d0.html",
    "text": "Get local news delivered to your inbox! New Windows PCs from OEMs like Dell and HP will begin shipping with a dedicated Copilot key on their keyboards, starting later this month. Microsoft's AI assistant Copilot, which is powered by OpenAI, is currently accessible on Windows 10 and 11 PCs by pressing Windows key + C. Microsoft see… NEW YORK — The influx of generative artificial intelligence software is transforming small businesses. Small business owners are using A.I. tools like OpenAI's ChatGPT, Google's Bard and others to check grammar in emails, punch up marketing copy and research business plans. What's more, bigger companies are developing tools specifically to help small businesses integrate A.I. into their operations in more advanced ways. A logo of Microsoft is displayed Jan. 15 during an event at the Chatham House think tank in London. Microsoft's Copilot lets users ask software to perform tasks like summarize an email or a Teams meeting, come up with key themes in a document, or draft emails in a conversational tone in Outlook. The service, which costs $30-a-month per employee, was recently expanded from companies with at least 300 employees to all companies, so smaller businesses — even “solopreneurs” with no employees — can use Copilot for Microsoft 365. Meanwhile, MasterCard is piloting a product called MasterCard Small Business A.I., aimed at helping small business owners analyze data and offer other resources to help grow their business. It uses information from MasterCard's content library as well as information licensed from media companies focused on inclusivity, including digital media company Blavity Media Group and Spanish-language media company TelevisaUnivision, to answer small business owners' queries. Mastercard plans to pilot the tool in the U.S. later this year, with international markets to follow. Artificial intelligence is having a moment. From San Francisco's self-driving cars to the proliferation of deepfake photos depicting everyone from Donald Trump to Pope Francis, AI is virtually everywhere you look—for better or worse. The technology represents huge potential for medical breakthroughs and revenue generation for companies; it also stands to displace workers in certain industries while making authenticity harder to come by and scams easier to pull off. AI works by training computer systems to combine data with algorithms. Over time, as more data is available, AI learns from the additional inputs and changes its algorithms or outputs. For example, self-driving cars in San Francisco build maps of the city and rely on sensors to gather data about the streets to make each drive more seamless. Generative AI—the source of those deepfake photos, for one—creates images, text, and other media by extrapolating from available models. AI technology is developing quickly, and businesses are simultaneously scrambling to adopt it: a scenario offering the potential for massive success, but also significant missteps. Companies have quickly come to rely on AI for tasks like data collection, chatbots, writing news stories, and recommending products based on consumers' preferences. Across the world, 42% of organizations are exploring AI's capabilities, while another 35% are already using AI in some way, according to the IBM Global AI Adoption Index 2022. Most often, revenue increases driven by AI are moderate—at least 5% in 2021, according to 2022's McKinsey Global Survey on AI—but in some cases, companies attribute revenue increases of more than 10% to AI adoption. Freshworks ranked five areas where AI drives the most revenue for companies based on an analysis of McKinsey's survey of 1,492 participants representing a diverse range of locations, industries, company sizes, functional specialties, and tenures. More about the research can be found here. For each sector, we've provided the percentage-revenue increase businesses experienced. Keep reading to see where AI represents the biggest value-add for companies around the world.  - Of organizations that adopted AI in supply chain management, 59% saw revenue growth as a result. That includes: --- 28% saw revenues increase by 5% or less --- 17% saw revenues increase by 6-10% --- 14% saw revenues increase by more than 10% - Among these organizations, 52% also said AI lowered costs in this function. The COVID-19 pandemic laid bare multiple existing vulnerabilities in the supply chain. These failpoints—including insufficient tracking and management of demand and inventory, shipping backlogs, and staff shortages—were exacerbated by shutdowns. AI is already optimizing supply-chain management by forecasting demand, predicting and tracking changes in material costs, monitoring compliance, and estimating the shipping speed from factory to customer. - Of organizations that adopted AI in manufacturing, 61% saw revenue growth as a result. That includes: --- 33% saw revenues increase by 5% or less --- 18% saw revenues increase by 6 to 10% --- 10% saw revenues increase by more than 10% - Among these organizations, 42% also said AI lowered costs in this function. Manufacturers increasingly rely on AI—specifically machine learning, which involves spotting patterns in data for making predictions—to anticipate maintenance needs, provide greater efficiency, and forecast demand. According to MIT Sloan School of Management, generative AI can help manufacturers detect defects, digitize maintenance tasks such as writing instruction manuals, and overall reduce and eliminate tedious or repetitive tasks to increase productivity. These tech solutions may help manufacturers be more nimble and cost-effective by reducing waste or raising yields. - Of organizations that adopted AI in strategy and corporate finance, 65% saw revenue growth as a result. That includes: --- 41% saw revenues increase by 5% or less --- 16% saw revenues increase by 6 to 10% --- 8% saw revenues increase by more than 10% - Among these organizations, 43% also said AI lowered costs in this function. AI stands to revolutionize corporate finance by interpreting a high volume of complex data quickly, making decisions based on that data, identifying trends, and making predictions. Companies can take a hybrid approach, relying on more traditional human analysis for some things while leveraging automation and AI to supplement that work. However, companies have been slow to adopt AI for these means: McKinsey's survey found that just 7% of respondents use AI in strategy or financial planning, compared to 25-30% in marketing, supply chain, and service operations. - Of organizations that adopted AI in marketing and sales, 70% experienced revenue growth as a result. That includes: --- 41% saw revenues increase by 5% or less --- 20% saw revenues increase by 6 to 10% --- 9% saw revenues increase by more than 10% - Among these organizations, 28% also said AI lowered costs in this function. AI can make phone calls, send messages, and offer online customer support in the form of chatbots. Generative AI can boost marketing and sales by devising personalized messages tailored to customers' interests and behaviors or producing first drafts for ads, headlines, slogans, social media posts, and product descriptions. Safeguards are necessary, however, to ensure the AI does not plagiarize, violate copyrights, or produce copy with inaccuracies. - Of organizations that adopted AI in product and/or service development, 70% experienced revenue growth as a result. That includes: --- 33% saw revenues increase by 5% or less --- 24% saw revenues increase by 6 to 10% --- 13% saw revenues increase by more than 10% - Among these organizations, 30% also said AI lowered costs in this function. Generative AI has been a boon for product development, whether being tapped for fresh ideas or to create realistic digital prototypes. According to a 2020 report by McKinsey, generative AI used for product development at all phases has the potential to save costs on materials and time. It allows product developers to test out new shapes and design ideas while evaluating their manufacturability. As with other sectors, AI functions most seamlessly in tandem with its human counterparts. In product development, it can jog industry experts out of tired thinking and help inform companies' key performance indicators. Machines can also now take an initial design, analyze the data it is based on, and offer modifications; suggest the best materials based on cost and performance specifications; and estimate production costs more accurately based on various materials and other criteria. Story editing by Nicole Caldwell. Copy editing by Kristen Wegrzyn. Photo selection by Clarese Moller. This story originally appeared on Freshworks and was produced and distributed in partnership with Stacker Studio. Get local news delivered to your inbox! New Windows PCs from OEMs like Dell and HP will begin shipping with a dedicated Copilot key on their keyboards, starting later this month. Mic…  Get up-to-the-minute news sent straight to your device. "
}