{
    "title": "How to disable the Windows 10 welcome screen after updates",
    "date": "2/16/2024",
    "url": "https://mspoweruser.com/disable-windows-10-welcome-screen-updates/",
    "text": "Follow us Share this article Improve this guide 2 min. read Updated on February 16, 2024 updated on \n\nFebruary 16, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more With the Windows 10 Creator’s Update rolling out from last week, there’s a long install period followed by an welcome screen with Microsoft’s highlighted features. Not everyone is a fan of those welcome pages, indeed some people just plan to use Windows as they used it before, which is how their grandfathers used it and how their children will use it – as a chrome and office launcher. Others may already know all these features, and so it isn’t important to get them highlighted. Microsoft has stealthily added an option to disable the welcome screen from the Creators Update onwards. So while you won’t be able to use it now from, it’ll take effect from the Fall Creators Update onwards for a regular user, and on Insider builds for Insiders. You should no longer get the welcome screen that accompanies Windows Feature Updates on first boot. After all, if you really want to know what’s new, we’ll tell you. And if you want to stop updates overall, check out this guide on how to turn off Windows updates. More about the topics: how to, tip, windows, windows 10 Michael Allison Senior Editor Senior editor at @MSpoweruser. Writes about all Windows 10, Skype, Surface, Edge. Also covers social media news. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Michael Allison Senior Editor Senior editor at @MSpoweruser. Writes about all Windows 10, Skype, Surface, Edge. Also covers social media news. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}