{
    "title": "3 \"Magnificent Seven\" Stocks Billionaires Are Selling, and the 1 They Can't \nStop Buying",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/news/3-magnificent-seven-stocks-billionaires-100600606.html",
    "text": "Since the beginning of 2023, investors have enjoyed a true running of the bulls on Wall Street. The iconic Dow Jones Industrial Average and broad-based S&P 500 galloped to fresh highs, while the growth-driven Nasdaq Composite ended the previous week a stone's throw from eclipsing its November 2021 record-closing high. While I'd love to tell you that this has been a broad-driven rally, the emergence of a new bull market is the result of outsized returns from the \"Magnificent Seven.\" When I say Magnificent Seven, I'm referring to some of the largest, most influential businesses on Wall Street: Microsoft (NASDAQ: MSFT) Apple (NASDAQ: AAPL) Nvidia (NASDAQ: NVDA) Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) Amazon (NASDAQ: AMZN) Meta Platforms (NASDAQ: META) Tesla (NASDAQ: TSLA) These are seven innovation-driven businesses that offer an abundance of competitive advantages. Examples include Alphabet's virtual monopoly in internet search with Google; Microsoft's continued dominance with its Windows operating system; Tesla's position as North America's leading electric vehicle manufacturer; Amazon's dominant e-commerce marketplace; and Meta's top social media assets, which attract nearly 4 billion active users each month. While the outperformance of the Magnificent Seven isn't lost on Wall Street, its most successful money managers have very different outlooks on these top-tier stocks, as evidenced by the latest round of 13F filings. A 13F allows investors to see what Wall Street's brightest minds bought and sold in the latest quarter. Based on 13Fs for the December-ended quarter, three Magnificent Seven stocks were given the heave-ho by billionaire investors, while another was aggressively purchased. The first Magnificent Seven stock that was sent to the chopping block in the fourth quarter is social media giant Meta Platforms. A half-dozen billionaire money managers lightened their respective fund's stakes in the parent of Facebook, Instagram, and WhatsApp, including (total shares sold in parentheses): Jeff Yass of Susquehanna International (3,037,082 shares) Chase Coleman of Tiger Global Management (1,430,767 shares) Philippe Laffont of Coatue Management (542,399 shares) Steven Cohen of Point72 Asset Management (371,850 shares) Israel Englander of Millennium Management (307,709 shares) David Tepper of Appaloosa Management (100,000 shares) The most logical reason for billionaires to be wary of Meta is the likelihood of a U.S. recession taking shape in 2024. Meta generates almost 98% of its revenue from advertising on its social media platforms, and it's perfectly normal for advertisers to reduce their spending during periods of economic weakness. A recession would hurt Meta's sales and its ad-pricing power in the short run. The other potential concern for billionaires might be Meta's valuation. Shares of the company have more than quintupled in value from their 2022 bear market low. Billionaires selling could represent simple profit-taking, or perhaps signal that top asset managers anticipate a short-term pullback in Meta stock. However, the interesting thing about Meta is that it's still historically cheap, even after its run-up. Shares of the company are valued at 12.6 times forecast cash flow in 2025, which represents a nearly 20% discount to its average price-to-cash-flow multiple over the trailing-five-year period. A second Magnificent Seven stock that got the boot from billionaire asset managers in the December-ended quarter is Alphabet. The parent of internet search engine Google, streaming platform YouTube, and cloud infrastructure service platform Google Cloud saw seven billionaires sell its stock, including (total shares sold in parentheses for Alphabet's Class A shares, GOOGL): Philippe Laffont of Coatue Management (3,302,342 shares) Stephen Mandel of Lone Pine Capital (3,113,001 shares) Chase Coleman of Tiger Global Management (1,278,300 shares) Dan Loeb of Third Point (900,000 shares) Ken Griffin of Citadel Advisors (806,651 shares) Terry Smith of Fundsmith (571,317 shares) Steven Cohen of Point72 Asset Management (236,969 shares) Similar to Meta, the exodus among billionaires from Alphabet may have to do with concerns about the health of the U.S. economy. A few money-based metrics and predictive indicators have been blaring warnings that U.S. economic activity could weaken. Alphabet brought in about 76% of its net sales in 2023 from advertising on Google search, Google Network, and YouTube. And just like Meta, the selling doesn't seem to make much sense. In addition to periods of growth disproportionately outlasting recessions, Alphabet's Google accounts for more than 91% of worldwide internet search share, as of January. In fact, you have to look back nearly nine years to find the last time a month went by where it didn't account for at least 90% of global internet search. Alphabet's ad-pricing power is practically unsurpassed. Alphabet also completed its first year of operating profitability from its high-margin cloud infrastructure services segment. Google Cloud has gobbled up a 10% share of global cloud infrastructure service spending and shouldn't have any trouble meaningfully increasing its cash flow in the years to come. The third Magnificent Seven stock that had billionaires willingly pressing the sell button during the fourth quarter is the infrastructure backbone of the artificial intelligence (AI) movement, Nvidia. All told, eight billionaires were sellers of the hottest megacap stock on Wall Street, including (total shares sold in parentheses): Israel Englander of Millennium Management (1,689,322 shares) Jeff Yass of Susquehanna International (1,170,611 shares) Steven Cohen of Point72 Asset Management (1,088,821 shares) David Tepper of Appaloosa Management (235,000 shares) Philippe Laffont of Coatue Management (218,839 shares) Chase Coleman of Tiger Global Management (142,900 shares) David Siegel and John Overdeck of Two Sigma Investments (30,663 shares) One of the prime reasons billionaire investors may have rushed for the exit is growing graphics processing unit (GPU) competition. Not only is Nvidia going to fend off increasing competition from external competitors like Advanced Micro Devices and Intel, but many of Nvidia's top customers are developing their own AI chips, including Microsoft and Meta Platforms. There's also a real possibility that Nvidia could cannibalize its own gross margin as it expands its production of A100 and H100 AI-GPU chips. A modest increase in cost of revenue compared to an 86% jump in sales through the first nine months of fiscal 2024 (Nvidia's fiscal year ended in late January) pretty clearly demonstrates how powerful Nvidia's pricing power has been. Once this GPU scarcity wanes, its gross margin is liable to decline. Lastly, every next-big-trend over the past three decades has worked its way through an early-stage bubble. History suggests that investors will overestimate the uptake of AI, just as they have with every previous next-big-thing trend for 30 years. There was, however, one Magnificent Seven stock that didn't have billionaires abandoning ship. During the December-ended quarter, eight billionaires gobbled up shares of e-commerce company Amazon, including (total shares purchased in parentheses): Ken Griffin of Citadel Advisors (4,321,477 shares) Jim Simons of Renaissance Technologies (4,296,466 shares) Chase Coleman of Tiger Global Management (947,440 shares) Ken Fisher of Fisher Asset Management (888,369 shares) David Siegel and John Overdeck of Two Sigma Investments (726,854 shares) Steven Cohen of Point72 Asset Management (462,179 shares) Israel Englander of Millennium Management (85,532 shares) The lure of Amazon for billionaires is that its business isn't as reliant on e-commerce as you might think. Although e-commerce accounts for a sizable percentage of Amazon's sales, online retail sales are low margin. If the U.S. economy were to stumble and online retail sales tapered off, it won't have much impact on Amazon's cash flow. By comparison, the company generates the lion's share of its operating income from its cloud infrastructure services platform Amazon Web Services (AWS). AWS was responsible for close to a third of global cloud infrastructure service spending in the third quarter of 2023. As long as AWS continues to grow by a double-digit percentage, Amazon's cash flow can motor substantially higher. Despite a huge rally in its share price, Amazon remains inexpensive, relative to its cash flow. The reason I'm using cash flow, as opposed to the traditional price-to-earnings ratio, is because Amazon reinvests most of its operating cash flow back into its business. After ending every year of the 2010s at a multiple of between 23 and 37 times its cash flow, Amazon shares can be picked up right now for a little over 12 times forecast cash flow in 2025. Should you invest $1,000 in Meta Platforms right now? Before you buy stock in Meta Platforms, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 20, 2024 Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Sean Williams has positions in Alphabet, Amazon, Intel, and Meta Platforms. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short February 2024 $47 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. 3 \"Magnificent Seven\" Stocks Billionaires Are Selling, and the 1 They Can't Stop Buying was originally published by The Motley Fool Related Quotes "
}