{
    "title": "Microsoft will invest $2.1bn in Spain to expand cloud and AI",
    "date": "2/20/2024",
    "url": "https://www.siliconrepublic.com/business/microsoft-ai-investment-spain-cloud-infrastructure-europe",
    "text": "by Vish Gain 20 Feb 2024 Image: © Silviu/Stock.adobe.com Spanish president Pedro Sánchez said the deal ‘quadruples’ Microsoft’s investment in the country. As Microsoft continues to heavily invest in artificial intelligence infrastructure and skills across Europe, the latest country to benefit from this AI campaign is Spain. Brad Smith, vice-chair and president at Microsoft, announced in a post on X last night (19 February) that the company will invest $2.1bn in Spain over the next two years to expand its AI and cloud infrastructure in the country. “Our investment is beyond just building data centres, it’s a testament to our 37-year commitment to Spain, its security and development, and digital transformation of its government, businesses and people,” Smith wrote. Spanish president Pedro Sánchez welcomed the investment in a post on X (originally in Spanish) and said that it would “quadruple” the software giant’s commitment in the country. I’m thrilled to announce that we will expand our AI and cloud infrastructure in Spain by $2.1B USD in the next two years. Our investment is beyond just building data centers, it’s a testament to our 37-year commitment to Spain, its security, and development and digital… https://t.co/arJnZzyDpc — Brad Smith (@BradSmi) February 19, 2024  He also said that the deal will involve cooperation between Spain and Microsoft on strengthening cybersecurity and AI in public administration, noting that public-private collaboration is “essential to successfully face the challenges of digital transformation”. The latest investment comes hot on the heels of the major investment commitment Microsoft made in Germany last week, when it said it would spend €3.2bn over the next two years to double its cloud and AI infrastructure in the country. Less than three moths ago, Microsoft also made its largest-ever investment in the UK after committing £2.5bn over the next three years to expand its AI data centre footprint and foster research in the technology. Microsoft had a strong second fiscal quarter, according to its latest earnings posted last month, with a significant growth to both revenue and net income – largely thanks to its AI push. Revenue from the company’s Intelligent Cloud division – which includes Azure – grew by 20pc to $25.9bn. The company is a frontrunner in the AI race, getting a significant boost from its partnership with ChatGPT-creator OpenAI. The focus on AI helped Microsoft briefly hit the $3trn valuation and challenge Apple for the title of most valuable company in the world. Find out how emerging tech trends are transforming tomorrow with our new podcast, Future Human: The Series. Listen now on Spotify, on Apple or wherever you get your podcasts. Related:\n                    AI,             cloud,             Europe,             Microsoft,             funding and investment,             Spain Vish Gain is a journalist with Silicon Republic editorial@siliconrepublic.com 16 Jan 2024 15 Feb 2024 19 Mar 2024 2 days ago 1 Mar 2024 27 Feb 2024 19 hours ago 20 hours ago 21 hours ago 21 hours ago 23 hours ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}