{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.euronews.com/next/2024/02/27/furious-critics-question-microsofts-deal-with-mistral-ai-as-eu-set-to-look-into-it",
    "text": "Some critics in the European Parliament are mad about the deal but there are also questions about what happened and the EU plans to look into it Microsoft’s new “strategic partnership” with French artificial intelligence company Mistral AI faces scrutiny in Europe, with some critics in the parliament saying they are “furious” about it as the EU AI Act was changed to meet the demands of companies such as Mistral. The French AI champion unveiled its new large language model (LLM) on Monday, with it set to become available to Microsoft’s Azure cloud customers in a dramatic shake-up for the start-up. “On a technical level and a political level in the [European] Parliament, we are extremely furious because the French government for months was making this argument of European leadership, meaning that those companies should be able to scale up without help from Chinese or US companies,” said Kai Zenner, head of office and digital policy adviser for Axel Voss, an MEP from the European People’s Party (EPP). “They were always blaming the Parliament that we are making it kind of impossible, for those national champions, unicorns to try to compete with their global competitors,” he told Euronews Next. EU countries recently agreed on the technical details of the EU’s AI Act, but only after mammoth negotiations during which France in particular pushed for concessions for open source companies like Mistral. Zenner also said Mistral AI was making the argument that if their wishes were not fulfilled they would be forced to cooperate with companies like Microsoft. “Now they got all their wishes, and they do it anyway and I find this is just ridiculous”. He claims that the EU AI Act’s final version was rushed and the rules will be “attacked in front of courts” due to the concessions. The partnership is also set to be looked into by the European Union’s competition watchdog, which also last month began looking into Microsoft’s multibillion-dollar deal with OpenAI. \"The Commission is looking into agreements that have been concluded between large digital market players and generative AI developers and providers,\" a European Commission spokesperson told Euronews Next in an email. \"In this context, we have received the mentioned agreement, which we will analyse\". Mistral AI could also come under scrutiny as it is unclear if they were in talks with Microsoft as the EU AI Act was being written. “If this is the case and then certain lobbying happened or certain things were said by the French government, then of course certain things could indeed be further evaluated,” said Zenner. “There are certain red lines when it comes to how you do lobbying or how as a member state, how you are trying to push forward your narrative or a certain policy,” he said. Euronews Next has reached out to Microsoft and Mistral AI for comment but did not receive a reply at the time of publication. Another point of interest is the line between governments and tech. France’s former digital secretary of state Cedric O now serves on the board of Mistral. “I think actually the French government was surprised. I think Cedric was maybe not telling them that this will happen, or maybe not everyone,” said Zenner. “We also had this feeling that the French government is not really well coordinated right now, because there were a lot of different players speaking very differently and having also very different views and perspectives”. A spokesperson from France's economy, finance and digital ministry said that they had only found out about the deal on Monday but that it did not come as a shock as Mistral was always transparent about its business model. \"Mistral is a source of pride for France and Europe and it aims to be a global leader in the AI sector,\" the spokesperson told Euronews Next, adding that Microsoft's investment in the company is a small amount and Mistral would remain independent. Asked about if it was frustrating for French negotiators in the EU AI Act, the spokesperson said the country did not favour Mistral during the negotiations. Central to France's arguments was that the EU AI Act in its earliest form could stifle innovation, forcing European companies to look for foreign investment. “It's just another example of this general trend that we've seen in AI, where essentially all the kind of smaller independent startups are signing deals with the Big Tech companies, primarily because of all the concentration that you have when it comes to computing power, especially cloud computing,” said Max von Thun, Europe director of the non-profit Open Markets Institute. “And if you want to develop a cutting-edge AI model, you basically need access to that,” he added. Von Thun said the partnership is “ironic and concerning” as what makes Mistral's case more interesting is that the company is “supposedly Europe’s best hope when it comes to AI”. The EU has made a push to level the playing field when it comes to its technology companies, creating regulations such as the Digital Services Act. But the issue of keeping Europe’s tech talent is largely down to funding and not the rules and regulations, because Europe cannot compete with the venture capital scene in the US or the Big Tech giants. “You can do what you want in regulation, but what really determines whether you have companies that can compete and succeed at the European level is whether you have companies that have the infrastructure and the investment that they need at the European level,” said von Thun. “And that's not the case right now”. Mistral’s deal with Microsoft is not a merger, which is probably intentional, von Thun said. “If you try and buy someone outright, it's going to be really difficult. Whereas, these partnerships are a lot more nebulous,” he said, explaining that it is a way for Microsoft to still compete with Mistral while avoiding antitrust scrutiny through these deals. Despite Microsoft announcing on Monday it is opening access to its AI models for programmers to develop them, von Thun argues it is unlikely Microsoft is allowing open source models for the greater good or fairer competition. “If you open up these models, you allow different people to experiment with them. But I think when it's on the Big Tech platform’s terms that raises questions about what the access looks like. “Can you trust these companies to maintain their open access over time if that company actually starts to lead and challenge them? “I would say no”. This article was updated to add a response from the French government.   "
}