{
    "title": "Dominican Customs boosts efficiency with Microsoft software",
    "date": "2/14/2024",
    "url": "https://dominicantoday.com/dr/local/2024/02/14/dominican-customs-boosts-efficiency-with-microsoft-software/",
    "text": "HOME\nABOUT US\nADVERTISING\nCONTACT Last update on March 29, 2024, 11:53 am Economy February 14, 2024 | 6:27 pm Text size: \n                                 Smaller\n Bigger Santo Domingo.- The General Directorate of Customs (DGA) has significantly reduced the time it takes to complete internal administrative processes through the implementation of Microsoft Dynamics 365 management software. This translates into greater traceability and agility in the services received by taxpayers. Previously, the system used was Microsoft Dynamics SL, with which supplier invoice records in accounts payable took 15 minutes to process. With Dynamics 365, this is now done in 5 minutes, representing a 66.67% improvement. Likewise, monthly closing processes and financial statement preparation went from 21 days to 5 days, for a 76.19% improvement. Similarly, bank reconciliations for the 11 banks went from 7 hours to 2 hours, for a 71.43% improvement. “The General Directorate of Customs is a service institution, and it is committed to its taxpayers. Therefore, we will implement all possible tools to improve them. That is why we have included Microsoft Dynamics 365 in the Integrated Customs Management System (SIGA), which has contributed to raising the quality and reliability of internal Customs information,” said Eduardo Sanz Lovatón, Director General of Customs, when announcing the information. He assured that the implementation of this software has been a great support for the 24-Hour Clearance program, since it allows the status of each taxpayer’s case to be viewed in real time. The areas that benefit from this software include the Administrative, Financial, Process, Large Taxpayers, and Human Resources departments, as well as the Technology Sub-Directorate, and the Purchasing and Procurement and Maintenance and Transportation departments. In addition, this software also provides the institution with a dashboard that provides critical information and more robust financial performance. The investment in this system, implemented in April 2023, is part of the DGA’s commitment to technology for the improvement, transparency, and security of the services it offers. Since Eduardo Sanz Lovatón took over as head of the DGA in August 2020, the use of technology and the improvement of services have been fundamental pillars.  Δ  Δ  March 28, 2024 | 9:33 am March 28, 2024 | 7:59 am March 27, 2024 | 8:34 am March 26, 2024 | 9:06 am March 25, 2024 | 1:32 pm March 21, 2024 | 10:48 am Business & Pleasure Local Bavaro & Punta Cana Economy Economy Local Economy North Coast DominicanToday.com - The Dominican Republic News Source in English Av. Abraham Lincoln N° 452 Local 220B, Plaza La Francesa, Piantini, Santo Domingo Tel. (809) 334-6386 "
}