{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37061300/puzzling-says-analyst-as-microsofts-valuation-double-that-of-energy-companies-despi",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Microsoft Corp. MSFT recently leapfrogged Apple to become the most valuable global corporation, thanks to the software giant embracing artificial intelligence in a big way.  As the stock gathers mass, investors are left to ponder over the question whether the AI-induced upside is justifiable. What Happened: Based on Friday’s closing price of $420.55, Microsoft market cap is at $3.125 trillion. Macro strategist and Crescat Capital partner Otavio Costa on Thursday shared a graphic comparing the Satya Nadella-led company’s market cap as well as its free cash flow generation to those of energy companies. Microsoft’s valuation is nearly double that of the energy companies in the S&P 500 Index even as it generates half the free cash flow as these companies, the analyst said. He called the statistics “puzzling.” Microsoft grew free cash flow over the years, although the metric flattened out in 2022 and held steady until the first quarter of 2023. It has been climbing steadily since then. Source: Y Charts Energy companies operate in a capital-intensive industry and have seen slowing free cash flow generation. That said, production efficiency and reduced capital spending following the pandemic boosted the free cash flow of energy companies. Capex trends will likely reverse in the near-to-medium term as the resurgence in oil prices this year provides energy companies with the wherewithal to increase spending. This in turn will likely reduce free cash flow. While Microsoft’s valuation has been debated, the stock could continue to hit higher, as analysts expect the AI bubble to last for the next three to five years. Deepwater Asset Management co-founder Gene Munster said, he still believes “we're at the start of 3-5 year tech run that will end with an AI bubble.” Microsoft’s integration of OpenAI’s generative language into several of its business areas could keep it in the forefront of the AI revolution. Investors, therefore, would be willing to accord premium valuation to the company’s shares. The concept of growth stocks vouches for the fact. Investors trade these stocks on hopes of fat future profits that could lead to massive capital appreciation. Microsoft ended Friday’s session up 1.56% at $420.55, according to Benzinga Pro data. Read Next: OpenAI Shatters Records – Here’s How ChatGPT Propelled Revenue Beyond $2B Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}