{
    "title": "Microsoft (NASDAQ:MSFT) shareholders have earned a 30% CAGR over the last \nfive years",
    "date": "3/9/2024",
    "url": "https://finance.yahoo.com/news/microsoft-nasdaq-msft-shareholders-earned-120022721.html",
    "text": "When you buy shares in a company, it's worth keeping in mind the possibility that it could fail, and you could lose your money. But on a lighter note, a good company can see its share price rise well over 100%. For example, the Microsoft Corporation (NASDAQ:MSFT) share price has soared 250% in the last half decade. Most would be very happy with that. The last week saw the share price soften some 2.2%. Let's take a look at the underlying fundamentals over the longer term, and see if they've been consistent with shareholders returns. Check out our latest analysis for Microsoft There is no denying that markets are sometimes efficient, but prices do not always reflect underlying business performance. One flawed but reasonable way to assess how sentiment around a company has changed is to compare the earnings per share (EPS) with the share price. During five years of share price growth, Microsoft achieved compound earnings per share (EPS) growth of 21% per year. This EPS growth is lower than the 29% average annual increase in the share price. This suggests that market participants hold the company in higher regard, these days. And that's hardly shocking given the track record of growth. The image below shows how EPS has tracked over time (if you click on the image you can see greater detail). We know that Microsoft has improved its bottom line lately, but is it going to grow revenue? If you're interested, you could check this free report showing consensus revenue forecasts. When looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return. The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. In the case of Microsoft, it has a TSR of 268% for the last 5 years. That exceeds its share price return that we previously mentioned. The dividends paid by the company have thusly boosted the total shareholder return. It's nice to see that Microsoft shareholders have received a total shareholder return of 65% over the last year. Of course, that includes the dividend. Since the one-year TSR is better than the five-year TSR (the latter coming in at 30% per year), it would seem that the stock's performance has improved in recent times. Given the share price momentum remains strong, it might be worth taking a closer look at the stock, lest you miss an opportunity. It's always interesting to track share price performance over the longer term. But to understand Microsoft better, we need to consider many other factors. Take risks, for example - Microsoft has   1 warning sign   we think you should be aware of. We will like Microsoft better if we see some big insider buys. While we wait, check out this free list of growing companies with considerable, recent, insider buying. Please note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}