{
    "title": "US criticism of Microsoft shows ignorance of global procedures",
    "date": "3/26/2024",
    "url": "https://www.manilatimes.net/2024/03/27/opinion/us-criticism-of-microsoft-shows-ignorance-of-global-procedures/1938737",
    "text": "SOME United States politicians have fallen to new lows by obstructing normal economic exchanges between China and the US, and now they're even going so far as to point a finger at American companies for their lawful operations in China. Marco Rubio became the second US senator to join the critics of Microsoft's operations in China, which have recently been in the spotlight after a Bloomberg Businessweek investigation revealed its Bing search engine's \"compliance\" in the country, Bloomberg reported on Thursday. Last week, Sen. Mark Warner even called on Microsoft to consider shutting down its Bing platform in China. There is no solid legal foundation in the senators' criticism of Microsoft, which appears to be more like public opinion pressure by politicians on the business, or a way of gaining attention for themselves. Simply out of their ideological bias against China, some politicians in Washington even besiege companies of their own country, trying to use political means to interfere with their operations in China. However, their remarks show they've turned a blind eye to one of the most fundamental principles of international business — that companies operating in any country must comply with local laws and regulations. They're also ignoring China's fair treatment of foreign companies, which is something that Washington should be ashamed of, considering what it is doing to Chinese companies. The Chinese market is open and fair to all foreign companies that comply with local laws and regulations, as Microsoft's case shows. As a renowned American technology powerhouse, Microsoft has achieved remarkable development in the Chinese market over the past decades, and its Bing search engine has also been making steady progress in China. Like other American companies that have achieved expansion in China, Microsoft respects and abides by Chinese laws and regulations, while providing products and services that meet the needs of Chinese customers. While some Western public opinion has always been critical toward China's internet information management, it should be noted that China's internet policy is aimed at safeguarding national security, social stability and citizens' personal information security, which is the same as the policy objectives of many countries and regions across the world. While ensuring internet security, China has also provided broad development space for foreign-funded companies. This balanced approach serves not only to protect the national interests of China, but also to ensure the legitimate rights and interests of businesses. As the internet has penetrated all aspects of human society, internet content supervision and oversight has become a global practice. Various countries and regions have laws and regulations over how to prevent the spread of harmful information on the internet. Politicians in Washington who criticize China's internet regulation often overlook the fact that the Chinese internet market is one of the largest and most dynamic in the world. Foreign companies are drawn to the Chinese market not only for its size, but also for its predictable business environment and fair market order. US technology giant Apple Inc opened a new flagship store in downtown Shanghai on Thursday. Apple Chief Executive Officer Tim Cook, who was in Shanghai for another visit to China, declared on Wednesday that \"there is no place more important than China\" for the US tech giant's supply chain. The move to expand its presence in China by Apple, among other big multinational firms, demonstrates recognition of China's positive policy direction and promising market prospects. As long as they follow the rules, companies — whether big or small — can all find their places and achieve sustainable development in this environment. Shouldn't Washington reflect on this when it comes to suppressing Chinese companies in the US? This article was first published in the Global Times on March 21, 2024. The Global Times is an English-language Chinese tabloid under the People's Daily, the flagship newspaper of China's ruling Communist Party. The views expressed here are the paper's and not of The Manila Times. "
}