{
    "title": "Handelsinvest Investeringsforvaltning Sells 8,545 Shares of SiteOne \nLandscape Supply, Inc. (NYSE:SITE)",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-site-sec-filing-2024-03-21/",
    "text": "Handelsinvest Investeringsforvaltning lowered its stake in shares of SiteOne Landscape Supply, Inc. (NYSE:SITE - Free Report) by 77.7% in the fourth quarter, according to its most recent Form 13F filing with the Securities & Exchange Commission. The institutional investor owned 2,455 shares of the industrial products company's stock after selling 8,545 shares during the period. Handelsinvest Investeringsforvaltning's holdings in SiteOne Landscape Supply were worth $399,000 as of its most recent filing with the Securities & Exchange Commission. Several other large investors also recently bought and sold shares of SITE. Price T Rowe Associates Inc. MD boosted its holdings in SiteOne Landscape Supply by 4.2% in the 1st quarter. Price T Rowe Associates Inc. MD now owns 5,831,878 shares of the industrial products company's stock valued at $798,210,000 after purchasing an additional 232,491 shares during the last quarter. Vanguard Group Inc. boosted its holdings in SiteOne Landscape Supply by 0.7% in the 3rd quarter. Vanguard Group Inc. now owns 3,998,194 shares of the industrial products company's stock valued at $416,373,000 after purchasing an additional 29,355 shares during the last quarter. BlackRock Inc. lifted its holdings in shares of SiteOne Landscape Supply by 17.4% in the 1st quarter. BlackRock Inc. now owns 3,394,331 shares of the industrial products company's stock worth $548,828,000 after acquiring an additional 503,490 shares during the last quarter. T. Rowe Price Investment Management Inc. lifted its holdings in shares of SiteOne Landscape Supply by 4.5% in the 4th quarter. T. Rowe Price Investment Management Inc. now owns 1,174,204 shares of the industrial products company's stock worth $137,758,000 after acquiring an additional 50,636 shares during the last quarter. Finally, Conestoga Capital Advisors LLC lifted its holdings in SiteOne Landscape Supply by 1.6% during the 3rd quarter. Conestoga Capital Advisors LLC now owns 1,097,874 shares of the industrial products company's stock worth $179,448,000 after buying an additional 17,085 shares in the last quarter. SITE has been the topic of a number of recent analyst reports. Truist Financial increased their target price on shares of SiteOne Landscape Supply from $170.00 to $204.00 and gave the company a \"buy\" rating in a research report on Thursday, February 15th. Stifel Nicolaus downgraded shares of SiteOne Landscape Supply from a \"buy\" rating to a \"hold\" rating and lifted their price target for the stock from $150.00 to $167.00 in a report on Tuesday, December 19th. Loop Capital downgraded shares of SiteOne Landscape Supply from a \"buy\" rating to a \"hold\" rating in a report on Monday, January 8th. Barclays boosted their target price on shares of SiteOne Landscape Supply from $121.00 to $145.00 and gave the company an \"underweight\" rating in a report on Thursday, February 15th. Finally, Royal Bank of Canada lifted their price target on shares of SiteOne Landscape Supply from $150.00 to $157.00 and gave the company a \"sector perform\" rating in a research report on Thursday, February 15th. Two equities research analysts have rated the stock with a sell rating, four have issued a hold rating and three have issued a buy rating to the company. According to data from MarketBeat.com, SiteOne Landscape Supply has an average rating of \"Hold\" and a consensus price target of $172.88. Check Out Our Latest Report on SITE Shares of SITE traded up $7.27 on Thursday, hitting $185.78. The company's stock had a trading volume of 422,891 shares, compared to its average volume of 310,451. SiteOne Landscape Supply, Inc. has a fifty-two week low of $116.81 and a fifty-two week high of $188.01. The company has a quick ratio of 1.10, a current ratio of 2.43 and a debt-to-equity ratio of 0.29. The firm's fifty day moving average price is $164.84 and its 200-day moving average price is $155.32. The firm has a market capitalization of $8.39 billion, a price-to-earnings ratio of 49.15 and a beta of 1.54. SiteOne Landscape Supply (NYSE:SITE - Get Free Report) last posted its quarterly earnings data on Wednesday, February 14th. The industrial products company reported ($0.08) earnings per share for the quarter, topping the consensus estimate of ($0.15) by $0.07. The firm had revenue of $965.00 million for the quarter, compared to analysts' expectations of $942.21 million. SiteOne Landscape Supply had a return on equity of 12.13% and a net margin of 4.03%. The company's quarterly revenue was up 8.4% compared to the same quarter last year. During the same quarter last year, the business earned ($0.02) EPS. On average, equities research analysts expect that SiteOne Landscape Supply, Inc. will post 4.2 EPS for the current year. In other news, CEO Doug Black sold 10,000 shares of SiteOne Landscape Supply stock in a transaction dated Wednesday, January 17th. The stock was sold at an average price of $153.29, for a total transaction of $1,532,900.00. Following the sale, the chief executive officer now directly owns 580,886 shares of the company's stock, valued at $89,044,014.94. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through the SEC website. In other SiteOne Landscape Supply news, CEO Doug Black sold 10,000 shares of SiteOne Landscape Supply stock in a transaction that occurred on Wednesday, January 17th. The stock was sold at an average price of $153.29, for a total value of $1,532,900.00. Following the completion of the sale, the chief executive officer now directly owns 580,886 shares in the company, valued at $89,044,014.94. The sale was disclosed in a filing with the SEC, which is available at the SEC website. Also, CFO John T. Guthrie sold 3,000 shares of the firm's stock in a transaction that occurred on Friday, March 8th. The shares were sold at an average price of $180.00, for a total value of $540,000.00. Following the completion of the sale, the chief financial officer now directly owns 15,467 shares of the company's stock, valued at approximately $2,784,060. The disclosure for this sale can be found here. Insiders have sold 23,000 shares of company stock valued at $3,836,400 over the last ninety days. 2.70% of the stock is owned by corporate insiders. SiteOne Landscape Supply, Inc, together with its subsidiaries, engages in the wholesale distribution of landscape supplies in the United States and Canada. The company provides irrigation products, including controllers, valves, sprinkler heads, irrigation pipes, micro irrigation, and drip products; fertilizer, grass seed, and ice melt products; control products, such as herbicides, fungicides, rodenticides, and other pesticides; landscape accessories that include mulches, soil amendments, drainage pipes, tools, and sods; nursery goods, which consist of deciduous and evergreen shrubs, ornamental, shade, evergreen trees, field grown and container-grown nursery stock, roses, perennials, annuals, bulbs, and plant species and cultivars; hardscapes, such as pavers, natural stones, blocks, and other durable materials; and outdoor lighting products that include lighting fixtures, LED lamps, wires, transformers, and accessories.Further ReadingFive stocks we like better than SiteOne Landscape SupplyTransportation Stocks InvestingGoogle and Meta Circling the Market on a TikTok Ban Rally3 Small Caps With Big Return PotentialIntuitive Machines: Charting a Course Among the StarsWhat is a Bond Market Holiday? How to Invest and TradeKB Home’s Stock Price Can Move Higher, Here’s Why  Before you consider SiteOne Landscape Supply, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and SiteOne Landscape Supply wasn't on the list. While SiteOne Landscape Supply currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Need to stretch out your 401K or Roth IRA plan? Use these time-tested investing strategies to grow the monthly retirement income that your stock portfolio generates. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}