{
    "title": "2 \"Magnificent Seven\" Stocks That Are Screaming Buys in March",
    "date": "3/13/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT/pressreleases/24753102/2-magnificent-seven-stocks-that-are-screaming-buys-in-march/",
    "text": "Less than three months into 2024, the usual suspects are lifting the stock market higher. The so-called \"Magnificent Seven\" (Microsoft, Apple, Nvidia, Alphabet, Amazon, MetaPlatforms, and Tesla) remain some of the hottest stocks on Wall Street. But investors want to know which of these stocks, if any, remain screaming buys. Here are the two that I believe still have plenty of gas left in the tank. Image source: Getty Images. Topping my list is Amazon. Shares of the e-commerce leader are up 88% over the last 12 months, helping founder Jeff Bezos climb back atop the list of richest Americans. But what puts Amazon at the top of my list isn't its recent performance -- it's the company's long-term prospects. As the world's top cloud services provider, Amazon Web Services (AWS) stands to reap enormous benefits from the artificial intelligence (AI) revolution. That's because developers will look to AWS for support, guidance, and infrastructure to scale their AI-powered applications. Simply put, hyperscalers like Amazon, Microsoft, Alphabet, and Meta Platforms own a significant portion of data centers globally, with some estimates putting the figure at 40% of overall capacity. Financially, the effects of the AI revolution are already evident. In Amazon's most recent quarter (the three months ending on Dec. 31, 2023), the company reported AWS revenue of $24.2 billion, which was up 13% from a year earlier. Amazon's new generative AI assistants like Q (a chatbot for businesses) and Rufus (an online shopping assistant) represent opportunities for Amazon to have its own ChatGPT moment. And, with 500 million Alexa-enabled devices already sold, Amazon already has a hardware foothold in many households. It simply needs the software buzz to truly capture the moment. In any event, Amazon's combination of fantastic leadership, outstanding financials, and leading market share in cloud services make it a screaming buy in my book. Yes, Nvidia is still a screaming buy, too. I know that might be hard to believe, with shares recently up an astounding 600% in only 18 months. However, just like how the result of one coin flip doesn't impact the outcome of the following one, Nvidia's unbelievable last 18 months say nothing about where the stock is headed. In a nutshell, past performance doesn't imply future returns. There is, however, one interesting trend that potential investors should keep in mind: That's the company's valuation. And contrary to what you might think, Nvidia's shares keep getting cheaper -- not more expensive. In fact, as you can see in the chart below, Nvidia's forward price-to-earnings (P/E) ratio has decreased by more than 50% over the last three years.  NVDA PE ratio (forward) data by YCharts. And P/E ratios are volatile because they're based on either trailing earnings or future earnings estimates -- meaning they often soar or collapse around earnings announcements, as you can see in the chart above. At any rate, Nvidia's forward P/E ratio has significantly dropped because analysts expect the company to score from rising sales of its graphics processing units (GPUs), which are used to power many of today's cutting-edge AI applications. In summary, investors shouldn't shy away from Nvidia just because its stock has been on a tear. To the contrary, Nvidia's future looks bright thanks to the skyrocketing demand for AI chips. Granted, its not a stock for every investor. But for those who are willing to buy and hold, Nvidia could still be a screaming buy right now. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Jake Lerch has positions in Alphabet, Amazon, Nvidia, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}