{
    "title": "Could Oracle become the next Microsoft? - THE BHARAT EXPRESS NEWS",
    "date": "3/29/2024",
    "url": "https://thebharatexpressnews.com/could-oracle-become-the-next-microsoft/",
    "text": " Microsoft‘S (NASDAQ: MSFT) Its share prices have risen almost 1,000% over the past decade, making it the most valuable company in the world, with a market capitalization of $3.2 trillion.  That massive growth spurt was driven by the expansion of the mobile, cloud and AI ecosystems under Satya Nadella, who became the company’s CEO in 2014. Microsoft is still one of the best AI stocks on the market, but investors are likely already looking for the next tech stocks that can match these gains over the next decade.  Could that company be that? Oracle (NYSE: ORCL)which is also gradually expanding its cloud and AI ecosystems, but has a smaller market cap of $350 billion? Image source: Getty Images. Table of Contents Microsoft and Oracle use different business models.  Microsoft is a more diversified company, generating most of its revenue from its Windows operating system, Office productivity software, Azure cloud-based infrastructure platform, and other cloud-based services.  It also sells ads in its Bing search engine, PC hardware through its Surface division and video game products through its Xbox division. Over the past decade, most of Microsoft’s growth has come from Azure and the conversion of its Office products and Dynamics Customer Relationship Management (CRM) platform to cloud-based services.  The investments in OpenAI allowed it to integrate the startup’s generative AI tools into its own cloud-based ecosystem. Oracle is one of the largest database software companies in the world.  Initially, the company had an early mover lead with its on-premise applications, but Amazon and Microsoft led the way with their own cloud-based database services.  To keep pace with that shift, Oracle transformed its on-premise applications to cloud-based services and inorganically expanded its ecosystem to include more enterprise resource planning (ERP), CRM and healthcare IT management services.  It also launched its own cloud platform, Oracle Cloud Infrastructure (OCI). The story continues Oracle now ranks third in the cloud-based database software market, behind Amazon and Microsoft, while OCI is still a small platform compared to Amazon Web Services (AWS), Microsoft Azure and Alphabet‘s Google Cloud.  It also ranks third in the CRM market Sales team and Microsoft, and it remains a distant underdog in the fragmented ERP market.  That’s probably why Oracle isn’t often mentioned in the same breath as Microsoft or Amazon. Oracle generated 38% of its revenue from its total cloud services in the last quarter.  By comparison, Microsoft generated 54% of its revenue from its cloud services last quarter. Oracle plans to continue expanding its cloud business to offset slower growth in its on-premise, licensing and support divisions.  It expects increasing use of its back office database and ERP applications, growth of OCI and a new AI infrastructure contract with Nvidia to drive that expansion and widen its moat. In its latest earnings report, CEO Safra Catz said that Oracle expects to “continue to receive large contracts to reserve cloud infrastructure capacity as demand for our Gen2 AI infrastructure significantly exceeds supply – despite the fact that we are adding new and existing cloud data centers very, very expanding. quickly.” In other words, Oracle should benefit from the expansion of the AI ​​market, which Grand View Research expects to grow at a compound annual growth rate (CAGR) of 37% between 2023 and 2030.  But many of these gains will still be offset by the slower-growing legacy businesses. From fiscal 2023 (which ended last May) to fiscal 2026, analysts expect Oracle’s revenue to rise at a CAGR of 8%, while earnings per share will rise at a CAGR of 22%.  Much of that earnings growth will likely be driven by large buybacks.  The country has already bought back 38% of its shares in the past decade and should continue that tradition in the near future. Those growth figures are stable, but are unlikely to turn Oracle into the next Microsoft.  From fiscal 2013 to fiscal 2023 (which ended last June), Microsoft grew its revenue at a CAGR of 11%, while earnings per share rose at a CAGR of 14%.  From fiscal 2023 to fiscal 2026, analysts expect revenue and earnings per share to grow at a CAGR of 15% and 17%, respectively, as the company continues to expand its cloud and AI ecosystems. Assuming Oracle meets analyst expectations for the next three years, continues to grow its earnings per share at a CAGR of 20% from fiscal 2026 to fiscal 2033, and trades at 20 times earnings, its stock could more than triple to $400 per share and thus increase the price.  market capitalization to approximately $1.1 trillion.  That would be an impressive gain over a decade, but it wouldn’t match Microsoft’s massive rally over the past decade.  It would also still be a lot smaller than the current Microsoft. So instead of wondering whether Oracle will shake off its reputation as a dusty old tech stock and become the next Microsoft, investors should focus on its core strengths: It’s successfully expanding its own cloud and AI businesses in the shadows from its larger competitors, it returns a lot of cash for shareholders, and its shares are still fairly valued. Should You Invest $1,000 in Oracle Now? Consider the following before buying shares in Oracle: The Motley Fool stock advisor The analyst team has just identified what they think is the 10 best stocks for investors to buy now… and Oracle wasn’t one of them.  The ten stocks that survived the cut could deliver monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including portfolio building guidance, regular analyst updates, and two new stock picks per month.  The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*. View the 10 stocks *Stock Advisor returns March 25, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors.  Suzanne Frey, a director at Alphabet, is a member of The Motley Fool’s board of directors.  Leo Sun has positions in Amazon.  The Motley Fool holds positions in and recommends Alphabet, Amazon, Microsoft, Nvidia, Oracle and Salesforce.  The Motley Fool recommends the following options: long January 2026 $395 calls to Microsoft and short January 2026 $405 calls to Microsoft.  The Motley Fool has a disclosure policy. Could Oracle become the next Microsoft?  was originally published by The Motley Fool Save my name, email, and website in this browser for the next time I comment.   Δ "
}