{
    "title": "Peak Financial Advisors LLC Boosts Stake in Microsoft Co. (NASDAQ:MSFT)",
    "date": "3/25/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-msft-sec-filing-2024-03-25/",
    "text": "Peak Financial Advisors LLC boosted its stake in shares of Microsoft Co. (NASDAQ:MSFT - Free Report) by 589.3% during the 4th quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The fund owned 6,514 shares of the software giant's stock after acquiring an additional 5,569 shares during the quarter. Microsoft comprises about 1.6% of Peak Financial Advisors LLC's investment portfolio, making the stock its 28th biggest position. Peak Financial Advisors LLC's holdings in Microsoft were worth $2,450,000 as of its most recent filing with the Securities and Exchange Commission (SEC). Several other large investors also recently added to or reduced their stakes in the stock. DGS Capital Management LLC increased its position in shares of Microsoft by 19.9% during the first quarter. DGS Capital Management LLC now owns 14,342 shares of the software giant's stock worth $4,422,000 after purchasing an additional 2,383 shares in the last quarter. IFM Investors Pty Ltd increased its position in shares of Microsoft by 20.8% during the first quarter. IFM Investors Pty Ltd now owns 1,138,469 shares of the software giant's stock worth $351,001,000 after purchasing an additional 196,338 shares in the last quarter. Altus Wealth Group LLC increased its position in shares of Microsoft by 1.2% during the first quarter. Altus Wealth Group LLC now owns 12,712 shares of the software giant's stock worth $3,919,000 after purchasing an additional 152 shares in the last quarter. Powell Investment Advisors LLC increased its position in shares of Microsoft by 16.2% during the first quarter. Powell Investment Advisors LLC now owns 2,578 shares of the software giant's stock worth $795,000 after purchasing an additional 359 shares in the last quarter. Finally, Onyx Bridge Wealth Group LLC increased its position in shares of Microsoft by 8.2% during the first quarter. Onyx Bridge Wealth Group LLC now owns 6,782 shares of the software giant's stock worth $1,921,000 after purchasing an additional 512 shares in the last quarter. 71.13% of the stock is owned by institutional investors. In related news, major shareholder Corp Microsoft sold 1,000,000 shares of the business's stock in a transaction on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the transaction, the insider now owns 11,677,398 shares in the company, valued at $22,770,926.10. The sale was disclosed in a legal filing with the SEC, which is accessible through the SEC website. In other news, EVP Kathleen T. Hogan sold 21,955 shares of the company's stock in a transaction dated Monday, March 11th. The shares were sold at an average price of $403.96, for a total value of $8,868,941.80. Following the completion of the sale, the executive vice president now directly owns 159,764 shares of the company's stock, valued at $64,538,265.44. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this link. Also, major shareholder Corp Microsoft sold 1,000,000 shares of the company's stock in a transaction dated Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the sale, the insider now directly owns 11,677,398 shares of the company's stock, valued at $22,770,926.10. The disclosure for this sale can be found here. Over the last quarter, insiders sold 1,070,258 shares of company stock worth $30,690,456. Corporate insiders own 0.03% of the company's stock. Shares of MSFT stock traded down $5.88 during trading on Monday, hitting $422.86. 18,042,123 shares of the stock traded hands, compared to its average volume of 23,165,963. The firm has a market capitalization of $3.14 trillion, a P/E ratio of 38.23, a price-to-earnings-growth ratio of 2.28 and a beta of 0.89. The company has a debt-to-equity ratio of 0.19, a current ratio of 1.22 and a quick ratio of 1.20. The firm's fifty day moving average price is $408.33 and its 200-day moving average price is $372.38. Microsoft Co. has a 52-week low of $272.05 and a 52-week high of $430.82. Microsoft (NASDAQ:MSFT - Get Free Report) last announced its earnings results on Tuesday, January 30th. The software giant reported $2.93 earnings per share (EPS) for the quarter, beating analysts' consensus estimates of $2.76 by $0.17. The company had revenue of $62.02 billion for the quarter, compared to analyst estimates of $61.14 billion. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The firm's quarterly revenue was up 17.6% compared to the same quarter last year. During the same quarter in the previous year, the company earned $2.32 earnings per share. As a group, research analysts forecast that Microsoft Co. will post 11.63 earnings per share for the current fiscal year. The company also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Investors of record on Thursday, May 16th will be paid a dividend of $0.75 per share. The ex-dividend date is Wednesday, May 15th. This represents a $3.00 dividend on an annualized basis and a dividend yield of 0.71%. Microsoft's payout ratio is currently 27.12%. Several equities analysts recently issued reports on MSFT shares. DA Davidson reissued a \"buy\" rating and issued a $500.00 target price on shares of Microsoft in a research report on Friday, March 15th. Mizuho upped their target price on Microsoft from $420.00 to $450.00 and gave the company a \"buy\" rating in a research report on Friday, December 15th. Argus upped their target price on Microsoft from $390.00 to $430.00 and gave the company a \"buy\" rating in a research report on Tuesday, December 5th. Macquarie upped their target price on Microsoft from $430.00 to $450.00 and gave the company an \"outperform\" rating in a research report on Wednesday, January 31st. Finally, China Renaissance started coverage on Microsoft in a research report on Tuesday, December 5th. They issued a \"buy\" rating and a $466.00 target price on the stock. Four investment analysts have rated the stock with a hold rating and thirty-six have issued a buy rating to the company. According to data from MarketBeat.com, Microsoft presently has an average rating of \"Moderate Buy\" and a consensus price target of $422.05. Read Our Latest Stock Report on MSFT Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.Further ReadingFive stocks we like better than MicrosoftTSX Venture Exchange (Formerly Canadian Venture Exchange)5 Top-Rated Dividend Stocks With Double-Digit UpsideMost Volatile Stocks, What Investors Need to KnowShould You Buy Boeing Stock After CEO Resignation Announcement?How Investors Can Find the Best Cheap Dividend StocksThese Are The Most Upgraded Stocks From Q1  Before you consider Microsoft, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list. While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Which stocks are likely to thrive in today's challenging market? Click the link below and we'll send you MarketBeat's list of ten stocks that will drive in any economic environment. Microsoft's stock price is pulling back following the Q4 results, suggesting a top is in play, but investors should not be so quick to shed their shares. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}