{
    "title": "Microsoft makes the promise of AI in healthcare real through new \ncollaborations with healthcare organizations and ...",
    "date": "3/11/2024",
    "url": "https://blogs.microsoft.com/blog/2024/03/11/microsoft-makes-the-promise-of-ai-in-healthcare-real-through-new-collaborations-with-healthcare-organizations-and-partners/",
    "text": "Mar 11, 2024\n\n| \n\tRobert Dahdah - CVP, Health & Life Sciences Just over a year ago, the healthcare industry was energized by the debut of generative AI and the promise this new technology held for delivering real-world outcomes that positively impact clinicians, patients, health systems, and the broader health and life sciences ecosystem. Since then, it has been a catalyst for the development of new use cases, opening possibilities for an entirely new era of innovation — and this shows no signs of slowing down. We continue to see AI adoption within healthcare grow, with 79% of healthcare organizations reporting that they’re currently using AI technology, according to a Microsoft-commissioned study through IDC[i]. AI also has a demonstrable business value, with healthcare organizations realizing a return on their AI investments within 14 months, along with an average return of $3.20 for every $1 they invest in AI[ii]. Working alongside healthcare organizations, Microsoft is making the promise of AI real by empowering the industry to tackle its biggest challenges and create a real difference in the lives of clinicians and patients. At the 2024 HIMSS Global Health Conference & Exhibition, we are highlighting how providers are adopting generative AI solutions and the impact the technology is making. Reinforcing our commitment to Responsible AI As incredible as AI – and all its potential – is, the important role clinicians play in determining its use and enabling responsible AI guidelines is vital. That’s why we remain steadfast in our commitment to our Responsible AI principles, which help to ensure safe, fair and responsible use of the technology. As part of this ongoing commitment, Microsoft has joined a consortium of healthcare leaders to announce the formation of the Trustworthy & Responsible AI Network (TRAIN), creating one of the first health AI networks aimed at operationalizing responsible AI principles to improve the quality, safety and trustworthiness of AI in health. Serving as the technology-enabling partner for TRAIN, Microsoft is working with members that include AdventHealth, Advocate Health, Boston Children’s Hospital, Cleveland Clinic, Duke Health, Johns Hopkins Medicine, Mass General Brigham, MedStar Health, Mercy, Mount Sinai Health System, Northwestern Medicine, Providence, Sharp HealthCare, University of Texas Southwestern Medical Center, University of Wisconsin School of Medicine and Public Health and Vanderbilt University Medical Center – to share best practices and provide tools to enable measurement of outcomes associated with the implementation of AI. Additionally, OCHIN, which serves a national network of community health organizations with solutions, expertise, clinical insights and tailored technologies, and TruBridge, a partner and conduit to community healthcare, will work with TRAIN to help ensure that every organization, regardless of resources, has access to the benefits the network offers. Additionally, we continue to take the necessary steps to ensure healthcare organizations can implement technology in compliance with the highest levels of security and privacy in mind. We recently announced the preview of healthcare data solutions in Microsoft Fabric, which enables healthcare organizations to break down data silos and harmonize their disparate healthcare data in a single unified store where analytics and AI workloads can operate at-scale. We are also pleased to share that Fabric now supports HIPAA (Health Insurance Portability and Accountability Act) compliance, allowing our U.S. healthcare industry customers and partners to compliantly use Fabric to store, process and analyze data. Driving innovation through the Microsoft partner ecosystem Microsoft’s unmatched global ecosystem of trusted partners is one of the key components that helps drive our innovation forward. This week, Cognizant announced that its TriZetto Assistant on Facets will leverage Microsoft Azure OpenAI Service and Semantic Kernel to provide access to generative AI within the TriZetto user interface. This new collaboration will help increase productivity and efficiency for healthcare payers and providers, while ensuring timely responses and improved care for patients. Additionally, Microsoft for Startups announced a new collaboration with the American Medical Association’s (AMA) Physician Innovation Network. The Physician Innovation Network is a powerful match-making tool developed by the AMA to connect physicians, care team members, business liaisons and entrepreneurs in a shared mission to enhance healthcare. The collaboration extends the reach of the Physician Innovation Network to all startup founders in the Microsoft for Startups Founders Hub, so whether they’re driven to improve healthcare, collaborate with industry leaders or learn from healthcare experts, they will have access to a unique space for connection and innovation. Without a doubt, these are incredibly exciting times, and we are proud to see our customers and partners adopting Microsoft’s generative AI solutions and putting them to use in the real world to make a meaningful impact in the lives of clinicians and patients.  We look forward to continuing to play a leading role in fostering innovation with generative AI, and empowering healthcare providers and partners across the entire health and life sciences industries with leading-edge and responsible AI technologies that contribute to better experiences and outcomes in healthcare.  _____ [i] IDC InfoBrief, sponsored by Microsoft, The Business Opportunity of AI: How Leading Organizations Around the World Are Using AI to Drive Impact Across Every Industry, IDC #US51364223, Nov. 2023. [ii] IDC Resource Map Document: IDC Business Value of AI Survey, sponsored by Microsoft, IDC #US51331223, Nov. 2023. Tags: AI, healthcare, Microsoft Copilot, Microsoft Fabric, Microsoft for Startups, Responsible AI Mar 7, 2024\t\t\t\t\t\t\t\t\n|\nJenny Lay-Flurrie Feb 29, 2024\t\t\t\t\t\t\t\t\n|\nCharles Lamanna Feb 28, 2024\t\t\t\t\t\t\t\t\n|\nTakeshi Numoto Feb 25, 2024\t\t\t\t\t\t\t\t\n|\nJason Zander Feb 7, 2024\t\t\t\t\t\t\t\t\n|\nYusuf Mehdi Follow us: "
}