{
    "title": "Sarasin & Partners LLP Has $536.14 Million Position in Microsoft Co. \n(NASDAQ:MSFT)",
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/sarasin-partners-llp-has-536-14-million-position-in-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Sarasin & Partners LLP cut its holdings in  Microsoft Co. (NASDAQ:MSFT – Free Report) by 4.8% in the fourth quarter, HoldingsChannel reports. The firm owned 1,425,758 shares of the software giant’s stock after selling 71,240 shares during the period. Microsoft accounts for approximately  5.9% of Sarasin & Partners LLP’s portfolio, making the stock its 3rd biggest holding. Sarasin & Partners LLP’s holdings in Microsoft were worth $536,142,000 at the end of the most recent quarter. A number of other large investors have also recently bought and sold shares of MSFT. High Pines Wealth Management LLC increased its holdings in shares of  Microsoft by 1.3% in the third quarter. High Pines Wealth Management LLC now owns 2,256 shares of the software giant’s stock valued at $712,000 after purchasing an additional 28 shares in the last quarter.  Sonen Capital LLC increased its holdings in shares of  Microsoft by 0.3% in the third quarter. Sonen Capital LLC now owns 10,132 shares of the software giant’s stock valued at $3,199,000 after purchasing an additional 28 shares in the last quarter.  Perritt Capital Management Inc. increased its holdings in shares of  Microsoft by 3.3% in the third quarter. Perritt Capital Management Inc. now owns 937 shares of the software giant’s stock valued at $296,000 after purchasing an additional 30 shares in the last quarter.  Noble Family Wealth LLC boosted its stake in  Microsoft by 1.3% in the third quarter. Noble Family Wealth LLC now owns 2,331 shares of the software giant’s stock valued at $736,000 after acquiring an additional 31 shares during the last quarter.  Finally, O Connor Financial Group LLC boosted its stake in  Microsoft by 1.4% in the third quarter. O Connor Financial Group LLC now owns 2,191 shares of the software giant’s stock valued at $692,000 after acquiring an additional 31 shares during the last quarter. 69.20% of the stock is currently owned by institutional investors. In related news, major shareholder Corp Microsoft sold 1,000,000 shares of the stock in a transaction on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the transaction, the insider now directly owns 11,677,398 shares of the company’s stock, valued at $22,770,926.10. The sale was disclosed in a legal filing with the SEC, which can be accessed through this hyperlink. In related news, EVP Kathleen T. Hogan sold 21,955 shares of the stock in a transaction on Monday, March 11th. The shares were sold at an average price of $403.96, for a total transaction of $8,868,941.80. Following the transaction, the executive vice president now directly owns 159,764 shares of the company’s stock, valued at $64,538,265.44. The sale was disclosed in a legal filing with the SEC, which can be accessed through this hyperlink. Also, major shareholder Corp Microsoft sold 1,000,000 shares of the stock in a transaction on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the transaction, the insider now directly owns 11,677,398 shares in the company, valued at $22,770,926.10. The disclosure for this sale can be found here. In the last three months, insiders have sold 1,070,258 shares of company stock valued at $30,690,456. 0.03% of the stock is currently owned by insiders. A number of equities analysts have issued reports on the stock. Jefferies Financial Group  reaffirmed a “buy” rating and issued a $465.00 price objective on shares of Microsoft in a research note on Wednesday, March 6th. Piper Sandler  reissued an “overweight” rating and set a $455.00 price target on shares of Microsoft in a research report on Thursday, January 25th. BNP Paribas raised shares of Microsoft from a “neutral” rating to an “outperform” rating and set a $471.00 price target on the stock in a research report on Thursday, January 18th. Truist Financial  reissued a “buy” rating on shares of Microsoft in a research report on Tuesday, January 23rd. Finally, StockNews.com cut shares of Microsoft from a “buy” rating to a “hold” rating in a research report on Thursday, February 22nd. Four investment analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company. According to MarketBeat.com, the company  has an average rating of “Moderate Buy” and an average price target of $417.37. Check Out Our Latest Report on Microsoft Shares of NASDAQ MSFT opened at $428.74 on Friday. The company has a debt-to-equity ratio of 0.19, a quick ratio of 1.20 and a current ratio of 1.22. Microsoft Co. has a 52-week low of $272.05 and a 52-week high of $430.82. The firm has a 50 day moving average price of $408.33 and a two-hundred day moving average price of $371.83. The stock has a market cap of $3.19 trillion, a P/E ratio of 38.76, a price-to-earnings-growth ratio of 2.28 and a beta of 0.89. Microsoft (NASDAQ:MSFT – Get Free Report) last announced its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 earnings per share (EPS) for the quarter, beating the consensus estimate of $2.76 by $0.17. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. The firm had revenue of $62.02 billion during the quarter, compared to analysts’ expectations of $61.14 billion. During the same period in the prior year, the company posted $2.32 EPS. The company’s revenue was up 17.6% on a year-over-year basis.  As a group, equities analysts forecast that  Microsoft Co. will post 11.63 EPS for the current year. The company also recently disclosed a quarterly dividend, which will be paid on Thursday, June 13th. Stockholders of record on Thursday, May 16th will be paid a $0.75 dividend. This represents a $3.00 dividend on an annualized basis and a dividend yield of 0.70%. The ex-dividend date of this dividend is Wednesday, May 15th. Microsoft’s dividend payout ratio  is currently 27.12%. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Microsoft Co. (NASDAQ:MSFT) Shares Sold by Silvia Mccoll Wealth Management LLC Brookstone Capital Management Has $1.08 Million Holdings in Amplify High Income ETF (NYSEARCA:YYY) "
}