{
    "title": "5 ETFs to Tap Microsoft's Strength",
    "date": "3/15/2024",
    "url": "https://www.zacks.com/stock/news/2241481/5-etfs-to-tap-microsofts-strength",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Sweta Killa\n                    March 15, 2024 AAPL Quick QuoteAAPL MSFT Quick QuoteMSFT XLK Quick QuoteXLK FTEC Quick QuoteFTEC IYW Quick QuoteIYW VGT Quick QuoteVGT IXN Quick QuoteIXN Better trading starts here. You follow ETF News and Commentary - edit You follow Sweta Killa - edit Sweta Killa ETF News and Commentary In a remarkable development on Thursday, Microsoft's (MSFT Quick QuoteMSFT  -  Free Report)     stock reached an unprecedented high, driven by the announcement of its new artificial intelligence assistant, Microsoft Copilot for Security. The launch has significantly bolstered the company's position in the stock market, with shares hitting a new record high.Investors could tap the strength of this software leader through ETFs having double-digit exposure to Microsoft, like Select Sector SPDR Technology ETF (XLK Quick QuoteXLK  -  Free Report)    , MSCI Information Technology Index ETF (FTEC Quick QuoteFTEC  -  Free Report)    , iShares Global Tech ETF (IXN Quick QuoteIXN  -  Free Report)    , Vanguard Information Technology ETF (VGT Quick QuoteVGT  -  Free Report)     and iShares Dow Jones US Technology ETF (IYW Quick QuoteIYW  -  Free Report)    .The company introduced Microsoft Copilot for Security, which will be a universally accessible tool starting Apr 1. This generative AI assistant is designed to support security and IT professionals in safeguarding their operations against cyber threats by leveraging a vast database of threat intelligence.Offering custom insights and action recommendations, Copilot for Security is capable of handling prompts and delivering responses in eight languages, with a multilingual interface accommodating 25 languages. This innovation is seen as a significant growth driver for Microsoft, especially within its cybersecurity segment.Microsoft is benefiting big from generative artificial intelligence (AI). It overtook Apple (AAPL Quick QuoteAAPL  -  Free Report)     in January to become the world's most valuable company. Microsoft now has a market capitalization of more than $3 trillion (read: AI Drives Microsoft's Q2 Earnings: Top ETF Picks). Wall Street is bullish on the stock. Microsoft currently has an average brokerage recommendation (ABR) of 1.14 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 37 brokerage firms. The current ABR compares to an ABR of 1.14 a month ago based on 37 recommendations.Of the 37 recommendations deriving the current ABR, 33 are Strong Buy and three are Buy. Strong Buy and Buy, respectively, account for 89.19% and 8.11% of all recommendations. A month ago, Strong Buy made up 89.19%, while Buy represented 8.11%.Based on short-term price targets offered by 34 analysts, the average price target for Microsoft comes to $445.06. The forecasts range from a low of $298.10 to a high of $600.00. The average price target represents an increase of 5% from the last closing price of $425.22. Microsoft saw a positive earnings estimate revision of 3 cents over the past month for the fiscal year (ending June 2024), with an estimated earnings growth of 18.5%. This compares favorably with the industry’s growth projection of 12.61%.MSFT has a Zacks Rank #2 (Buy) and falls under a top-ranked Zacks industry (top 18%), suggesting further growth. Select Sector SPDR Technology ETF (XLK Quick QuoteXLK  -  Free Report)    Select Sector SPDR Technology ETF is the most popular and liquid ETF in the technology space, with AUM of $65.1 billion and an average daily volume of 6.7 million shares. It offers broad exposure to the technology sector and follows the Technology Select Sector Index. Select Sector SPDR Technology ETF holds about 64 securities in its basket, with Microsoft occupying the top position at 23.3%.Select Sector SPDR Technology ETF charges 9 bps in fees per year from investors and has a Zacks ETF Rank #1 (Strong Buy) with a Medium risk outlook (read: 4 Best Sector ETFs to Play Now).MSCI Information Technology Index ETF (FTEC Quick QuoteFTEC  -  Free Report)    MSCI Information Technology Index ETF is home to 302 technology stocks with AUM of $9.4 billion. It follows the MSCI USA IMI Information Technology Index. Microsoft is the top firm with a 21.1% allocation.MSCI Information Technology Index ETF has 0.08% in expense ratio, while volume is solid at 256,000 shares a day. It carries a Zacks ETF Rank #1 with a Medium risk outlook.iShares Global Tech ETF (IXN Quick QuoteIXN  -  Free Report)    iShares Global Tech ETF provides exposure to electronics, computer software and hardware, and informational technology companies by tracking the S&P Global 1200 Information Technology 4.5/22.5/45 Capped Index. Holding 115 stocks in its basket, Microsoft occupies the top spot with a 20% share.iShares Global Tech ETF has amassed $4.6 billion in its asset base and trades in a good volume of 387,000 shares a day, on average. The expense ratio is 0.41%.Vanguard Information Technology ETF (VGT Quick QuoteVGT  -  Free Report)    Vanguard Information Technology ETF manages about $66.4 billion in its asset base and provides exposure to 315 technology stocks. It currently tracks the MSCI US Investable Market Information Technology 25/50 Index. Here, MSFT occupies the second position with an 18.2% share.Vanguard Information Technology ETF has 0.10% in expense ratio, while volume is solid at nearly 490,000 shares. It has a Zacks ETF Rank #1 with a Medium risk outlook (read: 5 ETFs That Gained Investors Love in February).iShares U.S. Technology ETF (IYW Quick QuoteIYW  -  Free Report)    iShares U.S. Technology ETF provides exposure to U.S. electronics, computer software and hardware, and informational technology companies. It tracks the Russell 1000 Technology RIC 22.5/45 Capped Index, holding 133 securities in its basket. Of these, Microsoft occupies the second position in the basket, with 17.3% of the assets.iShares Dow Jones US Technology ETF has AUM of $16.1 billion and charges 40 bps in fees and expenses. Volume is good as it exchanges nearly 723,000 shares a day. IYW has a Zacks ETF Rank #1 with a Medium risk outlook. Apple Inc. (AAPL) - free report >> Microsoft Corporation (MSFT) - free report >> Technology Select Sector SPDR ETF (XLK) - free report >> Fidelity MSCI Information Technology Index ETF (FTEC) - free report >> iShares U.S. Technology ETF (IYW) - free report >> Vanguard Information Technology ETF (VGT) - free report >> iShares Global Tech ETF (IXN) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}