{
    "title": "Microsoft shares reason behind its recent Windows server issues",
    "date": "3/22/2024",
    "url": "https://www.androidheadlines.com/2024/03/microsoft-shares-reason-behind-its-recent-windows-server-issues.html",
    "text": "Sign Up! \n\nenvelope_alt Get the latest Android News in your inbox every day \n\narrow_right Sign up to receive the latest Android News every weekday: Only send updates once a week Android News / Microsoft shares reason behind its recent Windows server issues Alongside releasing a fix for the recent bugs in Edge and implementing control panel features inside Settings, Microsoft has officially acknowledged and accepted responsibility for its recent server crash issues and informed that the reason was a critical memory leak in the system. The issue was introduced with the March 2024 Windows Server Security Update. It has been causing widespread crashes in Windows domain controllers. The reason behind the recent Microsoft server issues was a memory leak in the LSASS process. It affected servers running Windows Server 2022, 2019, 2016, and 2012 R2. Following widespread reports and complaints from system administrators,Advertisement\n\n\nAdvertisement Microsoft confirmed that the issue was caused by the update released on March 12. It was the OS Build 20348.2340 or KB5035857. Affected servers experience unexpected freezes and restarts, with LSASS memory usage continuously increasing until system failure occurs. Microsoft has assured users that they are actively working on developing a fix for the issue. And they will release it in the coming days. The company acknowledges the severity of the problem and emphasizes its commitment to resolving it promptly. While Microsoft has made progress in identifying the root cause, they stated that uninstalling the problematic update appears to be the only temporary solution at this time. It is worth noting that this issue specifically impacts environments within organizations that utilize certain Windows Server platforms, with home devices remaining unaffected by the update. The recent memory leak problem is not the first time Microsoft has encountered issues related to LSASS. Similar incidents occurred in December 2022 and March 2022, where memory leaks in LSASS resulted in unexpected domain controller reboots after installing Windows Server updates. Microsoft has previously addressed such issues with patches and updates. While Microsoft works to develop and deploy a fix for the memory leak problem, affected organizations are advised to monitor official communications from Microsoft for updates and instructions on how to proceed. In the meantime, system administrators can take necessary precautions to mitigate the impact of the issue on their environments. Additionally, administrators may consider implementing backup and recovery strategies to safeguard critical data and minimize disruptions caused by this kind of incident. Copyright ©2024 Android Headlines. All Rights Reserved. Debasish has been a keen observer of technologies associated with consumer electronics since gaining access to the internet. You'll find him learning about and sharing information regarding innovations in the smartphone world, if not lost somewhere in the wild with a camera. Main Deals & More Android News Sign Up! \n\nenvelope_alt Get the latest Android News in your inbox every day \n\narrow_right Sign up to receive the latest Android News every weekday: Only send updates once a week "
}