{
    "title": "Google, Microsoft and Meta no longer top list of best places to work: Survey",
    "date": "1/11/2024",
    "url": "https://www.hindustantimes.com/world-news/google-microsoft-and-meta-no-longer-top-list-of-best-places-to-work-101704951223691.html",
    "text": "Subscribe Now! Get features like Google and Microsoft’s rankings have significantly fallen on Glassdoor’s list of the top 100 companies to work in 2024. Google’s ranking sank from No. 8 to No. 26, and Microsoft’s plummeted from No. 13 to No. 18. Companies like Meta, Zillow, and Zoom did not appear on the list at all, for the second year in a row. This list generally comprises the top companies in the UK and US with 1,000 or more workers, and is decided on the basis of feedback from employees. The latest rankings were released on Wednesday, January 10. Other companies that earlier made it to the list dropped off the rankings, including Gainsight and Box. As many as 41 tech companies made to the list last year. This year, only 31 did. Notably, tech companies across several companies laid off over 260,000 employees last year alone, as per online tracker layoffs.fyi. More than 2,000 workers in the sector have already been laid off in onl the first nine days of 2024. Employees across the globe are thus bound to be unhappy. Rankings of companies like Google, Meta, Zoom, and Zillow have dropped because of layoffs, long hours, and bad management, according to Glassdoor reviews. “Even for large companies that have traditionally been stable, we heard employees were increasingly concerned about their employers’ business outlook,” Glassdoor’s lead economist, Daniel Zhao, told Quartz. However, on the contrary, Apple made it to No. 39 on the list after being absent from it last year. The company had fewer layoffs compared to other firms. Chipmaker NVIDIA ranked at No. 2. Bain & Company featured at the top. Here are the top 20 companies on Glassdoor's 2024 ranking:        "
}