{
    "title": "Charted: 20 Years of Apple vs. Microsoft, b y Market Capitalization",
    "date": "1/26/2024",
    "url": "https://www.visualcapitalist.com/apple-vs-microsoft-20-years/",
    "text": "Swiss Watches: Market Share by Brand in 2023 Charted: Luxury Goods Investments vs. S&P 500 in the Last 10 Years Visualizing the World’s Largest Sovereign Wealth Fund The 12 Worst Investment Funds Over the Past Decade Visualizing the Biggest Companies on Major Stock Exchanges Mapped: Internet Download Speeds by Region The World’s Biggest Cloud Computing Service Providers The World’s Largest Corporate Holders of Bitcoin Charted: The Jobs Most Impacted by AI Advanced Semiconductor Market Share by Country (2023-2027F) Who Expects to Get Richer in 2024, by Both Generation and Gender Chart: The Declining Value of the U.S. Federal Minimum Wage Who are the World’s Richest People in Finance? The World’s Top 50 Largest Banks by Consolidated Assets Visualizing All of the U.S. Currency in Circulation The Cost of an EpiPen in Major Markets Charted: Global Tobacco Use by Country and Sex Visualized: What Lives in Your Gut Microbiome? Charted: Average Years Left to Live by Age Charted: The Average Cost of Insulin By Country The World’s Biggest Oil Producers in 2023 How Much Does the U.S. Depend on Russian Uranium? Charted: Global Uranium Reserves, by Country Visualizing the Rise of the U.S. as Top Crude Oil Producer 2024 U.S. Clean Electricity Outlook Mapped: Asia’s Population Patterns by Density A Map of Global Happiness By Country in 2024 Mapped: Population Growth by Region (1900-2050F) Mapped: Breaking Down the $3 Trillion African Economy by Country Mapping Credit Card Delinquency Rates in the U.S. by State Charted: Global Uranium Reserves, by Country The Periodic Table of Commodity Returns (2014-2023) China Dominates the Supply of U.S. Critical Minerals List The Critical Minerals to China, EU, and U.S. National Security All the Metals We Mined in One Visualization The World’s Top Cocoa Producing Countries Charted: Share of World Forests by Country 2024 U.S. Clean Electricity Outlook Chart: Is ESG Investing in Decline? Which Countries Have the Largest Forests? Published on By See this visualization first on the Voronoi app.  This was originally posted on our Voronoi app. Download the app for free on iOS or Android and discover incredible data-driven charts from a variety of trusted sources. For years, Apple and Microsoft have been switching places as the world’s most valuable company, in terms of market capitalization. In today’s chart, we explore this history, as well as key events over the past two decades, based on data from CompaniesMarketCap and both companies. Data is from January 16, 2024. During the 1990s, Microsoft capitalized on the success of Windows, supplanting General Electric as the most valuable company in the U.S. in the process. Around the same time, Apple was on the brink of bankruptcy due to intense competition in the personal computer market, high product pricing, and a lack of innovation. The company also suffered from numerous failed attempts to modernize the Macintosh operating system (Mac OS) and the failed launches of products like QuickTake digital cameras, PowerCD portable CD, audio players, speakers, and the Pippin video game console. Over the next decade, however, after the return of Steve Jobs as the CEO, Apple’s stock performance was legendary. This can be attributed to the success of products such as the iMac, iPod, and iPhone, the launch of the famous “Think Different” advertising brand campaign, and opening the Apple Store retail chain. In 2004, Microsoft had a market cap of $291 billion compared to Apple’s $26 billion. By the end of that decade, Apple would reach $297 billion, surpassing its rival ($234 billion). *As of January 2024 Since then, the top spot has been most often held by Apple. The company only fell behind Microsoft in 2018 when concerns about COVID-driven supply chain shortages affected the iPhone maker’s stock price. More recently, the Apple vs. Microsoft race was shaken up once again. Microsoft became the world’s most valuable company in January 2024, after the rival iPhone maker’s shares had a weak start to the year due to growing concerns over demand in China. Microsoft’s shares have also been strongly buoyed by the company’s early lead in generative artificial intelligence, mainly thanks to its early investment in ChatGPT-maker OpenAI. Ranked: The 15 Best-Selling Mobile Phones of All Time Ranked: The Most Popular AI Tools The World’s Biggest Cloud Computing Service Providers Visualizing the Biggest Companies on Major Stock Exchanges Will Tesla Lose Its Spot in the Magnificent Seven? Visualizing iPhone 15 Production by Manufacturer in 2023 Visualizing Microsoft’s Revenue, by Product Line The Richest People in the World in 2024 North America and East Asia have the speediest internet. Published on By This was originally posted on our Voronoi app. Download the app for free on iOS or Android and discover incredible data-driven charts from a variety of trusted sources. In today’s fast-paced world, internet speed isn’t just a convenience—it’s the driving force behind how we work, play, and connect. In this map, we illustrate median download speeds in each global region, based on data from the World Bank’s Digital Progress and Trends Report 2023. According to the World Bank, download speeds in high-income countries increased significantly between 2019 and 2023, while speeds in lower-income countries stagnated. As of 2022, North America and East Asia have the speediest internet. This difference in broadband speeds can mainly be attributed to investment. In 2020, nearly 90% of global telecommunication investment came from East Asia and the Pacific, Europe and Central Asia, and North America. These regions not only concentrate the highest-income population but also the top technology hubs. Meanwhile, low- and middle-income regions such as Latin America and the Caribbean, South Asia, and Sub-Saharan Africa accounted for less than 10% of total investment. Most of the investment is directed towards fiber optic and 5G mobile networks. According to the mobile industry association GSMA, mobile operators alone are projected to invest more than $600 billion between 2022 and 2025, with 85% of the total allocated for 5G. In 2023, broadband speeds in high-income countries were 10x faster for fixed connections, and 5x faster for mobile connections compared to those in low-income countries. Fixed broadband connections, which provide high-speed internet to residences or businesses, reached 38% of the population in high-income countries. In comparison, fixed broadband penetration was only 4% of the population in lower-middle-income countries and almost zero in low-income countries. Mapped: Asia’s Population Patterns by Density Visualizing the Green Investments of Sovereign Wealth Funds Ranked: The 20 Top Chinese Stocks by Market Cap, and Performance YTD Will Tesla Lose Its Spot in the Magnificent Seven? Charted: The Jobs Most Impacted by AI Visualizing the Biggest Companies on Major Stock Exchanges The World’s Top 50 Largest Banks by Consolidated Assets Visualizing the Declining Birth Rate in Japan Copyright © 2024 Visual Capitalist "
}