{
    "title": "Bringing the full power of Copilot to more people and businesses - The \nOfficial Microsoft Blog",
    "date": "1/15/2024",
    "url": "https://blogs.microsoft.com/blog/2024/01/15/bringing-the-full-power-of-copilot-to-more-people-and-businesses/",
    "text": "Jan 15, 2024\n\n| \n\tYusuf Mehdi - Executive Vice President, Consumer Chief Marketing Officer As we kick off a new year, we’re thrilled to see people increasingly using and loving Microsoft Copilot for work and life. Our goal is to empower every person and every organization on the planet to achieve more by bringing Copilot, the everyday AI companion, to millions of people around the world. We have reached another milestone in this mission with more than 5 billion chats and more than 5 billion images to date. As Copilot continues to earn preference and usage, we’re receiving valuable feedback on how to improve. Two examples: First, there are a set of Copilot power users like creators, researchers, programmers and others who want more rapid access to the very latest we have to offer. And second, our Microsoft 365 customers want access to Copilot in the Microsoft 365 apps for personal use. To help address those needs, today we’re delighted to announce more options for power users, creators and anyone looking to take their Copilot experience to the next level. This begins with the introduction of Copilot Pro, a new premium subscription for individuals that provides a higher tier of service for AI capabilities, brings Copilot AI capabilities to Microsoft 365 Personal and Family subscribers, and new capabilities, such as the ability to create Copilot GPTs. We are also announcing the general availability of our Copilot app for iOS and Android phones. Finally, we’re excited to bring Copilot for Microsoft 365 to more commercial customers by expanding the availability to businesses of all sizes, including small- and medium-sized businesses, starting today. Introducing Copilot Pro: Supercharge your creativity and productivity Today we’re announcing the availability of Copilot Pro, a new subscription that delivers the most advanced features and capabilities of Microsoft Copilot to individuals looking to supercharge their Copilot experience. Whether you need advanced help with writing, coding, designing, researching or learning, Copilot Pro brings greater performance, productivity and creativity. Copilot Pro provides: You can subscribe to Copilot Pro today for $20 per month/per user. YouTube Video Click here to load media Expanding Copilot for Microsoft 365 to businesses of all sizes While Copilot Pro is our best experience for individuals, Copilot for Microsoft 365 is our best experience for organizations. Copilot for Microsoft 365 became generally available for enterprises in November. As we said earlier this year, 40% of the Fortune 100 participated in our Early Access Program, and since GA for enterprise, customers like Visa, BP, Honda, Pfizer, and partners like Accenture, KPMG and PwC are already using Copilot — which means thousands of people across industries and sectors have started working in new ways, with an AI-powered copilot at their side. Today we are excited to announce that Copilot for Microsoft 365 is now available for organizations of all sizes — with no seat minimum. We are also enabling our partners to help every business become AI-powered. Today’s updates include: Copilot for Microsoft 365 is even more powerful for organizations because it works across your entire universe of data at work — including emails, meetings, chats, documents and more, plus the web. With natural language prompts like “Tell my team how we updated the product strategy,” Copilot can generate a status update based on the morning’s meetings, emails and chat threads. Copilot is also integrated into the apps millions of people use every day, including Microsoft Teams (which is not available with Copilot Pro). Copilot jump-starts your creativity in Word, analyzes data in Excel, designs presentations in PowerPoint, triages your Outlook inbox, summarizes meetings in Teams – whether you attended or not – and so much more. Backed by enterprise-grade security, privacy, and compliance, and Microsoft’s Customer Copyright Commitment, we can’t wait to see how businesses of all sizes achieve more using AI. Learn more on the Microsoft 365 blog. Introducing new features in Copilot As we expand the availability of Copilot to even more people, we continue to offer a great free experience for anyone interested in exploring how Copilot can transform productivity and creativity using AI. Today we’re excited to share additional updates to Copilot. You can get started by visiting copilot.microsoft.com. With today’s announcements, we continue to bring Copilot to more customers with more options that work for them. Whether you’re looking to get started with Copilot for free, want to supercharge your Copilot experience with Copilot Pro or are an SMB or Enterprise customer looking to increase your productivity in new ways with Copilot for Microsoft 365, there’s a Copilot experience for everyone.   [i] Currently in preview, English only Tags: AI, Copilot Pro, Microsoft 365 Copilot Dec 5, 2023\t\t\t\t\t\t\t\t\n|\nYusuf Mehdi Dec 4, 2023\t\t\t\t\t\t\t\t\n|\nFrank X. Shaw Dec 14, 2023\t\t\t\t\t\t\t\t\n|\nCorey Sanders Nov 15, 2023\t\t\t\t\t\t\t\t\n|\nFrank X. Shaw Nov 7, 2023\t\t\t\t\t\t\t\t\n|\nCharlotte Yarkoni Follow us: "
}