{
    "title": "Microsoft tailors AI for finance teams in specialized 'Copilot' strategy",
    "date": "2/29/2024",
    "url": "https://wtaq.com/2024/02/29/microsoft-tailors-ai-for-finance-teams-in-specialized-copilot-strategy/",
    "text": "By Jeffrey Dastin (Reuters) –     Microsoft on Thursday previewed an artificial intelligence tool for customers’ finance departments, part of a strategy tailoring new software to industries, professionals and ultimately individuals. The company said its tool, called Microsoft Copilot for Finance, helps users review data sets for risks, produce reports from raw numbers, and generally handle tasks they might otherwise outsource. It did not announce pricing or a date for wider availability. The new AI tool follows similar ones Microsoft has marketed for salespeople and customer-service representatives. Those typically cost $20 per user per month, on top of the subscription fees for software necessary to use these tools, such as its $30 Copilot for Microsoft 365. Emily He, a corporate vice president, told reporters that Microsoft may tailor future Copilots for marketing and supply-chain work. The company’s efforts to sell AI that handles sales and service tasks adds to its competition with Salesforce, which has a big focus on those areas. Salesforce on Tuesday announced availability for a competing AI assistant called Einstein Copilot. In a San Francisco media briefing, Microsoft demonstrated how its specialized AI could help customers generate emails or perform tasks while drawing from “customer relationship management” (CRM) systems made by it or Salesforce. Charles Lamanna, a Microsoft corporate vice president, told reporters that sellers will go to a CRM “far less, maybe never in the future, because Copilot will basically on their behalf go and keep the CRM up to date and pull the information from the CRM.” Such systems will remain in active use in the background, but the business models supporting them may well change, Lamanna said. (Reporting By Jeffrey Dastin in San Francisco; Editing by Varun H K) You must be logged in to post a comment. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}