{
    "title": "Massive news! You can now install Google Chrome from the Microsoft Windows \nStore",
    "date": "2/16/2024",
    "url": "https://mspoweruser.com/massive-news-can-now-install-google-chrome-microsoft-windows-store/",
    "text": "Follow us Share this article Improve this guide 1 min. read Updated on February 16, 2024 updated on \n\nFebruary 16, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more  We may not have gotten iTunes in the Microsoft Store this year, but Google has managed to deliver something better. In theory you should not be able to offer browsers with rendering engines other than Microsoft’s own from the Microsoft Store, but Google managed to make an end run around this restriction by offering the Google Chrome Installer directly from the Store. This means you no longer need to use Edge to download Google Chrome, with the browser losing its main function for many. It also means you can install the browser on your PC even if you do not have admin privileges, as long as store downloads are allowed. Alternatively, you can use the Chrome offline installer. Unfortunately, this does not mean Windows 10S is supported, but for everyone else, it means greater access to the most popular browser in the world. Find the installer in the Windows Store here. [appbox windowsstore 9n1kzwv3trgh ] Update: And it’s gone. Microsoft has removed it for violating their store policies. Read more here. Via Windows Latest. More about the topics: app, browser, google chrome, Microsoft Store, windows 10, windows store Surur Davids Smartphone Expert Surur Davids is the founder of WMPoweruser which later became MSPoweruser.com. He's a smartphone expert with over a decade of experience. Surur Davids Smartphone Expert Surur Davids is the founder of WMPoweruser which later became MSPoweruser.com. He's a smartphone expert with over a decade of experience. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}