{
    "title": "The 3 Best Dow Jones Stocks to Invest In for Big Gains in 2024",
    "date": "2/2/2024",
    "url": "https://investorplace.com/2024/02/the-3-best-dow-jones-stocks-to-invest-in-for-big-gains-in-2024/",
    "text": " These blue-chip names deliver solid and consistent returns to their shareholders Advertisement Source: Venturelli Luca / Shutterstock.com The Dow Jones Industrial Average continues to scale new heights. On Jan. 22, the index closed above 38,000 for the first time and set a new all-time high. After trailing the technology-filled Nasdaq index for much of 2023, the Dow, comprised of 30 blue-chip stocks, has been running hot since the market turned around at the end of last October. The index has been powered to new heights as many of its leading stocks outperform and hit record highs. Declining bond yields, strong economic data and the Federal Reserve’s promise to lower interest rates later this year are also helping to lift the Dow 30. With a so-called “soft landing” coming into view, it’s reasonable for investors to expect the Dow to push further into record territory as the year progresses. Here are the three best Dow Jones stocks for big gains in 2024. JPMorgan Chase (NYSE:JPM) outperforms most other bank stocks. The lender’s earnings have run circles around other big U.S. financial institutions, and it even came ahead following the regional banking crisis in the spring of 2023. As a result, JPM stock has risen 24% over the last 12 months compared to an 8% decline in the S&P Banks Select Industry Index. As the world’s largest bank, with $4 trillion of assets under management, there’s reason to expect the outperformance to carry on. In January, JPMorgan reported mixed fourth-quarter 2023 financial results, which it blamed on a $2.9 billion fee it paid related to the government’s seizure of failed regional lenders. JPMorgan reported earnings per share (EPS) of $3.04, which fell short of the $3.32 analysts had expected. Revenue amounted to $39.94 billion, topping the $39.78 billion forecast. JPMorgan is expected to benefit from a rebound in deals such as mergers and acquisitions and initial public offerings this year. Microsoft (NASDAQ:MSFT) reported very strong quarterly results and continues to be a leader in artificial intelligence, making it one of the best Dow Jones stocks to invest in for big gains in 2024. Driven by growth in its cloud-computing segment, Microsoft reported EPS of $2.93 versus the $2.78 forecast among analysts. Revenue totaled $62.02 billion compared to the $61.12 billion that was estimated. The company’s sales increased 17.6% year-over-year in the final quarter of last year. Cloud computing continues to be a big strength for Microsoft, with revenue from Azure and other cloud services growing 30% yoy in the latest quarter. Additionally, Microsoft is starting to monetize its AI offerings, which should be a big growth driver for the company going forward. In Q4 2023, the company started selling a $30 monthly Copilot AI add-on to its 365 productivity software bundles. More AI monetization is sure to be forthcoming. MSFT stock has gained 60% in the last year. Investors who take a position in discount retailer Walmart (NYSE:WMT) now get to take advantage of an upcoming three-for-one stock split. It’s the first stock split by Walmart since 1999 and will be paid to record stockholders on Feb. 22 of this year. News of the split comes with Walmart’s stock trading near an all-time high of around $170 per share. The company said it is splitting the stock, in part, to allow more employees to buy into its stock purchase plan. Apart from the stock split, Walmart continues to thrive as customers turn to its low-price guarantee during times of high inflation and high interest rates. Walmart’s sales have held up better than those of its competitors over the last year as its pivot to become the largest grocery retailer in America pays off. While consumers have cut back on discretionary items, they continue relying on Walmart for groceries and other essentials. WMT stock is up 16% over the past year. On the date of publication, Joel Baglole held a long position in MSFT. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/the-3-best-dow-jones-stocks-to-invest-in-for-big-gains-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}