{
    "title": "Microsoft, Google want to push hard into AI. Ballooning costs, shareholders \nmay hold them back",
    "date": "2/1/2024",
    "url": "https://www.firstpost.com/tech/microsoft-google-want-to-push-hard-into-ai-ballooning-costs-shareholders-may-hold-them-back-13676332.html",
    "text": "Microsoft and Google have been investing heavily into AI and AI bots. However, because of ballooning costs, and pressure from shareholders, they might have to slowdown and justify their expenditure Microsoft and Google are eager to advance their efforts in generative artificial intelligence (AI), but they face potential resistance from shareholders due to the escalating costs associated with this pursuit. Despite strong quarterly results, both companies warned of substantial investments in data centres and servers throughout the year to develop cutting-edge AI products, dampening investor optimism about financial gains from generative AI. Microsoft’s partnership with OpenAI, involving a commitment of up to $13 billion, propelled it into the forefront of the generative AI race, boosting its share price by over 60 per cent in the past year and surpassing Apple as the world’s largest company. However, investors remain cautious as Microsoft and Google project higher capital expenditures in 2024 for technological infrastructure supporting generative AI. In the final quarter of 2023, Microsoft reported a 20 per cent rise in cloud revenues to $25.9 billion, exceeding analysts’ expectations. Azure platform sales grew by 30 per cent, driven by increased demand for Microsoft’s AI services. Google Cloud is anticipated to be a crucial growth driver for Alphabet, particularly with the upcoming launch of Gemini Ultra, an advanced upgrade to its chatbot, Bard. Both companies underscored the significance of investing in AI infrastructure, with Microsoft CEO Satya Nadella revealing 53,000 Azure AI customers and an increase in billion-dollar-plus Azure commitments. However, Microsoft expects a slight deceleration in revenue growth for its cloud division in the current quarter. While the companies emphasize cost control and rising demand for cloud services, shareholders remain concerned about the impact on margins. Microsoft’s CFO, Amy Hood, indicated a significant increase in capital spending driven by cloud and AI infrastructure investments. Despite uncertainties, the companies are forging ahead with an “AI-first” workforce, reflecting a strategic shift in focus. The race for AI dominance is intensifying, with analysts closely monitoring developments, including the adoption of Microsoft’s generative AI assistant, Copilot. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}