{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.woodtv.com/business/press-releases/globenewswire/9041986/accruent-amplifies-cloud-collaboration-with-microsoft-to-accelerate-business-productivity/",
    "text": "WOODTV.com Please enter a search term. Please enter a search term. News provided by Feb 27, 2024, 9:00 AM\t\t\t\t\t\tET Austin, TX, Feb.  27, 2024  (GLOBE NEWSWIRE) -- Accruent, a leading provider of workplace and asset management solutions, today announced an expanded collaboration with Microsoft. This collaboration designates Microsoft Azure as the primary hosting platform for Accruent’s SaaS software solutions, highlighting a shared commitment to delivering cutting-edge technologies. The strengthened commitment to Azure underscores Accruent's mission to boost business productivity through the adoption of modern solutions, including the latest AI and machine learning technologies, such as Azure OpenAI Service. This enables Accruent to unify its suite of solutions under one provider, simplifying processes and ensuring consistency, while continuing to deliver secure, scalable, and reliable cloud environments. The collaboration with Microsoft prioritizes business productivity to meet the evolving needs of customers, through: · Expanded Global Network: Azure's expansive network of data centers worldwide enables reliable and secure access to Accruent solutions globally. · Robust Security and Compliance: Azure offers comprehensive, multi-layered security features, including data encryption, threat detection, and compliance certifications that enhance protection of business assets and data. · Enhanced Integration Capabilities: The relationship fosters seamless integration between Accruent solutions and a range of Azure services, including data services, serverless environments, and future offerings like AI and advanced reporting. This empowers Accruent customers to fully leverage their Accruent technology investments and stay ahead of the curve. \"By deepening our relationship with Microsoft and harnessing the power of Microsoft Azure, we're enhancing our ability to deliver intelligent, AI-driven solutions to our customers,\" said Richard Leurig, CPTO at Accruent. \"This collaboration signifies a significant stride in our ongoing commitment to providing innovative, industry-leading solutions.\" \"We're pleased to strengthen our collaboration with Accruent, a company that shares our vision for the transformative potential of the cloud,\" said Gary Nafus, VP of Sales at Microsoft. \"Our combined efforts aim to further enhance productivity for customers by using our robust commitment to security, while continuously investing in AI-driven solutions.\" The relationship also enables Accruent to tap into additional Microsoft resources such as Microsoft Industry Experience Centers and Azure Marketplace, where it will sell its SAAS-based solutions. This not only propels technological innovation but also paves the way for operational efficiency at scale, demonstrating our unwavering commitment to customer value.  ABOUT ACCRUENT Accruent is a leading provider of solutions for unifying the built environment — spanning real estate, physical and digital assets, and the integrated technology systems that connect and control them. Accruent continues to set new expectations for how organizations can use data to transform how they manage their facilities and assets. With U.S. headquarters in Austin, Texas, Accruent serves over 5,000 customers in a wide range of industries in more than 100 countries worldwide. Accruent is a registered trademark of Accruent, LLC or its subsidiaries in the United States and other jurisdictions. ©2024 All Rights Reserved. NOTE: This content is not written by or endorsed by \"WOOD\", its advertisers, or Nexstar Media Inc. "
}