{
    "title": "New Microsoft data centre 'significant' for South Africa",
    "date": "2/8/2024",
    "url": "https://techcentral.co.za/microsoft-data-centre-south-africa-idc/239421/",
    "text": "Get the best South African technology news and analysis delivered to your e-mail inbox every morning.   Microsoft’s plan to build a new data centre in Centurion, in Tshwane, shows the group’s commitment to extending the commercial cloud services available to South African companies and represents a significant new investment in the country. That’s the view of Jon Tullett, senior research manager at International Data Corporation (IDC), who said: “We tend to be blasé as there are so many data centres going up in Africa now, but this is a sign of commitment from Microsoft. It’s an investment, and any new infrastructure like this is like an aircraft carrier – it brings with it jobs and skills and all sorts of attendant industries.” Tullett said a data centre takes years of planning, and that this move will have been made a couple of years ago in response to market demand. “One of the difficulties with the cloud is that it’s billed in US dollars, so there is volatility built into the pricing – and so far no one has responded to the pressure for local pricing except, for the first time, Alibaba Cloud, last year. “So, I would say one of the reasons Microsoft is expanding in Centurion is perhaps to meet this customer need, as well as cater to growing customer demand. Historically, Microsoft as a service has been strong, but it may well be responding to competition from other strong players like Amazon.” Tullett suggested that the new data centre might start out life as a facility ring-fenced to handle government business, or specific financial services, before developing into a general-purpose cloud centre, but he emphasised this is speculation. He is certain of pent-up demand for a government-focused service, however. “Cloud is in a high growth phase in South Africa. It is undergoing modernisation and growing in complexity and maturity, and growing at a rate of 20%/annum. All of this is great to see,” he said. Microsoft has a 30-year history in the country and the company said it is committed to accelerating the pace of technology transformation by investing in infrastructure and skills. It already has several data centres in Johannesburg and Cape Town. A recent IDC report on the state of cybersecurity in South Africa showed that nearly half (48%) of organisations in the country are using cloud as a platform and driver of digital innovation.  – © 2024 NewsCentral Media Google opens its first Africa cloud data centre – in Joburg  Get the best South African technology news and analysis delivered to your e-mail inbox every morning.   Type above and press Enter to search. Press Esc to cancel. "
}