{
    "title": "Microsoft to invest 3.2 bln eur in Germany in AI push",
    "date": "2/15/2024",
    "url": "https://www.thehindu.com/sci-tech/technology/microsoft-to-invest-32-bln-eur-in-germany-in-ai-push/article67849259.ece",
    "text": "To enjoy additional benefits CONNECT WITH US February 15, 2024 05:47 pm | Updated 05:47 pm IST - BERLIN COMMents SHARE READ LATER FILE PHOTO: Microsoft logo is seen near computer motherboard in this illustration taken January 8, 2024. REUTERS/Dado Ruvic/Illustration/File Photo\n| Photo Credit: Dado Ruvic U.S. software giant Microsoft will invest 3.2 billion euros ($3.44 billion) in Germany in the next two years with a focus on artificial intelligence, Microsoft chairperson Brad Smith said at an event in the German capital on Thursday. In the biggest investment made by the company in Germany in the last 40 years, Microsoft will spend mostly on setting up data centres and on training people in artificial intelligence in 2024 and 2025. \"We are doing this today because of the enormous confidence we have in Germany,\" said Smith. German Chancellor Olaf Scholz welcomed the move, saying it represented a vote of confidence for Europe's biggest economy. (For top technology news of the day, subscribe to our tech newsletter Today’s Cache) Marianne Janik, CEO of Microsoft Germany, declined to say exactly where the investments would be made, but said they were mostly looking in the western Rhineland region and around the banking hub of Frankfurt. COMMents SHARE technology (general)\n\n/\n\ninternet\n\n/\n\nArtificial Intelligence\n\n/\n\nWorld\n\n/\n\nbusiness (general) BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. "
}