{
    "title": "A scalable quantum computer developed by Microsoft is on the way",
    "date": "2/9/2024",
    "url": "https://windowsreport.com/a-scalable-quantum-computer-developed-by-microsoft-is-on-the-way/",
    "text": "Follow us Share this article Latest news Quantum computers might soon help us with research and complicated calculations 2 min. read Published on February 9, 2024 published on \n\nFebruary 9, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more The Defense Advanced Research Projects Agency (DARPA) invests in Microsoft Azure Quantum to create a scalable quantum computer. In fact, Microsoft just announced on their blog that DARPA is continuing their commitment with the Redmond giant.. A scalable quantum computer is a device that can handle an expanding number of tasks while increasing its stability as well. Thus, with the help of Microsoft, DARPA tries to create such a device. To build it, Microsoft will use topological quantum bits. After all, they are far better than normal qubits due to their built-in error protection. If Microsoft manages to develop a fault-tolerant prototype, the device could mark the beginning of quantum computing. Furthermore, with time, they might be able to develop the utility-scale quantum computer that’s supposed to work with real-world applications. However, the FTP will have to process multiple tasks before establishing a baseline for a quantum computer. On top of having access to the designs of the prototype for the scalable quantum computer, DARPA will closely monitor and verify other discoveries made by Microsoft Azure Quantum during this process. Ultimately, with a utility-scale quantum computer, it will be possible to lessen the time spent by researchers to test their prototypes. As a result, their focus might shift towards ideas and theories. Thus, the supercomputer will handle the trial-by-error aspects of their work. To find out more, check out the Innovator Series. Also, if you are interested, you can discover more about the Azure Quantum Elements. What are your thoughts? Do you need a quantum computer? Let us know in the comments. More about the topics: microsoft Sebastian Filipoiu Sebastian Filipoiu Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}