{
    "title": "Microsoft to use Intel 18A process node to manufacture its own chip",
    "date": "2/21/2024",
    "url": "https://mspoweruser.com/microsoft-to-use-intels-18a-process-node-to-manufacture-its-own-chip/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on February 21, 2024 published on \n\nFebruary 21, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes At Intel’s first foundry event, Intel Foundry Direct Connect, Microsoft CEO Satya Nadella confirmed that Microsoft will be using Intel’s upcoming 18A process to manufacture one of its own chip design. The Intel 18A process offers the foundry industry’s first backside power solution. This innovative design optimizes power distribution, resulting in potential performance and efficiency gains. Intel will use ASML’s cutting-edge High-NA (High Numerical Aperture) Extreme Ultraviolet Lithography machines for manufacturing 18A chips. High-NA EUV offers far greater resolution, enabling the intricate patterning required at this microscopic scale.  Intel 18A introduces RibbonFET, Intel’s first new transistor architecture since their groundbreaking FinFETs over a decade ago. RibbonFETs are a type of Gate-All-Around (GAA) transistor, providing better performance and power efficiency compared to FinFETs. “We are in the midst of a very exciting platform shift that will fundamentally transform productivity for every individual organization and the entire industry,” Nadella said. “To achieve this vision, we need a reliable supply of the most advanced, high-performance and high-quality semiconductors. That’s why we are so excited to work with Intel Foundry, and why we have chosen a chip design that we plan to produce on Intel 18A process.” Last year, Microsoft announced two in-house designed silicon chipsets, the Maia 100 AI Accelerator and the Cobalt 100 CPU. Since these chipsets are already under deployment, Microsoft may use Intel 18A process to manufacture successors to Maia 100 and Cobalt 100. Intel also confirmed that they are ready to manufacture ARM-based chip designs as part of its foundry business. More about the topics: intel, Intel 18A, microsoft Pradeep Viswav Software and Services Expert Pradeep is a Computer Science and Engineering Graduate. He was also a Microsoft Student Partner. He is currently working in a leading IT company. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Pradeep Viswav Software and Services Expert Pradeep is a technical manager at a large tech company and a seasoned technology blogger. He reports on software, hardware, industry trends, and more. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}