{
    "title": "Does this Mark the End of the Windows Mixed Reality?",
    "date": "2/12/2024",
    "url": "https://www.xrtoday.com/mixed-reality/does-this-mark-the-end-of-windows-mixed-reality/",
    "text": "Home → Mixed Reality Following no mention during a fiscal year earnings call, Microsoft drops MR support on latest Windows 11 update Published: February 12, 2024 Rory Greener With the debut of Vision Pro and spatial computing hitting the mainstream, audiences could reasonably assume that firms with established XR projects and products, such as Microsoft or Snap, would re-establish their investments in XR. However, it appears that despite using the spatial computing term before Apple, Microsoft is dropping more support for Windows Mixed Reality – a framework for enabling consumer-based desktop-powered MR experiences. Recent reports highlight how, in its most recent Windows 11 24h2 update, Microsoft is removing some support frameworks for its MR hardware and software portfolio. The update sees Windows Mixed Reality hit the firm’s “Deprecated Features” list, which congregates features that Microsoft is no longer working on. Profoundly suggesting that Microsoft is dropping support for the product. However, the list description notes, “occasionally, new versions also remove features and functionality, often because they’ve added a newer option,” so there could be a new version of the Mixed Reality product coming – this is not confirmed, though. Still, currently, MR support appears to have been dropped. Microsoft is stopping development on MR functions on Windows 11, and according to reports, Microsoft is stopping compatibility on 1 November 2026 for Windows Home and Pro users and 1 November 2027 for Windows Commercial. Moreover, if Windows Mixed Reality users need support for their XR products, Microsoft will no longer provide it. However, despite lacking support for Mixed Reality on Windows 11, Microsoft notes that “this deprecation doesn’t affect HoloLens. We remain committed to HoloLens and our enterprise customers.” Microsoft recently shared details about its Fiscal Year 2024 Second Quarter earnings call. The call covered various topics, including genAI. However, it’s interesting to note that despite Microsoft’s increased focus on developing XR solutions since mid-2023, they did not mention their MR/spatial applications, HoloLens 2, or industrial metaverse roadmap during the call. While Microsoft’s primary focus is providing diverse digital solutions beyond immersive technologies, the complete absence of XR in the call is notable. This is especially true considering that less than a year ago, the company shifted its investment away from XR in favour of genAI before picking it up again midway through the year. Microsoft continues to roll out its immersive solutions to enterprise end-users worldwide, including clients such as the US Army, Boeing, and SNC-Lavalin. “We’re also using this AI moment to redefine our role in business applications,” said Nadella. The emerging AI landscape is proving fruitful for Microsoft, with tangible financial benefits compared to its rocky road with XR over the past two years. Therefore, it’s understandable that Microsoft may be shifting its attention away from XR again despite the renewed interest in the space. “In 2024, AI will become a first-class part of every PC,” Nadella explained. Microsoft appears to be entirely focused on AI, which has proven successful, thanks in part to their partnership with leading genAI firm OpenAI. Even during the gaming segment of the earnings call, the most traditional use case for XR, Microsoft did not mention XR. Instead, they understandably referred to the power of AI in this space. In the latter half of 2023, Microsoft was actively working on strengthening the support system for Windows Mixed Reality and the industrial Metaverse roadmap despite the recent decrease in interest and investment. As part of this effort, Microsoft partnered with Magic Leap and Qualcomm in 2023, and together, they invested in scaling Microsoft’s Mixed Reality Toolkit 3 (MRTK3), an XR content creation platform for developers and enterprise partners. This partnership allowed the MRTK3 framework to transition to an independent organization within GitHub, which Microsoft owns. This move made MRTK3 easily accessible to a broader range of users and hardware developers, opening it to further investment. Robin Seiler, the Corporate Vice President and Chief Operating Officer of the Windows + Devices organization, Microsoft, explained: We believe that to be a true multi-platform toolkit that enables greater third-party collaboration, MRTK needs to be recognized as an independent organization that expands beyond Microsoft’s sole jurisdiction. That’s why we have moved MRTK3 Open-Source Software (OSS) outside of Microsoft into its own independent organization within GitHub. From MRTK’s inception, Seiler noted that Microsoft built it to “be cross-platform and open-source to benefit the entire ecosystem, not just HoloLens 2.” Despite solid partnerships in 2023, the firm’s recent Windows update may mark the end of Mixed Reality on consumer Windows devices; however, as Microsoft states, the move does not affect enterprise clients. Mixed Reality Tencent Involved in Apple Vision Pro’s China Launch – Reports Mixed Reality Will Apple Debut the Vision Pro In China this Year? Mixed Reality Could Major XR Partnerships Offset High-Risks and Costs? Mixed Reality XR Cloud Streaming to Break Down Enterprise Barriers, says Innoactive Mixed Reality IDC Predicts Surge in AR and VR Headset Shipments Mixed Reality Big XR News from NVIDIA GTC, Apple, LG, and HTC VIVE Share This Post Mixed Reality Tencent Involved in Apple Vision Pro’s China Launch – Reports Mixed Reality Will Apple Debut the Vision Pro In China this Year? Mixed Reality Could Major XR Partnerships Offset High-Risks and Costs? Get our Free Weekly Newsletter, straight to your inbox! Handpicked News, Reviews and Insights delivered to you every week. Tech Industries Trending Topics Featured Brands About More All content © Today Digital 2024 "
}