{
    "title": "Apple iMessage, Microsoft Bing dodge EU's Big Tech crackdown",
    "date": "2/13/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/apple-imessage-microsoft-bing-dodge-eus-big-tech-crackdown",
    "text": "APPLE’S iMessage and Microsoft’s Bing search engine, Edge web browser and advertising service will avoid strict new European Union (EU) rules reining in Big Tech platforms. A probe concluded that the services do not hold a dominant enough position to be regulated under the EU’s Digital Markets Act (DMA), the European Commission announced on Tuesday (Feb 13). Apple and Microsoft said they welcomed the decision. The decision from EU regulators is a win for the two US companies, which would have been obliged to adapt their services to meet a swathe of new obligations and prohibitions designed to limit market power abuses. The decision confirms an earlier Bloomberg News report that the services would escape the scope of the tech crackdown. The EU’s DMA strikes at the heart of the business models of six of the world’s most powerful technology companies deemed to be digital “gatekeepers”. While some of their services are now set to be exempt, Microsoft and Apple – alongside Meta Platforms, Alphabet’s Google, Amazon.com and TikTok owner ByteDance – will still face a raft of new obligations aimed at preventing them from abusing their dominance in other parts of their business. For Microsoft, this includes its Windows operating system for PCs and LinkedIn social media platform. For Apple, it includes its iOS mobile operating system, App Store and Safari browser. Under the law, it will be illegal for the designated companies to favour their own services over those of rivals. They will be barred from combining personal data across their different services, prohibited from using data they collect from third-party merchants to compete against them, and will have to allow users to download apps from rivals platforms. Start and end each day with the latest news stories and analyses delivered straight to your inbox. The new rules are set to fully come into play on Mar 7. BLOOMBERG BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}