{
    "title": "Microsoft Appoints Pavan Davuluri as New Chief for Windows and Surface",
    "date": "3/25/2024",
    "url": "https://www.techtimes.com/articles/302937/20240325/microsoft-appoints-pavan-davuluri-new-chief-windows-surface.htm",
    "text": " Microsoft has reportedly appointed Pavan Davuluri as the company's new chief for Surface, whilst maintaining his position as chief for Windows. Making both Windows and Surface under his command. Davuluri is set to replace Mikhail Parakhin, who is set to venture into \"new roles.\" The Verge was the first to report on the leadership transition. Rajesh Jha, Microsoft's chief of experiences and devices, has previously sketched the new Windows organization in an internal memo. Microsoft is now reuniting its teams for devices and Windows.  This change, according to the memo, will allow the company to design silicon, systems, experiences, and devices that transcend Windows client and cloud for this AI age in a comprehensive manner. Rajesh Jha is the direct boss of Microsoft's Windows and Surface team, which Pavan Davuluri currently leads. Having spent more than 23 years with Microsoft, Davuluri played a significant role in the company's collaboration with Qualcomm and AMD to develop customized Surface processors. Read Also: Microsoft Pays $650 Million to Inflection AI for Software Licensing, Staff Hiring As per Bloomberg, Microsoft states that Parakhin, who most recently served as CEO of online services and advertising, will report to Chief Technology Officer Kevin Scott while he looks for a new position. Additionally, Parakhin managed a portion of the Windows software division of the company. Pavan Davuluri, who had been in charge of Windows and hardware, will take over that work. The changes were announced in a staff email on Monday. Davuluri will now handle all Windows and Surface devices, reporting to Executive Vice President Rajesh Jha. The first change in the company's consumer AI products comes from Parakhin's departure from a key role. Last week, CEO Satya Nadella appointed Suleyman, a co-founder of DeepMind, as head of a coordinated push in the field. Nadella emphasized the significance of creating cutting-edge AI technologies like Copilot that appeal to end customers, stressing the critical role that innovation will play in determining the direction of the sector. Karén Simonyan, co-founder and chief scientist of Inflection, joined Suleyman in the Microsoft transition. She reportedly brings experience in AI research and development to the table. Among Simonyan's accomplishments is leading initiatives like AlphaZero. The inclusion of important members of the Inflection team has further enhanced Microsoft's AI skills. The seasoned engineers, researchers, and builders are said to be well-positioned to contribute their knowledge to consumer AI research and product development. According to two people familiar with Nadella's thinking, his action last week demonstrated his displeasure with his staff's work. Over the past year, Microsoft has been integrating AI into its Bing search engine, Windows, Office, and other products, launching a line of digital assistants under the Copilot brand. However, Bing's success versus Google, the market leader in search, has been minimal, and other products are still under development. Related Article: Microsoft Office 2021 Lifetime License Deals: This One-Time Purchase Only Costs $45  (Photo: Tech Times) Sign up for our free newsletter for the Latest coverage!   "
}