{
    "title": "Diaceutics (LON:DXRX) Earns Buy Rating from Canaccord Genuity Group",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/lon-dxrx-reiterated-rating-2024-03-21/",
    "text": "Canaccord Genuity Group reissued their buy rating on shares of Diaceutics (LON:DXRX - Free Report) in a report published on Thursday, MarketBeat reports. They currently have a GBX 150 ($1.91) target price on the stock. Shares of LON:DXRX traded up GBX 4.38 ($0.06) during trading on Thursday, reaching GBX 105.88 ($1.35). 47,905 shares of the stock were exchanged, compared to its average volume of 55,683. The firm's 50-day moving average price is GBX 96.52 and its 200 day moving average price is GBX 94.57. The firm has a market cap of £89.66 million, a price-to-earnings ratio of 10,500.00 and a beta of 0.42. Diaceutics has a 12-month low of GBX 79 ($1.01) and a 12-month high of GBX 110 ($1.40). The company has a debt-to-equity ratio of 3.07, a quick ratio of 9.92 and a current ratio of 7.99. In related news, insider Graham Paterson bought 33,564 shares of the firm's stock in a transaction dated Wednesday, March 6th. The stock was bought at an average price of GBX 99 ($1.26) per share, with a total value of £33,228.36 ($42,302.18). 36.31% of the stock is owned by insiders. Diaceutics PLC, a diagnostic commercialisation company, provides data, data analytics, and implementation services for pharmaceutical companies worldwide. It operates DXRX platform, which offers DXRX data solutions, including access to various pipelines of diagnostic testing data from a network of laboratories that provides DXRX signal, lab mapping, testing dashboard, and physician mapping services; DXRX marketplace solutions, which enables a marketplace, where labs, pharma, and diagnostic companies come to find partners for collaborations on precision medicine diagnostics.Recommended StoriesFive stocks we like better than DiaceuticsConference Calls and Individual InvestorsGoogle and Meta Circling the Market on a TikTok Ban RallyBest Stocks Under $10.00 Intuitive Machines: Charting a Course Among the StarsBest Aerospace Stocks Investing KB Home’s Stock Price Can Move Higher, Here’s Why Before you consider Diaceutics, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Diaceutics wasn't on the list. While Diaceutics currently has a \"Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Need to stretch out your 401K or Roth IRA plan? Use these time-tested investing strategies to grow the monthly retirement income that your stock portfolio generates. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}