{
    "title": "Mustafa Suleyman | Microsoft’s new bet",
    "date": "3/23/2024",
    "url": "https://www.thehindu.com/sci-tech/technology/mustafa-suleyman-microsofts-new-bet/article67985300.ece",
    "text": "To enjoy additional benefits CONNECT WITH US March 24, 2024 01:27 am | Updated 12:55 pm IST Illustration: R. Rajesh In Microsoft’s latest hedge against OpenAI, and after its deal with Mistral, the tech giant hired away two founders and a bunch of employees of Inflection AI, a company building generative artificial intelligence (AI) models. The co-founders, Mustafa Suleyman and Karén Simonyan, will now work at Microsoft AI, the company’s new ‘consumer AI’ unit, with Mr. Suleyman as CEO and the latter as chief scientist. The move has surprised many industry players for what it implies about events inside Inflection AI before the hire-away and what it portends about Microsoft’s plan with its new AI division. Mr. Suleyman grew up in Inner London as the son of a Syrian taxi driver and an English nurse. He met Demis Hassabis when studying at a boys’ school; they would later co-found AI research company DeepMind. Mr. Suleyman finally attended Oxford’s Mansfield College but dropped out when he was 19, following up with stints with the Muslim Youth Helpline (which he co-founded with Mohammed Mamdani), as a policy officer with then London Mayor Ken Livingstone, and with a company he started called Reos Partners. His big break came with DeepMind, in 2010, which Google acquired four years later for £400 million. Mr. Suleyman moved from being its Chief Product Officer to the head of a new department at DeepMind tasked with finding and implementing real-world applications of its products, which ranged from cooling Google’s heat-spewing data centres to designing healthcare solutions with the U.K. National Health Service. In 2017, DeepMind made waves by releasing AlphaGo Zero and Alpha-Zero, powerful AI systems designed to play chess, go, and shogi at levels rivalling the best human champions. A year later, the company’s AlphaFold program wowed scientists with partial success at predicting the structures of complex proteins, considered an important yet very difficult task in biology. But in 2019, Mr. Suleyman’s reputation came under a dark cloud after DeepMind employees alleged he was a bully and that he had created a toxic work environment. They later received an email acknowledging Mr. Suleyman’s leadership at the company “fell short”; Mr. Suleyman himself left in December 2019 to join Google in a vice-presidential role. Insider reported two years later that Mr. Suleyman was known to humiliate his colleagues in front of others and once said, “I crush people”. It also quoted two unnamed sources to report that Google allowed DeepMind to have its own HR division, which prevented complaints against Mr. Suleyman from reaching Google for a long time. In March 2022, Mr. Suleyman co-founded Inflection AI along with venture capitalist Reid Hoffman and scientist Karén Simonyan with the stated mission of improving human-AI interactions. (DeepMind had earlier hired Dr. Simonyan by acquiring his company.) Between this moment and Mr. Suleyman’s departure to Microsoft last week, Inflection was able to raise $225 million in May 2022 and $1.3 billion in June 2023, including from Microsoft and Nvidia. Inflection announced then that it planned to use most of the latter for a next-generation AI model for its in-house chat AI application ‘Pi’. Mr. Suleyman told Reuters it would have “approximately three times more [computing power] than what was used to train all of GPT-4,” the model that powers ChatGPT. This comment speaks to the question of what could have happened at Inflection AI that resulted in Mr. Suleyman leaving to lead Microsoft AI. Specifically, he leaves less than a year after the company he co-founded raised a substantial sum of money and support from industry leaders and announced big plans for its future. Some have asked questions about Inflection’s Pi, in particular the feasibility of competing in a market already crowded with several chat AI apps. Mr. Suleyman isn’t technically skilled and brings managerial chops to AI outfits like Sam Altman has at OpenAI, yet some have also asked whether a company as large as Microsoft needs more managers. Questions also swirl about how his presence at the helm of a large AI vertical — in charge of Copilot and Bing, among others — may affect the working culture at Microsoft, even if Satya Nadella has expressed admiration of his work. The future, for now, lies hidden behind the questions from Mustafa Suleyman’s past. The Hindu Profiles\n\n/\n\nThe Hindu Explains\n\n/\n\ncomputing and information technology\n\n/\n\nArtificial Intelligence BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. "
}