{
    "title": "Microsoft March Surface event: What to expect",
    "date": "3/7/2024",
    "url": "https://www.pocket-lint.com/microsoft-march-2024-surface-event-what-to-expect/",
    "text": "There's reportedly plans for minor updates to the Surface Pro, bigger updates to the Surface Laptop, and new AI features in Windows. Microsoft is getting ready to show off what's next for Surface and Windows in 2024. The company is holding a New Era of Work event on March 21 at 9am PST / 12pm EST where it says it'll share \"the latest in scaling AI in your environment with Copilot, Windows, and Surface.\" News that the company was hosting an event was first reported by The Verge alongside details from Windows Central on the new Surface Pro 10 and Surface Laptop 6 Microsoft is planning to announce. Neither the Surface Pro nor the Surface Laptop received updates in 2023, the first time Microsoft hasn't released a yearly update to its flagship tablet and laptop in several years. While The Verge's report suggests this event will be focused on \"commercial\" versions of the Surface Pro 10 and Surface Laptop 6, as in, versions meant for business customers, they should serve as a good preview for the \"consumer\" versions coming later this year, along with whatever updates to Windows the company plans on demoing. Let's dive into the details of what's been reported about Microsoft's plans so far. Based on what's been reported, the biggest change being made to the Surface Pro 10 is the addition of an anti-reflective OLED screen. The shift from LCD to OLED should allow the Surface Pro to get brighter and playback HDR content, two pluses if you like watching video on your computer. The tablet is also expected to ship with a new ultra-wide webcam with support for Microsoft's Studio Effects (supporting background blurring and auto framing on video calls, among other features). Otherwise, the body of the Surface Pro 10 is expected to be similar to the Surface Pro 9, with the only other major addition being a Copilot Key on all new versions of the Surface Pro Keyboard. Inside, Microsoft plans on using either new Intel Core Ultra or Qualcomm Snapdragon X Elite processors, and updated neural processing units (NPUs) for improved AI support, and a NFC reader. The Intel versions of the Surface Pro 10 will likely be shown off at the spring event for commercial hardware, while the ARM-based Qualcomm versions will become available for consumers this summer. The Surface Laptop 6 is expected to feature a much bigger redesign that should make it stand out from the totally fine, but not very exciting Surface Laptop 5. The most visible is a new display with smaller bezels and rounded corners, which, frankly, should have come years ago. Microsoft is also reportedly updating the Surface Laptop's ports with two USB-C and one USB-A, throwing in a new haptic trackpad like the MacBook Air's, and adding in the expected Copilot Key. Internals should line up with the Surface Pro 10, with both Intel Core Ultra and Qualcomm Snapdragon X Elite versions to choose from. Offering an ARM-based chip for its laptop line is a first for Microsoft. The company has experimented with the more power-efficient, mobile-friendly chips on the Surface Pros, but hasn't opted to do the same with its laptops. That's set to change with the Surface Laptop 6. Microsoft has multiple \"pans in the fire\" when it comes to introducing AI features into Windows, and multiple more opportunities to show off what its next major update could look like. It's not clear if the company will make any big Windows announcements along with its new Surfaces, but Windows Central writes that there is at least one major new feature in the works. That makes anything you do on your computer something that could be referenced later. Did your friend Dina mention a restaurant they wanted to check out next time they're in town? You could pull it up just asking \"What was that restaurant Dina wanted to try?\" It's called \"AI Explorer,\" a sort of advanced version of Copilot that uses \"a built-in history/timeline feature that turns everything you do on your computer into a searchable moment using natural language.\" That makes anything you do on your computer something that could be referenced later. Did your friend Dina mention a restaurant they wanted to check out next time they're in town? You could pull it up just asking \"What was that restaurant Dina wanted to try?\" That knowledge reportedly extends into a sort of contextual awareness of whatever you're doing on screen currently, too. If you're looking at photos, the AI Explorer would understand that and automatically start editing them if you asked. It's not clear how the feature would work. A company called Rewind offers a similar set of features by screen recording everything you do and feeding it to a GPT-4-powered AI assistant you can talk to. That has obvious privacy concerns that might turn Microsoft off, but maybe AI Explorer will pull off these tricks some other way. We'll have to wait till March 21 to get a better idea of what Microsoft has planned.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Ian Campbell is a writer based in San Diego who writes features, interviews, guides and reviews for Pocket-lint. Before he spent his days covering great products for readers, Ian was an associate editor at Inverse, focused on reviewing wearables, smartphones, and VR headsets. He's also written for Input and Dot.LA, and covered news for The Verge as part of Vox Media's inaugural fellowship program.\n\nPrior to joining the world of online media, Ian received a BA in Screenwriting from Chapman University's Dodge College of Film and Media Arts. His background in film and television and interest in technology has made Ian a jack-of-all-trades in all the ways entertainment touches the products we use every day, and particularly screens we place in our home, keep in our pockets, wear on our wrist, and strap on our face. AirPods Max's design, case, and compatibility makes them my top headphones, but I do wish they had these two Bose 700 features. Want to take great photos while leaving the tripod and filters at home? The OM-1 Mark II hides impressive capabilities. Capture your best ideas in a notebook that never runs out of pages with these great note-taking tablets. If you're bored of the norm, and want a change from the usual Samsungs and Apples of the world, the Honor Magic 6 Pro is certainly worth considering. Which $20-a-month AI subscription offers more capabilities, Gemini Advanced or Copilot Pro? The answer may surprise you. Laptops are easy to clutter with unnecessary apps and files, but with the right knowledge, you can clean them up, digitally and physically. "
}