{
    "title": null,
    "date": "3/16/2024",
    "url": "https://finance.yahoo.com/news/2-stocks-bill-melinda-gates-132700950.html",
    "text": "From its inception through the end of 2022, The Bill & Melinda Gates Foundation Trust had made total grant payments of about $71.4 billion. One of the reasons the trust has been able to make such generous donations is because of the successful investments that make up The Bill & Melinda Gates Foundation Trust's portfolio, which is valued at about $42 billion. Main Street investors can take a cue from the trust and find investment ideas that would benefit their own portfolios. Below, two Motley Fool contributors explain why they believe that among the trust's holdings, Microsoft (NASDAQ: MSFT) and United Parcel Service (NYSE: UPS) are particularly compelling at the moment. Scott Levine (Microsoft): The bedrock of the Gates Foundation is Microsoft, its largest holding by far. As of the most recent 13F filing, Microsoft represented 34% of the trust's holdings. The next largest position, Berkshire Hathaway, has about a 17% weighting in the trust. Microsoft's forward dividend yield of 0.74% might not rev the engines of those who are looking to generate strong passive income, but the Gates Foundation Trust has 38,210,869 shares of Microsoft, which will provide more than $28.6 million from dividends this quarter. Rather than considering the stock as an income play, most investors will find it a worthy growth opportunity. It might seem hard at first to characterize a stock with a $3 trillion market capitalization as a growth stock, but Microsoft's strong position in artificial intelligence (AI) supports the argument. For one, it is a major investor in OpenAI, the developer of ChatGPT. Currently, OpenAI isn't a publicly traded company, so those eager to invest in ChatGPT have few options, though picking up shares of Microsoft provides indirect exposure. But Microsoft has its own AI offerings that will contribute to the company's growth in the coming years. Addressing the important role that AI will play in his company's future, CEO Satya Nadella said during the 2024 second-quarter call that the company has \"moved from talking about AI to applying AI at scale,\" adding, \"By infusing AI across every layer of our tech stack, we're winning new customers and helping drive new benefits and productivity gains across every sector.\" Copilot is Microsoft's AI assistant that is available to both individuals and businesses. Companies can design their own Copilots to provide AI assistance catered to the businesses' needs. The German conglomerate Siemens, for example, collaborated with Microsoft to develop Siemens Industrial Copilot, an AI-assistant that manufacturers and various other industrial companies can use to boost productivity. With the AI market expected to grow at 15.8% compound annual growth rate (CAGR), from $306 billion in 2024 to $739 billion in 2030, Microsoft is well positioned to benefit from the market's growth. Lee Samaha (UPS): Based on its last 13F filing, the Gates Foundation Trust holds only 24 stocks, and the top 10 stocks are responsible for more than 96% of its total holdings. That said, there are various themes you can discern from the holdings. One of them is that Microsoft and Berkshire Hathaway effectively contribute to the trust's total exposure to information technology and financials, together contributing to a little more than 50% of the total portfolio value. After that, there's a heavy weighting to a collection of industrials and transportation stocks, including UPS. These two sectors make up nearly 42% of the Trust. There's an apparent comfort in holding stocks that rely on the economy, and that's certainly the case with UPS. The company suffered a difficult 2023 with slowing economic growth affecting its delivery volumes and a protracted labor dispute, causing customers to divert deliveries to rival networks. In addition, the costs associated with resolving the labor dispute pressured its profit margins. The bad news is out of the way, and UPS will likely have a better year. It will lap the cost increase in 2024, cutting 12,000 jobs in response to weaker demand -- a move that will reduce costs by $1 billion in time. UPS also has a growth opportunity from winning back lost customers. Moreover, the possibility of lower interest rates later in the year will be good for its volume. In the meantime, UPS continues to grow in its targeted end markets, such as small and medium-size businesses and healthcare, and management continues to invest in productivity-enhancing technology like automation and smart facilities. It all points to a recovery in UPS, and it doesn't hurt to earn a 4.4% dividend yield while you wait for the stock to appreciate. Smart investors consult a variety of sources for inspiration -- such as the stocks found in The Bill & Melinda Gates Foundation Trust. For investors looking to gain AI exposure, Microsoft, the trust's top holding, is a great opportunity right now. For those seeking the reliability of an industrials leader that provides prodigious passive income, UPS stock is a great opportunity. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Microsoft made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of March 11, 2024 Lee Samaha has positions in Siemens Aktiengesellschaft. Scott Levine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Microsoft. The Motley Fool recommends United Parcel Service and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. 2 Stocks From the Bill and Melinda Gates Foundation Portfolio to Buy Now was originally published by The Motley Fool Related Quotes "
}