{
    "title": "Gulf International Bank UK Ltd Sells 13,174 Shares of AbbVie Inc. \n(NYSE:ABBV)",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-abbv-sec-filing-2024-03-19/",
    "text": "Gulf International Bank UK Ltd cut its stake in AbbVie Inc. (NYSE:ABBV - Free Report) by 8.2% in the 4th quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The fund owned 148,392 shares of the company's stock after selling 13,174 shares during the quarter. AbbVie accounts for about 0.6% of Gulf International Bank UK Ltd's portfolio, making the stock its 24th biggest position. Gulf International Bank UK Ltd's holdings in AbbVie were worth $22,996,000 as of its most recent filing with the Securities & Exchange Commission. Several other institutional investors and hedge funds have also recently modified their holdings of the stock. Polar Capital Holdings Plc raised its position in AbbVie by 11.6% during the second quarter. Polar Capital Holdings Plc now owns 358,872 shares of the company's stock valued at $48,351,000 after purchasing an additional 37,368 shares in the last quarter. Altfest L J & Co. Inc. boosted its position in AbbVie by 0.9% during the 3rd quarter. Altfest L J & Co. Inc. now owns 23,346 shares of the company's stock valued at $3,480,000 after acquiring an additional 215 shares in the last quarter. Torray Investment Partners LLC boosted its position in AbbVie by 13.0% during the 3rd quarter. Torray Investment Partners LLC now owns 21,190 shares of the company's stock valued at $3,159,000 after acquiring an additional 2,446 shares in the last quarter. Retirement Planning Co of New England Inc. boosted its position in AbbVie by 21.3% during the 3rd quarter. Retirement Planning Co of New England Inc. now owns 26,409 shares of the company's stock valued at $3,936,000 after acquiring an additional 4,633 shares in the last quarter. Finally, Amplius Wealth Advisors LLC boosted its position in AbbVie by 17.6% during the 4th quarter. Amplius Wealth Advisors LLC now owns 2,668 shares of the company's stock valued at $413,000 after acquiring an additional 400 shares in the last quarter. 67.86% of the stock is owned by hedge funds and other institutional investors. Shares of NYSE:ABBV traded up $1.18 during trading hours on Tuesday, hitting $179.67. The company's stock had a trading volume of 7,624,678 shares, compared to its average volume of 5,760,819. AbbVie Inc. has a 52 week low of $130.96 and a 52 week high of $182.89. The company has a debt-to-equity ratio of 5.02, a current ratio of 0.87 and a quick ratio of 0.76. The company has a market capitalization of $317.38 billion, a price-to-earnings ratio of 65.81, a P/E/G ratio of 2.26 and a beta of 0.58. The firm's fifty day moving average price is $172.65 and its 200 day moving average price is $156.74. AbbVie (NYSE:ABBV - Get Free Report) last issued its quarterly earnings data on Friday, February 2nd. The company reported $2.79 earnings per share (EPS) for the quarter, topping analysts' consensus estimates of $2.76 by $0.03. AbbVie had a net margin of 8.95% and a return on equity of 162.28%. The firm had revenue of $14.30 billion for the quarter, compared to the consensus estimate of $14.02 billion. During the same quarter in the previous year, the firm earned $3.60 EPS. The company's quarterly revenue was down 5.4% compared to the same quarter last year. As a group, research analysts expect that AbbVie Inc. will post 11.15 EPS for the current year. The business also recently announced a quarterly dividend, which will be paid on Wednesday, May 15th. Shareholders of record on Monday, April 15th will be given a dividend of $1.55 per share. This represents a $6.20 annualized dividend and a yield of 3.45%. The ex-dividend date is Friday, April 12th. AbbVie's dividend payout ratio is presently 227.11%. Several analysts have weighed in on ABBV shares. William Blair raised AbbVie from a \"market perform\" rating to an \"outperform\" rating in a research report on Monday, January 29th. HSBC cut AbbVie from a \"buy\" rating to a \"hold\" rating and dropped their price target for the stock from $167.00 to $156.00 in a research report on Monday, December 18th. Truist Financial boosted their price target on AbbVie from $180.00 to $195.00 and gave the stock a \"buy\" rating in a research report on Tuesday, February 6th. Barclays boosted their price objective on shares of AbbVie from $175.00 to $185.00 and gave the stock an \"overweight\" rating in a report on Monday, February 5th. Finally, Raymond James boosted their price objective on shares of AbbVie from $181.00 to $189.00 and gave the stock an \"outperform\" rating in a report on Monday, February 5th. Four investment analysts have rated the stock with a hold rating, nine have issued a buy rating and one has assigned a strong buy rating to the company. According to data from MarketBeat, the stock currently has an average rating of \"Moderate Buy\" and a consensus price target of $175.36. View Our Latest Analysis on ABBV In other news, CEO Richard A. Gonzalez sold 138,616 shares of the company's stock in a transaction on Wednesday, February 28th. The shares were sold at an average price of $177.27, for a total value of $24,572,458.32. Following the sale, the chief executive officer now directly owns 519,099 shares of the company's stock, valued at approximately $92,020,679.73. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. In related news, CFO Scott T. Reents sold 14,140 shares of the company's stock in a transaction dated Friday, February 23rd. The shares were sold at an average price of $177.44, for a total value of $2,509,001.60. Following the completion of the sale, the chief financial officer now owns 27,065 shares of the company's stock, valued at $4,802,413.60. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at the SEC website. Also, CEO Richard A. Gonzalez sold 138,616 shares of the stock in a transaction dated Wednesday, February 28th. The stock was sold at an average price of $177.27, for a total transaction of $24,572,458.32. Following the transaction, the chief executive officer now directly owns 519,099 shares of the company's stock, valued at approximately $92,020,679.73. The disclosure for this sale can be found here. In the last quarter, insiders have sold 306,205 shares of company stock valued at $53,974,299. Insiders own 0.26% of the company's stock. AbbVie Inc discovers, develops, manufactures, and sells pharmaceuticals worldwide. The company offers Humira, a therapy administered as an injection for autoimmune, intestinal Behçet's diseases, and pyoderma gangrenosum; Skyrizi to treat moderate to severe plaque psoriasis, psoriatic disease, and Crohn's disease; Rinvoq to treat rheumatoid and psoriatic arthritis, ankylosing spondylitis, atopic dermatitis, axial spondyloarthropathy, ulcerative colitis, and Crohn's disease; Imbruvica for the treatment of adult patients with blood cancers; Epkinly to treat lymphoma; Elahere to treat cancer; and Venclexta/Venclyxto to treat blood cancers.Featured ArticlesFive stocks we like better than AbbVieAre Penny Stocks a Good Fit for Your Portfolio?Growing Twice as Fast as Tesla, XPeng is a BuyProfitably Trade Stocks at 52-Week Highs4 Stocks Building Long-Term Value for Shareholders How to Choose Top Rated StocksFedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount  Before you consider AbbVie, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and AbbVie wasn't on the list. While AbbVie currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here If a company's CEO, COO, and CFO were all selling shares of their stock, would you want to know? Whether you're aiming for financial freedom or looking to understand the critical role of dividends in wealth building, this video is your go-to resource. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}