{
    "title": "Metcash, KPMG, Microsoft: How a $80m tech upgrade blew out by $200m",
    "date": "3/11/2024",
    "url": "https://www.afr.com/technology/how-metcash-s-80m-tech-upgrade-blew-out-by-200m-20240308-p5faxv",
    "text": "A plan to replace nine IT systems with one Microsoft platform is a case study in how not to manage a large-scale tech project. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login When Doug Jones arrived from South Africa in early 2022 to become CEO of grocery, liquor and hardware company Metcash, he discovered the “dream” digital transformation trumpeted by his predecessor was more like a nightmare. The IT project agreed to by former Metcash CEO Jeff Adams and the board, chaired by Rob Murray, earmarked $80 million to $100 million over three years to replace nine different IT systems with a single operating platform supplied by Microsoft. Metcash boss Doug Jones. The bold vision described by Adams in 2020 would have seen Metcash adopt a Microsoft-first policy, with the Dynamic 365 suite of products being used for finance, invoicing and distribution, all while utilising Microsoft’s Azure cloud services. It would replace an ageing legacy system, supplied by NCR and described as being at the end of its useful life. The single operating system would be used for all the Metcash businesses including food brands IGA and Foodland, hardware brands Mitre-10 and Home Hardware, as well as the national liquor chains – Cellarbrations, the Bottle-O, IGA Liquor and Porters Liquor. But soon after getting his feet under the desk at the Metcash head office in Sydney, Jones was hit with an explosion in IT costs. Within 18 months the implementation costs for the Microsoft project had almost doubled to $190 million. Shareholders were kept in the dark about the cost explosion until the full-year results were released in June 2022, despite the potential negative impact on working capital. The cost of the IT transformation, which later morphed into a business transformation, has since blown out to $290 million, including capital expenditure and expenses. The completion date, which was originally December 2023, is not expected until 2025 or later. Most importantly, Metcash has been forced to retain its legacy system while large components of the tech build have been put on hold to cut the cash burn rate and manage risks. It’s a case study in how not to do a tech upgrade. In hindsight, the nickname for the IT program – Project Horizon – is entirely appropriate given that many of the promised benefits seem to be just over the horizon. Jones, who says there are many benefits flowing to Metcash and its customers from the tech upgrade, took immediate ownership of Project Horizon in March 2022 when Adams left the company. He set out to find why it had gone off the rails and with the full backing of the board led by new chairman, Peter Birtles, he launched a snap six-week investigation. Birtles had first-hand knowledge of what happened, as he was chairman of the Project Horizon steering committee and was on the board when it was approved. He left the steering committee in early 2022 after serving for two years. A deep dive by the Metcash leadership team found flaws in the governance of the project and raised serious doubts about whether the objectives were achievable. Jones’ priority was to reduce the risks and slash the high cash burn rate. During the review, Jones relied heavily on KPMG, which had won the system integration contract; PwC, the project’s assurance partner; the chief information officer, David Reeve; and the project director, Cecile Espost. The review triggered a decision to reduce the scope of the program. Jones found that the three core Metcash businesses – retail, liquor and hardware, which are known inside the company as pillars – had not taken ownership of the IT transformation. “I got the sense that this was being done to us and alongside and in parallel,” Jones says. He discovered the reporting lines for the project had been progressively downgraded. “What I discovered when I got here was that the program director had historically reported to the group CEO then reported to the strategy and transformation director and then reported to the food pillar CEO,” he says. Jones could not understand why a group-wide transformation program was sitting inside one of the Metcash pillars instead of it being answerable directly to the CEO. Frankly, what was happening was that we were dumbing the business down. — Doug Jones, Metcash CEO “I changed that reporting line so there was a program director co-ordinating all of the resources and making sure that updates were provided. I made sure the planning was being done with the interaction of the IT organisation inside the business and with our partners, KPMG and Microsoft,” Jones says. The third and arguably the most worrying finding from the deep dive was that the software upgrade was not necessarily enhancing Metcash’s tech capabilities or its ability to service customers. Although the new core finance software package had been successfully rolled out in November 2021, the word out of the finance department was that the new system did entirely the same thing as the old system. Jones discovered that the dream of having a single system unifying all businesses ignored the fact that each business operated differently, had different terms of trade. and were not necessarily suitable for a grand unification. “Frankly, what was happening was that we were dumbing the business down,” Jones says. “We were trying to find something that was so broad that it tried to meet the needs of all parts of the business.” Jones asked his team two fundamental questions: “Do we really want, and is it realistic to expect that we can have, one way of doing things across our business? Do we really think that we can have one ERP [enterprise resource planning] architecture across a food wholesaler, liquor wholesaler, hardware wholesaler and retailer?” The answer to both these questions was “No”. Not only did this cast the original decisions about the project in a poor light, it called for a profound change in the scope of the project. “I, together with the group leadership team and then ultimately, the board, formed the view that we were probably not well served by this,” Jones says. “The level of urgency was different across the different pillars. And on that basis, we made the decision – which we communicated to the market in October 2022, when we did a fairly fulsome strategy update – to decouple hardware from the program. Project Horizon was a dream project for Microsoft because it was an opportunity to go head-to-head with German software powerhouse SAP. James Alcock Jones realised that the dream that had been sold to his predecessor in 2021 was neither practical nor good for the business. “Originally, the vision was we will be a Microsoft end-to-end landscape to make integration easy, and you just plug and play and all the other stuff – it’s the dream you get sold, “Jones says. “We updated our strategy from a single technology to more of a best-of-breed on a Microsoft platform. And we’ve continued to behave in that way.” The questions about what went wrong bubbled away in the background as Jones delivered the shock news to the market that the budget had risen to about $250 million. There was, however, still strong belief that the company and its partners, Microsoft and KPMG, would be able to complete key components. Jones said the “strong partnership” with Microsoft, including the design and development of a pricing engine (invoicing tool), was proceeding as planned with the build underway. At the company’s investor day in October 2022, Jones said that the objectives of Project Horizon remained valid. These included de-risking systems, simplification of processes, removing inefficiencies, building new capabilities to improve customer and supplier experiences, and providing a platform for future growth. He told investors that real progress was being made. But apart from the core finance system, the only new software that was near being successfully installed at Metcash was a retail inventory replenishment system supplied by Blue Yonder (formerly J.D. Edwards). By late 2022, the board of Metcash clearly wanted a more detailed analysis of what had happened after getting some strong messages from new personnel brought in to manage the project. Marij Kouwenhoven was appointed chief technology officer and KPMG partner Simon Benson took over the role of transformation program director. In late November 2022, the company approached Bob McKinnon of Mirin Digital to try to unpick what had happened and help the board understand where they were at, how they got there, and what they needed to do going forward. His job was to talk to all those involved in the project and recommend what lessons should be learnt. McKinnon is somewhat of a legend in IT circles because he is the only person to have been appointed group executive technology and chief information officer at two of the big four banks. He held the position at the Commonwealth Bank from 2000 to 2006, and at Westpac Banking Corp from 2008 to 2011. McKinnon’s report, which was delivered to the Metcash board in February 2023, is confidential, but Jones shared some key findings with The Australian Financial Review. “Bob’s assessment in summary was that we’d made a lot of mistakes, and there were things that we could have done better and that was in the wheelhouse of all parties,” Jones says. “We probably left the Horizon team a little bit off to the side and said: ‘OK, guys, let us know, when you’re done.’ “And we had only engaged with them at a steering committee kind of level, and we needed to bring the team closer to the business and the business closer to the program. “There were some opinions that he shared around our assurance partner and our systems integrator partner, KPMG, at the time.” Bob McKinnon interviewed about 30 people to find out what went wrong with Project Horizon. Peter Braig McKinnon, who interviewed about 30 people, found that Microsoft was in the box seat to win the Project Horizon contract because it had successfully installed D365 in Metcash’s New Zealand liquor business. This was not an overly complex job, but it made Microsoft the poster child at Metcash. It certainly impressed former Metcash CIO Reeve, who refused to comment when contacted. Project Horizon was a dream project for Microsoft because it was an opportunity to go head-to-head with German software powerhouse SAP, which had a broader array of enterprise software, including a pricing engine. When it won the Metcash contract in 2021 against competition from SAP, Microsoft 365 did not have an integrated pricing engine. In essence, Metcash was a test dummy for upgrading the global software company’s range of services. After backing the Microsoft pricing engine in June 2022, Jones is now more circumspect. “As we think about procurement management, and things like our core pricing engine, we’ve really given ourselves license to … make the right decisions, and not be overly constrained by, ‘It’s got to be Microsoft.’” McKinnon, who remains an adviser to the company, uncovered flaws in the early stage of the Project Horizon assessment of business processes and how they might be switched to D365. When the project was given the green light, the company didn’t seem to realise that across every state there were multiple different processes within the organisation, both upstream and downstream, being run on multiple different technology systems. All of these would need to be integrated into the new single company-wide platform. There were different versions of warehouse management systems, there were different portals the new system needed to fit in into, and there were different trading terms for the same suppliers depending on which state they were located in. This meant the IT environment was much more complex than the initial design and build contemplated. Metcash chairman Birtles says the board’s decision to proceed with Project Horizon in 2021 was taken after considering the business case put to the board, which included a cost-benefit analysis. He says the board was always kept abreast of the changes in the cost of Project Horizon. Metcash’s chairman Peter Birtles. Peter Rae “The steering committee and the full board were across all changes to the costs,” Birtles says. “There is a detailed Horizon update at each board meeting. The proposed increase in costs was supported by detailed information that outlined the extra work required to address the complexity of the existing IT infrastructure and systems. “This complexity and the resultant customisation was not fully appreciated at the commencement of the program.” Birtles says the board “held management and program leadership accountable to committed plans, and only approved variations after thorough substantiation”. It is not clear from the Metcash remuneration reports over the past three years that key management personnel suffered any significant financial deprivation because of Project Horizon. McKinnon noted that one of the unusual aspects of Project Horizon is that mid-way through the digital transformation it became a business transformation program, because the guiding principles were that the businesses had to accept the D365 software processes out of the box without impacting customers. This would have suited KPMG, which specialises in business transformation. The firm is Microsoft’s preferred systems integration partner in the Asia-Pacific region, but it’s better known for its business consulting skills. At one stage during Project Horizon, there were 200 KPMG consultants designing and building the new system. KPMG won the lucrative contract in 2021 following a tender that was believed to involve competition from PwC, who ended up being the assurance partner. It is believed McKinnon’s report noted that Metcash had become very reliant on KPMG because it was leading the project management office as well as leading the design and the build of the new systems. Soon after McKinnon delivered his recommendations to the board, Metcash decided to bring the management of Project Horizon in-house. Jones revealed this change at the June 2023 earnings announcement. Jones tells the Financial Review “the plan was always to bring in-house the final delivery of this program”. “I felt, and the board supported me in this, that we needed to do that sooner than we had originally planned. “I just felt that because we were doing so much customisation in this deep work with Microsoft, I didn’t want those people walking out the door. “And I felt that we could do it on a more cost-effective basis as well. And if you look at the costs we’ve disclosed, you can see that our burn rate is significantly lower – by orders of magnitude lower.” When asked about KPMG’s involvement in Project Horizon, a spokesperson said: ”KPMG doesn’t comment on client matters”. Birtles says it would be a mistake to blame KPMG for the blow out in costs of Project Horizon. “The increase in costs was a result of a collective appreciation for the complexity and scope of the program,” he says. “As the program team, which included both Metcash and KPMG members, did further work, the complexity became clearer as did confidence in the path forward, but this had consequential cost implications.” Birtles is also highly supportive of the role played by Microsoft. “Microsoft have been a responsive and responsible partner,” Birtles says. “Obviously, we are disappointed in the increase in costs and size of the program, as are Microsoft, but they have continued to support the program and are more committed to a successful outcome than ever.” A Microsoft spokesperson said: “We have a strong partnership with Metcash and will continue to support their digital transformation journey.” Birtles defends the current governance of the project. “There is a technology working group including three board members that oversights all aspects of technology, including the Horizon program, IT strategy and various key IT initiatives,” he says. Jones says he is proud of the fact that the Metcash management team was brave enough to make changes to Project Horizon before its cost overruns got worse. “I think it’s very healthy that we continue to not be wedded to decisions that were made in the past and not make that mistake of blindly tying ourselves to that,” he says. “I think we’ve got to be brave enough to say, actually, hang on, can we just reassess this and make some changes? “I’ll come back to those four things I said to shareholders. I can’t compromise on quality. I can’t put the business at undue risk. I’m obviously going to manage resources as carefully as possible. But the one thing that we always have is some extra time. “We’ve reduced the risk that is inherent by taking more time and by hardening our existing tech landscape. “It’s going to cost more. It will take longer. But I’m confident that if we hadn’t made the changes that we’ve made, that would have been true to an even greater extent.” Disclosure: The author’s self-managed super fund owns shares in Microsoft. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}