{
    "title": "Short Interest in Lear Co. (NYSE:LEA) Decreases By 8.8%",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-lea-options-data-report-2024-03-18/",
    "text": "Lear Co. (NYSE:LEA - Get Free Report) was the recipient of a large drop in short interest in the month of February. As of February 29th, there was short interest totalling 2,170,000 shares, a drop of 8.8% from the February 14th total of 2,380,000 shares. Based on an average daily trading volume, of 527,600 shares, the short-interest ratio is currently 4.1 days. Currently, 3.8% of the company's stock are sold short. Get Lear alerts:Sign UpLear Price Performance NYSE LEA traded up $0.29 during trading hours on Monday, hitting $140.47. The company had a trading volume of 426,930 shares, compared to its average volume of 546,002. Lear has a 52 week low of $117.79 and a 52 week high of $157.90. The firm has a 50 day simple moving average of $135.54 and a 200 day simple moving average of $135.43. The company has a debt-to-equity ratio of 0.54, a quick ratio of 1.04 and a current ratio of 1.35. The firm has a market capitalization of $8.01 billion, a price-to-earnings ratio of 14.61, a PEG ratio of 0.34 and a beta of 1.53. Lear (NYSE:LEA - Get Free Report) last announced its quarterly earnings data on Tuesday, February 6th. The auto parts company reported $3.03 earnings per share for the quarter, missing analysts' consensus estimates of $3.12 by ($0.09). The firm had revenue of $5.84 billion for the quarter, compared to analysts' expectations of $5.69 billion. Lear had a net margin of 2.44% and a return on equity of 14.09%. The business's quarterly revenue was up 8.8% on a year-over-year basis. During the same period in the prior year, the business posted $2.81 earnings per share. Equities research analysts expect that Lear will post 14.64 earnings per share for the current year. Lear Announces Dividend The firm also recently announced a quarterly dividend, which will be paid on Wednesday, March 27th. Stockholders of record on Friday, March 8th will be paid a dividend of $0.77 per share. The ex-dividend date of this dividend is Thursday, March 7th. This represents a $3.08 annualized dividend and a dividend yield of 2.19%. Lear's dividend payout ratio (DPR) is presently 31.82%. Insiders Place Their Bets In other news, CEO Raymond E. Scott sold 2,977 shares of Lear stock in a transaction that occurred on Monday, January 8th. The shares were sold at an average price of $135.26, for a total value of $402,669.02. Following the sale, the chief executive officer now directly owns 2,976 shares in the company, valued at $402,533.76. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. In related news, CEO Raymond E. Scott sold 2,977 shares of the business's stock in a transaction on Monday, January 8th. The shares were sold at an average price of $135.26, for a total transaction of $402,669.02. Following the transaction, the chief executive officer now directly owns 2,976 shares in the company, valued at $402,533.76. The sale was disclosed in a filing with the SEC, which is available through this link. Also, CEO Raymond E. Scott sold 10,652 shares of Lear stock in a transaction on Friday, February 9th. The stock was sold at an average price of $132.86, for a total transaction of $1,415,224.72. Following the transaction, the chief executive officer now directly owns 13,627 shares of the company's stock, valued at $1,810,483.22. The disclosure for this sale can be found here. In the last three months, insiders have sold 16,379 shares of company stock worth $2,205,121. Company insiders own 0.75% of the company's stock. Hedge Funds Weigh In On Lear Hedge funds have recently made changes to their positions in the business. Covestor Ltd boosted its position in shares of Lear by 154.7% during the second quarter. Covestor Ltd now owns 191 shares of the auto parts company's stock valued at $27,000 after purchasing an additional 116 shares in the last quarter. FNY Investment Advisers LLC purchased a new stake in Lear during the third quarter valued at $26,000. Belpointe Asset Management LLC increased its position in Lear by 90.8% during the first quarter. Belpointe Asset Management LLC now owns 290 shares of the auto parts company's stock valued at $40,000 after acquiring an additional 138 shares during the last quarter. Signaturefd LLC increased its position in Lear by 32.3% during the fourth quarter. Signaturefd LLC now owns 373 shares of the auto parts company's stock valued at $53,000 after acquiring an additional 91 shares during the last quarter. Finally, UniSuper Management Pty Ltd purchased a new stake in Lear in the second quarter worth about $57,000. 97.04% of the stock is owned by hedge funds and other institutional investors. Analyst Upgrades and Downgrades LEA has been the subject of several recent analyst reports. Benchmark upped their price objective on shares of Lear from $188.00 to $200.00 and gave the stock a \"buy\" rating in a research report on Tuesday, January 2nd. Morgan Stanley boosted their target price on Lear from $140.00 to $150.00 and gave the stock an \"equal weight\" rating in a research note on Monday, February 26th. JPMorgan Chase & Co. reduced their target price on Lear from $195.00 to $179.00 and set an \"overweight\" rating on the stock in a report on Thursday, January 25th. StockNews.com upgraded Lear from a \"hold\" rating to a \"buy\" rating in a report on Tuesday, March 12th. Finally, Wells Fargo & Company upped their target price on Lear from $130.00 to $134.00 and gave the company an \"equal weight\" rating in a report on Wednesday, February 7th. Four investment analysts have rated the stock with a hold rating and six have assigned a buy rating to the stock. Based on data from MarketBeat, the company currently has an average rating of \"Moderate Buy\" and a consensus target price of $161.89. Get Our Latest Analysis on LearAbout Lear (Get Free Report) Lear Corporation designs, develops, engineers, manufactures, assembles, and supplies automotive seating, and electrical distribution systems and related components for automotive original equipment manufacturers in North America, Europe, Africa, Asia, and South America. Its Seating segment offers seat systems, seat subsystems, keyseat components, seat trim covers, seat mechanisms, seat foams, and headrests, as well as surface materials, such as leather and fabric for automobiles and light trucks, compact cars, pick-up trucks, and sport utility vehicles.See AlsoFive stocks we like better than LearConsumer Staples Stocks, ExplainedInsider Selling of Amazon Spikes in Q1, but it's Not Time to SellCanadian Penny Stocks: Can They Make You Rich? 2 Deep Value, High Yield Stocks With a Double-Digit Upside3 Natural Gas Stocks That Offer Great Dividend YieldsAre We in a Bear Market? Here are the Signs This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Lear, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Lear wasn't on the list. While Lear currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of seven best retirement stocks and why they should be in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}