{
    "title": "How to watch the Microsoft Surface, Windows AI and Copilot event",
    "date": "3/22/2024",
    "url": "https://ca.style.yahoo.com/how-to-watch-the-microsoft-surface-windows-ai-and-copilot-event-150049410.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. It's almost time for another Microsoft livestream event, the first since September of last year. The festivities start at 12PM ET on Thursday, March 21. The best way to watch everything unfold is via the official Microsoft stream; it doesn't look like they'll have a stream on YouTube this time. This is the first Microsoft live event without former chief product officer and longtime keynote presenter Panos Panay, who departed for Amazon last year. The event is being advertised as a “new era of work”, so there’s going to be a major focus on the commercial space. There are plenty of rumors that Microsoft will take the opportunity to unveil a spate of new Surface devices. Windows Central claims that an OLED Surface Pro 10 and a Surface Laptop 6 will headline the event. The Verge suggests that both devices will only feature minor spec bumps compared to the previous generation. There’s also conflicting reports as to whether or not these Surface devices will get a more comprehensive redesign later in the spring to suit non-business consumers. We won’t know until Thursday. There’s one safe bet. Microsoft will continue its commitment to AI. Rumors swirl that the Surface Pro 10 and Laptop 6 will be powered by Intel Core Ultra and Snapdragon X Elite silicon CPUs with next-generation neural processing units (NPUs) that have been designed specifically for advanced AI tasks. To that end, there are reports that these devices will be called “AI PCs” and will include a dedicated button to bring up the company’s Copilot digital assistant. The Intel variants are expected to launch in April, while the Arm-based Snapdragon ones will reportedly show up this June. The rumor mill has been grinding overtime for this event. Reports also suggest that Microsoft will unveil a suite of new AI features that could be coming to Windows computers, including real-time captioning and translating, upscaling and frame-rate smoothing for games and upgraded Windows Studio Effects. There’s also likely to be something called AI Explorer announced at the event. This is rumored to be a built-in timeline feature that is searchable via natural language. It’ll reportedly live on your device and log everything you do and see. So, you could ask AI Explorer to “find that thing I looked at earlier about dinosaurs” and it would search through every moment in your PC’s history to find the relevant content. This could be a privacy nightmare, but it could also finally make digital assistants actually useful. We fully expect Microsoft to offer security assurances when it comes to AI Explorer. These AI features won’t be exclusive to the Surface Pro Pro and Surface Laptop 6, as reports indicate they will be part of the company’s annual feature update for Windows 11, which is expected this fall. Engadget will offer full coverage of the event and will spotlight all of the interesting tidbits. Catch up on all the news from the Microsoft Surface and AI event right here! AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call.  While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. HONG KONG (AP) — Chinese telecoms gear company Huawei Technologies has reported its profit more than doubled last year as its cloud and digital businesses thrived in spite of U.S. sanctions. The Shenzhen-based company reported a net profit of 87 billion yuan ($12 billion), helped by strong sales and an improved product portfolio. Revenue jumped nearly 10% from a year earlier, to 704.2 billion yuan ($97.4 billion). Huawei’s rotating chairman Ken Hu said the company’s figures were in line with for Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  Spot, a robotic dog created by tech company Boston Dynamics, is being used across the nation to help assist law enforcement in the field. Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of  The company is among the fastest-growing cybersecurity players based on my peer analysis Caution is needed even with this famous tech behemoth and its fast-growing services business This food habit is linked to a specific type of dementia.  \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. Nordegren has moved on and built a life that focuses on her six kids Trump's former national security adviser shut down a comparison between the ex-president and Julius Caesar. Play this game for 1 minute and see why everyone is addicted. TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Seven reportedly cost $20 million Victoria’s Secret's wedding-inspired collection includes corsets, bras, thongs and more sexy apparel Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. Sweden became the newest member of NATO earlier this month, joining 31 nations in the security alliance, including the United States. Well, make that 49 of the United States. "
}