{
    "title": "Microsoft Co. (NASDAQ:MSFT) Shares Sold by Silvia Mccoll Wealth Management \nLLC",
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/microsoft-co-nasdaqmsft-shares-sold-by-silvia-mccoll-wealth-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Silvia Mccoll Wealth Management LLC reduced its stake in  Microsoft Co. (NASDAQ:MSFT – Free Report) by 8.1% in the 4th quarter, Holdings Channel reports. The firm owned 8,424 shares of the software giant’s stock after selling 743 shares during the period. Microsoft accounts for approximately  2.9% of Silvia Mccoll Wealth Management LLC’s holdings, making the stock its 5th biggest position. Silvia Mccoll Wealth Management LLC’s holdings in Microsoft were worth $3,168,000 at the end of the most recent reporting period. Other institutional investors and hedge funds have also modified their holdings of the company. High Pines Wealth Management LLC grew its stake in shares of  Microsoft by 1.3% during the third quarter. High Pines Wealth Management LLC now owns 2,256 shares of the software giant’s stock valued at $712,000 after purchasing an additional 28 shares during the last quarter.  Sonen Capital LLC lifted its holdings in  Microsoft by 0.3% during the 3rd quarter. Sonen Capital LLC now owns 10,132 shares of the software giant’s stock worth $3,199,000 after buying an additional 28 shares in the last quarter.  Perritt Capital Management Inc. boosted its position in  Microsoft by 3.3% in the 3rd quarter. Perritt Capital Management Inc. now owns 937 shares of the software giant’s stock valued at $296,000 after buying an additional 30 shares during the last quarter.  Noble Family Wealth LLC increased its stake in shares of  Microsoft by 1.3% in the 3rd quarter. Noble Family Wealth LLC now owns 2,331 shares of the software giant’s stock valued at $736,000 after buying an additional 31 shares during the period.  Finally, O Connor Financial Group LLC lifted its stake in shares of  Microsoft by 1.4% during the third quarter. O Connor Financial Group LLC now owns 2,191 shares of the software giant’s stock valued at $692,000 after acquiring an additional 31 shares during the period. 69.20% of the stock is currently owned by institutional investors and hedge funds. In other Microsoft news, EVP Kathleen T. Hogan sold 21,955 shares of the firm’s stock in a transaction that occurred on Monday, March 11th. The shares were sold at an average price of $403.96, for a total transaction of $8,868,941.80. Following the completion of the sale, the executive vice president now directly owns 159,764 shares in the company, valued at $64,538,265.44. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is available at this hyperlink. In other Microsoft news, EVP Kathleen T. Hogan sold 21,955 shares of the company’s stock in a transaction on Monday, March 11th. The stock was sold at an average price of $403.96, for a total value of $8,868,941.80. Following the transaction, the executive vice president now directly owns 159,764 shares of the company’s stock, valued at approximately $64,538,265.44. The sale was disclosed in a legal filing with the SEC, which is accessible through this link. Also, major shareholder Corp Microsoft sold 1,000,000 shares of the company’s stock in a transaction dated Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the transaction, the insider now owns 11,677,398 shares in the company, valued at $22,770,926.10. The disclosure for this sale can be found here. In the last 90 days, insiders sold 1,070,258 shares of company stock worth $30,690,456. 0.03% of the stock is owned by insiders. Shares of NASDAQ:MSFT opened at $428.74 on Friday. Microsoft Co. has a 52-week low of $272.05 and a 52-week high of $430.82. The company has a market capitalization of $3.19 trillion, a P/E ratio of 38.76, a price-to-earnings-growth ratio of 2.28 and a beta of 0.89. The company has a 50-day simple moving average of $408.33 and a 200 day simple moving average of $371.83. The company has a debt-to-equity ratio of 0.19, a quick ratio of 1.20 and a current ratio of 1.22. Microsoft (NASDAQ:MSFT – Get Free Report) last released its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The company had revenue of $62.02 billion during the quarter, compared to analysts’ expectations of $61.14 billion. During the same period last year, the firm posted $2.32 earnings per share. The business’s revenue was up 17.6% on a year-over-year basis.  Sell-side analysts forecast that  Microsoft Co. will post 11.63 earnings per share for the current year. The business also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Stockholders of record on Thursday, May 16th will be paid a dividend of $0.75 per share. This represents a $3.00 dividend on an annualized basis and a dividend yield of 0.70%. The ex-dividend date of this dividend is Wednesday, May 15th. Microsoft’s dividend payout ratio  is presently 27.12%. Several analysts have weighed in on MSFT shares. KeyCorp began coverage on Microsoft in a report on Thursday. They set an “overweight” rating and a $490.00 price objective for the company. Wedbush  reiterated an “outperform” rating and set a $450.00 price target on shares of Microsoft in a research report on Monday, January 29th. Tigress Financial lifted their price target on shares of Microsoft from $433.00 to $475.00 and gave the stock a “buy” rating in a research report on Wednesday, November 29th. China Renaissance started coverage on shares of Microsoft in a report on Tuesday, December 5th. They set a “buy” rating and a $466.00 target price for the company. Finally, Wells Fargo & Company lifted their target price on shares of Microsoft from $435.00 to $460.00 and gave the stock an “overweight” rating in a report on Wednesday, January 31st. Four investment analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company’s stock. According to MarketBeat, Microsoft presently has an average rating of “Moderate Buy” and a consensus target price of $417.37. View Our Latest Stock Analysis on Microsoft (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Brookstone Capital Management Buys Shares of 28,811 FT Vest U.S. Equity Buffer ETF  October (BATS:FOCT) Microsoft Co. (NASDAQ:MSFT) Shares Sold by Financial Network Wealth Management LLC "
}