{
    "title": "Microsoft Represents Solid Reacceleration Story in 2024 - Bank of America \nAnalyst Raises Forecast - Micro",
    "date": "1/18/2024",
    "url": "https://www.benzinga.com/news/24/01/36685044/microsoft-represents-solid-reacceleration-story-in-2024-bank-of-america-analyst-raises-forecast",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW B of A Securities analyst Brad Sills reiterated Microsoft Corp MSFT with a Buy and raised the price target from $430 to $450. The analyst expected a healthy 1% constant currency (cc) upside to his second-quarter revenue estimate of $60.9 billion (+17% Y/Y; +15% Y/Y cc) from continued Azure and M365 strength, though somewhat offset by weaker calendar fourth quarter PC shipments. Sills expected the currency to provide a 2% point tailwind to second-quarter growth versus expectations for a 1% heading into the quarter. He expected a 1% upside to his estimate for Azure growth of 26.5% cc, given system integrator partner feedback suggesting healthy continued migration of new workloads and sustaining adoption of the Microsoft security stack, including offerings like Sentinel, Purview, and Entra. Sills expected a $450 million upside to PBP segment revenue estimate for $18.6 billion (+13% Y/Y/+12% Y/Y cc) from better Commercial Office growth (17% cc vs. 16%) and FX. In the MPC segment, the analyst expected a $50 million upside to his $16.7 billion (+18% Y/Y; +6% Y/Y organic) from forex, though somewhat offset by weaker PCs in the calendar fourth quarter. IDC reported preliminary fourth-quarter PC growth of -0% Y/Y vs. +2% Y/Y when Microsoft guided. The re-rating reflected the analyst’s view that Microsoft represented a solid reacceleration story in 2024. Accelerating ASP growth from the M365 Copilot attachment will likely drive Office growth toward 20%. Channel feedback suggested only early interest in M365 Copilot, the analyst noted. The analyst assumes $389 million in Commercial Office revenue from Copilot in his FY24 base and consensus estimates. However, modest penetration upside translated to meaningful incremental ASP growth. Azure’s growing contributions from AI workloads and an improving macro will likely accelerate new workload and revenue growth from the current 26.5% cc forecast. In summary, Sills expected total revenue growth to accelerate to solid high teens from the current mid-teens level in a reasonable upside case. Exane BNP Paribas analyst Stefan Slowinski upgraded Microsoft from Neutral to Outperform and a $471 price target. Price Action: MSFT shares traded higher by 0.89% at $392.96 on the last check Thursday. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}