{
    "title": "Shareholders Should Be Pleased With Microsoft Corporation's (NASDAQ:MSFT) \nPrice",
    "date": "1/3/2024",
    "url": "https://simplywall.st/stocks/us/software/nasdaq-msft/microsoft/news/shareholders-should-be-pleased-with-microsoft-corporations-n",
    "text": "Stock Analysis When close to half the companies in the United States have price-to-earnings ratios (or \"P/E's\") below 16x, you may consider Microsoft Corporation (NASDAQ:MSFT) as a stock to avoid entirely with its 35.8x P/E ratio.  However, the P/E might be quite high for a reason and it requires further investigation to determine if it's justified. With its earnings growth in positive territory compared to the declining earnings of most other companies, Microsoft has been doing quite well of late.   The P/E is probably high because investors think the company will continue to navigate the broader market headwinds better than most.  If not, then existing shareholders might be a little nervous about the viability of the share price. Check out our latest analysis for Microsoft The only time you'd be truly comfortable seeing a P/E as steep as Microsoft's is when the company's growth is on track to outshine the market decidedly. If we review the last year of earnings growth, the company posted a worthy increase of 11%.   This was backed up an excellent period prior to see EPS up by 66% in total over the last three years.  Accordingly, shareholders would have probably welcomed those medium-term rates of earnings growth. Looking ahead now, EPS is anticipated to climb by 15% per year during the coming three years according to the analysts following the company.  Meanwhile, the rest of the market is forecast to only expand by 12% each year, which is noticeably less attractive. In light of this, it's understandable that Microsoft's P/E sits above the majority of other companies.  It seems most investors are expecting this strong future growth and are willing to pay more for the stock. Using the price-to-earnings ratio alone to determine if you should sell your stock isn't sensible, however it can be a practical guide to the company's future prospects. As we suspected, our examination of Microsoft's analyst forecasts revealed that its superior earnings outlook is contributing to its high P/E.  Right now shareholders are comfortable with the P/E as they are quite confident future earnings aren't under threat.  Unless these conditions change, they will continue to provide strong support to the share price. Don't forget that there may be other risks. For instance, we've identified   1 warning sign for Microsoft  that you should be aware of. If these risks are making you reconsider your opinion on Microsoft, explore our interactive list of high quality stocks to get an idea of what else is out there. Find out whether Microsoft is potentially over or undervalued by checking out our comprehensive analysis, which includes fair value estimates, risks and warnings, dividends, insider transactions and financial health. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Microsoft Corporation develops and supports software, services, devices and solutions worldwide. Flawless balance sheet with solid track record. Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. "
}