{
    "title": "Ticker: Microsoft says state-backed Russian hackers accessed emails of \nsenior leadership",
    "date": "1/20/2024",
    "url": "https://www.bostonherald.com/2024/01/20/ticker-microsoft-says-state-backed-russian-hackers-accessed-emails-of-senior-leadership/",
    "text": "E-Edition Sign up for email newsletters  Sign up for email newsletters E-Edition Trending: Microsoft says state-backed Russian hackers broke into its corporate email system and accessed accounts of members of the company’s leadership team, as well as those of cybersecurity and legal employees. In a blog post Friday, Microsoft said the intrusion began in late November and was discovered Jan. 12. The company says a very small percentage of Microsoft corporate accounts were accessed and some emails and documents were stolen. A Microsoft spokesperson had no immediate comment on which or how many members of the company’s senior leadership had their email accounts breached. “We are in the process of notifying employees whose email was accessed,” Microsoft said. The Microsoft disclosure comes a month after a new U.S. Securities and Exchange Commission rule took effect that compels publicly traded companies to disclose breaches that could negatively impact their business. It gives them four days to do so unless they obtain a national-security waiver. US and Chinese officials have completed the third meeting of a working group established to cooperate on financial issues, in a step that continues the trend set by the two powers last November to ease tensions. Officials from the U.S. Department of the Treasury met with counterparts in the People’s Bank of China to discuss issues ranging from financial stability to countering money laundering. The delegation also met with Vice Premier He Lifeng while they were in China, according to a department statement. The group also indicated that Treasury Secretary Janet Yellen would return to China for a visit at some point in the future. She was previously there in July. Copyright © 2024 MediaNews Group "
}