{
    "title": "Thanks Satya Nadella: Microsoft is now the world’s most valuable company",
    "date": "1/14/2024",
    "url": "https://ceoworld.biz/2024/01/14/thanks-satya-nadella-microsoft-is-now-the-worlds-most-valuable-company/",
    "text": " Microsoft has regained its position as the world’s most valuable publicly traded company after lagging behind Apple for the past decade. On Friday, Microsoft’s stock (MSFT) closed at $388.47 a share, giving it a market capitalization of $2.89 trillion, while Apple’s stock (AAPL) closed at $185.92 a share, with a market capitalization of $2.87 trillion. Analysts predict that Microsoft will continue to show strong financial performance, while Apple is expected to experience slower growth. Concerns regarding the demand for smartphones have caused a 3% drop in Apple’s shares in 2024, despite a 48% increase in the previous year. Meanwhile, Microsoft has experienced a 3% increase in value so far this year, following a surge of 57% in 2023, which was driven in part by its investment in OpenAI, the company behind ChatGPT, which has helped it to gain a lead in generative artificial intelligence. When Satya Nadella took over as Microsoft’s CEO in 2014, the company was struggling. He redirected its focus towards the rapidly expanding cloud computing industry, transforming it into a strong competitor to Amazon – the pioneer in the field. Nadella then led the company to make an ambitious move into generative AI. In 2019, Microsoft made its first of many investments in OpenAI, a startup that would develop the AI-powered ChatGPT chatbot. By the end of summer 2022, Nadella was impressed by a preview of OpenAI’s GPT-4 technology and began urging Microsoft to incorporate generative AI into its products at a “frantic pace”. First, the company added a chatbot to the Bing search engine. Nadella then spearheaded the integration of AI into the Windows operating system and applications such as Excel and Outlook, while providing OpenAI’s systems to Azure customers – Microsoft’s flagship cloud computing offering. The question is: Who has the better mousetrap to go to the next level of $3.5 trillion? You can argue that Microsoft is in a better position, while Apple has been struggling for the next big thing. Top 10 most valuable companies in the world Microsoft and Apple did not return CEOWORLD magazine’s request for a comment. © The CEOWORLD magazine LTD 2024. CEOWORLD and ‘CEOWORLD magazine’ are trademarks of The CEOWORLD magazine Ltd. "
}