{
    "title": null,
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/microsoft-corporation-msft-outperformed-2023-112120367.html",
    "text": "ClearBridge Investments, an investment management company, released its “ClearBridge Dividend Strategy” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. The market recovered in 2023 following a sharp decline in 2022, driven by excitement about artificial intelligence and an improving forecast for interest rates. The strategy underperformed the benchmark S&P 500 Index, in the fourth quarter. The strategy gained from eleven sectors it invested during the quarter on an absolute basis. Sector allocation detracted, while stock selection contributed positively on a relative basis. In addition, please check the fund’s top five holdings to know its best picks in 2023. In its Q4 2023 investor letter, ClearBridge Dividend Strategy featured stocks such as Microsoft Corporation (NASDAQ:MSFT). Headquartered in Redmond, Washington, Microsoft Corporation (NASDAQ:MSFT) is a multinational software company that develops, and licenses software, services, devices, and solutions. On January 4, 2024, Microsoft Corporation (NASDAQ:MSFT) stock closed at $367.94 per share. One-month return of Microsoft Corporation (NASDAQ:MSFT) was -1.68%, and its shares gained 63.58% of their value over the last 52 weeks. Microsoft Corporation (NASDAQ:MSFT) has a market capitalization of $2.755 trillion. In its fourth quarter 2023 investor letter, ClearBridge Dividend Strategy stated the following regarding Microsoft Corporation (NASDAQ:MSFT): \"Microsoft Corporation (NASDAQ:MSFT) is the largest holding in our portfolio. Given its partnership with OpenAI and leading position in the cloud, Microsoft is well-positioned to profit from the boom in AI. However, due to Microsoft’s tremendous scale and diversification, the company is not dependent upon AI for its success. Microsoft’s diverse portfolio of software and cloud offerings ensures the company will thrive even if the next hot thing, like AI, fizzles out. In this way, Microsoft is emblematic of our broader investing approach. We seek to benefit from powerful trends, but we do so with an eye toward managing risk and limiting downside in case the future turns out to be less rosy than hoped for.\" A development team working together to create the next version of Windows. Microsoft Corporation (NASDAQ:MSFT) is in first position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 306 hedge fund portfolios held Microsoft Corporation (NASDAQ:MSFT) at the end of third quarter which was 300 in the previous quarter. We discussed Microsoft Corporation (NASDAQ:MSFT) in another article and shared the list high growth low debt stocks to buy. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors. Suggested Articles: 15 Best Software Stocks to Buy Now According to Coatue Management 11 Cheap Pot Stocks to Buy 20 US Cities with the Highest Rental Vacancy Rates Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}