{
    "title": "Microsoft Corporation (MSFT) Hit a 52 Week High, Can the Run Continue?",
    "date": "1/22/2024",
    "url": "https://www.zacks.com/stock/news/2213399/microsoft-corporation-msft-hit-a-52-week-high-can-the-run-continue",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    January 22, 2024 MSFT Quick QuoteMSFT Better trading starts here. You follow 52 Week High - edit You follow Zacks Equity Research - edit Zacks Equity Research 52 Week High Shares of Microsoft (MSFT Quick QuoteMSFT  -  Free Report)     have been strong performers lately, with the stock up 6.4% over the past month. The stock hit a new 52-week high of $398.67 in the previous session. Microsoft has gained 6% since the start of the year compared to the 59.9% move for the Zacks Computer and Technology sector and the 64.5% return for the Zacks Computer - Software industry. What's Driving the Outperformance? The stock has a great record of positive earnings surprises, as it hasn't missed our earnings consensus estimate in any of the last four quarters. In its last earnings report on October 24, 2023, Microsoft reported EPS of $2.99 versus consensus estimate of $2.65 while it beat the consensus revenue estimate by 3.9%. For the current fiscal year, Microsoft is expected to post earnings of $11.14 per share on $242.41 billion in revenues. This represents a 13.56% change in EPS on a 14.39% change in revenues. For the next fiscal year, the company is expected to earn $12.70 per share on $275.28 billion in revenues. This represents a year-over-year change of 14.02% and 13.56%, respectively. Valuation Metrics Microsoft may be at a 52-week high right now, but what might the future hold for the stock? A key aspect of this question is taking a look at valuation metrics in order to determine if the company has run ahead of itself. On this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). These styles are represented by grades running from A to F in the categories of Value, Growth, and Momentum, while there is a combined VGM Score as well. Investors should consider the style scores a valuable tool that can help you to pick the most appropriate Zacks Rank stocks based on their individual investment style. Microsoft has a Value Score of D. The stock's Growth and Momentum Scores are A and B, respectively, giving the company a VGM Score of B. In terms of its value breakdown, the stock currently trades at 35.8X current fiscal year EPS estimates, which is a premium to the peer industry average of 33.6X. On a trailing cash flow basis, the stock currently trades at 34X versus its peer group's average of 27.6X. Additionally, the stock has a PEG ratio of 2.31. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective. Zacks Rank We also need to consider the stock's Zacks Rank, as this supersedes any trend on the style score front. Fortunately, Microsoft currently has a Zacks Rank of #2 (Buy) thanks to rising earnings estimates. Since we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Microsoft fits the bill. Thus, it seems as though Microsoft shares could have potential in the weeks and months to come.  Microsoft Corporation (MSFT) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}