{
    "title": "MARKET REPORT: Microsoft leapfrogs Apple as the tech giants race to develop \nAI",
    "date": "1/11/2024",
    "url": "https://www.thisismoney.co.uk/money/markets/article-12953287/MARKET-REPORT-Microsoft-leapfrogs-Apple-tech-giants-race-develop-AI.html",
    "text": "By John Abiona Updated:  22:00 GMT, 11 January 2024  3 View  comments  Tech giant Microsoft leapfrogged Apple to become the world’s largest listed company – worth close to £2.3trillion. As the two battle it out in the race to develop Artificial Intelligence (AI), Microsoft rose around 1 per cent in early trading in New York. With Apple dipping, it overtook the iPhone maker to become the most valuable company in the world by market capitalisation. Microsoft is up sharply since last year thanks to its early lead in generative AI through investing in ChatGPT-maker OpenAI. Danni Hewson, head of financial analysis at AJ Bell, added: ‘For years it was viewed by many investors as a bit of a tech dinosaur. Tech leader: Microsoft is up sharply since last year thanks to its early lead in generative AI through investing in ChatGPT-maker OpenAI ‘There’s been an unmistakable sea change. Momentum and excitement have returned. ‘AI has set markets ablaze and with so many potential beneficiaries and opportunities, there’s a lot of money to be made.’ Back in London, the FTSE 100 fell 1 per cent, or 75.17 points, to 7576.59 and the FTSE 250 dipped 0.9 per cent, or 172.15 points, to 19,107.93. Cyber security firm Darktrace rose 9 per cent, or 30.3p, to 365.9p after it hiked sales and earnings expectations and forecast strong demand for AI products. The Cambridge firm said it was in a ‘strong position’ to capitalise on its cyber security tools. It reported sales growth of 27 per cent for the six months to December 31. The update comes as boss Poppy Gustafsson waits to be questioned in the US criminal trial of British entrepreneur Mike Lynch, who she worked with at software company Autonomy. Lynch has been accused of falsely inflating the value of Autonomy before it was sold to US tech giant HP in 2012 for £8billion. He denies the allegations.  Windward soared after the maritime AI firm cashed in on demand for its services amid the ongoing Russia-Ukraine war and Red Sea attacks. The group, which tracks vessels across oceans for customers like BP and Shell, expects to have increased revenues by 31 per cent to around £22million in 2023 and narrowed losses from £9.5million to about £4million, – ‘comfortably ahead’ of forecasts. Shares listed at 155p in 2021, peaking at 220p soon after, and climbed 22 per cent, or 19.5p, to 108p yesterday.  Gustafsson may be quizzed over deals she was involved in while working in Autonomy’s finance department between 2009 and 2011, The Times reported. Lynch’s trial is due to start on March 18. Miner Anglo American rose 0.9 per cent, or 16.6p, to 1839.8p, buoyed by higher metal prices. There are increasing reasons why now is a good time to investment in copper prices such as Antofagasta, according to analysts at RBC, who said it should benefit from limited supply pushing up prices. Antofagasta rose 0.3 per cent, or 5p, to 1588p. Review website Trustpilot climbed to the top of mid-cap index following a bumper update. The FTSE 250 firm expects revenues to be up by 17 per cent to £138million in 2023 with bookings rising 16 per cent to £153million. It also launched a share buyback worth £20million. Shares jumped 12.3 per cent, or 17.9p, to 163.5p. Exhibitions organiser Informa expects to make up to £965million profit this year, around £120million more than it made in 2023. It has also agreed to merge its digital businesses with the US firm Tech Target. Shares slid 2.5 per cent, or 19.6p, to 765.6p. Advertising giant WPP fell 4 per cent, or 30.4p, to 729p after analysts at UBS downgraded their rating on the stock over concerns that clients will continue to reduce spending on ads. Property firms London Metric and LXi have agreed to merge in a tie-up that will see it become the UK’s fourth-largest real estate investment trust. London Metric rose 1.2 per cent, or 2.2p, to 186.3p while LXi was up 0.5 per cent, or 0.5p, to 103.5p. Robert Walters – up 2.4 per cent, or 10p, to 420p – axed 220 roles between October and December as it saw its fees decline 10pc to £91.4million. But it expects to have made £20.5m of profit in 2023. Estate agent Savills is pinning its hopes on business improving this year as market uncertainty fades. Shares increased 0.5 per cent, or 5p, to 981p. Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. MORE HEADLINES This is Money is part of the Daily Mail, Mail on Sunday & Metro media group "
}