{
    "title": "AAPL Stock Outlook 2024: Can Apple Outsmart Microsoft?",
    "date": "2/1/2024",
    "url": "https://investorplace.com/2024/02/aapl-stock-outlook-2024-can-apple-outsmart-microsoft/",
    "text": " My Apple stock analysis suggests AAPL stock is a buy on any weakness Advertisement Source: Yalcin Sonat / Shutterstock.com Microsoft (NASDAQ:MSFT) is the only public company with a $3 trillion market capitalization, $130 million higher than Apple (NASDAQ:AAPL). While both companies have wonderful businesses, AAPL stock analysis suggests it might fall behind Microsoft in 2024. What can Apple shareholders like Warren Buffett do about the fact Microsoft is killing it in the all-important area of artificial intelligence? There isn’t anything they can do except wait for CEO Tim Cook to come up with a product that drives revenue like AI will. In the meantime, MSFT stock has more than doubled Apple’s performance over the past year (65% for the former compared to 30% for the latter) and looks ready to widen the lead in 2024. What are analysts saying about the gap in the two companies’ valuations? Is there any hope for Apple shareholders that 2024 won’t be sideways to a lower type of year in the markets? Let’s consider what the analysts say about Apple’s current problem. CNBC recently reported comments from TF International Securities analyst Ming-Chi Kuo. According to the analyst, iPhone sales, especially in China, will likely fall in 2024, as much as 15%. “Kuo wrote that Apple’s weekly shipments in China have fallen by 30% to 40% from a year earlier in recent weeks, ‘and this downward trend is expected to continue,’ CNBC reported Kuo’s comments on Jan. 30. ‘Apple may have the most significant decline among the major global mobile phone brands in 2024.’” Between foldable phones and Huawei’s comeback in China, Apple’s been pushed in the past year like never before. It will need to respond to the competitive threats facing its biggest moneymaker. According to Yahoo Finance data, the analyst estimate for Apple’s revenue in the latest quarter is $108.77 billion, 7% lower than a year earlier. That’s on top of a 5% decline in Q1 2023. Not every estimate has Apple’s iPhone revenue declining in Q1 2024. A Reuters report from Jan. 31 suggested that its quarterly iPhone sales rose 3%, the best growth in five quarters. However, almost all Apple analysts expect 2024 to be a challenging year for iPhone sales. As a result, its Services segment will have to do much of the heavy lifting in 2024. In Q1 2024, LSEG expects revenue from the segment, including advertising, App Store, Apple Music, Apple TV+, etc., to rise 12.5% over last year to $23.4 billion. The segment’s gross margin in Q4 2023 was nearly 71%. It contributes 39% of Apple’s gross profit despite generating less than 18% of revenue. In Q1 2023, its services revenue increased by 6.4%. Generating double the growth a year later would tremendously contribute to the overall business. I suspect advertising has something to do with it. Statista data says Apple’s U.S. ad revenue in 2020 was $2.2 billion. In 2024, it’s expected to be $6.2 billion, with a compound annual growth rate of 29.6%. If it were to maintain this CAGR through 2028, its annual ad revenue would be $17.5 billion, almost as much as its current Services revenue. In March 2023, Investor’s Business Daily discussed how Apple’s ad business was underappreciated. “‘We believe Apple advertising on its own apps is underappreciated,’ Barclays analyst Tim Long said in a note to clients Tuesday. ‘Most ad revenues are generated on the App Store, with some contribution from News and Stocks. This could expand to other apps like Maps, TV+, Podcasts, etc.,’” IBD reported. Long’s estimate for ad revenue is $19 billion by 2026, $1.5 billion higher than my estimate above, but two years earlier. While analysts might be worried about its upcoming Q1 2024 report, it’s clear that Services won’t be a part of the growth deficit facing Apple in 2024. I don’t think there’s any question that Apple remains a formidable tech company. That said, it’s clear that its Products business is facing revenue headwinds that should limit its growth. As I write this, AAPL stock has barely moved in 2024, up slightly over 1%. It reports earnings on Feb. 1 after the close. By the time this is published, the results could already be out. Apple stock trades at 7.8x sales, which isn’t cheap relative to its five-year average. However, compared to Microsoft’s multiple of 13.4x, it’s the value play of the two. Should AAPL stock fall on its earnings news, long-term investors shouldn’t hesitate to buy on weakness. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. Artificial Intelligence, Consumer Discretionary, Retail, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/aapl-stock-outlook-2024-can-apple-outsmart-microsoft/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}