{
    "title": "Microsoft's Tips: Partnering with European Works Councils",
    "date": "2/5/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/get-microsofts-tips-for-partnering-with-your-works-councils/",
    "text": "How Microsoft does IT Feb 5, 2024\t\t\t\t\t  |  Lukas Velush Microsoft has hundreds of thousands of employees around the world. To support their work, we need to ensure we meet their needs, honor their concerns, and set up the best possible environments for their success. In parts of Europe, our relationships with employees are governed by works councils, and they’re key players in all new technology implementations. When we’re adapting our solutions to highly regionalized regulatory standards, the best expertise comes from the people who live in those countries. “Microsoft is striving to be the most trustworthy company, and one part of that is about privacy and security,” says Allan Hvass, director of Microsoft Digital Employee Experience (MDEE) for Western Europe. “There’s local legislation and special interest groups, but another strong input is works councils in specific geographies.” In the course of our partnerships with regional works councils, we’ve learned some strategies for operating alongside these bodies on product rollouts. If you do business in a region where works councils are part of the regulatory landscape, you may want to consider these strategies for your own tech implementations. [See what we’ve learned from deploying Microsoft Viva, Data and AI across Microsoft. Learn how Microsoft benefits from partnering with our works councils. See how our relationships with our works councils boost product and service rollouts.] In several European countries, employers may have to partner with works councils. That depends on several factors, including the size of the organization and other legal requirements. Works councils are collective bodies, primarily at a local level, that represent rank and file employees within an organization. In practice, employers may need to engage with works councils in multiple countries. If you have a widespread European employee base, you might have a relationship with several works councils, each representing workers in their home country. For example, Microsoft operates across the European Union, so we collaborate with representatives in several different countries like Austria, Belgium, Germany, France, and the Netherlands, just to name a few. While a union is typically an external body that governs an industry, sector, trade, or business, works councils sit within the employer. They generally consist of employees elected from the company’s workforce. Those employees can be devoted to their works council roles either full-time or part-time. Works councils might play a role in day-to-day operations, and you may need their input or approval for any changes that impact the work environment. In some countries, works councils’ purview extends beyond consultation and into co-determination, which means that companies need to obtain a works council’s agreement before moving ahead with an initiative. Their authority and responsibilities vary from country to country, but the core mission remains the same: representing and protecting employees. Of course, you should consult with your own legal counsel to understand your obligations to any works councils within your organization, since they vary country-by-country. This article highlights Microsoft’s experience with our own works councils, and it isn’t intended to provide legal advice. Works councils can be responsible for a wide range of concerns depending on local laws and prior agreements their organizations have made. Typically, they have purview over topics like workplace health and safety, pay and benefits, hiring, business reorganizations, training, and more. In the context of technology implementations, they often take a keen interest in products, tools, and features that organizations might use to monitor or influence employee performance or behavior. As a result, you may need to consult with your works council before deploying certain kinds of tools and software in your organization. For example, Microsoft Viva Sales for Microsoft Teams is currently under review by our works councils across Europe. Its AI-powered conversation-tracking features demand careful consideration. One core principle of partnering with works councils is being aware of the kind of information they need and what sort of questions they’ll typically have. — Alexandra Jones, senior business program and change manager, Employee Experience Success “In Viva Sales, we have a feature that we call Sales Conversation Intelligence, which is basically an AI-driven assistant that sits in the background of a meeting and pulls out action items, sentiment analysis, and statistics that can help a salesperson have more productive calls with customers,” says Aaron Bjork, partner director of product management for Dynamics 365, CRM, and Viva Sales. “But within that feature set, we’re recording the call and creating a transcript, and those features need to follow certain additional guidelines depending on the works council we’re partnering with.” Initiating a consultation with a works council typically involves three steps: A strong relationship with works councils is a powerful asset because it builds a foundation of understanding between product teams, employees, and the HR and technical staff who liaise between them. “One core principle of partnering with works councils is being aware of the kind of information they need and what sort of questions they’ll typically have,” says Alexandra Jones, senior business program and change manager for Microsoft’s global Employee Experience Success team. “That helps us anticipate those questions and provide that information up front without waiting to be asked.” Before you engage a works council, a good first step is reaching out to your HR, privacy, and legal teams. They may help you head off any unforeseen blockers before they become an issue. In some cases, works councils actually require a privacy or GDPR review as part of their process, so privacy and legal professionals are essential partners. What we’ve learned is that the more proactive we are, the more prepared we are for these conversations, and the more we do up front, the better. — Aaron Bjork, partner director of product management, Dynamics 365 CRM and Viva Sales Organizations usually want to implement their technology as quickly as possible. To make that happen, it’s important to engage with a works council early in the process. Review and approval may take anywhere from several weeks to several months depending on the nature of the technology’s features, the works council’s existing docket, and even the time of year. “If you’re reactive in your approach, this takes longer,” Bjork says. “What we’ve learned is that the more proactive we are, the more prepared we are for these conversations, and the more we do up front, the better.” At Microsoft, we’ve been evolving a replicable and efficient process for getting new solutions and features approved. Seek approval from global HR. Confirm that the technology only interacts with employees’ information in a limited, private capacity, it complies with General Data Protection Regulations (GDPR), and its data won’t play into performance assessment or influencing behavior. Once global HR clears a solution, it’s time to zoom in on countries with works councils. This involves identifying the local HR representatives that engage with each country’s individual councils and submitting the actual details of the technology. Through partnering with our works council in Germany, we’ve developed a process for triaging reviews based on the compliance concerns that a solution is likely to raise. Those break down into two process flows: one for simple scenarios and one for more complex ones. For technology that’s unlikely to cause any concerns, the product team completes a single-page intake form. It answers simple questions like the tool’s name, audience, owner, and access rights to its data. The works council can expedite a simplified review of the technology in under four weeks. Some solutions require more extensive review. These complex scenarios include specific kinds of features: If these features are present, the product team completes a lengthier form that outlines the tool’s place in our organization, how managers might use it, and if the information it provides could inadvertently allow anyone other than a direct manager to appraise an employee’s performance. It’s also a good idea to provide screenshots, mockups, or other materials that demonstrate the user experience. The lengthier form usually gives the works council everything it needs to approve a tool. But if more information would be helpful, we initiate a dialog with other teams. The two-scenario workflow in place for Germany is just one example of how we engage with works councils in Europe. Each country’s council has its own processes and concerns, largely tied to the work culture in the region. But what they all share in common is that they’re a hub for dialog around the impact of new solutions and features. When a technology requires more than the simplest approval, it’s an opportunity for a conversation between several teams throughout Microsoft. Returning to our ongoing implementation of Viva Sales for Microsoft Teams, this tool contains a number of features that include recording and tracking. Its ongoing implementation is a good example of this consultation process. Several stakeholder teams are involved: Every stakeholder has a role to play in ensuring our organization balances the dual objectives of getting Viva Sales for Microsoft Teams implemented quickly and respecting our works councils’ need to protect employees and maintain compliance. If you’re considering a technology implementation in a works council jurisdiction, it’s worth considering who in your organization might belong in the conversation. It’s essential for companies and councils to work together closely to drive outcomes that work for everyone—employees and organizations alike. Our rollout experiences at Microsoft have demonstrated the power of this approach: unique innovations that wouldn’t have taken shape if not for collaboration with works councils. “Everything we build these days is configurable and allows an organization to tailor the solution to their specific requirements,” Bjork says. “That’s directly related to works councils because there’s no one-size-fits-all. You can’t apply the same level of compliance or the same capabilities to everyone and assume that it will just work.” That insight wouldn’t be possible without close partnerships between product groups, works councils, and our wider organization. Ultimately, it means we’re more equipped to meet regulatory demands around the world. It’s also an asset for our customers, who can use Microsoft technology knowing it meets rigorous standards for protecting employees and their data. “Microsoft wants to represent the gold standard of solutions that keep people safe, regardless of the mechanisms their countries have in place for protecting employees,” Jones says. “These conversations drive us to do better and question solutions before we even get to the point of launching them.” Tags: compliance, digital transformation, HR, labor relations, Microsoft 365, privacy Mar 29, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tAngela Gamba The use of business applications in Microsoft Teams has become a strategic advantage for many organizations, as they can accelerate the digital transformation of all business areas, generating a high demand for the Information Technology (IT) team to make these applications available. While use of apps for Microsoft Teams can be daunting for IT Teams... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Our core system for managing our external workforce was showing its age in an increasingly demanding modern workplace environment—we needed to simplify our external staff management. Here at Microsoft, our large and diverse external, non-FTE workforce plays a vital role in our success. For us, external staff includes contractors, consultants, freelancers, and business guests who... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Microsoft runs on Microsoft technology. We are the proving ground for our products and when we say that software is enterprise-ready this means that we have already built it for and run it at scale in our own enterprise. We are in the business of building the future of technology. And more often than not,... Mar 25, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tInside Track staff Next-generation connectivity is enabling us to transform our internal enterprise network here at Microsoft. Deploying a more agile, secure, and effective network environment across Microsoft is empowering our employees to thrive in our new hybrid world. This article describes how we’re implementing this new network strategy, including goals, action areas, expected results, and a brief... Ensuring compliance doesn’t have to be a roadblock—just ask the Microsoft workers’ council in Germany. This group of employee representatives has partnered with their employer, Microsoft, to speed up how the company develops and deploys new products and services to its employees, a story that resonates with customers who have similar challenges at their companies....\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more For a transcript, please view the video on YouTube: https://www.youtube.com/watch?v=grMzZ798W30, select the “More actions” button (three dots icon) below the video, and then select “Show transcript.” Watch to see how Microsoft is partnering with its workers’ councils. In the second episode of our new Inside Track “Spotlight” video series, Microsoft Inside Track leader Keith Boyd...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more For a transcript, please view the video on YouTube: https://www.youtube.com/watch?v=40B99JJpaUo, select the “More actions” button (three dots icon) below the video, and then select “Show transcript.” Wangui McKelvey and Nathalie D’Hers speak about Microsoft’s internal Windows 11 upgrade. McKelvey is the general manager of Microsoft 365 and D’Hers is Microsoft’s corporate vice president of Microsoft...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}