{
    "title": "Microsoft signs for 27600 tons of CO2 to be captured and stored in waste \nconcrete",
    "date": "2/15/2024",
    "url": "https://www.datacenterdynamics.com/en/news/microsoft-signs-for-27600-tons-of-co2-to-be-captured-and-stored-in-waste-concrete/",
    "text": "Neustark captures CO2 at source and stores it in rubble Microsoft has paid to have 27,600 tons of carbon dioxide removed from the atmosphere and stored in waste concrete. Switzerland-based Neustark will capture the CO2 at source over the next six years, and store it in mineral waste, such as demolition concrete. The agreement is just the latest in a long series of carbon removal deals Microsoft has signed since it pledged to become carbon-negative by 2030. The company has bought carbon credits with a range of carbon removal techniques, most recently 362,000 tons provided by reforestation in the US. Previously it has bought 32,000 tons of credits from a biochar project in Bolivia, and 10,000 tons of biochar credits from Virginia-based Carbon Streaming. The company also has a 300,000-ton deal with Heirloom, which will remove carbon directly from the air onto sheets of calcium oxide, and two other electrical direct capture deals: 10,000 tons from Climeworks, and an undisclosed amount captured in Wyoming by Carbon Capture. Neustark is a recent arrival, founded in 2019 by Johannes Tiefenthaler and Valentin Gutknecht of ETH Zurich University. Microsoft announced in 2022, that it would be buying certificates from the company to help it scale up. Neustark has so far removed 1,000 tons of CO2 and, with 14 sites in operation, has ramped up to an aggregate capacity of 5,000 tons of CO2 per year, which means Microsoft must be its biggest customer by a long way. The company has another 20 sites in the pipeline and plans to have removed 1 million tons of CO2 by 2030. Neustark captures CO2 from biogas plants, liquifies it, and transports it to construction waste recycling sites, where it is injected into demolition concrete, and bound permanently to the surface of the concrete granules by a process of mineralization. The carbonated granules can then be used in road building or recycled concrete. The process is measurable and verified by the Gold Standard, says Neustark. The carbon is stored for hundreds of thousands of years, and the risk of reversal is \"slim to none,\" the company says. \"We turn the world’s largest waste stream – demolition concrete – and other mineral waste material into a carbon sink,\" said Lisa Braune, head of CDR at Neustark. \"Our solution makes an impact now, and we are expanding our footprint quickly.\" Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}