{
    "title": "Is Microsoft's Surface lineup in danger of being discontinued altogether?",
    "date": "2/14/2024",
    "url": "https://www.xda-developers.com/microsoft-surface-danger-of-being-discontinued/",
    "text": "Sales for Microsoft Surface are dipping, and the passionate leader behind the brand left Microsoft. Is it time to start worrying about the future? Microsoft's Surface brand has grown to become a staple of PC computing. The company has put out a lot of cool and innovative hardware in the Surface lineup, from hits like the Surface Laptop Studio to swings and misses like the Surface Neo. But much has changed over the past few years, and Microsoft Surface finds itself at an inflection point in 2024. Surface isn't bringing in revenue like it once was, and Microsoft has scaled back its ambitions for the brand. The crux of that shift happened last year, when Panos Panay — the former Surface leader that became the face of the brand — left for greener pastures at Amazon. That leads us to the present day situation for Microsoft Surface. Surface is shedding its identity, product sales have been in a downturn for well over a year, and the brand's vocal pioneer is long gone. All together, it paints a grim future for Microsoft Surface. Is reality as foreboding as it seems, or is Microsoft just retooling the Surface lineup? At the end of the day, Microsoft is a corporation, and it has a responsibility to its shareholders to make money. Anytime a device or category is showing stagnating or declining revenue, there's some cause for concern. That's true of Microsoft Surface today, which has been declining in revenue for more than a year. However, to fully understand how we got here, we need to look back at 2022. At the end of the 2022 fiscal year, Microsoft generated nearly $7 billion in revenue from Surface sales. It was the climax of a period of growth for Surface that spanned almost a decade. After that, Surface sales began to plunge. It's worth noting that it has been a tough few years for the computing industry as a whole. There were chip shortages and other slowdowns, but more importantly, the end of the COVID-19 pandemic had an effect on the industry. Unlike most of the economy, the pandemic was actually somewhat beneficial for the technology sector. People were working from home and using technology for work and school more than ever, and many upgraded ther computers and workstations. The months and years following the pandemic marked the starting point for the PC market slowdown, and it affected Microsoft. It's hard to pinpoint exact figures for Surface sales, because Microsoft stopped reporting revenue specifically from Surface devices last year. Instead, it lumps all Microsoft hardware devices together, which includes Surface — but also Xbox, peripherals, accessories, and more. Still, even with the inclusion of other products, devices revenue is down. Last year, devices revenue decreased $1.8 billion (or 24%) year-over-year. Aside from the industry-wide demand decreases mentioned above, Microsoft also cited \"elevated channel inventory levels\" as reasons for \"additional weakness\" in its financial report. This year, it isn't any better. Devices revenue decreased by 22% year-over-year in the first quarter of the 2024 fiscal year, while revenue for things like Windows, Microsoft Cloud, and services all increased. In the second quarter of 2024, devices revenue decreased by 9% compared to Q2 2023. This is actually less than Microsoft expected device revenue to decline, as explained by Microsoft CFO Amy Hood on the company's Q2 2024 earnings call. However, devices revenue is still dragging down Microsoft's personal computing revenue. Devices revenue shows up in Microsoft's \"More Personal Computing\" category, which also includes Windows revenue, gaming revenue, and search and news advertising revenue. Of those four categories, devices revenue was the only one to decline in either Q1 2024 or Q2 2024. You might think this is because Microsoft hasn't shipped a new Surface Pro device since late 2022. However, there have been gaps in the Surface Pro release schedule at times over the past decade. Still, there has never been a period where Surface revenue has fallen as sharply, or for as long, as it has since 2022 over the last 10 years. In fact, due to the way Microsoft's fiscal year falls, we can see that the release of the Surface Pro 9 did little to stop devices revenue from declining. Microsoft's fiscal year 2023 began on July 1, 2022, and ended June 30, 2023. That means the revenue from the release of the brand-new Surface Pro 9 in October 2022 would be reported in the 2023 fiscal year. Instead of moving the needle in a positive direction, devices revenue still decreased $1.8 billion. If all PC makers were suffering to the same degree as Microsoft, there wouldn't be much cause for concern. However, Microsoft recently announced that Windows OEM revenue is on the rise. For those that aren't familiar, OEMs pay Microsoft to put Windows on computers, like pre-built PCs and laptops. During the second quarter of 2024, which ended Dec. 31, 2023, Windows revenue increased by 9% and Windows OEM revenue increased by 11%. That means people are buying Windows PCs and laptops, they just aren't buying them from Microsoft. In fact, during Microsoft's Q1 2024 earnings call, CEO Satya Nadella said that \"PC market unit volumes were at roughly pre-pandemic levels.\" It's also important to remember that third-party OEMs are starting to beat Microsoft Surface at its own game. Surface was once the brand that pushed Windows hardware forward. Now, it's falling behind. Companies like Lenovo, Asus, and HP are all trying new things in terms of Windows hardware. That includes releasing devices like the Lenovo Yoga Book 9i, Asus Zenbook Duo (2024), and the HP Spectre Foldable. These devices are what Microsoft hoped it could create with the Surface brand, and that's clear with the announcement and cancelation of the Surface Neo. That isn't exactly surprising, because Microsoft hasn't been shy about its desire to move away from cutting-edge devices and new form factors. Instead, Microsoft is bringing Surface back to the basics. It's also placing an emphasis on the enterprise and education markets, which is evident from the release of the Surface Go 4 for Business. This is rumored to be why Panay left Microsoft to begin with; Surface is changing course in a way its pioneer felt limited by. However, it's a bit concerning that Microsoft hasn't found success with either innovative new form factors or basic consumer and business-oriented hardware. With the person responsible for Surface's rise now gone, it begs the question of what will end up working for Surface. Any of these factors in isolation wouldn't be enough to raise concerns about whether the Microsoft Surface brand might be headed for a discontinuation. Together, the troubles of declining sales, a changing vision, and new leadership could combine to change the Surface lineup as we know it. There's still time for Microsoft to recover with Surface, but the clock is ticking. Surface revenue peaked at $7 billion, and has since declined. Even at that peak, Surface was a small part of Microsoft's revenue as a whole. At one point, Surface was moving toward becoming a notable part of Microsoft's personal computing business. Now, that future is somewhat unclear. This doesn't mean that Microsoft Surface is in danger of a cancelation, but it does have implications. If sales don't recover, Microsoft could place its focus on more successful businesses, like Windows and Cloud revenue. Microsoft hasn't released a new Surface Pro since 2022. We're expecting a new Surface Pro device to debut this year, and the most popular Surface device could turn declining sales figures around. That's especially true thanks to Qualcomm's Snapdragon X Elite chipset, which could bring unmatched performance and efficiency to the Surface Pro lineup. This is a telling year for the Microsoft Surface brand, whichever way it shakes out. If a new Surface Pro device and a groundbreaking system-on-a-chip isn't enough to lift Microsoft Surface revenue, I really don't know what will.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Brady Snyder is a technology journalist that has written about mobile devices and computers for multiple publications over the last two years. He graduated from St. John's University in 2023 with a B.S. in Journalism and a minor in English. Prior to joining XDA Developers, Brady wrote over 500 articles for Screen Rant's tech team, where he covered an Apple beat. You'll also find his work in Android Central, iMore, Android Headlines, and his blog. Based in Phoenix, Arizona, Brady reviews consumer technology, software, and services. You can reach Brady at brady@xda-developers.com. Peak Design's Everyday Backpack has been one of the best tech bags out there for a while, but how does it stack up to competition? From crazy concepts to impressive technology, this year's MWC had it all. Microsoft's new AI assistant is incredibly versatile and powerful. Here's you can leverage its capabilities. Thermal paste is a vital component of any CPU cooling solution, but here's how long you can expect it to last Looking to expand with more ports? This Anker compact USB-C hub is just the thing. For when you can't resist checking out all the new Windows features "
}