{
    "title": "AI: Microsoft will advertise its Copilot during the Super Bowl",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/video/ai-microsoft-advertise-copilot-during-222420284.html",
    "text": "Microsoft (MSFT) will advertise its new AI product Copilot in an ad run during Super Bowl LVIII. The commercial is aimed at showing off many of its capabilities, but is playing this ad during the Big Game really the way to go? Yahoo Finance's Josh Schafer, Dan Howley, and Pras Subramanian discuss Microsoft's latest ad and the implications Copilot has for different professions. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino PRAS SABRAMANIAN: Microsoft released its latest ad highlighting the company's Copilot, or AI, offerings, which will play during the big game on Sunday. You see right here, it says, they say I'll never open my own business, they say they say they counted me out, they said I couldn't get a degree, or they said I couldn't code. And then it shows the actual Copilot code this thing, storyboard this movie, et cetera, et cetera. Looks pretty interesting. I mean, it kind of gives you more of an inspirational kind of vibe for AI. But in reality, I think we have a bunch of different takes here. The question is, are we really going to be using this product for these said use cases? DAN HOWLEY: I think it's interesting because it's the bro commercial I've seen for tech stuff in a while. And I don't think it really tells you exactly what this does. I mean, Copilot is a really great product. It comes built in to-- PRAS SABRAMANIAN: Code for my 3D open world game. DAN HOWLEY: There it is. All right. PRAS SABRAMANIAN: Brand new game. It's on Xbox store. DAN HOWLEY: Game developers, go get new jobs I guess. Yeah, I mean, I just think that this is the wrong marketing way to go about this. JOSH SCHAFER: Where it loses me is the AI pitch that I understand that sort of why you would use Copilot would be to use it to help you with your current job would make a ton of sense. Say you're writing resumes or job applications and you use AI to help you with that and make your job more efficient. And this commercial is like, well, if you never thought you could write a screenplay, you can use AI, which I think is actually maybe more the way people are scared of AI. It's like you can take screenwriters jobs by just using AI to help you and then, all of a sudden, you're going to get really good at it. PRAS SABRAMANIAN: I didn't see it that way. I saw it more as like an inspirational, I can do these things that are entrepreneurial or on my own. I don't need people to help me out with them. But you're absolutely right. It is sort of a thing where it's like, forget the screenwriter or forget the storyboard artist. He's done, I don't need him anymore. DAN HOWLEY: I just I just think it's one of those things where it's-- Copilot built into Windows is awesome. Eventually, you'll be able to control your whole computer by just being like install printer and it'll, bam, do it. That's like where they're going, that's the whole idea for this. That's sick. Setting up a printer-- Fix that HP and Dell and everybody. It's still a monstrosity, but that's the idea. This doesn't really sell you on how easy it's going to make things. And that's the point of it. JOSH SCHAFER: We got to get Dan Howley on the next Microsoft ad. I think that's where-- Dan gets the AI pitch. He's got to be-- PRAS SABRAMANIAN: There's a guy with the Vision Pro out here somewhere walking around so maybe we can just have him do that. Related Quotes "
}