{
    "title": "Indian startup Sarvam AI collaborates with Microsoft to bring its Indic \nvoice large language model (LLM) to Azure ...",
    "date": "2/8/2024",
    "url": "https://news.microsoft.com/en-in/indian-startup-sarvam-ai-collaborates-with-microsoft-to-bring-its-indic-voice-large-language-model-llm-to-azure/",
    "text": "February 8, 2024\t\t\t\n\t\t\t | Microsoft Source The collaboration aims to enable Sarvam AI to leverage Azure AI and Azure Infrastructure to build and deploy their voice LLM stack It also aims to enable developers to build generative AI apps at scale and empower enterprises to adopt generative AI quickly and responsibly Bengaluru, February 8, 2024: Indian generative AI startup Sarvam AI has announced that it is working with Microsoft to make its Indic voice large language model (LLM) available on Azure. The collaboration reinforces Microsoft’s commitment to enabling AI-driven growth and innovation in India. Sarvam AI is building generative AI models targeting Indic languages and contexts. The startup aims to make the development and deployment of generative AI apps in India more accurate and cost effective. Sarvam AI’s Indic voice LLM, which intends to provide a natural voice-based interface to LLMs, will initially be available in Hindi. Sarvam AI is working to expand coverage to more Indian languages while ensuring support for colloquial language use. Pratyush Kumar, co-founder of Sarvam AI, said, “We are very excited to collaborate with Microsoft to make advanced AI technology accessible and impactful for everyone in India. This partnership embodies our vision of ‘Sarvam’ – meaning ‘all’ – by enhancing AI’s reach across various Indian languages and sectors.” Voice is one of the most natural interfaces for generative AI applications in Indian languages and can be applied in sectors such as education, finance, healthcare, and customer service. By working to make Sarvam AI’s Indic voice LLM available on Azure, Microsoft is laying the foundations for more India-focused developers to build real-time, voice-based generative AI apps at scale. The companies will also collaborate to help enterprises adopt generative AI quickly and responsibly. Vivek Raghavan, co-founder of Sarvam AI, said, “We see great synergy in combining the deep-tech expertise at Sarvam AI with Microsoft’s leadership in frontier models and the Copilot stack to empower enterprises to be successful in Generative AI”. Sarvam AI will use Microsoft’s cutting-edge cloud and AI infrastructure – including Azure OpenAI Service and Azure Machine Learning – to train, host, and scale its LLMs quickly and efficiently. As part of the collaboration, Sarvam AI and Microsoft are also researching ways to better support Indian languages in Microsoft’s Generative AI frontier language models and to deploy them at scale. “At Microsoft, we are committed to enabling AI for everyone, empowering India’s transformation into an AI-first nation,” said Puneet Chandok, president of Microsoft India & South Asia. “Through our collaboration with Sarvam AI, we are not just supporting homegrown innovation – we are fostering a future where every individual, regardless of their language or background, can benefit from the power of voice-driven AI solutions. Together, we are taking a significant step toward enabling India’s people, communities, and organizations to achieve more.” Click here to learn more about Satya Nadella’s visit and how Microsoft is empowering organizations in India with AI. About Sarvam AI Sarvam AI is on a mission to lead transformative research in AI to make the development, deployment, and distribution of generative AI applications in India more robust, better performing, and cheaper. The company aims to develop a full stack of generative AI solutions, including efficient large-scale Indic language models and an enterprise-grade platform for building generative AI apps. Sarvam AI is also committed to fostering a generative AI ecosystem through open-source contributions and large-scale data curation for the public good. About Microsoft India Microsoft (Nasdaq: MSFT, @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more. Microsoft set up its India operations in 1990. Today, Microsoft entities in India have over 23,000 employees engaged in sales and marketing, research, development, customer support, and industry solutions across 10 Indian cities – Ahmedabad, Bengaluru, Chennai, New Delhi, Gurugram, Hyderabad, Kolkata, Mumbai, Noida, and Pune. Microsoft offers its global cloud services from local datacenters to accelerate digital transformation across Indian startups, businesses, and government organizations. Follow us: Share this page: "
}