{
    "title": "Microsoft Brings Copilot To Everyone Using Windows: Here Are Four Cool \nThings You Can Do With It - Micros",
    "date": "2/4/2024",
    "url": "https://www.benzinga.com/news/23/12/36084701/microsoft-brings-copilot-to-everyone-using-windows-here-are-four-cool-things-you-can-do-with-it",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Microsoft Corp. MSFT has now expanded the availability of Copilot to all users, bringing the power of AI to Windows 11 and Windows 10 users. While that sounds full of buzzwords, Copilot can do several useful things from your desktop. What Happened: Microsoft Copilot is an AI-powered assistant that lives on your Windows desktop, replacing Cortana. Microsoft has leveraged its partnership with OpenAI, using its ChatGPT and Dall-E technologies to bring generative AI features to Windows users. Microsoft's Copilot chatbot might actually seem very familiar if you have used Bing Chat before. However, while Bing Chat lives in the Edge browser, Copilot lives on your Windows desktop. See Also: What Can ChatGPT Vision Do? Complex Coding, PowerPoint Slides … And Even Finding Waldo Like Bing Chat, Copilot can answer your questions, generate images, and help you with things like coding and writing. But it can also perform tasks on your Windows computer, making it much more useful than Bing Chat. We have been using Copilot for a while now, and here are a few cool things you can do with it. You can ask Copilot to perform a wide range of tasks on your Windows 11 computer. For example, if you have several windows open and are losing track of what is happening, you can launch Copilot and ask it to help you organize all the open windows. Consider it like asking a friend or an assistant to help you organize your desk. Sounds really helpful, doesn't it? Want to mute audio? You can tell Copilot to do it. Don't want to be disturbed? You can tell Copilot to enable the DND mode. We often find ourselves distracted by long articles, especially when there is no summary or gist of the story you can look up. Fret not, though – you can ask Copilot to summarize stories in open tabs now. You must keep the story open and launch Copilot using the Win + C combination or launch it from your taskbar. Now, type this: Summarize the page in Microsoft Edge, Google Chrome, or any browser you use. Copilot will summarize the story, and then you can also interact with it by asking questions. Not everyone enjoys editing photos – many of us have relied on MS Paint for basic edits. Now, you can use Copilot to edit photos for things like removing the background or blurring it using portrait mode. Simply drag and drop any image you want to edit in the Copilot window, and the assistant will do it for you. You can use Copilot to generate images just like you can with Bing Chat. Copilot uses Dall-E 3, again, just like Bing Chat. For detailed steps on generating images, check out our how-to here. Image Credits- Shutterstock Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Smart Holiday Decorating: A Buyer’s Guide To App-Controlled Christmas Lights © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}