{
    "title": "Microsoft Corp. stock outperforms competitors despite losses on the day",
    "date": "2/23/2024",
    "url": "https://www.marketwatch.com/data-news/microsoft-corp-stock-outperforms-competitors-despite-losses-on-the-day-20b7ec47-b7e135df6262",
    "text": "Shares of Microsoft Corp. \n        MSFT,\n        -0.17%\n       shed 0.32% to $410.34 Friday, on what proved to be an all-around favorable trading session for the stock market, with the S&P 500 Index \n        SPX,\n        +0.11%\n       rising 0.03% to 5,088.80 and the Dow Jones Industrial Average \n        DJIA,\n        +0.12%\n       rising 0.16% to 39,131.53. Microsoft Corp. closed $10.48 short of its 52-week high ($420.82), which the company reached on February 9th. The stock demonstrated a mixed performance when compared to some of its competitors Friday, as Apple Inc. \n        AAPL,\n        -1.06%\n       fell 1.00% to $182.52, Alphabet Inc. Cl C \n        GOOG,\n        +0.21%\n       fell 0.02% to $145.29, and Alphabet Inc. Cl A \n        GOOGL,\n        +0.04%\n       fell 0.09% to $143.96. Trading volume (16.1 M) remained 8.9 million below its 50-day average volume of 25.0 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. Gold has generally outpaced performance in silver over the last few years, but the tide may soon turn in favor of silver. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}