{
    "title": "Why the Cybersecurity Growth Slowdown Could Boost Microsoft Sales",
    "date": "2/21/2024",
    "url": "https://www.theinformation.com/articles/why-the-cybersecurity-growth-slowdown-could-boost-microsoft-sales",
    "text": "Exclusive: Microsoft and OpenAI Plot $100 Billion Stargate AI SupercomputerSave 25% and learn more Join us at future in-person and virtual events. Search, find and engage with others who are serious about tech and business. Follow and be a part of discussions about tech, finance and media. Premium advertising opportunities for brands Team access to our exclusive tech news Journalists who break and shape the news, in your inbox Catch up on conversations with global leaders in tech, media and finance Explore our recent partner collaborations Join us at future in-person and virtual events. Search, find and engage with others who are serious about tech and business. Follow and be a part of discussions about tech, finance and media. Premium advertising opportunities for brands Team access to our exclusive tech news Journalists who break and shape the news, in your inbox Catch up on conversations with global leaders in tech, media and finance Explore our recent partner collaborations Cybersecurity providers are facing a moment of truth. After years of persuading companies to spend more on security software, hackers are still getting through. That’s giving some companies “cyber fatigue,” and putting them under pressure to buy less, Palo Alto Networks CEO Nikesh Arora said on Tuesday. Other industry executives echoed his comments, which helped spark a sell-off in cyber stocks on Wednesday. “Companies just don’t feel like they can afford to keep increasing their security budgets annually,” said Jim Routh, a former chief security officer at MassMutual and CVS who is now an investor and advisor to cybersecurity startups. In response, the biggest cybersecurity sellers are offering steep discounts on all-in-one security bundles, with an eye toward boosting their share of the market. "
}