{
    "title": "Tesla Drops After Missed Earnings, Why Is Cathie Wood Gobbling Up Shares? - \nMicrosoft (NASDAQ:MSFT), ARK",
    "date": "2/16/2024",
    "url": "https://www.benzinga.com/trading-ideas/long-ideas/24/02/37184786/tesla-drops-after-missed-earnings-why-is-cathie-wood-gobbling-up-shares",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla Slides It’s been a rough year for Tesla TSLA. As other members of the so-called magnificent 7 rocket to record valuations – Nvidia NVDA is up over 235% since last February; Microsoft MSFT is up over 50% – the EV pioneer is flat, trading near the same level as this time last year and down about 30% from its summer peak. The company released its quarterly numbers at the end of January, missing again on earnings per share and revenue. The stock dropped over 12% on the day. So why did Cathie Wood scoop up 377,000 shares of the stock for her ARK Innovation ETF ARKK? Business As Usual This is the investing guru's strategy. Wood still believes in the long-term vision of the company, so buying after a large dip means she is getting a discount. Wood constantly rebalances her fund's holdings by selling off overperforming stocks and buying underperforming ones. This is the strategy that has helped ARKK return 22% on the year. Eyes On The Horizon Tesla still has a lot of promise; Wood is betting big on the company delivering on its promise. Tesla has a vision of the future where its autonomous driving technology drives the automotive industry and its autonomous robots are ubiquitous. The company is investing heavily in the AI and robotics necessary for this vision to come to fruition. If it delivers, the potential revenue will easily validate a stock price much higher than the roughly $200 it currently sits at. Max View Traders bullish on Wood and her fund can buy the ETF directly or for those who want to further maximize their view, leveraged funds can help. For example, the award-winning AXS 2X Innovation ETF TARK aims to return twice the daily return of ARKK. And for traders not buying what Wood is selling, AXS offers an option for the bears. The AXS Short Innovation Daily ETF SARK, which aims to return the inverse performance of ARKK, can be an attractive option. TARK was just awarded Best ETF Launch at Benzinga's 2023 Fintech Awards. The innovative fund was launched in May of 2022 and the care and skill with which the fund is operated is clear. Photo by Neo Tan on Unsplash. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}