{
    "title": "Microsoft Corporation (MSFT)'s Sustainability Scorecard Remains Unchanged",
    "date": "2/2/2024",
    "url": "https://finance.yahoo.com/news/microsoft-corporation-msft-sustainability-scorecard-105905752.html",
    "text": "Madison Investments, an investment advisor, released its “Madison Sustainable Equity Fund” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. During the fourth quarter, equity markets ended the year on a high note, with the S&P 500 achieving an 11.7% increase. This brought the full-year return to 26.3%. The Fund (Class Y) returned 18.0% for the year, but had a Q4 return of 11.9%, trailing the S&P 500. The fourth quarter's strength can be attributed to the yield curve's downward shift. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Madison Sustainable Equity Fund featured stocks such as Microsoft Corporation (NASDAQ:MSFT) in its Q4 2023 investor letter. Headquartered in Redmond, Washington, Microsoft Corporation (NASDAQ:MSFT) is a multinational software company that develops, and licenses software, services, devices, and solutions. On February 1, 2024, Microsoft Corporation (NASDAQ:MSFT) stock closed at $403.78 per share. The one-month return of Microsoft Corporation (NASDAQ:MSFT) was 9.80%, and its shares gained 56.29% of their value over the last 52 weeks. Microsoft Corporation (NASDAQ:MSFT) has a market capitalization of $3 trillion. Madison Sustainable Equity Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter: \"Microsoft Corporation's (NASDAQ:MSFT) sustainable scorecard was updated with an unchanged rating of Above Average. The company’s board has an official Environmental, Social, and Public Policy Committee in addition to the traditional Audit, Compensation, and Governance committees. For ten years, Microsoft has publicly released data measuring the diversity of its workforce. With the prominence of Artificial Intelligence (AI), the company has launched a 5-point blueprint for governing AI to address public policy and regulation. Environmentally, Microsoft has multiple programs to be carbon negative by 2030. The company has signed Purchase Power Agreements for carbon-free energy totaling 13.5 Gigawatts.\" manaemedia / Shutterstock.com Microsoft Corporation (NASDAQ:MSFT) is in first position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 306 hedge fund portfolios held Microsoft Corporation (NASDAQ:MSFT) at the end of third quarter which was 300 in the previous quarter. We discussed Microsoft Corporation (NASDAQ:MSFT) in another article and shared Light Street Capital's top stock picks. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 40 Richest Countries in the World by Per Capita Net Worth 15 Countries that Produce the Best Software Engineers 15 High Quality Flannel Shirts for Men Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}