{
    "title": "Microsoft invests $5.6 billion in AI and cloud infrastructure for Spain and \nGermany",
    "date": "2/20/2024",
    "url": "https://www.technologyrecord.com/article/microsoft-invests-56-billion-in-ai-and-cloud-infrastructure-for-spain-and-germany",
    "text": "Microsoft Microsoft president Brad Smith and Spain’s prime minister Pedro Sánchez New data centres planned for Madrid and Aragon in Spain, and Germany’s infrastructure will be expanded across Frankfurt and the North Rhine-Westphalia region Alice Chambers |\r\n\t\t\t\r\n\t\t\t\r\n\t\t\t 20 February 2024 Microsoft is investing a total of $5.6 billion in artificial intelligence and cloud infrastructure for Spain and Germany. In Spain, $2.1 billion will be spent over the next two years to open a Data Center Cloud Region in Madrid and a Data Center Campus in Aragon. They will provide Microsoft cloud services and enable Spanish and European companies, and public administrations, to access Microsoft’s AI solutions. “Our investment is beyond just building data centres, it’s a testament to our 37-year commitment to Spain, its security, development and digital transformation of its government, businesses and people,” said Brad Smith, vice chair and president of Microsoft, in a Microsoft Spain press release. The investment is expected to contribute to the creation of 69,000 jobs in the country between 2026-2030, according to IDC. A separate investment of €3.2 billion ($3.5 billion) will be used to expand Microsoft’s cloud and AI infrastructure in Frankfurt and the North Rhine-Westphalia region in Germany. “We want to enable the German economy to benefit from AI in order to continue to expand its global leadership position in competitiveness,” said Smith in a Microsoft Germany press release. “We see increasing demand for AI applications in key economic sectors such as manufacturing, automotive, financial services, pharmaceuticals, life sciences and medical technology. Because these industries are fundamentally changing due to economic change, it is important to equip companies in Germany with world-leading technology.” Brad Smith and Olaf Scholz, chancellor of Germany, agreed the details of Microsoft’s largest investment in its 40-year history in Germany Microsoft also aims to teach digital skills to more than 1.2 million people in Germany by the end of 2025. Both partnerships will extend the use of AI in public administration, promote the use of responsible AI, and reinforce national cybersecurity and sustainability strategies. The most popular stories of the month delivered to your inbox "
}