{
    "title": "OpenAI Shatters Records - Here's How ChatGPT Propelled Revenue Beyond $2B - \nMicrosoft (NASDAQ:MSFT), Taiw",
    "date": "2/9/2024",
    "url": "https://www.benzinga.com/news/24/02/37033749/openai-shatters-records-heres-how-chatgpt-propelled-revenue-beyond-2b",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW ChatGPT parent OpenAI has seen its revenues soar beyond $2 billion annually, marking a significant milestone that places it among the fastest-growing technology companies ever. This achievement, reported in December 2023, underscores the widespread success of its AI product, ChatGPT, which has captured the attention of both consumer and business sectors. Backed by Microsoft Corp MSFT, OpenAI is optimistic about doubling its revenue by 2025, driven by the burgeoning demand for generative AI tools in professional settings, the Financial Times reports. Previous reports indicated OpenAI seeking further financial backing from Microsoft to develop superintelligent GPT-5. In 2023, Microsoft invested $10 billion in OpenAI under a “multiyear” agreement that valued the company at $29 billion. Founded in 2015 as a non-profit AI research lab, OpenAI transitioned into a commercial entity in 2020. This move has propelled its revenue from $1.3 billion in October of the previous year to its current rate, demonstrating an impressive sales growth trajectory. CEO Sam Altman revealed that most Fortune 500 companies utilize OpenAI’s technologies despite internal challenges, with ChatGPT alone attracting 100 million weekly users. Altman is ambitiously seeking to transform the global semiconductor industry as a project that could require raising between $5 trillion – $7 trillion, essential for powering advanced AI technologies, among other applications, the Wall Street Journal reports. Altman is engaging with investors, including the government of the United Arab Emirates, to fund this massive tech project, which seeks to address the acute shortage of graphics processing units (GPUs) needed for training large AI models like ChatGPT. This proposed investment dwarfs the current global semiconductor industry, which had sales of $527 billion last year, with an expected growth to $1 trillion annually by 2030. The scale of Altman’s fundraising goals is unprecedented, surpassing the total U.S. corporate debt issuance of $1.44 trillion last year and approaching the combined market capitalization of tech giants Microsoft and Apple. Altman’s ambitious plans extend beyond fundraising; he envisions partnering with OpenAI, chip makers, investors, and power providers to construct chip foundries. Altman has met with key figures to discuss this venture, including U.A.E.’s Sheikh Tahnoun bin Zayed al Nahyan and SoftBank CEO Masayoshi Son. He has also engaged with Taiwan Semiconductor Manufacturing Co TSM, wanting to build numerous chip fabrication plants with funding from Middle Eastern investors. Price Action: MSFT shares traded higher by 0.55% at $416.40 premarket on the last check Friday. Also Read: GPT Store’s Launch on Hold: Is OpenAI’s Leadership Shuffle to Blame for the 2024 Wait? Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Microsoft and OpenAI. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}