{
    "title": "Microsoft now lets you build a free website with just your Facebook page",
    "date": "2/25/2024",
    "url": "https://tech.hindustantimes.com/tech/news/microsoft-now-lets-you-build-a-free-website-with-just-your-facebook-page-71614267172691.html",
    "text": "Copyright © HT Media Limited  All rights reserved. There's no shortage of site builders for those looking to create their own websites today but they usually somewhat limited free plans or simply lock all their features behind a monthly subscription plan, which means they're out of the reach of many users who don't want to spend on an expensive service. Microsoft is looking to change that, with the launch of a new website builder which the company says will be available for free. Also read: Microsoft OneNote and Word for web now let you embed Pinterest Pins In a post on its Advertising Blog, Microsoft cited a Small Business Association report that showed more than 36 percent of businesses did not have a website, while stating that another study had revealed that 80 percent of customers who were surveyed said they would look up a company online before they either visited or purchased something. The company says that without a website, a small business could lose those potential customers in a grim warning. Not only will Microsoft give users the ability to build their site for free, but the company says that those who choose to do so will actually save time because they will be able to import their website information directly from their Facebook page. This means that Microsoft will automatically figure out where your content should go and you can adjust things later once the service pulls the information from your business Facebook page.\r\n\t\nTo get started, you'll need to head over to Microsoft's Digital Marketing Center and sign up for an account, if you don't already have one. Then create an advertising campaign and choose “I don't have a website. Help me build one for free”. After you enter your business name and type in the URL you want to use for your website, you can create your site without creating an ad campaign, Microsoft says. You can then either import information from your business's Facebook page or build it yourself with website components.Don't miss: Microsoft patents tech that will let you chat will dead peopleYou can choose from the following components to add to your website: headline and description, customer action button (call now, send email, get quote, etc.), cover image, business summary, social posts, reviews, gallery, business contact information, social links. You can then publish your website and begin using it right away, according to Microsoft. To get started, you'll need to head over to Microsoft's Digital Marketing Center and sign up for an account, if you don't already have one. Then create an advertising campaign and choose “I don't have a website. Help me build one for free”. After you enter your business name and type in the URL you want to use for your website, you can create your site without creating an ad campaign, Microsoft says. You can then either import information from your business's Facebook page or build it yourself with website components. Don't miss: Microsoft patents tech that will let you chat will dead people You can choose from the following components to add to your website: headline and description, customer action button (call now, send email, get quote, etc.), cover image, business summary, social posts, reviews, gallery, business contact information, social links. You can then publish your website and begin using it right away, according to Microsoft. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71614267172691 "
}