{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.fool.com/investing/2024/03/16/top-tech-stocks-buy-hand-over-fist-before-nasdaq/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Technology stocks were in fine form in 2023, which is evident from the outstanding gain of almost 67% on the Nasdaq-100 Technology Sector index during the year, and the good part is that the sector is showing promising signs once again this year. The Nasdaq-100 Technology Sector index is up roughly 7% so far in 2024, and history suggests that it could finish the year with much stronger gains. Barring 1999, the Nasdaq-100 has delivered an average gain of 24% in the year following one in which the index clocked 40%-plus gains, according to brokerage firm Capex.com. Favorable factors such as a robust U.S. economy and declining inflation can help the Nasdaq repeat history in 2024 and jump higher. That's why now would be a good time for investors to buy tech stocks such as Microsoft (MSFT -0.17%) and Micron Technology (MU -1.04%). These two companies not only trade at attractive valuations, but they are also on track to capitalize on fast-growing opportunities in the cloud computing and semiconductor markets. Let's take a closer look at the reasons Microsoft and Micron are worth buying right now. Microsoft stock currently trades at 36 times trailing earnings. That's slightly higher than the Nasdaq-100's average price-to-earnings ratio of 33. However, Microsoft's forward earnings multiple of 31 is almost in line with the index's average. Buying Microsoft at this valuation looks like a smart thing to do, considering the company's growing dominance in the cloud computing market. In the fourth quarter of 2023, Microsoft's Azure cloud controlled 24% of the cloud infrastructure market, according to Synergy Research Group, up by one percentage point from the prior-year period. It's also worth noting that cloud infrastructure spending was up 20% year over year in the fourth quarter of 2023, slightly higher than the 19% growth the market recorded for the entire year. Synergy Research points out that generative artificial intelligence (AI) was a key driver behind the market's stronger growth last quarter. However, this is just the beginning of AI adoption in the cloud computing space. Mordor Intelligence estimates that the cloud AI market could be worth $67 billion in 2024, indicating that it could account for a big chunk of the overall cloud computing market, which was worth $270 billion last year. But by 2029, the cloud AI market is expected to generate a whopping $274 billion in annual revenue. The good news for Microsoft investors is that the company is making good progress in this fast-growing niche. Its Azure cloud revenue was up 30% year over year last quarter, compared with the 13% growth at market leader Amazon Web Services. AI drove six percentage points' worth of growth in Microsoft's cloud business last quarter, allowing it to close the gap with the market leader. The lucrative opportunity in the cloud computing market along with other areas where Microsoft has been integrating AI for a long time explains why analysts expect the company's top and bottom lines to receive a nice boost in the long run. Independent investment banking firm Evercore estimates that AI could add $82.5 billion in annual revenue for Microsoft by 2028 while boosting its earnings by $5.10 per share. That points toward a big boost, given that Microsoft is predicted to deliver $11.66 per share in earnings in the current fiscal year on revenue of $244.3 billion. Investors, therefore, would do well to buy this tech titan before it soars higher and becomes expensive on the back of the growing demand for AI applications across multiple industries. The memory market saw a turnaround in 2023 after being under the weather for around two years. Prices of dynamic random access memory (DRAM) chips fell from the end of 2021 to the end of 2023, crushing Micron's top and bottom lines in the process.  MU Revenue (Quarterly) data by YCharts The good news for Micron is that DRAM prices are expected to jump between 10% and 15% in the first quarter of 2024. The price rise was driven by growth in multiple areas, ranging from personal computers to smartphones to servers, and that's not surprising considering the growing adoption of AI in these areas. AI servers, for example, create the need for more high-bandwidth memory chips as major chipmakers use this type of memory in their AI accelerators. Similarly, the advent of AI-enabled PCs and smartphones should drive a stronger demand for memory chips. All this explains why Gartner forecast an 88% increase in the memory market's revenue this year to $87 billion, driven by stronger pricing and volumes. Meanwhile, storage memory revenue is also predicted to increase by almost 50% in 2024 to $53 billion. The memory market's recovery is the reason Micron's revenue is forecast to increase an impressive 46% in the current fiscal year to $22.7 billion, according to consensus estimates. Analysts expect the momentum to continue over the next couple of fiscal years as well.  MU Revenue Estimates for Next Fiscal Year data by YCharts Micron stock currently trades at 6.6 times sales. That's lower than the Nasdaq-100's price-to-sales ratio of 7.3, suggesting that investors are getting a good deal on this semiconductor stock now. That's because a sales multiple of even 6 after a couple of fiscal years indicates that Micron could be sitting on a market cap of $212 billion. That's almost double its current market cap of around $107 billion, which is the reason investors should consider buying this Nasdaq stock before it skyrockets. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon and Microsoft. The Motley Fool recommends Gartner and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}