{
    "title": "Auburn National Bancorporation, Inc. (NASDAQ:AUBN) Short Interest Up 7.1% \nin February",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-aubn-options-data-report-2024-03-18/",
    "text": "Auburn National Bancorporation, Inc. (NASDAQ:AUBN - Get Free Report) saw a significant growth in short interest during the month of February. As of February 29th, there was short interest totalling 3,000 shares, a growth of 7.1% from the February 14th total of 2,800 shares. Currently, 0.2% of the shares of the company are sold short. Based on an average trading volume of 2,600 shares, the days-to-cover ratio is currently 1.2 days. Get AUBN alerts:Sign UpAuburn National Bancorporation Trading Down 2.4 % Shares of AUBN traded down $0.47 on Monday, reaching $19.32. 1,323 shares of the company's stock traded hands, compared to its average volume of 2,469. The stock's 50 day simple moving average is $20.71 and its two-hundred day simple moving average is $20.94. Auburn National Bancorporation has a 52-week low of $18.80 and a 52-week high of $24.40. The stock has a market cap of $67.43 million, a PE ratio of 49.48 and a beta of 0.51. Auburn National Bancorporation (NASDAQ:AUBN - Get Free Report) last released its earnings results on Monday, January 29th. The financial services provider reported ($1.14) earnings per share (EPS) for the quarter. Auburn National Bancorporation had a return on equity of 2.03% and a net margin of 24.74%. The firm had revenue of $0.63 million during the quarter. Auburn National Bancorporation Dividend Announcement The firm also recently disclosed a quarterly dividend, which will be paid on Monday, March 25th. Investors of record on Friday, March 8th will be paid a dividend of $0.27 per share. This represents a $1.08 annualized dividend and a yield of 5.59%. The ex-dividend date is Thursday, March 7th. Auburn National Bancorporation's dividend payout ratio is 270.00%. Institutional Investors Weigh In On Auburn National Bancorporation Several large investors have recently added to or reduced their stakes in the business. UBS Group AG increased its holdings in shares of Auburn National Bancorporation by 1,000.0% in the second quarter. UBS Group AG now owns 946 shares of the financial services provider's stock worth $25,000 after buying an additional 860 shares during the period. BlackRock Inc. increased its holdings in Auburn National Bancorporation by 7.8% during the 2nd quarter. BlackRock Inc. now owns 7,010 shares of the financial services provider's stock valued at $149,000 after purchasing an additional 505 shares during the period. Renaissance Technologies LLC increased its holdings in Auburn National Bancorporation by 8.6% during the 2nd quarter. Renaissance Technologies LLC now owns 10,141 shares of the financial services provider's stock valued at $216,000 after purchasing an additional 800 shares during the period. Captrust Financial Advisors purchased a new position in Auburn National Bancorporation during the 2nd quarter valued at about $222,000. Finally, BNP Paribas Arbitrage SNC grew its holdings in shares of Auburn National Bancorporation by 1,528,500.0% during the 3rd quarter. BNP Paribas Arbitrage SNC now owns 15,286 shares of the financial services provider's stock worth $336,000 after acquiring an additional 15,285 shares during the period. Institutional investors own 7.00% of the company's stock. Auburn National Bancorporation Company Profile (Get Free Report) Auburn National Bancorporation, Inc operates as the bank holding company for AuburnBank that provides various banking products and services in East Alabama. Its deposit products include checking, savings, and transaction deposit accounts, as well as certificates of deposit. The company also provides commercial, financial, agricultural, real estate construction, and consumer loan products; and other financial services.Read MoreFive stocks we like better than Auburn National Bancorporation3 Grocery Stocks That Are Proving They Are Still Essential Insider Selling of Amazon Spikes in Q1, but it's Not Time to SellWhat is the Euro STOXX 50 Index?2 Deep Value, High Yield Stocks With a Double-Digit UpsideHow to Invest in Small Cap Stocks Are We in a Bear Market? Here are the Signs This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Auburn National Bancorporation, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Auburn National Bancorporation wasn't on the list. While Auburn National Bancorporation currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Do you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}