{
    "title": "Microsoft Co. (NASDAQ:MSFT) is Avity Investment Management Inc.'s 6th \nLargest Position",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/microsoft-co-nasdaqmsft-is-avity-investment-management-inc-s-6th-largest-position.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Avity Investment Management Inc. lifted its holdings in  Microsoft Co. (NASDAQ:MSFT – Free Report) by 3.9% in the 4th quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The institutional investor  owned 121,715 shares of the software giant’s stock after purchasing an additional 4,604 shares during the period. Microsoft comprises about  4.1% of Avity Investment Management Inc.’s portfolio, making the stock its 6th largest holding. Avity Investment Management Inc.’s holdings in Microsoft were worth $45,770,000 at the end of the most recent quarter. Several other institutional investors and hedge funds have also recently modified their holdings of MSFT. DGS Capital Management LLC increased its stake in shares of  Microsoft by 19.9% in the 1st quarter. DGS Capital Management LLC now owns 14,342 shares of the software giant’s stock valued at $4,422,000 after purchasing an additional 2,383 shares in the last quarter.  IFM Investors Pty Ltd increased its stake in shares of  Microsoft by 20.8% in the 1st quarter. IFM Investors Pty Ltd now owns 1,138,469 shares of the software giant’s stock valued at $351,001,000 after purchasing an additional 196,338 shares in the last quarter.  Altus Wealth Group LLC boosted its holdings in  Microsoft by 1.2% in the 1st quarter. Altus Wealth Group LLC now owns 12,712 shares of the software giant’s stock worth $3,919,000 after buying an additional 152 shares during the last quarter.  Powell Investment Advisors LLC boosted its holdings in  Microsoft by 16.2% in the 1st quarter. Powell Investment Advisors LLC now owns 2,578 shares of the software giant’s stock worth $795,000 after buying an additional 359 shares during the last quarter.  Finally, Onyx Bridge Wealth Group LLC boosted its holdings in  Microsoft by 8.2% in the 1st quarter. Onyx Bridge Wealth Group LLC now owns 6,782 shares of the software giant’s stock worth $1,921,000 after buying an additional 512 shares during the last quarter. Hedge funds and other institutional investors own  71.13% of the company’s stock. Microsoft stock opened at $420.72 on Friday. Microsoft Co. has a twelve month low of $275.37 and a twelve month high of $430.82. The stock’s fifty day simple moving average is $410.82 and its 200-day simple moving average is $374.31. The company has a current ratio of 1.22, a quick ratio of 1.20 and a debt-to-equity ratio of 0.19. The firm has a market capitalization of $3.13 trillion, a P/E ratio of 38.04, a P/E/G ratio of 2.24 and a beta of 0.89. Microsoft (NASDAQ:MSFT – Get Free Report) last posted its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 earnings per share for the quarter, topping analysts’ consensus estimates of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The business had revenue of $62.02 billion for the quarter, compared to analyst estimates of $61.14 billion. During the same quarter in the prior year, the company earned $2.32 earnings per share. The company’s revenue was up 17.6% on a year-over-year basis.  As a group, equities analysts expect that  Microsoft Co. will post 11.63 earnings per share for the current fiscal year. The company also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Investors of record on Thursday, May 16th will be paid a dividend of $0.75 per share. The ex-dividend date of this dividend is Wednesday, May 15th. This represents a $3.00 dividend on an annualized basis and a dividend yield of 0.71%. Microsoft’s payout ratio is currently 27.12%. In related news, major shareholder Corp Microsoft sold 1,000,000 shares of the business’s stock in a transaction on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the transaction, the insider now owns 11,677,398 shares in the company, valued at $22,770,926.10. The sale was disclosed in a legal filing with the SEC, which is accessible through the SEC website. In related news, EVP Kathleen T. Hogan sold 21,955 shares of the business’s stock in a transaction on Monday, March 11th. The shares were sold at an average price of $403.96, for a total transaction of $8,868,941.80. Following the completion of the transaction, the executive vice president now owns 159,764 shares in the company, valued at $64,538,265.44. The sale was disclosed in a legal filing with the SEC, which is accessible through the SEC website. Also, major shareholder Corp Microsoft sold 1,000,000 shares of the business’s stock in a transaction on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the transaction, the insider now owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The disclosure for this sale can be found here. Over the last quarter, insiders sold 1,070,258 shares of company stock worth $30,690,456. Corporate insiders own  0.03% of the company’s stock. Several equities research analysts recently issued reports on the company. KeyCorp assumed coverage on Microsoft in a report on Thursday, March 21st. They issued an “overweight” rating and a $490.00 price objective on the stock. Jefferies Financial Group  reiterated a “buy” rating and issued a $465.00 price objective on shares of Microsoft in a report on Wednesday, March 6th. StockNews.com cut Microsoft from a “buy” rating to a “hold” rating in a report on Thursday, February 22nd. Raymond James boosted their target price on Microsoft from $400.00 to $450.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. Finally, BMO Capital Markets boosted their target price on Microsoft from $420.00 to $455.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. Four equities research analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company’s stock. Based on data from MarketBeat, the stock currently has a consensus rating of “Moderate Buy” and an average target price of $423.34. Read Our Latest Analysis on MSFT (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Wellington Management Group LLP Purchases 1,779 Shares of Maravai LifeSciences Holdings, Inc. (NASDAQ:MRVI) 1834 Investment Advisors Co. Has $27.83 Million Stock Holdings in Apple Inc. (NASDAQ:AAPL) "
}