{
    "title": "KeyBanc Capital Markets initates Microsoft Corporation (MSFT) stock to an \nOverweight – Knox Daily",
    "date": "3/27/2024",
    "url": "https://knoxdaily.com/2024/03/27/keybanc-capital-markets-initates-microsoft-corporation-msft-stock-to-an-overweight/",
    "text": "Microsoft Corporation’s filing revealed that its EVP, Chief Human Resources Off Hogan Kathleen T unloaded Company’s shares for reported $8.87 million on Mar 11 ’24. In the deal valued at $403.96 per share,21,955 shares were sold. As a result of this transaction, Hogan Kathleen T now holds 159,764 shares worth roughly $67.36 million. Then, Althoff Judson sold 10,000 shares, generating $4,036,490 in total proceeds. Upon selling the shares at $403.65, the EVP, Chief Commercial Officer now owns 129,949 shares. Before that, Nadella Satya sold 1,276 shares. Microsoft Corporation shares valued at $524,359 were divested by the Chief Executive Officer at a price of $410.94 per share. As a result of the transaction, Nadella Satya now holds 801,331 shares, worth roughly $337.88 million. KeyBanc Capital Markets initiated its Microsoft Corporation [MSFT] rating to an Overweight in a research note published on March 21, 2024; the price target was $490. A number of analysts have revised their coverage, including Exane BNP Paribas’s analysts, who increased its forecast for the stock in mid January from “a Neutral” to “an Outperform”. Truist began covering MSFT with “Buy” recommendation on December 13, 2023. China Renaissance started covering the stock on December 05, 2023. It rated MSFT as “a Buy”. On Tuesday, Microsoft Corporation [NASDAQ:MSFT] saw its stock fall -0.29% to $421.65. Over the last five days, the stock has gained 0.06%. Microsoft Corporation shares have risen nearly 12.13% since the year began. Nevertheless, the stocks have risen 50.28% over the past one year. While a 52-week high of $430.82 was reached on 03/21/24, a 52-week low of $272.05 was recorded on 01/05/24. SMA at 50 days reached $409.37, while 200 days put it at $360.68. A total of 16.68 million shares were traded, compared to the trading of 18.06 million shares in the previous session. The 24-hour chart illustrates a support level at 420.00, which if violated will result in even more drops to 418.36. On the upside, there is a resistance level at 424.64. A further resistance level may holdings at 427.64. The Relative Strength Index (RSI) on the 14-day chart is 56.49, which indicates neutral technical sentiment, while the Moving Average Convergence Divergence (MACD) stands at 5.95, which suggests price will go up in the next trading period. Percent R suggests that price movement has been low at 31.02%. Stochastics %K at 79.34% indicates the stock is a holding. A steep rise in short interest was recorded in Microsoft Corporation stocks on Feb 29, 2024, dropping by -1.64 million shares to a total of 48.24 million shares. Yahoo Finance data shows the prior-month short interest on Jan 31, 2024 was 49.88 million shares. There was a decline of -3.4%, which implies that there is a negative sentiment for the stock. In spite of short shares comprising just 0.65% of the overall stock float, the days-to-cover ratio (short ratio) fell to 2.02. © 2023  All rights Reserved. Knox Daily We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. "
}