{
    "title": "GoDaddy Inc. (NYSE:GDDY) Short Interest Update",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-gddy-options-data-report-2024-03-19/",
    "text": "GoDaddy Inc. (NYSE:GDDY - Get Free Report) was the recipient of a significant increase in short interest in February. As of February 29th, there was short interest totalling 2,460,000 shares, an increase of 5.1% from the February 14th total of 2,340,000 shares. Based on an average trading volume of 1,580,000 shares, the days-to-cover ratio is presently 1.6 days. Currently, 1.7% of the company's stock are short sold. A number of equities analysts recently weighed in on GDDY shares. Barclays lifted their price objective on shares of GoDaddy from $125.00 to $130.00 and gave the company an \"overweight\" rating in a research report on Tuesday, February 20th. Piper Sandler boosted their target price on shares of GoDaddy from $130.00 to $145.00 and gave the stock an \"overweight\" rating in a research report on Thursday, March 7th. Benchmark restated a \"buy\" rating and set a $150.00 target price on shares of GoDaddy in a research report on Thursday, March 7th. UBS Group boosted their target price on shares of GoDaddy from $110.00 to $118.00 and gave the stock a \"neutral\" rating in a research report on Wednesday, February 14th. Finally, Morgan Stanley boosted their target price on shares of GoDaddy from $120.00 to $132.00 and gave the stock an \"equal weight\" rating in a research report on Thursday, March 14th. Four investment analysts have rated the stock with a hold rating, six have assigned a buy rating and one has issued a strong buy rating to the company's stock. According to data from MarketBeat, the stock presently has an average rating of \"Moderate Buy\" and an average target price of $131.22. Read Our Latest Stock Report on GDDY Shares of NYSE:GDDY traded down $0.23 during trading on Tuesday, reaching $119.19. 1,186,551 shares of the stock were exchanged, compared to its average volume of 1,603,603. The company has a debt-to-equity ratio of 61.07, a quick ratio of 0.47 and a current ratio of 0.47. GoDaddy has a 12-month low of $67.43 and a 12-month high of $119.75. The firm has a market cap of $16.98 billion, a price-to-earnings ratio of 12.44 and a beta of 1.12. The firm's 50-day moving average price is $110.89 and its 200 day moving average price is $95.62. GoDaddy (NYSE:GDDY - Get Free Report) last released its quarterly earnings results on Tuesday, February 13th. The technology company reported $1.08 earnings per share for the quarter, topping analysts' consensus estimates of $1.03 by $0.05. The firm had revenue of $1.10 billion during the quarter, compared to analysts' expectations of $1.10 billion. GoDaddy had a negative return on equity of 89.25% and a net margin of 32.74%. On average, sell-side analysts anticipate that GoDaddy will post 4.61 earnings per share for the current fiscal year. In other GoDaddy news, COO Roger Chen sold 4,000 shares of the firm's stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $105.22, for a total transaction of $420,880.00. Following the sale, the chief operating officer now owns 153,716 shares of the company's stock, valued at $16,173,997.52. The transaction was disclosed in a filing with the SEC, which can be accessed through the SEC website. In other news, COO Roger Chen sold 4,000 shares of GoDaddy stock in a transaction on Tuesday, January 2nd. The shares were sold at an average price of $105.22, for a total value of $420,880.00. Following the transaction, the chief operating officer now directly owns 153,716 shares of the company's stock, valued at approximately $16,173,997.52. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, CAO Nick Daddario sold 1,823 shares of GoDaddy stock in a transaction on Monday, March 4th. The shares were sold at an average price of $110.54, for a total transaction of $201,514.42. Following the completion of the transaction, the chief accounting officer now directly owns 25,263 shares in the company, valued at $2,792,572.02. The disclosure for this sale can be found here. Insiders have sold a total of 118,615 shares of company stock valued at $13,157,935 over the last 90 days. 0.54% of the stock is owned by corporate insiders. A number of institutional investors and hedge funds have recently bought and sold shares of the stock. BlackRock Inc. raised its position in shares of GoDaddy by 23.6% during the 2nd quarter. BlackRock Inc. now owns 10,522,511 shares of the technology company's stock valued at $790,556,000 after acquiring an additional 2,010,233 shares in the last quarter. Bleakley Financial Group LLC raised its position in shares of GoDaddy by 1.6% during the 2nd quarter. Bleakley Financial Group LLC now owns 15,886 shares of the technology company's stock valued at $1,194,000 after acquiring an additional 250 shares in the last quarter. Rice Hall James & Associates LLC raised its position in shares of GoDaddy by 3.1% during the 3rd quarter. Rice Hall James & Associates LLC now owns 84,077 shares of the technology company's stock valued at $6,262,000 after acquiring an additional 2,538 shares in the last quarter. Mitsubishi UFJ Kokusai Asset Management Co. Ltd. raised its position in shares of GoDaddy by 15.3% during the 3rd quarter. Mitsubishi UFJ Kokusai Asset Management Co. Ltd. now owns 63,351 shares of the technology company's stock valued at $4,718,000 after acquiring an additional 8,421 shares in the last quarter. Finally, Qsemble Capital Management LP acquired a new stake in GoDaddy in the third quarter worth $1,266,000. Hedge funds and other institutional investors own 95.03% of the company's stock. GoDaddy Inc engages in the design and development of cloud-based products in the United States and internationally. It operates through two segments: Applications and Commerce, and Core Platform. The Applications and Commerce segment provides applications products, including Websites + Marketing, a mobile-optimized online tool that enables customers to build websites and e-commerce enabled online stores; and Managed WordPress, a streamlined and optimized website building that allows customers to easily build and manage a faster WordPress site; Managed WooCommerce Stores to sell anything and anywhere online; and marketing tools and services, such as GoDaddy Studio mobile application, search engine optimization, Meta and Google My Business, and email and social media marketing designed to help businesses acquire and engage customers and create content.Recommended StoriesFive stocks we like better than GoDaddyWhat Are Trending Stocks? Trending Stocks ExplainedGrowing Twice as Fast as Tesla, XPeng is a BuyInvesting in large cap stocks: Diving into big caps4 Stocks Building Long-Term Value for Shareholders What Are Dividend Achievers? An IntroductionFedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount Before you consider GoDaddy, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and GoDaddy wasn't on the list. While GoDaddy currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of seven best retirement stocks and why they should be in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}