{
    "title": "Former Microsoft CFO joins Trump administration",
    "date": "3/25/2024",
    "url": "https://nz.news.yahoo.com/finance/news/former-microsoft-cfo-joins-trump-193155203.html",
    "text": "Chris Liddell, a former executive at Microsoft (NASDAQ: MSFT) and General Motors (NYSE: GM), will join  Donald Trump 's White House staff as assistant to the president and director of strategic initiatives, according to a statement from the Trump transition team. Liddell is no stranger to transitions, in both the public and private sector. The author of \"Romney Readiness Project,\" Liddell helped spearhead the early transition efforts of Mitt Romney's presidential bid. Liddell also helped steer Microsoft through a difficult transition during the financial crisis, when Microsoft cut costs steeply as companies like Apple (NASDAQ: AAPL) took the lead in mobile computing. Liddell also guided General Motors' recovery from the bailouts, leading the carmaker's $23 billion return to public market. Liddell's leadership of \"large, complex companies in the private sector\" should help the Trump administration implement \"system wide improvement to the performance of the government,\" the president-elect said in a statement. In his new position, Liddell will help form and oversee a series of high impact task forces, the transition team said. More From CNBC Top News and Analysis Latest News Video Personal Finance The Dolphins have gone top of the NRL ladder with a 30-14 win over Gold Coast as their big-name off-season recruits Thomas Flegler and Herbie Farnworth shone. Goalkeeper Ryan Scott was the hero for the Newcastle Jets as they hung on to deny A-League Men finals hopefuls Melbourne City in a scoreless draw.  Goals from Anthony Caceres and Joel King have sealed a 2-0 win for Sydney FC over the Central Coast Mariners in the A-League Men. Melbourne's Ben Brown has kicked three goals as the Demons scored a seven-point away victory against Port Adelaide. The Hurricanes and Blues have both recorded huge Super Rugby Pacific wins, thumping the Highlanders and Moana Pasifika, respectively.  Police are investigating racial abuse yelled at the children of an AFL legend while they were playing in their yard as support floods in for the family. Lachlan Lonergan has suffered a serious ankle injury as the ACT Brumbies overcame a nine-point deficit to beat the Queensland Reds 20-19 at Suncorp Stadium. St George Illawarra fullback Tyrell Sloan has scored two tries to help the Dragons bounce back to winning ways with a 20-12 NRL victory over a poor Manly side.  Essendon star Jake Stringer has kicked the match-winning goal to pull the Bombers over the line against a tired St Kilda at Marvel Stadium. The great Kelly Slater has been beaten at Bells Beach as Australians Morgan Cibilic and Ethan Ewing advanced to the quarter-finals of the Rip Curl Pro. The Western Force's unbeaten start to the Super Rugby Women season has come to an end, losing to Fijian Drua, while the Brumbies saw off the Reds.  Wellington have dealt a blow to Western Sydney's finals hopes, while Michelle Heyman equalled an ALW record as Canberra staged a late comeback in Brisbane. Liam Wilson has been told by ring rival Oscar Valdez he must not give up on a promise he made to his dying dad, despite losing his latest world-title fight. Melbourne United will have home-court advantage for the deciding game of the best-of-five NBL championship series against the Tasmania JackJumpers.  Endale Mekonnen and Chloe Mannix-Power have set the pace in the heats for the 2024 Stawell Gifts. The Western Force were up a man for 30 minutes against the Drua, but still suffered a 31-13 loss in wet and slippery conditions in Fiji. Australian star Josh Giddey scored a team-high 23 points to help the Oklahoma City Thunder roll past the Phoenix Suns in the NBA. Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... The SA government has unveiled a package to help winemakers return to China's huge market with the lifting of punitive tariffs. One woman has died and a second is in a critical condition after overdosing in Queensland's southeast. Jannik Sinner has demolished defending champion Daniil Medvedev to reach the Miami Open final, where he will face world No.12 Grigor Dimitrov. "
}