{
    "title": "CBA invites Microsoft closer on AI, cyber security",
    "date": "3/11/2024",
    "url": "https://www.itnews.com.au/news/cba-invites-microsoft-closer-on-ai-cyber-security-605951",
    "text": "CBA will work more closely with Microsoft in the areas of generative AI and cyber security under an expanded partnership agreement. Group CIO and group executive of technology Gavin Munroe said that Microsoft engineers in Seattle “had already started working with CBA on a set of experiments with real life use cases to improve our customers’ experience.” “Through our ongoing partnership, we’ll be able to deliver technology that will allow customers to interact with CBA seamlessly and resolve queries faster than ever before,” Munroe said. “We also see this as an opportunity to work together with leading global technology teams to ensure CBA’s safety and security is constantly upgraded and improved, to keep pace with the evolving threat landscape.” The expanded partnership appears to position Microsoft as underpinning a ‘CommBank customer copilot’ that Munroe first revealed plans for at the end of last year. At the time, it was unclear what technology foundation the copilot would use; the bank has an existing strategic partnership with H2O.ai, which underpins the vast majority of its GenAI use cases. CBA said today that copilots, built on Microsoft, would also be offered to staff. “[We’ll be] developing copilots to help team members use Generative AI to better respond to customer needs,” the bank said. A significant part of the expanded partnership with Microsoft is cyber security focused. It will include more sharing of intelligence “to enhance cyber security and developing tools for CBA business customers to help them better protect themselves”, as well “working together to develop cyber skills capability to help Australia keep pace globally on artificial intelligence.” The cyber security elements were reinforced by comments from Microsoft Australia and New Zealand managing director Steven Worrall. “Our collaboration will also go beyond immediate business outcomes, addressing critical societal challenges through enhanced cyber security and sovereign capability development,” Worrall said in a statement. “Together, we aim to not only enhance the security posture of CommBank and its customers but also increase Australia’s resilience against evolving cyber threats. "
}