{
    "title": "e.l.f. Beauty (NYSE:ELF) Earns \"Buy\" Rating from DA Davidson",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-elf-reiterated-rating-2024-03-21/",
    "text": "DA Davidson reissued their buy rating on shares of e.l.f. Beauty (NYSE:ELF - Free Report) in a research note released on Thursday, Benzinga reports. They currently have a $220.00 target price on the stock. Other equities research analysts also recently issued research reports about the stock. TD Cowen lifted their price target on shares of e.l.f. Beauty from $185.00 to $220.00 and gave the stock a market perform rating in a research note on Wednesday, March 13th. JPMorgan Chase & Co. increased their price target on e.l.f. Beauty from $130.00 to $175.00 and gave the company an overweight rating in a report on Thursday, January 18th. Raymond James upped their target price on e.l.f. Beauty from $140.00 to $180.00 and gave the company a strong-buy rating in a research report on Monday, January 22nd. Bank of America raised their price target on shares of e.l.f. Beauty from $200.00 to $230.00 and gave the stock a buy rating in a research report on Wednesday, March 6th. Finally, StockNews.com downgraded shares of e.l.f. Beauty from a hold rating to a sell rating in a research note on Wednesday, February 7th. One equities research analyst has rated the stock with a sell rating, four have given a hold rating, seven have issued a buy rating and one has assigned a strong buy rating to the company. According to data from MarketBeat.com, the stock has a consensus rating of Moderate Buy and a consensus price target of $186.58. Get Our Latest Stock Report on ELF e.l.f. Beauty stock traded up $6.77 during trading on Thursday, reaching $207.31. 1,358,284 shares of the company's stock were exchanged, compared to its average volume of 1,522,167. e.l.f. Beauty has a 52-week low of $73.08 and a 52-week high of $221.83. The firm has a market cap of $11.51 billion, a price-to-earnings ratio of 91.73, a PEG ratio of 2.14 and a beta of 1.60. The company has a debt-to-equity ratio of 0.27, a quick ratio of 0.83 and a current ratio of 1.50. The company's 50-day moving average is $180.07 and its two-hundred day moving average is $140.83. e.l.f. Beauty (NYSE:ELF - Get Free Report) last issued its earnings results on Tuesday, February 6th. The company reported $0.58 earnings per share for the quarter, topping the consensus estimate of $0.47 by $0.11. The company had revenue of $270.94 million during the quarter, compared to the consensus estimate of $239.66 million. e.l.f. Beauty had a return on equity of 28.98% and a net margin of 14.53%. On average, analysts predict that e.l.f. Beauty will post 2.49 earnings per share for the current year. In other news, CEO Tarang Amin sold 23,142 shares of e.l.f. Beauty stock in a transaction on Friday, January 5th. The stock was sold at an average price of $139.44, for a total transaction of $3,226,920.48. Following the transaction, the chief executive officer now owns 44,263 shares in the company, valued at $6,172,032.72. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through this link. In other e.l.f. Beauty news, CEO Tarang Amin sold 23,142 shares of the company's stock in a transaction that occurred on Friday, January 5th. The shares were sold at an average price of $139.44, for a total value of $3,226,920.48. Following the transaction, the chief executive officer now owns 44,263 shares in the company, valued at approximately $6,172,032.72. The transaction was disclosed in a document filed with the SEC, which can be accessed through this link. Also, insider Scott Milsten sold 10,000 shares of the company's stock in a transaction on Monday, January 8th. The stock was sold at an average price of $150.06, for a total transaction of $1,500,600.00. Following the completion of the transaction, the insider now directly owns 79,104 shares in the company, valued at $11,870,346.24. The disclosure for this sale can be found here. Insiders have sold 61,922 shares of company stock worth $10,145,374 over the last 90 days. 5.20% of the stock is owned by company insiders. A number of hedge funds have recently added to or reduced their stakes in ELF. ST Germain D J Co. Inc. bought a new position in shares of e.l.f. Beauty in the 2nd quarter valued at approximately $26,000. Dark Forest Capital Management LP bought a new position in e.l.f. Beauty in the 1st quarter worth $27,000. Point72 Middle East FZE bought a new position in e.l.f. Beauty in the 4th quarter worth $28,000. Householder Group Estate & Retirement Specialist LLC acquired a new position in e.l.f. Beauty during the 3rd quarter worth $29,000. Finally, Armstrong Advisory Group Inc. boosted its holdings in e.l.f. Beauty by 390.2% during the fourth quarter. Armstrong Advisory Group Inc. now owns 201 shares of the company's stock valued at $29,000 after acquiring an additional 160 shares during the period. Institutional investors and hedge funds own 92.44% of the company's stock. e.l.f. Beauty, Inc, together with its subsidiaries, provides cosmetic and skin care products under the e.l.f. Cosmetics, e.l.f. Skin, Well People, and Keys Soulcare brand names worldwide. The company offers eye, lip, face, face, paw, and skin care products. It sells its products through national and international retailers and direct-to-consumer channels, which include e-commerce platforms in the United States, and internationally primarily through distributors.See AlsoFive stocks we like better than e.l.f. BeautyHow Can Investors Benefit From After-Hours TradingGoogle and Meta Circling the Market on a TikTok Ban RallyHow to Invest in the Best Canadian Stocks Intuitive Machines: Charting a Course Among the StarsTSX Venture Exchange (Formerly Canadian Venture Exchange)KB Home’s Stock Price Can Move Higher, Here’s Why  Before you consider e.l.f. Beauty, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and e.l.f. Beauty wasn't on the list. While e.l.f. Beauty currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here As the AI market heats up, investors who have a vision for artificial intelligence have the potential to see real returns. Learn about the industry as a whole as well as seven companies that are getting work done with the power of AI. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}