{
    "title": "Microsoft Co. (NASDAQ:MSFT) Shares Sold by Financial Network Wealth \nManagement LLC",
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/microsoft-co-nasdaqmsft-shares-sold-by-financial-network-wealth-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Financial Network Wealth Management LLC trimmed its position in shares of  Microsoft Co. (NASDAQ:MSFT – Free Report) by 7.5% in the 4th quarter, according to the company in its most recent filing with the Securities and Exchange Commission (SEC). The institutional investor  owned 33,985 shares of the software giant’s stock after selling 2,760 shares during the quarter. Microsoft makes up  about  5.5% of Financial Network Wealth Management LLC’s portfolio, making the stock its 4th biggest holding. Financial Network Wealth Management LLC’s holdings in Microsoft were worth $12,779,000 at the end of the most recent reporting period. Other institutional investors have also recently made changes to their positions in the company. DGS Capital Management LLC increased its holdings in  Microsoft by 19.9% in the 1st quarter. DGS Capital Management LLC now owns 14,342 shares of the software giant’s stock worth $4,422,000 after acquiring an additional 2,383 shares in the last quarter.  IFM Investors Pty Ltd lifted its position in  Microsoft by 20.8% in the first quarter. IFM Investors Pty Ltd now owns 1,138,469 shares of the software giant’s stock valued at $351,001,000 after buying an additional 196,338 shares during the last quarter.  Altus Wealth Group LLC lifted its position in  Microsoft by 1.2% in the first quarter. Altus Wealth Group LLC now owns 12,712 shares of the software giant’s stock valued at $3,919,000 after buying an additional 152 shares during the last quarter.  Powell Investment Advisors LLC lifted its position in  Microsoft by 16.2% in the first quarter. Powell Investment Advisors LLC now owns 2,578 shares of the software giant’s stock valued at $795,000 after buying an additional 359 shares during the last quarter.  Finally, Onyx Bridge Wealth Group LLC lifted its position in shares of  Microsoft by 8.2% during the first quarter. Onyx Bridge Wealth Group LLC now owns 6,782 shares of the software giant’s stock worth $1,921,000 after purchasing an additional 512 shares in the last quarter. 69.20% of the stock is owned by hedge funds and other institutional investors. NASDAQ:MSFT opened at $428.74 on Friday. The stock has a fifty day simple moving average of $408.33 and a 200 day simple moving average of $371.83. The firm has a market capitalization of $3.19 trillion, a price-to-earnings ratio of 38.76, a price-to-earnings-growth ratio of 2.28 and a beta of 0.89. The company has a quick ratio of 1.20, a current ratio of 1.22 and a debt-to-equity ratio of 0.19. Microsoft Co. has a 1-year low of $272.05 and a 1-year high of $430.82. Microsoft (NASDAQ:MSFT – Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 earnings per share (EPS) for the quarter, topping the consensus estimate of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The firm had revenue of $62.02 billion during the quarter, compared to the consensus estimate of $61.14 billion. During the same period in the prior year, the business earned $2.32 EPS. The business’s revenue for the quarter was up 17.6% on a year-over-year basis.  Sell-side analysts forecast that  Microsoft Co. will post 11.63 earnings per share for the current year. The firm also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Shareholders of record on Thursday, May 16th will be issued a $0.75 dividend. This represents a $3.00 dividend on an annualized basis and a yield of 0.70%. The ex-dividend date of this dividend is Wednesday, May 15th. Microsoft’s dividend payout ratio (DPR) is currently 27.12%. Several equities analysts have commented on the stock. Macquarie increased their price target on shares of Microsoft from $430.00 to $450.00 and gave the company an “outperform” rating in a research note on Wednesday, January 31st. China Renaissance started coverage on Microsoft in a report on Tuesday, December 5th. They issued a “buy” rating and a $466.00 price objective for the company. Piper Sandler  reaffirmed an “overweight” rating and set a $455.00 price target on shares of Microsoft in a report on Thursday, January 25th. BNP Paribas raised Microsoft from a “neutral” rating to an “outperform” rating and set a $471.00 price target for the company in a report on Thursday, January 18th. Finally, Wedbush  reissued an “outperform” rating and issued a $450.00 target price on shares of Microsoft in a report on Monday, January 29th. Four analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company. According to MarketBeat, Microsoft  has an average rating of “Moderate Buy” and a consensus price target of $417.37. Check Out Our Latest Research Report on MSFT In other news, EVP Kathleen T. Hogan sold 21,955 shares of Microsoft stock in a transaction that occurred on Monday, March 11th. The stock was sold at an average price of $403.96, for a total transaction of $8,868,941.80. Following the sale, the executive vice president now owns 159,764 shares of the company’s stock, valued at approximately $64,538,265.44. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of the business’s stock in a transaction on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the sale, the insider now owns 11,677,398 shares in the company, valued at $22,770,926.10. The transaction was disclosed in a filing with the SEC, which is available at this hyperlink. Also, EVP Kathleen T. Hogan sold 21,955 shares of the business’s stock in a transaction dated Monday, March 11th. The shares were sold at an average price of $403.96, for a total value of $8,868,941.80. Following the completion of the transaction, the executive vice president now directly owns 159,764 shares of the company’s stock, valued at $64,538,265.44. The disclosure for this sale can be found here. Insiders have sold 1,070,258 shares of company stock valued at $30,690,456 in the last 90 days. 0.03% of the stock is currently owned by insiders. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Microsoft Co. (NASDAQ:MSFT) Shares Sold by Silvia Mccoll Wealth Management LLC Brookstone Capital Management Has $1.08 Million Holdings in Amplify High Income ETF (NYSEARCA:YYY) "
}