{
    "title": "Microsoft is attracting growing criticism for censoring Bing in China",
    "date": "3/20/2024",
    "url": "https://www.hindustantimes.com/business/microsoft-is-attracting-growing-criticism-for-censoring-bing-in-china-101710960509284.html",
    "text": "Subscribe Now! Get features like A second US Senator has attacked Microsoft Corp.’s operations in China, adding to a wave of criticism from human rights groups following a Bloomberg Businessweek investigation about the way it censors its Bing search engine in the country. Senator Marco Rubio, Republican from Florida, said in an emailed statement that there’s “no defending” such compliance from any US company. Bloomberg’s story found that Bing in China is removing an increasing amount of information about human rights, democracy, climate change and other topics to satisfy Beijing. “Every company doing business in China makes concessions to a genocidal, authoritarian regime,” Rubio said. “American companies try to rationalize their choices to US lawmakers and regulators, but there is no defending censorship at the behest of the Chinese Communist Party. It comes down to this: every American company that chooses to work in China gives the Chinese Communist Party another opportunity to achieve its goal of overpowering the United States. It really is that simple.” Last week, Sen. Mark Warner, a Democrat from Virginia, called on Microsoft to consider shutting down its Bing platform in the country. A Microsoft spokesperson reiterated an earlier statement that the Chinese version of Bing is “the least censored search engine” in the country and that leaving the market there “would only serve to cut people off from information they otherwise have through Bing.” “We only censor a result in response to a narrow legal order that we conclude obligates us to do so,” the spokesperson said, “and we regularly push back when we believe an order doesn’t comply with proper interpretation of Chinese rules.” Rubio’s comments reflect bipartisan unease about US corporations’ relationship with the Chinese government amid rising tensions between Washington and Beijing over a variety of political and economic issues. Meanwhile, human rights groups are voicing their own concerns. Maya Wang, interim China director at Human Rights Watch, called on Microsoft to make transparent its content removal policies following Chinese government requests and to consider pushing local partners to better protect human rights. “But if such a review suggests that it cannot reasonably act to avoid being complicit in human rights abuses, then the company should consider withdrawing from China,” like Google did in 2010, Wang said. Google and Yahoo! shut down their China operations thanks in part to government crackdowns on freedom of expression. Microsoft’s Bing platform is now the only Western search engine accessible on China’s heavily restricted version of the internet. To operate in the country, Microsoft has configured Bing to incorporate a blacklist of thousands of websites, words and phrases, including those related to “human rights,” “climate change China”, “democracy,” and “Nobel Peace Prize,” Bloomberg Businessweek reported. Searches for information on alleged abuses of the minority Uyghur population in China’s Xinjiang region return results that exclude news reports about the topic. Users searching for censored content are notified that “results are removed in response to a notice of local law requirement.” Liu Pengyu, a spokesperson for the Chinese Embassy in Washington, said in a statement that China’s internet was “free, open, and orderly.” He added that “foreign-­invested enterprises in China should abide by China’s laws and regulations.” Beijing has previously denied committing abuses in Xinjiang. Omer Kanat, executive director at the Uyghur Human Rights Project, said that it was an “outrage” for Microsoft to be involved in removing information about what he said were atrocities against Uyghurs and other Turkic Muslims. “Bing should be deeply ashamed of helping the government suppress that reporting,” he said, adding that Microsoft should “lift all censorship and donate the profits from Bing’s China operations to the victims of the coverup.”   "
}