{
    "title": "Does Microsoft (NASDAQ:MSFT) Deserve A Spot On Your Watchlist?",
    "date": "3/2/2024",
    "url": "https://simplywall.st/stocks/us/software/nasdaq-msft/microsoft/news/does-microsoft-nasdaqmsft-deserve-a-spot-on-your-watchlist-2",
    "text": "Stock Analysis For beginners, it can seem like a good idea (and an exciting prospect) to buy a company that tells a good story to investors, even if it currently lacks a track record of revenue and profit.  Sometimes these stories can cloud the minds of investors, leading them to invest with their emotions rather than on the merit of good company fundamentals.  A loss-making company is yet to prove itself with profit, and eventually the inflow of external capital may dry up. In contrast to all that, many investors prefer to focus on companies like Microsoft (NASDAQ:MSFT), which has not only revenues, but also profits.  While this doesn't necessarily speak to whether it's undervalued, the profitability of the business is enough to warrant some appreciation - especially if its growing. View our latest analysis for Microsoft The market is a voting machine in the short term, but a weighing machine in the long term, so you'd expect share price to follow earnings per share (EPS) outcomes eventually.  So it makes sense that experienced investors pay close attention to company EPS when undertaking investment research.   Shareholders will be happy to know that Microsoft's EPS has grown 18% each year, compound, over three years.   As a general rule, we'd say that if a company can keep up that sort of growth, shareholders will be beaming. Top-line growth is a great indicator that growth is sustainable, and combined with a high earnings before interest and taxation (EBIT) margin, it's a great way for a company to maintain a competitive advantage in the market.    The music to the ears of Microsoft shareholders is that EBIT margins have grown from 41% to 45% in the last 12 months and revenues are on an upwards trend as well.  That's great to see, on both counts. The chart below shows how the company's bottom and top lines have progressed over time.  Click on the chart to see the exact numbers. While we live in the present moment, there's little doubt that the future matters most in the investment decision process. So why not check this interactive chart depicting future EPS estimates, for Microsoft? Since Microsoft has a market capitalisation of US$3.1t, we wouldn't expect insiders to hold a large percentage of shares.  But we do take comfort from the fact that they are investors in the company.     We note that their impressive stake in the company is worth US$1.1b.   While that is a lot of skin in the game, we note this holding only totals to 0.03% of the business, which is a result of the company being so large.  This should still be a great incentive for management to maximise shareholder value. If you believe that share price follows earnings per share you should definitely be delving further into Microsoft's strong EPS growth.   With EPS growth rates like that, it's hardly surprising to see company higher-ups place confidence in the company through continuing to hold a significant investment.  Fast growth and confident insiders should be enough to warrant further research, so it would seem that it's a good stock to follow.     It's still necessary to consider the ever-present spectre of investment risk.   We've identified 1 warning sign  with Microsoft , and understanding it should be part of your investment process. While opting for stocks without growing earnings and absent insider buying can yield results, for investors valuing these key metrics, here is a carefully selected list of companies in the US with promising growth potential and insider confidence. Please note the insider transactions discussed in this article refer to reportable transactions in the relevant jurisdiction. Find out whether Microsoft is potentially over or undervalued by checking out our comprehensive analysis, which includes fair value estimates, risks and warnings, dividends, insider transactions and financial health. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Microsoft Corporation develops and supports software, services, devices and solutions worldwide. Flawless balance sheet with solid track record. Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. "
}