{
    "title": "Microsoft, Google are 'depending on' AI revenue: Analyst",
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/video/microsoft-google-depending-ai-revenue-172750101.html",
    "text": "As Microsoft (MSFT) and Alphabet (GOOG, GOOGL) prepare to report earnings Tuesday afternoon, Constellation Research Founder and Principal Analyst R \"Ray\" Wang and Neuberger Berman Senior Research Analyst Daniel Flax join Yahoo Finance Live to discuss the importance of AI for both companies' revenues. Wang notes that while Microsoft and Google have approached AI differently, with Microsoft managing to \"build this big partnered ecosystem\" with OpenAI, and Google focusing AI on search which has done well, both companies \"are depending on AI and cloud revenue.\" Flax says for both he's looking for signs of \"continued progress\" on their AI initiatives. He notes the ultimate goal of AI is to drive user efficiency and productivity, which will boost growth. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith AKIKO FUJITA: Two tech behemoths, Alphabet and Microsoft, set to report results today after the bell with the focus largely on AI monetization. We're going to have Ray Wang, Constellation Research Principal Analyst and Founder and Daniel Flax, Neuberger Berman Senior Research Analyst, both joining us. As we look ahead to those results, gentlemen, welcome to both of you. Ray, let me start with you, because I know you own both Microsoft, as well as Alphabet. AI monetization, the integration, revenue coming in, how are you looking at these two companies? And what do you expect? RAY WANG: These two companies approach everything in two different ways. Microsoft has an amazing sales team. And they're actually incorporated OpenAI, which is not something they had built on their own, and managed to build this big partner ecosystem. And they're going to try to show that there's intelligent enterprise and the intelligent cloud. That's where the revenue is coming from on that end. And Google, on the other hand, has been coming at it from a very, very carefully curated way, coming at it from search. And they're actually showing a lot of traction in terms of what's happening in cloud. Both these companies are depending on AI and cloud revenue. AI is the pass-through and pull-through for Microsoft. And also, for Google, when we're talking about cloud and AI, and you cannot separate those two. And they're actually having an impact on revenue. RACHELLE AKUFFO: And Daniel, I want to bring you in here because, obviously, Satya Nadella probably feeling pretty good about everything with that $3 trillion market valuation. But what are you going to want to hear, not just in the earnings report, but also on the earnings call about how they're embedding AI into their existing products and services? DANIEL FLAX: We'll be looking for signs that they're making continued progress with solutions like Copilot, for example, where it remains early. Really, if we step back and really think about what's going on here, it's about helping users make better informed decisions, work faster, work more efficiently. That drives productivity in organizations, and, ultimately, contributes to Microsoft's growth. So we'll look to see how they're navigating what is, of course, a difficult environment. But the key is investing, innovating, and empowering others to be successful on the Microsoft platform. AKIKO FUJITA: Daniel, we have seen Microsoft out ahead on AI. The question is, how much of that value from Copilot has actually been unlocked? We've heard from the company hint that this is just the beginning in terms of user experience. How are you looking at that specifically, Daniel? DANIEL FLAX: It's very early. When we talk to users, there's a lot of potential with Copilot. But it's going to take time, a lot of iterating. All organizations are going to have to adjust their processes, work carefully with Microsoft and its partners to really implement this and drive productivity. There are areas like software development, for example, where you can see faster returns. But it's going to be this ability to help or use AI to help drive revenue, become more efficient on the cost side. It's a journey. But I think it's going to, ultimately, result in Microsoft becoming a more durable business and more valuable to its customers and its broader ecosystem. Related Quotes "
}