{
    "title": "AWS, Microsoft, and Google see massive cloud opportunities in Japan - \nhere's why",
    "date": "1/22/2024",
    "url": "https://www.itpro.com/infrastructure/data-centres/aws-microsoft-and-google-see-massive-cloud-opportunities-in-japan-heres-why",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. AWS’ bid to expand infrastructure in Japan will see it it invest over $15 billion, but it’s not the only hyperscaler that has its eye on big gains in the country AWS has announced it will invest $15.5 billion in Japan to expand its data center portfolio in a move that analysts say is indicative of a wider rush to meet surging demand in the region. With its latest major investment, the cloud computing giant is looking to capitalize on the anticipated explosion in generative AI. AWS made its first major foray in Japan in 2011, unveiling data centers in the Tokyo area.  Since then, the hyperscaler has added to this offering with the opening of an Osaka region in 2021, which it said at the time was due to high demand for data infrastructure in the country. Between 2021 and 2022, AWS invested nearly $10.2 billion in Japan to shore up its infrastructure, signaling it expects considerable demand for data-intensive computing tasks to continue for some time. Google Cloud just waived data transfer fees for customers, and took a big swipe at Microsoft in the processHow the channel can harness cloud opportunities through adaptation“A long time coming” - Microsoft data residency plans will see firm store all cloud customer data in the EU AWS already provides digital infrastructure solutions designed for generative AI applications for a number of large enterprise customers in the region, including the Asahi Group, Marubeni, and Nomura. In October 2023, the firm's flagship generative AI service, dubbed Amazon Bedrock, was also made available in the Asia Pacific (Tokyo) AWS region. Amazon Bedrock provides users with access to a variety of foundation models that customers can privately customize and fine-tune using their internal data in order to create bespoke AI tools tailored to their business needs. Stay up to date with the latest news and analysis from the world of cloud computing with our twice-weekly newsletter Speaking to ITPro, Gartner VP analyst Wataru Katsurashima said growing enterprise demand for data infrastructure will have made this investment a welcome announcement. “AWS is the market leader in Japan's IaaS market, with a wide range of customers ranging from large enterprises to small and medium-sized enterprises. This announcement of this major investment has been generally welcomed by various organizations in Japan.” Katsurashima also noted the cloud giant’s strong relationship with domestic authorities. “AWS has a very good relationship with the Japanese government, and Mr. Hirai, who was the first digital minister of the Japanese government, was present at AWS’s press conference,” Katsurashima said. “Mr. Hirai gave a short presentation and said that Japan's ruling Liberal Democratic Party welcomed this investment.” AWS is not the only member of the big three western hyperscalers looking to capitalize on growing demand in Japan. Microsoft and Google Cloud, both fierce competitors in the global cloud computing space, also appear to view the country as ripe with opportunities. Google opened its first Japanese data center in 2023, with the Inzai data center beginning operations in March as part of a $730 million investment in infrastructure first announced in October 2022. Microsoft, meanwhile, has had the longest cloud infrastructure presence in the country with its first two data centers hosting Windows Azure cloud services coming online in February 2014. Microsoft also recently signed its first power purchase agreement (PPA) with Shizen Energy to provide renewable energy for its data centers in October 2023. The virtual PPA will see Microsoft procure renewable energy from a 25 MW capacity solar farm in Inuyama CIty, Aichi Prefecture.  Become more knowledgeable about AI DOWNLOAD NOW The Asian market appears to be an enticing one for cloud infrastructure vendors with elevated AI adoption rates compared to other global regions. Furthermore, Katsurashima said to the cloud market growth rate in the Asia Pacific and Japan (APJ) region is higher (24.3%) than in the Americas (17.9%) and EMEA (20.3%), making APJ a “key region for continued growth for hyperscale cloud provider”. Japan in particular is one of the fastest growing countries in the APJ region, he added. “The cloud market growth rate in Japan is the 2nd largest in APJ (after China), making Japan an important country for hyperscale cloud providers. Japan's total cloud market is expected to reach more than $37 billion in 2027.” Mark Kidd, executive vice president and general manager of data center management company Iron Mountain, told ITPro more investment should be expected as the hyperscalers try to drastically expand their capacity to capture the soaring demand for AI solutions. “We know that the boom in Generative AI will require large quantities of data center capacity. This could mean that by 2030 the world will require 500-1000% more capacity than we currently have.\" Kidd noted the attention these firms are paying to sustainability concerns as users continue to demand increased capacity and compute speeds. “However, with the ceaseless human demand for better, faster digitalisation, and data volumes expected to grow exponentially year on year for the foreseeable future, data center operators and its customers have an opportunity and responsibility to ensure that 'more data' doesn't mean 'more emissions'.” Solomon Klappholz is a Staff Writer at ITPro. He has experience writing about the technologies that facilitate industrial manufacturing which led to him developing a particular interest in IT regulation, industrial infrastructure applications, and machine learning. A super-supergrid? CEO of UK power network says legacy infrastructure requires major overhaul to meet soaring data center energy demands This next-generation data center project is turning waste heat into algae-based biofuel — could this be the future of green data storage? Why Python is the programming language of choice for AI developers By Steve RangerMarch 26, 2024 By Solomon KlappholzMarch 26, 2024 By George FitzmauriceMarch 26, 2024 By Emma WoollacottMarch 26, 2024 By Solomon KlappholzMarch 25, 2024 By George FitzmauriceMarch 25, 2024 By Daniel ToddMarch 25, 2024 By George FitzmauriceMarch 23, 2024 By Ross KellyMarch 22, 2024 By Solomon KlappholzMarch 22, 2024 By Solomon KlappholzMarch 22, 2024 Posted Posted Posted Posted CloudPro is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}