{
    "title": "Microsoft to add AI chatbot button to computer keyboards",
    "date": "1/4/2024",
    "url": "https://www.cbc.ca/news/business/microsoft-keyboard-chatbot-ai-1.7074215",
    "text": "Computer keyboards are making room for an artificial intelligence chatbot button as Microsoft unveils its first major keyboard redesign in three decades. Starting this month, some new personal computers that run Microsoft's Windows 11 operating system will have a special \"Copilot key\" that launches the software giant's AI chatbot. Getting third-party computer manufacturers to add an AI button to laptops is the latest move by Microsoft to capitalize on its close partnership with ChatGPT-maker OpenAI and make itself a gateway for applications of generative AI technology. Although most people now connect to the internet — and many AI applications — by phone rather than computer, it's a symbolic kickoff to what's expected to be a competitive year as tech companies race to outdo each other in AI applications even as they haven't yet resolved all the ethical and legal ramifications. The New York Times last month sued both OpenAI and Microsoft alleging that tools like ChatGPT and Copilot — formerly known as Bing Chat — are infringing on copyrighted news articles. The keyboard redesign will be Microsoft's biggest change to PC keyboards since it introduced a special Windows key in the 1990s. Microsoft's four-squared logo design has evolved, but the key has been a fixture on Windows-oriented keyboards for about three decades. The newest AI button will be marked by the ribbon-like Copilot logo and be located near the space bar. On some computers it will replace the right \"CTRL\" key, while on others it will replace a menu key. Microsoft is not the only company with customized keys. Apple pioneered the concept in the 1980s with its \"Command\" key marked by a looped square design (it also sported an Apple logo for a time). Google has a search button on its Chromebooks and was first to experiment with an AI-specific key to launch its voice assistant on its now-discontinued Pixelbook. But Microsoft has a much stronger hold on the broader PC market through its licensing agreements with third-party manufacturers like Lenovo, Dell and HP. About 82 per cent of all desktop computers, laptops and workstations run Windows, compared to nine per cent for Apple's in-house operating system and just over six per cent for Google's, according to market research firm IDC. Dell Technologies on Thursday was the first to unveil a Copilot key on its newest XPS laptops. Microsoft hasn't yet said which other computer-makers are installing the Copilot button beyond Microsoft's own in-house line of premium Surface devices. It said some of the companies are expected to unveil their new models at next week's CES gadget show in Las Vegas. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  "
}