{
    "title": "Microsoft beats sales expectations on AI strength, Telcos, Media & Tech - \nTHE BUSINESS TIMES",
    "date": "1/31/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/microsoft-beats-sales-expectations-ai-strength",
    "text": "MICROSOFT beat Wall Street estimates for fiscal second-quarter revenue on Tuesday (Jan 30), as new artificial intelligence (AI) features helped attract customers to its cloud and software services. Microsoft shares were down 2 per cent after-hours. The company, in collaboration with ChatGPT creator OpenAI, has pushed chatbots into its core products such as its Office software and Bing search engine over the past year, attracting business customers eager to try the tech industry’s next breakthrough. Investor buzz over AI helped Microsoft’s shares rise by 57 per cent in 2023. Its cloud-computing business – already the second-biggest behind that of Amazon.com – grew by nearly a third in the most recent quarter. “We’ve moved from talking about AI to applying AI at scale,” CEO Satya Nadella said. “By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector.” Brett Iversen, Microsoft’s vice-president for investor relations, told Reuters that 6 percentage points of the growth rate of cloud-computing platform Azure in the second quarter was attributable to AI. That is double the 3 percentage points in the first quarter. Investors are watching Microsoft’s Azure and Office revenues to see what kind of sales flow comes from the tens of billions of US dollars the company plans to pour into data centres this year to deliver generative AI. Start and end each day with the latest news stories and analyses delivered straight to your inbox. Total revenue grew 18 per cent to US$62 billion in the quarter ended Dec 31, compared with the average analyst estimate of US$61.12 billion, according to LSEG data. Adjusted profit of US$2.93 per share beat an average estimate of US$2.78 per share. Revenue at Microsoft’s Intelligent Cloud unit, which houses the Azure cloud computing platform, grew 20 per cent to US$25.9 billion. Sales of Azure, for which Microsoft does not disclose a dollar figure, grew 30 per cent – its best growth rate in four quarters – compared with a 27.7 per cent consensus estimate from Visible Alpha, and outstripping a 25.7 per cent growth in Google Cloud. “The software giant has delivered a healthy set of results, but not in a strong enough dose to appease the market,” said Sophie Lund-Yates, lead equity analyst at Hargreaves Lansdown. Sales at Microsoft’s More Personal Computing segment, which includes its Windows operating system and gaming business, grew 19 per cent to US$16.9 billion, powered in part by the close of its US$69 billion purchase of Call of Duty maker Activision Blizzard. Analysts had expected US$16.8 billion. Microsoft’s Productivity and Business Process segment, which contains the LinkedIn social network in addition to Office sales, reported that sales rose 13 per cent to US$19.2 billion, just beating estimates. While analysts have said that any meaningful gains from AI may not come before next year, investors have rewarded the company’s push into AI and strategic partnership with Silicon Valley startup OpenAI. In November, Microsoft started selling Copilot, an AI assistant that can summarise an e-mail inbox or craft a slide show, for US$30 per month, which analysts say is a premium price. Early sales of the product showed up in the firm’s commercial sales of Office software, where revenue grew 17 per cent, compared with analyst expectations of commercial Office sales growth of 14.2 per cent, according to data from Visible Alpha. Microsoft does not provide an absolute dollar figure for the sales. Microsoft’s Iversen said on Tuesday that Office’s commercial offerings, where Copilot is being sold, now stand at 400 million paid seats, up from 382 million in April 2023. The company’s capital expenditures grew by US$300 million from the previous quarter to US$11.5 billion, putting the company on track to spend more than US$46 billion this fiscal year. “That’s a sign of the customer demand that we’re seeing,” Iversen said. Microsoft’s stock surge has helped it topple Apple as the world’s most valuable listed company in the past few trading sessions. That was undented by a power struggle within OpenAI that highlighted the software giant’s lack of direct control over its important partner. Microsoft also faces some legal and regulatory challenges. REUTERS BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}