{
    "title": "How long is too long at one job? How short is too short? Microsoft's ex-VP \nof HR explains.",
    "date": "2/26/2024",
    "url": "https://www.businessinsider.in/careers/news/how-long-is-too-long-at-one-job-how-short-is-too-short-microsofts-ex-vp-of-hr-explains-/articleshow/108014576.cms",
    "text": "Liked the article? Share it with your friends... or copy link In my more than 40 years in business, including being the vice president of human resources at Microsoft, I've observed a major shift in how long people stay at a job. When I first started my career in the 1980s, my parents and every career advisor said you needed to stay in a job for a good five years — three years at the bare minimum. Anything less than that, and you were seen as a job-hopper. The first thing hiring managers were taught to look for on a résumé was how long the candidates were in each job and to keep an eagle eye out for any gaps. They wanted to see at least three to five years at each job and certainly not a string of short stints in a row. Job-hopping was seen as a sign of restlessness, immaturity, and an inability to stick through the tough times. Worse, you were seen as disloyal to the company. Today, the pendulum also swings the other way: Younger recruiters look at an employee with 10 years at one company and ask what the problem was. Longer tenures have become their own red flag, and what was once seen as the minimum tenure now puts you in danger of being seen as a relic. So how long is too long, and how short is too short? Like most tough questions, the answer is it depends. It doesn't depend on the clock. What matters in your job tenure isn't how long but rather how much. Not when you did it, but what you did. What a good hiring manager is looking for is whether you've made an impact on the business and whether you're someone who can get things done: Have you participated in or led a major project that made a difference in the business? Have you made a change in the revenue, profitability, or customer satisfaction that moved the metric? They want to see these kinds of accomplishments during your tenure, however long that takes. If you can come into a job, make a difference, and move on in just one year, that's great. If you stay in a job for more than a decade but show this kind of impact time and again throughout your tenure, wonderful. This is why so many people offering résumé advice stress the need to have clear, crisp metrics, numbers, and impact in each job entry. They want you to show that your time, however long, at each role was well spent. Hiring managers don't want to see you flit from job to job having had little effect on the business. Then you do look restless and unable to work hard on problems. They also don't want to see someone who did one great thing just to rest in the afterglow of that for years. You'll look like someone who's unmotivated to help the business advance. It's common knowledge that the fastest way to get bigger pay today is to change jobs — being a new hire somewhere else is far easier than getting promoted internally. That's because companies prioritize new hires over their existing employees. They're faced with needing more talent in a tight job market, and at most companies, the hiring budget is bigger than the promotions-and-raises budget. There is also far more understanding of unique situations from hiring managers today. They understand a short stint in a job that was a terrible fit, and they are not frightened by a gap in employment for child or family care or education. They also understand if you get stuck in a bad role, one with an impossible situation, a company on the downturn, or a manager who makes life hard. As a result, tenures that were once labeled as job-hopping are now standard. Three jobs in five years, once the reddest of red flags, is understandable with just the slightest explanation. So if you're stuck in a bad situation or can't get competitive compensation, the market today says moving is to your advantage. On the other hand, if you are being fairly compensated and the work is still interesting, moving may not be the right choice. Even though it's so much easier than it was in the past, changing jobs still comes at some serious cost. You lose all the internal connections you have worked hard to build. That network helps make your job easier and often more enjoyable. In a new role, you have to reconstruct that from scratch. You also lose all the notoriety you have developed. If you're a valued employee, your reputation precedes you with each new opportunity. You go into each new situation with positive expectations and banked goodwill. Starting a new job, you have none of that. And there are the simpler, more mundane challenges to a new job: wrestling the differences in every process, finding all the right communication channels, and knowing the go-to resources for everyday problem-solving. Sometimes a new environment is invigorating; often, it's just a pain. The combination of a strong network and a solid reputation makes every new task you start in your current role easier. If you ensure that you're constantly working on some new way to have an impact on the business, a long tenure can be very rewarding. So focus your attention not on how long you've been in your job but on what you've done while you've been there. Try to make a difference in each role. Show that your tenure, however long it was, was just the right length. Chris Williams is the former VP of HR at Microsoft. He's an executive-level advisor and consultant with more than 40 years of experience leading and building teams. Advertisement "
}