{
    "title": "EY collaborates with Microsoft to launch climate stress testing solution to \nsupport financial institutions",
    "date": "2/14/2024",
    "url": "https://finance.yahoo.com/news/ey-collaborates-microsoft-launch-climate-140000317.html",
    "text": "Enabling Canadian financial institutions' compliance with OSFI B-15 Climate Risk Management Guideline Enhances capabilities, process and governance at speed and scale to integrate climate risk into the decision-making and portfolio management process Offers a response to growing external pressure from regulators and stakeholders to meet climate risk management regulations and standards Combines data analytics, artificial intelligence, cloud technology and top-tier risk models to further Canada's transition to a low-carbon economy TORONTO, Feb. 14, 2024 /CNW/ - EY today announces the launch of the EY Climate Stress Testing and Scenario Analysis solution, running on Microsoft Azure, which aims to help safeguard Canada's financial sector against the impacts of climate change. \"Our clients recognize the need for reliable systems to effectively manage and report environmental, social, and governance (ESG) data, but finding such systems proves challenging\" explains Mario Schlener, EY Canada Risk Consulting Leader. \"By combining Microsoft cloud technology and EY ESG risk expertise, we're providing a powerful solution, complete with the latest industry frameworks and standards to assist clients through the climate reporting process.\" Disclosure requirements established by the Office of the Superintendent of Financial Institutions (OSFI), along with regulations imposed by other global authorities, are compelling financial institutions to prioritize climate reporting and transparency. Through collaboration with the Canadian financial services sector, this solution not only evaluates the impact of transition risk across various sectors of the economy, but also provides valuable insights to assist financial institutions in strategizing for client engagement initiatives and refining their decarbonization strategies based on scenario results. Consequently, federally regulated financial institutions in Canada can proactively comply with OSFI's B-15 guideline and disclosure deadlines while maturing climate scenario analysis capabilities internally.\"We recognize that operational readiness, resource constraints, and the evolving regulatory landscape pose significant challenges to the seamless execution of climate scenario analysis and stress testing programs,\" adds Katerina Kindyni, EY Canada Financial Institutions Sustainability Leader. \"This solution offers a centralized tool that enables FIs to efficiently identify, measure and monitor risks associated with the transition to a net-zero economy, while seamlessly integrating market intelligence into an organization's infrastructure.\"The solution covers three key areas: Loan portfolio assessment: Helps financial institutions evaluate the transition risk of their loan portfolio by leveraging a spectrum of Network for Greening the Financial System (NGFS) scenarios. It also performs sector-specific modeling of transition risk and estimates the financial impact across the balance sheet, as well as income and cash flow statement of counterparties. Risk assessment: The solution is configured with a climate risk management module that measures the impact on key risk metrics such as Probability of Default (PD), Rating Migrations (RM), and Capital Adequacy Ratio (CAR). It also evaluates the impact of transition risk on the portfolio and provides valuable insights that inform overall decarbonization strategies and mitigation actions. Long-term growth enablement: Addresses an organization's core capacity and capability gaps from a continuous improvement perspective. This allows clients to identify themes, track progress against goals, and identify market opportunities, while minimizing downside risk from carbon intensive sectors. \"Microsoft is dedicated to promoting sustainability in financial services through our cloud, data, and AI solutions that address ESG priorities,\" says Jacqueline O'Flanagan, Microsoft Canada Financial Services Industry Lead. \"By joining forces with EY to address regulatory compliance needs, we're accelerating and magnifying our impact and commitment to advancing innovation in climate technology.\"EY and Microsoft spokespeople available for insights and commentary at Globe Forum 2024EY and Microsoft are attending Globe Forum 2024 to support their goal of uniting leaders and change-makers that are accelerating solutions for a regenerative, resilient, net-zero economy. Microsoft and EY will be participating in a panel discussion on AI for sustainability, speaking to some of the latest ways AI is driving forward sustainability progress and how organizations can responsibly implement AI to create real progress towards ESG goals: Katerina Kindyni, Financial Services Sustainability Lead, EY Canada, Melissa Tamblyn, Microsoft Practice Leader, EY Canada, Pauline Martin, Director, Government Strategy, Worldwide Public Sector, Microsoft – AI for sustainability: accelerating a regenerative future, on February 15 at 8:30 a.m. EDT Please email Dina Elshurafa at dina.elshurafa@ca.ey.com for any questions or to book an interview. About EY EY exists to build a better working world, helping create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today. EY refers to the global organization, and may refer to one or more, of the member firms of Ernst & Young Global Limited, each of which is a separate legal entity. Ernst & Young Global Limited, a UK company limited by guarantee, does not provide services to clients. Information about how EY collects and uses personal data and a description of the rights individuals have under data protection legislation are available via ey.com/privacy. EY member firms do not practice law where prohibited by local laws. For more information about our organization, please visit ey.com. Follow us on Twitter @EYCanada. This news release has been issued by Ernst & Young LLP.  SOURCE EY (Ernst & Young) View original content to download multimedia: http://www.newswire.ca/en/releases/archive/February2024/14/c4730.html "
}