{
    "title": "Jim Cramer Says Do Not Buy These 11 Stocks",
    "date": "2/25/2024",
    "url": "https://ca.finance.yahoo.com/news/jim-cramer-says-not-buy-164951335.html",
    "text": "In this article, we will take a detailed look at the Jim Cramer Says Do Not Buy These 11 Stocks. For a quick overview of such stocks, read our article Jim Cramer Says Do Not Buy These 5 Stocks. Jim Cramer continues to challenge the market bears after NVIDIA Corp (NASDAQ:NVDA) smashed the Wall Street estimates with another stunning quarter, essentially proving that the AI rally that kept giving a boost to stocks in 2023 was not based on a hype after all. Cramer recently said in his program \"Mad Money\" on CNBC that NVIDIA Corp (NASDAQ:NVDA)  did not defy gravity with its latest earnings, rather it defied the \"unwarranted negativity\" and \"cynicism.\" Cramer said the performance of NVIDIA Corp (NASDAQ:NVDA)  stock has proved wrong the idea that stocks are \"hostage\" to an \"all powerful Fed.\" Cramer said that he kept recommending NVIDIA Corp (NASDAQ:NVDA)  shares all along because he knew the company's chips are much faster than its competitors like Intel. Cramer said \"for years\" he believed Nvidia stock would look cheap in \"retrospect\" because its earnings would always be much higher than expected. Cramer lamented: \"I documented this time and time again yet for ages nobody seemed to catch on.\" Jim Cramer wondered why people failed to foresee the potential of NVIDIA Corp (NASDAQ:NVDA) over all these years? Jim Cramer believes part of the reason why nobody was willing to listen to his advice on buying Nvidia stock was the Fed-related fears. Cramer said it makes sense to pay attention to what the Fed is doing but believing that you should not own any stocks if rates are high causes you to miss on the benefits of owning top stocks like NVIDIA Corp (NASDAQ:NVDA) and Microsoft Corp (NASDAQ:MSFT). Cramer said back in the day he made \"millions of bucks\" when the Federal Reserve was raising rates aggressively. Cramer said too many people dwell on unimportant details and \"miss the big picture.\" Cramer also said that the Federal Reserve's actions are mostly relevant for big hedge funds which \"only invest in the averages.\" Jim Cramer said people should notice \"how rarely they (big hedge funds) talk about individual stocks.\" Jim Cramer said people should pay attention to high quality names like Apple Inc (NASDAQ:AAPL) and NVIDIA Corp (NASDAQ:NVDA) because the leadership at these companies have a long-term vision and investors have a high chance of making money if they \"stick\" with them. Cramer said you need \"curiosity\" and you have to \"unshackle yourself from the chains of the macro\" to see the true potential of companies like Nvidia before they become big. Number of Hedge Fund Investors: 2 Jim Cramer has been bearish on Icahn Enterprises LP Common Stock (NASDAQ:IEP) for a long time. Earlier this month he yet again reiterated his bearish case on Icahn Enterprises LP Common Stock (NASDAQ:IEP), whose shares are up about 12% this year through February 25. \"I have no idea what it really owns. I will not recommend stocks on Mad Money when I do not know what they own.” Number of Hedge Fund Investors: 8 Jim Cramer is bearish on Texas-based  space-based cellular broadband network company AST SpaceMobile Inc (NASDAQ:ASTS) and recommends investors not to buy the stock. Cramer recently said that he does not see \"any way shape or form that they’re going to be making money, so I’m going to have to hold off that one.” As of the end of the fourth quarter of 2023, eight hedge funds in Insider Monkey's database had stakes in AST SpaceMobile Inc (NASDAQ:ASTS). The biggest stake in AST SpaceMobile Inc (NASDAQ:ASTS) is owned by Sander Gerber's Hudson Bay Capital Management which owns a $4.5 million stake in AST SpaceMobile Inc (NASDAQ:ASTS). Number of Hedge Fund Investors: 10 Jim Cramer was recently asked whether ecommerce SaaS platform company Bigcommerce Holdings Inc (NASDAQ:BIGC) shares should be bought. Cramer's reply was \"no\" because he thinks \"we got Amazon.\" Cramer has long been a believer of best of breed stocks like Apple Inc (NASDAQ:AAPL), NVIDIA Corp (NASDAQ:NVDA) and Microsoft Corp (NASDAQ:MSFT) and he believes when there's a first-grade, top quality player available in any industry it should be given preference instead of buying other smaller players. Number of Hedge Fund Investors: 15 Jim Cramer has said in the past that there's too much hype around the shares of C3.ai Inc (NYSE:AI). Earlier this month he was yet again asked about the stock. Cramer said he does not see \"any earnings\" there and he cannot recommend a stock \"that has no earnings.\" However, Cramer praised C3.ai Inc (NYSE:AI) CEO Thomas Siebel and said he's a \"bankable guy\" and he's known Siebel for 30 years. To ride the AI wave Cramer recommends buying Apple Inc (NASDAQ:AAPL), NVIDIA Corp (NASDAQ:NVDA) and Microsoft Corp (NASDAQ:MSFT). Bireme Capital stated the following regarding C3.ai, Inc. (NYSE:AI) in its fourth quarter 2023 investor letter: “Our final new short position is in a company called C3.ai, Inc. (NYSE:AI). Originally named “C3 Energy,” C3.ai has changed its name multiple times based on whatever hot new trend they were supposedly capitalizing on. The “energy” theme was about smart grid and cap-and-trade. Then the firm changed its name to “C3 IoT” to attempt to capitalize on the Internet of Things buzz. After that trend fizzled out, the moniker was altered once more, with the company capturing the “AI” ticker in December 2020 – a savvy move if it wants to sell stock to credulous investors, but irrelevant to its business prospects. As Kerrisdale put it, the company is a “minor, cash burning consulting and services business masquerading as a software company.” Number of Hedge Fund Investors: 19 Jim Cramer was recently asked about his thoughts on Mississippi-based fresh eggs producer Cal-Maine Foods Inc (NASDAQ:CALM). Cramer said it's an \"unnecessary stock to own.\" Cramer however said he does like Tyson Foods from a valuation perspective. The dividend-paying company missed fiscal Q2 estimates when it posted earnings in January. GAAP EPS in the quarter came in at $0.35, missing estimates by $0.48. Revenue in the quarter fell 34.7% year over year to $523.23 million, missing estimates by $2.16 million Diamond Hill Small Cap Fund made the following comment about Cal-Maine Foods, Inc. (NASDAQ:CALM) in its Q3 2023 investor letter: “On an individual holdings’ basis, top contributors to return in Q3 included Civitas Resources and Cal-Maine Foods, Inc. (NASDAQ:CALM). Fresh egg producer Cal-Maine Foods has positioned itself well to capitalize on the growing trend toward cage-free and specialty eggs. In May, the US Supreme Court upheld Proposition 12, whereby California can dictate only cage-free eggs be sold in the state — an outcome which will likely open the door for other states to either institute or maintain similar mandates, and which should drive increased long-term demand for Cal-Maine Foods’ eggs.” Number of Hedge Fund Investors: 22 Surgery Partners Inc (NASDAQ:SGRY) is one of the stocks Jim Cramer is recommending investors to stay away from. Last month Cramer said he was taking a \"hard pass\" on the stock. Surgery Partners Inc (NASDAQ:SGRY) shares are however up about 4.4% year to date through February 25. As of the end of the fourth quarter of 2023, 22 hedge funds out of the 933 funds had stakes in Surgery Partners Inc (NASDAQ:SGRY). The most notable stakeholder of Surgery Partners Inc (NASDAQ:SGRY) was Henry Ellenbogen's Durable Capital Partners which owns a $175 million stake in Surgery Partners Inc (NASDAQ:SGRY). Instead of SGRY, Cramer is recommending big stocks like Apple Inc (NASDAQ:AAPL), NVIDIA Corp (NASDAQ:NVDA) and Microsoft Corp (NASDAQ:MSFT). Baron Health Care Fund stated the following regarding Surgery Partners, Inc. (NASDAQ:SGRY) in its fourth quarter 2023 investor letter: “We established a small position in Surgery Partners, Inc. (NASDAQ:SGRY), a leading operator of ambulatory surgery centers in the U.S. Like Stryker, the stock sold off during the quarter due to concerns about the impact of GLP-1s on its business, and we felt the sell-off offered a buying opportunity. The company, which operates primarily majority owned centers in partnership with physicians or hospital systems, is benefiting from a multi-year trend of surgical procedures migrating from inpatient to outpatient settings, facilitated by advances in medicine, payors’ push towards lower cost outpatient facilities and patient/physician preference and convenience. The company’s solid organic revenue growth profile has multiple drivers, including the mix shift to higher acuity, higher cost orthopedic and cardiac procedures, volume growth from additional physician recruitment and expanded medical specialties and better payor contracting. On top of this organic growth, management intends to deploy $200 million annually for acquisitions, leading to mid-teens EBITDA growth. We believe the stock can compound for many years as the company executes on its plan.”  Click to continue reading and see  Jim Cramer Says Do Not Buy These 5 Stocks. Suggested Articles: Jim Cramer’s 11 Latest Stock Picks Jim Cramer Says You Should Stay Away from These 10 Stocks Jim Cramer is Bearish on These 12 Stocks Disclosure. None. Jim Cramer Says Do Not Buy These 11 Stocks was initially published on Insider Monkey. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 This food habit is linked to a specific type of dementia. Handout / ReutersKing Charles avoided referring directly to his or Kate Middleton’s recent health travails in a special Easter message broadcast Thursday, but praised those who “extend the hand of friendship” in times of need and overtly extolled “Christian” virtues.The pre-recorded audio message was played at the traditional Maundy Thursday service at which the monarch hands out symbolic alms called “Maundy money” to individuals who have performed “outstanding Christian service.”The king did no Nordegren has moved on and built a life that focuses on her six kids Trade 24 hours a day on the world's most popular platform. Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Seven reportedly cost $20 million  Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. They soft-launched their relationship at the supermodel's cookbook event in Miami.  The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The \"Late Night\" comedian brutally summed up the former president's media company. Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha IBKR EventTrader - A new, straightforward way to trade CME futures markets Meghan Markle is reportedly anxious about returning to England with Prince Harry in May for the 10-year anniversary of the Invictus Games. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. \"We love to cook and we have the family together,\" Richards tells PEOPLE He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Public disagreements about how to handle immigration resulted in U.S. Rep. Alexandria Ocasio-Cortez reminding Elon Musk he is an immigrant himself. Cooking up a batch of burgers makes for a simple, satisfying meal. But, try adding baking soda to your meat for next-level burgers. Here's why. Leaks from a notoriously sketchy data broker have revealed the locations of hundreds of people who visited convicted pedophile Jeffrey Epstein's Bahaman island before his 2019 arrest and subsequent death behind bars. In an investigation, Wired reports that the firm in question, Near Intelligence, "
}