{
    "title": "Microsoft's Aggressive AI Push is Winning New Customers",
    "date": "2/1/2024",
    "url": "https://aibusiness.com/nlp/microsoft-s-aggressive-ai-push-is-winning-new-customers",
    "text": "Half of Fortune 500 companies using Microsoft’s OpenAI services February 1, 2024 Microsoft reported a 24% increase in cloud revenue with AI “winning new customers,” according to CEO Satya Nadella. He revealed that Azure AI now has  53,000 customers – and over one-third are new to Azure over the past 12 months, during the earnings call for the company’s Q2 fiscal 2024, which runs from October to December 2023. Nadella said customers were flocking to its platform to access large language models from its partners such as Cohere, Meta, and Mistral “without having to manage [the] underlying infrastructure.” Nadella told analysts that Azure OpenAI and then OpenAI’s own APIs on top of Azure were “major drivers” of the company’s AI services tailwind, with over half of Fortune 500 firms using either service. “There is a lot of the small batch training that goes on, whether it's a graph or fine-tuning, and then lots of people who are starting to use models as a service with all the other new models, but it's predominantly Azure OpenAI today.” Another factor the Microsoft CEO touted as a driving force for bringing in new customers was the company’s small language models (SLMs), like Phi. While on par with the company’s larger models, these smaller systems are small enough to run on a consumer device – meaning they do not cost as much to run. Related:Microsoft is Now Worth $3 Trillion, Thanks to Gen AI “Anker, Ashley, AT&T, EY, and Thomson Reuters, for example, are all already exploring how to use our SLM Phi for their applications, and we have great momentum with Azure OpenAI Service,” the Microsoft CEO revealed. “We move from talking about AI to applying AI at scale,” Nadella said. \"By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector.” Microsoft reported revenue of $62 billion, up 18% from a year ago. Net income rose 33% to $21.9 billion ($2.93 per diluted share) in the quarter. The stock fell 2.7% to $397.58 on Jan. 31, the first trading day after the earnings report. BofA Global Research analyst Brad Sills said Microsoft’s outlook for Q3 was lower than Street expectations due to weakness in games. Also, growth in company sign-ups for Office was “disappointing” due to lackluster adoption of Copilot for Microsoft 365. The rest of the business was “solid,” according to his research note that was shared with AI Business. Pricing for Copilot E3 ($36 per user per month add-on to 365 subscription) and E5 ($57 per user per month add-on) plans have been criticized as high when it was revealed last July. Investors also punished Google-parent Alphabet’s stock this week even after posting a 13% increase in revenue to $86.3 billion and 52% increase in net income for the quarter ended Dec. 31, 2023. BofA Global Research analyst Justin Post said search revenue fell short of “high expectations.” Related:Test Drive: Microsoft Copilot Pro is Useful But has Flaws Nadella told analysts the company expects revenue for Copilot for Microsoft 365 to grow “over time.” The company did not disclose the number of users the service has amassed, but Nadella likened the rate of adoption to the early days of the PC. “Just like PCs became standard issue at some point after PCs being adopted by early adopters,” he said of AI offerings like 365 Copilot. The Microsoft CEO expressed optimism, however, contending that the improvement 365 Copilot could bring to work and workflows will change “as people summarize faster, draft regulatory submissions faster, chat to get knowledge from your business.” Also benefiting from Microsoft’s AI push was GitHub, which recorded revenue growth of over 40% year-over-year. The company said that GitHub Copilot, the AI-powered coding assistant tool, helped drive that revenue growth. Nadella told analysts that GitHub Copilot has over 1.3 million paid subscribers, up 30% quarter-over-quarter. Some 50,000 organizations are using the business version of GitHub Copilot, including the likes of Dell, Etsy and Goldman Sachs. The Microsoft CEO revealed plans to launch new AI-powered security features for the service but gave no solid indication as to what those would be. Read more about: Ben Wodecki Jr. Editor Ben Wodecki is the Jr. Editor of AI Business, covering a wide range of AI content. Ben joined the team in March 2021 as assistant editor and was promoted to Jr. Editor. He has written for The New Statesman, Intellectual Property Magazine, and The Telegraph India, among others. He holds an MSc in Digital Journalism from Middlesex University. You May Also Like Mar 6, 2024 Mar 8, 2024 Mar 11, 2024 Mar 11, 2024 Mar 9, 2024 Reshaping Customer Experiences with AI Generative AI Journeys with CDW UK's Chief Technologist Qantm AI CEO on AI Strategy, Governance and Avoiding Pitfalls Deloitte AI Institute Head: 5 Steps to Prepare Enterprises for an AI Future Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG. "
}