{
    "title": "2023 Q4 Earnings Recap of Google, Microsoft, Apple, Amazon and Meta",
    "date": "2/2/2024",
    "url": "https://observer.com/2024/02/earnings-recap-2023-google-microsoft-amazon-meta-apple/",
    "text": "This week, five of the stock market’s “Magnificent Seven”—Alphabet (GOOGL), Microsoft (MSFT), Apple (AAPL), Amazon (AMZN) and Meta (META)—reported financial results for the last quarter of 2023. Big Tech companies closed a year full of bold headlines: Alphabet’s YouTube reached 100 million subscribers; Microsoft launched a suite of A.I. products and finalized its acquisition of gaming behemoth Activision Blizzard; Apple debuted the iPhone 15 and released its Vision Pro VR headset (It’s available in stores today (Feb. 2)); Meta began paying its first ever cash dividend; and Amazon further expanded its e-commerce offerings and upped its game in video streaming. Thank you for signing up!  By clicking submit, you agree to our terms of service and acknowledge we may use your information to send you emails, product samples, and promotions on this website and other properties. You can opt out anytime. Here is a recap of Big Tech’s overall blowout Q4 and what their CEOs said on earnings calls. Google (GOOGL)’s ad revenue for the December quarter included $48 billion from Google Search and approximately $9.2 billion from YouTube. On a call with analysts on Jan. 30, CEO Sundar Pichai touted the rapid growth of YouTube, calling it a “key driver of our subscription revenue.” The tech giant also reported the first time that YouTube had more than 100 million paid subscribers at the end of 2023. The video platform plowed in as much revenue as Google’s cloud business, which also saw strong growth in the fourth quarter. Microsoft drew headlines throughout 2023 for its many initiatives, from deepened collaboration with OpenAI to legal progress in its $68.7 billion acquisition of Activision Blizzard. On the earnings call on Jan. 30, CEO Satya Nadella emphasized the company’s transition from experimenting with A.I. to applying the technology at scale, with A.I. capabilities being integrated across Microsoft’s product offerings, from Microsoft Copilot to Azure AI to GitHub Copilot, the popular A.I. developer tool. “We’re using this A.I. inflection point to redefine our role in business applications,” Nadella told analysts. iPhones continued to dominate Apple’s revenue makeup, accounting for roughly 60 percent of its Q4 sales. The Mac segment generated $7.8 billion in revenue, returning to growth, while iPad revenue fell 25 percent from the previous year to $7 billion. The sharp decline was in part due to Apple’s lack of new iPad models in 2023. Apple’s revenue in the “Wearables, Home, and Accessories” business fell 11 percent year-over-year to $12 billion. This decline was offset by a 11 percent growth in the “Services” unit, which includes Apple TV+, Apple News+ and Apple One bundles. The unit reported $23.1 billion in revenue in the December quarter, a record high. Apple reported earnings a day before its Vision Pro headset arrived in stores in the U.S. On yesterday’s earnings call, CEO Tim Cook called the Vision Pro “the most advanced personal electronics device ever. We can’t wait for people to experience the magic for themselves.” Amazon saw record user acitivites during last quarter’s Black Friday and Cyber Monday shopping events, where customers purchased over 1 billion items on Amazon globally. In the U.S., over 500 million items were ordered from independent sellers, attracting millions of new Prime memberships. Throughout 2023, Amazon provided its fastest-ever global delivery to Prime members, delivering over 7 billion units the same or the next day. “This Q4 was a record-breaking Holiday shopping season and closed out a robust 2023,” CEO Andy Jassy said on the earnings call yesterday. Amazon plans to increase capital expenditures in 2024, particularly in expanding its A.I. efforts. The company just launched Rufus, an A.I.-powered shopping assistant. In addition, its recent move to display ads on Prime Video aims to leverage Amazon’s massive audience for advertising expansion. In the fourth quarter, Amazon generated $14.7 billion in ad revenue, up 26.7 percent from a year ago. Meta tripled profits in the December quarter, in part thanks to aggressive cost-cutting in the previous months. The tech giant also announced its inaugural cash dividend of $0.50 per share during the earnings call yesterday. Meta’s family of social media apps, including Facebook, Instagram, Threads and WhatsApp, had 3.19 billion daily active users at the end of 2023. Threads, Meta’s answer to Elon Musk’s X, had 130 million monthly active users at the end of last year. CFO Susan Li said on the earnings call Meta would no longer report Facebook-specific numbers, suggesting a shift away from its legacy social media platforms. Altogether, revenue from the total family of apps came at $39 billion during the quarter, a 24 percent increase from the previous year. Looking into 2024, CEO Mark Zuckerberg promised significant investments in A.I. for foundational research and product development, expecting capital expenditures to be between $30 billion and $37 billion this year. “Moving forward, a major goal will be building the most popular and most advanced A.I. products and services,” Zuckerberg said on yesterday’s earnings call. We get it: you like to have control of your own internet experience. But advertising revenue helps support our journalism. To read our full stories, please turn off your ad blocker.We'd really appreciate it. Below are steps you can take in order to whitelist Observer.com on your browser: Click the AdBlock button on your browser and select Don't run on pages on this domain. Click the AdBlock Plus button on your browser and select Enabled on this site. Click the AdBlock Plus button on your browser and select Disable on Observer.com. "
}