{
    "title": "AI is part of every conversation in the Indian boardroom: Microsoft India \nHead",
    "date": "2/6/2024",
    "url": "https://www.thehindubusinessline.com/info-tech/ai-is-part-of-every-conversation-in-the-indian-boardroom-microsoft-india-head/article67814705.ece",
    "text": "Get businessline apps on Connect with us TO ENJOY ADDITIONAL BENEFITS Connect With Us Get BusinessLine apps on By Ayushi Kar Comments READ LATER Puneet Chandok, President Microsoft India and South Asia believes that AI is an important thematic conversation for Indian companies to stay relevant and gain significant ROI in the future. Speaking to businessline on the sidelines of the global Microsoft AI tour that made a pit stop in Mumbai, Chandok spoke in length about the early adoption of AI and how Indian firms can leverage its potential. I think clients are looking at two kinds of investments. The first is about real ROI and impact and other conversations are looking at the future. So for the first part, we have the work we are doing from a cloud perspective. For the second part, conversations are going on even if they are thematic level. I’m yet to come across a board or a CEO or a top leadership team that is not curious and excited about what’s the potential of AI for their customers, for their own business and for the employees.  We did a study which said for every dollar being spent on AI, customers are getting 3.8x in dollars back. And there are three sets of use cases or ideas. First is enhancing daily productivity. In the US, we’ve seen half an hour of productivity improvement per user per day. The second is using AI to truly reinvent customer experience. Lastly, AI will have a major role to play in product innovation, creating tech products suited exactly for customers. We don’t comment on country-specific growth but I don’t see any reason for slowdown . We feel excited and encouraged by our most recent (global )earnings results released. There are a couple of highlights that I would punctuate. Microsoft Cloud revenue was $33.7 billion, up 24% Y/Y (up 22% CC). Within that Azure and other cloud services revenue was up 30% Y/Y (up 28% CC), ahead of expectations, driven by strong demand for our consumption-based services. This growth included 6 points of contribution from AI services, demonstrating our continued AI leadership. Office 365 Commercial revenue grew 17% Y/Y (up 16% CC), with seat growth of 9%, driven by small and medium business and frontline worker offerings, as well as growth in revenue per user. We ended the quarter with over 400 million paid Office 365 seats. We’ve seen massive adoption in B2C consumer-focused industries. Myntra, for example, is exploring AI to enhance the shopping experience. Genpact is working with us on AI to drive impact and innovation for their customers. Infosys is also working with us. Even on the enterprise side, we have seen a lot of momentum. We’ve seen a lot of conversations from banks and insurance companies. Lots of conversations about how we reimagine customer experiences to streamline our processes. So across the board, I’m seeing adoption. I would categorize 2023 as the year for conversations and 2024 for adoptions. Innovation in AI is not just coming for Indian enterprises but SMB startup digital businesses are all thinking about AI in a very meaningful way. It is not just about building AI tech like LLM from scratch but rather using AI to enhance productivity like using Microsoft copilot. The best example of this, is I keep going back to what Microsoft is doing with Indian farmers, bringing information about relevant policy at the state and federal levels to them. There is a litany of information out there that they cannot access efficiently. With AI, they can get relevant information in over 20 languages, just by using the simple voice app. We are also training over 3 million government officials on applications of AI and digital literacy. Nearly 60 per cent of global talent for AI is coming from India. I think the general idea is that we have to constantly re skill and upskill and realise ignorance is an illusion when it comes to AI. Comments BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Terms & conditions  |  Institutional Subscriber "
}