{
    "title": "Microsoft confirms the departure of Cortana from Android, iOS and Microsoft \nLauncher",
    "date": "2/23/2024",
    "url": "https://mspoweruser.com/microsoft-confirms-the-departure-of-cortana-from-android-ios-and-microsoft-launcher/",
    "text": "Follow us Share this article Improve this guide 2 min. read Updated on February 23, 2024 updated on \n\nFebruary 23, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Recently there were rumours that Microsoft might be discontinuing Cortana on Android and iOS. Now, a new support article published by Microsoft has sealed the fate of Cortana on mobile devices. Unfortunately, Microsoft will be removing Cortana apps from both Android and iOS as well as the company will be removing Cortana support from Microsoft Launcher. According to the support article, January 31st, 2020 will be the last day for Cortana on mobile devices. Microsoft will also be releasing an update to Microsoft Launcher around 31st January to remove Cortana. However, there’s a chance that Cortana won’t be removed from all the regions. We tried looking for support articles but only found articles on Microsoft Australia, Microsoft Canada and Microsoft UK websites. It could be possible that Cortana will work in other regions including the US after 31st January. To make your personal digital assistant as helpful as possible, we’re integrating Cortana into your Microsoft 365 productivity apps. As part of this evolution, on January 31st, 2020, we’re ending support for the Cortana app on Android and iOS in your market. At that point, the Cortana content you created–such as reminders and lists–will no longer function in the Cortana mobile app or Microsoft Launcher, but can still be accessed through Cortana on Windows. Also, Cortana reminders, lists, and tasks are automatically synced to the Microsoft To Do app, which you can download to your phone for free. After January 31st, 2020, the Cortana mobile app on your phone will no longer be supported and there will be an updated version of Microsoft Launcher with Cortana removed. – Microsoft Microsoft noted that the changes are being made because Cortana is integrated into Microsoft 365 productivity apps. While we aren’t sure at this point if Microsoft plans to add Cortana as a feature to all the Microsoft 365 apps, it will be interesting to see Microsoft’s approach towards Cortana in the future. And if you don’t want it, here’s how to uninstall Cortana. Update: According to The Verge who got a confirmation from Microsoft, Cortana will not be available in UK, Australia, Germany, Mexico, China, Spain, Canada, and India starting from January 31st. More about the topics: Cortana, Cortana for Android, Cortana for iOS, microsoft Anmol Mehrotra Android and Windows News Reporter Anmol covers Android and Windows news. He's a tech writer with over a decade of experience. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Anmol Mehrotra Android and Windows News Reporter Anmol covers Android and Windows news. He's a tech writer with over a decade of experience. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}