{
    "title": "Xbox’s future will be revealed this week through ‘special edition’ podcast: \nWhat to expect?",
    "date": "2/13/2024",
    "url": "https://www.digit.in/news/gaming/xboxs-future-will-be-revealed-this-week-through-special-edition-podcast-what-to-expect.html",
    "text": "For quite some time now, we have been hearing a lot that Microsoft is planning to bring Xbox exclusive games to PlayStation 5 (PS5) and Nintendo Switch consoles. Now, Microsoft is preparing to present its vision for the future of Xbox later this week. Last week, Microsoft Gaming CEO Phil Spencer announced on X (formerly known as Twitter) that the company is planning a “business update event” to share its “vision for the future of Xbox.” Also read: Microsoft Xbox event scheduled for next week: Will Xbox exclusive games expand to PS5? Please join us for a special edition of the Official Xbox Podcast.Hear from Phil Spencer, Sarah Bond and Matt Booty as they share updates on the Xbox business. pic.twitter.com/TxwWJVUbgx Now, the company has announced that it will host a “special edition” Xbox podcast on February 15th at 12PM PT/ 3PM ET/ 8PM GMT. If we convert this time to Indian Standard Time (IST), then the podcast is scheduled for February 16th at 1:30AM. Also read: Xbox now allows game streaming to Discord, VRR update and more cool features The company revealed that Phil Spencer, Xbox president Sarah Bond, and head of Xbox studios Matt Booty will all “share updates on the Xbox business” during the podcast. Also, the announcement poster reveals that you will be able to listen to the podcast on YouTube or “wherever you listen to your podcasts.” There is speculation that Microsoft will disclose its intentions to extend the availability of Hi-Fi Rush and various other Xbox exclusive titles to PS5 and Nintendo Switch consoles during the podcast. According to reports, Microsoft had initially planned this business update for later this month. However, with these speculations swirling, the tech giant might find itself compelled to directly confront the rumours and elaborate on its new Xbox strategy, particularly in light of its recent $68.7 billion acquisition of Activision Blizzard. As anticipation builds for Microsoft’s upcoming Xbox podcast, fans eagerly await confirmation on whether Xbox exclusives will indeed expand to rival platforms like the PS5. Stay tuned for updates from the podcast. Tags: MicrosoftMicrosoft xboxMicrosoft xbox newsXboxXbox eventXbox event datexbox games on ps5Xbox games on ps5 newsXbox newsXbox podcastXbox podcast dateXbox podcast news Tech news writer by day, BGMI player by night. Combining my passion for tech and gaming to bring you the latest in both worlds. View Full Profile Digit.in is one of the most trusted and popular technology media portals in India. At Digit it is our goal to help Indian technology users decide what tech products they should buy. We do this by testing thousands of products in our two test labs in Noida and Mumbai, to arrive at indepth and unbiased buying advice for millions of Indians. We are about leadership – the 9.9 kind Building a leading media company out of India. And, grooming new leaders for this promising industry. "
}