{
    "title": null,
    "date": "2/27/2024",
    "url": "https://thetechportal.com/2024/02/27/microsoft-mistral-ai-france-partnership/",
    "text": "Microsoft is doubling down on its AI lead, by striking a deal with Mistral AI, the France-based rival for OpenAI, which has been backed via billions of dollars by Microsoft and put the Redmond giant in the AI lead. The partnership with Mistral comes at a time when there is already heightened global scrutiny surrounding Microsoft’s existing investments and control over OpenAI. This partnership has initiated antitrust investigations in Europe and the UK due to concerns about potential market dominance, according to reports. The Mistral AI deal could thus be a direct implication of the same. No financial commitments have been announced as a part of the deal, yet. “Today, we are announcing a multi-year partnership between Microsoft and Mistral AI, a recognized leader in generative artificial intelligence. Both companies are fueled by a steadfast dedication to innovation and practical applications, bridging the gap between pioneering research and real-world solutions,” Eric Boyd, Corporate Vice President, Azure AI Platform, Microsoft, noted in a blog post on the matter. Under the terms of the partnership, the former’s AI models will be made available to customers of Microsoft’s Azure cloud. Furthermore, Microsoft will also make a minor investment in Mistral AI, further solidifying their partnership. As of now, we know that Mistral AI will be able to leverage the Azure AI supercomputing infrastructure, while its premium models will be made available to customers through the Models as a Service (MaaS) in the Azure AI Studio and Azure Machine Learning model catalog. This partnership comes alongside the introduction of Mistral’s latest LLM, aptly named “Mistral Large.” This model, according to the company, boasts “unique reasoning capabilities” and boasts fluency in five languages: French, English, German, Spanish, and Italian. This multilingual capability stands in stark contrast to OpenAI’s recently unveiled GPT-4, which remains a “black box” with its data and code inaccessible to external parties. Additionally, unlike some of Mistral’s previous models, Mistral Large is not open-source, and has a 32K tokens context window to provide “precise information recall from large documents.” Traditionally, Mistral has embraced an open-source philosophy, making the technical details of its models publicly available. This contrasts with the closed-source approach of organizations like OpenAI, whose models are shrouded in secrecy. However, with the arrival of Mistral Large, the company is venturing into the realm of commercial models, a move likely facilitated by the partnership with Microsoft. “Mistral Large is our new cutting-edge text generation model. It reaches top-tier reasoning capabilities. It can be used for complex multilingual reasoning tasks, including text understanding, transformation, and code generation. Mistral Large achieves strong results on commonly used benchmarks, making it the world’s second-ranked model generally available through an API (next to GPT-4),” Mistral AI noted in an official release. Alongside Mistral Large, the company also unveiled “Le Chat,” a multilingual conversational assistant built upon Mistral’s various models. The ChatGPT-esque Le Chat aims to provide a user-friendly experience for individuals seeking to explore the capabilities of Mistral’s technology through a fun and educational interface. "
}