{
    "title": "The two most important factors seen in tech earnings",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/video/two-most-important-factors-seen-164051592.html",
    "text": "Six of the tech stocks comprising the Magnificent Seven — Alphabet (GOOG, GOOGL), Amazon (AMZN), Apple (AAPL), Meta Platforms (META), Microsoft (MSFT), Tesla (TSLA) — have reported earnings this season. What are tech investors learning from these results? Yahoo Finance Tech Editor Dan Howley breaks down the two biggest lessons expressed in mega-cap tech company performances: AI and the importance of fundamentals. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. [AUDIO LOGO] BRAD SMITH: This far in the earnings season, six of the Magnificent Seven tech companies have reported their quarterly results, Apple, Alphabet, Amazon, Meta, Microsoft, and Tesla. That leaves one. AI chip giant NVIDIA won't report results until February 21, but we gained plenty of insight into the tech sector this earnings season. Yahoo Finance's tech editor Dan Howley is here with us to tell the two biggest lessons we've learned so far. Hey, Dan. DAN HOWLEY: Yeah, so let's start off with lesson 1, AI is still King. That's really one of the go-to that we've been seeing. And just to run some things down, with AI, Microsoft reported that they had seen a 6% revenue boost for its Azure Cloud business through AI. That's up from 3% in the prior quarter and 1% in the quarter prior to that. We also saw a lot of talk from Meta about AI-- how they're continuing to invest there, as well as from Alphabet, which says that they're investing more and more into their search business as far as AI goes. Amazon they launched their new chat bot for shoppers. And then Intel and AMD were talking a lot about AI. Apple getting a little bit in there as well. Tim Cook telling us that we've got some things that we are incredibly excited about that will be showing later this year as far as AI goes. So kind of a Black box for Apple so far, but that's a big deal for them to come forward and say that. And then the second lesson outside of the AI thing is that fundamentals still matter. There's no way to replace those. And so when it comes to the likes of Alphabet, yes, they talked up AI a lot, but their stock took a major hit because their fundamentals weren't sound. Their ad business suffered. They didn't meet expectations for that particular business segment, and so they fell off. The other-- Apple. Yes, Tim Cook may have been talking a lot about AI, but iPhone sales in China, or sales in general in China missed expectations-- were actually down year-over-year. And so because of that the stock got stung very badly. And so those are really the big lessons we're seeing so far is that AI is still going to continue to dominate the conversation, but it's not going to take away from the fundamentals that matter the most. SEANA SMITH: Dan, there's such little room for any sort of disappointment in these results. And we saw that reflected in some of the movement in share prices after these results were released. Who would you say is the big winner so far? Would it have to be Meta? DAN HOWLEY: It's got to be Meta. I mean, you know, they had the dividend. They had their buyback boosted. I mean, they beat expectations. Their ad business is doing incredibly well, especially when you look at what's going on with Alphabet. And then, I mean, you know, today with Snap. I mean, they're just miles and miles ahead. They managed to get out from under that Apple issue that they had seen that app tracking transparency, which really just cut them off at the knees for a while as far as ads go. Then there was also, obviously, the interest rates and inflation that were hitting them there. So that really, I mean, they've done a great job from there. They also did lay off 20,000 plus people. So I mean, column A, column B, It's going to save them money, but also that's 20,000 people without jobs. And so they did do well there. Besides that Microsoft. SEANA SMITH: Yeah, Microsoft certainly did impress investors there. All right, Dan, thanks so much. We still got Nvidia in a couple of weeks. Related Quotes "
}