{
    "title": "Microsoft to inject €3B into Germany AI, cloud",
    "date": "2/15/2024",
    "url": "https://www.mobileworldlive.com/microsoft/microsoft-to-inject-e3b-in-germany-ai-cloud/",
    "text": "Microsoft outlined plans to fork out €3.2 billion to expand its AI and cloud infrastructure in Germany over the next two years, marking the company’s biggest investment in the country to date. The technology giant explained the sum will finance the expansion of its cloud region in Frankfurt and the development of a new infrastructure in North Rhine-Westphalia, moves made to meet growing demand for AI and cloud solutions. Part of the investment will also be used to train more than 1.2 million people by end-2025, covering new AI models and applications offered by Microsoft and other companies deploying its Azure platform. It plans to launch training programmes with ecosystem partners focused on AI related skills, technical capabilities, support transformation in business and promote safe and responsible development. Recently, the company announced similar training initiatives across small cities in India to promote job creation around the technology. Microsoft noted the cash injection is the largest “in its 40-year history” of operating in Germany, and its vice chair and president Brad Smith (pictured, left) identified an increasing demand for AI services in key sectors including manufacturing, financial services, automotive and life sciences. “Because these industries are fundamentally changing due to economic change, it is important to equip companies in Germany with world-leading technology,” Smith said. Chancellor of Germany Olaf Scholz (pictured, right) added the investment strengthens the nation’s AI ecosystem. You'll gain exclusive access to breaking news, expert analysis,\nand in-depth features delivered right to your inbox. By subscribing to our newsletter, you'll gain exclusive\naccess to breaking news, expert analysis, and in-depth\nfeatures delivered right to your inbox. © 2024 GSM Association. The GSMA, Mobile World Live,\nMWC Barcelona, MWC Las Vegas, MWC Kigali & MWC Shanghai terms and logos\nare trademarks of the GSM Association. "
}