{
    "title": "Intel unveils Microsoft partnership, new foundry system for AI (NASDAQ:INTC)",
    "date": "2/21/2024",
    "url": "https://seekingalpha.com/news/4069698-intel-unveils-microsoft-partnership-new-foundry-system-for-ai",
    "text": "Leon Neal Intel (NASDAQ:INTC) made several announcements at its foundry event on Wednesday, including that Microsoft (MSFT) will use the semiconductor giant to manufacture a chip design based on its 18A process. Microsoft Chairman and Chief Executive Satya Nadella said that AI will \"fundamentally transform\" productivity for every organization and the entire tech industry and it needs reliable access to high-quality processors. “That’s why we are so excited to work with Intel Foundry, and why we have chosen a chip design that we plan to produce on Intel 18A process,” Nadella said in a statement. Intel shares fell 1.7% in mid-day trading. Intel's foundry business, which generated $291M in revenue last quarter, has had design wins for Intel 18A, Intel 16 and Intel 3 and \"significant customer volume\" for its Advanced System Assembly and Test, or ASAT, capabilities, including advanced packaging. The lifetime deal value for wafer and advanced packaging is more than $15B, up from a previous view of $10B, Intel said. Intel also unveiled a new foundry system for artificial intelligence. “We are offering a world-class foundry, delivered from a resilient, more sustainable and secure source of supply, and complemented by unparalleled systems of chips capabilities,” Stuart Pann, senior vice president of Intel Foundry at Intel, said. “Bringing these strengths together gives customers everything they need to engineer and deliver solutions for the most demanding applications.” Intel is focusing on having a more resilient supply chain with a redoubling of its efforts to have 100% renewable electricity worldwide by 2030. The company also said it wants to have net-zero Scope 1 and Scope 2 GHG emissions by 2040 and net-zero upstream Scope 3 emissions by 2050. The foundry roadmap offers access to Intel's 14A process technology and its ASAT capabilities for customers, Intel added. "
}