{
    "title": "Microsoft Copilot is coming to OneDrive in April",
    "date": "2/29/2024",
    "url": "https://mspoweruser.com/copilot-onedrive-april/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on February 29, 2024 published on \n\nFebruary 29, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft first teased a OneDrive experience powered with the AI capabilities of Copilot back in October of last year, and now there’s a date for when it will be coming to everyone. The company today detailed that that experience will finally be available later in April for those with Microsoft 365 work and school accounts and Copilot for Microsoft 365 license. As you expect, the goal is to help make interacting with files easier. If you missed it, there are a few things Copilot in OneDrive can do for you. Available in the file viewer in Teams, OneDrive on the Web, and SharePoint, you can use the feature to ask questions and answers about a specific file, or even summarize it without having to read through all of it. You can do this in natural language and prompts, too. It provides insights about files, assistance with finding old files while you might have been on vacation, and even creating outlines, tables, and FAQs. Next month, in March, Microsoft says you’ll also be able to get Copilot-generated summaries in document-sharing notifications, too. Much like most AI assistants these days, Copilot in OneDrive is pretty super-powered. You can use it to improve a document for viewing. Just as an example, Microsoft says you can ask a question like “What suggestions do you have to improve the deck /new-sales-process.ppt.” Copilot in OneDrive works with all kinds of files stored in OneDrive, including the traditional office document format, PDFs, Web files, and even OpenDocument formats. It works in different languages, too, and isn’t just limited to English. You’ll find it in French, German, Italian, Japanese, and even simplified Chinese. More languages are coming in March and April, including Arabic and Korean. These features are only for those who are using Microsoft 365 work or school accounts. They will not be coming to consumers who are using personal Microsoft accounts. We talked a little more about the differences in Copilot for work and school in a separate guide. More about the topics: copilot, microsoft, Microsoft 365, onedrive Arif Bacchus Arif has over seven years of experience in the technology journalism field covering Microsoft, Google, Apple, and other tech giants. Arif is also known for his laptop reviews, how-to guides, and other evergreen content. His work was seen at XDA, Digital Trends, and OnMSFT. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Arif Bacchus Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}