{
    "title": "Will Nvidia Be Worth More Than Microsoft by 2025?",
    "date": "2/24/2024",
    "url": "https://www.fool.com/investing/2024/02/24/will-nvidia-be-worth-more-than-microsoft-by-2025/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia's (NVDA 0.12%) stock surged 16% to a new all-time high on Feb. 22 after the chipmaker's latest earnings report crushed Wall Street's expectations. For the fourth quarter of fiscal 2024, which ended on Jan. 28, its revenue surged 265% year over year to $22.1 billion and surpassed analysts' expectations by $1.6 billion. Its adjusted earnings soared 486% to $5.16 per share and cleared the consensus forecast by $0.52. For the full year, Nvidia's revenue jumped 126% to $60.9 billion as its adjusted EPS climbed 288%. That represented a stunning acceleration from its flat revenue growth and 25% decline in adjusted earnings in fiscal 2023. Image source: Getty Images. Nvidia's 280% rally over the past 12 months has propelled its market cap to $1.96 trillion, making it the world's third-most-valuable company after Microsoft (MSFT -0.17%), which is worth $3.06 trillion, and Apple, which is worth $2.85 trillion. So does Nvidia have a realistic shot at surpassing Apple and stealing the crown from Microsoft by 2025? Nvidia's recent growth spurt was entirely driven by the explosive growth of the artificial intelligence (AI) market. Nvidia's top-tier data center GPUs are used to process complex AI tasks more efficiently than stand-alone CPUs, and companies scrambled to purchase those chips to keep pace with the growth of generative AI platforms like OpenAI's ChatGPT. All of the world's leading AI-oriented companies -- including OpenAI, its top backer Microsoft, Amazon, Alphabet's Google, and Meta Platforms -- use Nvidia's GPUs. Its GPU sales to China were throttled by export curbs over the past year, but the market's demand is still outstripping its supply by a significant margin. Nvidia generated 78% of its revenue from its data center chips in fiscal 2024, compared to just 56% of its revenue in fiscal 2023. That rapid expansion curbed its dependence on gaming GPUs, which previously generated most of its revenue but were highly exposed to the PC market's post-pandemic slowdown and the volatile crypto mining market. The bulls believe Nvidia will continue to dominate the AI market, even as its rival AMD enters the ring with its cheaper data center GPUs, and cloud giants like Meta and Google start developing their own first-party AI GPUs. Based on those rosy expectations, analysts expect Nvidia's revenue to grow at a compound annual growth rate (CAGR) of 35% from fiscal 2024 to fiscal 2027 as its EPS rises at a CAGR of 37%. Nvidia's stock isn't cheap at 35 times forward earnings and 18 times this year's sales, but it seems reasonably valued relative to its growth rates. If it maintains those valuations, meets analysts' expectations, and still trades at 35 times forward earnings by the beginning of fiscal 2027 (which starts in Jan. 2026), its stock might be worth $1,085 per share with a market cap of about $2.7 trillion by late 2025. That would represent a near-40% gain from its current levels. We should take those hazy long-term estimates with a grain of salt, since Nvidia repeatedly beat analysts' expectations over the past year, but they imply the chipmaker probably won't be more valuable than Microsoft by 2025. Microsoft has also tapped into the AI market's explosive growth via its big investment in OpenAI and the integration of its generative AI tools into its own cloud-based services. Analysts expect its revenue and earnings to rise at a CAGR of 15% and 17%, respectively, from fiscal 2023 (which ended last June) to fiscal 2026. Like Nvidia, Microsoft also trades at 35 times forward earnings. If it maintains that premium multiple and matches Wall Street's expectations, it could trade at about $550 with a market cap of $4.1 trillion by early 2026. Simply put, Nvidia won't catch up to Microsoft unless the bulls abruptly bid its valuations to unsustainable levels or Microsoft drops the ball and gets revalued as a slower-growth company. Instead of wondering if either of those scenarios will happen, investors should focus on Nvidia's growth potential instead of its market capitalization. It's still selling picks and shovels for the AI gold rush, and it could still have plenty of room to run before longer-term headwinds like AMD's GPUs or first-party chips meaningfully affect its growth. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon, Apple, and Meta Platforms. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}