{
    "title": "Unusual Options Activity in Microsoft and Meta Platforms Highlights Their \nLong Term Value",
    "date": "3/13/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/XCAN/pressreleases/24763505/unusual-options-activity-in-microsoft-and-meta-platforms-highlights-their-long-term-value/",
    "text": "Today Barchart reported institutional investors initiated long-term call options (2 and 3-year expiration periods) in both Microsoft (MSFT) and Meta Platforms (META) stocks. This activity highlights the underlying value of these stocks and the upside potential. This can be seen in Barchart's Unusual Stock Options Activity Report for Wednesday, March 13. It shows that investors traded over 7,000 call options for the expiration period ending 12/18/26 (i.e., 1,010 days from now or 2.76 years away). The strike price was deep in the money (ITM) at $350 per share, or $64.89 below today's price of $414.89. This is why the call options trades were likely initiated by a long-term bullish investor in MSFT stock. Similarly, an institutional investor bought over 5,000 call option contracts for META expiring in 827 days on June 18, 2026, or 2.3 years from now. Again, the strike price was deep in the money (i.e., below today's spot price): $380 per share, which is $113.86 below today's spot price of $493.86. One reason is that the premium paid is not that high. For example, the MSFT calls traded at $126.13 per call, but the strike price is already $64.89 in the money (ITM). In other words, after adding $126.13 to the strike price of $350.00, the investor's cost to buy 7,000 calls is $476.13. That is just 14.9% over today's price of $414.41 per share. So, this means that the stock only has to rise 15% sometime in the next 2.76 years before the investor starts to have a profit. That seems highly likely. Here is why. In a Feb. 20 Barchart article I wrote that Microsoft stock is undervalued: “Microsoft Stock Looks Cheap to Investors, Including Shorting OTM Puts for Income.” The target price for MSFT stock, based on Microsoft's free cash flow (FCF), was $500.55 per share, or 25% higher. That is still well above the all-in cost for these call option investors with their $476.13 breakeven price. It most likely won't take 2.76 years for that to happen. Similarly, the breakeven cost for the META call options buyers is well below our price targets. For example, adding the $190.77 call option price to the $380 strike price gives an all-in cost of $570.77. That is 15.3% over today's spot price of $495.22 per share. But META stock is likely worth much more. For example, I wrote in a March 3 Barchart article that META stock was worth $602.76 per share. That is higher than the $570.77 all-in cost of the call options buyers here. My thesis was that the company's huge FCF margins would propel its valuation significantly higher over the next 12 months. In this case, the investor has over 2.3 years to see this happen. So, it makes sense for these institutional investors to pay the extra 15% for the call options. All options trade for more than their intrinsic value until they expire. Their premium includes an extrinsic value element. This makes it profitable to buy in-the-money calls vs. the underlying stock. Once these two stocks reach their breakeven all-in cost per share, the call option buyers will make good profits. For example, once MSFT reaches $500 per share, the $350 strike price calls will trade for more than $150 per share. They would likely trade for $175 or more, depending on how much expiry time is left. Therefore, the investor, whose cost is $126.13 for the calls will already have a 39.5% profit (i.e., $175/$126.13-1). That might happen easily within the next year. If so, the long-term investor in these calls will make a superior return than if they purchased MSFT common stock. This is because the rise in the stock price from $414.44 to $500 would only be 20.6%, vs. almost twice that using deep-in-the-money calls (i.e., +39.5%). The bottom line is that these deep-in-the-money call option trades look worth copying for long-term investors. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}