{
    "title": "Apple dismisses Microsoft monopoly comparisons",
    "date": "3/28/2024",
    "url": "https://techcrunch.com/2024/03/28/apple-dismisses-microsoft-monopoly-comparisons/",
    "text": "A week after finding itself at the business end of a landmark lawsuit from the United States Department of Justice, Apple is staunchly denying any parallels between itself and Microsoft in the 1990s. It’s a comparison into which the U.S. Attorney General Merrick Garland leaned heavily in last week’s filing. While portions of the United States v. Microsoft Corp. were partially overturned, the Windows maker was ultimately required to modify certain business practices deemed monopolistic by the government. Garland and the 16 state attorneys general that participated in the Apple suit are no doubt seeking a similar outcome to curtail practices it believes amount to an unfair advantage for the $2.65 trillion company. “In 1998, Apple co-founder Steve Jobs criticized Microsoft’s monopoly and ‘dirty tactics’ in operating systems to target Apple, which prompted the company ‘to go to the Department of Justice’ in hopes of getting Microsoft ‘to play fair,’” the suit notes, heavily implying hypocrisy on Apple’s part. “But even at that time, Apple did not face the same types of restrictions it imposes on third parties today; Apple users could use their iPod with a Windows computer, and Microsoft did not charge Apple a 30% fee for each song downloaded from Apple’s iTunes store. Similarly, when Apple brought the iPhone to market in 2007, it benefited from competition among component makers and wireless carriers.” For its part, Apple cites global iPhone numbers that are nowhere approaching the 90+% market share Windows enjoyed prior to the turn of the millennium. Lawsuits like this are a rare opportunity to see a large corporation bragging about how few devices they’ve sold relative to the broader market. Indeed, with numbers hovering around 20% globally, it’s difficult to make the case that the company is dominating the competition the way Microsoft did a quarter-century ago. It’s true that the iPhone performs especially well in the domestic market, where it faces less direct competition from many of the low-cost handsets that dominate India and China (the number one and two markets, respectively). Apple suggests, however, that the DOJ’s claim that its “share of the entire U.S. smartphone market exceeds 65%” is misleading, as it refers to revenue rather than units sold. Of the latter, the company believes it commands less than half of its home market. The distinction between these figures comes down to the price per unit. It’s here the DOJ suggests that Apple commands 70% of the “performance” smartphone market. Certainly, it’s true that Apple’s devices largely fall into the premium category, of which the company controls a large swath here in the states. The DOJ will likely have a difficult time proving that this — in and of itself — constitutes a monopoly. This is why much of the 88-page complaint focuses on aspects like Apple’s tight App Store control, the Watch’s inability to interface with Android devices and — of course — the dreaded green bubbles. Taken as a whole, the attorneys general who coauthored the suit suggest that this evidence proves the company is using its market position to coerce third parties and generally make life more difficult for Android developers. Among the more interesting aspects of the suit is the claim that such actions led to the demise of Amazon, HTC, LG and Microsoft’s own attempts to compete in the space. “Many prominent, well-financed companies have tried and failed to successfully enter the relevant markets because of these entry barriers,” the suit notes. “Past failures include Amazon (which released its Fire mobile phone in 2014 but could not profitably sustain its business and exited the following year); Microsoft (which discontinued its mobile business in 2017); HTC (which exited the market by selling its smartphone business to Google in September 2017); and LG (which exited the smartphone market in 2021). Today, only Samsung and Google remain as meaningful competitors in the U.S. performance smartphone market. Barriers are so high that Google is a distant third to Apple and Samsung despite the fact that Google controls development of the Android operating system.” Apple is effectively laughing at the suggestion that such market failures were the fault of anyone but the companies behind them. The competitors the DOJ consulted while putting together the case likely have differing opinions on how much of a direct role the iPhone maker played in their inability to capture meaningful market share (and each of the above instances are dramatically different from one another), but in the case of the Fire Phone, at least, Amazon should be pointing the finger squarely at itself. As for why companies like Huawei don’t present a challenge to Apple on its home turf, the U.S. government should take a good, long look in the mirror. The smartwatch example is an interesting one. Even Cupertino’s highly paid legal team would struggle to make the case that Apple Watch owners aren’t hamstrung by its iOS exclusivity. For its part, however, the company suggests that technical limitations are the reason for this. Apple says it spent three years attempting to create WatchOS/Android compatibility, only to give up, citing security and privacy concerns. Similarly, while Apple points to the recent announcement that it will support RCS messages on iPhone, the company insists that the continued presence of stigmatized green bubbles are necessary to differentiate encryption and compatibility with certain Messages features. The complaint cites internal emails from Apple executives suggesting that removing green bubbles would be bad for business. Ultimately, Apple believes that the lawsuit seeks to effectively turn iOS into Android. The company points to the 2008 Supreme Court case, Pacific Bell Co. v. LinkLine Communications. The court ruled unanimously in Pac Bell’s favor, stating that the telecom company didn’t violate antitrust rules and is able to determine the companies with which it chooses to work. When the time comes for Apple to give its arguments, the company will likely argue that it’s not Apple’s job to prop up competitors. “If successful, [the lawsuit] would hinder our ability to create the kind of technology people expect from Apple—where hardware, software, and services intersect,” it noted in a statement issued shortly after last week’s filing. “It would also set a dangerous precedent, empowering government to take a heavy hand in designing people’s technology. We believe this lawsuit is wrong on the facts and the law, and we will vigorously defend against it.” For more on Apple’s antitrust lawsuit, check here:   "
}