{
    "title": "Top Microsoft Shareholders",
    "date": "3/23/2024",
    "url": "https://www.investopedia.com/articles/investing/122215/top-4-microsoft-shareholders.asp",
    "text": " Microsoft Corp. (MSFT) is one of the world's largest companies by market value and among the tech industry's greatest success stories. Founded in 1975, its Windows software product turned it into a multi-billion dollar corporation within the span of a few years. Microsoft's business encompasses personal computing devices, cloud systems and services, software, and related products sold to both individual consumers and businesses. The top shareholders of Microsoft are Satya Nadella, Bradford L. Smith, Kathleen Hogan, Vanguard Group Inc., BlackRock Inc. (BLK), and State Street Corp. Microsoft's 12-month trailing revenue and net income are $227.58 billion and $82.54 billion respectively. The company's market capitalization is $3.117 trillion. All figures are as of March 2024. Here's a more detailed look at Microsoft's six biggest shareholders. Satya Nadella owned 801,331 shares of Microsoft stock as of March 2024. Nadella has served as Chief Executive Officer (CEO) of Microsoft since 2014. He joined Microsoft in 1992. He has held leadership roles in Microsoft's enterprise and consumer businesses and served as executive vice president of Microsoft’s Cloud and Enterprise group where he led the transformation to the cloud infrastructure and services business which has outperformed the market and took share from competition. Microsoft is one of the world's biggest cloud services providers. Nadella was a member of the technology staff at Sun Microsystems before joining Microsoft. \"Insider\" refers to people in senior management positions and members of the board of directors, as well as people or entities that own more than 10% of the company's stock. It has nothing to do with insider trading in this context. Brad Smith owned 570,826 shares of Microsoft stock as of February 2024. Smith is President and Vice Chair of the company, having previously served as Microsoft's general counsel. He serves as the company’s chief legal officer and leads the company's initiatives on public issues such as cybersecurity, privacy, and environmental sustainability. After joining Microsoft in 2002 as general counsel, Smith spent the following decade leading work to resolve the company’s antitrust controversies with governments around the world. He was previously an associate then partner at Covington and Burling in Washington, D.C. Kathleen Hogan owned 159,764 shares of Microsoft stock as of March 2024. Hogan is Microsoft's Executive Vice President and Chief Human Resources Officer. Her focus is on the needs and satisfaction of Microsoft's 220,000-plus global employees. She joined Microsoft in 2003. Hogan also serves as Executive Council of the Society for Human Resource Management and she sits on the board of the National Center for Women and Information Technology. She was awarded HR Executive of the Year by Human Resource Executive Magazine in 2021 for her work throughout the COVID-19 pandemic. Institutional investors hold the majority of Microsoft's shares at about 69.2% of total shares outstanding as of March 2024. Vanguard Group owns 664.91 million shares of Microsoft, representing 8.95% of the total shares outstanding as of March 2024. Vanguard is primarily a mutual fund and ETF management company with about $8.1 trillion in global assets under management (AUM) as of 2024. The Vanguard S&P 500 ETF (VOO) is among the company's largest exchange-traded funds (ETFs) with more than $429 billion in AUM. BlackRock owned 538.94 million shares of Microsoft as of March 2024. This represents 7.25% of the total shares outstanding. BlackRock is primarily a mutual fund and ETF management company with approximately $9.09 trillion in global AUM in 2024. State Street owned 297.63 million shares of Microsoft as of March 2024, representing 4.01% of total shares outstanding. State Street manages mutual funds, ETFs, and other investments with $4.1 trillion in AUM at the close of 2023. The SPDR S&P 500 ETF Trust (SPY) is among State Street's largest ETFs with approximately $506.17 billion in AUM. Purchasing a share of Microsoft will run you about $430 as of March 2024. Keep in mind that stock prices rise and fall over the trading day, not to mention by the week, month, or year. The stock closed at $425 the day before and it dropped as low as $272 at one point during the previous twelve months. Satya Nadella lured Mustafa Suleyman away from his AI startup, Inflection AI, in March 2024. Suleyman was brought on board to oversee Microsoft's AI products and was cofounder of Google DeepMind. It's expected that Suleyman will oversee Microsoft Bing, Edge, and Copilot. Suleyman will report directly to Nadella. Assets under management or \"AUM\" are the total market value of a financial institution's securities. This doesn't include only securities that an institution owns outright but those it manages for other owners and clients as well. AUM can and typically does vary over time based on dividends that are paid out, the changing value of the securities, and ongoing transactions made by investors. As part of our effort to improve the awareness of the importance of diversity in companies, we offer investors a glimpse into the shareholders at Microsoft. We highlight the company's commitment to diversity, inclusiveness, and social responsibility as a whole. Find out how Microsoft reports the diversity of its management and workforce. The ✔ indicates whether Microsoft discloses its data about the diversity of its board of directors, C-Suite, general management, and employees overall across a variety of markets. Microsoft Corp. \"Facts About Microsoft.\" Microsoft Corp. \"Microsoft Cloud Strength Drives Third Quarter Results.\" Page 1. Morningstar. \"Microsoft Corp MSFT.\" Yahoo! Finance. \"Microsoft Corporation (MSFT).\" Microsoft Corp. \"Satya Nadella.\" Microsoft Corp. \"Brad Smith.\" Microsoft Corp. \"Kathleen Hogan.\" MarketBeat. \"Microsoft Institutional Ownership.\" Brokerage-Review. \"Vanguard Assets Under Management (AUM).\" ETF.com. \"VOO.\" BlackRock Inc. \"Actually, It Is About You.\" Yahoo! Finance. \"State Street Corporation (NYSE:STT) Reports Fourth-Quarter and Full-Year 2023 Financial Results.\" ETF.com. \"SPY.\" Yahoo! Tech. \"Microsoft Just Stepped Up Its AI Game Against Google—By Hiring the Cofounder of Google's DeepMind.\" CFI Education. \"Assets Under Management (AUM).\" "
}