{
    "title": null,
    "date": "3/6/2024",
    "url": "https://bdtechtalks.com/2024/03/06/microsoft-mistral-ai-partnership/",
    "text": "This article is part of our series that explores the business of artificial intelligence The market for large language models is still very volatile and can quickly shift in unexpected directions. OpenAI might still be the de facto market leader. But recent developments in the past few days have the potential to redefine the winners and losers of the race for LLM dominance. Last week, Microsoft and Mistral AI announced a multi-year partnership. The details of the agreement are unclear. From what we know, Mistral gets access to “Azure’s cutting-edge AI infrastructure” to develop and train its latest models. But more importantly, Mistral will be able to reach Microsoft’s massive distribution channels and customer base to create a business model around its applications. Mistral AI, which was launched in mid-2023 by former Meta and Google researchers, has managed to raise hundreds of millions of dollars in funding and launch some of the most successful open-weight models. However, as the history of OpenAI shows, research in LLMs can cost billions of dollars and can’t be done without a self-sustaining business model. The Microsoft partnership might be Mistral AI’s path to profitability and future funding. Azure is the second-largest public cloud and has a large share of the cloud AI market. Any model available on Microsoft’s cloud will immediately be available to many enterprises that are already using Microsoft’s infrastructure. The partnership has already given Mistral AI access to big customers such as Schneider Electric. The darker side of the partnership is the effect it will have on Mistral AI’s model release policy. The company has taken the first step away from openness by keeping Mistral Large closed. We will have to see whether Mistral AI manages to find a formula that enables it to become profitable while also sharing at least some of its models or if it will go full OpenAI and keep all its models closed. What’s in it for Microsoft? First, Microsoft will get exclusive or near-exclusive access to some of Mistral AI’s models, starting with Mistral Large, which is now only available on Azure and Mistral AI’s endpoint service, La Platforme. Microsoft will also work with Mistral’s top AI talent to create “purpose-specific models for select customers, including European public sector workloads.” With the uncertainty caused by the EU AI Act, having a Europe-based AI startup will give Microsoft an edge and extra maneuverability. Moreover, with the Mistral AI partnership, Microsoft will be less dependent on OpenAI and its continued success and dominance of the LLM landscape. Microsoft already has a large stake in OpenAI. But with new models being launched every week, there is no guarantee that OpenAI will remain the market leader in the next few years. And Microsoft is already laying the groundwork to become a major stakeholder in what could be the company that dethrones OpanAI. For the moment, Microsoft’s investment in Mistral is around $16 million, less than 1% of the company’s value. But if the Microsoft-OpenAI partnership is any indication, whatever investment Microsoft makes in Mistral AI will be in Azure credits and will come back to it. And Mistral AI now has a huge incentive to port its API service to Azure (if it hasn’t already done so). So Microsoft will end up recouping its investments directly from Mistral AI and its customers. The relationship can eventually evolve into larger investments, a wider partnership, and potentially an acquisition in the future. More broadly, the partnership will benefit Microsoft’s enterprise AI efforts. While GPT-4 remains the baseline for performance on LLM benchmarks such as MMLU and GSM8K. However, most enterprise AI applications don’t need state-of-the-art performance on math and reasoning benchmarks. They need speed, efficiency, cost-effectiveness, customization, and high performance on very specific tasks. Those are the kinds of values that Microsoft can offer with the diverse models available on its platform, which range from very large frontier LLMs such as GPT-4 to small models such as Phi-2. And now Mistral Large is one other option that Microsoft’s customers can explore as they integrate LLMs into their applications. The market for enterprise LLMs will be much larger than the consumer segment, where users pay a $20 subscription fee to use the models through a website or mobile app. And as LLMs become commoditized, the biggest winners of the enterprise LLM market will not be the model providers but the companies that provide maximum convenience and flexibility for developing applications and integrating language models into existing products. This site uses Akismet to reduce spam. Learn how your comment data is processed. Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}