{
    "title": "Eventbrite, Inc. (NYSE:EB) Sees Large Increase in Short Interest",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-eb-options-data-report-2024-03-18/",
    "text": "Eventbrite, Inc. (NYSE:EB - Get Free Report) was the target of a large growth in short interest in the month of February. As of February 29th, there was short interest totalling 11,230,000 shares, a growth of 6.9% from the February 14th total of 10,510,000 shares. Based on an average daily trading volume, of 1,450,000 shares, the days-to-cover ratio is presently 7.7 days. Get Eventbrite alerts:Sign UpAnalysts Set New Price Targets EB has been the subject of several recent research reports. BWS Financial initiated coverage on Eventbrite in a research report on Monday, November 27th. They issued a \"buy\" rating and a $12.00 price target for the company. Piper Sandler reduced their price target on Eventbrite from $13.00 to $9.00 and set an \"overweight\" rating for the company in a research report on Wednesday, February 28th. Truist Financial reduced their price target on Eventbrite from $17.00 to $11.00 and set a \"buy\" rating for the company in a research report on Wednesday, February 28th. Morgan Stanley reduced their target price on Eventbrite from $11.00 to $9.00 and set an \"equal weight\" rating on the stock in a research report on Wednesday, February 28th. Finally, TheStreet lowered Eventbrite from a \"c-\" rating to a \"d+\" rating in a research report on Friday, November 24th. Two analysts have rated the stock with a hold rating and four have assigned a buy rating to the company's stock. According to data from MarketBeat.com, the company has an average rating of \"Moderate Buy\" and an average target price of $11.00. Get Our Latest Stock Analysis on EBInstitutional Inflows and Outflows A number of hedge funds have recently modified their holdings of the company. Covestor Ltd boosted its position in Eventbrite by 217.7% during the third quarter. Covestor Ltd now owns 2,783 shares of the company's stock worth $27,000 after purchasing an additional 1,907 shares in the last quarter. Tower Research Capital LLC TRC boosted its position in Eventbrite by 126.8% during the first quarter. Tower Research Capital LLC TRC now owns 2,828 shares of the company's stock worth $25,000 after purchasing an additional 1,581 shares in the last quarter. Mine & Arao Wealth Creation & Management LLC. purchased a new position in Eventbrite during the fourth quarter worth approximately $33,000. Metropolitan Life Insurance Co NY raised its holdings in shares of Eventbrite by 47.4% during the fourth quarter. Metropolitan Life Insurance Co NY now owns 4,880 shares of the company's stock valued at $29,000 after acquiring an additional 1,569 shares during the last quarter. Finally, UBS Group AG raised its holdings in shares of Eventbrite by 57.5% during the third quarter. UBS Group AG now owns 6,409 shares of the company's stock valued at $38,000 after acquiring an additional 2,340 shares during the last quarter. 81.38% of the stock is owned by institutional investors and hedge funds. Eventbrite Trading Up 4.3 % Shares of EB stock traded up $0.24 during mid-day trading on Monday, reaching $5.74. The stock had a trading volume of 3,188,905 shares, compared to its average volume of 1,626,240. The business's fifty day moving average is $7.53 and its 200-day moving average is $8.16. The company has a quick ratio of 1.99, a current ratio of 1.99 and a debt-to-equity ratio of 1.87. Eventbrite has a 1-year low of $5.05 and a 1-year high of $11.90. Eventbrite Company Profile (Get Free Report) Eventbrite, Inc operates a self-service ticketing and experience technology platform that serves event creators in the United States and internationally. Its platform integrates components needed to plan, promote, and produce live events that allow creators to reduce friction and costs, enhance reach, and drive ticket sales.Further ReadingFive stocks we like better than EventbriteThe \"How\" and \"Why\" of Investing in 5G StocksInsider Selling of Amazon Spikes in Q1, but it's Not Time to SellWhat Are Dividend Challengers?2 Deep Value, High Yield Stocks With a Double-Digit UpsideDividend Tax CalculatorAre We in a Bear Market? Here are the Signs This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Eventbrite, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Eventbrite wasn't on the list. While Eventbrite currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering what the next stocks will be that hit it big, with solid fundamentals? Click the link below to learn more about how your portfolio could bloom. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}