{
    "title": "Microsoft warns of ongoing Russian hacker attempts to breach its systems",
    "date": "3/9/2024",
    "url": "https://www.republicworld.com/business/international-business/microsoft-warns-of-ongoing-russian-hacker-attempts-to-breach-its-systems/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated March 9th, 2024 at 11:50 IST The hackers have utilised data stolen from corporate emails in January to target Microsoft. Microsoft Warns Russian hackers: Microsoft issued a warning on Friday stating that hackers linked to Russia's foreign intelligence service are persistently attempting to breach its systems. The hackers have utilised data stolen from corporate emails in January to target the tech giant, whose products are extensively utilised across the US national security establishment. The disclosure has raised concerns among analysts regarding the safety of Microsoft's systems and services. Microsoft has identified a Russian state-sponsored group called Midnight Blizzard, or Nobelium, behind the intrusions. The Russian embassy in Washington has not responded to requests for comment on Microsoft's statement or its previous statements about Midnight Blizzard activity. Microsoft disclosed the breach in January, revealing that hackers attempted to breach corporate email accounts, including those of senior company leaders and various functional departments. Despite Microsoft's efforts to thwart access, the attacks are ongoing, signalling the aggressiveness of the hackers. The stolen data includes access to source code repositories and internal systems, raising concerns about potential compromises and backdoors. The hackers' persistence underscores the major commitment of their resources and coordination. Microsoft's threat intelligence team has been investigating and sharing research on Nobelium since at least 2021 when the group was implicated in the SolarWinds cyberattack. Microsoft is actively reaching out to affected customers to assist them in taking mitigating measures against potential breaches. However, the company did not disclose the identities of the affected customers. The ongoing attempts to breach Microsoft's systems highlight the evolving nature of cybersecurity threats and the challenges in safeguarding against sophisticated attacks orchestrated by state-sponsored actors. (With Reuters Inputs) Published March 9th, 2024 at 11:50 IST Send us your views, we’ll publish them. This section is moderated. UP: Portion of Under-Construction Bridge Collapses in Bulandshahr Upset Over Relationship Issues, B.Tech Student Dies by Suicide in Noida Daughter-in-Law of Former Lok Sabha Speaker Shivraj Patil Joins BJP Google's timeline for RCS support on iPhone Han So Hee-Ryu Jun Yeol Call It Quits Within Two Weeks Amid Controversy Zodiac Signs That Are Born To Be Rebels And Challenge The Status Quo 'Received I-T Notice Last Night', Claims DK Shivakumar AAP's Bharadwaj, Atishi to Address Press Conference at Noon Today | LIVE BTech Graduate from Jodhpur Held for Stealing Laptops From PGs in B'luru Elderly Woman Touches Pilot's Feet On A Flight To Ayodhya, Video Viral © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}