{
    "title": "Satya Nadella Welcomes Mustafa Suleyman As CEO Of Microsoft AI",
    "date": "3/20/2024",
    "url": "https://www.india.com/technology/satya-nadella-welcomes-mustafa-suleyman-as-ceo-of-microsoft-ai-6801952/",
    "text": "click this icon for latest updates  Published: March 21, 2024 12:18 AM IST By IANS New Delhi: Microsoft Chairman and CEO Satya Nadella on Tuesday welcomed Mustafa Suleyman as CEO of the company’s artificial intelligence (AI) venture. As CEO of Microsoft AI, Suleyman will lead consumer AI products and research, including Copilot, Bing and Edge. “Welcome to Microsoft. Thrilled to have you lead Microsoft AI as we build consumer AI, like Copilot, that is loved by and benefits people around the world,” Nadella posted on X. Suleyman was the co-founder and former head of applied AI at DeepMind, an AI company acquired by Google.  After leaving DeepMind, he co-founded Inflection AI, a machine learning and generative AI company, in 2022. “My friend and long-time collaborator Karen Simonyan will be Chief Scientist, and several of our amazing teammates have chosen to join us,” Suleyman also posted on X. He said that Inflection AI will continue on its mission under a new CEO, and look to reach more people than ever by making its API widely available to developers and businesses the world over. “It’s been an amazing journey, with so much more to come. Thank you to everyone for your support. Things really are just getting started,” he added.\n\n \n\nSuleyman co-founded DeepMind Technologies, an AI and machine learning company, and became its chief product officer. The company was backed by Founders’ Fund and Tesla CEO Elon Musk, among others. In 2014, DeepMind was acquired by Google reportedly for 400 million pounds.\nAlso Read:  \n\n\n  \n\n\nThis Is How New Crime GPT Tool Will Help UP Police\n\n\n \n \n\n\n  \n\n\nNo Smartphone Or Internet? No Problem; AI-Backed Phone Has The Answers\n\n\n \n \n\n\n  \n\n\nEuropean Union Lawmakers Pass Legislation To Restrict AI Applications\n\n\n \n  \nFor breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest\n                        Technology News on India.com.\n                \n\n\nTopics\nMicrosoft AIArtificial IntelligenceCopilotMicrosoft CEO Satya NadellaMustafa Suleyman \n\n\n\n\nMore Stories   After leaving DeepMind, he co-founded Inflection AI, a machine learning and generative AI company, in 2022. “My friend and long-time collaborator Karen Simonyan will be Chief Scientist, and several of our amazing teammates have chosen to join us,” Suleyman also posted on X. He said that Inflection AI will continue on its mission under a new CEO, and look to reach more people than ever by making its API widely available to developers and businesses the world over. “It’s been an amazing journey, with so much more to come. Thank you to everyone for your support. Things really are just getting started,” he added.  Suleyman co-founded DeepMind Technologies, an AI and machine learning company, and became its chief product officer. The company was backed by Founders’ Fund and Tesla CEO Elon Musk, among others. In 2014, DeepMind was acquired by Google reportedly for 400 million pounds. For breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest\n                        Technology News on India.com. Satya Nadella Welcomes Mustafa Suleyman As CEO Of Microsoft AI 5G Data Consumption 4 Times Faster Than 4G In India: Report IIT Madras' New Customisable Electric Standing Wheelchair To Empower Disabled Woman Guilty Of Laundering Bitcoin In UK From $6.3 Bln China fraud Lok Sabha Elections 2024: Meta Unveils Comprehensive Plan To Combat Misinformation On Social Media FB, Instagram Satya Nadella Welcomes Mustafa Suleyman As CEO Of Microsoft AI India vs AI Risks: Breather For Big Digital Platforms, Albeit With A Rider This Is How New Crime GPT Tool Will Help UP Police Sundar Pichai, Elon Musk On AGI; SpaceX Founder Says ‘AI Will Probably Be Smarter Than Human ’, Are We Close To AGI? No Smartphone Or Internet? No Problem; AI-Backed Phone Has The Answers By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts Cookies Policy. "
}