{
    "title": "Microsoft stock hits record high on new Copilot for Security AI tool",
    "date": "3/15/2024",
    "url": "https://qz.com/microsoft-stock-record-high-copilot-for-security-1851338634",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Microsoft’s latest AI product announcement sent its stock to a record high Thursday. The technology giant’s stock reached $427.81 in intraday trading Thursday, and ended at $425.22, according to Investor’s Business Daily. It last reached a record high on Feb. 9 when its stock hit $420.82. Microsoft said Wednesday its Microsoft Copilot for Security tool, which will launch worldwide on April 1, is the AI industry’s “first generative AI solution” for security and IT professionals” and is trained on “large-scale data and threat intelligence” including over 78 trillion security signals that the company processes daily. Security analysts reported being 22% faster with Copilot for Security, and 7% reported their work being more accurate with the tool, according to an economic study by the company. Vasu Jakkal, corporate vice president of security, compliance, identity, and management at Microsoft told Quartz cyber attackers are using large language models (LLMs) to become more productive. For example, they may employ AI tools like ChatGPT to do reconnaissance on people and companies to find security vulnerabilities, improve coding skills and password cracking, and to spread misinformation. “It fundamentally boils down to finding information and directly launching these attacks to strengthen their own positions of influence and get economic advantage,” Jakkal said about nation-state and financial crime actors targeting companies in cyberattacks. But while Microsoft is developing its own AI tools, some employees reportedly think its AI work is too centered on its multi-year, multi-billion dollar partnership with OpenAI. “The former Azure AI is basically just tech support for OpenAI,” a former Microsoft executive said, according to a Business Insider report. “Eric Boyd [corporate vice president of Microsoft’s Azure AI Platform] is effectively maintaining the OpenAI service. It’s less of an innovation engine than it once was. Now it’s more IT for OpenAI. The beating heart of innovation is elsewhere.” Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}