{
    "title": null,
    "date": "3/12/2024",
    "url": "https://marketscale.com/industries/business-services/california-ota-decides-in-favor-of-microsoft-on-income-tax-apportionment-matter/",
    "text": "EisnerAmper, one of the largest business consulting firms in the world, is comprised of EisnerAmper LLP, a licensed independent CPA firm that provides client attest services; and Eisner Advisory Group LLC, an alternative practice structure that provides business advisory and non-attest services in accordance with all applicable laws, regulations, standards and codes of conduct. EisnerAmper In The Matter of the Appeal of Microsoft Corporation and Subsidiaries, OTA Case No. 21037336, the Office of Tax Appeals (“OTA”) decided that the taxpayer, Microsoft Corporation, was correct to include the entirety of its gross receipts from repatriated dividends in the denominator of its sales factor used for apportionment, regardless of the fact that 75% of such dividends had been deducted by Microsoft in computing its tax base before apportionment. The OTA’s decision relied heavily on the California statute defining “receipts” for apportionment purposes. The definition, quoted in the body of the decision, states: “Gross Receipts” means the gross amounts realized… on the sale or exchange of property, the performance of services, or the use of property or capital (including rents, royalties, interest, and dividends) in a transaction that produces business income, in which the income, gain, or loss is recognized (or would be recognized if the transaction were in the United States) under the Internal Revenue Code.… California’s tax authority, the Franchise Tax Board (“FTB”) argued that a “matching principle” should apply that should preclude a taxpayer from including receipts from the denominator of the apportionment factor if such receipts are also excluded from the income of the taxpayer. However, OTA rejected that approach since the repatriated dividends fell within the above definition of receipts under R&TC Section 25120(f)(2). OTA pointed out that the plain language of the above statutory definition of gross receipts and lack of any specific rule excluding deducted dividends from the apportionment factor meant that the gross amount of the dividends are “receipts” for apportionment purposes. FTB also argued that the receipts should be excluded as an “occasional sale” under California’s Regulation 25137(c). OTA also rejected that approach, explaining that while “sales” as defined by California’s statute includes all “receipts,” the occasional sale rule applies to a more limited subset of sales, requiring a “sale of a fixed asset or other property,” and does not apply to all “sales.” Finally, FTB argued that inclusion of the receipts in the denominator was “distortive” and therefore should not be allowed. The party asserting distortion has the burden of proving distortion, and FTB failed to prove distortion in this situation. Citing a 2006 California decision also involving Microsoft, where “treasury function” receipts producing 2% of the company’s net income caused a 24% change to the apportionment factor, the OTA noted that in the instant case, the dividends made up 61% of the taxpayer’s net income and caused a 53% change in the apportionment factor. OTA reasoned that “FTB’s focus on the percentage assigned to foreign jurisdictions in isolation is misplaced.” Therefore, while the change to the apportionment factor was large in the instant case (53%), the OTA did not find distortion given that 61% of the taxpayer’s net income was generated by such receipts. Water’s-edge electing taxpayers should review their open tax years to confirm that they have properly included the gross amount of repatriated dividends in the denominator of their receipts factor, for apportioning income. Taxpayers may be able to file claims for refunds for such open years. Taxpayers carrying forward net operating losses (“NOLs”) should also review the computation of such losses not just in open years but for all years from which NOLs are being carried forward, to determine whether the NOLs were correctly apportioned within and without California in the loss years and that the proper amount of NOLs are being carried forward. Speak to your state and local tax advisor to further discuss the impact of this decision on your California tax filings. Article written by John Clausen Share Show In this episode of The Marketing AI SparkCast, host Aby Varma, a B2B Marketing Leader and the Founder of Spark Novus, sits down with Matt Gill, the Founder and Managing Partner of MICA Consulting Group. Spark Novus is a consultancy specializing in strategic AI adoption in marketing. MICA is a leading boutique national marketing […] Share Show The spotlight is shifting, we’re not just cheering on professional athletes during their prime, but also wondering what happens when the final whistle blows as they move from the peaks of their careers into the next chapter of their lives. The conversation turns to the challenges they face outside the sporting arena and the […] Share Show As the travel industry emerges from the shadows of the pandemic, it finds itself at a crossroads, particularly in the realm of airline loyalty programs. Historically seen as ancillary benefits to enhance customer retention, these programs have undergone a profound transformation, now standing at the heart of airline revenue strategies. This pivot has not […] MarketScale creates and publishes industry-leading B2B content for industries\r\n                        ranging from Education to Retail, and Hospitality to Healthcare delivering\r\n                        engaging and educational live shows, online learning courses,\r\n                        virtual events and more. Sign up to receive the latest in industry-leading B2B content. Get the latest from EisnerAmper Thank you for joining the EisnerAmper. has successfully been added. Get the latest from California OTA Decides in Favor of Microsoft on income tax apportionment matter Thank you for joining the California OTA Decides in Favor of Microsoft on income tax apportionment matter. has successfully been added. "
}