{
    "title": "Microsoft and healthcare leaders launch \"TRAIN\" to ensure trustworthy AI in \nmedicine",
    "date": "3/11/2024",
    "url": "https://mspoweruser.com/microsoft-and-healthcare-leaders-launch-train-to-ensure-trustworthy-ai-in-medicine/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on March 11, 2024 published on \n\nMarch 11, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more A powerful consortium of leading healthcare providers has joined forces with Microsoft to introduce the Trustworthy & Responsible AI Network (TRAIN). This groundbreaking initiative aims to establish and implement rigorous standards for the development and utilization of AI within the healthcare industry. By doing so, TRAIN seeks to ensure the quality, safety, and trustworthiness of AI applications as they play an increasingly pivotal role in healthcare. The founding members of TRAIN comprise distinguished institutions committed to advancing responsible AI in healthcare. Notable participants include: Microsoft serves as the technology enabling partner for this collaborative endeavor. To achieve its mission, TRAIN adopts a collaborative approach: TRAIN extends its benefits beyond large institutions. By partnering with OCHIN (which serves a national network of community health organizations) and TruBridge (a conduit to community healthcare), TRAIN ensures that responsible AI is accessible to organizations of all sizes. As AI continues to revolutionize healthcare, responsible development and evaluation standards are paramount. The Trustworthy & Responsible AI Network stands at the forefront, fostering a safer, more effective AI-powered future for healthcare. “When it comes to AI’s tremendous capabilities, there is no doubt the technology has the potential to transform healthcare. However, the processes for implementing the technology responsibly are just as vital,” said Dr. David Rhew, global chief medical officer and vice president of healthcare, Microsoft. “By working together, TRAIN members aim to establish best practices for operationalizing responsible AI, helping improve patient outcomes and safety while fostering trust in healthcare AI.” Pradeep Viswav Software and Services Expert Pradeep is a Computer Science and Engineering Graduate. He was also a Microsoft Student Partner. He is currently working in a leading IT company. Pradeep Viswav Software and Services Expert Pradeep is a technical manager at a large tech company and a seasoned technology blogger. He reports on software, hardware, industry trends, and more. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}