{
    "title": "626 Financial LLC Has $6.76 Million Stake in Microsoft Co. (NASDAQ:MSFT)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/626-financial-llc-has-6-76-million-stake-in-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 626 Financial LLC raised its stake in shares of  Microsoft Co. (NASDAQ:MSFT – Free Report) by 30.9% in the 4th quarter, HoldingsChannel.com reports. The firm owned 17,970 shares of the software giant’s stock after purchasing an additional 4,247 shares during the period. Microsoft accounts for  4.5% of 626 Financial LLC’s holdings, making the stock its 4th biggest position. 626 Financial LLC’s holdings in Microsoft were worth $6,757,000 at the end of the most recent reporting period. Several other hedge funds have also bought and sold shares of MSFT. DGS Capital Management LLC lifted its position in shares of  Microsoft by 19.9% in the first quarter. DGS Capital Management LLC now owns 14,342 shares of the software giant’s stock valued at $4,422,000 after acquiring an additional 2,383 shares in the last quarter.  IFM Investors Pty Ltd lifted its position in shares of  Microsoft by 20.8% in the first quarter. IFM Investors Pty Ltd now owns 1,138,469 shares of the software giant’s stock valued at $351,001,000 after acquiring an additional 196,338 shares in the last quarter.  Altus Wealth Group LLC lifted its position in shares of  Microsoft by 1.2% in the first quarter. Altus Wealth Group LLC now owns 12,712 shares of the software giant’s stock valued at $3,919,000 after acquiring an additional 152 shares in the last quarter.  Powell Investment Advisors LLC lifted its position in shares of  Microsoft by 16.2% in the first quarter. Powell Investment Advisors LLC now owns 2,578 shares of the software giant’s stock valued at $795,000 after acquiring an additional 359 shares in the last quarter.  Finally, Onyx Bridge Wealth Group LLC lifted its position in shares of  Microsoft by 8.2% in the first quarter. Onyx Bridge Wealth Group LLC now owns 6,782 shares of the software giant’s stock valued at $1,921,000 after acquiring an additional 512 shares in the last quarter. Institutional investors own  71.13% of the company’s stock. MSFT opened at $420.72 on Friday. The stock’s fifty day moving average is $410.82 and its two-hundred day moving average is $374.31. The company has a market capitalization of $3.13 trillion, a P/E ratio of 38.04, a PEG ratio of 2.24 and a beta of 0.89. Microsoft Co. has a 52 week low of $275.37 and a 52 week high of $430.82. The company has a quick ratio of 1.20, a current ratio of 1.22 and a debt-to-equity ratio of 0.19. Microsoft (NASDAQ:MSFT – Get Free Report) last released its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, topping the consensus estimate of $2.76 by $0.17. The company had revenue of $62.02 billion for the quarter, compared to the consensus estimate of $61.14 billion. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. Microsoft’s quarterly revenue was up 17.6% on a year-over-year basis. During the same period last year, the business posted $2.32 EPS.  Analysts forecast that  Microsoft Co. will post 11.63 earnings per share for the current year. The business also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Shareholders of record on Thursday, May 16th will be given a dividend of $0.75 per share. The ex-dividend date of this dividend is Wednesday, May 15th. This represents a $3.00 annualized dividend and a yield of 0.71%. Microsoft’s dividend payout ratio (DPR) is presently 27.12%. Several equities analysts have recently commented on the company. Wells Fargo & Company boosted their price objective on Microsoft from $435.00 to $460.00 and gave the company an “overweight” rating in a research report on Wednesday, January 31st. BMO Capital Markets boosted their target price on Microsoft from $420.00 to $455.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Argus increased their price target on Microsoft from $390.00 to $430.00 and gave the company a “buy” rating in a research note on Tuesday, December 5th. KeyCorp initiated coverage on Microsoft in a research note on Thursday, March 21st. They set an “overweight” rating and a $490.00 price target for the company. Finally, Macquarie increased their price target on Microsoft from $430.00 to $450.00 and gave the company an “outperform” rating in a research note on Wednesday, January 31st. Four equities research analysts have rated the stock with a hold rating and thirty-six have issued  a buy rating to the stock. According to data from MarketBeat.com, the stock currently has an average rating of “Moderate Buy” and a consensus price target of $423.34. Get Our Latest Stock Report on Microsoft In other Microsoft news, insider Bradford L. Smith sold 45,000 shares of the stock in a transaction on Friday, February 2nd. The stock was sold at an average price of $411.78, for a total transaction of $18,530,100.00. Following the sale, the insider now owns 574,129 shares of the company’s stock, valued at approximately $236,414,839.62. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. In other Microsoft news, insider Bradford L. Smith sold 45,000 shares of the stock in a transaction on Friday, February 2nd. The stock was sold at an average price of $411.78, for a total transaction of $18,530,100.00. Following the sale, the insider now owns 574,129 shares of the company’s stock, valued at approximately $236,414,839.62. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. Also, insider Bradford L. Smith sold 3,303 shares of the firm’s stock in a transaction on Monday, February 5th. The stock was sold at an average price of $406.12, for a total value of $1,341,414.36. Following the completion of the sale, the insider now directly owns 570,826 shares of the company’s stock, valued at approximately $231,823,855.12. The disclosure for this sale can be found here. In the last 90 days, insiders have sold 1,070,258 shares of company stock valued at $30,690,456. 0.03% of the stock is currently owned by corporate insiders. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Wellington Management Group LLP Purchases 1,779 Shares of Maravai LifeSciences Holdings, Inc. (NASDAQ:MRVI) 1834 Investment Advisors Co. Has $27.83 Million Stock Holdings in Apple Inc. (NASDAQ:AAPL) "
}