{
    "title": "Evercore ISI Cuts Augmedix (NASDAQ:AUGX) Price Target to $4.50",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-augx-lower-price-target-2024-03-19/",
    "text": "Augmedix (NASDAQ:AUGX - Get Free Report) had its price objective dropped by Evercore ISI from $6.50 to $4.50 in a report released on Tuesday, Benzinga reports. The brokerage currently has an \"in-line\" rating on the stock. Evercore ISI's price objective indicates a potential upside of 13.64% from the company's current price. Separately, Maxim Group reduced their price target on shares of Augmedix from $6.50 to $5.00 and set a \"buy\" rating for the company in a report on Tuesday. Get Our Latest Analysis on Augmedix Shares of Augmedix stock traded up $0.63 on Tuesday, hitting $3.96. The company had a trading volume of 1,086,009 shares, compared to its average volume of 393,943. The firm has a market capitalization of $163.79 million, a P/E ratio of -7.76 and a beta of -0.14. Augmedix has a twelve month low of $1.34 and a twelve month high of $6.25. The company has a debt-to-equity ratio of 17.18, a current ratio of 1.34 and a quick ratio of 1.34. The stock has a 50-day moving average of $4.41 and a 200-day moving average of $4.94. Large investors have recently added to or reduced their stakes in the business. Essex Investment Management Co. LLC bought a new stake in Augmedix during the third quarter worth $2,237,000. Acadian Asset Management LLC bought a new stake in Augmedix during the third quarter worth $48,000. Barclays PLC bought a new stake in Augmedix during the third quarter worth $115,000. Vontobel Holding Ltd. raised its position in Augmedix by 439.7% during the third quarter. Vontobel Holding Ltd. now owns 173,209 shares of the company's stock worth $892,000 after acquiring an additional 141,113 shares in the last quarter. Finally, Worth Venture Partners LLC bought a new stake in Augmedix during the third quarter worth $83,000. Institutional investors and hedge funds own 71.58% of the company's stock. Augmedix, Inc provides remote medical documentation solutions and live clinical support services in the United States. Its platform offers Augmedix Live that provides synchronous medical note documentation and point of care support; Augmedix Notes that offers asynchronous medical documentation based upon previously recorded visits; Augmedix Prep that provides patient demographics, past medical history, medication changes and other points from the patient's health record; and Augmedix Go, a self-service mobile software application.Featured StoriesFive stocks we like better than AugmedixWhat Are Dividend Challengers?Growing Twice as Fast as Tesla, XPeng is a BuyThe How and Why of Investing in Biotech Stocks4 Stocks Building Long-Term Value for Shareholders Best Stocks Under $10.00 FedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount Before you consider Augmedix, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Augmedix wasn't on the list. While Augmedix currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here If a company's CEO, COO, and CFO were all selling shares of their stock, would you want to know? Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}