{
    "title": null,
    "date": "3/4/2024",
    "url": "https://windowsreport.com/google-falls-behind-microsoft-ai-race/",
    "text": "Follow us Share this article Latest news Alphabet's stock performance highlights the market sentiments 3 min. read Published on March 4, 2024 published on \n\nMarch 4, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more The last few weeks haven’t turned out the way Google hoped. After it released the AI-powered Gemini for image creation, the tool was met with severe criticism from all quarters due to its inaccuracy and inherent bias. Subsequently, Google disabled image creation on Gemini. In an email to the employees, Google’s CEO, Sundar Pichai, wrote,  This led to growing concerns about Google sustaining the long-held top spot in searches performed on the web. It forms a significant share of Google’s revenue. In an interview with Bloomberg, Tom Graff, CEO of Facet said,  As it turns out, the whole fiasco didn’t go down well with the investors and resulted in massive setbacks for Alphabet, the parent company, in the stock market. Alphabet stocks fell over 5% last week, wiping nearly $100 billion off the market value. In the same period, Microsoft’s stock witnessed a steady rise. The company made several enhancements to its native AI-based chatbot, Copilot, including allowing users to upload documents, which were well received by the users. If another company develops an AI-based tool or search engine that could outperform Google, the California-based tech giant will be in deep trouble. It’s not going to happen any time soon, given Google’s hold over the market, but it’s a wake-up call, nonetheless! To put things into perspective, Microsoft’s native search engine, Bing, has a market share of 3.31% as opposed to Google’s 91.62% as per Statscounter. Similarly, in the browser ecosystem, Google Chrome commands 65.31% of the market, while Microsoft Edge lags behind at 5.07% according to Statcounter. These figures also highlight another critical aspect. Google has a lot to lose, while Microsoft stands to gain from every calculated and effectively enforced measure! This AI race between Microsoft and Google is turning out to be more competitive than anyone thought. One setback and Google suffered a bloodbath in the stock market. More losses in the race could trigger massive sell-offs, and the management would be forced to make critical decisions! Who do you think will be the more dominant player in the coming days, Microsoft or Google? Share your thoughts in the comments section. More about the topics: AI, Google, microsoft Kazim Ali Alvi Windows Hardware Expert Kazim has always been fond of technology, be it scrolling through the settings on his iPhone, Android device, or Windows PC. He's specialized in hardware devices, always ready to remove a screw or two to find out the real cause of a problem.\nLong-time Windows user, Kazim is ready to provide a solution for your every software & hardware error on Windows 11, Windows 10 and any previous iteration. He's also one of our experts in Networking & Security. Kazim Ali Alvi Windows Hardware Expert Kazim is specialized in hardware devices, always ready to remove a screw or two to find out the real cause of a problem. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}