{
    "title": "Microsoft's startup investment strategy looks to corner the global AI \nmarket — but will it work?",
    "date": "3/26/2024",
    "url": "https://www.itpro.com/business/business-strategy/microsofts-startup-investment-strategy-looks-to-corner-the-global-ai-market-but-will-it-work",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Microsoft has forged close ties with several major players across the global AI marketplace, and its current strategy shows no signs of stopping Microsoft’s rise to dominance in the generative AI space over the last year has been nothing short of remarkable, but aggressive maneuvers in recent weeks and the penning of several new deals have taken things up a notch. The company shocked the industry last week when it announced it had poached Inflection AI chief executive Mustafa Suleyman to lead its new consumer-facing AI division. Not content with whisking away the startup’s CEO, it also took on two other co-founders, a significant portion of staff, and agreed to pay Inflection around $650 million for exclusive rights to sell access to AI models through its Azure cloud service. The deal is unusual in that Microsoft gained its desired outcome from this situation - the absorption of Inflection talent, IP, and technology - without so much as firing a shot. The deal itself does not constitute a traditional merger or acquisition. It’s a peculiar setup for Microsoft and Inflection, and one that appears to skirt the boundaries of regulatory scrutiny. Crucially, though, it points toward Microsoft priming itself for a battle to dominate the consumer AI space in the same way it currently does in the enterprise sphere. “By bringing on a large portion of the Inflection team and licensing its assets, Satya Nadella is not just hedging his bets, but placing a larger one that Microsoft can still win in the consumer space,” Jason Wong, Distinguished VP analyst at Gartner, told ITPro. This isn’t the only bet Microsoft has taken in recent months either, and Wong’s comments ring true when considering the other moves the firm has made to maintain its position in the AI space. Receive our latest news, industry updates, featured resources and more. Sign up today to receive our FREE report on AI cyber crime & security - newly updated for 2023. In February, Microsoft announced a multi-year partnership with European AI startup Mistral that instantly drew suspicion from EU regulators, though no formal investigation has yet been announced. A key concern initially raised in the wake of this deal centered around the potential for Microsoft to exert control over the company in some capacity. This control element is an issue that’s already seen the company fall into hot water with regulators over its relationship with OpenAI. Lawmakers on both sides of the Atlantic are currently conducting preliminary investigations into the scope of the tie-up between the two companies, with the UK’s Competitions and Markets Authority (CMA) specifically highlighting concerns over the influence Microsoft has at the startup.  OpenAI and Microsoft's regulatory probes explained But this campaign at Microsoft is about more than just ensuring it has a finger in every pie. Wong told ITPro this also appears to be an attempt to diversify its AI investments and reduce reliance on OpenAI. “Microsoft has been trying to shake its perceived dependency on OpenAI, and expand on its AI offerings for consumers,” he said. OpenAI is by no means a liability, but last year’s chaos in which Sam Altman was ousted certainly created strain and highlighted the precarious nature of the relationship between the two firms. Satya Nadella was said to have been broadsided by the boardroom coup and left “furious” at the situation. The company also tried to bring Altman on board in a similar role to Suleyman after he’d been forced out of the firm. Suleyman’s ascent to CEO of ‘Microsoft AI’ could point toward a degree of insecurity at Microsoft in terms of its positioning in the consumer AI market. The DeepMind co-founder will head up research on AI products within Microsoft’s Copilot, Bing, and Edge platforms. In 2023, Nadella suggested that its generative AI success could be the key to boosting adoption of its Edge browser - a prediction which thus far hasn't come to fruition. The same can also be said for Bing, with the tech giant still trailing Google in the search space by a significant margin. According to Wong, the scope of Suleyman's remit reflects Microsoft’s need to reaffirm and expand on its current suite of products. “Bringing in Mustafa Suleyman as a CEO for Microsoft AI is a clear sign that there needs to be more vision and accountability to make this happen in the consumer business,” Wong said.  Prepare your workers to succeed in an AI-enabled world Nadella cited Suleyman’s induction into Microsoft as critical to ensuring it adapts to a rapidly changing product landscape. But Wong suggested this latest move is as much a fear of falling behind as it is a desire to stay ahead. “Bing Chat has failed to make a material impact, and consumer products centered around Copilot for Windows and Office applications lack the innovation from generative AI that consumers expect,” he said. George Fitzmaurice is a staff writer at ITPro, ChannelPro, and CloudPro, with a particular interest in AI regulation, data legislation, and market development. After graduating from the University of Oxford with a degree in English Language and Literature, he undertook an internship at the New Statesman before starting at ITPro. Outside of the office, George is both an aspiring musician and an avid reader. Data backup strategies in focus as 800,000 UK firms admit to losing data since 2019 Why every penny counts even when spending is on the up Nasuni doubles down on legacy NAS disruption with new senior appointment By Solomon KlappholzMarch 27, 2024 By George FitzmauriceMarch 27, 2024 By Solomon KlappholzMarch 27, 2024 By George FitzmauriceMarch 27, 2024 By Daniel ToddMarch 27, 2024 By Steve RangerMarch 27, 2024 By Daniel ToddMarch 27, 2024 By George FitzmauriceMarch 27, 2024 By Steve RangerMarch 26, 2024 By Solomon KlappholzMarch 26, 2024 By George FitzmauriceMarch 26, 2024 Posted Posted Posted Posted IT Pro is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}