{
    "title": "Microsoft should fix Outlook privacy issue that sends out attendees' \ndetails without consent when forwarding",
    "date": "3/29/2024",
    "url": "https://mspoweruser.com/microsoft-should-fix-outlook-privacy-issue-that-sends-out-attendees-details-without-consent-when-forwarding/",
    "text": "Follow us Share this article Improve this guide It's actually a design mistake rather than a privacy \"bug.\" 2 min. read Published on March 29, 2024 published on \n\nMarch 29, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft Outlook is one of the most popular email providers out there. Lots of organizations and businesses use it, especially now that it has Copilot AI, but there’s one thing that needs to be patched: sometimes, it sends out hidden attendees’ details when forwarding. The problem is, that whenever you forward a meeting invitation in Outlook, even when the participant list is initially hidden, the new recipient can still receive the full list of original participants. It poses an obvious privacy concern because it can expose their emails without consent. Folks online are calling it a major privacy bug and privacy flaw, but it is actually by design. You can only hide attendees’ details while creating the event. Once it’s created, you can’t hide it when you forward or send updates. Of course, it’s not an ideal situation when you have a meeting or some information that isn’t intended for “the new guy” to know who else gets the email. And in fact, that’s not the only privacy concern Outlook has been subject to in the past few weeks. Not too long ago, we reported that Proton Mail, an encrypted email service, raised concerns over Microsoft’s way of handling data collection in Outlook and how over 800 third parties have used its data for (mainly) advertising purposes, among other things. Oof. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}