{
    "title": "Findex buys Melbourne Microsoft apps firm FiveP - Finance - Services",
    "date": "3/1/2024",
    "url": "https://www.crn.com.au/news/findex-buys-melbourne-microsoft-apps-firm-fivep-605648",
    "text": "Australian financial advisory and accounting company Findex has acquired Melbourne-headquartered Microsoft Business Applications (MBA) firm FiveP for an undisclosed fee. Founded in 2013, FiveP is a Microsoft Gold Partner that offers digital products and services utilising the Microsoft 365 and Microsoft Dynamics 365 platforms, targeted at small to medium-sized businesses in Australia and New Zealand (ANZ). The acquisition is Findex's first and aims to expand its digital advisory and data science offerings to include Dynamics 365 Customer Engagement, Business Central and Power Platform services, the company said. All of FiveP's existing business applications customers and its thirteen staff will join Findex, which has in excess of 3,000 employees across more than 100 ANZ locations and serves over 250,000 clients. “We are excited to have acquired this leading MBA practice from FiveP, which is a key milestone in the delivery of our strategic plan, enhancing the end-to-end digital services offering and value for our existing portfolio of clients, especially those within the mid-market in both metropolitan and regional areas across Australia and New Zealand”, said Findex COO Julian Maloney. “This acquisition is a thrilling first for us as it will allow us to complete an end-to-end lifecycle of service offerings for our clients, allowing us to deliver advice and solutions in a complete platform-based ecosystem across the Findex footprint in Australasia from this month.” Findex said the acquisition will help its digital consulting business double in size over the next two years. It will also see FiveP's Baret messaging solution for healthcare teams transition to become a standalone business. The business will be led by current FiveP CMO Matt Krosch as CEO and CTO Jane Prowse, who will be transitioning to focus solely on Baret’s product development. “We’re excited to continue our partnership with Findex to deliver our mutual customers Microsoft 365 and Dynamics 365 solutions to link people, data and processes to unlock innovation for businesses,” said David Dennis, CEO of FiveP. “We are entering our next stage of growth in the SaaS space led by the impact that our role-based messaging solution, Baret, is delivering for health services across Australia.” FiveP said \"Baret has experienced a 619 per cent year-on-year increase in end-user adoption across its client base\" and that the solution is set for expansion into APAC and US markets. \"This acquisition by Findex highlights the high level of demand we’re seeing in Microsoft Dynamics solutions, as businesses realise that they’re sitting on an enormously valuable and underutilised asset – their data,\" said Vanessa Sorenson, partner director for Microsoft ANZ. \"Now Copilot has been added to the Dynamics suite, this brings the power of generative AI to transform that data into modern workplace tools and products we could never have dreamed of two years ago.\" “Having a champion to help businesses unlock this value across Australia and New Zealand is vital to boosting our countries’ productivity and growth, and we’re excited to support Findex in this new chapter, as they extend their digital services capabilities.” "
}