{
    "title": "Microsoft Dethrones Apple To Become The Most Valuable Company, But The \nTitle Could Be Temporary As Vision Pro Launch Nears",
    "date": "1/12/2024",
    "url": "https://wccftech.com/microsoft-dethrones-apple-to-become-worlds-most-valuable-company/",
    "text": "Apple has had great success over the past decade, earning billions that allowed it to become the world's most valuable public company by market value. However, Apple's competitors are not far behind as Microsoft beats Apple in the race as its share prices dropped by one percent. Potentially, Microsoft's top spot will be temporary as Apple is set to introduce many new additions this year. Microsoft's brief lead over Apple as the world's most valuable company is partly due to its efforts in artificial intelligence with Open AI. The company's value has improved massively since last year as it bolstered Open AI and ChatGPT. On the other hand, Apple has made little to no contributions to the field. However, the company is reportedly working on its large language models with various applications. This is not the first time Microsoft has overtaken Apple. In 2020 and 2021, Microsoft took a lead over Apple as the world's most valuable company due to supply chain shortages that affected the industry after the pandemic. This resulted in decreasing stock prices for Apple. Microsoft's remote working allowed the company to gain further relevance in the same duration. Both of these factors contributed to Microsoft's gain in stock value. Last year, Apple introduced no new iPad upgrades. The result was evident in the company's earnings call. However, 2024 will be a busy year for Apple as the company has a boatload of new products in line, which are expected to receive significant upgrades. In the first half, Apple is expected to launch the new iPad Pro models with an OLED display and M3 chip. The new iPad Pro models will potentially bolster sales as the company has planned a design refresh for the tablets. While we expect the company to launch new OLED iPad Pro models in the Spring, it is also working on launching its highly-anticipated Vision Pro headset on February 2. Industry analyst Ming-Chi Kuo recently reported that Apple's Vision Pro will be sold out instantly, which could create supply shortages. This shows the potential demand for the product and the ripple it will make in the industry. Ultimately, it will help Apple restore its title as the world's most valuable company. However, it is too early to speculate as the notions are based on speculations. It remains to be seen how the market responds to the Vision Pro, as the headset is priced at a whopping $3,499 for the base model. Due to the headset's higher price tag and low user purchasing power, the numbers could show a different story. We will update you on the latest, so stick around. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}