{
    "title": "Former Microsoft CEO Steve Ballmer is passionate about having toilets in \nhis $2 billion arena",
    "date": "1/29/2024",
    "url": "https://news.yahoo.com/tech/former-microsoft-ceo-steve-ballmer-165411388.html",
    "text": " Clippers owner Steve Ballmer is all-in while building the costliest arena in the NBA. The ex-Microsoft CEO said his Intuit Dome will cost about $2 billion to build. Since the groundbreaking in 2021, Ballmer has become obsessed with adding toilets to the facility. The new home of the Los Angeles Clippers will be outfitted with over 1,000 toilets once the arena is finished. It's all thanks to former Microsoft CEO/team owner Steve Ballmer and his obsession with toilets. The Intuit Dome is set to open later this year and it'll host the NBA All-Star Game in 2026, ESPN reported. Ballmer told Bloomberg that he's footing the over $2 billion bill to build the most expensive basketball arena later. He's taken a special interest in its bathroom facilities since ground broke on the project in 2021. \"I've become a real obsessive about toilets,\" Ballmer said that year. \"Toilets, toilets, toilets.\" The 17,500-seat arena will have a total of 1,160 urinals. \"The architects keep getting on me. You're supposed to call them 'fixtures' instead of toilets. But it's the same thing,\" Ballmer said, according to The Verge. \"We're putting a whole lot more toilets than anyone else in the NBA.\" The Intuit Dome will also sport a halo-shaped LED board equal in size to over 3,592 60-inch TVs. Ballmer has referred to the venue as \"an homage to basketball.\" Ballmer spent over 30 years at Microsoft before stepping down from the CEO position in 2014. During his time at the tech giant, he became known for his energized antics like screaming at conferences and running around on stage before presentations. The same year he left the company, Ballmer paid $2 billion to purchase the Clippers. As the owner, his meme-able moments have only continued. Now thanks to his obsession, Clippers fans won't have to worry about missing precious minutes of the game searching and waiting for the bathroom. Read the original article on Business Insider "
}