{
    "title": "How automation is transforming revenue processing at Microsoft - Inside \nTrack Blog",
    "date": "1/26/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/how-automation-is-transforming-revenue-collection-at-microsoft/",
    "text": "How Microsoft does IT Jan 26, 2024\t\t\t\t\t  |  Lukas Velush The Microsoft partner and customer network brings in more than $100 billion in revenue each year, most of the company’s earnings. Keeping tabs on the millions of annual transactions is no small task—just ask Shashi Lanka Venkata and Mark Anderson, two company employees who are leading a bid to automate what historically has been a painstakingly manual revenue transaction process. “We support close to 50 million platform actions per day,” says Venkata, a principal group engineering manager in Microsoft Digital. “For a quarter-end or a month-end, it can double. At June-end, we’re getting well more than 100 million transactions per day.” That’s a lot, especially when there cannot be any mistakes and every transaction must be processed in 24 hours. To wrangle that high-stakes volume, Venkata and Anderson, a director on Microsoft’s Business Operations team, teamed up to expand the capabilities of Customer Obsessed Solution Management and Incident Care (COSMIC), a Dynamics 365 application built to help automate Microsoft’s revenue transactions. [Learn more about COSMIC including where to find the code here: Microsoft Dynamics 365 and AI automate complex business processes and transactions.] First tested in 2017 on a small line of business, the solution expanded quickly and was handling the full $100 billion-plus workload within one year. That said, the team didn’t try to automate everything at once—it has been automating the many steps it takes to process a financial transaction one by one. “We’re now about 75 percent automated,” Anderson says. “Now we’re much faster, and the quality of our data has gone way up.” COSMIC is saving Microsoft $25 million to $30 million over the next two to three years in revenue processing cost. It also automates the rote copy-and-paste kind of work that the company’s team of 3,800 revenue processing agents used to get bogged down on, freeing them up to do higher value work. The transformation that Anderson, Venkata, and team have been driving is part of a larger digital transformation that spans all Microsoft Digital. Its success has led to a kudos from CEO Satya Nadella, a well-received presentation to the entire Microsoft Digital organization, and lots of interest from Microsoft customers. “It’s been a fantastic journey,” Anderson says. “It’s quite amazing how cutting edge this work is.” Unpacking how COSMIC works Partners transact, purchase, and engage with Microsoft in over 13 different lines of businesses, each with its own set of requirements and rules for processing revenue transactions (many of which change from country to country). To cope with all that complexity, case management and work have historically been handled separately to make it easier for human agents to stay on top of things. That had to change if COSMIC was going to be effective. “When we started, we knew we needed to bring them together into one experience,” Venkata says. Doing so would make transactions more accurate and faster, but there was more to it. “The biggest reason we wanted to bring them together is so we could get better telemetry,” he says. “Connecting all the underlying data gives us better insights, and we can use that to get the AI and machine learning we need to automate more and more of the operation.” Giving automation its due The first thing the team decided to automate was email submissions, one of the most common ways transactions get submitted to the company. “We are using machine learning to read the email and to automatically put it in the right queue,” Venkata says. “The machine learning pulls the relevant information out of the email and enters it into the right places in COSMIC.” The team also has automated sentiment analysis and language translation. What’s next? Using a bot to start mimicking the work an agent does, like automatic data entry or answering basic questions. “This is something that is currently being tested and will soon be rolled out to all our partners using COSMIC,” he says. How does it work? When a partner submits a transactional package to Microsoft, an Optical Character Recognition bot scans it, opens it, checks to see if everything looks correct, and makes sure business roles are applied correctly. “If all looks good, it automatically gets routed to the next step in the process,” Venkata says. The Dynamics workflow engine also is taking on some of the check-and-balance steps that agents used to own, like testing to see if forms have been filled out correctly and if information extracted out of those forms is correct. “Azure services handle whatever has to be done in triage or validation,” he says. “It can check to see if a submission has the right version of the document, or if a document is the correct one for a particular country. It validates various rules at each step.” All of this is possible, Venkata says, because the data was automatically abstracted. “If, at any point the automation doesn’t work, the transaction gets kicked back for manual routing,” he says. As for the agents? They are getting to shift to more valuable, strategic work. “The system is telling them what the right next action is going to be,” Venkata says. “Before this, the agent had to remember what to do next for each step. Now the system is guiding them to the next best action—each time a step is completed, the automation kicks in and walks the agent through the next action they should take.” Eventually the entire end-to-end process will be automated, and the agents will spend their time doing quality control checks and looking for ways to improve the experience. “We want to get to the point where we only need them to do higher level work,” he says. Choosing Dynamics 365 and Microsoft Azure There was lots of technology to choose from, but after a deep assessment of the options, the team chose Dynamics 365 and Microsoft Azure. “We know many people thought Dynamics couldn’t scale to an enterprise the size of Microsoft, but that’s not the case anymore,” Venkata says. “It has worked very well for us. Based on our experience, we can definitively say it can cover Microsoft’s needs.” The team also used Azure to build COSMIC—Azure Blob Storage for attachments, Azure Cosmos DB for data archival and retention, SQL Azure for reporting on data bases, and Microsoft Power BI for data reporting. Anderson says it’s a major leap forward to be using COSMIC’s automation to seamlessly route customers to the right place, handing them off from experience to experience without disrupting them. Another major improvement is how the team has gained an end-to-end view of customers (which means the company no longer must ask customers what else they’re buying from Microsoft). “It’s been a journey,” Anderson says. “It isn’t something we’ve done overnight. At times it’s been frustrating, and at times it’s been amazing. It’s almost hard to imagine how far we’ve come.”  Tags: AI and Machine Learning, Azure, Azure Cosmos DB, Azure Management, Azure SQL, business applications, Data and AI, Dynamics, Microsoft Azure, Power BI Mar 29, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tAngela Gamba The use of business applications in Microsoft Teams has become a strategic advantage for many organizations, as they can accelerate the digital transformation of all business areas, generating a high demand for the Information Technology (IT) team to make these applications available. While use of apps for Microsoft Teams can be daunting for IT Teams... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Our core system for managing our external workforce was showing its age in an increasingly demanding modern workplace environment—we needed to simplify our external staff management. Here at Microsoft, our large and diverse external, non-FTE workforce plays a vital role in our success. For us, external staff includes contractors, consultants, freelancers, and business guests who... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Microsoft runs on Microsoft technology. We are the proving ground for our products and when we say that software is enterprise-ready this means that we have already built it for and run it at scale in our own enterprise. We are in the business of building the future of technology. And more often than not,... Mar 25, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tInside Track staff Next-generation connectivity is enabling us to transform our internal enterprise network here at Microsoft. Deploying a more agile, secure, and effective network environment across Microsoft is empowering our employees to thrive in our new hybrid world. This article describes how we’re implementing this new network strategy, including goals, action areas, expected results, and a brief... Our core system for managing our external workforce was showing its age in an increasingly demanding modern workplace environment—we needed to simplify our external staff management. Here at Microsoft, our large and diverse external, non-FTE workforce plays a vital role in our success. For us, external staff includes contractors, consultants, freelancers, and business guests who...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more Microsoft runs on Microsoft technology. We are the proving ground for our products and when we say that software is enterprise-ready this means that we have already built it for and run it at scale in our own enterprise. We are in the business of building the future of technology. And more often than not,...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more Several years into the era of hybrid work, most of us are used to appearing in a Brady Bunch-style gallery. We click or tap an emoji to ask a question or applaud an achievement and still have to remember to not be “on mute” when it’s our turn to talk. Half of workers have gone...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}