{
    "title": "Microsoft Corporation (MSFT)'s Revenue Grew 12% in Q4",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/microsoft-corporation-msft-revenue-grew-052222419.html",
    "text": "Wedgewood Partners, an investment management company, released its fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, Wedgewood Composite’s net return was 11.4% compared to the Standard & Poor’s 11.7%, Russell 1000 Growth Index’s 14.2%, and Russell 1000 Value Index’s 9.5% return for the same period. Year-to-date, the fund returned 29.2% compared to 26.3%, 42.7%, and 11.5%, respectively for the indexes. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Wedgewood Partners featured stocks such as Microsoft Corporation (NASDAQ:MSFT) in its Q4 2023 investor letter. Headquartered in Redmond, Washington, Microsoft Corporation (NASDAQ:MSFT) is a multinational software company that develops, and licenses software, services, devices, and solutions.  On January 12, 2024, Microsoft Corporation (NASDAQ:MSFT) stock closed at $388.47 per share. One-month return of Microsoft Corporation (NASDAQ:MSFT) was 4.79%, and its shares gained 62.38% of their value over the last 52 weeks. Microsoft Corporation (NASDAQ:MSFT) has a market capitalization of $2.887 trillion. Wedgewood Partners stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter: “Microsoft Corporation (NASDAQ:MSFT) was a leading contributor to performance for the quarter. The Company grew revenues +12% with healthy double-digit revenue growth in its core Office 365 and +28% growth in its Azure and other cloud services businesses leading to +25% growth in operating income. Microsoft has generated quite a few headlines related to its AI investments and initiatives, this year. The Company already has a commanding hold on the productivity software market, with the segment reporting almost 50% operating margins last fiscal year, but any new AI features introduced over the course of the year could help solidify that lead.” Image by Tawanda Razika from Pixabay Microsoft Corporation (NASDAQ:MSFT) is in first position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 306 hedge fund portfolios held Microsoft Corporation (NASDAQ:MSFT) at the end of third quarter which was 300 in the previous quarter. We discussed Microsoft Corporation (NASDAQ:MSFT) in another article and shared the list of most widely held stocks by individuals. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: Billionaire Steve Cohen Aggressively Bought These 12 Stocks Recently 15 Strongest Currencies in the World in 2024 20 Best Non-Alcoholic Beers to Try in Dry January Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}