{
    "title": null,
    "date": "1/5/2024",
    "url": "https://www.investors.com/news/technology/microsoft-stock-has-these-major-catalysts-ahead-in-2024/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     A host of Wall Street analysts have put Microsoft (MSFT) stock on their lists of top stock picks for 2024. They see the software giant getting a boost from several major catalysts in the year ahead, including monetizing its artificial intelligence initiatives. The Redmond, Wash.-based company spent 2023 adding AI assistants called Copilots across its product family. That includes Copilots for its Windows operating system and Office productivity suite, as well as security and software development tools. In 2024, Microsoft will \"deliver on the hype\" and start monetizing its AI investments, Jefferies analyst Brent Thill said in a client note Friday. He lists Microsoft stock as a \"top pick\" with a buy rating and price target of 450. On the stock market today, Microsoft stock dipped a fraction to close at 367.75. Microsoft stock has formed a flat base with a buy point of 384.30, according to IBD MarketSmith charts. Generative AI applications should lead to a reacceleration of growth for Azure, Microsoft's cloud computing infrastructure service, Thill said. Meanwhile, Microsoft's Copilots should drive a \"significant revenue uplift\" in 2024, he said. Plus, Microsoft should benefit from a refresh cycle for personal computers, Thill said. The introduction of AI PCs and the scheduled end of support for Windows 10 in October 2025 will help drive new PC sales, analysts say. Microsoft wants PC users to move to its Windows 11 operating system. Elsewhere on Wall Street, BofA Securities called Microsoft stock a \"top buy\" for 2024. The investment bank sees AI driving incremental growth in Microsoft's core Azure and Office franchises. \"AI's newest wave represents a paradigm shift in corporate efficiency and productivity in line with past disruptive technologies like the personal computer and internet,\" BofA analysts said in a report Friday. The firm rates Microsoft stock as buy with a price target of 430. Mizuho Securities analyst Gregg Moskowitz on Wednesday called Microsoft stock a \"top pick\" and reiterated his buy rating and 450 price target. \"The pace of Microsoft's GenAI innovation remains stunning, and we see Microsoft as the best positioned software vendor to capitalize on this rapidly emerging technology,\" Moskowitz said in a client note. Also Wednesday, Loop Capital Markets included Microsoft stock on its \"best ideas\" list for 2024. It rates Microsoft as buy with a price target of 425. \"We believe Microsoft remains one of the best ways to play GenAI, which should also accelerate the current secular cloud workload/data migration trend and bolster the company's position in the cybersecurity market,\" Loop analyst Yun Kim said in a client note. Microsoft stock is on three IBD lists: Leaderboard, Long-Term Leaders and Tech Leaders. It also is one of the Magnificent Seven stocks. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: Does Nvidia Stock Still Have Gas In The Tank After Its Massive Rally? Apple Stock Gets Another Downgrade. Why Analysts Are Souring On iPhone Maker. 'AI Is The Story Of The Show': What To Expect From CES 2024 See Stocks On The List Of Leaders Near A Buy Point Find Winning Stocks With MarketSmith Pattern Recognition & Custom Screens 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}