{
    "title": "Microsoft Teams now supports 3D and VR meetings",
    "date": "1/24/2024",
    "url": "https://www.theverge.com/2024/1/24/24048895/microsoft-teams-microsoft-mesh-launch-vr-meetings-3d-immersive",
    "text": "By  Tom Warren, a senior editor covering Microsoft, PC gaming, console, and tech. He founded WinRumors, a site dedicated to Microsoft news, before joining The Verge in 2012. Microsoft is launching its immersive 3D meetings inside Microsoft Teams today. Microsoft Mesh, the company’s mixed reality platform, is coming out of preview and being integrated into Teams to let people gather in virtual spaces with or without a VR headset. I got to try out Mesh inside Microsoft Teams late last year, and it feels a lot like a corporate version of AltspaceVR, the social VR platform Microsoft acquired in 2017 and shut down a year ago. The 3D Mesh meetings in Teams work best with a VR headset, with Microsoft only supporting Meta’s Quest devices currently. You can participate in virtual 3D meetings, and the impressive spatial audio feature mimics the ability to have the type of private conversations you’d have in an office by moving away from other co-workers in a virtual space. The 3D environments are also customizable, with games like tossing bean bags or icebreaker questions for remote colleagues you might not have met before. All of the standard Mesh features, including immersive spaces in Teams, will be available to Microsoft Teams business plans. If you want to deploy a custom immersive space, then a Teams Premium license is required. I first used Microsoft Mesh nearly three years ago, and I said at the time it felt “like the virtual future of Microsoft Teams meetings.” While Microsoft Mesh still exists as a platform to allow developers to tap into VR / AR experiences, its integration into Teams feels like a natural step. Questions still remain over business adoption for these types of virtual meetings. Microsoft says Accenture, BP, Takeda, and Mercy Ships are all using Mesh right now, but that’s a tiny fraction of the companies that use Teams every day. The integration into Teams will help, but it already feels like Mesh is on a path to simply becoming a Teams feature rather than its own platform. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}