{
    "title": "Microsoft (MSFT) Q2 2024 earnings grow on higher revenues, beat Street view",
    "date": "1/30/2024",
    "url": "https://news.alphastreet.com/microsoft-msft-q2-2024-earnings-grow-on-higher-revenues-beat-street-view/",
    "text": "News . Data . Research Categories  AlphaGraphs, Earnings, Technology Microsoft Corp. (NASDAQ: MSFT) on Tuesday said its second-quarter 2024 earnings increased year-over-year, reflecting strong performance of the tech giant’s key operating segments. The results also beat estimates.  Second-quarter revenues came in at $62.02 billion, compared to $52.75 billion in the same period of 2023, and topped expectations. Net income increased to $21.9 billion or $2.93 per share in the December quarter from $16.4 billion or $2.20 per share in the comparable period of the previous year. Earnings also exceeded the market’s expectations. “We’ve moved from talking about AI to applying AI at scale. By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector,” said Microsoft’s CEO Satya Nadella. Listen to the conference calls as they happen. Don't miss a beat! With AlphaStreet Intelligence, you can listen to live calls and interviews as they happen, so you never have to worry about missing out on important information. Cargo giant United Parcel Service, Inc. (NYSE: UPS) ended fiscal 2023 on a weak note, reporting lower revenues and profit for the fourth quarter. The company experienced a slowdown post-pandemic Boundless Bio is preparing to debut on the Nasdaq stock market this week, and become the latest addition to the list of biotech firms that have launched IPOs this year. Sneaker giant Nike, Inc. (NYSE: NKE) has been going through a rough patch for some time, with sales coming under pressure from weak demand and rising competition. Post-pandemic, the company © 2020 AlphaStreet Inc. All Rights Reserved info@alphastreet.com 44053 Fremont Blvd,\nFremont, CA 94538 "
}