{
    "title": "Girl dumps boyfriend after getting job in Microsoft, goes on date with \ncolleague in new company",
    "date": "2/16/2024",
    "url": "https://odishatv.in/news/trending/girl-dumps-boyfriend-after-getting-job-in-microsoft-goes-on-date-with-colleague-in-new-company-227996",
    "text": "At the end, he writes, ‘Stay single bro’ and ends the chat. The chat between the two friends has started a debate on relationships these days. Girl dumps boyfriend after getting job in Microsoft Breakup and cheating are very common in relationships these days with youngsters failing to make commitments and stay true. In this digital era, it is sometimes hard to find a partner who is loyal, caring, and totally in love with you. Gone are the days when women/men would stick around with their partner through thick and thin. Everyone is just busy looking for an opportunity to cheat. Unfaithful has become the middle name of almost everyone these days. Real love and commitment are only limited to movies, dramas, and TV series. In a glaring example, a girl reportedly dumped her boyfriend after getting a job at Microsoft. Interestingly, the boyfriend had helped her prepare for interviews, and DSA and had even her resume. His chat with a friend has now been going viral on social media. The chat started after his friend asked him about his Valentine’s Day plan. In reply, the boyfriend wrote, “No plan bro. She didn’t want to continue. I have prepared her for interviews, DSA and projects together, I have even prepared her resume. She got placed at Microsoft and today she is going on a date with another Microsoft guy. I am still not placed.” At the end, he writes, ‘Stay single bro’ and ends the chat. The chat between the two friends has started a debate on relationships these days. “Shraddha from 12th Fail was only a movie character, so be careful,” a user commented. Another user wrote, “First they use you till they get success and then will leave you at your lowest.” “Hence it is proved that Aurat hamesha behtar ki talash main hin rehti hai,” commented a third user. Copyright © 2024 - Odisha Television Limited All Rights Reserved. "
}