{
    "title": "EU says iMessage, Bing and Edge do not qualify as 'gatekeepers'",
    "date": "2/13/2024",
    "url": "https://www.siliconrepublic.com/business/eu-dma-gatekeepers-imessage-bing-edge-apple-microsoft",
    "text": "by Vish Gain 13 Feb 2024 Image: © ChenPG/Stock.adobe.com Following arguments raised last year by both Apple and Microsoft, an EU investigation has concluded that some of these services do not fall under the ambit of the DMA. The EU has closed investigations into some Apple and Microsoft “core” services to determine whether they qualify as gatekeepers as per the Digital Markets Act (DMA). In an update today (13 February), the European Commission said that following its investigations it has decided not to designate Apple messaging service iMessage as well as Microsoft’s search engine Bing, web browser Edge and online ad service as gatekeepers. According to the DMA, a gatekeeper is a company that has had an annual turnover in Europe of at least €7.5bn in the last three years or market value of at least €75bn in its last financial year and operations in at least three member states. A company must also have served more than 45m monthly active users and more than 10,000 yearly active business users in the EU during the last three years on several core platform services, such as search engines, social networking services and operating systems. Under the DMA, gatekeepers will no longer be able to favour their own products and services and their messaging apps will have to work with other services. Violation of the rules could result in fines of up to 10pc of annual global turnover and up to 20pc in cases of repeated infringements. When the EU first designated gatekeepers in September, it opened four market investigations to assess submissions from Microsoft and Apple, which argued that Bing, Edge, Microsoft Advertising and iMessage do not qualify despite meeting thresholds. “In its decision of 5 September 2023, the Commission considered that the rebuttal requests made by Apple and Microsoft deserved an in-depth analysis,” it wrote today. “Following a thorough assessment of all arguments, taking into account input by relevant stakeholders, and after hearing the Digital Markets Advisory committee, the Commission found that iMessage, Bing, Edge and Microsoft Advertising do not qualify as gatekeeper services.” Microsoft argued at the time that Bing’s relatively small share of the search market compared to Google could only be further diminished if it is compelled to offer users access to rival search engines. Meanwhile, Apple argued that iMessage does not meet the DMA user threshold of 45m active monthly users and therefore should not have to interoperate with other messaging services. “The Commission will continue to monitor the developments on the market with respect to these services, should any substantial changes arise,” it stated today. “The decisions do not affect in any way the designation of Apple and Microsoft as gatekeepers on 5 September 2023 as regards their other core platform services.” Find out how emerging tech trends are transforming tomorrow with our new podcast, Future Human: The Series. Listen now on Spotify, on Apple or wherever you get your podcasts. Related:\n                    messaging,             legal,             Bing,             Apple,             Europe,             advertising,             Microsoft,             EU,             browsers Vish Gain is a journalist with Silicon Republic editorial@siliconrepublic.com 6 Mar 2024 8 Mar 2024 22 Mar 2024 5 days ago 21 Mar 2024 14 Mar 2024 19 hours ago 20 hours ago 21 hours ago 21 hours ago 23 hours ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}