{
    "title": "Yes, Microsoft is a star AI stock, but this is what really powered its \nsolid second-quarter results",
    "date": "2/1/2024",
    "url": "https://www.fool.com.au/2024/02/01/yes-microsoft-is-a-star-ai-stock-but-this-is-what-really-powered-its-solid-second-quarter-results-usfeed/",
    "text": " Access all of your premium services in our Member Centre Click here to learn more about our premium services TO MAKE THE WORLD\nSMARTER, HAPPIER, AND RICHER. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services. Deep involvement with artificial intelligence (AI) has made the company popular with investors, but that isn't (yet) the top motor of its growth. Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More This article was originally published on Fool.com. All figures quoted in US dollars unless otherwise stated. The rage for artificial intelligence (AI) stocks is showing no signs of cooling off. That's why Microsoft (NASDAQ: MSFT) management made sure to mention AI tech prominently in both the press release and during the conference call detailing its fiscal second quarter of 2024 earnings. Those results, divulged just after market hours on Tuesday, beat analyst estimates and featured some impressive numbers. And while AI certainly played a part in that, it was actually another set of offerings from the tech giant that really gave its quarter some muscle. Microsoft's second frame of the fiscal year saw the company book slightly over $62 billion in revenue, which was a sturdy 18% improvement over the same quarter of fiscal 2023 and topped the company's guidance of $60 billion to $61 billion. Not to be outdone, non-GAAP (adjusted) net income advanced by 26% year over year to hit nearly $22 billion ($2.93 per share). Analyst expectations for the quarter were relatively modest. On average, they were expecting the tech giant to earn slightly over $61 billion on the top line, and post a per-share, adjusted net income figure of $2.78. Microsoft posted estimate-beating quarters throughout calendar 2023, but the rise in its shares was due more to its association with top AI app developer OpenAI. Microsoft is a major investor in -- and partner of -- the company, which is the entity behind the popular ChatGPT app. Microsoft has assertively incorporated OpenAI functionalities into more than a few of its offerings, including the Office software suite. In the earnings release, the only quote Microsoft attributed to its CEO Satya Nadella was about, yes, AI. The company's leader briefly enthused about the technology, saying that by applying it at scale, it's helping to gain new clients and improve productivity throughout its operations. What didn't get as much attention, and probably should have, was Microsoft's cloud computing products and services. The company is the No. 2 provider of such offerings -- behind Amazon's mighty Amazon Web Services (AWS) -- and is doing well in drawing fresh revenue from this source. During the quarter, the company's Intelligent Cloud business segment saw its revenue balloon by 20% year over year to nearly $26 billion. Inside that grouping, the still-hot Azure and other cloud services saw their collective take rise at a 30% clip, outpacing the analyst expectations of under 28%. Even if AI -- still a relatively young technology -- wasn't a mighty driver of Microsoft's growth for the quarter, it still made a difference. The company said it now has about 53,000 clients for Azure AI, its anchor cloud-based AI platform. Nadella said that one-third of that figure comprises customers new to Azure within the past year. This portends very well for Microsoft's future. However, judging by the market's rather tepid reaction to the quarterly results -- the stock was trading slightly down after hours as of this writing -- investors haven't yet fully considered this potential. So even though the company's shares zoomed higher in 2023, in this year and beyond, they can certainly hit even loftier heights. This article was originally published on Fool.com. All figures quoted in US dollars unless otherwise stated. Eric Volkman has no position in any of the stocks mentioned. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Microsoft. The Motley Fool Australia has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy. This article contains general investment advice only (under AFSL 400691). Authorised by Scott Phillips. March 19, 2024 |\n        Jeremy Bowman Buying Nvidia when the disruptive AI chatbot launched would have been a smart move. Read more » March 19, 2024 |\n        Jeremy Bowman Investors were encouraged by news of a price hike on the Model Y. Read more » March 16, 2024 |\n        Keithen Drury Nvidia last split its stock when it traded for a pre-split $744 in 2021. Read more » March 14, 2024 |\n        Howard Smith Tesla is no longer a magnificent stock, according to a Wells Fargo analyst. Read more » March 14, 2024 |\n        Dani Cook The company's stock could rise 40% over the next two years and outperform the S&P 500. Read more » March 13, 2024 |\n        Will Healy Nvidia stock has split five previous times in the company's history. Read more » March 13, 2024 |\n        Danny Vena Nvidia stock has gained nearly 300% over the past year. Can investors still profit from this AI stock? Read more » March 12, 2024 |\n        Tristan Harrison This stock has rocketed higher. How do we get access to it? Read more » View All Sign Up for Take Stock\nInvestment news, stock ideas, and more, straight to your inbox. Get Started Investing\nYou can do it. Learn about investing with our Investing Education hub. Win at Retirement\nOur latest articles and strategies for the post-work life you want. Listen to Our Podcast\nHear our experts take on shares, the market & how to invest. Join Our Premium Community\nJoin our flagship membership service, Share Advisor. The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service.  Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. The Motley Fool launched its Australian presence in 2011, and since then has grown to reach over 1 million Australians. Read more about us >  This Service provides only general, and not personalised financial advice, and has not taken your personal circumstances into account. The Motley Fool Australia operates under AFSL 400691. For more information please see our Financial Services Guide. Please remember that investments can go up and down. Past performance is not necessarily indicative of future returns. The Motley Fool Australia does not guarantee the performance of, or returns on any investment. We respectfully acknowledge the Traditional Custodians of the land where we live and work and pay our respects to all Elders, past and present, of all Aboriginal and Torres Strait Islander nations. © 2010 - 2023 The Motley Fool Australia Pty Ltd. All rights reserved. ACN: 146 988 052 Australian Financial Services Licence (AFSL): 400691 The Motley Fool Australia, PO Box 104, Isle of Capri, Qld 4217 Contact Details:\nPhone: (03) 8592 4841\nEmail: [email protected]\nOur friendly customer service team will happily get back to you as soon as they can. Notifications Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! "
}