{
    "title": "Microsoft is apparently extending Teams Classic app. Who would've thought?",
    "date": "2/26/2024",
    "url": "https://mspoweruser.com/microsoft-is-apparently-extending-teams-classic-app-who-wouldve-thought/",
    "text": "Follow us Share this article Improve this guide Microsoft has been going all out in promoting the new Teams app 2 min. read Published on February 26, 2024 published on \n\nFebruary 26, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft has been going all out in promoting the new Teams app and even goes as far as saying that it’s so much lighter and faster, yet more energy and cost-efficient. But, in a rather surprising news, Microsoft is apparently extending Teams Classic app. The Redmond-based tech giant has quietly confirmed an extension (MC718748) for the Teams Classic app, allowing Commercial and Educational users who haven’t finished their transition. This news comes amidst the ongoing rollout of the new Teams client, initially slated for mandatory adoption by the end of March 2024. However, Microsoft seems to be acknowledging user feedback and their the need for additional time for some organizations to complete the transition. Now, if you still face issues meeting requirements for the new Teams, you won’t be blocked from using Teams Classic until at least July 1, 2024. “This will give admins more time to address any issues encountered during this process,” Microsoft says. With over 300 million active users, Microsoft Teams is still one of the most popular collaboration apps around. But now, with the introduction of the Copilot AI tool that’s exclusively available through the Copilot for Microsoft 365 subscription plan, it wouldn’t be surprising to see more numbers coming in the next months. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}