{
    "title": "Microsoft's Phil Spencer talks about industry-wide gaming layoffs",
    "date": "2/15/2024",
    "url": "https://venturebeat.com/games/microsofts-phil-spencer-talks-about-industry-wide-gaming-layoffs/",
    "text": "Are you looking to showcase your brand in front of the gaming industry’s top leaders? Learn more about GamesBeat Summit sponsorship opportunities here.  In the wake of 1,900 layoffs at Microsoft’s game businesses and more layoffs across the industry, Phil Spencer offered his thoughts on the Xbox business update today. Spencer has been on the Xbox leadership team for over 20 years, and he said he wants Xbox to be in the best position for the next 20 years. That’s the motivation behind putting titles on Xbox Game Pass, the subscription service. He noted that 2023 was an “incredible year for gaming.” As for the signals behind the scenes, he noted how the game industry didn’t grow. “And what happens when an industry doesn’t grow?” Spencer asked. “You end up with some job eliminations which we had with even our own hard decisions to make about building a sustainable business for ourselves. But in no way were we alone in that. When you think about a healthy industry, I want players who believe that they will find the best games on the platforms that they love. I want people who invest their careers and working here to feel like this is a place that they can be successful. And that really is down to be part of an industry that is growing.” GamesBeat Summit Call for Speakers We’re thrilled to open our call for speakers to our flagship event, GamesBeat Summit 2024 hosted in Los Angeles, where we will explore the theme of “Resilience and Adaption”. He noted he listens to Lisa Su, AMD CEO, “she’ll say that AMD-powered consoles are likely to decline in 2024. I think there’s an amazing set of games coming in 2024. But if we don’t get to growing as an industry, the industry will struggle. And today there’s really two choices on how do you grow the industry. Do you say have a fixed number of players, the players that we have today? And do I find new ways to monetize those players to get more money from the players that I have? Or do you think about how do I expand the business I have by finding new players and adding those to the base of players that already played.” He added, “Our focus on Xbox for the last decade has really been on that latter point of how do we make sure Xbox is growing, growing for our players growing for our creators. So those people are finding success on our platform which will grow the Xbox business and put Xbox in a position to be very strong for years and decades to come.” He noted it is Xbox’s responsibility as a hardware maker to responsibly support the growth of gaming communities. GB Daily\nStay in the know! Get the latest news in your inbox daily\n\n\n\n\n Subscribe\n\nBy subscribing, you agree to VentureBeat's Terms of Service.\n\n\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\nAn error occured. Stay in the know! Get the latest news in your inbox daily By subscribing, you agree to VentureBeat's Terms of Service. Thanks for subscribing. Check out more VB newsletters here. An error occured. Enjoy access to special events, private newsletters and more. © 2024 VentureBeat. All rights reserved. "
}