{
    "title": "From PCs to AI - Satya Nadella's 10 years at Microsoft's helm- Republic \nWorld",
    "date": "2/25/2024",
    "url": "https://www.republicworld.com/tech/artificial-intelligence/from-pcs-to-ai-satya-nadellas-10-years-at-microsoft-s-helm/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated February 25th, 2024 at 17:42 IST The Indian-origin CEO of the most valued company held leadership roles in both enterprise and consumer businesses Hyderabad to Washington: Microsoft’s Indian origin CEO Satya Nadella has completed 10 years at the firm, pioneering revolution from Personal Computers to Artificial Intelligence. Washington-headquartered Microsoft, which was founded in 1975 by Bill Gates, is not only the  largest personal-computer software company in the world but also the most-valued, after Apple. Nadella joined Microsoft in 1992. A bachelors in electrical engineering from Manipal Institute of Technology, the Hyderabad-born went on to earn a Master’s degree in computer science from the University of Wisconsin – Milwaukee and parallelly an MBA degree from the University of Chicago while he was working in Microsoft in 1997.Nadella started work on developing Windows NT, an operating system for business users, according to Britannica. In 1999, Nadella was named vice president of the Microsoft bCentral small-business service. Two years hence, he bagged a place as the corporate vice president of Microsoft Business Solutions. After six years in 2007, Nadella became the senior vice president of research and development for Microsoft’s online services division.His stints also include helming charge of the company’s cloud computing platform, Microsoft Azure. According to Microsoft, 95 per cent of Fortune 500 companies rely on Azure for trusted cloud services, with companies of all sizes and maturities using Azure in their digital transformation. In 2014, Nadella replaced Steve Ballmer as Microsoft CEO. He was the third person after Bill Gates and Ballmer to hold charge of the company. His immediate challenge upon joining Microsoft was the $7.2 billion acquisition Microsoft made into Nokia Corp’s mobile-device business. The period was marred with layoffs, announced by Nadella, where 18,000 positions were eliminated. This period also saw the acquisition of job-oriented social network LinkedIn, which was acquired by Microsoft for $26.2 billion in 2016. Ushering the era of generative technologies, Microsoft became the first company to partner with OpenAI for integrating ChatGPT in its search engine Bing, which saw a sharp spike in its user base. “We’ve moved from talking about AI to applying AI at scale,” Nadella was quoted as saying in an investors relationship call. “By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector,” he added.The CEO was in India in early February to focus on AI opportunities in the country. Highlighting opportunities for an AI-powered India to accelerate growth and development, he announced that Microsoft will provide 2 million people in India with AI skilling opportunities by 2025. Published February 25th, 2024 at 17:42 IST Send us your views, we’ll publish them. This section is moderated. UP: Portion of Under-Construction Bridge Collapses in Bulandshahr Upset Over Relationship Issues, B.Tech Student Dies by Suicide in Noida Daughter-in-Law of Former Lok Sabha Speaker Shivraj Patil Joins BJP Google's timeline for RCS support on iPhone Han So Hee-Ryu Jun Yeol Call It Quits Within Two Weeks Amid Controversy Zodiac Signs That Are Born To Be Rebels And Challenge The Status Quo 'Received I-T Notice Last Night', Claims DK Shivakumar AAP's Bharadwaj, Atishi to Address Press Conference at Noon Today | LIVE BTech Graduate from Jodhpur Held for Stealing Laptops From PGs in B'luru Elderly Woman Touches Pilot's Feet On A Flight To Ayodhya, Video Viral © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}