{
    "title": "Microsoft invests $2.1 billion in Spanish AI infrastructure",
    "date": "2/21/2024",
    "url": "https://totaltele.com/microsoft-invests-2-1-billion-in-spanish-ai-infrastructure/",
    "text": "Select Page Posted by Georgia Sweeting | Feb 21, 2024 | Investment, TECHNOLOGY, COMPANY NEWS, AI, Cloud, Security, Europe, News Microsoft has announced that it will invest $2.1 billion in its Spanish AI and Cloud infrastructure over the next two years. The company will open a Cloud Region of data centers in Madrid, as well as a data centre campus in Aragon (Northeastern Spain). These deployments, the company says, will provide “Microsoft’s cloud services with the maximum guarantee of security, privacy and data sovereignty, and will make the company’s entire range of Artificial Intelligence solutions available to Spanish and European companies and public administrations”. “Our investment is beyond just building data centres, it’s a testament to our 37-year commitment to Spain, its security, and development and digital transformation of its government, businesses, and people,” said Microsoft Chair and President Brad Smith said on X, following a meeting with the Spanish Prime Minister, Pedro Sanchez. This investment is part of a newly established collaboration between Microsoft and the Spanish government, in which the two parties will work on the application of Responsible Artificial Intelligence in the improvement of citizen services, the promotion of AI-based innovation, and the reinforcement of national cybersecurity of Spanish companies, public bodies, and critical infrastructure. Microsoft argues that the investment in Spain could add €8.4 billion to the Spanish national GDP, creating 69,000 jobs up to 2030. The news follows Microsoft’s announcement last week to spend €3.3 billion on data centre capacity and AI in Germany by the end of 2025, which will double the country’s AI infrastructure and cloud computing capacity. Microsoft have also recently invested in the UK, pledging £2.5 billion over the next three years in data centre infrastructure. The investment, which will include new sites in London and Cardiff, will see Microsoft double the number of its data centres in the UK. Prime Minister Rishi Sunak called the investment a “turning point for the future of AI infrastructure and development in the UK,” in a statement. Keep up to date with the latest international telecoms news by subscribing to the Total Telecom daily newsletter Also in the news:\nAqua Comms CEO jumps ship to EXA Infrastructure\nMillicom expands partnership with Harmonic in Latin America\nEuropean Commission approves Orange–MásMóvil merger More on this topic: Share: May 31, 2017 December 21, 2017 November 6, 2017 May 22, 2017  Subscribe for top news, trends, and exclusive discounts on our events  Email: info@totaltele.com\nTelephone: +44 (0) 20 7092 1000 Home Media information About us Contact us Privacy  Newsletter Events Video Post a press release Facebook X LinkedIn YouTube "
}