{
    "title": "The Zacks Analyst Blog Highlights Microsoft, Exxon Mobil, Toyota Motor, \nChipotle Mexican Grill and Carrier Global",
    "date": "2/9/2024",
    "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-microsoft-110000225.html",
    "text": "Chicago, IL – February 9, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Microsoft Corp. MSFT, Exxon Mobil Corp. XOM, Toyota Motor Corp. TM, Chipotle Mexican Grill, Inc. CMG and Carrier Global Corp. CARR. The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corp., Exxon Mobil Corp. and Toyota Motor Corp. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Microsoft shares have outperformed the Zacks Computer - Software industry over the past year (+58.5% vs. +54.0%). The company is riding on strong growth from Intelligent Cloud and Productivity and Business Processes. Intelligent Cloud revenues have been driven by growth in Azure and other cloud services.Productivity and Business Processes revenues continues to increase due to strong adoption of Office 365 Commercial solutions. Continued momentum in the small and medium businesses and frontline worker offerings, as well as gain in revenue per user drove top-line growth.However, More Personal Computing revenues are suffering from continued weakness in Windows and Devices businesses. Steady performance in Talent Solutions aided LinkedIn revenues. Also, declining gaming revenues has been a headwind. Increasing spend on Azure enhancements amid stiff competition in the cloud space remains a concern.(You can read the full research report on Microsoft here >>>)Shares of Exxon Mobil have underperformed the Zacks Oil and Gas - Integrated - International industry over the past year (-7.5% vs. -3.5%). The company is lagging its peers when it comes to shareholders’ returns. The energy giant’s financials were weakened by years-long significant spending on low-return developments and the coronavirus pandemic. Also, high input cost is hurting refining operations.Nevertheless, ExxonMobil's bellwether status and an optimal integrated capital structure that has historically produced industry-leading returns make it a relatively lower-risk energy sector play. In Stabroek Block, located offshore Guyana, ExxonMobil has made many major discoveries that significantly improve its production outlook.The advantaged growth projects of Guyana have lower greenhouse gas intensity than most of the oil and gas-producing resources across the globe. ExxonMobil’s deal to acquire Pioneer Natural will bolster its presence in the prolific Permian Basin.(You can read the full research report on Exxon Mobil here >>>)Toyota Motor’s shares have outperformed the Zacks Automotive - Foreign industry over the past year (+56.5% vs. +38.2%). The company’s continued demand for vehicles and a robust lineup of trucks and sport utility vehicles are set to fuel Toyota’s sales volumes.The Japanese auto giant aims to generate 40% of its global sales from electric vehicles by 2025 and 70% by 2030. It plans to invest 4 trillion yen ($35 billion) for a lineup of 30 battery electric vehicles by 2030. For fiscal 2024, Toyota projects vehicle sales of 9.6 million units, indicating an increase from 8.82 million units sold in fiscal 2023. Its investor-friendly moves also spark optimism.However, commodity cost inflation is expected to continue to weigh on the company’s margins. High capex and R&D expenses on the development of electric and autonomous vehicles are likely to dent its near-term margins and cash flows. The stock warrants a cautious stance at present.(You can read the full research report on Toyota Motor here >>>)Other noteworthy reports we are featuring today include Chipotle Mexican Grill, Inc. and Carrier Global Corp. Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report Toyota Motor Corporation (TM) : Free Stock Analysis Report Exxon Mobil Corporation (XOM) : Free Stock Analysis Report Chipotle Mexican Grill, Inc. (CMG) : Free Stock Analysis Report Carrier Global Corporation (CARR) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}