{
    "title": "Microsoft pets NVIDIA on the back and pushes its new AI chips and \ninfrastructure at NVIDIA GTC",
    "date": "2/23/2024",
    "url": "https://windowsreport.com/microsoft-pets-nvidia-on-the-back-and-pushes-its-new-ai-chips-and-infrastructure-at-nvidia-gtc/",
    "text": "Follow us Share this article Latest news NVIDIA GTC is where Microsoft will show off all their AI business infrastructure 2 min. read Published on February 23, 2024 published on \n\nFebruary 23, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more The Redmond giant unveiled their new Maia AI-infused chips at Microsoft Ignite and just showed of a new partnership with NVIDIA to create network hardware. Now, Microsoft invites business leaders to join the NVIDIA GTC AI Conference on March 18-21 to discover all the cutting-edge Azure AI services and supercomputing infrastructure. First, Microsoft reiterates Satya Nadella’s message about AI empowering businesses and pushing growth in any organization operation. However, another purpose of this event is to show everyone that they stand by their partnership with NVIDIA. According to Microsoft’s announcement, here are the main goals of the NVIDIA GTC event: Apart from Copilot and Azure AI services, Microsoft will also be talking about their new custom-designed chips, Azure Maia 100 and Azure Cobalt 100, but also the NVIDIA H100 and H200 Tensor Core GPUs customized for the Azure virtual machines. They don’t leave behind the NVIDIA AI foundry service on Azure that was designed to tune custom generative AI applications for enterprises. If you will attend NVIDIA GTC, you will also benefit from some hands-on training with NVIDIA specialists to get a real feel of the new GPU-accelerated servers: Microsoft is proud to host NVIDIA Hands-On Training at GTC. Attend full-day, hands-on, instructor-led workshops offered onsite and virtually. Participants will have access to a fully-configured GPU-accelerated server in the cloud and the chance to earn an NVIDIA certificate of subject matter competency. However, the main focus will be on Microsoft’s Azure AI Studio which is now in the preview stage. The Redmond giant wants to turn it into a great platform for enterprises to deploy AI solutions for their businesses. Will you attend NVIDIA GTC? Let’s talk about this topic in the comments section below. More about the topics: AI, business, microsoft, nvidia Claudiu Andone Windows Toubleshooting Expert Oldtimer in the tech and science press, Claudiu is focused on whatever comes new from Microsoft.\nHis abrupt interest in computers started when he saw the first Home Computer as a kid. However, his passion for Windows and everything related became obvious when he became a sys admin in a computer science high school.\nWith 14 years of experience in writing about everything there is to know about science and technology, Claudiu also likes rock music, chilling in the garden, and Star Wars. May the force be with you, always! Claudiu Andone Windows Toubleshooting Expert Oldtimer in the tech and science press, with 14 years of experience in writing on everything there is to know about science, technology, and Microsoft Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}