{
    "title": "Elon Musk Sues OpenAl For Partnering With Microsoft",
    "date": "3/1/2024",
    "url": "https://technomag.co.zw/elon-musk-sues-openal-for-partnering-with-microsof/",
    "text": " Elon Musk is suing OpenAI and its CEO Sam Altman, saying the company behind ChatGPT has diverged from its original, nonprofit mission by partnering with Microsoft for $13 billion and keeping its code for its newest generative AI products a secret. Musk, who co-founded OpenAI in 2015, has since left and has formed his own AI company, xAI. His complaint, filed Thursday in California state court, said that the company and its partnership with Microsoft violated OpenAI’s founding charter, representing a breach of contract. Musk is asking for a jury trial and for the company, Altman and co-founder Greg Brockman to pay back the profit they received from the business. OpenAI was founded as a check on what the founders believed was a serious threat of artificial generative intelligence, or AGI, posed to humanity. The company created a board of overseers to review any product the company created and its products’ code was made public. But Altman, Brockman and Chief Scientist Ilya Sutskever in 2019 formed OpenAI LP, a for-profit entity that exists within the larger company’s structure. That for-profit company took OpenAI from worthless to a valuation of $90 billion in just a few years — and Altman is largely credited as the mastermind of that plan and the key to the company’s success. The lawsuit also cites a high-profile leadership crisis last year that led to Altman’s temporary ouster from the company, apparently over concerns by several board members about the risks of artificial intelligence. After days of uncertainty and an intervention by Microsoft, Altman was restored to his position in what industry analysts said was a victory for those seeking to commercialize AI technology. The lawsuit repeats that claim. “The public is still in the dark regarding what exactly the Board’s ‘deliberative review process’ revealed that resulted in the initial firing of Mr. Altman,” the complaint said. “However, one thing is clear to Mr. Musk and the public at large: OpenAI has abandoned its ‘irrevocable’ non-profit mission in the pursuit of profit.” Although Microsoft — which has invested billions of dollars into OpenAI and which has a close partnership with the startup — is not named as a defendant in Musk’s suit, the tech giant appears 68 times in the complaint. Much of the lawsuit takes issue with Microsoft’s apparent influence over OpenAI and Microsoft’s economic position. Musk has previously threatened to sue Microsoft and accused it of stealing content from X, Musk’s social media company, to train Microsoft AI tools. “OpenAI, Inc. has been transformed into a closed-source de facto subsidiary of the largest technology company in the world: Microsoft,” Thursday’s lawsuit said. “Under its new Board, it is not just developing but is actually refining an AGI to maximize profits for Microsoft.” Musk, the Tesla and SpaceX CEO, left OpenAI in 2018. He has continued to speak out against the dangers of artificial intelligence. In the complaint, he framed the current OpenAI leaders as greedy. “Where some like Mr. Musk sees an existential threat in AGI, others see AGI as a source of profit and power,” the complaint stated. This story has been updated with additional context from the complaint. Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  Δ Enter your email to receive our newsletter.   Username Password Lost your password? Enter your email to receive our newsletter.   "
}