{
    "title": "Microsoft hires influential AI figure Mustafa Suleyman to head up consumer \nAI business",
    "date": "3/22/2024",
    "url": "https://www.journalgazette.net/business/microsoft-hires-influential-ai-figure-mustafa-suleyman-to-head-up-consumer-ai-business/article_466143f9-2214-50ce-9f54-40acf5f8ad35.html",
    "text": "     LONDON – Microsoft has hired Mustafa Suleyman to head up its consumer artificial intelligence business, adding another influential figure to its pool of talent leading the charge to build a technology that Suleyman views as both as a boon and threat to humanity. Suleyman, co-founder of AI research lab DeepMind, said in a LinkedIn post this week that he’ll become CEO of Microsoft AI, leading all the company’s consumer AI products and research, including its generative AI service Copilot as well as its Bing search engine and Edge browser. Microsoft is also hiring the chief scientist at Suleyman’s AI company, Inflection, and several of its top engineers and researchers, Microsoft CEO Satya Nadella said in a blog post. The hirings will likely bolster Microsoft’s lead role in the AI industry. Microsoft has teamed with ChatGPT maker OpenAI, investing billions in the San Francisco company, and recently partnered with France’s Mistral, a hot AI startup. Suleyman co-founded the DeepMind AI research lab, which Google purchased in 2014, and worked there until 2022, when he left to set up Inflection.ai with LinkedIn co-founder Reid Hoffman in an effort to create AI that won’t veer into racist, sexist or violent behavior. He also co-wrote a book, “The Coming Wave,” that examines AI’s promise and the need to limit its potential perils. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}