{
    "title": "Hovnanian Enterprises (NYSE:HOV) Stock Price Up 4.9%",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-hov-percent-advance-2024-03-19/",
    "text": "Hovnanian Enterprises, Inc. (NYSE:HOV - Get Free Report)'s stock price traded up 4.9% during mid-day trading on Tuesday . The company traded as high as $140.78 and last traded at $140.78. 39,196 shares changed hands during trading, a decline of 55% from the average session volume of 86,469 shares. The stock had previously closed at $134.20. HOV has been the topic of a number of research reports. TheStreet upgraded shares of Hovnanian Enterprises from a \"c+\" rating to a \"b-\" rating in a research report on Friday, February 16th. StockNews.com downgraded shares of Hovnanian Enterprises from a \"buy\" rating to a \"hold\" rating in a research report on Sunday, March 3rd. Get Our Latest Research Report on HOV The firm has a 50 day simple moving average of $155.68 and a two-hundred day simple moving average of $124.23. The company has a market capitalization of $886.03 million, a PE ratio of 5.14 and a beta of 2.61. The company has a current ratio of 4.07, a quick ratio of 0.86 and a debt-to-equity ratio of 2.19. Hovnanian Enterprises (NYSE:HOV - Get Free Report) last posted its quarterly earnings data on Thursday, February 22nd. The construction company reported $2.75 earnings per share for the quarter. The firm had revenue of $594.20 million for the quarter. Hovnanian Enterprises had a net margin of 7.45% and a return on equity of 58.22%. In other Hovnanian Enterprises news, Director Vincent Pagano, Jr. sold 3,862 shares of the business's stock in a transaction on Wednesday, December 20th. The shares were sold at an average price of $154.59, for a total transaction of $597,026.58. Following the sale, the director now directly owns 30,051 shares in the company, valued at approximately $4,645,584.09. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. Company insiders own 17.67% of the company's stock. Several institutional investors and hedge funds have recently made changes to their positions in the stock. Dimensional Fund Advisors LP lifted its stake in shares of Hovnanian Enterprises by 85.0% during the 1st quarter. Dimensional Fund Advisors LP now owns 142,642 shares of the construction company's stock worth $9,676,000 after purchasing an additional 65,519 shares during the period. Renaissance Technologies LLC raised its position in shares of Hovnanian Enterprises by 15.3% in the 2nd quarter. Renaissance Technologies LLC now owns 261,715 shares of the construction company's stock worth $11,199,000 after buying an additional 34,810 shares during the period. Norges Bank acquired a new stake in Hovnanian Enterprises during the fourth quarter worth about $1,435,000. BlackRock Inc. raised its holdings in Hovnanian Enterprises by 9.9% in the second quarter. BlackRock Inc. now owns 331,716 shares of the construction company's stock valued at $32,910,000 after buying an additional 29,938 shares during the period. Finally, Arrowstreet Capital Limited Partnership purchased a new position in shares of Hovnanian Enterprises in the 4th quarter valued at $1,086,000. 60.97% of the stock is currently owned by hedge funds and other institutional investors. Hovnanian Enterprises, Inc, through its subsidiaries, designs, constructs, markets, and sells residential homes in the United States. It offers single-family detached homes, attached townhomes and condominiums, urban infill, and active lifestyle homes with amenities, such as clubhouses, swimming pools, tennis courts, tot lots, and open areas.Featured StoriesFive stocks we like better than Hovnanian EnterprisesHow to buy stock: A step-by-step guide for beginners Growing Twice as Fast as Tesla, XPeng is a BuyThere Are Different Types of Stock To Invest In4 Stocks Building Long-Term Value for Shareholders 3 Stocks to Protect Your Portfolio from the Coronavirus Contagion FedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount Before you consider Hovnanian Enterprises, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Hovnanian Enterprises wasn't on the list. While Hovnanian Enterprises currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat has just released its list of 20 stocks that Wall Street analysts hate. These companies may appear to have good fundamentals, but top analysts smell something seriously rotten. Are any of these companies lurking around your portfolio? Find out by clicking the link below. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}