{
    "title": "Windows 10 technical preview first look: Start Menu returns | IT Business \nVideo",
    "date": "3/28/2024",
    "url": "https://www.itbusiness.ca/video/windows-10-technical-preview-first-look-start-menu-returns/",
    "text": "Technicity Satellite SeriesJoin us on March 6, 2024 for an exclusive, interactive virtual experience After the Microsoft keynote with CEO Satya Nadella at the Gartner Symposium 2015 ITExpo, we set out in search of a Windows 10 demo. We managed to get an inside view of Windows 10 from a product manager who did a great demo for us. We video recorded the whole demo and after some negotiation with the powers that be, we were allowed to release this very early demo of Windows 10.  At least as long as we warn you that a lot can change between now and the final build. We can also tell you that there is a program that you can join if you want to give some feedback on this, but Microsoft is looking for power users who can devote the time and have a second machine to work on. With that caveat, here’s our sneak peek at Windows 10. ORLANDO – We managed to get this look at Windows 10 and permission to show it to ITBusiness.ca readers.  We can even mention the “insider program” where Microsoft is looking for feedback from sophisticated users.  This was no small feat.  What we couldn’t do was get an answer to the main question that we talked about. “What happened to Windows 9? Did we sleep through it?” That mystery aside, we were thrilled to get a look at the interface that will drive Windows 10. I’m a confessed mainly Mac user for my day to day work. I went running to Mac after Vista. But I confess that I’ve been lured by the Surface interface and intrigued by Windows 8. In my Windows machines, I’ve only very recently given up on XP – which I loved as an operating system. I’m not a luddite. I work on a number of platforms from Linux to Android on mobile. But while I could do enough to keep up on Windows as a work exercise – I didn’t picture that I’d ever do another honest day’s work on a Windows machine – despite the fact that I’ve been a Windows user since the first version of Windows. Today that might have changed. In the demo interface that we saw – Microsoft has got it right. The Windows 10 interface is more friendly, more intuitive and if the early reports are true – more easy to install than many of the past versions we’ve all endured. Right from the Start (pun intended) Microsoft has done the unthinkable. It has swallowed its pride and really listened to its audience. Microsoft has restored a number of features that we’ve all known and used for years. If you are as old as me, you remember when Windows 95 introduced the Start button. We laughed at it then because of its incongruity – Start was how you stopped the system to shut it down. But over the years we came to understand and count on these features. When Windows XP came around, many of us loved it. It was elegant, to some degree intuitive and where it was not, we all had enough history to learn the new commands. In Vista, Windows 7 and other failed attempts at advancing the interface, Microsoft abandoned these key elements and replaced them with confusing and difficult user interface controls. These had only one thing in common – they were difficult to understand and hard to use. In one fell swoop, Microsoft has done a 180 degree turn and restored the best of its previous interfaces. As noted, the Start function (if not the button) is back. As are the list views of folders and files. As well, the search function is back where we are used to finding it. The new “tiled” interface is there as well, but its set just beside the list view. As a result, it’s far less threatening. You have the option of doing it the old reliable way or clicking on the new tiled view. With the option of “taking care of business” when you are busy, the exploring of the new tiles seems far less intimidating. Its sort of like the old days of IVR systems when you knew that if you pressed zero you could get help.  With that option, you tended to explore more and try new things. In the new Windows, I felt the same way. I’d be more likely to try new things knowing I could always use the old list view in a crunch. Another great piece of design in Windows 10. The traditional and modern apps work the same way. In earlier versions your traditional apps like Word and Excel opened one way – new applications like Money opened another. Windows 10 gives a consistent way of bringing new and old apps into the same UI constructs. As a result, we only have learn one way to cope – or to prosper. Apps in Windows 10 all open in the same Window structure. They all obey a consistent set of rules. They are, in other words – consistent. The UI and user experience are obviously at the height of Microsoft research these days. We don’t need a killer app. We need killer productivity. Windows 10 gives us a new interface and a structure which allows our partner like Gartner to see the solutions in real time and in a real marketing role. It’s a real focus on user interface and who can help us solve these “wicked” problems. I think to some extent that this is true. It’s not a big worry. Windows 10 does what every design model should be doing. It provides a product as well as as design and philosophically it gives us a new view of the external organization and the customer.    Our experienced team of journalists and bloggers bring you engaging in-depth interviews, videos and content targeted to IT professionals and line-of-business executives. Technicity West: Innovative economies are built on four key pillars    Technicity West 2022: Improving municipal services with data    Technicity West 2022: Intelligent cities in the post-pandemic world PRODUCED BY "
}