{
    "title": "Report: Microsoft to build ‘Stargate’ supercomputer with millions of chips \nfor OpenAI",
    "date": "3/29/2024",
    "url": "https://siliconangle.com/2024/03/29/report-microsoft-build-stargate-supercomputer-millions-chips-openai/",
    "text": "UPDATED 17:25 EDT / MARCH 29 2024 by \nMaria Deutscher Microsoft Corp. plans to build a supercomputer with millions of processors to support OpenAI’s research, The Information reported today. The system will be geared toward running artificial intelligence workloads. Reportedly codenamed Stargate by Microsoft executives, the supercomputer is believed to be part of a broader initiative that is also set to see the company build several other AI clusters. The project is expected to cost as much as $100 billion. OpenAI already uses Microsoft infrastructure to train its AI models. In 2020, the cloud computing and software giant disclosed that it had built an Azure-hosted supercomputer with 10,000 graphics cards to support OpenAI’s work. According to the companies, the system ranked as one of the world’s five fastest supercomputers at the time of its launch. Last March, Microsoft provided an update about its infrastructure collaboration with OpenAI. The company detailed that the original 10,000-GPU supercomputer it had built for the AI developer has since been upgraded to include tens of thousands of A100 chips. Microsoft executive Scott Guthrie stated that the system’s cost was “probably larger” than several hundred million dollars. Today’s report from The Information indicates more upgrades are in the works. According to the publication’s sources, Microsoft plans to build several additional AI infrastructure installations through 2030. The plan is reportedly divided into five phases, with Microsoft and OpenAI currently believed to be in the middle of the third. The fourth phase is expected to involve the construction of a new supercomputer that will launch “around” 2026. The fifth phase, in turn, will center on the system that Microsoft executives refer to as Stargate internally. The supercomputer and its millions of chips are expected to become operational as early as 2028. As of last March, Microsoft mainly used Nvidia Corp. graphics cards to power the supercomputing infrastructure it provides to OpenAI. That could potentially change going forward. In November, the company detailed an internally developed AI accelerator called Azure Maia that features 105 billion transistors. It’s possible OpenAI won’t be the sole user of Stargate and the other new AI clusters Microsoft is expected to deploy. Last year, the latter company detailed that it has used supercomputing infrastructure built for OpenAI to train its own AI models. Microsoft has also made the hardware available to cloud customers, an approach it could take with Stargate as well to more quickly recoup the system’s likely steep cost. Given that it’s expected to come online in 2028 at the earliest, Stargate likely won’t be used to train the successor to OpenAI’s GPT-4. Last week, Insider reported that GPT-5 is set to become available in a few months. It’s believed that OpenAI already has a working prototype of the model with “materially better” capabilities than GPT-4. THANK YOU Report: Microsoft to build ‘Stargate’ supercomputer with millions of chips for OpenAI Big bucks keep streaming into generative AI. How long can this last? AI startups Scale AI and Cohere reportedly in talks to raise hundreds of millions Google Search now includes crypto wallet balances for bitcoin, Fantom and other blockchains On theCUBE Pod: Thoughts on Sam Bankman-Fried’s sentence and the latest in the AI arms race New York City will introduce controversial AI gun detection technology amid subway crime crisis Report: Microsoft to build ‘Stargate’ supercomputer with millions of chips for OpenAI AI - BY MARIA DEUTSCHER . 2 HOURS AGO Big bucks keep streaming into generative AI. How long can this last? AI - BY ROBERT HOF . 3 HOURS AGO AI startups Scale AI and Cohere reportedly in talks to raise hundreds of millions AI - BY MARIA DEUTSCHER . 4 HOURS AGO Google Search now includes crypto wallet balances for bitcoin, Fantom and other blockchains BLOCKCHAIN - BY KYT DOTSON . 6 HOURS AGO On theCUBE Pod: Thoughts on Sam Bankman-Fried’s sentence and the latest in the AI arms race AI - BY RYAN STEVENS . 7 HOURS AGO New York City will introduce controversial AI gun detection technology amid subway crime crisis AI - BY JAMES FARRELL . 21 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}