{
    "title": "T Christopher Uchida Sells 2,500 Shares of Palomar Holdings, Inc. \n(NASDAQ:PLMR) Stock",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-plmr-insider-buying-and-selling-2024-03-18/",
    "text": "Palomar Holdings, Inc. (NASDAQ:PLMR - Get Free Report) CFO T Christopher Uchida sold 2,500 shares of the firm's stock in a transaction that occurred on Thursday, March 14th. The stock was sold at an average price of $81.99, for a total value of $204,975.00. Following the completion of the sale, the chief financial officer now directly owns 25,344 shares in the company, valued at approximately $2,077,954.56. The sale was disclosed in a document filed with the SEC, which is available at this hyperlink. T Christopher Uchida also recently made the following trade(s): On Monday, March 11th, T Christopher Uchida sold 2,000 shares of Palomar stock. The stock was sold at an average price of $73.43, for a total value of $146,860.00. On Friday, February 16th, T Christopher Uchida sold 750 shares of Palomar stock. The stock was sold at an average price of $74.36, for a total value of $55,770.00. On Wednesday, February 14th, T Christopher Uchida sold 1,000 shares of Palomar stock. The shares were sold at an average price of $59.45, for a total value of $59,450.00. On Wednesday, January 31st, T Christopher Uchida sold 381 shares of Palomar stock. The shares were sold at an average price of $59.19, for a total value of $22,551.39. On Saturday, January 27th, T Christopher Uchida sold 214 shares of Palomar stock. The shares were sold at an average price of $60.13, for a total value of $12,867.82. On Wednesday, January 17th, T Christopher Uchida sold 1,000 shares of Palomar stock. The shares were sold at an average price of $60.30, for a total value of $60,300.00. On Monday, January 1st, T Christopher Uchida sold 376 shares of Palomar stock. The shares were sold at an average price of $54.51, for a total value of $20,495.76. Palomar Stock Up 1.2 % Palomar stock traded up $0.98 during trading hours on Monday, hitting $83.00. The stock had a trading volume of 205,914 shares, compared to its average volume of 162,287. Palomar Holdings, Inc. has a fifty-two week low of $46.09 and a fifty-two week high of $86.25. The company has a market cap of $2.06 billion, a PE ratio of 26.60 and a beta of 0.21. The company has a 50-day moving average of $66.85 and a two-hundred day moving average of $59.17. Palomar (NASDAQ:PLMR - Get Free Report) last announced its quarterly earnings data on Wednesday, February 14th. The company reported $0.94 EPS for the quarter, beating analysts' consensus estimates of $0.85 by $0.09. The firm had revenue of $102.35 million for the quarter, compared to analyst estimates of $95.07 million. Palomar had a return on equity of 19.35% and a net margin of 21.07%. As a group, analysts forecast that Palomar Holdings, Inc. will post 3.82 EPS for the current fiscal year. Analyst Upgrades and Downgrades Several brokerages have recently issued reports on PLMR. Jefferies Financial Group upgraded Palomar from a \"hold\" rating to a \"buy\" rating and lifted their price target for the company from $78.00 to $88.00 in a research report on Thursday. Evercore ISI lifted their price target on Palomar from $66.00 to $68.00 and gave the company an \"in-line\" rating in a research report on Thursday, February 15th. Truist Financial lifted their price target on Palomar from $72.00 to $88.00 and gave the company a \"buy\" rating in a research report on Friday, February 16th. TheStreet raised Palomar from a \"c+\" rating to a \"b-\" rating in a research note on Tuesday, December 5th. Finally, Keefe, Bruyette & Woods raised their price objective on Palomar from $73.00 to $87.00 and gave the stock an \"outperform\" rating in a research note on Wednesday, February 21st. One analyst has rated the stock with a hold rating and five have issued a buy rating to the stock. Based on data from MarketBeat, Palomar presently has an average rating of \"Moderate Buy\" and an average target price of $77.00. Check Out Our Latest Analysis on PalomarInstitutional Trading of Palomar Hedge funds have recently added to or reduced their stakes in the business. Alliancebernstein L.P. increased its holdings in Palomar by 2,612.5% during the 3rd quarter. Alliancebernstein L.P. now owns 799,369 shares of the company's stock worth $66,923,000 after purchasing an additional 769,899 shares in the last quarter. Point72 Asset Management L.P. bought a new position in shares of Palomar in the 4th quarter valued at about $16,058,000. Atlas Capital Advisors LLC grew its holdings in shares of Palomar by 614.2% in the 4th quarter. Atlas Capital Advisors LLC now owns 366,284 shares of the company's stock valued at $16,541,000 after acquiring an additional 315,000 shares in the last quarter. Price T Rowe Associates Inc. MD grew its holdings in shares of Palomar by 52.1% in the 1st quarter. Price T Rowe Associates Inc. MD now owns 748,928 shares of the company's stock valued at $41,342,000 after acquiring an additional 256,378 shares in the last quarter. Finally, Millennium Management LLC bought a new position in shares of Palomar in the 4th quarter valued at about $9,260,000. Institutional investors and hedge funds own 88.33% of the company's stock. About Palomar (Get Free Report) Palomar Holdings, Inc, an insurance holding company, provides property and casualty insurance to residential and businesses in the United States. The company offers personal and commercial specialty property insurance products, including residential and commercial earthquake, fronting, commercial all risk, specialty homeowners, inland marine, Hawaii hurricane, and residential flood, as well as other products, such as assumed reinsurance.Recommended StoriesFive stocks we like better than PalomarWhy Special Dividends Can be a Delightful Surprise for Income InvestorsInsider Selling of Amazon Spikes in Q1, but it's Not Time to SellHow to Most Effectively Use the MarketBeat Earnings Screener2 Deep Value, High Yield Stocks With a Double-Digit UpsideNatural Gas Prices Continue To Rally, These Stocks Should BenefitAre We in a Bear Market? Here are the Signs This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ I tried to warn you  (From Porter & Company) (Ad)Should you invest $1,000 in Palomar right now?Before you consider Palomar, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Palomar wasn't on the list.While Palomar currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 10 Best Cheap Stocks to Buy NowMarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Palomar, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Palomar wasn't on the list. While Palomar currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}