{
    "title": "Windows 10 still has more than double the market share of Windows 11, and \nthat doesn't look like it will change any ...",
    "date": "3/5/2024",
    "url": "https://www.windowscentral.com/software-apps/windows-11/windows-10-still-has-more-than-double-the-market-share-of-windows-11-and-that-doesnt-look-like-it-will-change-any-time-soon",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Windows 10 support ends in October 2025, making the current market share numbers look concerning to Microsoft. Windows 11 launched in 2021, and despite Microsoft's best efforts, the new operating system still lags behind Windows 10 in terms of market share. Windows 11 sits at just 28.18% market share compared to the 67.23% market share of Windows 10. Those figures are according to StatCounter and show little change compared to recent months. Even before Windows 11 shipped, it was clear that some people would not upgrade to the new operating system. Microsoft's minimum requirements for upgrading were controversial when first announced and continue to cause tension today. Windows 10 will reach end of support in October 2025, giving people roughly 19 months to upgrade their PC, get a new computer, or risk running an out-of-date operating system. At the current trend of market share changes, it would take much longer than 19 months for Windows 11 to pass Windows 10. We'll have to see if Windows 10 reaching end of support changes things. Microsoft has pressured Windows 10 users to upgrade to Windows 11 will full-screen popup ads. While the upgrade to Windows 11 is free, some are not interested. Others who would like to upgrade cannot do so because their PCs do not meet Windows 11's minimum requirements. There's even been a petition to have Microsoft extend support for Windows 10 beyond October 2025. Microsoft did introduce a new \"Extended Support Updates\" (ESU) program for Windows 10, but it requires monthly payments and is only for security updates. The program is primarily for commercial customers. Google has tried to take advantage of the millions of PCs that will not be able to upgrade by offering a pathway to convert Windows laptops to run ChromeOS Flex.  Microsoft may not want to hear this, but it's easy to see why people won't upgrade from Windows 10 to Windows 11. Even if a system meets the minimum requirements to upgrade, there aren't many features exclusive to Windows 11 that move the needle. All the latest news, reviews, and guides for Windows and Xbox diehards. A chart comparing Windows 10 and Windows 11 appears on Microsoft's website. Even on a Microsoft website, which is the most likely place to see an argument for upgrading, the list of exclusive features is short. Are people going to upgrade their PC for a new interface, wake on approach/lock on leave, Smart App Control, and better redocking? Live captions, Natural Narrator, and Windows Studio Effects are nice, but I'm not sure many will upgrade just to have them. Gamers do get a bit of a boost with Windows 11 in the form of Auto HDR and the Controller bar. But even features once planned to be exclusive to Windows 11, such as DirectStorage and DirectX 12 Ultimate, have been ported back to Windows 10. Windows 11 is a fine operating system, but it's not enough to convince everyone to upgrade. Figures suggest that people are reluctant to migrate from Windows 10 to Windows 11, which is likely due to a variety of factors. The strict upgrade requirements of Windows 11 prevent some from upgrading their PCs and Windows 11 lacks killer features that will make people buy a new computer. Sean Endicott brings nearly a decade of experience covering Microsoft and Windows news to Windows Central. He joined our team in 2017 as an app reviewer and now heads up our day-to-day news coverage. If you have a news tip or an app to review, hit him up at sean.endicott@futurenet.com. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}