{
    "title": "Channel Brief: Microsoft Inspire Update, Accenture Deal",
    "date": "3/11/2024",
    "url": "https://www.channele2e.com/news/channel-brief-microsoft-inspire-update-accenture-deal",
    "text": " Grab a cup of your favorite morning beverage and check out the return of our regular market briefing for managed services providers (MSPs), IT service providers (ITSPs), technology service providers (TSPs), cloud service providers (CSPs) cybersecurity consultants, systems integrators, VARs, independent software vendors (ISVs), and distributors. Scroll down for a quick view of upcoming in-person channel and MSP events at the bottom of this post (while we spiff up our industry calendar behind the scenes. It will return!) And please send your news tips, information, and industry chatter to editorial director [email protected]. Sip up.  1. Microsoft partner event live again - Microsoft hadn’t yet resumed its in-person channel partner event, known most recently as Microsoft Inspire. The event went virtual-only during the pandemic, and Microsoft said it would stay virtual. In a post on its partner blog, Microsoft said it is evolving the partner event to become part of Microsoft Ignite in November. “We know there is a strong desire to meet in person and this opportunity will allow you to connect with other partners, Microsoft leaders, as well as customers.”  Ignite is slated for Chicago, November 18-22. And Microsoft Partner of the Year Awards nominations are now open. The submission deadline is 6 pm Pacific Time (PT) on April 3. 2. IPO planned - Reddit is planning an initial public offering and said in a filing with the U.S. Security and Exchange Commission today that it is seeking to raise as much as $748 million. The company and investors are planning to sell 22 million shares for $31 to $34  each. About 15.3 million of those shares will be sold by the company and the rest will be sold by investors and Reddit employees. At the top of the range, Reddit would have a market value of $5.4 billion. The company said it will use proceeds for general corporate purposes, including working capital, operating expenses, and capital expenditures. Further, it may acquire, or invest in complementary technologies, assets, or intellectual property. 3. Microsoft breach update - On Friday Microsoft said in a blog post and SEC filing that Mightnight Blizzard is using information initially exfiltrated from its corporate email ssytems to attempt to gain unauthorized access. That has included access to some of the company’s source code repositories and internal systems. However, so far there’s no inidcation that Microsoft-hosted customer-facing systems have been compromised.  4. Acquisition completed - Accenture has completed the acquisition of customer experience analytics company GemSeek, seeking to bolster its data and AI capabilities. The deal adds 170-plus people to Accenture Song, the company’s tech-powered creative group, bringing expertise in advanced analytics and customer experience program management along with proprietary technologies. This is technology M&A deal number 64 that ChannelE2E and MSSP Alert have covered so far in 2024. See more than 2,000 technology M&A deals for 2024, 2023, 2022, 2021, and 2020 listed here. 5. Cybersecurity partner program - Cybersecurity solution provider HYAS Infosec has expanded the benefits of its HYAS ONPOINT Program, which lets MSPs, MSSPs and other channel partners offer HYAS Protect, a cybersecurity DNS solution. Partners joining the HYAS ONPOINT Partner Program and offering HYAS Protect protective DNS as part of their managed service will receive a complimentary 12-month minimum subscription to the HYAS Insight threat intelligence and investigation platform to use in their security stack. 6. Identity partnership - Cybersecurity and data analytics and AI service provider Inspira Enterprise will partner with Ping Identity through its global channel partner program to offer a simplified security approach to end user companies. Ping offers a centralized identity and access management (IAM) with attention to an improved digital experience for end uesers. The partnership will help customers streamline complex, multi-tenant identity infrastructure to ensure solutions are architected with security in mind and delivered with a frictionless digital experience, the companies said. Jessica C. Davis has spent a career as a journalist and editor covering the business of technology including chips, software, the cloud, AI, and cybersecurity. She previously served as editor in chief of Channel Insider and later of MSP Mentor. She now serves as editorial director for CyberRisk Alliance’s channel brands, MSSP Alert and ChannelE2E. Jessica C. DavisMarch 28, 2024 Today's Channel market news also includes updates from Microsoft, Arctic Wolf and ServiceNow Jessica C. DavisMarch 27, 2024 Today's channel market news includes updates on Cisco, N2WS, Cyolo, and TD Synnex. Jessica C. DavisMarch 26, 2024 Today's channel market news also includes updates from Dell and Wipro.  "
}