{
    "title": null,
    "date": "3/16/2024",
    "url": "https://investorplace.com/2024/03/msft-stock-forecast-3-explosive-reasons-to-own-microsoft-now/",
    "text": " Of the Magnificent Seven, MSFT stock could be your safest bet Advertisement Source: The Art of Pics / Shutterstock.com Microsoft (NASDAQ:MSFT) Copilot now offers GPT-4 Turbo for free. I don’t know what that means for MSFT stock, but it shows the company’s commitment to AI. CNET contributor Don Reisinger points out that the move is a sign OpenAI is likely close to launching GPT-4.5 Turbo, which would be for Copilot Pro users who pay $20 monthly to use GPT-4 Turbo. “GPT-4 Turbo has been trained on data up to April 2023 and can also handle text-to-speech prompts, and its context window can accept 128,000 tokens — the highest amount offered in a GPT version,” Reisinger wrote on March 13. “Tokens are pieces of words. The more tokens a model can accept, the more text a user can input into the model to provide additional context and get a better result.” Before you know it, GPT-27 Turbo will be accessible through Copilot. I’m facetious, but it’s another reason to like Microsoft stock. Here are three others. Even though I discussed generative AI in the intro, I think it’s worth mentioning the potential financial gains from Microsoft’s efforts to incorporate it into its entire business. Motley Fool reported on March 14 comments by Wells Fargo analysts about Copilot for Security, suggesting its latest security offering for generative AI will be very good for Azure, Microsoft’s cloud infrastructure product. “Analysts at Wells Fargo believe this latest offering will result in incremental growth for Azure, Microsoft’s cloud infrastructure service, during its fiscal fourth quarter (which ends Jun. 30) and into fiscal 2025,” Motley Fool contributor Danny Vena wrote. “The analysts cite the service’s consumption-based pricing, which they believe will drive greater adoption.” Vena also said ISI Evercore analyst Kirk Materne believes Microsoft’s generative AI revenues could be as high as $143 billion by 2027. That’s one reason MSFT stock trades at a premium of 36 times forward earnings compared to 28 times for the S&P 500. Like Nvidia (NASDAQ:NVDA), Microsoft invests heavily in AI. It expects significant rewards from these investments. One way to tell if it’s getting an appropriate return on its investment is through margin expansion. For example, if you have $1 billion in annual sales, a gross margin of 50%, an operating margin of 25%, and effective tax rate of 21%, your net profit is $197.5 million, and a net margin of 19.7%. If you raise its gross and operating margin by 500 basis points, the net profit rises x% to $237.0 million, with a net margin of 23.7% and 4oo basis points higher than the same investment. Microsoft’s gross margin in the second quarter of fiscal 2024 (June year-end) was 68.4%, 160 basis points higher than in Q2 2023. Further down the income statement, its operating income was 33% higher over last year, with an operating margin of 43.6%, 490 basis points higher than a year earlier. Assuming the same valuation multiple, it should be worth more. However, with this kind of growth, investors will pay more, which increases its value even more. Rinse and repeat. In the first two quarters of 2024, it had nearly $30 billion in free cash flow, with plenty more to come in the second half of the fiscal year. The big expense in the first half was $66.2 billion to acquire Activision Blizzard, which will add to its future free cash flow generation. Despite a 57% increase in capital expenditures in the first half, it still finished the second quarter with 11% more cash on its balance sheet from Dec. 31, 2022. Because the acquisition was entirely in cash, debt issuance was much higher than its debt repayment. Over the next year, that will flip. The company paid out $10.63 billion in dividends in the first half of fiscal 2024 while repurchasing $8.83 billion of its stock, returning nearly $20 billion to shareholders. As Barron’s reported on March 13, it paid out $20.7 billion in dividends in its fiscal 2023, more than any other company. Companies can be innovative and shareholder-friendly at the same time. MSFT is a must own. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/msft-stock-forecast-3-explosive-reasons-to-own-microsoft-now/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}