{
    "title": "After raising $1.3B, Inflection is eaten alive by its biggest investor, \nMicrosoft",
    "date": "3/20/2024",
    "url": "https://au.finance.yahoo.com/news/raising-1-3b-inflection-got-180127729.html",
    "text": "In June 2023, Inflection announced it had raised $1.3 billion to build what it called \"more personal AI.\" The lead investor was Microsoft. Today, less than a year later, Microsoft announced that it was feasting on Inflection's body and sucking the marrow from the bones (though I think they phrased it differently). Co-founders Mustafa Suleyman and Karén Simonyan will go to Microsoft, where the former will head up the newly formed Microsoft AI division, along with \"several members\" of their team as Microsoft put it — or \"most of the staff,\" as Bloomberg reports it. Reid Hoffman will stay behind with new CEO Sean White to try to salvage what's left of the company, which, I feel I have to repeat, raised $1.3 billion dollars nine months ago and $225 million in mid-2022. Inflection's thesis was a conversational AI that you could talk to normally via multiple platforms, and which remembered you and previous conversations, making it more personal and useful. A lovely idea, but Pi, their AI, never really got close. It was fine, but even with all that money they couldn't keep up with the rapid advances in capabilities and services being offered by OpenAI (which Microsoft, hedging its bets, also backs), Google's Gemini (which has the home field advantage in search) and Anthropic (which made its play for safe, boring applications at which AI can excel). Inflection debuts its own foundation AI model to rival Google and OpenAI LLMs Perhaps the pitch was destined for failure: It's not really clear people want a personalized AI, when the things already sit so comfortably in the uncanny valley of humanity. They may not want their business writing expert AI, their architectural sketching AI and their therapeutic chat AI to know one another at all. To unify them is certainly an approach, but whether the market rejected it, or Inflection's tech simply fell short of its aims, Pi always seemed to us a respectable also-ran. Of course, taking this shot was immensely costly, probably to the tune of hundreds of millions of dollars, with, I imagine, more or less negligible revenue. How long do you continue throwing money in the hole? When does it stop being a long play and inverts into a waste of capital? (I don't say a waste of effort, as the company produced a lot of valuable work in the field, in which its researchers no doubt have pride.) And who makes that call? Whoever it was, here is \"The new Inflection\" now: minus its two most technically substantive co-founders (sorry Reid), minus the product that it invested a fortune in (there will be \"no immediate changes\" to Pi, which is basically a death warrant), minus some or most of the team that built it and, one imagines, minus a lot of the money that was contingent on performance. Hoffman and White have their work cut out for them. The new focus, on an \"AI studio business, where custom generative AI models are crafted, tested and fine tuned for commercial customers,\" probably would have been fine to pick a year or two ago, but I suspect that at this point they will be fighting over crumbs. And then there's Microsoft. What's that I hear? An echo from the '90s? Embrace... extend... extinguish... Are they the good guy here, rescuing a valuable team from the wreckage of a business that was in danger of taking them down with it? Or are they opportunists who backed multiple horses in the same race, with the express intention of gleefully devouring any of them that tripped before the finish line? I mean, it was only in November that we saw them take a flying bite at OpenAI — literally the exact same thing! Microsoft hires ex-OpenAI leaders Altman and Brockman to lead new AI group For a few hours, OpenAI was the fallen horse, and Sam Altman and Greg Brockman and their loyalists were the meat! Ultimately Microsoft got a bit of extra leverage on the company instead of eating it alive. Now they've got their second choice, and probably a lot cheaper. Inflection doesn't have the momentum of OpenAI, which was perhaps at the zenith of its ambition thus far when the coup was attempted. We'll see if Suleyman and Simonyan can lead the new AI division effectively — I don't know about you, but I would be pretty skeptical of their instincts after seeing a billion-dollar enterprise evaporate so quickly. Would you hire them after all this? (And the other stuff.) Whatever the circumstances behind this sudden fall, it emphasizes the primacy of legacy tech companies in this space. Whether it was OpenAI or Inflection, Microsoft was feeding their cash and compute addictions, whispering in their ear about partnerships (on which Inflection will reportedly now depend), and then as soon as they stumbled, out came the hidden fork and knife. You think Google isn't ready to do the same thing to Anthropic? You don't think Apple would do the same if it could? As always in tech: Those who can, build; those who can't, buy... by any means necessary. (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergFed’s Preferred Inflation Metric Cools While Spending ReboundsBank of Russia Sees No Alternative to Yuan for Its ReservesPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  This update would represent Apple's first overhaul to that lineup since 2018. Trade 24 hours a day on the world's most popular platform. Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. This food habit is linked to a specific type of dementia.  The dreaded pest also displaces wildlife and can blind pets. Find out more. Harry Enten ran the numbers on Trump's dismal fundraising so far. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. 2024 Subaru Crosstrek Review, Pricing, and Specs MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago The not-so-happy campers were stunned by the unexpected guest at their beachside campsite. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more. The person who wrote on the road has been called a \"top bloke\" by motorists.  The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann. ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says  Footage shows Dylan Edwards moved out of the way. Find out more here. \"The Daily Show\" star channeled the conservative channel to hilariously prattle on in defense of Trump. Despite referee Gerard Sutton labelling the collision \"incidental\", Souths superstar Latrell Mitchell has been charged for dangerous contact on Josh Addo-Carr. "
}