{
    "title": null,
    "date": "1/5/2024",
    "url": "https://seekingalpha.com/news/4052750-salesforce-microsoft-servicenow-are-bofas-top-software-stocks-for-2024",
    "text": "John M. Chase Salesforce (NYSE:CRM), Microsoft (NASDAQ:MSFT) and ServiceNow (NYSE:NOW) are Bank of America's top software stocks for 2024, even as the firm said it's too soon to be a \"blind bull.\" Software stocks are not \"inexpensive\" after having gained 58 last year, but it's still likely that the business cycle is in the early recovery phase, analysts at the firm led by Alkesh Shah wrote in an investor note. \"However, we remain positive on the sector due to secular tailwinds from the newest AI wave, improving IT spending and the continued shift to the Cloud,\" the analysts said. \"We expect mid-teen revenue growth, improving margins, multiple reversion and positive revisions to offset cyclical headwinds in [first-half of 2024] before driving a stronger [second half of 2024].\" For Salesforce, the analysts see \"enduring\" revenue growth in the mid-teens and rising margins thanks to increased productivity efforts in sales. Microsoft is likely to benefit from artificial intelligence and see \"incremental\" growth in both Azure and Office thanks to AI. The Satya Nadella-led company should also see margin and free cash flow growth as it reaps the benefits from scale. ServiceNow offers best-in-class growth and is likely to see that growth rate move higher thanks to AI and \"ongoing consolidation of the large IT & custom apps markets,\" the analysts said. Hubspot (HUBS) was also mentioned as a buy for 2024, with the analysts saying easing macro concerns could result in revenue re-acceleration for the small and medium-sized business customer relationship management company. Unity Software (U) was also mentioned favorably due to estimate upside, better industry trends and a \"compelling valuation\" while Oracle (ORCL) and Twilio (TWLO) were mentioned in a negative light, due to concerns about cloud migration and secular headwinds, respectively. "
}