{
    "title": "Microsoft-Backed Chinese Company Works With Sanctioned Groups",
    "date": "1/29/2024",
    "url": "https://www.theamericanconservative.com/microsoft-backed-chinese-company-works-with-sanctioned-groups/",
    "text": "Become a member and enjoy the very best from The American Conservative in print & digital. Wicresoft, started in 2002 by Microsoft and the Shanghai Municipal Government, conducts business with at least three companies sanctioned by the U.S. government over national security concerns and human rights violations. Tech giant Microsoft owns nearly a quarter of a China-based company whose clients and partners include companies sanctioned by the United States government. As of late 2023, Microsoft owned 22 percent of Shanghai Wicresoft Co. Ltd. (Wicresoft for short), a technology services and software company that began in 2002 as a joint venture between the U.S.-based tech giant and the Shanghai Alliance Investment Co., the venture capital arm of the Shanghai Municipal Government. To get Wicresoft off the ground, Microsoft invested $4 million in exchange for 50 percent ownership of the joint venture and pledged to become the China-based company’s first client, according to a 2002 report from the Wall Street Journal. Since then, Wicresoft’s clientele has grown. At least three of these clients, however, are sanctioned by the United States due to national security concerns and the companies’ alleged involvement in human rights violations against Uyghurs and other minorities in the Xinjiang province. One of these Wicresoft clients is SenseTime Group Ltd., or SenseTime, a Hong Kong-based company that is “incorporated in the Cayman Islands with limited liability,” per the company’s financial reports. SenseTime’s website claims it is “a “leading AI software company focused on creating a better AI-empowered future through innovation.” Since 2018, Wicresoft has been a supplier and contractor for SenseTime. A job posting from Wicresoft in December 2023 for a position related to image and video data annotation claims that Wicresoft has more than 300 consultants embedded at SenseTime, working on a wide range of projects, “from early-stage research and development to late-stage implementation.” In an article published by 51CTO in December 2022 covering the International Digital Services Conference in Shanghai, claimed Wicresoft “has accumulated product, technology and industry experience through extensive cooperation with SenseTime Technology, laying a solid foundation for artificial intelligence applications in product development and industry integration.” SenseTime Group Ltd appears on the U.S. Treasury Department’s Office of Foreign Assets Control’s (OFAC) sanctions list with a CMIC designation, which stands for “Chinese Military-Industrial Complex Companies.” The Non-SDN Chinese Military Industrial Complex (CMIC) list began under the Trump administration with Executive Order 13959 in November of 2020. The Trump administration used the 1999 National Defense Authorization Act’s Communist Chinese Military Companies (CCMC) list to create the new sanctions program that prohibits Americans from purchasing or selling publicly traded securities of persons or entities that were involved in the “military, intelligence, and other security apparatuses” of the Chinese government. Nevertheless, a CMIC listing does not prohibit transactions that do not involve the exchange of publicly traded securities. The Biden administration has amended the Trump-era CMIC sanctions regime, but has kept most of the program in place. In June 2021, President Joe Biden issued Executive Order 14032, which placed the CMIC under the authority of the Treasury Department and expanded the government’s authority to list entities that “facilitate repression or serious human rights abuse.” As of last spring, the Center for a New American Security claimed that 68 entities are on the CMIC list. CMIC sanctions “are sanctions intended to prevent US companies, particularly technology companies, from assisting wittingly or unwittingly, the development of advanced Chinese weapons systems,” explained former Trump administration Treasury and Commerce official Adam Korzeniewski in an email to The American Conservative. “Penalties typically involve fines, but can include criminal investigations and seizures.” The reason for the U.S. sanctions regime against China? “China develops weapon systems meant to counter U.S. capabilities, are willing to supply weapons to adversaries, and regularly conducts espionage against the U.S.,” Korzeniewski wrote. OFAC’s records show SenseTime was listed on December 10, 2021. It described SenseTime as a “Chinese Military-Industrial Complex Company” that “operated in the surveillance technology sector of the PRC’s economy” and “developed facial recognition programs that can determine a target’s ethnicity, with a particular focus on identifying ethnic Uyghurs. When applying for patent applications, Shenzhen SenseTime Technology Co. Ltd. has highlighted its ability to identify Uyghurs wearing beards, sunglasses, and masks.” A SenseTime subsidiary, Beijing SenseTime Technology Development Co.,  is also on the United States Department of Commerce's Bureau of Industry and Security’s (BIS) Entity List. “The Entity List,” Korzeniewski wrote, “lists specific foreign persons—which definition can include persons, companies, organizations, associations, etc.—that require special license for export, import, and/or transfer, specifies what kind of licensure and the conditions for that business.” Not only does this business activity require U.S. government approval, but the government also restricts what is done with goods and services with U.S. origin down the line. SenseTime Group Ltd. reports indicate that Beijing SenseTime Technology Development Co. is indeed one of its mainland-based subsidiaries, and discusses how Beijing SenseTime Technology Development Co. receives preferential corporate tax treatment from the Chinese government. A BIS rule posted in the Federal Register in October of 2019 claims that Beijing SenseTime Technology Development Co. is “implicated in human rights violations and abuses in the implementation of China's campaign of repression, mass arbitrary detention, and high-technology surveillance against Uyghurs, Kazakhs, and other members of Muslim minority groups” Cloudwalk Technology Co. Ltd. (Cloudwalk) is another Wicresoft client that has found itself sanctioned by the CMIC and Entity List. CloudWalk was added to the CMIC list in December 2021 for its development of technology designed to surveil ethnic minorities, including Tibetans and Uyghurs. The Treasury Department said in a December 2021 release that CloudWalk and the other targeted companies “actively support the biometric surveillance and tracking of ethnic and religious minorities in China, particularly the predominantly Muslim Uyghur minority in Xinjiang.” “Cloudwalk has developed facial recognition software designed to track and surveil members of ethnic minority groups, including Tibetans and Uyghurs, and alert authorities if too many individuals gather in specific locations,” the Treasury Department release continued. In 2018, Cloudwalk entered into an agreement with the Zimbabwean government to install a mass surveillance network, which included provisions that required the Zimbabwean government to transmit data back to Cloudwalk’s operations in China so that Cloudwalk might be able to “improve the ability of its facial recognition software to recognize individuals based on skin pigmentation,” the Treasury department added. The BIS added Cloudwalk to the Entity List in May of 2020, according to the Federal Register. Cloudwalk and six other entities, the BIS claimed, are “enabling activities contrary to the foreign policy interests of the United States.” The BIS also alleged that “these entities have been implicated in human rights violations and abuses in the implementation of China's campaign of repression, mass arbitrary detention, forced labor and high-technology surveillance against Uyghurs, Kazakhs, and other members of Muslim minority groups,” just like SenseTime. Though TAC could not determine the duration of the relationship, Wicresoft Vice President Zhang Xiaohua at a Shanghai conference in 2020 boasted about Wicresoft’s relationship with Cloudwalk. “[Wicresoft] is carrying out cutting-edge technology cooperation in various fields and directions with high-tech giants and unicorn companies such as Microsoft, Baidu, SenseTime, and CloudWalk,” a Google-translated report from China Daily paraphrasing Zhang’s remarks read. Another Wicresoft partner, a Chinese-government-backed voice recognition and AI developer, iFlyTek, found itself on the BIS’s Entity List in October 2019 for its alleged participation in the oppression of the Uyghurs. Zhang, according to China Daily, boasted of Wicresoft’s relationship in 2020. “Wicresoft has attracted and trained a large number of technical talents and business experts, and has incubated an AI intelligent voice laboratory, which has become a highly valuable business for high-tech companies such as Tencent, Alibaba, AutoNavi, Intel, iFlytek, etc. Consulting and technical services partner,” the Google-translated report claims. While Zhang highlighted Wicresoft’s business with several sanctioned entities at the Shanghai conference in 2020, he boasted most of all about the company’s relationship to Microsoft. “Zhang Xiaohua said that Wicresoft and Microsoft have cooperated for nearly 20 years,” the Google-translated report from China Daily claims. “Wicresoft services have penetrated into the R&D and operation of Microsoft's full line of technology and software products.” “At the same time, it has fully participated in the industrial design and R&D of high-tech intelligent hardware in the Microsoft Asia Hardware Center,” China Daily continued, and has “fully participated in the establishment and management of the Shanghai laboratory, one of Microsoft's three AI&IOT laboratories in the world.” While the summary of the sanctions regimes above show Microsoft is not in violation of these sanctions by holding a substantial stake in Wicresoft, the proposition that Microsoft can own, create, invest in, partner with, and ultimately profit from a company that provides Microsoft-like services to sanctioned actors, which in certain cases would require Microsoft to get the approval of the U.S. government to do business with, seems quite the racket. Microsoft, Korzeniewski claimed, is acting \"against the spirit of the sanctions regime.\" Roger Robinson, the former Chairman of the Congressional U.S.-China Economic and Security Review Commission, told TAC, “there appears to be no question that Microsoft has deliberately averted its eyes from U.S.-sanctioned corporate human rights abusers that Wicresoft regards as valued ‘clients’, among them SenseTime, IflyTek and CloudWalk.” Companies often avoid sanctions, Korzeniewski explained, by sometimes “using neutral, third-party entities in states allied or friendly with the U.S. and the sanctioned foreign person(s).” “Before mass globalization of financial services in the contemporary sense,“ Korzeniewski continued, “U.S. persons would use front companies or other illicit means, like U.S. persons who helped Soviet industry in the 1920s.“ “Sanctions work with enforcement,“ Korzeniewski argued. “However, these sanctions also increase the cost of efforts to evade or find work arounds for all the parties in general. Sanctions primarily affect the behavior of U.S. persons and allied states obeying such sanctions.“ To make sanctions more effective, Korzeniewski told TAC that “sanctions must be continuously reevaluated for adherence and effectiveness. The U.S. can expand sanctions so that current work arounds no longer are acceptable.“ “Make no mistake, continuing this calloused disregard for these, and perhaps other, Chinese corporate human rights offenders implicates Microsoft’s brand and corporate reputation,” Robinson continued. “It would do well to shed its investment in Wicresoft forthwith.” Bradley Devlin is the political editor for The American Conservative. Previously, he was an Analysis Reporter for the Daily Caller, and has been published in the Daily Wire and the Daily Signal, among other publications that don’t include the word “Daily.” He graduated from the University of California, Berkeley with a degree in Political Economy. You can follow Bradley on Twitter @bradleydevlin. "
}