{
    "title": "Microsoft (MSFT) Q2 Earnings Preview: New All Time Highs?",
    "date": "1/22/2024",
    "url": "https://www.tastylive.com/news-insights/Microsoft-MSFT-Q2-Earnings-Preview-New-All-Time-Highs",
    "text": "Microsoft Stock Sets New All-Time High Ahead of Q2 Earnings Jan 22, 2024 By:Thomas Westwater  Microsoft (MSFT) is scheduled to report fiscal second-quarter earnings results after the closing bell on Jan. 30. Each earnings cycle, Microsoft is one of the first big tech names to report earnings, making it especially important to traders. The stock hit fresh all-time highs today amid a broader rally in technology stocks despite news that a Russian state-backed hacker group accessed the email accounts of Microsoft’s executive team and other entities, according to a press release from Microsoft. Analysts see Microsoft’s second quarter adjusted earnings per share (EPS) at $2.78 on $61.1 billion in revenue. Those numbers represent year-over-year growth rates of 20% and 16%, according to Bloomberg,. Intelligent cloud services revenue, which includes Azure, is expected to grow 17.5% from a year ago at $25.3 billion. Productivity and business processes, the segment that includes Office 365 subscriptions and LinkedIn, is slightly less optimistic, with analysts expecting 12% growth from a year ago to $19.03 billion. Personal computing is expected to bring in $16.8 billion for an 18% year-over-year growth rate. Several analysts upgraded or reaffirmed their bullish views on Microsoft ahead of the earnings announcement, driven in large part by optimism over generative artificial intelligence. Of the 65 analysts tracked by Bloomberg, 60 hold a buy rating on the stock, while five have hold ratings. The 12-month price target among those analysts is $426.46 per share, representing a 7.2% increase from Monday’s opening price.  Trading earnings announcements always comes with uncertainty. MSFT currently holds an implied volatility rank (IVR) of 52.1, and the Feb. 2 expiration strike shows an expected move of +/- 18.43. Still, traders who want a defined risk approach could use selling a call spread or put spread with their strikes around the distance or slightly beyond the expected moves. Technically, MSFT is trading above its key moving averages and has no areas of prior price action at these levels. The relative strength index (RSI) is trending lower within overbought levels, which may indicate a pullback is due. A drop to levels around the recent consolidation zone from 365 to 378 might be in the cards ahead of earnings. That said, traders looking to take a bullish position before the announcement might want to wait a few more days to see if prices fall.    Thomas Westwater, a tastylive financial writer and analyst, has eight years of markets and trading experience. @fxwestwater For live daily programming, market news and commentary, visit tastylive or the YouTube channels tastylive (for options traders), and tastyliveTrending for stocks, futures, forex & macro. Trade with a better broker, open a tastytrade account today. tastylive, Inc. and tastytrade, Inc. are separate but affiliated companies. Options involve risk and are not suitable for all investors. Please read Characteristics and Risks of Standardized Options before deciding to invest in options. About Us Careers Legal Stuff Press FAQ Glossary Help Center Contact Us Twitter Instagram Facebook LinkedIn tastytrade tastycrypto luckbox Store Connect from anywhere! Newsletters News & Insights On Demand tastylive content is created, produced, and provided solely by tastylive, Inc. (“tastylive”) and is for informational and educational purposes only. It is not, nor is it intended to be, trading or investment advice or a recommendation that any security, futures contract, digital asset, other product, transaction, or investment strategy is suitable for any person. Trading securities, futures products, and digital assets involve risk and may result in a loss greater than the original amount invested. tastylive, through its content, financial programming or otherwise, does not provide investment or financial advice or make investment recommendations. Investment information provided may not be appropriate for all investors and is provided without respect to individual investor financial sophistication, financial situation, investing time horizon or risk tolerance. tastylive is not in the business of transacting securities trades, nor does it direct client commodity accounts or give commodity trading advice tailored to any particular client’s situation or investment objectives. Supporting documentation for any claims (including claims made on behalf of options programs), comparisons, statistics, or other technical data, if applicable, will be supplied upon request. tastylive is not a licensed financial adviser, registered investment adviser, or a registered broker-dealer.  Options, futures, and futures options are not suitable for all investors.  Prior to trading securities, options, futures, or futures options, please read the applicable risk disclosures, including, but not limited to, the Characteristics and Risks of Standardized Options Disclosure and the Futures and Exchange-Traded Options Risk Disclosure found on tastytrade.com/disclosures. tastytrade, Inc. (\"tastytrade”) is a registered broker-dealer and member of FINRA, NFA, and SIPC. tastytrade was previously known as tastyworks, Inc. (“tastyworks”). tastytrade offers self-directed brokerage accounts to its customers. tastytrade does not give financial or trading advice, nor does it make investment recommendations. You alone are responsible for making your investment and trading decisions and for evaluating the merits and risks associated with the use of tastytrade’s systems, services or products. tastytrade is a wholly-owned subsidiary of tastylive, Inc. tastytrade has entered into a Marketing Agreement with tastylive (“Marketing Agent”) whereby tastytrade pays compensation to Marketing Agent to recommend tastytrade’s brokerage services. The existence of this Marketing Agreement should not be deemed as an endorsement or recommendation of Marketing Agent by tastytrade. tastytrade and Marketing Agent are separate entities with their own products and services. tastylive is the parent company of tastytrade. tastycrypto is provided solely by tasty Software Solutions, LLC. tasty Software Solutions, LLC is a separate but affiliate company of tastylive, Inc. Neither tastylive nor any of its affiliates are responsible for the products or services provided by tasty Software Solutions, LLC. Cryptocurrency trading is not suitable for all investors due to the number of risks involved. The value of any cryptocurrency, including digital assets pegged to fiat currency, commodities, or any other asset, may go to zero. © copyright 2013 - 2024 tastylive, Inc. All Rights Reserved.  Applicable portions of the Terms of Use on tastylive.com apply.  Reproduction, adaptation, distribution, public display, exhibition for profit, or storage in any electronic storage media in whole or in part is prohibited under penalty of law, provided that you may download tastylive’s podcasts as necessary to view for personal use. tastylive was previously known as tastytrade, Inc. tastylive is a trademark/servicemark owned by tastylive, Inc. "
}