{
    "title": "Microsoft briefly overtakes Apple as world's most valuable company",
    "date": "1/11/2024",
    "url": "https://www.foxbusiness.com/markets/microsoft-briefly-overtakes-apple-worlds-valuable-company",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Circled Squared Investments founder Jeff Sica discusses whether Microsoft can take over Apple as the company with the biggest market cap on Varney & Co. Microsoft on Thursday briefly overtook Apple as the world's most valuable company for the first time since 2021 after the iPhone maker's shares made a weak start to the year on growing concerns over demand. Microsoft's shares have risen sharply since last year thanks to the early lead the company has taken in generative artificial intelligence through an investment in ChatGPT-maker OpenAI. They were up 0.7% on Thursday, giving Microsoft a market value of $2.865 trillion. Microsoft's market cap topped Apple's for the first time since 2021 on Thursday. (REUTERS/Dado Ruvic/Illustration/File Photo / Reuters Photos) The stock rose as much as 2% earlier in the session and Microsoft was briefly worth $2.903 trillion. Shares of Apple were 0.9% lower, giving the company a market capitalization of $2.871 trillion. Microsoft and Apple have jostled for top spot over the years. MICROSOFT ADDS NEW AI COPILOT BUTTON ON WINDOWS KEYBOARDS IN DEVICE'S FIRST CHANGE IN 30 YEARS \"It was inevitable that Microsoft would overtake Apple since Microsoft is growing faster and has more to benefit from the generative AI revolution,\" said D.A. Davidson analyst Gil Luria. Microsoft has incorporated OpenAI's technology across its suite of productivity software, a move that helped spark a rebound in its cloud-computing business in the July-September quarter. Satya Nadella, chief executive officer of Microsoft Corp., speaks during a Microsoft product event in New York, U.S., on Wednesday, Oct. 2, 2019.  (Photographer: Mark Kauzlarich/Bloomberg via Getty Images / Getty Images) Microsoft, Inc. Apple, meanwhile, has been grappling with weakening demand, including for the iPhone, its biggest cash cow. Demand in China, a major market, has slumped as the country's economy makes a slow recovery from the pandemic and a resurgent Huawei chips away at its market share. \"China could be a drag on performance over the coming years,\" brokerage Redburn Atlantic said in a client note on Wednesday, downgrading Apple's shares to \"neutral\". At least three of the 41 analysts covering Apple have lowered their ratings since the start of 2024. APPLE VISION PRO HEADSET: LAUNCH DATE, PRICING UNVEILED The Cupertino, California-based company has fallen 3.3% in January as of last close, compared with a 1.8% rise in Microsoft. Both the stocks are expensive in terms of their share price-to-earnings (PE) ratio, a common method of valuing publicly listed companies. Apple is trading at a forward PE of 28, well above its average of 19 over the past 10 years, according to LSEG data. Microsoft is trading around 31 times forward earnings, above its 10-year average of 24. Close-up of blue logo on sign with facade of headquarters buildings in background near the headquarters of Apple Computers in the Silicon Valley, Cupertino, California, August 26, 2018.  ((Photo by Smith Collection/Gado/Getty Images) / Getty Images) Apple, Inc. Shares of Apple, whose market capitalization peaked at $3.081 trillion on Dec. 14, ended last year with a gain of 48%. That was lower than the 57% rise posted by Microsoft. Microsoft has briefly taken the lead over Apple as the most valuable company a handful of times since 2018, including in 2021 when concerns about COVID-driven supply chain shortages hit the iPhone maker's stock price. GET FOX BUSINESS ON THE GO BY CLICKING HERE Currently, Wall Street is more positive on Microsoft. The company has no \"sell\" rating and nearly 90% of the brokerages covering the company recommend buying the stock. Apple has two \"sell\" ratings and only two-thirds of the analysts covering the company rate it a \"buy\". Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}