{
    "title": "Microsoft overtakes Apple as most valuable stock in the world",
    "date": "1/15/2024",
    "url": "https://techxplore.com/news/2024-01-microsoft-apple-valuable-stock-world.html",
    "text": "Click here to sign in with\n                  \n\n\n                  or Forget Password? Learn more share this! 13 Twit Share Email January 15, 2024 This article has been reviewed according to Science X's \n                                                    editorial process\n                                                    and policies.\n                                                    Editors have highlighted\n                                                    the following attributes while ensuring the content's credibility: fact-checked reputable news agency proofread by Ryan Vlastelica, Subrat Patnaik, Bloomberg News Microsoft Corp. overtook Apple Inc. to become the world's most valuable publicly traded company for the first time in more than two years, as worries over smartphone demand have weighed on the iPhone-maker's stock in recent weeks. The Redmond, Washington-based software giant rose 1% to $388.47 on Friday, ending with a market valuation of $2.89 trillion. Meanwhile, Apple gained 0.2% and closed with a market capitalization of $2.87 trillion. It's the first time since November 2021 that Microsoft has closed with a higher value than Apple. \"When you compare and contrast the two, the growth Apple is showing is nothing special, whereas Microsoft has done a better job of executing and demonstrating earnings growth,\" said David Katz, chief investment officer at Matrix Asset Advisors, which has positions in both. \"Microsoft also has a much clearer roadmap with AI, and it has done a great job articulating how that will accelerate growth to make its long-term prospects even more compelling.\" While both were part of the so-called Magnificent 7's powerful rally in 2023, their fortunes have diverged this year. Microsoft has risen 3.3%, supported by ongoing optimism over artificial intelligence, while Apple has dropped 3.4% amid rising concerns over its growth. It has been hit by at least three analyst ratings downgrades, according to data compiled by Bloomberg. Wall Street's less-favorable view on Apple suggests it would not be surprising if Microsoft maintained or even built on its newfound size advantage. The average analyst price target for Microsoft equates to upside of about 8% over the coming 12 months, slightly above Apple's return potential. Such a gain would result in Microsoft topping $3 trillion in market valuation, joining Apple as one of only two companies to hit such a threshold. Microsoft and Apple remain the biggest weights in the S&P 500 by far, together accounting for roughly 14% of the overall index. Few other companies approach them in size. Oil giant Saudi Aramco's value sits at just over $2 trillion, while Alphabet Inc., Amazon.com Inc., and Nvidia Corp. are all valued above $1 trillion. Meta Platforms Inc., which jumped nearly 200% last year, is the next closest, sitting just below the trillion-dollar threshold. 2024 Bloomberg L.P. Distributed by Tribune Content Agency, LLC. Explore further Facebook Twitter Email Feedback to editors 23 hours ago 0 Mar 25, 2024 0 Mar 25, 2024 0 Mar 22, 2024 0 Mar 21, 2024 0 2 hours ago 18 hours ago 19 hours ago 19 hours ago 20 hours ago 23 hours ago 23 hours ago 23 hours ago Mar 28, 2024 Mar 28, 2024 Jul 3, 2023 Jul 1, 2023 Apr 25, 2019 Nov 10, 2022 Nov 26, 2018 Apr 24, 2019 Mar 28, 2024 Mar 28, 2024 Mar 25, 2024 Mar 21, 2024 Mar 18, 2024 Mar 18, 2024 Use this form if you have come across a typo, inaccuracy or would like to send an edit request for the content on this page.\n\t\t\t\t\t\t\t\t\t\t\tFor general inquiries, please use our  contact form.\n\t\t\t\t\t\t\t\t\t\t\tFor general feedback, use the public comments section below (please adhere to guidelines). Please select the most appropriate category to facilitate processing of your request Thank you for taking time to provide your feedback to the editors. Your feedback is important to us. However, we do not guarantee individual replies due to the high volume of messages. Your email address is used only to let the recipient know who sent the email. Neither your address nor the recipient's address will be used for any other purpose. The information you enter will appear in your e-mail message and is not retained by Tech Xplore in any form.  Daily science news on research developments and the latest\n                                    scientific innovations Medical research advances and health news The most comprehensive sci-tech news coverage on the web This site uses cookies to assist with navigation, analyse your use of our services, collect data for ads\n            personalisation and provide content from third parties.\n            By using our site, you acknowledge that you have read and understand our Privacy\n                Policy\n            and Terms of\n                Use. "
}