{
    "title": "Microsoft's Nadella Wants Stability at OpenAI, Not Control",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/microsoft-nadella-wants-stability-openai-092104700.html",
    "text": "(Bloomberg) -- Microsoft Corp. Chief Executive Officer Satya Nadella said he doesn’t want greater control over OpenAI as European and UK regulators consider probes of the deep ties between the two companies. Most Read from Bloomberg Putin Orders Hunt for Property of Russian Empire, Soviet Union S&P 500 Hits All-Time High in Historic Bull Run: Markets Wrap Ford Cuts Workforce Making Electric F-150s on Weak Demand YouTube and Spotify Won’t Launch Apple Vision Pro Apps, Joining Netflix China’s $6.3 Trillion Stock Selloff Is Getting Uglier by the Day “What we just want is good stability,” he said in an interview at Bloomberg House at the World Economic Forum in Davos. “We invested, we partnered when they were whatever they were and whatever they are today — a capped-profit, nonprofit, what have you. So I’m comfortable. I have no issues with any structure.” OpenAI CEO Sam Altman’s ouster in November laid bare how inextricably linked Microsoft and his company have become. Nadella personally advocated for Altman’s return and, at one point, offered him a job. Those ties, together with Microsoft’s some $13 billion investment in the startup, have spurred antitrust reviews in both the UK and the European Union. Read More: Microsoft’s OpenAI Ties Face Potential EU Merger Probe Bloomberg News reported in December that the US Federal Trade Commission has also made queries into the relationship between the companies. “It’s inevitable that regulators everywhere are going to look at what a company of our size and scale does,” Nadella said of the EU probe. “At the end of the day you want new entrants. That’s the core of making sure you have vibrant competition.” Nadella said his company, which received a non-voting board observer role following Altman’s return, isn’t pushing for a seat on the board. The software giant, which is OpenAI’s largest backer, has overhauled its entire product line around the technology that underlies ChatGPT, a product Nadella identified as the “first AI product that we all could relate to.” Yet, Nadella said Microsoft is not too dependent on OpenAI, noting that OpenAI relies on Microsoft for key parts of the technology it needs to create its products, and that Microsoft is also researching and developing its own AI programs apart from its partner. “I feel very good about the construct we have,” he said about the partnership. “I feel at the same time very capable of controlling our own destiny.” Read More: Davos Live: Zelenskiy to Meet With Dimon in Hunt for Cash As the use of AI evolves, it will enable new interfaces and new models for apps, Microsoft sees the opportunity to participate in hardware that takes advantage of the developments, he said. Though Microsoft last week passed Apple Inc. as the most valuable company by market capitalization, Nadella isn’t overly impressed with the milestone, which he called a “lagging indicator.” Read More: Microsoft Dethrones Apple as Most Valuable Stock in the World “The last thing you want to do is to fixate on the stock price, which we know means nothing in terms of what happens tomorrow, especially in our industry,” he said. “Quite frankly the problem, in some sense, is for all of us whether we can bet it all on what comes next.” (Updates with details of antitrust investigations from first paragraph.) Most Read from Bloomberg Businessweek The Downfall of Diddy Inc. How Sweden Quit Smoking Without Quitting Nicotine The Bitcoin Hype Is Back and About Just as Hollow as Before Japan’s Market Roars Back to Life—With Old-Timers Leading the Way ©2024 Bloomberg L.P. Related Quotes "
}