{
    "title": "Microsoft Surface Go 4: The Tablet That Knows What It Needs To Do",
    "date": "2/19/2024",
    "url": "https://www.forbes.com/sites/ewanspence/2024/02/19/microsoft-surface-go-4-review-windows-11-business-enterprise-tablet/",
    "text": "Microsoft’s Surface Go 4 has many compromises, but this small Windows 11 tablet-styled device knows exactly what it wants to achieve. It may not be a popular choice for consumers, but this is one for enterprise customers. Microsoft Surface Go 4 One of the things to remember about the Surface Go 4 is that it is primarily a machine for front-line business operations. As such, it’s not available directly to consumers; you’ll have to go through Microsoft’s reseller networks for business. That doesn’t mean it’s not going to be seen in the wild—the Go 4 will work well in some education settings—but it means that there are different priorities. Considerations around battery life, the extra cost of a keyboard, or the slower processor all matter. However, the Go 4 should be seen as a computer for specific purposes rather than an all-rounder that needs to be ready to do anything and everything. Enterprise priorities are different to consumers. Microsoft Surface Go 4 Take the older design language. It’s why the Go 4 has such large bezels. This old style is a feature. It means that the existing peripherals for the previous Surface Go tablets retain compatibility with the new model. This, in turn, means any installations that are already in place can be reused with the newer hardware. Reusing old equipment with newer silicon will prove attractive when budgets are tight. Servicing options should be considered as well. It seems obvious that spare parts should be easily available, but this is rarely the case with consumer devices. The Surface Go 4 goes further than most consumer devices, with parts readily available for service centres and some on-site replacements. Key parts such as the battery, display and motherboard are available, as are a replacement type cover port and the kickstand. This doesn’t mean they are plug-and-play; some work is required to get to the parts, but it is neither onerous nor discouraged. Other Surface devices with a focus on business have an easily accessible SSD, which can be removed either to swap out hardware and retain data or to remove any sensitive data if a device has to be sent away for repair. Given the focus on security, the Go 4 not having this option feels like a lost opportunity. Still, I wonder if retaining identical capabilities across the generations played a part in this decision. Much of that security comes from using Windows 11’s Secured-core PC, one of the highest levels that Microsoft offers, and is targeted at businesses with sensitive data. It also offers remote management of the hardware and software for admins. Microsoft Surface Go 4 Microsoft has increased the specifications compared to the Surface Go 3; the Pentium chips are no more, and the Intel N200 is running the show. The anaemic option of 4GB of memory is also out the door, with the base model offering 8GB of memory and 64GB of storage (with options to upgrade to 128GB or 256GB). Together, these address one of the biggest concerns around the Go 3: performance. With its Pentium chip and 4GB of memory, the low-end model was limited to little more than one or two basic tasks… good enough for a point-of-sale terminal but not much else. The N200 is still sluggish compared to many consumer devices with higher-specced Intel Core chipsets, but the balance point in an enterprise and consumer device is different. Battery life has been improved, with Microsoft bumping up the expected battery life to 12 and a half hours. In real-world testing, ten hours is achievable, especially when you remember that heavy and demanding apps such as streaming video and media creation may not be high up on the apps used. Microsoft has also shaved 23g off the weight compared to the Go 3. Given that the Go 4 can be used as a handheld tablet for much of the day, any savings here will have benefits throughout the working day. The specs alone should tell you that the Surface Go 4 is not destined to be a killer machine for consumers. Put one or two well-chosen apps on it and nothing else, and you can see where Microsoft intends the Surface Go 4 to work. That's on a business’ frontline, where roles don’t need a tablet with excess potential, a laptop with high-powered GPUs, or desktops that offer extensive surface areas for drafting and artwork. The roles in the field need rugged machines to handle a lot of stress and impacts, point-of-sale terminals that need to run one task for weeks and months with minimal maintenance, and areas that need Windows in a light and easy-to-use package. Microsoft Surface Go 4 Microsoft’s Surface Go 4 is not as prevalent as it once was. It’s focused on delivering to a specific use case, and I’d argue that the use case is fairly narrow. This is not a machine I would recommend for consumers—there are just too many demands and potential uses outside of the Go 4’s competency. But if your needs—your business needs—need a lightweight tablet-styled Windows device that can sit in your existing IT structures and physical fixtures, then it doesn’t matter that the use case is narrow. All that matters is it works for you. Disclaimer: Microsoft provided a Surface Go 4 for review purposes...  "
}