{
    "title": "Meet Le Chat, Mistral's ChatGPT competitor that's also — kind of — backed \nby Microsoft",
    "date": "2/26/2024",
    "url": "https://mspoweruser.com/meet-le-chat-mistrals-chatgpt-competitor-thats-also-kind-of-backed-by-microsoft/",
    "text": "Follow us Share this article Improve this guide For the premium version, Le Chat's pricing varies depending on the chosen model. 2 min. read Published on February 26, 2024 published on \n\nFebruary 26, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Mistral, one of the most exciting, up-and-coming AI companies, has finally announced its AI-powered chatbot, Le Chat. A ChatGPT competitor, Le Chat is said to be built as a “conversational entry point to interact with the various models from Mistral AI” like Mistral Large, Small, or Next. The chatbot itself is now rolling out for beta, and you can use it by signing up as a beta tester. The AI start-up is also offering an “enterprise” version with “self-deployment capacities and fine-grained moderation mechanisms.” Similar to ChatGPT, which offers free and paid tiers, Le Chat also has both free and paid options. However, unlike ChatGPT’s $20 monthly fee for its “Plus” version, Le Chat uses a pay-per-use model based on tokens. Le Chat’s pricing varies depending on the chosen model. The most affordable option, the open-mistral-7b, costs $0.25 per million tokens for both input and output. Meanwhile, the more powerful mistral-large-2402 model costs $8 per million tokens for input and $24 per million tokens for output. Interestingly, though, Microsoft and French AI startup Mistral have recently struck a deal to accelerate its AI development. The deal, whose financial details are still being kept under wrap, sends a clear message that OpenAI is not Microsoft’s “golden child” and the Redmond company isn’t completely monopolizing AI. Just like OpenAI, Mistral is now the second company to offer commercial language models on Microsoft’s Azure cloud platform. The French company is now worth around €2 billion, and for comparison, Microsoft has poured at least US$13 billion into OpenAI since 2019. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}