{
    "title": "The first users of Microsoft's Copilot AI bot ask if it's worth the money",
    "date": "2/14/2024",
    "url": "https://readwrite.com/the-first-users-of-microsofts-ai-bot-ask-if-its-worth-the-money/",
    "text": "Deanna was an editor at ReadWrite until early 2024. Previously she worked as the Editor in Chief for Startup Grind, Editor in Chief for Calendar,… AI assistants manage emails, meetings, and other tasks. Still, some people are dubious about them because of their high cost and restricted application, and the Microsoft AI bot is no exception. The Copilot AI assistant is selling well so far, but the testers who have had it for more than six months say one thing: “It is useful but often doesn’t live up to its price.” The price? $30 per person per month. With Copilot for Microsoft 365, an AI update that integrates with Word, Outlook, and Teams, it would give Microsoft one of its most significant successes in decades. Using natural language cues, it can create documents, generate text, and summarize emails using the same technology as OpenAI‘s ChatGPT. According to Microsoft, the early demand from people is unparalleled, and the businesses who have tested it have found it helpful – but Microsoft has not released any information on the number of sign-ups. Most will remember the press on the billions Microsoft bet to make this happen for the company—the $13 billion investment in OpenAI, to be precise. As a result, Microsoft’s shares have soared with the belief that this AI technology will turbocharge its revenue. An analyst with RBC Capital, Rishi Jaluria, said, “Copilot has to be a success for the stock to work.” Copilot was mentioned more than 50 times in the recent earning call. Microsoft debuted its first Super Bowl commercial in four years last Sunday, promoting Copilot as a resource that may assist entrepreneurs in achieving their goals. Microsoft has been betting that businesses would agree to sign large contracts because they want to use this particular AI. In November, when the AI software went national, businesses had to commit to at least 300 memberships for the assistant. According to a Microsoft software distributor, many people are unwilling to make such a significant investment for unproven products. Last month, Microsoft lowered its minimum requirements to allow smaller groups to use the AI software. Some businesses are reluctant to use AI technology until some of the hype dies down. According to a Boston Consulting Group survey, almost two-thirds of corporate leaders think it will take at least two years for generative AI to surpass the hype, despite stating that AI is a key priority for their organization. Most in the survey want to restrict all usage to small-scale experiments. Featured Image Credit: Photo by Tara Winstead; Pexels  The ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines. Deanna was an editor at ReadWrite until early 2024. Previously she worked as the Editor in Chief for Startup Grind, Editor in Chief for Calendar, editor at Entrepreneur media, and has over 20+ years of experience in content management and content development. Just in time for the Easter weekend’s activities, World War Z Aftermath is getting a brand-new free monster DLC. The patch adds six unique mutators to Challenge Horde Mode and...   By signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime. Explore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise. Explore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society. Empower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market. REGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website Registered Address: Clickout Media Ltd AA PH, Camilleri Buildings, Oratory Street, Naxxar, NXR 2504 Malta Company Number 103525. All Rights Reserved. "
}