{
    "title": "Microsoft Edge eats Google Chrome market share, reaches almost 13%",
    "date": "2/4/2024",
    "url": "https://www.windowslatest.com/2024/02/04/microsoft-edge-eats-google-chrome-market-share-reaches-almost-13/",
    "text": "Google Chrome continues to be the king of the browser market, but Microsoft Edge isn’t conceding and has gained a substantial lead in the last two months. Its desktop market share rose to 12.96 percent in January 2024 (11.23 percent in November 2023), as per a recent report by StatCounter. Two months back, in November 2023, Safari was in second place after Chrome. But its grip over desktop consumers took a deep plunge after that, giving more room for Edge to rise in the desktop market. Some of this growth is attributable to the multiple improvements in Edge and the integration of Copilot. Microsoft Edge’s desktop share is 12.96% of the market, which is a growth of 1.06 percentage points compared to December. Apple’s Safari maintains the third position with an 8.83% share, experiencing a drop of 0.13. Firefox follows closely in fourth place at 7.57%, down by 0.05 points. Opera rounds out the top five with a 3.23% share, witnessing the most substantial decline of 0.57. Here’s a breakdown of StatCounter’s January 2024 desktop browser share report: While Microsoft Edge is catching up on desktops, it’s not doing well in the overall market share, which includes mobiles and tablets. According to StatCounter’s all-platforms report, Edge is still stuck at the third spot with a 5.36 percent market share, while Safari hasn’t budged from the second spot with an 18.82 percent market share. The mobile and tablet market share numbers aren’t impressive, but both show small yet steady growth. The main reason behind this is the massive dominance of Chrome, Safari, and Samsung Internet, which appeal to many Android and iPhone users. Thanks to the new features, Microsoft Edge could gain more market share in the coming months. For Example, Microsoft Edge 121, now available for the Stable channel, added support for AVIF and AV1 file formats to speed up page load time. Similarly, new alerts about the latest browser updates have been moved to the Browser Essentials section. If you haven’t noticed, the “heart” icon on the Edge toolbar displays Performance and Safety cards. There’s a new E-tree feature in the Wallet that aims to increase awareness about the environment. Microsoft joined hands with the Eden Reforestation Projects and will plant a tree on your behalf after you collect 10000 points in your wallet. All you need to do is complete daily tasks and achieve the 10000 points. Here’s a list of all other improvements in Edge 121: Additionally, Microsoft is planning to take on Google Chrome on Android with extension support. As spotted by some users, Edge for Android is testing extension support. You can add popular extensions to block ads, modify page layouts, and customize it like the desktop version. Thus, it will join the small league of mobile browsers that offer extension support. It’s worth noting the feature hasn’t shipped to the Stable channel, but when it does, it will surely lure some users away from Chrome which has neglected extensions on mobile until now. About The Author Abhishek Mishra Abhishek Mishra is a skilled news reporter working at Windows Latest, where he focuses on everything about computing and Windows. With a strong background in computer applications, thanks to his master's degree, Abhishek knows his way around complex tech subjects. \r\n\r\nHis love for reading and his four years in journalism have sharpened his ability to explain tricky tech ideas in easy-to-understand ways. Over his career, he has crafted hundreds of detailed articles for publications like MakeUseof, Tom's Hardware, and more in the pursuit of helping tech enthusiasts. Featured in "
}