{
    "title": "CSCO: MSFT vs.CSCO - Assessing the Tech Stock With Higher Growth Potential",
    "date": "2/13/2024",
    "url": "https://stocknews.com/news/csco-msft-ssnlf-msft-vs-csco-assessing-the-tech-stock-with-higher-growth/",
    "text": "Login \n        Join Login \n                                            Join CSCO – The tech industry’s prospects look attractive due to widespread tech adoption and digital transformation across different sectors. While industry giants Microsoft (MSFT) and Cisco Systems (CSCO) are well-positioned to benefit, which of these has the higher growth potential? Read more to find out… Feb 13, 2024 In this article, I evaluated two tech stocks, Microsoft Corporation (MSFT) and Cisco Systems, Inc. (CSCO), to asses which tech stock has higher growth potential. After thoroughly evaluating these stocks, I think CSCO might be the superior choice for the reasons discussed in this article. The tech sector has been booming as businesses increasingly rely on technology to boost their growth. Digital transformation initiatives across sectors have been critical in fueling the industry’s expansion. Gartner anticipates global IT spending to hit $5.07 trillion in 2024, rising 8% year-over-year. Furthermore, the IT Services market in the United States has been experiencing significant growth in recent years, driven by various factors such as technological advancements, increasing demand for cloud computing, and the need for digital transformation. Revenue in the IT services market is expected to grow at a CAGR of 6.2% until 2028. MSFT gained 57.8% over the past year compared to CSCO’s 5.8% gain. The stock has gained 34.4% over the past nine months compared to CSCO’s 7% gain. However, here are the reasons why I think CSCO might perform better in the near term: Recent Developments On January 30, 2024, MSFT along with Cisco (CSCO) and Samsung Electronics Co. Ltd. (SSNLF) announced new meeting room solutions to deliver enhanced collaboration experiences for hybrid meetings. With a collective vision to enable seamless and inclusive meetings for all, the companies unveiled integrated video collaboration solutions for Cisco Room Series. Conversely, on February 6, 2024, CSCO announced Motific, CSCO’s first SaaS product that allows for trustworthy generative AI (GenAI) deployments in organizations. Born from Outshift, CSCO’s incubation business, Motific provides a central view across the entire GenAI journey, empowering central IT and security teams to rapidly deliver trustworthy GenAI capabilities across their organizations with control over sensitive data, security, responsible AI, and cost. 10 STOCKS TO SELL NOW! Recent Financial Results During the second quarter, which ended December 31, 2023, MSFT reported total revenue of $62.02 billion, up 18% year-over-year. The company’s operating income and net income increased 30% and 30% from the prior year’s quarter to $27.03 billion and $21.87 billion, respectively. Moreover, its EPS grew 27% from the previous year’s quarter to $2.99. On the contrary, CSCO’s total revenue for the fiscal first quarter, which ended October 28, 2023, increased 7.6% year-over-year to $14.67 billion. Its non-GAAP operating income increased 23.9% year-over-year to $5.37 billion. The company’s non-GAAP net income increased 27.6% over the prior year quarter to $4.53 billion. Also, its non-GAAP EPS came in at $1.11, registering an increase of 29.1% year-over-year. Past And Expected Financial Performance Over the past three years, MSFT’s revenue increased at a 14.1% CAGR. Analysts expect MSFT’s revenue to increase by 15.3% in the year ending June 2024 and 15.2% in the third quarter ending March 2024. Its EPS is expected to increase 19.2% in the year ending June 2024 and 15.5% over the fiscal third quarter (ending March 2024). Conversely, CSCO’s revenue has increased at a CAGR of 6.5% over the past three years. Its revenue is expected to increase 3% in the fiscal year ending June 2025. Its EPS is expected to increase 3.8% in the year ending June 2025. Valuation MSFT’s forward EV/EBITDA multiple of 24.88 is higher than CSCO’s 9.45. MSFT’s forward EV/Sales multiple of 12.76x is higher than CSCO’s 3.45x. Thus, CSCO is more affordable. Profitability MSFT’s trailing-12-month levered FCF margin of 25.78% is lower than CSCO’s 28.16%. In addition, MSFT’s trailing-12-month asset turnover ratio of 0.55x is lower than CSCO’s 0.61x. Thus, CSCO is more profitable. POWR Ratings MSFT has an overall rating of C, which equates to a Neutral in our proprietary POWR Ratings system. Conversely, CSCO has an overall rating of B, translating to a Buy. The POWR Ratings are calculated considering 118 different factors, with each factor weighted to an optimal degree. Our proprietary rating system also evaluates each stock based on eight distinct categories. MSFT has a D in Value. Its forward EV/Sales of 12.76x is 321.2% higher than the industry average of 3.03x. Its forward EV/EBITDA multiple of 24.88 is 55.7% higher than the industry average of 15.98. In contrast, CSCO has a C grade for Value. CSCO’s forward EV/Sales of 3.45x is 13.9% higher than the industry average of 3.03x. However, its forward EV/EBITDA multiple of 9.45 is 40.9% lower than the industry average of 15.98. Among the 43 stocks in the in the Technology – Communication/Networking industry, MSFT is ranked #17, while CSCO is ranked #5. Beyond what we’ve stated above, we have also rated both stocks for Growth, Momentum, Quality, and Sentiment. Get all MSFT ratings here. Click here to view CSCO ratings. The Winner The tech industry is seeing steady gains as a result of growing popularity of digital transformation initiatives and widespread adoption of cutting-edge technologies. Industry players such as MSFT and CSCO are well-positioned to benefit from these industry tailwinds. However, CSCO’s higher profitability and lower valuation makes it the better buy here. Our research shows that the odds of success increase when one invests in stocks with an Overall Rating of Strong Buy or Buy. View all the top-rated stocks in the Technology – Communication/Networking industry here. What To Do Next? Get your hands on this special report with 3 low priced companies with tremendous upside potential even in today’s volatile markets: 3 Stocks to DOUBLE This Year > Want More Great Investing Ideas? 3 Stocks to DOUBLE This Year Updated: 2024 Stock Market Outlook > 10 Stocks to SELL NOW! CSCO shares were trading at $49.31 per share on Tuesday afternoon, down $0.68 (-1.36%). Year-to-date, CSCO has declined -1.64%, versus a 3.96% rise in the benchmark S&P 500 index during the same period. Nidhi is passionate about the capital market and wealth management, which led her to pursue a career as an investment analyst. She holds a bachelor's degree in finance and marketing and is pursuing the CFA program.\r\n\r\nHer fundamental approach to analyzing stocks helps investors identify the best investment opportunities. More... Copyright © 2024. Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions.Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use, please see disclaimer. "
}