{
    "title": "Why Microsoft is spending billions on AI and cloud computing in Europe",
    "date": "2/21/2024",
    "url": "https://www.itpro.com/cloud/cloud-computing/why-microsoft-is-spending-billions-on-ai-and-cloud-computing-in-europe",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Microsoft is contending with huge demand for cloud computing services and lingering concerns about data sovereignty - and it’s spending big to stay ahead of competition Microsoft has announced plans to quadruple its spending on cloud computing and AI infrastructure in Spain, part of a wave of investments the tech giant has been making across Europe in recent months. The software giant said it is going to invest $2.1bn in AI and cloud infrastructure in Spain by 2025. It’s Microsoft's largest investment in Spain in its 37 years of operating there. As part of the move, Microsoft will open a data center cloud region located in Madrid, and plans to open another data center in Aragon that will serve European companies and public bodies. Across both these two sites, Microsoft said it will provide its entire range of AI offerings to Spanish and European companies. These investments can make quite a difference even outside of the technology sector. The data centers in Spain could add €8.4bn to Spanish GDP and contribute to the creation of 69,000 jobs in the period up to 2030, according to figures from tech analyst IDC. Microsoft said it will work with the Spanish government on responsible AI and support industry and government cyber security, for example, by working with the Spanish National Cybersecurity Institute and offering access to telemetry and information on potential threats and cyber attacks.  How Satya Nadella's first decade at Microsoft took it from tech giant to undisputed industry titan It’s certainly not the first big cloud and AI investment Microsoft has showcased recently. Earlier this month, it unveiled plans to invest €3.2bn in Germany, which again will be its largest investment in the country in its 40-year history of operating there. Stay up to date with the latest news and analysis from the world of cloud computing with our twice-weekly newsletter The tech giant plans to expand its data centers for cloud and AI applications and train more than 1.2 million people in digital skills by the end of 2025. Over the next two years, the company will expand its cloud region in Frankfurt am Main and its newly planned infrastructure in North Rhine-Westphalia. Microsoft said German companies and startups using its AI service include Siemens, which has developed the Siemens Industrial Copilot with the Azure OpenAI Service, and Commerzbank which is developing an AI banking avatar using Microsoft Azure AI. But that’s not all.  Microsoft believes the UK can become a \"global leader in AI\", but regulation needs fixing In November 2023, Microsoft announced it will more than double its data center footprint in the UK, with plans to spend £2.5 billion over the next three years and bring 20,000 of the “most advanced” GPUs to the UK by 2026. As part of the spending – again the single largest investment in its 40-year history in the country - Microsoft said it will grow its data center footprint across sites in London and Wales, with potential expansion into northern England. At the time, Microsoft said it would also be extending its Accelerating Foundation Models Research (AFMR) program to include prioritized access to GPUs for the UK’s science and research community, and train one million people with the skills they need to build and work with AI, including the first Professional Certificate on Generative AI. So why is Microsoft investing so much, so fast? Part of the answer is the sheer demand the tech giant is seeing from European customers. While cloud computing is not growing at the same incredible rates compared to previous years, for most organizations the direction of travel is still only towards the cloud.  Deliver engaging digital experiences across every touchpoint Worldwide spending on cloud computing is expected to top $1.3tn by 2027 according to predictions from analyst IDC. Microsoft’s Azure accounts for about a quarter of cloud infrastructure spending, according to Canalys, and that means building a lot of data centers to keep up with demand – especially if the AI boom continues because. Where those data centers are matters, too, and is likely to get more important. Data sovereignty is an increasingly big issue for all sorts of organizations. That means making sure their data is being kept in the right physical place to make sure that organizations are meeting data protection obligations and ensuring that data is protected from the prying eyes of other governments. According to tech analyst Gartner, by 2028, half of multinationals will have a digital sovereignty strategy, up from just 10% now. That means having data centers wherever the customers are, because they will increasingly want to keep their data close, too. Steve Ranger is an award-winning reporter and editor who writes about technology and business. Previously he was the editorial director at ZDNET and the editor of silicon.com. Nutanix sues Tessell over claims founders used IP to build rival products with “strikingly similar features” KubeCon 2024: All the latest news and announcements Why Python is the programming language of choice for AI developers By Steve RangerMarch 26, 2024 By Solomon KlappholzMarch 26, 2024 By George FitzmauriceMarch 26, 2024 By Emma WoollacottMarch 26, 2024 By Solomon KlappholzMarch 25, 2024 By George FitzmauriceMarch 25, 2024 By Daniel ToddMarch 25, 2024 By George FitzmauriceMarch 23, 2024 By Ross KellyMarch 22, 2024 By Solomon KlappholzMarch 22, 2024 By Solomon KlappholzMarch 22, 2024 Posted Posted Posted Posted CloudPro is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}