{
    "title": "EU Commission's use of Microsoft software breached privacy rules, watchdog \nsays",
    "date": "3/11/2024",
    "url": "https://finance.yahoo.com/news/eu-commissions-microsoft-software-breached-090403022.html",
    "text": "By Foo Yun Chee BRUSSELS (Reuters) -The European Commission's use of Microsoft software breached EU privacy rules and the bloc's executive also failed to implement adequate safeguards for personal data transferred to non-EU countries, the EU privacy watchdog said on Monday. The European Data Protection Supervisor (EDPS) ordered the Commission to take measures to comply with privacy rules and to halt data transfer to the U.S. company and subsidiaries located in third countries which do not have privacy deals with the EU, setting a deadline of Dec. 9 for both orders. The EDPS's decision followed a three-year probe triggered by worries about the transfer of personal data to the United States following revelations in 2013 by former U.S. intelligence contractor Edward Snowden of mass U.S. surveillance. \"The Commission has failed to provide appropriate safeguards to ensure that personal data transferred outside the EU/EEA are afforded an essentially equivalent level of protection as guaranteed in the EU/EEA,\" the watchdog said in a statement. The EEA, or European Economic Area, is made up of the 27 EU countries and Iceland, Liechtenstein and Norway. \"In its contract with Microsoft, the Commission did not sufficiently specify what types of personal data are to be collected and for which explicit and specified purposes when using Microsoft 365,\" the EDPS said. Microsoft 365 is the product suite that includes Word documents, Excel spreadsheets, PowerPoint presentations and Outlook emails. The data protection authority ordered the Commission to suspend all data flows resulting from its use of Microsoft 365 to the company and its affiliates and sub-processors located in countries outside Europe that are not covered by an adequacy decision. The EU has data adequacy agreements with 16 countries, including Argentina, Japan, South Korea, Switzerland, Britain and the United States. The Commission did not immediately respond to a request for comment. Microsoft said it would review the EDPS' decision and work with the EU executive to address the concerns. \"Concerns raised by the European Data Protection Supervisor relate largely to stricter transparency requirements under the EUDPR, a law that applies only to the European Union institutions,\" a spokesperson said. The EU executive was also told to take measures to ensure that its use of Microsoft 365 complies with privacy rules. (Reporting by Foo Yun CheeEditing by Helen Popper and Milla Nissi) Related Quotes "
}