{
    "title": null,
    "date": "3/12/2024",
    "url": "https://www.datacenterdynamics.com/en/news/larry-ellison-oracle-building-more-cloud-infrastructure-for-microsoft/",
    "text": "Demand for Oracle infrastructure growing fast, founder says Oracle is preparing to put its cloud infrastructure in three additional Microsoft data centers according to founder Larry Ellison. Ellison was speaking following the release of the company’s earnings for the three months to end of February, which showed revenue growth of 7 percent year-on-year, to $13.28bn. Traditionally a provider of database services, Oracle has pivoted to providing cloud infrastructure, and is making significant investments in its data center portfolio. Ellison said last year that Oracle Cloud Infrastructure (OCI) was being installed in 20 Microsoft data centers, and told analysts on Monday’s call that this figure was set to increase. The companies have been working closely together for several months, with Microsoft renting GPUs from Oracle to run the AI functions of its Bing search engine. “We're building 20 data centers from Microsoft and Azure,” Ellison said on the earnings call. “They just ordered three more data centers this quarter. They're adding to that already. And there are other multi-cloud agreements that are being signed.” On Thursday, the companies revealed they were expanding the availability of the Oracle Database@Azure service, which enables users to access Oracle services running on OCI infrastructure in Azure data centers. The partnership adds five additional regions, including a first German region in Frankfurt. Oracle’s cloud revenue was up 25 percent year-on-year, to $5.1 billion. CEO Saffra Catz said the company had added several “large new cloud infrastructure” contracts during the last three months and added that it has “many more in the pipeline.” Ellison had previously stated that Oracle plans to build 100 additional data centers to cope with cloud demand. However, the company typically leases space rather than actually building its own facilities. Speaking to analysts on Monday, Ellison claimed his company is \"building some of the largest data centers in the world.\"  The ban will likely mean more for data centers than it will for consumers He said: “We're building an AI data center in the United States where you could park eight Boeing 747 nose-to-tail in that one data center. So, we are building large numbers of data centers, and some of those data centers are smallish, but some of those data centers are the largest AI data centers in the world. “We're bringing on enormous amounts of capacity over the next 24 months because the demand is so high [and] we need to do that to just satisfy our existing set of customers.” Later in the call, Ellison indicated his claims related to an Oracle data center currently under development in Utah. It is unclear by what measure he considers this will be the world’s largest data center, but eight Boeing 747s together would total some 2,000 ft (608 m) in length. DCD has contacted Oracle for clarification. Oracle's share price rose 13 percent in extended trading on Monday following the results announcement. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}