{
    "title": "Insider Buying: Kinetik Holdings Inc. (NASDAQ:KNTK) Insider Buys 14,814 \nShares of Stock",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-kntk-insider-buying-and-selling-2024-03-18/",
    "text": "Kinetik Holdings Inc. (NASDAQ:KNTK - Get Free Report) insider Jamie Welch bought 14,814 shares of the business's stock in a transaction that occurred on Monday, March 18th. The stock was acquired at an average cost of $33.75 per share, with a total value of $499,972.50. Following the completion of the acquisition, the insider now owns 3,599,225 shares of the company's stock, valued at approximately $121,473,843.75. The acquisition was disclosed in a document filed with the SEC, which can be accessed through this hyperlink. Get Kinetik alerts:Sign UpKinetik Price Performance Shares of NASDAQ:KNTK traded up $0.33 on Monday, hitting $36.99. 2,782,320 shares of the company's stock were exchanged, compared to its average volume of 531,069. Kinetik Holdings Inc. has a 12 month low of $26.32 and a 12 month high of $37.88. The stock has a market capitalization of $5.50 billion, a price-to-earnings ratio of 16.37, a price-to-earnings-growth ratio of 2.68 and a beta of 2.79. The business's 50 day simple moving average is $33.70 and its two-hundred day simple moving average is $34.36. Kinetik (NASDAQ:KNTK - Get Free Report) last released its earnings results on Wednesday, February 28th. The company reported $1.70 earnings per share for the quarter, topping the consensus estimate of $0.46 by $1.24. Kinetik had a negative return on equity of 49.32% and a net margin of 28.57%. The business had revenue of $348.87 million during the quarter, compared to the consensus estimate of $301.49 million. During the same period last year, the company earned $0.25 earnings per share. The business's revenue for the quarter was up 18.1% compared to the same quarter last year. Equities analysts forecast that Kinetik Holdings Inc. will post 1.77 EPS for the current fiscal year. Kinetik Dividend Announcement The company also recently disclosed a quarterly dividend, which was paid on Thursday, March 7th. Investors of record on Thursday, February 22nd were issued a $0.75 dividend. The ex-dividend date was Wednesday, February 21st. This represents a $3.00 annualized dividend and a dividend yield of 8.11%. Kinetik's payout ratio is currently 132.74%. Institutional Trading of Kinetik Several institutional investors and hedge funds have recently made changes to their positions in KNTK. UBS Group AG bought a new stake in shares of Kinetik in the third quarter valued at about $84,000. Tower Research Capital LLC TRC purchased a new position in Kinetik in the third quarter valued at about $37,000. Dimensional Fund Advisors LP purchased a new position in Kinetik in the third quarter valued at about $2,099,000. Credit Suisse AG purchased a new position in Kinetik in the third quarter valued at about $724,000. Finally, Nuveen Asset Management LLC purchased a new position in Kinetik in the third quarter valued at about $2,515,000. Analyst Ratings Changes A number of research analysts recently weighed in on KNTK shares. JPMorgan Chase & Co. raised shares of Kinetik from a \"neutral\" rating to an \"overweight\" rating and raised their target price for the company from $38.00 to $40.00 in a report on Friday, March 8th. Citigroup reissued a \"neutral\" rating and issued a $35.00 target price on shares of Kinetik in a report on Tuesday, December 19th. Seven equities research analysts have rated the stock with a hold rating and five have issued a buy rating to the company's stock. According to MarketBeat.com, the company has a consensus rating of \"Hold\" and an average price target of $39.25. Read Our Latest Report on KNTKKinetik Company Profile (Get Free Report) Kinetik Holdings Inc operates as a midstream company in the Texas Delaware Basin. The company operates through two segments, Midstream Logistics and Pipeline Transportation. It provides gathering, transportation, compression, processing, stabilization, treating, storage, and transportation services for companies that produce natural gas, natural gas liquids, and crude oil; and water gathering and disposal services.Featured ArticlesFive stocks we like better than KinetikHow to Use the MarketBeat Excel Dividend CalculatorInsider Selling of Amazon Spikes in Q1, but it's Not Time to SellWhat Are Dividend Champions? How to Invest in the Champions2 Deep Value, High Yield Stocks With a Double-Digit UpsideStock Ratings and Recommendations: Understanding Analyst RatingsAre We in a Bear Market? Here are the Signs This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Trump’s “Tax Free” Retirement Strategy  (From Gold Safe Exchange) (Ad)Should you invest $1,000 in Kinetik right now?Before you consider Kinetik, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Kinetik wasn't on the list.While Kinetik currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here Elon Musk's Next MoveWondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Kinetik, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Kinetik wasn't on the list. While Kinetik currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}