{
    "title": "Could this be bigger than OpenAI? Microsoft invests billions in French \nstartup — Mistral AI is a multilingual maestro ...",
    "date": "3/2/2024",
    "url": "https://www.techradar.com/pro/could-this-be-bigger-than-openai-microsoft-invests-billions-in-french-startup-mistral-ai-is-a-multilingual-maestro-thats-almost-as-good-as-chatgpt-4",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Mistral Large, Mistral AI’s flagship commercial model, is now on Microsoft Azure It’s no secret that Microsoft is all-in when it comes to AI. The company has invested heavily in OpenAI, and added artificial intelligence to its various products and services, including introducing Copilot in Windows 11. But just because it’s invested billions in OpenAI that doesn’t mean Microsoft is ignoring other players in the AI game, as the tech behemoth has also now invested heavily in French startup Mistral AI. The multi-year partnership aims to help speed up AI innovation and debut Mistral Large on Microsoft Azure. Mistral Large, the company's flagship commercial model, is a general-purpose language model proficient in code and mathematics and can process dozens of documents in a single call. It handles French, German, Spanish, and Italian, in addition to English. According to commonly used benchmarks, it's the world's second-ranked model generally available through an API, next to GPT-4, so it's easy to understand Microsoft's interest. The alliance between the two firms focuses on three core areas: supercomputing infrastructure, market scaling, and AI research and development. Microsoft will provide Azure AI supercomputing infrastructure to deliver top-tier performance for AI training and inference workloads for Mistral AI’s flagship models. Additionally, customers will have access to Mistral AI’s premium models through the Models as a Service (MaaS) in the Azure AI Studio and Azure Machine Learning model catalog. This, coupled with Azure’s AI-optimized infrastructure and enterprise-grade capabilities, offers Mistral AI added opportunities to promote, sell, and distribute its models to Microsoft customers worldwide. “We are thrilled to embark on this partnership with Microsoft. With Azure’s cutting-edge AI infrastructure, we are reaching a new milestone in our expansion propelling our innovative research and practical applications to new customers everywhere. Together, we are committed to driving impactful progress in the AI industry and delivering unparalleled value to our customers and partners globally, said Arthur Mensch, Chief Executive Officer, Mistral AI. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. Google's non-profit arm launches AI accelerator to fund the next big thing White House demands all government agencies must appoint an AI officer to help mitigate risks I lived with Samsung’s S95D QD-OLED TV for a week, and it’s a game changer By Darren AllanMarch 29, 2024 By Maxime VermeirMarch 29, 2024 By Lee McClendonMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Marc McLarenMarch 29, 2024 By Cesar CadenasMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By Roland Moore-ColyerMarch 28, 2024 By Cesar CadenasMarch 28, 2024 By Wayne WilliamsMarch 28, 2024 By Craig HaleMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}