{
    "title": "Great Ajax (NYSE:AJX) Stock Rating Reaffirmed by B. Riley",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-ajx-reiterated-rating-2024-03-21/",
    "text": "Great Ajax (NYSE:AJX - Get Free Report)'s stock had its \"buy\" rating reiterated by research analysts at B. Riley in a note issued to investors on Thursday, Benzinga reports. They presently have a $6.00 price objective on the real estate investment trust's stock, down from their prior price objective of $8.00. B. Riley's price objective indicates a potential upside of 60.43% from the company's previous close. Other equities analysts have also issued research reports about the stock. JMP Securities lowered shares of Great Ajax from an \"outperform\" rating to a \"market perform\" rating in a research report on Friday, January 12th. StockNews.com upgraded shares of Great Ajax from a \"sell\" rating to a \"hold\" rating in a research report on Sunday. View Our Latest Stock Report on Great Ajax Great Ajax stock traded up $0.14 during mid-day trading on Thursday, reaching $3.74. The company's stock had a trading volume of 128,251 shares, compared to its average volume of 197,333. Great Ajax has a twelve month low of $3.30 and a twelve month high of $7.20. The firm has a market cap of $102.70 million, a price-to-earnings ratio of -1.92 and a beta of 1.88. The company has a current ratio of 1.99, a quick ratio of 1.99 and a debt-to-equity ratio of 1.86. The business has a 50 day moving average price of $4.73 and a 200-day moving average price of $5.20. Great Ajax (NYSE:AJX - Get Free Report) last released its quarterly earnings results on Monday, February 26th. The real estate investment trust reported ($0.07) EPS for the quarter, missing the consensus estimate of $0.21 by ($0.28). The firm had revenue of $17.66 million for the quarter, compared to analyst estimates of $5.65 million. Institutional investors have recently bought and sold shares of the stock. Beach Point Capital Management LP acquired a new stake in Great Ajax in the 4th quarter valued at about $12,051,000. EMG Holdings L.P. lifted its holdings in Great Ajax by 608.3% in the 4th quarter. EMG Holdings L.P. now owns 1,940,649 shares of the real estate investment trust's stock valued at $10,285,000 after acquiring an additional 1,666,666 shares during the last quarter. Cannell Capital LLC acquired a new stake in Great Ajax in the 4th quarter valued at about $1,716,000. Alberta Investment Management Corp acquired a new stake in Great Ajax in the 3rd quarter valued at about $1,817,000. Finally, BlackRock Inc. lifted its holdings in Great Ajax by 25.8% in the 3rd quarter. BlackRock Inc. now owns 1,315,860 shares of the real estate investment trust's stock valued at $9,882,000 after acquiring an additional 269,557 shares during the last quarter. Institutional investors and hedge funds own 58.60% of the company's stock. Great Ajax Corp. operates as a mortgage real estate investment trust. It acquires re-performing and non-performing loans; acquires or originates small balance commercial mortgage loans that are secured by multi-family residential and commercial mixed use retail/residential properties; and invests in single-family and smaller commercial properties.See AlsoFive stocks we like better than Great AjaxESG Stocks, What Investors Should KnowGoogle and Meta Circling the Market on a TikTok Ban RallyHow to Use the MarketBeat Dividend CalculatorIntuitive Machines: Charting a Course Among the StarsOverbought Stocks Explained: Should You Trade Them?KB Home’s Stock Price Can Move Higher, Here’s Why Before you consider Great Ajax, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Great Ajax wasn't on the list. While Great Ajax currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering where to start (or end) with AI stocks? These 10 simple stocks can help investors build long-term wealth as artificial intelligence continues to grow into the future. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}