{
    "title": "Veeam to Jointly Develop AI Solutions with Microsoft for Industry's #1 Data \nProtection and Ransomware Recovery ...",
    "date": "3/7/2024",
    "url": "https://finance.yahoo.com/news/veeam-jointly-develop-ai-solutions-120500290.html",
    "text": "Veeam to co-sell newly announced Veeam Data Cloud for Microsoft Azure and for Microsoft 365 with Microsoft which builds on the world’s #1 data protection solution protecting over 18 million Microsoft 365 users SEATTLE, March 07, 2024--(BUSINESS WIRE)--Veeam® Software, the #1 leader in Data Protection and Ransomware Recovery by market share, today announced an extended, five-year strategic partnership with Microsoft to innovate new solutions for protecting customers by integrating Veeam’s product family and Microsoft Copilot and AI services. In addition to joint innovation, the companies will bring to market data protection for Microsoft 365 and Microsoft Azure with the recently announced Veeam Data Cloud. Through a multi-year engineering collaboration, Veeam and Microsoft will develop capabilities to keep organizations running in the face of increasing cybersecurity attacks, outages, and natural disasters. The combination of Veeam’s market-leading backup and recovery capabilities matched with the breadth of Microsoft’s innovation and scale will help customers ensure cyber resiliency. \"Organizations are driving transformation through investments in cloud computing and adoption of software-as-a-service,\" said Anand Eswaran, CEO at Veeam. \"Veeam protects 450,000 organizations – more than any other data backup and recovery vendor. Veeam’s solution for Microsoft 365 data protection provides the fastest data restores available. Extending our partnership with Microsoft brings the benefits of Veeam technology – in both data protection and ransomware recovery – to even more customers using Microsoft 365 and Microsoft Azure. This partnership will also deliver incredible joint innovation, including bringing the capabilities of Microsoft Copilot to the Veeam product family.\" \"As customers continue moving to the cloud and adopt generative AI capabilities, protecting their data remains our top priority,\" said Judson Althoff, executive vice president and chief commercial officer at Microsoft. \"Together with Veeam, we are already helping millions of users fully protect their business data across Microsoft 365 and Microsoft Azure. I am pleased to build on our collaboration by combining Microsoft’s Copilot and Azure with Veeam’s data protection solutions to help our customers back up, protect, and recover their data estate better and faster than ever before.\" Veeam and Microsoft Partnership Highlights: The collaboration between Veeam and Microsoft is expanding across multiple dimensions, including: Joint development work to bring additional AI capabilities to Veeam backup and recovery products, including integrating Microsoft Copilot for automated data analysis, cost-effective insights powered by AI and easier data visualization. Integrated support of the latest APIs for Microsoft 365 Backup Storage to enable accelerated backup and restore speeds within Veeam Backup for Microsoft 365. Joint go-to-market activities to co-sell Veeam’s protection and recovery capabilities for Microsoft 365 and Microsoft Azure customers. Launch of new Veeam backup and recovery capabilities for Microsoft Azure. Accelerating on-premises customer migration to the Veeam Data Cloud hosted on Azure. Customer migration to and protection of Azure Kubernetes Services with Kasten by Veeam. Veeam Protection and Ransomware Recovery Capabilities for Microsoft Customers Veeam provides a broad set of capabilities to help customers protect and recover Microsoft 365 and Microsoft Azure data: Securely protect critical Microsoft 365 apps and data from cyberthreats with access controlled, logically air-gapped, and immutable backups – and assured, fast recovery every time. Restore anywhere, with the industry leader in rapid recoverability, and get business running 5x faster with advanced monitoring and reporting. Unified protection of Microsoft-hosted IaaS, PaaS, and SaaS data under a single, easy-to-use web console that scales to the largest enterprises. Speed time to value with instant readiness and intuitive, policy-based automation that starts protecting data in just minutes and provides over 50 recovery options. Lower the total cost of ownership (TCO) by storing compressed backups on cost-effective yet durable Azure Blob storage for cost optimization. Veeam Data Cloud Veeam Data Cloud, which is built on Microsoft Azure, delivers the confidence and reliability of the industry’s leading platform with the ease and accessibility of a cloud service. Veeam Data Cloud provides backup-as-a-service (BaaS) for Microsoft 365 and Microsoft Azure, enabling radical resilience and leveraging powerful data protection and security technology within a simple, seamless user experience. Registration open for VeeamON 2024 Registration is now open for the 10th annual VeeamON event, June 3 - 5, 2024, at the Diplomat Resort in Fort Lauderdale, Florida. Register now for a limited-time 10-year anniversary rate. For more information on Veeam, visit https://www.veeam.com. Customer Quotes \"Alongside our customers, we push the boundaries of what control software can do. By protecting every facet of our environment with Veeam, from VMs to containers to Microsoft 365, we have the immediate access to data we need to maintain our position at the leading edge.\" – Jan Fox-Gerlach, Information Coordination at ITK Engineering GmbH \"Veeam is the most complete backup solution for Microsoft 365. It’s scalable, easy to use and plays a significant role in our business continuity and disaster recovery strategy. By protecting Microsoft 365 data, Veeam helps us deliver the ultimate experience for our customers.\" – Lazaros Kalafatas, Servers Engineering Manager at Piraeus Bank S.A. About Veeam Software Veeam, the #1 global market leader in data protection and ransomware recovery, is on a mission to help every organization not just bounce back from a data outage or loss but bounce forward. With Veeam, organizations achieve radical resilience through data security, data recovery, and data freedom for their hybrid cloud. The Veeam Data Platform delivers a single solution for cloud, virtual, physical, SaaS, and Kubernetes environments that gives IT and security leaders peace of mind that their apps and data are protected and always available. Headquartered in Columbus, Ohio, with offices in more than 30 countries, Veeam protects over 450,000 customers worldwide, including 74% of the Global 2000, who trust Veeam to keep their businesses running. Radical resilience starts with Veeam. Learn more at www.veeam.com or follow Veeam on LinkedIn @veeam-software and X @veeam. View source version on businesswire.com: https://www.businesswire.com/news/home/20240307532711/en/ Contacts Veeam SoftwareDirector, Global Public RelationsHeidi Monroe Kroft, 614-339-8200 x8309 "
}