{
    "title": "Satya Nadella says there's a 'fundamental truth' that will save Windows \nPhone",
    "date": "3/25/2024",
    "url": "https://ca.style.yahoo.com/finance/news/satya-nadella-says-theres-fundamental-191752474.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. (Flickr/Fortune Brainstorm TECH 2014) Microsoft CEO Satya Nadella  Microsoft knows that it's basically lost on mobile, but the company thinks that with Windows 10 on the desktop is going to change the game for Windows Phone, CEO Satya Nadella told ZDNet in an interview. \"The fundamental truth for developers is they will build if there are users. And in our case the truth is we have users on desktop,\" Nadella says. The other ugly truth here is that Windows Phone, Microsoft's late-to-market (but still pretty good) phone platform, has only three percent market share — which created a vicious cycle of developers not bothering to write Windows Phone apps, because of a low installed base, which was created by a lack of apps. But Nadella says Windows 10 on desktop — with its goal of hitting one billion computers — is going to drive more developers to create more apps that people just have to have on their phones, too. And Windows Phone will be the easiest and best way for them to get those apps. A key part of Microsoft's Windows 10 strategy hinges on \"universal apps\": apps that a developer can write once, and have it run on any Windows 10 device, from the desktop to Xbox to HoloLens, with minimal changes to the code — hopefully breaking that vicious cycle. \"Even if you want to come to Windows because of HoloLens, you want to come to it because of Xbox, you want to come to the desktop, all those get you to the phone,\" Nadella says. \"And by the way, when we hook them on that, we have a phone app,\" Nadella says. It's actually why Windows 10 features a more streamlined Start menu, Nadella says: It's about putting the Windows Store front-and-center. (Flickr/Kārlis Dambrāns) Nokia Lumia But there's a weird flaw in Nadella's thinking: Apple and Google both control massive mobile marketshare, meaning that any of those apps (like Airbnb) will probably also have Android and iPhone versions, in addition to the Windows 10 app. If the same app is available everywhere, across platforms, there's not much incentive to go with Windows 10 Mobile, even if you do want that same app. It's almost a matter of fantasy vs. reality: On the one hand, Microsoft says that Windows 10 is going to be the most attractive platform for developers, anywhere, and is taking steps to make it easier for them to move their Android and iOS apps to Windows. On the other, Microsoft is actually taking steps to make it easier for Windows developers to write apps for iOS and Android with moves like its close partnership with app development startup Xamarin. Which isn't to mention Microsoft's own commitment to making productivity apps for Apple and Google phones. So Microsoft may be saying that Windows Phone still has a chance, but its actions suggest it's hedging pretty strongly in case that doesn't turn out to be the case. NOW WATCH: This is Microsoft's ambitious plan to own virtual reality More From Business Insider Here are the businesses that Microsoft should kill next There's a bigger change that's becoming clear from Microsoft's layoffs Satya Nadella explains Microsoft's one big mistake — and resolves not to make it again \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th  This food habit is linked to a specific type of dementia. \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76.  Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Seven reportedly cost $20 million Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story.  \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. They soft-launched their relationship at the supermodel's cookbook event in Miami.  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The \"Late Night\" comedian brutally summed up the former president's media company. Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Meghan Markle is reportedly anxious about returning to England with Prince Harry in May for the 10-year anniversary of the Invictus Games. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}