{
    "title": "Microsoft spends big on data center land near Gainesville",
    "date": "3/1/2024",
    "url": "https://www.insidenova.com/news/politics/microsoft-spends-big-on-data-center-land-near-gainesville/article_d14dc65e-d802-11ee-ac73-7396818a621f.html",
    "text": "  Microsoft Corp. acquired vacant property zoned for data centers in Gainesville. Microsoft Corp. recently acquired vacant property zoned for data centers in Gainesville for more than $465 million, according to a Washington Business Journal report. The publication reports the property comprises about 124 acres across two parcels at 13490 University Blvd. and 5941 Wellington Road, directly south of Conway Robinson State Forest and Manassas National Battlefield Park, near where the contentious PW Digital Gateway data center corridor is primed for development. The properties were sold for $465.5 million by 41992 John Marshall Highway LLC, an entity closely associated with JK Land Holdings LLC, a land acquisition firm managed by Loudoun-based logistics and data center mogul Chuck Kuhn, according to the Washington Business Journal. A spokesperson with JK Land Holdings verified the legitimacy of the sale but otherwise declined to comment. Microsoft could not be immediately reached for comment. Both parcels’ existing heavy industrial zoning designation already accommodates data center development. But a rezoning application submitted to Prince William County last year for the University Boulevard site is seeking an allowance for up to nearly 4 million square feet of data centers and a new electric substation. County documents show the Wellington Road parcel sits on land that was previously home to the Atlantic Research Corporation, which operated a rocket and missile production and testing facility under contract with the U.S. Department of Defense until 2005 when it was decommissioned. The University Boulevard site is nearby. A nearby 181-acre property on the former Atlantic Research Corporation site was sold in 2017 to Delaware-based Sharpless Enterprises LLC, which is now aiming to construct a data center hub with multiple buildings pending approval from the U.S. Army Corps of Engineers.        Keep at it Al. So the patriot does so little actual work at his job (that sucks up taxpayer money) he admits to having 5 weeks of free time throughout the year to do pro bono work. Also he takes credit for 150000 hours of volunteering \"we\" performed when in actuality he just spent his time looking at a spreadsheet telling others to get their hands dirty. Keep at it Al. So the patriot does so little actual work at his job (that sucks up taxpayer money) he admits to having 5 weeks of free time throughout the year to do pro bono work. Also he takes credit for 150000 hours of volunteering \"we\" performed when in actuality he just spent his time looking at a spreadsheet telling others to get their hands dirty. Nothing to get excited about here. Just another big data center property changing hands between two fat cats.The notable aspect of the story is the price paid: $465.5 million for 124 acres. That’s more than $3.75 million per acre.Those parcels are part of a huge 415 acre area south of I-66 that used to comprise the old Atlantic Research Corporation missile testing facility which will eventually comprise more than 8.4 million square feet of data centers.How much longer will it be until the 115-acre Jiffy Lube Live concert venue just across the street falls to the data center juggernaut? At $3.75 million per acre, they’ll be hard pressed to sell enough tickets to make the concert business worth their while. I suspect they will soon be playing a new tune there. Nothing to get excited about here. Just another big data center property changing hands between two fat cats. The notable aspect of the story is the price paid: $465.5 million for 124 acres. That’s more than $3.75 million per acre. Those parcels are part of a huge 415 acre area south of I-66 that used to comprise the old Atlantic Research Corporation missile testing facility which will eventually comprise more than 8.4 million square feet of data centers. How much longer will it be until the 115-acre Jiffy Lube Live concert venue just across the street falls to the data center juggernaut? At $3.75 million per acre, they’ll be hard pressed to sell enough tickets to make the concert business worth their while. I suspect they will soon be playing a new tune there. Interesting point there. I wonder if liberal communities prefer the hum of data centers over guitar amps. I guess one is never ending though. Interesting point there. I wonder if liberal communities prefer the hum of data centers over guitar amps. I guess one is never ending though. Sorry, but I can’t stay silence on this. Don’t be fooled by “Educated Patriot”. He’s no Patriot and he was educated by the left. It’s very clear from his posts that he’s full of himself and more knowledgeable than everyone else. He even went so far the other day by telling everyone how much he makes. But remember, he’s a govt employee or a govt-connected employee. Without that, he’s a nobody. I can’t imagine any woman could stand to listen to him either. My guess he’s a bow-tie wearing clown. Sorry, but I can’t stay silence on this. Don’t be fooled by “Educated Patriot”. He’s no Patriot and he was educated by the left. It’s very clear from his posts that he’s full of himself and more knowledgeable than everyone else. He even went so far the other day by telling everyone how much he makes. But remember, he’s a govt employee or a govt-connected employee. Without that, he’s a nobody. I can’t imagine any woman could stand to listen to him either. My guess he’s a bow-tie wearing clown. The time for staying silent has passed. As Dan Bongino has so brilliantly stated, “cutesy time is over.” You see a lefty mouthing off, challenge his a$$! Many of others reading this no doubt have the same thoughts that you do. They agree with you but don’t want to get involved. It takes time to get an account, write coherently, etc. I say to those people, I understand, I’m spending way too much time here, too. But I can’t sit idly by and watch people like Educated Patriot, those who clearly hate what we represent and the country we envision, regurgitate garbage unchecked. No way. Pick your battle and win it. If it’s here against “Educated Patriot” then so be it, win it. If it’s against liberals elsewhere, win it. Make your stand and join the fight. Your actions will inspire others to do the same. The time for staying silent has passed. As Dan Bongino has so brilliantly stated, “cutesy time is over.” You see a lefty mouthing off, challenge his a$$! Many of others reading this no doubt have the same thoughts that you do. They agree with you but don’t want to get involved. It takes time to get an account, write coherently, etc. I say to those people, I understand, I’m spending way too much time here, too. But I can’t sit idly by and watch people like Educated Patriot, those who clearly hate what we represent and the country we envision, regurgitate garbage unchecked. No way. Pick your battle and win it. If it’s here against “Educated Patriot” then so be it, win it. If it’s against liberals elsewhere, win it. Make your stand and join the fight. Your actions will inspire others to do the same. Yes, leftists have even infiltrated the Marine Corps. We know who they are though, and when the political winds change course I have a feeling most will frantically scurry to the contracting/consulting world. You guys can all compare Power Point Ranger badges and have great discussions about the wars you didn’t fight in. Yes, leftists have even infiltrated the Marine Corps. We know who they are though, and when the political winds change course I have a feeling most will frantically scurry to the contracting/consulting world. You guys can all compare Power Point Ranger badges and have great discussions about the wars you didn’t fight in. \"If it’s against liberals elsewhere, win it. Make your stand and join the fight.\"Your whole identity is hating on those that have a different opinion, how sad. \"If it’s against liberals elsewhere, win it. Make your stand and join the fight.\" Your whole identity is hating on those that have a different opinion, how sad. Al has never been in the military.Al doesn't support sexual harassment policies because they are \"woke\".Al has no idea what a man is supposed to be and what to stand for.Al embodies all of the incel thoughts and dreams that are consistent with misogynists.Al can't get laid. Al has never been in the military. Al doesn't support sexual harassment policies because they are \"woke\". Al has no idea what a man is supposed to be and what to stand for. Al embodies all of the incel thoughts and dreams that are consistent with misogynists. Al can't get laid. That's all EP has. Self-centered, divorced, tranny, mentally unstable. That's all EP has. Self-centered, divorced, tranny, mentally unstable. Yeah, we got ourselves a real John J Rambo here, boys!! Guy’s a war hero! He never left the FOB, but he did consume more than his fair share of chow at KBR DFAC. Filled his belly up good! Yeah, we got ourselves a real John J Rambo here, boys!! Guy’s a war hero! He never left the FOB, but he did consume more than his fair share of chow at KBR DFAC. Filled his belly up good! CABs and Bronze Stars: The participation trophies for GWOT-era officers everywhere.I knew officers who got blanket-awarded CABs and put in for Bronze Stars for literally doing their job. There's a reason why people view them as a joke nowadays, which is kind of sad. CABs and Bronze Stars: The participation trophies for GWOT-era officers everywhere. I knew officers who got blanket-awarded CABs and put in for Bronze Stars for literally doing their job. There's a reason why people view them as a joke nowadays, which is kind of sad. If you use Microsoft 360, don't bother complaining.Your \"work from anywhere\" office suite and apps doesn't work without Data Centers.If you are using Office 2007 and store everything on a thumbdrive, then never mind. I guess you have something to complain about. If you use Microsoft 360, don't bother complaining. Your \"work from anywhere\" office suite and apps doesn't work without Data Centers. If you are using Office 2007 and store everything on a thumbdrive, then never mind. I guess you have something to complain about. You must not live in Gainesville, Cloud.-“Borders are unnecessary, everyone is welcome in America.” (says every resident on Martha Vineyard)-Martha’s Vineyard has the capability, capacity, and desire to welcome migrants (said no resident of Martha’s Vineyard, ever)-“Data centers are essential to the growth and development of our fine region.” (says every lefty in Leesburg, Arlington, and Falls Church)-“Leesburg, Arlington, and Falls Church are excellent locations to construct more data centers” (said no lefty in Leesburg, Arlington, or Falls Church, ever)Basically, the theme is… “It’s all great stuff and I wholeheartedly support it, 100%!!!! I just I don’t want to have to see it, smell it, taste it, or be inconvenienced by it. But I think it’s wonderful for those guys over there” You must not live in Gainesville, Cloud. -“Borders are unnecessary, everyone is welcome in America.” (says every resident on Martha Vineyard) -Martha’s Vineyard has the capability, capacity, and desire to welcome migrants (said no resident of Martha’s Vineyard, ever) -“Data centers are essential to the growth and development of our fine region.” (says every lefty in Leesburg, Arlington, and Falls Church) -“Leesburg, Arlington, and Falls Church are excellent locations to construct more data centers” (said no lefty in Leesburg, Arlington, or Falls Church, ever) Basically, the theme is… “It’s all great stuff and I wholeheartedly support it, 100%!!!! I just I don’t want to have to see it, smell it, taste it, or be inconvenienced by it. But I think it’s wonderful for those guys over there” I think we’d all like to hear why you think I “probably can’t afford the real estate” in Ashburn. What is it about me that gives you that impression? Is it because I mock you? Is it because I have the testicles that you lack? This ought to be good, don’t disappoint, loser. I think we’d all like to hear why you think I “probably can’t afford the real estate” in Ashburn. What is it about me that gives you that impression? Is it because I mock you? Is it because I have the testicles that you lack? This ought to be good, don’t disappoint, loser. Loser, this is actually very disappointing. I was expecting way more from an elite, Ivy League grad. Once again though, you demonstrated how you slipped through the cracks. Or maybe it’s because you’re just frail and weak and lack a fighting spirit, especially when the sun goes down. Perhaps it’s a combination of all.-TA covered almost all education funds, which I am still very thankful for. Big 12 school, solid program with challenging professors - I got a lot out of it. Great experience.-I have no resentment at all for those who have attended prestigious universities, I just don’t like you. The Military Academy has to be disappointed in you as well, General Patton wouldn’t be doing any bragging about you, that’s for damn sure. Too much “I” in your communication, not a team oriented type guy. Have you ever even played organized, competitive sports?-Still work with the Marine Corps, yes. Because I can and also because I love it. I also do some volunteer work, can you guess why? Yeah, because I can and because I love doing it. You’re not the volunteering type though are you? Clearly not. But if you ever get bored with self oriented service, you should consider serving others for once in your life. Oh, you should also ask around to see if anyone found the balls that you’re missing. Loser, this is actually very disappointing. I was expecting way more from an elite, Ivy League grad. Once again though, you demonstrated how you slipped through the cracks. Or maybe it’s because you’re just frail and weak and lack a fighting spirit, especially when the sun goes down. Perhaps it’s a combination of all. -TA covered almost all education funds, which I am still very thankful for. Big 12 school, solid program with challenging professors - I got a lot out of it. Great experience. -I have no resentment at all for those who have attended prestigious universities, I just don’t like you. The Military Academy has to be disappointed in you as well, General Patton wouldn’t be doing any bragging about you, that’s for damn sure. Too much “I” in your communication, not a team oriented type guy. Have you ever even played organized, competitive sports? -Still work with the Marine Corps, yes. Because I can and also because I love it. I also do some volunteer work, can you guess why? Yeah, because I can and because I love doing it. You’re not the volunteering type though are you? Clearly not. But if you ever get bored with self oriented service, you should consider serving others for once in your life. Oh, you should also ask around to see if anyone found the balls that you’re missing. \"If you use Microsoft 360, don't bother complaining.\"For work? Eh, I still have to deal with Microsoft's adware (fun fact: MS shares your data with over 800 external companies, nearly all of which are ad agencies).For personal use? I ditched Windows years ago for Linux and never looked back. MS hasn't released a decent OS since XP. LibreOffice is also a great alternative to the 360 suite, it actually runs well and doesn't sacrifice core functionality for gimmicky features that nobody wants. \"If you use Microsoft 360, don't bother complaining.\" For work? Eh, I still have to deal with Microsoft's adware (fun fact: MS shares your data with over 800 external companies, nearly all of which are ad agencies). For personal use? I ditched Windows years ago for Linux and never looked back. MS hasn't released a decent OS since XP. LibreOffice is also a great alternative to the 360 suite, it actually runs well and doesn't sacrifice core functionality for gimmicky features that nobody wants. So you need Microsoft 360 for work. Thanks for confirming. Whether you like Microsoft products is not really relevant.LibreOffice also uses the cloud.Point is you need data centers for your work, at least in part. So do the vast majority of the people living in DC Metro.\"Educated Patriot\" is right. Lots of people who rely on data centers are co-existing without any issues. And Loudoun County collects huge tax revenues which benefits everyone.The data center critics are wrong. There are tons of data centers in Virginia and those areas are thriving and the same will be said of Western PWC after the Digital Gateway is built. So you need Microsoft 360 for work. Thanks for confirming. Whether you like Microsoft products is not really relevant. LibreOffice also uses the cloud. Point is you need data centers for your work, at least in part. So do the vast majority of the people living in DC Metro. \"Educated Patriot\" is right. Lots of people who rely on data centers are co-existing without any issues. And Loudoun County collects huge tax revenues which benefits everyone. The data center critics are wrong. There are tons of data centers in Virginia and those areas are thriving and the same will be said of Western PWC after the Digital Gateway is built. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Real-time social media posts from local businesses and organizations across Northern Virginia, powered by Friends2Follow. To add your business to the stream, email cfields@insidenova.com or click on the green button below. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: Get up-to-the-minute news sent straight to your device. "
}