{
    "title": "Microsoft launches AI Odyssey to skill 100,000 developers in India in \nlatest AI technologies and tools - Microsoft Stories ...",
    "date": "1/8/2024",
    "url": "https://news.microsoft.com/en-in/microsoft-launches-ai-odyssey-to-skill-100000-developers-in-india-in-latest-ai-technologies-and-tools/",
    "text": "January 8, 2024\t\t\t\n\t\t\t | Microsoft Source The month-long program has two levels that developers need to complete for a chance to win VIP passes to Microsoft’s upcoming AI Tour New Delhi, January 8, 2024: Microsoft today announced the launch of an initiative that aims to skill 100,000 developers in India in the latest AI technologies and tools. The program offers comprehensive learning experience that helps developers acquire and demonstrate the relevant skills needed to execute critical projects using AI technologies that align with business goals and outcomes. With AI revolutionizing the way we work and live, India needs a skilled workforce that can use AI to solve complex problems and create value. Through programs like AI Odyssey, Microsoft is offering opportunities for developers to build solutions for India’s growth and showcase their talent to solve real-world problems. To participate in the AI Odyssey, developers need to register on aka.ms/AIOdyssey and access the learning modules and resources. The month-long program is open to all AI enthusiasts in India, regardless of experience level or background. The program has two levels that participants need to complete by January 31, 2024. The first level of the program educates participants on how to use Azure AI services to create and deploy AI solutions for different scenarios. This will give them access to useful resources, code samples, and guides to master practical AI skills. The second level of the program challenges participants to prove their AI skills by completing an online assessment with interactive lab tasks that earns them Microsoft Applied Skills credentials, a new verifiable credential that validates their ability to solve real world problems with AI. Participants completing both the levels of challenges will also stand a chance to win a VIP Pass to attend the Microsoft AI Tour in Bangalore on February 8, 2024, and witness the revolutionary impact of generative AI. The AI Tour is a one-of-a-kind event that showcases how generative AI can enable new forms of creativity, collaboration, and problem-solving. The tour features keynote sessions, demos, and workshops, where developers can learn from Microsoft experts and partners, as well as network with peers. Irina Ghose, managing director, Microsoft India, said, “AI is the future of innovation and India is leading the way with its tech talent. The Microsoft Applied Skills credential will help developers demonstrate their competence and creativity in the most in-demand AI skills and scenarios. We welcome all developers to join us in creating meaningful AI solutions that will contribute to India’s economy.” About Microsoft India Microsoft (Nasdaq “MSFT” @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more. Microsoft set up its India operations in 1990. Today, Microsoft entities in India have over 20,000 employees, engaged in sales and marketing, research, development, customer support, and industry solutions across 10 Indian cities – Ahmedabad, Bengaluru, Chennai, New Delhi, Gurugram, Hyderabad, Kolkata, Mumbai, Noida, and Pune. Microsoft offers its global cloud services from local data centers to accelerate digital transformation across Indian startups, businesses, and government organizations. Follow us: Share this page: "
}