{
    "title": "Microsoft briefly overtakes Apple as the most valuable company, Apple back \non top again",
    "date": "1/12/2024",
    "url": "https://www.firstpost.com/tech/microsoft-briefly-overtakes-apple-as-the-most-valuable-company-apple-back-on-top-again-13604682.html",
    "text": "At its peak during the session, Microsoft’s value reached $2.903 trillion, with a 2% surge. As of writing this article, Apple closed at $2.89 trillion, whereas Microsoft closed at $2.86 trillion In a significant market development on Thursday, Microsoft briefly surpassed Apple to become the world’s most valuable company for the first time since 2021. This shift occurred as Apple’s shares faced a lacklustre start to the year, fueled by growing concerns about weakening demand for its products. At its peak during the session, the company’s value reached $2.903 trillion, with a 2 per cent surge. As of writing this article, Apple closed at $2.89 trillion, whereas Microsoft closed at $2.86 trillion. The ongoing rivalry between Microsoft and Apple for the top spot has been a recurring theme over the years. Analyst Gil Luria from D.A. Davidson noted, “It was inevitable that Microsoft would overtake Apple since Microsoft is growing faster and has more to benefit from the generative AI revolution.” Microsoft’s substantial share growth is attributed to its early lead in generative artificial intelligence, primarily driven by its investment in OpenAI, the creator of ChatGPT. Microsoft’s integration of OpenAI’s technology into its suite of productivity software played a crucial role in revitalizing its cloud-computing business during the July-September quarter. In contrast, Apple grappled with diminishing demand, particularly for its flagship product, the iPhone, in the face of economic challenges in China and intensified competition from Huawei. Redburn Atlantic, in a client note on Wednesday, downgraded Apple’s shares to “neutral,” expressing concerns about China being a potential drag on performance in the coming years. At least three analysts covering Apple have lowered their ratings since the start of 2024. As of the latest close, Apple’s shares have declined by 3.3 per cent in January, while Microsoft has seen a 1.8 per cent increase. Both companies exhibit relatively high share price-to-earnings (PE) ratios, with Apple trading at a forward PE of 28 (above its 10-year average of 19) and Microsoft at around 31 times forward earnings (surpassing its 10-year average of 24). Currently, Wall Street displays a more positive outlook on Microsoft, with no “sell” ratings and approximately 90 per cent of brokerages recommending the purchase of Microsoft stock. Apple, which reached a market capitalization peak of $3.081 trillion on Dec. 14, concluded the previous year with a 48 per cent gain, slightly trailing behind Microsoft’s 57 per cent rise. Microsoft has intermittently claimed the lead over Apple as the most valuable company since 2018, with brief instances in 2021 during concerns about COVID-related supply chain shortages impacting Apple’s stock price. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}