{
    "title": "Cerence (CRNC) Benefits From Expanding Clientele, Partner Base",
    "date": "1/4/2024",
    "url": "https://finance.yahoo.com/news/cerence-crnc-benefits-expanding-clientele-160600508.html",
    "text": "Cerence CRNC is benefiting from an expanding clientele and strong partner base with its recent collaboration with technology giant Microsoft MSFT.This partnership seamlessly integrates Cerence's automotive technology and professional services with Microsoft Azure AI Services, focusing initially on enhancing in-vehicle user experiences by incorporating OpenAI's ChatGPT model through Microsoft Azure OpenAI Service.By deploying the capabilities to vehicles equipped with Cerence Assistant, the flagship in-car assistant platform, the collaboration aims to deliver added post-purchase value for automakers and elevate user interfaces.The joint venture leverages Cerence's deep expertise in transportation and Microsoft's cloud capabilities, aiming to offer powerful, unique in-car experiences while preserving automakers' differentiation and customer relationships.With continuous updates powered by Azure, Cerence solidifies its position as a leader in AI for the automotive industry, providing an enriched user experience with diverse knowledge and real-time data.  Cerence Inc. price-consensus-chart | Cerence Inc. Quote Cerence's partnership with Microsoft, merging automotive technology with Azure AI Services, aligns with its goal to redefine in-car user experiences, leveraging its robust software platform for efficient client wins and a sustained 54% global auto penetration.The company has also been benefiting from an expanding clientele with 14 strategic wins in the fiscal 2023. In fourth-quarter fiscal 2023, it secured several strategic wins, including three in automotive and another in the two-wheeler space.In addition to the Microsoft partnership, Cerence has recently collaborated with NVIDIA NVDA.Cerence introduced the Cerence Automotive Large Language Model (CaLLM), powered by NVIDIA, to revolutionize in-car computing platforms, address automaker challenges and enhance user experiences with generative AI capabilities.Cerence is making strides in the Chinese market, securing nine design wins in the fiscal 2023 and partnering with China OEM Loncin Motors to implement Cerence Ride for AI-powered voice interaction in its high-end motorcycle line. Cerence’s expanding clientele aids top-line growth. For first-quarter fiscal 2024, it expects revenues between $128 million and $132 million.The Zacks Consensus Estimate for revenues is pegged at $130.89 million, indicating year-over-year growth of 56.46%.Non-GAAP earnings for the fiscal first quarter are expected to be in the range of 84-92 cents per share.The consensus mark for earnings is pegged at 90 cents per share, unchanged in the past 30 days. Cerence currently has a Zacks Rank #2 (Buy).Cerence’s shares have declined 37.1% year to date compared with the Zacks Computer & Technology sector’s rally of 7.9%.Another top-ranked stock in the broader technology sector is Camtek CAMT, which currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.Camtek’s shares have returned 98.7% in the past six months. The long-term earnings growth rate for CAMT is pegged at 12.26%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Camtek Ltd. (CAMT) : Free Stock Analysis Report Cerence Inc. (CRNC) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}