{
    "title": "Microsoft becomes second-ever company to hit $3 trillion market value",
    "date": "1/25/2024",
    "url": "https://www.euronews.com/business/2024/01/25/microsoft-becomes-second-ever-company-to-hit-3-trillion-market-value",
    "text": "Microsoft has been valued at more than $3 trillion (€2.7 trillion), partly due to its investment in AI-based projects. Software giant, Microsoft, has surpassed a $3 trillion (€2.7 trillion) valuation, becoming the second company, after Apple, to ever reach this milestone. The achievement follows the company opting to focus on incorporating artificial intelligence (AI) into its products, which has driven investor confidence. Microsoft's stocks increased by more than 1.45% on Wednesday in New York. Last year, Microsoft, known as one of the 'magnificent seven' technology companies fueling the growth in US stock indexes, invested a substantial $10 billion (€9.2 billion) in various AI initiatives. This positioned Microsoft at the forefront of AI, surpassing younger competitors such as Google and Meta. Addressing the opportunities that AI presents, Microsoft Vice Chair and President, Brad Smith, stated in a conference in Brussels last June that these possibilities can extend from healthcare to education. \"Pancreatic cancer remains one of the most life threatening cancers for people who get it almost entirely because it is so difficult to catch in its earliest stages. But this is where we're finding that AI can detect patterns that a human doctor finds difficult to see,\" Smith said. \"It's not just better health care, it can be better education too. [...] I think it's very easy in the European Union or the United States or other places to sort of take for granted that we have easy access to doctors and teachers, and it's easy to forget that much of the world does not. This will reach people in ways that we cannot.\" Among investments in AI-related innovations, Microsoft has incorporated an AI digital assistant named Copilot into its Edge web browser and Office software. Additionally, Microsoft has recently announced a 10-year partnership with the UK telecoms company Vodafone, with the goal of assisting Vodafone in delivering generative artificial intelligence (AI), digital, enterprise, and cloud services to over 300 million businesses and consumers in Europe and Africa. As the second-largest cloud computing provider, Microsoft has also been advancing its efforts by developing its own AI-supporting chips, intensifying its competition with Amazon and Google to manage artificial intelligence tools for companies. Apple, one of the major competitors of Microsoft, achieved the same $3 trillion milestone in June last year. Since January, Microsoft shares have been in competition with Apple's for the title of the world's most valuable company, briefly surpassing the iPhone maker earlier this month. At the end of this month, Microsoft is expected to release its financial results for the second quarter of fiscal year 2024.   "
}