{
    "title": "Activision Blizzard boosted Xbox content and services revenue to 61% growth \nin Q2 2024",
    "date": "1/30/2024",
    "url": "https://www.shacknews.com/article/138531/activision-xbox-revenue-q2-2024",
    "text": "New to Shacknews? Signup for a Free Account Already have an account? Login Now Xbox content and services saw a big jump in revenue thanks to the Activision acquisition. Microsoft (MSFT) reported its Q2 2024 earnings results, and within the overall report was mention of a big bump in revenue for Xbox content and services thanks to the Activision-Blizzard acquisition. Microsoft reported a revenue increase of 61 percent from content and services year-over-year. That’s a 61 percent increase when compared to Q2 2023. Microsoft attributes 55 basis points of the content and services 61% revenue growth directly to Activision Blizzard. This information was posted under the Business Highlights section of the earnings report that Microsoft posted to its investor relations website. Microsoft detailed the net impact of the Activision Blizzard deal and last week's layoffs on the Q2 2024 earnings results conference call. $MSFT $ATVI pic.twitter.com/lLkOt2g4KL  Overall, Microsoft posted a beat for revenue and EPS expectations in its Q2 2024 earnings report. The stock, however, was down in after-hours trading following a short spike. You can keep tabs on what is now the world’s largest company by checking out the Microsoft topic page on Shacknews. Bill, who is also known as Rumpo, is a lifelong gamer and Toronto Maple Leafs fan. He made his mark early in his career through guide writing and a deep understanding of editorial SEO. He enjoys putting in the work to create a great content, be it a wild feature or grinding out an in-depth collectible guide. Tweet him @RumpoPlays if you have a question or comment about one of his articles. Bill Lavoy posted a new article, Activision Blizzard boosted Xbox content and services revenue to 61% growth in Q2 2024 "
}