{
    "title": "XLK ETF: A Better Way To Invest In Microsoft But Volatility Comes First \n(NYSEARCA:XLK)",
    "date": "1/29/2024",
    "url": "https://seekingalpha.com/article/4665881-xlk-etf-better-way-invest-microsoft-volatility-comes-first",
    "text": "da-kuk da-kuk Since my last bullish publication on the Technology Select Sector ETF (NYSEARCA:XLK) in October 2023, it has appreciated by over 20% and now trades at a little over $200. This one comes three months later but in a crucial week, both for monetary policy and tech earnings, two potential volatility-inducing events. Against such a backdrop, one would normally opt for a Hold position, but, this time also, my forecast is positive based mainly on XLK's top-holding Microsoft (NASDAQ:MSFT) and other software plays likely to benefit from AI moving towards exploitation or the usage phase. In this respect, given that the software giant is heavily overvalued as illustrated below, while XLK is rated as a strong buy by Quant, this thesis will make the case for exposure through the ETF route. Some key metrics (seekingalpha.com) Some key metrics (seekingalpha.com) I start by showing how it is the turn of the software industry to benefit from artificial intelligence after 2023 was the year of semiconductor producer Nvidia (NASDAQ:NVDA). For tech investors, last year was marked by Nvidia's meteoric rise as illustrated by the deep blue chart below resulting in gains of nearly 200%. In sharp contrast, Microsoft, in orange, delivered only one-third of the semiconductor giant's performance. Data by YCharts Now, the main reason for Nvidia's outperformance is the high demand for its H100 GPUs which are the very chips required for building infrastructures that can be used to train Generative AI LLMs (large language models), so crucial for applications like ChatGPT to function. Now, high demand has translated into pricing power signifying bumper revenues and profits, but the question is whether Microsoft can also benefit. The answer is yes if you take into account the demand for GitHub Copilot, created jointly by Microsoft-backed Open AI and GitHub, acquired by Satya Nadella's company in 2018. Looking deeper, after deploying Nvidia's chips into its infrastructure, Microsoft now proposes Generative AI models that can be used to build cutting-edge applications through its Azure cloud which is accessible throughout the world. In this way, it allows thousands of corporations that did not have the capital to purchase Nvidia's costly H100s to consume AI in an \"AI-as-a-Service\" format and pay in a pay-per-usage manner, thanks to flexible tariffs. This is the reason the company could beat analysts' consensus revenue estimates of $61.13 billion for the second quarter of fiscal 2024 during the earnings call around January 30. Any upside could also propel XLK higher, but it is also composed of other software companies as illustrated below and which could benefit too. www.sectorspdrs.com www.sectorspdrs.com One prominent example is Adobe (ADBE) which uses artificial intelligence to extend the capabilities of its technology through the development of products like Adobe Sensei, not only for creating new digital experiences but also for making use of customer data to make sales predictions. There is also Salesforce (CRM) which has announced the integration of ChatGPT into its CRM (customer relationship management) ecosystem to give rise to Einstein GPT, announced in March last year. Now, Einstein AI which uses previous flavors of AI like machine language to discover recurring patterns in data was already here before the advent of ChatGPT, but it was rapidly tweaked to Einstein GPT in only about seven months. In contrast, it takes longer for Nvidia which has to design a new chip by taking into consideration all the physical, electrical, and networking parameters and has to outsource production to Taiwan Semiconductor Company (TSM) in East Asia. Hence, from initially being announced in March 2022, it took the H100 about one year to be launched without forgetting that it is an upgrade from the A100 meaning that the total development efforts date to earlier. This difference in the time to market, or seven versus twelve months, in a way shows the agility of software companies to adapt their products to innovations. Additionally, since analysts at Oppenheimer investment firm forecast that Generative AI should positively impact every sector of the economy, this means that there is plenty of deployment work for software companies which should see the innovation adding about $280 billion of additional sales from 2023 to 2033 in what is envisaged to become a trillion-dollar market. Therefore, software companies which represent a sizable 38.87% of XLK's holdings (as shown below) could also see higher demand for their products providing them the ingredients to improve both on the topline and bottom line, in turn resulting in an appreciation of their share prices. XLK breakdown (www.sectorspdrs.com) XLK breakdown (www.sectorspdrs.com) Talking valuations, compared with Microsoft's forward P/E of 36x, XLK's multiple of 27.08x is trading at a discount of around 25% ((27.08-36)/36)), but, there is more as the ETF is undervalued compared to NVDIA's 49.74x by about 45% ((27.08-49.74)/49.74). Now, with the ETF's weight consisting of software, at the tune of 38.87% and semiconductors at 26.36% respectively, I obtain normalized discounts of 9.72% and 11.86% as tabled below. Averaging these two figures, I obtained 10.79% which applied to XLK's share price of $201.75 comes to a target of roughly $223.5. Table built using data from (www.seekingalpha.com) Table built using data from (www.seekingalpha.com) I believe this is a fair price target considering that the ETF has already produced gains of 48% in the last year alone, and there are also volatility risks lurking on the horizon, mostly due to high expectations (75%) of a rate cut in March. In this respect, the performance of equities in general is also determined by monetary policy, and in case there is a higher probability of it being loosened, it tends to rise. Now, in a week where some key economic data are released as per the table below, imagine a scenario where there are stronger than expected employment numbers for January, which could cast doubts about the downward trend seen in inflation up to now being sustainable. The Fed may also want to exercise prudence given the tensions in the Red Sea resulting in cost-push inflationary pressures. Table prepared using data from (www.marketwatch.com) Table prepared using data from (www.marketwatch.com) Thus, the Fed's chairman could delay the first rate cuts, and, there have been many such instances since 2022 with one of them being on October 19 when the tech-heavy Nasdaq Composite shed nearly 1% after Mr. Powell reiterated his stance that rates would have to stay higher to combat inflation. Moreover, there are also concentration risks emanating from Apple making up nearly 20.9% of XLK's assets. Now, analysts estimate that the iPhone maker's revenue growth for its first quarter of fiscal 2024 which ended in December 2023 would be only 0.95% YoY. However, in case its management is not able to justify the 3.4% YoY consensus estimate for its FY-2024 which ends in September, there could be a lot of volatility. For this matter, while the company certainly uses AI to enhance user experience for its devices, Apple has yet to make a public announcement as I had detailed in a previous thesis. This has become important especially after competitors Samsung's (OTCPK:SSNLF) S24 series will be equipped with LLMs as part of the Android operating system and Huawei has already carried out similar developments for its Harmony OS which drives its Mate 60 series models. Staying within the realms of growth but with a revenue diversifier narrative, one of Apple's senior executives behind Apple's electric vehicle project has made the switch to Rivian Automotive (NASDAQ:RIVN). This follows an earlier move by another executive leaving the company and joining the same automaker. Thus, investors would surely want an update on the Apple Car which could be probably launched in 2028. Therefore, unless Apple comes with a strong announcement, there should be volatility, and, with 2024 awaited as the year when the Fed eases, a lot of expectations have already been priced in tech stocks, with the XLK trading at a much higher multiple than the broader market or the S&P 500. To provide investors with an idea of XLK's rate sensibility, the blue chart below shows how it has underperformed the S&P 500 as of March 2022, when interest rates were hiked at an aggressive pace only seen during the Paul Volcker era. Thus, rates remaining higher for longer may be detrimental to the tech ETF. Data by YCharts Still, I remain bullish due to two additional factors on top of AI-driven sales opportunities. First, as shown in the introductory table, XLK enjoys superior grades when it comes to liquidity, momentum, risks, and expenses. Furthermore, its Quant score of 4.85 is only second to the VanEck Semiconductor ETF (SMH) and the iShares U.S Technology ETF (IYW). Looking further down the list there is the Vanguard Information Technology Index Fund ETF Shares (VGT), which also charges fees of 0.10% and dedicates a sizeable part of its assets, or 40.3% to software (applications and systems), but is ranked below, at the 10th position with a lower liquidity level. Second, apart from its top four holdings which collectively make up 54.45% of its weight, the Technology Select Sector ETF also consists of 60 other stocks which are broadly spread over the remaining 45.55%. These include International Business Machines (IBM) and Accenture (ACN) just to name a few which have enhanced their product offerings including consultancy services using artificial intelligence. Therefore, in addition to Microsoft, these should also gain market share from a wider diffusion of AI in corporate processes. Next, looking at XLK's other holdings, the study by Oppenheimer stipulates that AI should also touch security, data analytics, and infrastructure software companies like ServiceNow (NOW) and Palo Alto Networks (PANW), without forgetting semiconductor ones like Broadcom (AVGO) and Monolithic Power Systems (MPWR) as AI becomes pervasive everywhere. In this context, by opting for the passive ETF route, investors can avoid the hassle of searching for individual names that will benefit from artificial intelligence, in addition to obtaining nearly 23% of exposure to richly-valued Microsoft. As for Apple, given that the iPhone is the very gateway that allows people, young or old, to access and consume AI applications, any device-related update during its earning call at the very start of February can boost the stock and by ricochet, XLK. Such a catalyst is not priced at the target of $223.5 which also takes into account monetary policy-related risks. Finally, given the likelihood of a volatile week ahead, some may find it better to take a pause and wait for a better margin of safety before putting money to work, but I reiterate my buy position as during uncertainty, big tech has generally acted as a beacon of value, the theme of my earlier thesis three months earlier. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. This is an investment thesis and is intended for informational purposes. Investors are kindly requested to do additional research before investing. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}