{
    "title": "Microsoft invests £2.7bn in Germany for AI expansion and training",
    "date": "2/19/2024",
    "url": "https://www.techerati.com/news-hub/microsoft-invests-2-7bn-in-germany-for-ai-expansion-and-training/",
    "text": "  Written by Rebecca Uffindell Mon 19 Feb 2024 Microsoft has announced it will invest £2.7 billion ($4 billion) in Germany over the next two years. The President of Microsoft, Brad Smith, said its largest investment in Germany in 40 years aims to double its artificial intelligence (AI) and data centre capacity while expanding training programmes for 1.2 million people. Smith added there has been increasing demand for AI applications in economic sectors like manufacturing, automotive, financial services, pharmaceuticals, life sciences, and medical technology. “Because these industries are fundamentally changing due to economic change, it is important to equip companies in Germany with world-leading technology,” said Smith. Smith acknowledged Germany’s second-place standing in Europe for AI application creation, highlighting increased adoption by German companies. However, Germany ranks 11th in Europe for AI skills. The investment will fund the expansion of cloud capacity in Frankfurt, and the construction of data centres in the state of North Rhine-Westphalia. “Microsoft is thus promoting the necessary structural change in the Rhineland region, advancing the computing infrastructure in our country and strengthening the German ecosystem around AI,” said Chancellor Olaf Scholz. Scholz described the investment as a vote of confidence in Germany, which has also seen substantial recent investments in the battery, chip, and pharmaceutical sectors. The Prime Minister of North Rhine-Westphalia, Hendrik Wüst, echoed this sentiment, stating the billion-dollar decision signifies a significant contribution to sustainably driving forward the transformation of the German economy. “Microsoft will find an ideal location in the Rhenish Revier and thus massively advance the digital infrastructure for North Rhine-Westphalia and all of Germany,” said Wüst. Microsoft’s commitment to sustainability includes aiming to achieve 100% use of renewable energy globally for the company’s operations, including its data centres, by 2025. Microsoft’s IT infrastructure and AI platform allow businesses to create, deploy, and utilise AI models and applications, whether proprietary or open source. It also makes Microsoft’s AI-powered services, such as Microsoft 365 and Microsoft Dynamics, more widely and locally available to German customers. Microsoft aims to create a future in Germany where cloud computing is widely available, easy to access, and conducted responsibly. The tech giant has adopted a Responsible AI standard for its AI platforms and services and established an AI Assurance Program to share best practices and promote responsible AI practices. Microsoft noted that numerous German companies and startups already employ advanced AI functions. Siemens developed the Siemens Industrial Copilot with Azure OpenAI Service, streamlining complex tasks. Boehringer Ingelheim enhances its iQNow AI platform with Azure OpenAI. Bayer utilises Microsoft M365 Copilot for faster workflows. Commerzbank redesigns customer experience with an AI banking avatar using Microsoft Azure AI. As part of the investment, Microsoft said it will promote digital skill development for over 1.2 million Germans by 2025. With the partner ecosystem, the company will launch new training programmes that focus on building AI skills, and the development of AI technical capabilities. Microsoft added it will support AI transformation in enterprises while promoting the responsible development of AI. This included the first professional certificate for Generative AI. Microsoft collaborates with certified training providers, industry partners, universities, non-profits, Government agencies, and associations to actively train individuals across various fields. Partnerships with the BDA and the Federal Association of German Employers’ Association (BD) offer free, beginner-friendly learning experiences in AI, cybersecurity, and Green Digital Skills, targeting over 550,000 people. Initiatives like ‘BoostYourSkills’ with companies like Schaeffler and DHL Group aim to facilitate young people’s career starts in an increasingly digital environment. Microsoft also supports the ReDI School of Digital Integration, assisting refugees and marginalised groups in finding jobs in the German IT industry. In November, Germany, France, and Italy formulated an agreement on the regulation of AI. The three governments are in favour of binding voluntary commitments for both large and small AI providers within the European Union. This self-regulation will be enforced through adherence to predefined codes of conduct. The three governments are against adopting untested standards of rules. Instead, they said they favour relying on established codes of conduct to regulate AI. Join Big Data & AI World6-7 March 2024, ExCeL LondonBe at the forefront of change with thousands of technologists, data specialists, and AI pioneers.Don’t miss the biggest opportunities to advance your business into the future.Get Your Free Ticket Be at the forefront of change with thousands of technologists, data specialists, and AI pioneers. Don’t miss the biggest opportunities to advance your business into the future. Written by Rebecca Uffindell Mon 19 Feb 2024 March 25, 2024 March 26, 2024 March 27, 2024 March 11, 2024 March 27, 2024 March 28, 2024   EMEA report from JLL predicts strong data centre growth i... National Grid CEO forecasts energy surge driven by AI and... PIMCO launches £257M European data centre fund Pulsant opens new £4.5M data centre hall in Manchester Budget cuts threaten EU’s green and digital transit... Techerati brings you the latest business technology news for AI, big data, cloud, cybersecurity, data centres, and more. © CloserStill Media Ltd 2014-2024, All Rights Reserved "
}