{
    "title": "Apiax releases AI Policy Assistant based on Microsoft Azure OpenAI Service \nthat provides accurate and verified ...",
    "date": "2/1/2024",
    "url": "https://news.microsoft.com/de-ch/2024/02/01/apiax-releases-ai-policy-assistant-based-on-microsoft-azure-openai-service-that-provides-accurate-and-verified-answers-to-internal-compliance-policies/",
    "text": "Februar 1, 2024 Read the original announcement here Zurich, January 30, 2024 – Apiax has launched a new compliance solution today, aiming to enhance operational efficiency and the accuracy of policy searches. The platform is a synthesis of Apiax’s compliance expertise, rule-based technology, and Generative AI, creating a new standard for financial institutions in accessing and verifying company policy details with ease. Apiax, a leading provider of embedded compliance solutions for the financial industry, released its AI Policy Assistant today, an innovative Generative AI-driven solution transforming compliance policies into dynamic conversations. Based on Microsoft’s Azure OpenAI services, the solution offers instant, precise, and verified answers to policy queries, ensuring governance is maintained anytime through its robust verification layer. It seamlessly integrates with the existing rules-based solution, enhancing decision-making efficiency without compromising compliance standards . “We developed the AI Policy Assistant with the expertise gained from serving multiple global financial institutions. The solution doesn’t compromise on control and transparency and is fully integrated into our comprehensive compliance workbench, ready to tackle complex and multi-faceted policy frameworks,» said Nicolas Blanchard, Chief Product Officer at Apiax. “Being part of the Microsoft for Startups Program accelerated our innovation process massively by leveraging the extensive resources and expertise of Microsoft.” «Working closely with numerous financial institutions in Switzerland and all over the world, we see our customers› need to deliver precise and accurate policy answers, while maintaining strict institutional governance. In this landscape, Apiax is providing an innovative generative AI solution,» says René Huerlimann, Director Solution Sales at Microsoft Switzerland. «Their competitive AI policy assistant is integrating proprietary rule-based frameworks with the Azure OpenAI Service hosted in our Swiss datacenters, while ensuring rigid compliance oversight.» Sulzer Schmid stands at the forefront of innovation in the energy service sector. Leveraging cutting-edge technology, the company’s rotor blade inspection process employs autonomous drones to capture repeatable and consistently high-quality images. The cloud-based 3DX™ Blade Platform offers a data driven approach, incorporating AI-enhanced analytics, providing customers with actionable insights to optimize performance of renewable energy assets. Vor einem Jahr haben wir Copilot für Microsoft 365 vorgestellt. Die Daten aus unserer Work-Trend-Index-Studie zeigen, dass unsere Technologie Mitarbeitende produktiver und kreativer macht und manche dadurch bis zu 10 Stunden Arbeitszeit pro Monat sparen.[i] Deshalb arbeiten wir weiter an Innovationen und statten unser gesamtes Produktportfolio mit Copilot-Funktionen aus, einschliesslich all der Anwendungen und Dienste, auf die Unternehmen bauen – von Windows und Microsoft 365 bis hin zu Teams, Edge und mehr. It’s been one year since we first introduced the world to Copilot for Microsoft 365, and data from our Work Trend Index research shows it’s already making employees more productive and creative, saving some as much as 10 hours per month.1 We’re continuing to innovate, bringing Copilot capabilities to our entire product portfolio, including the applications and services organizations are built on—from Windows and Microsoft 365 to Microsoft Teams, Edge, and more. Nous sommes ravis d’annoncer aujourd’hui nos premiers PC Surface boostés à l’IA et pensés exclusivement pour les entreprises : les Surface Pro 10 et Surface Laptop 6, qui seront disponibles à partir d’avril 2024. Ces PC ont été conçus pour intégrer les fonctionnalités demandées par les professionnels : optimisation pour Copilot, une connectique revisitée, un lecteur NFC1, un focus mis sur les performances et la sécurité avec les derniers processeurs Intel Core Ultra et intégrant un NPU (Neural Processor unit ou unité de traitement neuronal) permettant d’alimenter les expériences d’IA (économisant l’usage de la batterie, du CPU et du GPU). Follow us: Share this page: "
}