{
    "title": "France not aware of Microsoft's Mistral AI deal: Official",
    "date": "2/28/2024",
    "url": "https://www.republicworld.com/tech/apps/france-not-aware-of-microsoft-s-mistral-ai-deal-official/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated February 28th, 2024 at 21:17 IST Microsoft had said it had made a 15-million euro ($16 million) investment in Mistral, and would soon make the Paris-based company's AI models available Microsoft AI: France was not aware of Microsoft's partnership with tech startup Mistral AI, according to a finance ministry official who denied French lobbying for relaxed AI rules in Europe for the American technology company.Microsoft on Tuesday had stated it made a 15-million euro ($16 million) investment in Mistral, and was working to soon make the AI models of the Paris-based company available via its Azure cloud computing platform.The French finance ministry official told Reuters it had no knowledge of Microsoft partnering with the Parisian AI company. “Yesterday, we learned of the technological partnership between Mistral and Microsoft. It's great news that a young French company has joined Microsoft's previously exclusive partnership with OpenAI on its Azure platform,” the finance ministry official said. A Microsoft spokesperson told Reuters it had invested in Mistral without taking a stake in the company, after the Tuesday announcement. The Bill Gates-founded BigTech later clarified that its investment would convert into equity in Mistral's next funding round, which is a common practice among big tech companies who invest in AI startups. In a previous case, Mistral and the French government lobbied for relaxed regulations under the European Union's AI Act in a bid to avoid the over-regulation of smaller startups. EU lawmakers on Tuesday questioned Mistral's role in lobbying on behalf of Microsoft, and also on how much the French government knew about the partnership. An EU lawmaker who worked closely on the AI Act said that story seems to have been a front for an American-influenced big tech lobby. Kim van Sparrentak further said that the Act almost collapsed under the guise of no rules for 'European champions', “and now look. European regulators have been played.” \"France, like all other member states, took part in the writing the AI Act. At the time, we were not aware of this partnership project, but it has no specific consequences.\" Mistral CEO Arthur Mensch also clarified on Wednesday afternoon that the company continued to be committed to its mission as an independent European company. \"We have a reselling agreement with Microsoft, that we’re very excited about,\" he wrote on social media platform X. \"Alongside similar partnerships, it will accelerate our growth.\" Microsoft did not issue a statement or comment on the development.(With Reuters inputs) Published February 28th, 2024 at 21:17 IST Send us your views, we’ll publish them. This section is moderated. UP: Portion of Under-Construction Bridge Collapses in Bulandshahr Upset Over Relationship Issues, B.Tech Student Dies by Suicide in Noida Daughter-in-Law of Former Lok Sabha Speaker Shivraj Patil Joins BJP Google's timeline for RCS support on iPhone Han So Hee-Ryu Jun Yeol Call It Quits Within Two Weeks Amid Controversy Zodiac Signs That Are Born To Be Rebels And Challenge The Status Quo 'Received I-T Notice Last Night', Claims DK Shivakumar AAP's Bharadwaj, Atishi to Address Press Conference at Noon Today | LIVE BTech Graduate from Jodhpur Held for Stealing Laptops From PGs in B'luru Elderly Woman Touches Pilot's Feet On A Flight To Ayodhya, Video Viral © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}