{
    "title": "Microsoft Corp. stock outperforms competitors on strong trading day",
    "date": "2/9/2024",
    "url": "https://www.marketwatch.com/data-news/microsoft-corp-stock-outperforms-competitors-on-strong-trading-day-f25467db-11e24ac03b42",
    "text": "Shares of Microsoft Corp. \n        MSFT,\n        -0.17%\n       rose 1.56% to $420.55 Friday, on what proved to be an all-around mixed trading session for the stock market, with the S&P 500 Index \n        SPX,\n        +0.11%\n       rising 0.57% to 5,026.61 and the Dow Jones Industrial Average \n        DJIA,\n        +0.12%\n       falling 0.14% to 38,671.69. This was the stock's third consecutive day of gains. Microsoft Corp. hit a new 52-week high, surpassing its previous peak of $415.56, which the company achieved on February 8th. The stock demonstrated a mixed performance when compared to some of its competitors Friday, as Apple Inc. \n        AAPL,\n        -1.06%\n       rose 0.41% to $188.85, Alphabet Inc. Cl C \n        GOOG,\n        +0.21%\n       rose 2.04% to $150.22, and Alphabet Inc. Cl A \n        GOOGL,\n        +0.04%\n       rose 2.12% to $149.00. Trading volume (21.7 M) remained 3.8 million below its 50-day average volume of 25.5 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. The stock looks like a bet on Trump himself more than a company with significant revenue and profits. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}