{
    "title": "Microsoft Plans $3.4 Billion AI Investment in Germany",
    "date": "2/15/2024",
    "url": "https://www.pymnts.com/news/artificial-intelligence/2024/microsoft-plans-3-billion-dollar-ai-investment-germany/",
    "text": "Microsoft reportedly aims to invest $3.4 billion in Germany’s artificial intelligence infrastructure. President Brad Smith announced the plans Thursday (Feb.15) during a news conference in Berlin with German Chancellor Olaf Scholz, Bloomberg reported. “German companies are rapidly adapting AI-related technologies,” Smith said, per the report. “We’re expanding our data processing centers in the region.” He added that this will mark the tech giant’s largest direct investment into Germany and will be used to construct new data centers in North Rhine-Westphalia and around Frankfurt, as well as train workers, the report said. Microsoft is focused on cloud infrastructure and data centers in its bid to become an AI powerhouse through its work with OpenAI. Enthusiasm for the mission has helped make Microsoft the world’s most valuable company, with a market capitalization over $3 trillion, surpassing Apple. As PYMNTS wrote last week, milestones like this are “increasingly par for the AI course,” with OpenAI surpassing $2 billion in annualized revenue late last year — making it one of the fastest-growing firms in history — and Google announcing this month that its Gemini Advanced chatbot has more than 100 million subscribers. PYMNTS looked at the rapid rise in demand for generative AI tools such as OpenAI’s ChatGPT earlier this month in an interview with Andy Hock, senior vice president of product and strategy at Cerebras. “The ChatGPT light bulb went off in everybody’s head, and it brought artificial intelligence and state-of-the-art deep learning into the public discourse,” Hock told PYMNTS. “And from an enterprise standpoint, a light bulb went off in the heads of many Fortune 1000 CIOs and CTOs, too,” he added. “These generative models do things like simulate time series data. They can classify the languages and documents for applications, say, in finance and legal. They can also be used in broad domains to do things like help researchers develop new pharmaceutical therapies or better understand electronic health records and predict health outcomes from particular treatments.” Perhaps the largest leap AI has made over the past year, PYMNTS added, is the technology’s ability to parse visual, verbal, audio and textual data all together multimodally. “Hyper-personalized, really immersive experiences are going to be so important going forward,” Ed Chandler, senior vice president and head of Commercial and Money Movement Solutions for Europe at Visa, told PYMNTS in an interview in August. For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}