{
    "title": "Microsoft announces principles to foster innovation, competition in AI",
    "date": "2/26/2024",
    "url": "https://finance.yahoo.com/news/microsoft-announces-principles-foster-innovation-163136848.html",
    "text": "By Foo Yun Chee BRUSSELS (Reuters) - Microsoft President Brad Smith on Monday announced a set of principles to foster innovation and competition in artificial intelligence in recognition of its role as a market leader in this technology, a move that could stave off worries about its dominance. The move by the U.S. tech giant came amid concerns from rivals and antitrust regulators about Microsoft's market power, boosted recently by its collaboration with ChatGPT creator OpenAI. Microsoft has pushed chatbots into its core products such as its Office software and Bing search engine over the past year, attracting business customers eager to try the tech industry's next breakthrough. \"As we enter a new era based on artificial intelligence, we believe this is the best time to articulate principles that will govern how we will operate our AI datacenter infrastructure and other important AI assets around the world,\" Smith said in a speech to be delivered at the Mobile World Congress in Barcelona. The AI Access Principles aim \"in part to address Microsoft's growing role and responsibility as an AI innovator and a market leader\", he said. \"By publishing these principles, we are committing ourselves to providing the broad technology access needed to empower organizations and individuals around the world to develop and use AI in ways that will serve the public good,\" Smith said. The principles include providing access and support for AI developers, making AI models and development tools broadly available to software applications developers around the world, and making available public APIs (Application Programming Interface) to enable developers to access and use AI models on Microsoft Azure. Microsoft will also not use non-public information or data from the building and deployment of developers' AI models in Microsoft Azure to compete with those models, and also allow Microsoft Azure customers to easily export and transfer their data to another cloud provider. (Reporting by Foo Yun Chee, Editing by William Maclean) Related Quotes "
}