{
    "title": "Meta’s killer stock rally adds $200 billion in market cap — a historic haul",
    "date": "2/2/2024",
    "url": "https://www.marketwatch.com/story/meta-just-joined-nvidia-and-microsoft-in-elite-subset-of-the-magnificent-seven-7917fb3c",
    "text": "Meta Platforms Inc. shares exploded 20% higher in Friday’s trading — an eye-popping surge for a company of its size, and one that established numerous milestones in the process. To start, Meta shares \n        META,\n        -1.68%\n       easily set a new record. The stock ended the session at $474.99, whereas its current record finish was a $401.02 level set earlier this week. Opinion: Meta stuns Wall Street with its first dividend. Amazon and Alphabet could be next. But Meta’s market-capitalization gains are even more notable, as the company added $204.5 billion to its valuation on the day. That made for the largest one-day market-cap haul in Wall Street history, according to Dow Jones Market Data — surpassing the $191.3 billion one-day gain that Amazon.com Inc. \n        AMZN,\n        +0.31%\n       raked in back in February 2022. Meta’s strong stock surge came after the company announced plans an afternoon earlier for its first dividend, while topping expectations with its outlook. The results had one analyst thinking that investors should perhaps forget the “Magnificent Seven,” with the new hot club for tech stocks being “MnM.” That’s the view of Raymond James analyst Josh Beck, who said that Meta’s latest results put it in an elite camp with Microsoft Corp. \n        MSFT,\n        -0.17%\n       and Nvidia Corp. \n        NVDA,\n        +0.12%\n       as Big Tech’s leaders in the artificial-intelligence era. Nvidia has proven itself the backbone of the AI frenzy as the company struggles to keep up with surging demand for its hardware that can power AI models. And Microsoft is seeing AI benefits to its Azure cloud-computing business as well as its software portfolio. The opportunity for Meta is “perhaps less tangible” than those others, according to Beck, but he sees the potential for the Facebook parent company to unlock $25 billion to $60 billion in incremental revenue from AI and generative AI. That would come through “AI-bolstered engagement and performance gains,” AI-infused messaging chatbots for businesses and AI tools for marketers that let them create campaigns more efficiently. Beck rates Meta shares at strong buy, and his new $550 target price is up $100 from before. Wells Fargo’s Ken Gawrelski said Meta’s AI investments showed the company “playing offense,” and he argued they had the potential to expand the stock’s multiple. He rates the stock at overweight with a $536 target price, up from $438 before. Meta shares were up 17% in premarket trading Friday and easily on track to reach new record levels. The stock was indicating above $460 in premarket action, while its all-time closing high was a $401.02 level set earlier in the week. Evercore ISI’s Mark Mahaney noted that Meta is fighting the law of large numbers with an outlook that implies an acceleration ahead in the first quarter. “We think it’s a matter of at least four powerful product cycles all clicking — AI-infused product improvements that are improving engagement/time spent, AI-infused product improvements that are improving advertiser [return on ad spend] on the platform, Reels monetization tailwinds, and Click-to-Message ads ramping,” he wrote. Meta “ain’t your Father’s FB,” Mahaney added, highlighting as well the company’s $50 billion increase to its stock-buyback authorization and its plans for its first dividend. “We view these as absolutely the right, appropriate steps for META as this stage in its corporate life and with its $65 billion in cash on the balance sheet,” he said. Mahaney rates the stock at outperform and boosted his price target to $550 from $425. Bernstein’s Mark Shmulik likened the company to Patek Phillipe watches as he cheered the company’s long-term vision that helped silence skeptics worried about core Facebook’s relevance. “Meta’s family of apps continues to expand (Threads, Quest), while newer AI initiatives show the promise of a durable future,” he wrote, while keeping an outperform rating but boosting his price target to $535, up by $100 from before. “Perhaps just like the famed Patek slogan, ‘you never actually own Meta’s stock, you merely look after it for the next generation.'” The deal could expand Home Depot’s market by $50 billion. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}