{
    "title": "Microsoft employees share video showcasing perks of working at tech giant; \nvideo goes viral (WATCH)",
    "date": "2/14/2024",
    "url": "https://newsable.asianetnews.com/business/microsoft-employees-share-video-showcasing-perks-of-working-at-tech-giant-video-goes-viral-watch-gcw-s8uil2",
    "text": "A video of the perks available to the employees at the company was recently shared on social media and went viral in no time. The reel was shared by a software development engineer at the company. The IT behemoth Microsoft is renowned for its exceptional culture and services. It seems like Microsoft employees have it everything, with a beautiful campus, complimentary refreshments, a sleep room, flexible work schedules, and a positive work-life balance. Recently, a video showcasing the company's employee benefits was posted on social media and quickly gained popularity. The reel was shared by a software development engineer at the company. In the video, the employees participated in a trend that highlighted the advantages of their jobs. It looks that the video was filmed at the company's massive 54-acre site in Hyderabad. A post shared by twosisterslivingtheirlife (@twosisterslivingtheirlife) Every level of the office has a 24-hour multi-cuisine restaurant that is available to the public, along with casual gathering areas for coffee breaks. An employee said that they have enough business t-shirts to last them the entire week and that they are permitted to work from anyplace. They also work on projects spanning from AI to gaming, have a sleep room, and have an excellent work-life balance. According to Microsoft's website, \"The campus also affords amenities like a 24x7 ambulance & pharmacy, a landscaped 800-seater outdoor amphitheatre, air-conditioned bus services with WiFi connectivity, dedicated banks and ATMs as well as a fully equipped gymnasium with trainers, yoga and aerobics classes.\" The video has accumulated over 35,000 likes since it was shared. The video was approved by the corporation itself, which posted a heart-emoji-filled response in the comments section stating, \"It's a post by our Microsoft employees, ofcourse it's gonna be wholesome!\" TCS begins freshers' hiring! You can apply till April 10; Here's how you can apply Explained: Why is government mulling geo-tagging telecom infrastructure? Ambani and Adani ink 'power' deal; Reliance to buy 26% stake in Mahan Energen Kerala: Gold rate sets record for first time; One sovereign gold crosses Rs 50000 Lok Sabha Polls 2024: INC's DK Suresh files nomination, declares assets worth Rs 1064 crore in real estate Mitchell Starc's struggles in IPL 2024: Former Indian all rounder Irfan Pathan offers advice False promises turn into nightmare for cousins: 2 men from Haryana tortured for refusing to join Russian army Biden reveals World leaders' concerns about Trump winning 2024 Presidential polls at India's G20 summit Why does Imran Khan pay Rs 9 lakh to Karan Johar every month? Should we wash our hair daily? From AI to UPI, what Bill Gates and PM Modi will discuss during interaction in Delhi (WATCH) Bengaluru water crisis: Residents under scrutiny for defying orders on Holi pool parties, rain dance (WATCH) Colours of Holi in Washington DC's Dupont Circle (WATCH) Groundbreaking! India becomes largest gaming market worldwide with 568 million gamers (WATCH) Delhi man stabs woman in Mukherjee Nagar for 'making fun of him'; video viral on social media (WATCH) Follow us on: "
}