{
    "title": "FTC Dings Microsoft Over Activision Blizzard Layoffs in Court",
    "date": "2/8/2024",
    "url": "https://tech.hindustantimes.com/gaming/news/ftc-dings-microsoft-over-activision-blizzard-layoffs-in-court-71707330989692.html",
    "text": "Copyright © HT Media Limited  All rights reserved. Microsoft Corp.'s plans to cut 1,900 jobs from its video game division contradict statements the company made to a US  court that it would operate the newly acquired Activision Blizzard Inc. independently, the US Federal Trade Commission said Wednesday. “The reported elimination of thousands of jobs undermines the FTC's ability to order effective relief” should a court later find Microsoft's Activision Blizzard acquisition violates the law, the agency said in a letter to the 9th US Circuit Court of Appeals. The FTC said the layoffs show that the merger created areas of overlap and the court should have paused Microsoft's integration of the two companies while the agency completes its in-house trial. We are on WhatsApp Channels. Click to join. The FTC unsuccessfully sought to block the deal last year and a federal judge ruled the proposed merger could move forward. The agency appealed that decision and the federal appeals court in San Francisco is currently weighing the case. In late January, Microsoft's gaming chief Phil Spencer told staff that the company was cutting 8% of its games division's 22,000 employees — at Activision Blizzard, its Xbox division and ZeniMax, which the company acquired in 2021. The cuts were the largest among a swath of games industry layoffs in January, including at Riot Games, Unity, Discord, Twitch and elsewhere. Microsoft also let go Blizzard President Mike Ybarra and co-founder Allen Adham, who served as chief design officer. The cuts spanned several divisions at Activision Blizzard, including in Blizzard's esports department and at subsidiary studio Toys for Bob. Many employees associated with Blizzard's unreleased survival game, codenamed Odyssey, were also let go. The game was in development for six years. Blizzard spokesman Andrew Reynolds said that Microsoft cancelled the game “as part of a focus on projects that hold the most promise for future growth,” adding that the company would “move some of the people on the team to one of several exciting new projects Blizzard has in the early stages of development.” More Than Just Chip Power! Nvidia and Cisco are teaming up to make it easier for corporations to build their own AI computing infrastructure. Cisco will offer Nvidia-based equipment along with its networking gear. Find out more here. Bluesky Social Goes Public! After a year of staying in the invite-only phase, former Twitter CEO Jack Dorsey's decentralized social media platform Bluesky Social has opened for the public. Dive in here. Apple Defeats AliveCor Suit! A US District Judge has ruled that the iPhone maker won't have to face a lawsuit alleging its watch copied heart-monitoring technology from a Khosla Ventures LLC-backed startup, AliveCor. Read all about it here. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71707330989692 "
}