{
    "title": "Microsoft developing custom network hardware to reduce its reliance on \nNVIDIA",
    "date": "2/21/2024",
    "url": "https://mspoweruser.com/microsoft-custom-network-card-for-its-maia-ai-chip-reducing-reliance-on-nvidia/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on February 21, 2024 published on \n\nFebruary 21, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft is making strides towards greater independence and potential performance boosts in the AI hardware by developing a new network card specifically designed for its Maia AI server chip. This move has the potential to not only improve the performance of Maia but also reduce the company’s reliance on chip designer NVIDIA, who is doing amazing in the market, ultimately contributing to an enhanced Azure cloud experience. Spearheaded by Pradeep Sindhu, co-founder of networking giant Juniper Networks, the project aims to create a solution similar to NVIDIA’s ConnectX-7 card, often paired with their GPUs. While the development timeline is estimated to exceed a year, successful implementation could significantly benefit OpenAI, a company Microsoft heavily invests in and potentially boost the capabilities of Microsoft Azure, especially when combined with the power of Azure Boost. The potential benefits for OpenAI include reduced training time and cost for their large language models on Microsoft servers. This aligns with Microsoft’s broader strategy of incorporating OpenAI’s technology into various products, like Microsoft admitting that the newly released Sora model will come to Copilot, solidifying their position in the competitive AI software market and potentially offering more powerful and efficient AI services on Azure, further amplified by Azure Boost. Last year, Fungible, a company specializing in data processing units (DPUs), officially became part of Microsoft. This acquisition is expected to enhance Microsoft’s Data Center Infrastructure efforts further. The expertise and technology gained from Fungible will likely play a role in developing the new network card. In easy words, Microsoft is building a special network card for its own AI chip, called Maia. This could make Maia faster and help Microsoft rely less on NVIDIA for parts. This might also help a company called OpenAI train its AI models faster and cheaper on Microsoft’s cloud service, Azure. Microsoft’s foray into custom network card development signifies its ambition to become more self-sufficient in AI hardware. The success of this project could potentially reshape the competitive landscape between Microsoft and NVIDIA, with implications for the entire AI industry and potentially leading to a more robust and competitive Azure platform. More here. More about the topics: Maia AI, nvidia Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}