{
    "title": "Microsoft: Preparing For A Quantum Leap (NASDAQ:MSFT)",
    "date": "2/12/2024",
    "url": "https://seekingalpha.com/article/4669491-microsoft-preparing-for-a-quantum-leap",
    "text": "  NBC/NBCUniversal via Getty Images  Microsoft (NASDAQ:MSFT) may have leaped ahead of the competition in the arms race to develop the world's first large-scale quantum supercomputer. In anticipation of its arrival, they have launched Azure Quantum, allowing researchers to learn the techniques of quantum programming, estimate the resources they will need to solve complex problems, try out their programs in a simulated environment, and experiment with current early versions of future hardware. Microsoft has proven the power of its simulated environment by publishing a paper showing how it used quantum programming and AI to develop a new battery electrolyte that is now being tested in the lab. A recent scientific discovery crystalizes the hardware research focus of MSFT, showing that they are taking a different approach to the competition. MSFT has created and controlled the exotic quasi-particle Majorana Zero Modes; Majorana particles come with inbuilt error protection, giving future MSFT quantum computers a significant advantage over all other technologies currently being analyzed. I already own Microsoft in my Family Fund and recently added to that position. The quantum developments in this article give me confidence that MSFT remains an excellent long-term investment and will likely outperform most large-scale tech companies in the coming decade. This is my fourth article on Quantum Computing; the other three focus on the pure-play companies D-Wave (QBTS), Rigetti (RGTI), and IonQ (IONQ). In each article, I have tried to explain this complex area's technology and mathematics, hoping to give people enough knowledge to make an informed investment decision. In this article, I will look at Topological Quantum Computing, the chosen technology of MSFT. It's a big deal; if ever realized, the power of a quantum computer will transform the tech industry along with material science, medicine, and most other manufacturing operations. A quantum computer is a device that uses the properties of Superposition and Entanglement exhibited by quantum particles to perform calculations. The quantum particles used in this way are referred to as qubits. Superposition relates to the amount of information that can be stored. In today's classical computers, a bit can store two values, either 1 or 0. A qubit can store an infinite number of values; it is a mixture of two states; in my article on Rigetti, I covered this in detail using an analogy of radar on a boat: the position of a boat could be 0.41 East + 0.91 North the two states would be North and East, and the position of the boat is a superposition of the two states. We use Dirac notation in quantum computing to write this superposition as 0.41 /0> + 0.91 /1>. We are all familiar with the bits that drive today's computers; my iPhone 14 has 6GB of memory, representing 48,000,000,000 bits. Each of those bits can hold the numbers 1 or 0. It sounds like a lot, but it is inadequate to perform any real scientific research. To put it into context, a single gram of DNA requires 215 petabytes to hold its information. That is 1,720,000,000,000,000,000 bits, and I would need over 35,000 iPhones to store a single strand of DNA; you can see how this quickly gets beyond the memory of any traditional computer. An entire strand of DNA could be stored on a single qubit, which is a game changer in itself. Entanglement is the second quantum property exploited by quantum computing. Einstein doubted its existence; he wrote in 1952, \"a system of delusion concocted of incoherent elements of thought\" when describing quantum mechanics following on from the now infamous EPR paper that sought to bring down the entire quantum mechanical research edifice and described entanglement as \"spooky communication\". Two Quantum systems are entangled if the measurement of one system is correlated with the other, and these states are not separable. I covered entanglement in detail in this article on IonQ; it means that two particles become like twins; measuring one gives you the values of the other. This property is fundamental to the programming of quantum computers. The two properties of entanglement and superposition form the basis of this new and developing form of computation. In the early 1980s, this area became known as computability and was a compulsory course when I studied for my undergraduate mathematics degree. Researchers began to explore what algorithms could be developed to run on a Quantum Computer if one were ever built. At the time, it was a purely academic study as the prospect of devising such a computer seemed impossible; we called them Turing machines, not quantum computers. An algorithm is a set of distinct operations that must be performed on one or more qubits to solve a problem; information will be held in the qubits as they evolve in response to the operations being enacted on them. In quantum computing, these operations are called gates and are represented mathematically by matrices; hence, it is often called gate-based computing. One of the most valuable operations is the Hadamard operator, if you apply it to the measurement 0 /0> + 1 /1>, you get 1 /0> + 0 /1>, I mention it here as an example, but it comes up later in the piece. In 1994, Peter Shore devised an algorithm that could factorize huge numbers into prime factors in very short time frames (with small numbers, this is simple; working out that 15=5x3 or that 330= 2x3x5x11 is not a big deal). Factoring very large numbers, made up of large prime numbers, is believed to be impossible on classical computers of any size, as the time needed is exponentially large. Large number prime factorization is the method for securely performing online financial transactions. Indeed, whenever you type your credit card details onto a website, it is secured using huge prime numbers. The security depends on one-way hardness; if you know the prime numbers, producing the large number is simple, but if you know the large number, working out the prime numbers is impossible with today's computers. With Shores algorithm, the problem is no longer hard, and internet finance is no longer secure. Shores algorithm was the first to show how quantum gate computing could solve problems beyond the reach of classical computers. It led to an explosion of mathematical work to find the algorithms needed to solve many other seemingly intractable problems. A quantum computer must contain a system of qubits, all distinct from each other. The computer must set the initial value or state of the qubit, and the qubits should be able to hold this value. The computer must then be able to apply a sequence of operations (gates) to the individual qubits and to more than one qubit simultaneously using entanglement. Finally, the computer must be able to measure the new state of the qubits and report its findings without error. There are a host of potential architectures for building a quantum computer, and many companies and universities are researching many different methods for delivering this goal when we investigate the possibilities, we should consider the following questions. Despite decades of research, nobody has yet developed a computer to pass these five tests. In fact, nobody has yet managed to pass step 2. We are in the time of noisy quantum computers, error-prone unreliable machines offering little advantages over what we already have, similar to computers in the 1950s. Here, it is all about the Qubits; there are thousands of possibilities to develop systems with superposition and entanglement properties. Current research covers nuclear magnetic resonance, neutral atoms, and photonics, going as far as nitrogen-vacancy center in diamonds. Two methods dominate most companies' research: trapped Ion qubits and superconducting qubits. Most big-name Quantum computing companies are trying to build their machines using superconducting Qubits. Alphabet (GOOG), International Business Machines (IBM), Rigetti, and Baidu are taking this approach. A superconducting qubit is a loop of nanowire holding a cooper pair (a pair of electrons bound together at low temperatures). The two ends of the wire are separated by a Josephson junction (a thin strip of non-conducting material). Microwave leads are attached to the qubit to control it, and the electrons can tunnel through the Josephson junction. An effective qubit is formed, exhibiting superposition and entanglement. However, the approach is bedeviled by errors. The superconducting qubit must be cooled to below 10mK (possibly the coldest temperature in the universe) and shielded from the rest of the universe. The qubits will decohere (suffer an error) with the slightest temperature change, radiation, magnetism, or another passing photon; the qubits even affect each other, as will their measurement. Current superconducting computers fail rules 2,3,4,5 and 6. Today's noisy, error-prone superconducting computers struggle to make any real ground. Companies have released information suggesting progress with these superconducting cubits, but so far, the claims have failed independent analyses. In 2020, Google claimed their quantum computer had gained quantum supremacy, only to be shot down by IBM as soon as the paper was published. IBM showed how their noisy error-corrected 127 qubit computer could outperform a supercomputer in June 2023. They used a family of techniques called quantum error mitigation to correct the fidelity problems of their qubits. In many ways, they proved that their system fails point 2. Within a month, it was demonstrated that the IBM achievement was possible on a classical computer, showing it provided no improvement to what we already had. D wave and IONQ (amongst others) are exploring these qubits. Lasers ionize atoms (remove an electron), and they are trapped in electrical fields. Further lasers are used to measure the state of the qubit. The great advantage is that these devices do not need extreme cooling; they will work at room temperature. The number of qubits in each of these systems is too small to develop the type of computing power needed. D-Wave has developed its annealing computer for optimization problems but fails point 1 as the qubits are not independently addressable, so it will never be an actual gate computer. It is still a useful Quantum device and has real-world applications. D-Wave continues to develop a gate computer; however, its current annealing device may be sufficient to develop a profitable business, as it can solve optimization problems previously thought inaccessible. (I covered the D-Wave technology in this article) IONQ is making progress in this field; it is working towards its AQ35 system, which it claims will have quantum supremacy. However, the fact that IBM thought they had Quantum Supremacy last year and were proven wrong has me worried. When IONQ releases the results from their computer, the claim may last as long as the two claims by Google and IBM in this area. IONQ uses the measure of Algorithmic Qubits to represent the number of error-corrected qubits and the amount of work they can perform. It may be that they can attain quantum supremacy with their small number of qubits. Still, they have recently lost their scientific lead and founder, and we have no published scientific papers about the output of the IONQ devices to analyze. If the IONQ AQ35 can deliver error-corrected quantum computing, it will be going against the current view of the scientific community. It is commonly accepted that a useful error-corrected quantum computer will need 1 million qubits (P65 An Applied Approach to Quantum Computing, Jack Hidary) We are in a time of noisy quantum computers, and nobody has yet managed to scale the machines. Noisy means decoherence and errors, the machines are not able to keep their state long enough for the successful application of a gate-based algorithm. MSFT has been looking at Quantum computers for decades, they have tried and rejected each of the methods already discussed, not believing them to be scalable in an error-corrected state. In a bold move, MSFT decided to concentrate on the theoretical field of topological qubits and recently published news of a groundbreaking scientific breakthrough that may have them on the path to a quantum leap in computing power. Topological Quantum computers intend to exploit the behavior of a set of quasi-particles known as anyons. These exotic particles exhibit non-trivial statistical behavior abstracted from local geometric detail. In plain English, they are resilient to their surroundings and have built-in error protection. The existence of anyons is hard to prove; they only exist in 2-dimensional spaces, making them hard to come across in our 3-dimensional world, but it does tell us where to look; they will exist on isolated sheets of atoms that are effectively 2-dimensional. The most experimentally accessible anyon is the Majorana Zero Mode (MZM). MZM anyons are found in condensed matter superconductors and are a collection of excited electrons. An energy gap separates their energy state from the rest of the spectrum. This energy gap provides the MZM with its resilience to errors. The energy gap gives the MZM qubits a hardware-protected coherence not found in other quantum computing technology; it is an enormous advantage that MSFT could exploit to deliver a quantum leap in share price performance. This was my postgraduate area of study; it covered the difference between shapes. In topology, a soccer ball is the same as a football, baseball, or banana. Each of these shapes can be squashed and pulled to make the other. However, a football cannot be made into a donut shape or a wedding ring without tearing a hole in the middle of it, so topologically, footballs and bananas are the same, but donuts are different. In the 2-dimensional world of MZM anyons, a topological path around one anyon is different from a path around two anyons as you cannot change one into the other without passing through one of the anyons. These paths can be used to store information and develop topological entanglement.  Anyon Energy Paths (Author)  If this was 3-dimensional, you could move the blue path over the top of one of the red anyons, and squish it to the same size as the green path and the two paths would be topologically similar. Still, in two dimensions, the paths are topologically different, it is this difference that makes them suitable as qubits. Anyons can be braided to provide the operations needed to carry out the quantum gates. A sequence of exchanging the anyons corresponding to the logical gate operators, the anyons are swapped with each other the paths start to resemble shapes like these.  Braided Paths (Author)  The braided nature of the system provides added error protection; even if the system is subject to small perturbations, the topology of the system is unaffected. These perturbations would cause errors in other systems. Topological qubits have never been developed; their existence was entirely theoretical. Two superconducting nanowires with four MZMs will be required to form a functional qubit; adding a third wire would give a second qubit and enable gate operations. If MSFT can do this, they will have an error-protected quantum computer and have to scale it into a quantum supercomputer. This development will be the next step for Microsoft after a recent scientific breakthrough. In 2022 MSFT announced the first major breakthrough in its quest for a topological quantum computer. the Azure Quantum team has engineered devices that allow them to induce a topological phase of matter bookended by a pair of Majorana zero modes. These quantum excitations don't normally exist in nature and must be coaxed into appearing under incredibly precise conditions. In 2023, further published work showed that MSFT had engineered an MZM anyon that passed the topological gap protocol, a series of tests designed to ensure the presence of a topological MZM phase gap. This represents the first significant step to a fault-tolerant quantum supercomputer. It is a groundbreaking step that has MSFT leading the charge toward developing an error-corrected supercomputer. Having proven that they can create and control Majorana Zero Modes, MSFT still has a lot to go. According to their roadmap, this is step 1 of 6  Quantum Road Map (Microsoft)  We do not have a time frame to go with this roadmap, but it is safe to say the end of the map is in the next decade, not this one, but that does not mean Quantum Computing will not be a significant revenue generator for Microsoft before then. Considerable revenue generation will likely arrive many years before the first quantum supercomputer. In June 2023 MSFT announced the preview of Azure Quantum elements. It contained three key points. Microsoft is running a parallel development path. On one hand, it is developing the superconducting hardware. On the other hand, it provides a quantum HPC AI simulation (gate operations running on classical computers) that allows users to prepare for the future and begin to take advantage of the quantum gate programming. Learning a new way to program is not straightforward; the level of mathematics needed to apply quantum gate computing will be beyond many programmers, but MSFT Azure Quantum is preparing people for the arrival of Quantum supercomputers. The Azure co-pilot can write the code when you tell it what you want and can explain what is happening This is image is from the quantum computing learning page on Azure, it shows the use of superposition in dirac notation in lines 3 and 4  Lines (MSFT Quantum Azure)  Line 10 shows how we address an individual Qubit. Line 13 shows how we apply a gate operation to that qubit, with a single letter for the type of operation. Line 4 shows how we measure the qubit And finally, line 19 illustrates how we put the qubit back to its initial state.  More lines (Quantum Azure)  Azure allows people to write, compile, and run quantum gate programs directly in the browser. It gives access to the current Quantum computers from several suppliers, including IonQ, Rigetti, Quantinuum, QCI and Pasqal. There is little need to use quantum computers, as MSFT provides a simulation that runs on classical computers. This simulation has proven enormously successful; it uses quantum gate computing but not quantum computers, its power is surprising. On January 9th MSFT released a press release exploring a recent experiment by the Quantum team to develop a new battery material. The team started with more than 30 million candidate materials. These were identified by changing elements in known crystal structures with other members of the periodic table. The Azure system used its AI chemical simulations to screen out chemicals that would likely be unstable, leaving 500,000 candidates. Further screening with AI tried to predict electrical storage capacity, reducing the number to 800. These 800 candidates were screened using physics-based AI models. Candidates passing this test underwent a further screening process using the slower, more traditional screening technique of force calculations, leaving 150 candidates showing promise. An additional round of screening removed any known compounds and rare or unavailable chemicals. The final list included 20 candidate materials taken to the lab. The whole exercise was completed in one week. After further screening, the 20 candidates were reduced to 1 by PNNL, using humans to look at the structure of the potential candidates. The leading candidate was synthesized and tested. It proved to be a novel viable battery electrolyte, using 70% less lithium than existing batteries. Azure Quantum and AI are inextricably linked. MSFT co-pilot will allow people to write quantum gate computing code easily and intuitively. Quantum gate computing running in a simulated environment has proven its usefulness and companies will not want to miss out on the potential of this research tool even before the Quantum computing hardware arrives. Azure is already a large and fast-growing division within Microsoft. \"Server products and cloud services revenue increased 22% (up 20% in constant currency) driven by Azure and other cloud services revenue growth of 30% (up 28% in constant currency)\" (MSFT: 2024 8-K, 2024-1-30). MSFT is pursuing topological quantum computing in contrast to the competition. Recent scientific breakthroughs suggest Microsoft may be on track to developing fault-tolerant qubits, giving it a significant and sustainable technological advantage over its peers. MSFT has demonstrated that its Quantum Azure cloud offering can provide fundamental technical advances to the industry. The Azure Quantum programming tool, Microsoft advanced AI and the Azure co-pilot will allow people to develop advanced gate computing algorithms, many of which will run on the quantum simulation platform provided by Azure in the cloud. Quantum Azure allows researchers to learn the tools needed for quantum computing and run algorithms on MSFT simulations or noisy quantum computers from other manufacturers. MSFT has proven that advanced tasks beyond the reach of classical computers can be addressed with its AI tools and Quantum simulator by developing a viable new battery electrolyte. Azure is already driving significant revenue growth for Microsoft cloud-based services, and the recent addition of Quantum Azure could further increase this, leading to a quantum leap in revenue when they develop fault-tolerant quantum supercomputers. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of MSFT either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I also have positions in GOOG and IBM. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}