{
    "title": "Rasesh M. Patel Sells 49,092 Shares of NRG Energy, Inc. (NYSE:NRG) Stock",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-nrg-insider-buying-and-selling-2024-03-18/",
    "text": "NRG Energy, Inc. (NYSE:NRG - Get Free Report) VP Rasesh M. Patel sold 49,092 shares of the business's stock in a transaction on Thursday, March 14th. The stock was sold at an average price of $62.59, for a total transaction of $3,072,668.28. Following the completion of the transaction, the vice president now owns 356,962 shares in the company, valued at approximately $22,342,251.58. The sale was disclosed in a legal filing with the SEC, which is available through this link. Get NRG Energy alerts:Sign UpNRG Energy Stock Up 1.7 % Shares of NRG Energy stock traded up $1.07 during midday trading on Monday, reaching $65.00. 6,594,024 shares of the company's stock traded hands, compared to its average volume of 3,693,103. The company has a market cap of $13.52 billion, a price-to-earnings ratio of -60.75, a price-to-earnings-growth ratio of 0.30 and a beta of 1.11. The company's 50 day simple moving average is $54.37 and its 200 day simple moving average is $47.67. The company has a debt-to-equity ratio of 4.49, a quick ratio of 0.96 and a current ratio of 1.02. NRG Energy, Inc. has a 52 week low of $30.50 and a 52 week high of $66.15. NRG Energy Increases Dividend The company also recently announced a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Thursday, February 1st were issued a $0.4075 dividend. This represents a $1.63 annualized dividend and a yield of 2.51%. The ex-dividend date was Wednesday, January 31st. This is an increase from NRG Energy's previous quarterly dividend of $0.38. NRG Energy's dividend payout ratio (DPR) is -152.34%. Institutional Inflows and Outflows Institutional investors have recently bought and sold shares of the company. Coppell Advisory Solutions Corp. bought a new position in shares of NRG Energy during the 4th quarter worth about $25,000. Coppell Advisory Solutions LLC acquired a new stake in shares of NRG Energy during the 2nd quarter valued at about $37,000. Northwestern Mutual Wealth Management Co. boosted its position in shares of NRG Energy by 4,030.0% during the 4th quarter. Northwestern Mutual Wealth Management Co. now owns 1,239 shares of the utilities provider's stock valued at $39,000 after acquiring an additional 1,209 shares in the last quarter. Authentikos Wealth Advisory LLC acquired a new stake in shares of NRG Energy during the 3rd quarter valued at about $41,000. Finally, CENTRAL TRUST Co boosted its position in shares of NRG Energy by 1,005.5% during the 4th quarter. CENTRAL TRUST Co now owns 807 shares of the utilities provider's stock valued at $42,000 after acquiring an additional 734 shares in the last quarter. Institutional investors own 97.72% of the company's stock. Analyst Ratings Changes A number of brokerages have recently issued reports on NRG. Evercore ISI upped their target price on shares of NRG Energy from $55.00 to $65.00 and gave the company an \"in-line\" rating in a research note on Monday. StockNews.com upgraded shares of NRG Energy from a \"sell\" rating to a \"hold\" rating in a research note on Wednesday, March 6th. BMO Capital Markets boosted their price objective on shares of NRG Energy from $58.00 to $59.00 and gave the company a \"market perform\" rating in a research report on Thursday, February 29th. Wells Fargo & Company started coverage on shares of NRG Energy in a research report on Tuesday, January 23rd. They set an \"overweight\" rating and a $65.00 price objective for the company. Finally, TheStreet upgraded shares of NRG Energy from a \"c+\" rating to a \"b\" rating in a research report on Friday, December 29th. Five investment analysts have rated the stock with a hold rating and four have given a buy rating to the company's stock. According to data from MarketBeat, the company currently has an average rating of \"Hold\" and a consensus price target of $54.25. Get Our Latest Research Report on NRGNRG Energy Company Profile (Get Free Report) NRG Energy, Inc, together with its subsidiaries, operates as an energy and home services company in the United States and Canada. It operates through Texas; East; West/Services/Other; Vivint Smart Home; and Corporate Activities segments. The company produces and sells electricity generated using coal, oil, solar, and battery storage; natural gas; and a cloud-based home platform, including hardware, software, sales, installation, customer service, technical support, and professional monitoring solutions.Featured ArticlesFive stocks we like better than NRG EnergyDo Real Estate Investment Trusts Deserve a Place in Your Portfolio?Insider Selling of Amazon Spikes in Q1, but it's Not Time to SellHow Investors Can Find the Best Cheap Dividend Stocks2 Deep Value, High Yield Stocks With a Double-Digit UpsideUtilities Stocks Explained – How and Why to Invest in UtilitiesAre We in a Bear Market? Here are the Signs This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider NRG Energy, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NRG Energy wasn't on the list. While NRG Energy currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}