{
    "title": "Microsoft found its Panos Panay replacement for Windows and Surface \nbusinesses",
    "date": "3/25/2024",
    "url": "https://windowsreport.com/microsoft-found-its-panos-panay-replacement-for-windows-and-surface-businesses/",
    "text": "Follow us Share this article Latest news Microsoft has its new face of Windows and Surface 3 min. read Published on March 26, 2024 published on \n\nMarch 26, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more Microsoft has tapped twenty-three-year company veteran Pavan Davuluri as the new corporate vice president of Windows + Devices business following Panos Pany’s departure last year. Microsoft shuffled the decks last year when its head of Windows and Surface hardware business moved on to work at Amazon. During the past year, Microsoft appointed its former consumer marketing lead with the task of managing the Windows and Surface business while Mikhail Parakhin oversaw a team dedicated to Windows and web experiences exclusively. However, as The Verge is reporting, Davuluri will now be tackling the whole enchilada that is both Microsoft’s Windows and Surface businesses while Mikhail will now report to Kevin Scott as he presumably transitions out of the company to explore “new roles”. To christen the new appointment, recently promoted Rajesh Jha penned a company memo detailing the changes occurring with its Windows and Surface hardware. I want to share an update on the Windows and Web Experiences (WWE) team following last week’s announcement and the creation of the Microsoft AI organization. Mikhail Parakhin has decided to explore new roles. Satya and I are grateful for Mikhail’s contributions and leadership and want to thank him for all he has done to help Microsoft lead in the new AI wave. He will report to Kevin Scott while supporting the WWE transition. As part of this change, we are bringing together the Windows Experiences and Windows + Devices teams as a core part of the Experiences + Devices (E+D) division. This will enable us to take a holistic approach to building silicon, systems, experiences, and devices that span Windows client and cloud for this AI era. Pavan Davuluri will lead this team and continue to report to me. Shilpa Ranganathan and Jeff Johnson and their teams will report directly to Pavan. The Windows team will continue to work closely with the Microsoft AI team on AI, silicon, and experiences. The Web Experiences team will report into Mustafa in the new Microsoft AI organization. Jordi Ribas will lead Search, Maps, and Platforms with Andrey Proskurin, Fatima Kardar, and Nick Lee reporting to him. Rukmini Iyer will lead Advertising with Paul Viola and Weiqing Tu reporting to her. Mike Davidson continues to lead Design and will work with Pavan and team on how to realign Windows design. Ali Akgun, Kya Sainsbury-Carter, Qi Zhang, and Rajesh Sundaram’s roles remain unchanged. They will join the Microsoft AI leadership team along with Jordi, Mike, and Rukmini, all reporting to Mustafa. We are excited for this team to help Microsoft AI achieve its bold ambition to build world-class consumer AI products. And I very much look forward to closely partnering with Mustafa and the team as we bring our AI products, including Copilot, to the breadth of our E+D products and services. Thanks, Rajesh Last week, Microsoft held another reorg where it appointed Google DeepMind co-founder Mustafa Suleyman as its new CEO of Microsoft AI business, which converged its Bing, Copilot, and Edge divisions under a single hierarchy. Microsoft establishing its AI business before it settled on a clear direction for Windows raised a lot of eyebrows last week, however, flash forward 72 hours and the company has delivered its vision for the future of Windows and Surface for the near future. More about the topics: Windows Kareem Anderson Networking & Security Specialist Kareem is a journalist from the bay area, now living in Florida. His passion for technology and content creation drives are unmatched, driving him to create well-researched articles and incredible YouTube videos.\nHe is always on the lookout for everything new about Microsoft, focusing on making easy-to-understand content and breaking down complex topics related to networking, Azure, cloud computing, and security. Kareem Anderson Networking & Security Specialist He is a journalist from the bay area, now living in Florida. He breaks down complex topics related to networking, Azure, cloud computing, and security Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}