{
    "title": null,
    "date": "3/14/2024",
    "url": "https://petri.com/microsoft-loop-guest-sharing/",
    "text": "Security for your customers, revenue for your MSP practice. Access key insights on how to scale your practice with SkyKick’s new eGuide. Based on input from our top-performing MSPs, SkyKick prepared the MSP Guide to help you navigate the security landscape. In this episode, Stephen Rose and Darrell Webster discuss the differences between Teams Premium and Copilot in Teams. The survey surfaces some surprising information about the state of Active Directory disaster recovery preparedness today. Microsoft is set to add support for business-to-business (B2B) guest sharing to its new Loop app. The new feature will allow users to share Loop workspaces, pages, and components with people outside their organization. Microsoft Loop is a powerful collaboration and productivity tool designed to enhance teamwork. It combines workspaces, pages, and components to help users work together and manage projects. The Loop app allows users to effortlessly create meeting notes, generate documentation, track issues, and brainstorm ideas. “With this change, if allowed by administrator policy, users within your organization will be able to share Loop workspaces, pages, and components with people outside of your tenant via B2B guest sharing. Pages and components can be shared outside your tenant via Specific People share links. Guest users cannot create Loop workspaces,” the company explained on the Microsoft 365 admin center. To share Loop workspaces, pages, and components with guest users, IT admins will need to follow the steps mentioned below: Microsoft notes that the Loop app will respect the organization’s OneDrive and SharePoint sharing. This means that IT admins will need to enable these settings to allow guest sharing of Loop workspaces, components, and pages. Microsoft expects to begin rolling out guest sharing support to organizations that haven’t configured sensitivity labels in late April. The feature is expected to become generally available for all commercial customers in June 2024. Last month, Microsoft Loop released a new update that allows users to automate time-consuming tasks to streamline workflows. The feature is currently available for all Microsoft 365 subscribers, and you can find more details in our previous posts. Rabia comes from a solid IT background and has been writing professionally about Microsoft products and other technology for four years. Rabia has also written for OnMSFT.com as well as Windows Report. She is always up to date on the latest trends in... Aug 08, 2023 Mar 21, 2024 Create a free account today to participate in forum conversations, comment on posts and more. Our sponsor help us keep our knowledge base free. Active Directory is an essential part of Windows Server. It allows IT pros to manage computer resources on the network. In this guide, we’ll show you how to install Active Directory Users and Computers and the basics of working with it so you can manage Active Directory. Active Directory Users and Computers (ADUC) is built... Last Update: Jun 15, 2023 Windows PCs may sometimes encounter issues during startup, and that can happen when Windows fails to load properly. In this post, we’ll explain how you can use Windows Boot Manager to troubleshoot boot errors and get your PC up and running again. What is Windows Boot Manager? Windows Boot Manager (Bootmgr.exe) is Microsoft’s proprietary Unified Extensible Firmware... Last Update: Mar 13, 2024 In this article, we will review PowerShell For loops, While loops, Do-While loops, and Do-Until loops. I’ll explain how PowerShell loops are constructed and how to define conditions to enter or exit a loop. PowerShell For loop The For loop is а counting loop, and it’s mostly used when you need to repeat a task... Last Update: Mar 13, 2024 Cayosoft delivers the only unified solution enabling organizations to securely manage, continuously monitor for threats or suspect changes, and instantly recover their Microsoft platforms. Monitor, manage, and secure your IT infrastructure with enterprise-grade solutions built from the ground up. Create a free account today to participate in forum conversations, comment on posts and more. "
}