{
    "title": "Microsoft veteran shares why Android apps on Windows were killed",
    "date": "3/7/2024",
    "url": "https://www.windowscentral.com/software-apps/windows-11/heres-why-windows-subsystem-for-android-got-killed-off-according-to-a-29-year-microsoft-veteran",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Unsurprisingly, WSA struggling to make money stopped Android apps on Windows from being viable. Microsoft announced that Windows Subsystem for Android (WSA) will no longer be supported after March 2025. The abrupt announcement marks the end of one of the easiest ways to run Android apps on Windows. But while WSA made it easy to install Android apps onto a PC, it had limitations, such as its lack of Google Play services support. Andrew Clinick, who worked for Microsoft for over 29 years, recently shared insight as to why WSA failed. In almost three decades at Microsoft, Clinic spent over two years as Partner Group Program Manager of WSA. He \"led the product team delivering the ability to run Android applications on Windows,\" as explained in his LinkedIn profile. \"This involved product definition internally but also with Amazon Store to deliver a store experience that integrated seamlessly with Windows and for the android applications to feel like native Windows applications. Grew the user base by >1000% in the first 3 months and helped Amazon bring 10's of thousands of android apps to Windows users,\" outlined Clinick. More recently, he worked at Microsoft as Partner Group Program Manager of Windows AI Plugins and Partner Group Program Manager focusing on the developer program for Windows. Honestly when Google walked away the nails were in the coffinMarch 5, 2024 Clinick shared across several X (formerly Twitter) posts that WSA struggled to make money and that the lack of Google Play services support hurt the platform. Clinick went as far to say that Google walking away was the nail in the coffin for WSA.  The reason for Microsoft ending support for WSA shouldn't come as a surprise. \"Store revenue pays the bills and salaries of the wsa team,\" explained Clinick. \"WSL acrues to azure and vs so has a profit center. WSA without a store is awesome but doesn't help windows financially,\" said Clinick. All the latest news, reviews, and guides for Windows and Xbox diehards. He echoed a sentiment that myself and others have said, that WSA is impressive but not viable financially. Given his work experience, I suspect Clinick understands that fact better than anyone. When one X user asked why Microsoft partnered with Amazon rather than have Android apps directly in the Microsoft Store, Clinick pointed to the difficulty of getting apps into a store. \"Turns out standing up a store and attracting apps is mighty difficult,\" said Clinick. READ MORE: Amazon Appstore already removed from Microsoft Store He also highlighted how much the lack of Google Play services affected Android apps on Windows. \"Then you factor in that Google play services isn't there. Difficult to find an app with a large audience that doesn't use Google play services,\" Clinick said. In a separate post, the former Microsoft employee discussed Google Play services again, stating, \"No Google play services. Can't work around that really in a way that isn't hackastic.\" This is a familiar story to those who have followed Microsoft and Windows news over the years. Microsoft has released several platforms and devices over the years only to have a lack of developer support and monetization block long-term viability. Sean Endicott brings nearly a decade of experience covering Microsoft and Windows news to Windows Central. He joined our team in 2017 as an app reviewer and now heads up our day-to-day news coverage. If you have a news tip or an app to review, hit him up at sean.endicott@futurenet.com. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}