{
    "title": null,
    "date": "3/4/2024",
    "url": "https://www.uctoday.com/?p=63870",
    "text": "Home → Collaboration Copilot for Finance is a new experience for Microsoft 365 that 'unlocks AI-assisted competencies for financial professionals' Published: March 4, 2024 Kieran Devlin Microsoft has announced Microsoft Copilot for Finance, empowering businesses with finance-specific, next-gen AI capabilities. Now in public preview, Copilot for Finance integrates with financial systems like Dynamics 365 and SAP, as well as thousands of bespoke Copilot Studios. It offers role-specific workflow automation, guided actions, and recommendations in Microsoft Outlook, Excel, Teams, and other Microsoft 365 applications. This streamlines tasks, meaning teams can focus on steering the organisation towards success. Emily He, Corporate Vice President of Business Applications at Microsoft, wrote in an accompanying blog post: Microsoft is introducing a solution to help finance teams reclaim time and stay on top of the critical decisions that can impact business performance. Microsoft Copilot for Finance is a new Copilot experience for Microsoft 365 that unlocks AI-assisted competencies for financial professionals right from within productivity applications they use every day.” The solution was partly inspired by Microsoft’s findings that 62 percent of finance professionals are stuck in the struggle of data entry and review cycles, according to its 2023 Future of Finance Trends Report. Although tasks such as compliance and tax reporting are essential and cannot be automated, Microsoft found that many finance leaders express a need for automation tools and technology to streamline these processes and save time. Furthermore, 68 percent of CFOs expect revenue growth from Gen AI. By deploying advanced AI to provide insights and automate resource-intensive operational tasks, teams can redirect saved time to boost their effectiveness as financial stewards and strategists. Copilot for Finance streamlines audits by pulling and reconciling data, simplifies collections through automated communication and payment plans and accelerates financial reporting by rapidly detecting variances. These capabilities offer substantial time and cost savings, reshaping how financial professionals operate and how they contribute to the organisation’s impact. Users have various interaction options with Copilot for Finance. It suggests actions seamlessly within the workflow and allows users to ask questions by typing prompts in natural language. An example He suggests in the blog is when a user prompts Copilot with “help me understand forecast to actuals variance data”. Copilot for Finance then creates insights and pulls data directly from across the ERP and financial systems, suggesting actions to take, generating contextualised text and attaching relevant files. Users can also double-check source data to preserve transparency before leveraging Copilot to take further actions. He also outlines several use cases, such as when financial analysts want to minimise the risk of reporting errors and missing unidentified variances, they can prompt Copilot to identify outliers and highlight variances to investigate large financial data sets instead of manually reviewing them. Another use case is how Copilot for Finance supports the collections process by suggesting priority accounts, summarising conversations for ERP recording, and offering tailored payment plans for customers. January signalled a significant start to 2024 for Copilot, featuring Microsoft removing the seat minimum for Copilot for Microsoft 365, opening up its enterprise-targeting AI-powered productivity tool to businesses of any scale, a new Copilot key being announced to ship on various new PCs and laptops, the launch of Copilot Pro, a $20 per user per month subscription targeting Microsoft 365 Personal and Family consumer users, and the launch of Android and iOS apps for Copilot. February saw that momentum continue. Microsoft updated the Copilot experience in Teams with an improved UI, more intelligent prompts and a detailed chat history. While maintaining the core functionality and content accessibility of its predecessor, the latest Copilot in Teams adds tailored prompts to cater to individual user requirements, introducing personalised elements such as colleagues’ information, scheduled meetings, and relevant files. Users can also access their Copilot chat history and take advantage of a comprehensive library of prompts through Microsoft’s Copilot Lab. Additionally, Microsoft revealed a Power Automate plugin in Copilot in Windows that could upgrade the Copilot experience with compelling new automation features. Microsoft Power Automate is a versatile tool that can automate repetitive tasks efficiently. Whether working with Microsoft-made apps, third-party services, or web platforms, it can smartly record steps and generate flows, streamlining the process of regular tasks. After installing Power Automate and activating its plugin with Copilot in Windows, users can utilise automation features for Excel as well as file management that build upon the Copilot feature set that is currently available. Collaboration From Selection to Success: Gannett Fleming’s Microsoft Teams Migration Journey Collaboration Amazon Completes $4 Bn Investment in AI Giant Anthropic Collaboration GoTo Upgrades Portfolio With Swathe of New AI Features Unified Communications Avaya CEO Talks Fusing Tradition with Transformation Collaboration Just 2% Of Organisations Have ‘Mature’ Cybersecurity Readiness Collaboration Employees Seek Improved In-office Collaboration Experiences, says Webex by Cisco Share This Post Collaboration From Selection to Success: Gannett Fleming’s Microsoft Teams Migration Journey Collaboration Amazon Completes $4 Bn Investment in AI Giant Anthropic Collaboration GoTo Upgrades Portfolio With Swathe of New AI Features Get our Free Weekly Newsletter, straight to your inbox! Handpicked News, Reviews and Insights delivered to you every week. Tech Industries Topics Popular Zones About More All content © Today Digital 2024 "
}