{
    "title": "Strategic Education, Inc. (NASDAQ:STRA) Shares Sold by Citigroup Inc.",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-stra-sec-filing-2024-03-21/",
    "text": "Citigroup Inc. reduced its stake in Strategic Education, Inc. (NASDAQ:STRA - Free Report) by 50.3% in the 3rd quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The firm owned 9,633 shares of the health services provider's stock after selling 9,743 shares during the period. Citigroup Inc.'s holdings in Strategic Education were worth $725,000 as of its most recent filing with the Securities and Exchange Commission. Several other institutional investors have also made changes to their positions in STRA. State of Wyoming bought a new stake in Strategic Education during the fourth quarter worth $33,000. Tower Research Capital LLC TRC lifted its stake in Strategic Education by 140.3% during the third quarter. Tower Research Capital LLC TRC now owns 656 shares of the health services provider's stock worth $49,000 after purchasing an additional 383 shares during the last quarter. VisionPoint Advisory Group LLC bought a new stake in Strategic Education during the second quarter worth $58,000. Covestor Ltd lifted its stake in Strategic Education by 88.1% during the second quarter. Covestor Ltd now owns 886 shares of the health services provider's stock worth $60,000 after purchasing an additional 415 shares during the last quarter. Finally, US Bancorp DE lifted its stake in Strategic Education by 585.2% during the first quarter. US Bancorp DE now owns 1,295 shares of the health services provider's stock worth $86,000 after purchasing an additional 1,106 shares during the last quarter. 97.53% of the stock is currently owned by institutional investors. In other Strategic Education news, CFO Daniel Wayne Jackson sold 3,713 shares of the company's stock in a transaction on Tuesday, February 27th. The shares were sold at an average price of $95.95, for a total transaction of $356,262.35. Following the sale, the chief financial officer now owns 71,770 shares of the company's stock, valued at $6,886,331.50. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this hyperlink. In related news, CEO Raymond Karl Mcdonnell sold 12,820 shares of the firm's stock in a transaction dated Tuesday, February 27th. The shares were sold at an average price of $95.99, for a total value of $1,230,591.80. Following the transaction, the chief executive officer now owns 161,359 shares of the company's stock, valued at approximately $15,488,850.41. The sale was disclosed in a legal filing with the SEC, which is available through this hyperlink. Also, CFO Daniel Wayne Jackson sold 3,713 shares of the firm's stock in a transaction dated Tuesday, February 27th. The shares were sold at an average price of $95.95, for a total transaction of $356,262.35. Following the completion of the transaction, the chief financial officer now directly owns 71,770 shares in the company, valued at approximately $6,886,331.50. The disclosure for this sale can be found here. Insiders own 2.50% of the company's stock. Several research firms have weighed in on STRA. StockNews.com upgraded Strategic Education from a \"hold\" rating to a \"buy\" rating in a research note on Saturday, March 9th. Truist Financial upped their price target on shares of Strategic Education from $92.00 to $110.00 and gave the stock a \"hold\" rating in a report on Friday, March 1st. BMO Capital Markets upped their price target on shares of Strategic Education from $103.00 to $123.00 and gave the stock an \"outperform\" rating in a report on Friday, March 1st. Bank of America upped their price target on shares of Strategic Education from $104.00 to $124.00 and gave the stock a \"buy\" rating in a report on Tuesday, March 5th. Finally, Barrington Research upped their price target on shares of Strategic Education from $100.00 to $125.00 and gave the stock an \"outperform\" rating in a report on Thursday, February 29th. One research analyst has rated the stock with a hold rating and four have assigned a buy rating to the company's stock. According to MarketBeat.com, Strategic Education currently has a consensus rating of \"Moderate Buy\" and an average price target of $120.50. Read Our Latest Report on Strategic Education NASDAQ STRA traded up $0.29 on Thursday, reaching $103.23. The company had a trading volume of 120,768 shares, compared to its average volume of 86,491. The firm has a market cap of $2.54 billion, a price-to-earnings ratio of 35.60, a P/E/G ratio of 1.20 and a beta of 0.51. Strategic Education, Inc. has a fifty-two week low of $64.53 and a fifty-two week high of $111.95. The business has a 50 day moving average of $97.79 and a two-hundred day moving average of $89.33. The company has a debt-to-equity ratio of 0.04, a current ratio of 1.57 and a quick ratio of 1.57. Strategic Education (NASDAQ:STRA - Get Free Report) last issued its quarterly earnings results on Thursday, February 29th. The health services provider reported $1.68 EPS for the quarter, beating analysts' consensus estimates of $1.34 by $0.34. The business had revenue of $302.70 million for the quarter, compared to analysts' expectations of $297.48 million. Strategic Education had a net margin of 6.16% and a return on equity of 5.52%. The business's quarterly revenue was up 12.2% compared to the same quarter last year. During the same quarter in the prior year, the firm posted $0.78 earnings per share. Analysts forecast that Strategic Education, Inc. will post 4.63 EPS for the current year. The company also recently declared a quarterly dividend, which was paid on Monday, March 18th. Shareholders of record on Monday, March 11th were given a dividend of $0.60 per share. The ex-dividend date of this dividend was Friday, March 8th. This represents a $2.40 dividend on an annualized basis and a yield of 2.32%. Strategic Education's dividend payout ratio (DPR) is currently 82.76%. Strategic Education, Inc, through its subsidiaries, provides education services through campus-based and online post-secondary education, and programs to develop job-ready skills. The company operates through U.S. Higher Education, Australia/New Zealand, and Education Technology Services segments. It operates Strayer University that offers undergraduate and graduate degree programs in business, criminal justice, education, health services, information technology, and public administration at physical campuses located in the eastern United States, as well as through online; non-degree web and mobile application development courses through Hackbright Academy and Devmountain; and MBA online through its Jack Welch Management Institute.See AlsoFive stocks we like better than Strategic EducationCompound Interest and Why It Matters When InvestingGoogle and Meta Circling the Market on a TikTok Ban RallyQuiet Period Expirations ExplainedIntuitive Machines: Charting a Course Among the StarsHigh Dividend REITs: Are They an Ideal Way to Diversify?KB Home’s Stock Price Can Move Higher, Here’s Why  Before you consider Strategic Education, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Strategic Education wasn't on the list. While Strategic Education currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}