{
    "title": "Dow futures just lower; Microsoft. Alphabet earnings in focus",
    "date": "3/23/2024",
    "url": "https://ca.style.yahoo.com/dow-futures-little-changed-cadence-191802072.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. Investing.com -- U.S. stock futures traded in a mixed fashion Tuesday, as investors prepare for results from tech titans Microsoft (NASDAQ:MSFT) and Alphabet (NASDAQ:GOOGL) as well as the start of the eagerly awaited two-day Federal Reserve policy-setting meeting. By 06:30 ET (10:30 GMT), the Dow Futures contract was down 20 points, or 0.1%, while S&P 500 Futures traded 3 points, or 0.1%, higher and Nasdaq 100 Futures climbed 44 points, or 0.3%. The benchmark indices on Wall Street started the new week in a positive fashion on Monday, with the blue chip Dow Jones Industrial Average extending its winning streak to eleven sessions, gaining nearly 200 points, or 0.5%, to record its highest close since February 2022. The broad-based S&P 500 also gained 0.4%, and the tech-heavy Nasdaq Composite closed 0.2% higher, as a stronger-than-expected earnings season to date has boosted market confidence. The tech sector is likely to be in focus Tuesday, with Microsoft and Google-owner Alphabet scheduled to post their latest earnings after the close, kicking off two weeks of results from big-name technology firms. For both Microsoft and Alphabet, attention will likely center around their cloud computing businesses. The units have been consistent cash cows for both companies, although performance has suffered in recent quarters as economic uncertainty convinces many customers to rein in spending. Results are also expected from the likes of General Electric (NYSE:GE), General Motors (NYSE:GM) and Verizon (NYSE:VZ) before the open. The Federal Reserve starts its two-day policy meeting later Tuesday, before announcing its decision the following day. The central bank is widely expected to raise rates another quarter of a percentage point, so investors will be more concerned about what Chair Jerome Powell says during his press conference for clues to the direction of future rate policy. Expectations are growing that Wednesday’s likely increase will be the final hike of its most aggressive monetary policy tightening cycle in decades, a thesis that has helped buoy stocks in recent weeks. Also of interest will be the release of the consumer confidence data for July, which is expected to edge higher from the previous month. Oil prices stabilized just below three-month highs on optimism of further Chinese stimulus amid signs of tight supplies ahead of the Federal Reserve policy-setting meeting. The focus will also be on U.S. inventory data, with industry data from the American Petroleum Institute due later Tuesday followed on Wednesday by the official numbers from the Energy Information Administration. Stockpiles are expected to have fallen by over 2 million barrels in the week to July 21, indicating steady demand in the world’s largest oil consumer. By 06:30 ET, the U.S. crude futures traded 0.1% higher at $78.81 a barrel, while the Brent contract climbed 0.1% to $82.50. Both benchmarks rose over 2% in the previous session, closing at the highest level since April. Additionally, gold futures rose to $1,962.45/oz, while EUR/USD traded 0.1% lower at 1.1046. (Oliver Gray contributed to this item.) Related Articles Dow futures just lower; Microsoft. Alphabet earnings in focus GM puts profit ahead of growth, veering away from Tesla Goldman Sachs sees Apple delivering an earnings beat \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th 這只是一個簡單的一步方法，任何人現在都可以在家嘗試，但專家們對它促進新陳代謝和減少腹脹的能力讚不絕口。 This food habit is linked to a specific type of dementia. \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. IBKR EventTrader - A new, straightforward way to trade CME futures markets Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt  Seven reportedly cost $20 million Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story.  \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. They soft-launched their relationship at the supermodel's cookbook event in Miami.  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The \"Late Night\" comedian brutally summed up the former president's media company.  Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Meghan Markle is reportedly anxious about returning to England with Prince Harry in May for the 10-year anniversary of the Invictus Games. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}