{
    "title": "Here’s why huge bond holdings by Apple, Microsoft and Alphabet are a problem",
    "date": "3/5/2024",
    "url": "https://www.marketwatch.com/story/apple-microsoft-alphabet-and-other-corporate-giants-have-huge-bond-holdings-and-heres-why-thats-a-problem-dc6b3e36",
    "text": "“Marketable securities, not cash as normally assumed, are responsible for most of the growth in corporate giants’ financial assets.” When a big bank collapses, we inevitably see concerns quickly resurface about the stability and resiliency of the financial sector. Policymakers, regulators and investors will ask, what regulations can be tweaked or new ones put in place to help prevent future failures, reduce volatility, and protect the financial system as a whole? After Silicon Valley Bank (SVB) collapsed in March 2023, the U.S. Federal Reserve embarked on an investigation into why.  In the wake of the failures, the Fed is looking to shore up banks’ liquidity and capital positions as well as making regional banks subject to long-term debt requirements and resolution planning, along with the FDIC. When it comes to any actual changes to shore up the financial system, however, corporate giants can’t be left out of the conversation due to their possible impact on investors and the economy. Corporate giants such as Apple \n        AAPL,\n        -1.06%,\n       Microsoft \n        MSFT,\n        -0.17%\n       and Alphabet \n        GOOG,\n        +0.21%\n       are known for generating staggering profits. But they should be recognized as asset managers as well. Over the past 20 years, corporate giants have quietly emerged as significant players in financial markets, with large and complex financial portfolios. Marketable securities, not cash as normally assumed, are responsible for most of the growth in corporate giants’ financial assets. In our research, my co-author and I collected data on the financial portfolios of the 200 largest corporations in the U.S. from 2000 through 2021. We found that since 2007, their total financial assets grew by $1 trillion, while cash-like instruments grew by only $350 billion. In recent years, bond portfolios — notably, corporate bonds — have been at least as large as cash balances. In essence, corporate giants have become lenders in their own right, running financial institutions within their company walls. This creates the potential for financial risk, for both investors and financial markets, especially with interest-rate uncertainty as high as it is now. The bulk of these portfolios are invested in long-term U.S. Treasurys and corporate bonds. As interest rates rise, the value of long-term assets drops, and companies can suffer significant losses on their balance sheet. Take Apple, for example, which used to hold an astonishing $268 billion in financial assets across many different asset types, as reported in their 2017 corporate fillings. Some $150 billion were corporate bonds, while $55 billion were U.S. Treasurys. A lot of money, however, left corporate balance sheets after the Tax Cuts and Jobs Act (TCJA) in 2017, when firms’ incentives to keep retained earnings abroad faded. Still, as reported in the last annual filing, Apple currently has $160 billion in financial assets, of which $70 billion is a corporate bond portfolio. These large numbers continue to secure Apple’s position as one of the largest global investors in fixed-income securities. In 2022, as interest rates skyrocketed, financial losses were sizeable. Numbers are reported in the comprehensive income as unrealized losses: Apple reported losses of over $11 billion in assets, or more than 12% of its net income. For Alphabet, the losses topped $4 billion in 2022, or 7% of net income. In light of these losses, why do corporate giants keep these hefty financial portfolios in the first place? One reason has been cross-border tax incentives. Many multinationals have used an investment-related strategy of holding them in financial assets instead of distributing them, thereby avoiding U.S. tax fees. In late 2017, an effort to curb this behavior was attempted with the passage of the Tax Cuts and Jobs Act (TCJA), which aimed to reduce tax incentives for keeping assets abroad starting in 2018. Between 2017 and 2019, total financial assets did fall by $400 billion. But interestingly, they didn’t disappear altogether, and this was most notable among the biggest companies. Another theory is that corporate giants keep massive holdings in case of a financial shock. During the COVID-19 pandemic, for example, we did see a “dash to cash” and an increase in cash-like instruments in the face of rising uncertainty. But, at the same time, we did not see corporate bond holdings drastically drop. Corporate giants may also anticipate a situation in which they may need funds fast but are unsure about borrowing at a fair rate. Companies with the biggest portfolios, however, tend to have high credit ratings and are less likely to need such precautionary savings. While the “whys” behind these large portfolios is still an open question, the fact remains that corporate giants’ massive holdings aren’t as transparent as those of banks and other major bondholders like mutual funds and insurance companies. Their losses, too, are much more opaque in part because traditional data sources like Bloomberg, FactSet or Compustat don’t track these financial portfolios. For example, in 2017, Apple’s $268 billion of financial assets that we tracked down is much larger than the $75 billion in “cash and short-term investments” that was reported on the company’s balance sheet and recorded in Compustat. While companies are required to report the face value of the financial assets they hold, they don’t have to disclose at the security level. Additionally, unrealized losses don’t affect a company’s reported income, which can conceal potential risks from inattentive investors. Digging deep into the data it’s clear that non-financial firms are key participants in financial markets, and they do have the power to cause major price swings, volatile markets, and even future major bank collapses. Whether or not firms should provide more granular information about their financial portfolio and its performance is up for debate. But a fuller picture could help investors better understand risk, and more transparency can only benefit the financial system. Lira Mota is the Class of 1958 Career Development Assistant Professor at MIT Sloan School of Management. She is the co-author with Olivier Darmouni of the research paper, “The Savings of Corporate Giants.” More: 9 largest U.S. banks can handle their ‘problematic’ exposure to office real estate, S&P says Also read: Apple’s stock has had a sour 2024. This bull sees ‘a host of tailwinds’ ahead.  Walgreens’ stock seesawed around the flatline Thursday, after the drugstore chain swung to a large quarterly net loss and trimmed its full-year outlook, but also reported the biggest beat for quarterly adjusted profit in at least five years. Visit a quote page and your recently viewed tickers will be displayed here. "
}