{
    "title": "Microsoft poaches Inflection AI execs: here's what analysts think",
    "date": "3/20/2024",
    "url": "https://www.silverliningsinfo.com/ai/microsofts-inflection-hires-heres-what-analysts-think",
    "text": "In a surprise move, Microsoft this week scooped up two top executives and a number of engineers from startup Inflection AI to staff a dedicated new artificial intelligence (AI) unit within the company. But the play raised several questions, such as ‘why didn’t Microsoft just acquire Inflection altogether,’ ‘is the company hedging its bets against its OpenAI investment,’ and ‘what does this mean for the market at large?’  Of course, we don’t like unanswered questions, so we went knocking on a few analyst doors to get their takes on the news. Here’s what they told us. Analysts were split on whether Microsoft poached Inflection’s staff to avoid regulatory scrutiny that might come with an acquisition or simply to gain top-tier talent in a key market. GlobalData Senior Analyst Beatriz Valle told Silverlinings “Microsoft does have a track record of acquiring smaller rivals to quash competition, and this is an alternative way of going about it to avoid regulatory scrutiny.”  Moor Insights and Strategy Principal Analyst Anshel Sag noted that picking up just the staff and not the whole company “does seem like a faster and easier way to acquire talent.” But his boss, Moor Insights and Strategy CEO Patrick Moorhead, wasn’t convinced the move was designed to sidestep regulators. Since smaller companies like Inflection are “not nearly as difficult” to acquire as larger rivals, he said he doesn’t believe there’s “anything funny going on” on that front. AvidThink Founder Roy Chua’s opinion was somewhere in between. Like Moorhead, he said Inflection may not have had sufficient market power to warrant a regulatory review. But he concurred with Sag that “this was an efficient way of moving high quality talent rapidly into Microsoft without much scrutiny.” Another concern associated with the move is that Microsoft is attempting to more or less squash competition. Valle, for instance, noted Inflection is a direct competitor to Microsoft-backed OpenAI. Snagging Inflection’s top talent “will obviously dramatically lessen any competitive impact on that front.” But Moorhead noted the staff in question also have agency, and they likely want to work for the companies that are best positioned to monetize the technologies they’re building. To that end, he noted “Microsoft is in the top echelon of companies that you might want to work for if you’re in AI.” Chua added he doesn’t expect Microsoft to run a similar play with French AI startup Mistral, which it recently invested in – or any other company, really. “I don't think Microsoft is banking on a strategy of pulling out teams from existing AI unicorns the same way,” he told us. Almost unanimously, the analysts indicated Microsoft is looking to build up its internal AI talent, though they differed in the reasons they offered as to why. Valle and Sag pointed to the executive shuffle at OpenAI as both a catalyst for and an indicator of Microsoft’s plans. “Microsoft must have had quite a fright during the governance crisis at OpenAI,” Valle said. “It seems that Nadella is hedging his bets and has decided to diversify risk and who can blame him.” She added the move also comes as competition between Microsoft and Google for dominance on the AI front intensifies. Sag noted the fact that Microsoft jumped to hire OpenAI CEO Sam Altman during the latter’s leadership crisis late last year “demonstrated Microsoft’s desire to have someone that’s already a visionary in AI to lead its consumer AI division.” Of course, Mustafa Suleyman fits the bill, having co-founded not just Inflection AI but also DeepMind. Sag added that the move was significant enough to draw the attention of Nvidia CEO Jensen Huang, who called it \"pretty big\" when speaking with analysts at his company's GTC conference this week. As far as what the move means for the future, Chua said the hire of Inflection’s team and the creation of a dedicated unit is indicative of Microsoft’s enormous expectations for AI. “I think this could bode well for Copilot and the human-computer interaction part of Copilot and Microsoft's products — I'm sure that learning will be ported over and adapted, and that will help with usability,” Chua commented. And for Inflection, the departures are “definitely a blow” but Chua noted “it appears that Inflection's investors and other co-founders still believe there's some long-term value in the remaining assets and that they can execute a pivot.” The company’s strong relationship with Microsoft could end up being mutually beneficial, he concluded. "
}