{
    "title": "Microsoft is now letting more people access GPT Builder with Copilot Pro",
    "date": "3/9/2024",
    "url": "https://www.neowin.net/news/microsoft-is-now-letting-more-people-access-gpt-builder-with-copilot-pro/",
    "text": "8 minutes ago 2 hours ago 3 hours ago 4 hours ago 8 minutes ago 2 hours ago 5 hours ago 15 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 5 hours ago 6 hours ago 7 hours ago 7 hours ago Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 16 hours ago Mar 28, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 John Callaham\n\nNeowin\n@JCalNEO        ·\n    \n\n    Mar 9, 2024 09:08 EST\n    \n\nwith 0 comments In January, Microsoft announced a number of new Copilot-related features. One of them was the introduction of Copilot Pro. For $20 a month, people could get direct access to OpenAI's most powerful LLM, OpenAI's GPT-4 Turbo, along with the Copilot AI assistant in Microsoft's productivity apps like Word, PowerPoint, and more. Another feature that was announced for Copilot Pro users was Copilot GPT Builder. It gives subscribers access to a tool that lets them make their own custom chatbots for specific uses. In February, Microsoft started rolling out a few examples of these chatbots to help people plan a vacation, teach folks to cook, and more. Copilot Pro users… it’s a good night to see if you have GPT Builder 😇 Now it looks like Microsoft is rolling out more access to the GPT Builder. Late on Friday Michael Schechter, the VP of the company's Bing division, posted a message on his X (formerly Twitter) account, hinting very strongly that the company has granted preview access to the chatbot creator to more Copilot Pro users. 😍 pic.twitter.com/Metv6BoaXY It's currently unknown exactly how many Copilot Pro users will get access to GPT Builder in this flight stage. If you are a subscriber and don't see a new option that's labeled \"Create a new Copilot GPT\" in preview, you might have to wait a bit longer to gain access in a future flight. Microsoft plans to expand access to Copilot for Microsoft 365 for higher education teachers and students on April 1. It also recently announced it will add Copilot to its OneDrive cloud storage service for work and education Microsoft 365 accounts sometime in mid-April, and will add new skills and plugins to Copilot for Windows sometime in late March. John Callaham\n                                                ·\n                    \nMar 14, 2024\n\nwith\n6\n                            comment\n                                s John Callaham\n                                                ·\n                    \nMar 12, 2024\n\nwith\n12\n                            comment\n                                s John Callaham\n                                                ·\n                    \nMar 11, 2024\n\nwith\n0\n                            comment\n                                s Mehrotra A\n                                                ·\n                    \nJan 23, 2024\n\nwith\n7\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. dragons dogma 2 beestation promo baseus microsoft weekly windows 11 insider preview promo twirl 157 windows 11 insider preview promo windows 11 moment 5 windows 11 moment 5 baseus pb tails © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}