{
    "title": "Amazon Stock: Anthropic Deal Can Help AI 'Perception Gap' Vs. Microsoft",
    "date": "3/28/2024",
    "url": "https://www.investors.com/news/technology/how-amazons-anthropic-deal-could-help-ai-perception-gap-with-microsoft/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Amazon (AMZN) boosted its position in generative artificial intelligence when it completed a $4 billion investment into the startup Anthropic, according to an Amazon stock analyst. The Seattle-based tech behemoth said Wednesday that it had invested an additional $2.75 billion into Anthropic, completing a $4 billion deal that Amazon agreed to in September. The San Francisco-based Anthropic is the developer of Claude, a generative AI chatbot. Amazon previously invested $1.25 billion in September Following the announcement, BofA Securities analyst Justin Post said the deal could aid Amazon's generative AI push. The company's lucrative Amazon Web Services business is competing with Microsoft's (MSFT) Azure to give enterprises access to the huge amounts of cloud computing power needed for AI applications. Microsoft has been helped in that endeavor by its alliance with OpenAI, whose ChatGPT chatbot helped launch the AI craze in 2022. \"While investors may view Amazon as behind Azure in GenAI-capabilities in the cloud, this perception gap could converge as Anthropic capabilities converge with ChatGPT, and AWS starts to benefit more from AI-driven demand growth,\" Post wrote to clients late Wednesday. Post reiterated a buy rating for Amazon stock and a price target of 204. On the stock market today, Amazon stock closed slightly higher at 180.38. San Francisco-based Anthropic was founded in 2021 by former OpenAI employees. The company's Claude AI assistant offers humanlike responses to prompts, similar to ChatGPT. While OpenAI is seen as the industry leader for generative AI capabilities, Post noted that Anthropic recently took a \"big step forward.\" Its Claude 3 model, released at the start of March, recently passed ChatGPT-4 for the top spot in the \"Chatbot Arena,\" an open-source leaderboard for AI models as ranked by researchers. As part of the investment deal, Anthropic is using Amazon's custom AI computing chips. Further, Amazon Web Services is Anthropic's main cloud provider. Amazon, meanwhile, offers access to Claude through its AWS Bedrock offering. Launched last spring, Bedrock allows companies to use a range of large language models within AWS. \"Like Microsoft with OpenAI, we expect Amazon to feature Anthropic's capabilities on AWS to its Cloud customers (and use of proprietary chips for cost savings for some apps),\" Post wrote. Amazon is the largest cloud infrastructure services provider by market share, according to several estimates. But Microsoft has gained share in recent quarters. As Post noted, some investors see Microsoft as better positioned for AI because of its partnership with OpenAI. On Microsoft's earnings call in January, Chief Executive Satya Nadella told analysts that \"Azure again took share this quarter with our AI advantage.\" Still, Amazon is making clear to investors that AWS expects to be an AI leader as well. On its earnings call in February, Chief Executive Andy Jassy told analysts that Amazon expects generative AI will drive \"tens of billions of dollars\" in revenue in the next several years. Meanwhile, other analysts took note of the expanded Amazon-Anthropic deal Wednesday. CFRA Research analyst Arun Sundaram reiterated a buy rating in a client note. \"Claude 3 Opus is the most intelligent chatbot of the model family and seems to be on par or even better than OpenAI's GPT-4, especially in the areas of reasoning, math, and coding,\" Sundaram wrote. \"We see today's investment as AMZN's latest commitment to being a leading generative AI company.\" Amazon stock has gained about 20% so far this year. But shares have hovered between 170 and 180 in recent weeks. YOU MIGHT ALSO LIKE: Amazon Poised To Benefit From AI After Nvidia's Conference, Analyst Says These Are The Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today AI Stocks: Tech Giants, Cloud Titans, Chipmakers Battle For An Edge Is Amazon Stock A Buy Right Now? 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}