{
    "title": "Microsoft (NASDAQ:MSFT) Trading 0.3% Higher on Analyst Upgrade",
    "date": "3/26/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-msft-percent-advance-2024-03-26/",
    "text": "Microsoft Co. (NASDAQ:MSFT - Get Free Report) shares traded up 0.3% on Tuesday after Wedbush raised their price target on the stock from $475.00 to $500.00. Wedbush currently has an outperform rating on the stock. Microsoft traded as high as $425.99 and last traded at $424.12. 3,333,448 shares traded hands during mid-day trading, a decline of 85% from the average session volume of 22,826,586 shares. The stock had previously closed at $422.86. Other equities analysts also recently issued research reports about the stock. Truist Financial reiterated a \"buy\" rating and set a $600.00 target price on shares of Microsoft in a research note on Monday. Wells Fargo & Company upped their target price on shares of Microsoft from $435.00 to $460.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, January 31st. StockNews.com lowered shares of Microsoft from a \"buy\" rating to a \"hold\" rating in a research report on Thursday, February 22nd. Raymond James increased their price target on shares of Microsoft from $400.00 to $450.00 and gave the company an \"outperform\" rating in a research report on Wednesday, January 31st. Finally, Jefferies Financial Group restated a \"buy\" rating and set a $465.00 target price on shares of Microsoft in a research report on Wednesday, March 6th. Four research analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company's stock. Based on data from MarketBeat.com, the stock has an average rating of \"Moderate Buy\" and an average target price of $423.34. Read Our Latest Research Report on MSFT In other Microsoft news, EVP Kathleen T. Hogan sold 21,955 shares of Microsoft stock in a transaction that occurred on Monday, March 11th. The stock was sold at an average price of $403.96, for a total value of $8,868,941.80. Following the sale, the executive vice president now owns 159,764 shares of the company's stock, valued at approximately $64,538,265.44. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of the company's stock in a transaction on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the sale, the insider now directly owns 11,677,398 shares in the company, valued at approximately $22,770,926.10. The transaction was disclosed in a legal filing with the SEC, which is available at this link. Also, EVP Kathleen T. Hogan sold 21,955 shares of the company's stock in a transaction on Monday, March 11th. The stock was sold at an average price of $403.96, for a total value of $8,868,941.80. Following the sale, the executive vice president now owns 159,764 shares of the company's stock, valued at $64,538,265.44. The disclosure for this sale can be found here. Over the last 90 days, insiders have sold 1,070,258 shares of company stock worth $30,690,456. Corporate insiders own 0.03% of the company's stock. Several large investors have recently modified their holdings of MSFT. Morris Financial Concepts Inc. raised its position in shares of Microsoft by 0.9% during the fourth quarter. Morris Financial Concepts Inc. now owns 2,663 shares of the software giant's stock valued at $1,001,000 after buying an additional 25 shares during the last quarter. Innova Wealth Partners raised its position in shares of Microsoft by 0.6% during the fourth quarter. Innova Wealth Partners now owns 4,239 shares of the software giant's stock valued at $1,594,000 after buying an additional 25 shares during the last quarter. Arkansas Financial Group Inc. raised its position in shares of Microsoft by 1.5% during the fourth quarter. Arkansas Financial Group Inc. now owns 1,719 shares of the software giant's stock valued at $646,000 after buying an additional 25 shares during the last quarter. Sicart Associates LLC raised its position in shares of Microsoft by 2.9% during the fourth quarter. Sicart Associates LLC now owns 926 shares of the software giant's stock valued at $348,000 after buying an additional 26 shares during the last quarter. Finally, Capital Wealth Management LLC raised its position in shares of Microsoft by 1.7% during the fourth quarter. Capital Wealth Management LLC now owns 1,592 shares of the software giant's stock valued at $599,000 after buying an additional 26 shares during the last quarter. Institutional investors own 71.13% of the company's stock. The stock has a market cap of $3.13 trillion, a P/E ratio of 38.12, a PEG ratio of 2.28 and a beta of 0.89. The company has a debt-to-equity ratio of 0.19, a current ratio of 1.22 and a quick ratio of 1.20. The firm's 50-day moving average price is $409.02 and its 200-day moving average price is $373.03. Microsoft (NASDAQ:MSFT - Get Free Report) last posted its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, topping analysts' consensus estimates of $2.76 by $0.17. The firm had revenue of $62.02 billion for the quarter, compared to analysts' expectations of $61.14 billion. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. The business's revenue for the quarter was up 17.6% on a year-over-year basis. During the same period in the prior year, the business posted $2.32 earnings per share. Sell-side analysts expect that Microsoft Co. will post 11.63 earnings per share for the current fiscal year. The firm also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Stockholders of record on Thursday, May 16th will be given a dividend of $0.75 per share. The ex-dividend date of this dividend is Wednesday, May 15th. This represents a $3.00 dividend on an annualized basis and a dividend yield of 0.71%. Microsoft's dividend payout ratio (DPR) is 27.12%. Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.Read MoreFive stocks we like better than MicrosoftThe How and Why of Investing in Biotech Stocks3 Stocks With Unusual Call Option ActivityShould You Add These Warren Buffett Stocks to Your Portfolio?Trump Media & Technology Group Soars on Market DebutThere Are Different Types of Stock To Invest In3 Stocks Insiders Are Buying That Analysts Love Before you consider Microsoft, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list. While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. Microsoft's stock price is pulling back following the Q4 results, suggesting a top is in play, but investors should not be so quick to shed their shares. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}