{
    "title": "Microsoft hasn't been worth this much more than Apple since 2003",
    "date": "3/2/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240302269/microsoft-hasnt-been-worth-this-much-more-than-apple-since-2003",
    "text": "By Emily Bary Microsoft's market cap is about $309 billion larger than Apple's. Just 16 months ago, Apple was $719 billion ahead. Microsoft Corp. continues to pull away from Apple Inc. in terms of market capitalization - so much so that the gap between them is the widest it's been in over two decades. Based on intraday action, Microsoft (MSFT) has a $3.063 trillion market cap Friday, while Apple's (AAPL) clocks in at $2.754 trillion. If the corresponding stock-market action carries through to the close, that would translate to a $309.4 billion margin, the largest between these two companies since Oct. 21, 2003, according to Dow Jones Market Data. Of course, the picture was much different back in 2003, when the $312.1 billion spread between the two tech players was almost as large as Microsoft's entire valuation. Microsoft commanded a $320.2 billion market value on Oct. 21, 2003, while Apple's valuation was only $8.1 billion. See also: Microsoft earnings may have offered a big bullish clue about cloud growth For context about Apple's business at the time, its annual filing for 2003 discussed \"advanced new digital devices such as the company's iPod digital music players, personal digital assistants, cellular phones, digital still and movie cameras, CD and DVD players, and other electronic devices.\" Apple's business is of course much more advanced now, but investors haven't been too excited about it this year, with the stock off about 8% so far in 2024. The company returned to year-over-year revenue growth in its latest quarter after four quarters of declines but suggested revenue could fall again in the ongoing quarter. Some on Wall Street have questioned whether Apple's innovative ways are waning. The market-cap gap between Apple and Microsoft is especially staggering considering how far ahead Apple was just under a year and a half ago. Apple was worth $719.2 billion more than Microsoft on Oct. 28, 2022, according to Dow Jones Market Data. The decline in Apple shares to start 2024 comes after the stock surged 48% in 2023. Microsoft, on the other hand, has been able to sustain its momentum from last year: Its stock advanced 57% then but is up another 10% so far this year. Microsoft, in the eyes of Wall Street, appears a play on the hot artificial-intelligence market, as the company's Azure cloud-computing business benefits from growing customer interest in AI workloads. At the same time, Microsoft has been infusing its own software products with AI functions, and the company has invested in OpenAI. Apple has long used AI across its business, including for features like the Siri voice assistant and the iPhone's photo-recognition capabilities. But the company's management has kept AI discussion to a minimum on recent earnings calls even as corporate executives elsewhere have rushed to convince Wall Street that they're plays on the trend. See more (from August 2023): Apple's Tim Cook explains why he won't showboat around AI \"Our M.O., if you will, has always been to do work and then talk about work and not to get out in front of ourselves,\" Chief Executive Tim Cook said on the company's last earnings call. But he added that Apple had some \"things\" going on with generative AI \"that we're incredibly excited about that we'll be talking about later this year.\" Opinion: Will Apple create a better AI? Questions abound as Tim Cook hints at what's to come. Goldman Sachs removed Apple shares from its conviction list Friday, while keeping a buy rating on them. Analyst Mike Ng \"continues to believe that the market's focus on slower product revenue growth masks the strength of the Apple ecosystem and associated revenue durability & visibility,\" according to Goldman's report on the changes to the list. -Emily Bary This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 03-02-24 0915ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}