{
    "title": "How Expensive are the Growth Stocks?",
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/news/expensive-growth-stocks-175600119.html",
    "text": "Earnings season steps it up a notch this week as over 400 companies are expected to report earnings. Many of them are large cap growth stocks, including several Magnificent 7 stocks like Microsoft, Alphabet, Apple, Amazon and Meta Platforms. But the Mag 7 aren’t the only stocks hitting new highs. Even among these five stocks featured here, two are hitting new highs which aren’t in the Mag 7. One is a mid-cap which is little known unless you’re in the Zacks Value Investor portfolio which owns it. Great Earnings Surprise Records Let’s not forget that many of these growth stocks also have outstanding earnings surprise track records. Two of the companies have only missed once in the last 5 years. That’s impressive given that there was a pandemic during that time. It’s difficult for any company to beat every quarter, or nearly every quarter, over the course of 5 years. Pandemic or not. Can they beat again? 5 Growth Stocks to Watch This Week 1. Microsoft Corp. (MSFT) Microsoft has only missed one time in the last 5 years and it was in 2022. The analysts are on the sidelines. There’s been no changes to the earnings estimates going into the earnings report. Shares of Microsoft are up 65% over the last year and it’s hitting new all-time highs. But Microsoft isn’t cheap. It trades with a P/S ratio of 13.8. The last time it was over 10, was at the end of the dot-com boom. Are valuations stretched on Microsoft? 2. Alphabet Inc. (GOOGL) Alphabet has a so-so earnings record. While it’s beat 3 quarters in a row, it had missed 4 quarters in a row prior to that. Shares of Alphabet are up 53.1% in the last year and are hitting new all-time highs. Alphabet is cheaper than Microsoft, with a P/S ratio of just 6.4. Does Alphabet have attractive valuations? 3. Starbucks Corp. (SBUX) Starbucks has beat 3 quarters in a row but it hasn’t helped the shares, which are actually down 14.9% over the last year. Is Starbucks cheap? It trades with a P/S ratio of just 2.9 and a forward P/E of 22.6. For a growth stock, that’s attractively valued. Is this a buying opportunity in Starbucks? 4. Mastercard Inc. (MA) Mastercard has a great earnings surprise track record. It has only missed once in the last 5 years and it was back in 2020. Shares of Mastercard are up 17.2% over the last year and are busting out to new highs. Mastercard trades with a P/S ratio of 16.8, which is high. It also has a forward P/E of 31. Should you be concerned about valuations with Mastercard? 5. Modine Manufacturing Co. (MOD) Modine Manufacturing is the unknown company among these 5, with a market cap of just $3.4 billion, but it’s chart is just as red hot. Modine has a great earnings surprise track record, beating 8 quarters in a row. Shares of Modine Manufacturing are up 178.6% over the last year. It trades with a P/S ratio of just 1.36. That would put it in the value category. Is Modine Manufacturing a steal even at all-time highs? [In full disclosure, Tracey owns shares of MSFT, GOOGL and SBUX in her own personal portfolio and MOD in the Zacks Value Investor portfolio.] Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report Mastercard Incorporated (MA) : Free Stock Analysis Report Starbucks Corporation (SBUX) : Free Stock Analysis Report Modine Manufacturing Company (MOD) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}