{
    "title": "After 539 days at the top, Apple toppled by Microsoft as world's biggest \ncompany - with poor iPhone sales and rival's AI ...",
    "date": "1/11/2024",
    "url": "https://www.dailymail.co.uk/yourmoney/article-12947599/After-539-days-Apple-briefly-lost-crown-worlds-biggest-company-Microsoft-morning-iPhone-maker-fights-back.html",
    "text": "By Daniel Jones, Consumer Affairs Editor For The Mail On Sunday Published:  15:47 GMT, 11 January 2024   |  Updated:  18:49 GMT, 11 January 2024  17 View  comments  Microsoft edged ahead Apple briefly this morning as the world’s biggest company by value this - but the iPhone maker fought back to regain the crown. With see-sawing stock prices, the situation could change again today or later this week. Growing worries about iPhone sales has soured analysts view of Apple - which held the title for 539 days. But Microsoft's forays into artificial intelligence, including its stake in ChatGPT, mean experts see it as having more money-making potential than its old foe. Microsoft, with its shares up nearly 1 per cent early in Thursday’s session, had a market value of $2.87 trillion about 10am in New York - after Apple's stock slipped by a smilar amoutn, and it had a market value of $2.86 trillion. Soon after Apple bounced a little and Microsoft dipped - reversing the valuations and the crown for biggest market cap. By afternoon Misrsoft had dipped to $2.85 trillion and Apple back up to $2.87 trillion. Microsoft overtook Apple at the world's most valuable company this morning - this shows the market caps of each at 10am ET on January 11, 2024. Apple later reclaimed the crown Apple stock price has fallen this week - Microsoft breifly took title as world's biggest company An analyst at Barclays downgraded Apple shares, causing them to fall in value. Barclays said sales of the iPhone 15 - held up by Apple CEO Tim Cook - have been 'lackluster' Apple was the first ever company to amass a $1 trillion valuation in 2018. It has remained the world's largest company ever since except for brief periods when Microsoft stole the title. As well as Microsoft shares having slimmer losses so far in 2024, the maker of Windows is coming off a slightly stronger year than Apple’s. Microsofts shares rose 57 percent in 2023 as compared with 48 percentfor Apple. Apple relies on iPhones for just over half of its revenue. Microsoft was once depending on its Windows software but now it also makes money from cloud computing and devices like its Surface computers. The next biggest company is Saudia Arabian Oil at arund $2.13 trillion, then Google owner Alphabet at $1.73 trillion and then Amazon at $1.51 trillion. Apple's shares rose 50 per cent to hit a record high last year - making it the first company with a market value above $3 trillion. It hit the mark first in June and then again in early December when shares were above $193. Sales slowing in China are the biggest problem for Apple, analysts say. This is happening for two key reasons. Chinese-based rivals like Huawei are gaining market share there, plus Beijing has limits on government employee use of iPhones. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}