{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.greenbiz.com/article/microsoft-will-buy-enough-us-made-solar-panels-power-18-million-homes",
    "text": "The deal will fund 12 gigawatts from Qcells over the next eight years. By Heather Clancy January 17, 2024 The first phase of Qcells' $2.5 billion investment in U.S. solar manufacturing was the now-complete expansion of its plant in Dalton, Georgia. Source: Qcells North America Microsoft has signed an eight-year deal with the largest U.S. solar manufacturer, Qcells, to supply the company with enough solar panels to add 12 gigawatts of solar electricity to the U.S. grid. For perspective, that’s about one-third of the solar power added to the U.S. electric grid in 2023, according to data from the Solar Energy Industries Associate and Wood Mackenzie. The panels are meant for solar farms that Microsoft is helping build to offset the electricity consumed by its ever-expanding data center footprint. They will be capable of generating enough electricity to power 1.8 million homes. Microsoft previously committed to buying 2.5 gigawatts from Qcells over an unspecified period. Aside from the panels, Qcells, part of a South Korean supplier, is providing engineering, procurement and construction services. It is investing $2.5 billion to build new solar factories in rural Georgia. Financial terms of the alliance were not disclosed. The relationship will help Microsoft get solar projects completed more quickly, said Bobby Hollis, vice president of energy, who joined the company in October. The deal calls for a supply of about 1.5 gigawatts of modules per year through 2032. \"We have to make sure what we’re doing can be done at a large scale,\" said Hollis. Microsoft has pledged to cover all of its electricity consumption with renewables by 2025. As of August, the company had signed contracts to buy more than 13.5 gigawatts of solar, wind or other renewable energy in 16 markets. \"There are a lot of players that are competing for strong development assets and to figure out how to participate more strategically earlier on,\" Hollis said. \"We have to get involved much earlier.\" More than 1,000 procurement deals were signed by corporations globally in the first half of 2023, according to S&P Global. Many corporate-backed projects have been slow to come online in the U.S., stymied by tariffs on panels imported from China and permitting delays for the interconnections required to bring solar and wind farms onto the electricity grid. \"Supply chains can become a bottleneck,\" Hollis said. \"We have to make sure that when surprises happen, we can still make our commitment.\" The Qcells relationship isn’t exclusive, which means Microsoft could source panels elsewhere if needed, he said. Likewise, Qcells is discussing similar relationships with other customers, said Jihyun Kim, executive vice president of Qcells USA. The deal was made possible by tax incentives in the Inflation Reduction Act meant to spur more domestic solar manufacturing. Qcells’ investments, both in Georgia and in Washington state, are the largest for the U.S. industry, the company claims. The company has claimed a leading share of U.S. solar panel shipments for several years. It is already producing about 5 gigawatts of panels and solar components annually in Georgia, said Kim. Qcells says its solar panels are \"sustainably made.\" It is one of several manufacturers seeking certification under the EPEAT for Solar program, a guide that helps federal agencies buy low-carbon products. The polysilicon in Qcells’ panels is made using hydropower in Washington state (most other manufacturers are still on coal). And the company is also making its steel frames for solar installations lighter, to cut down on materials, said Kim. \"Down the road, recycling of the panels, which we will support, will also be an important piece,\" he said. View the discussion thread. Get articles like this delivered to your inbox Join the community of 2,000+ visionaries and practitioners advancing the circular economy at Circularity 24 (May 22-24, Chicago, IL). Learn More "
}