{
    "title": "Microsoft: Study Proves Investing in 'DevEx' Pays Off",
    "date": "1/23/2024",
    "url": "https://visualstudiomagazine.com/Articles/2024/01/23/devex-research.aspx",
    "text": "News Microsoft says organizational focus on improving the overall developer experience -- as opposed to traditional developer productivity/velocity measurements -- pays off, according to new research. Sure, productivity is a worthy goal, but it can come with \"negative consequences like burnout, mistakes and decreased retention,\" the company said today (Jan. 23) in a post on its Azure site announcing the research paper, \"DevEx in Action: A Study of Its Tangible Impacts.\" The paper stems from a joint venture with GitHub, which Microsoft owns, to explore the benefits of improving the developer experience via the Developer Experience Lab research initiative. \"We saw this play out globally during the pandemic which led us to a revelation: the best way to help developers achieve more is not by expecting more, but by improving their experience,\" said Nicole Forsgren, Partner Research Manager, in discussing those negative consequences. For the research, Microsoft partnered with DX, which offers a developer experience platform. Citing positive impacts on three levels (individual, team and organization), Forsgren said: \"At a high-level, our results are promising. Our research model investigated how flow state, feedback loops, and cognitive load impacted developer, team, and organizational outcomes. There's strong support for the positive impact of flow state and low cognitive load on individual, team, and organization outcomes. We also found that feedback loops -- which in our study focused on the speed of answering questions and completing code reviews -- have positive impacts at the team level.\" She offered some teasers to read the research paper: \"Our findings are clear -- improving and measuring developer experience is worth the effort,\" she said. \"It will lead to happier and more productive developers, stronger teams, and more successful organizations.\" The abstract for the research paper reads: The paper details research on topics pertinent to measuring DevEx including: It also provides real-world examples featuring eBay and Pfizer to illustrate how attention to DevEx provides productivity gains. Authors include Forsgren, Abi Noda, Margaret-Anne Storey and Michaela Greiler. \"We hope that this new research will prove valuable for people looking for actionable insights to improve their DevEx, as well as those advocating for DevEx investments within their organizations,\" Forsgren said in conclusion. \"In our paper, we provide a roadmap for pursuing such investments. By collecting DevEx data, setting and communicating clear goals, sharing progress, and repeating this process, organizations can make informed decisions to continually enhance their developer experience.\" About the Author David Ramel is an editor and writer for Converge360. Printable Format On its Developer Blogs site Microsoft today extended an invitation to join company experts at an upcoming developer conference exploring the latest .NET Microsoft Platform developments. Microsoft continually seeks to embrace programming languages beyond its own C#, TypeScript and F# and so on, lately boosting support for Go, the popular language developed by Google. Learn the concepts important to monitoring applications and how to configure Azure Monitor and Application Insights to collect relevant data, alert you when potential problems occur, and report on that data in near real time. Now in beta for top-tier GitHub customers is \"code scanning autofix\" used to mitigate security vulnerabilities in code. Can advanced AI in Visual Studio 2022 turn the sophisticated IDE into a replacement for low-code tools that is suitable for non-coders to create business apps? Subscribe on YouTube > More Webcasts Problems? Questions? Feedback? E-mail us. "
}