{
    "title": "Microsoft alerts other organisations of Russia-backed hackers' threats \nafter email hacking incident | Mint",
    "date": "1/26/2024",
    "url": "https://www.livemint.com/companies/news/microsoft-alerts-other-organisations-of-russia-backed-hackers-threats-after-email-hacking-incident-11706236725319.html",
    "text": "Microsoft Corporation has issued warnings to organisations, indicating they are targets of the Russian-sponsored group, Midnight Blizzard or Cozy Bear, the same group that hacked into the company's executives' emails late last year, Bloomberg reported. The disclosure came through a blog post by Microsoft's Threat Intelligence team, stating that the group has been targeting various organisations. Microsoft has initiated notification processes for the targeted entities. Also Read | FTC launches inquiry into artificial intelligence deals such as Microsoft's OpenAI partnership Midnight Blizzard an Expanding ThreatRecent developments suggest that Midnight Blizzard's activities extend beyond Microsoft. Hewlett Packard Enterprise Co. (HPE) reported a breach in its cloud-based email system on January 24, attributing it to the activities of Midnight Blizzard. This signals a broader reach for the hacking group.\n    In a prior disclosure, Microsoft revealed that the group compromised a \"legacy non-production test tenant account\" to gain access to a \"small number\" of email accounts, including those of senior leadership and employees in cybersecurity and legal roles.\n   Also Read | Microsoft lays off 1,900 Activision Blizzard, Xbox staff: Report\n   The initial target was information about Midnight Blizzard itself. The investigation later revealed that the compromised email account lacked multifactor authentication, a standard security measure.\n   Hewlett Packard Enterprise (HPE), an information technology provider, reported that it was notified on December 12 about a breach by a nation-state hacking group in its email systems. Investigators believe the hackers accessed and infiltrated data starting in May, primarily targeting a small percentage of HPE mailboxes from employees in cybersecurity and other departments.\n   Also Read | AI race propels Silicon Valley tech firms Microsoft, Meta, and Google to new highs. Here's why\n Russian Link to Midnight BlizzardThe hackers, identified as Russia's SVR foreign intelligence agency, gained access to Microsoft by compromising credentials on a \"legacy\" test account, hinting at outdated code.\n   The United States government has linked the hacking group, also known as Nobelium, to Russia. This group gained notoriety for breaching SolarWinds Corp. in a massive cyber-espionage campaign against several federal agencies.\n   Also Read | Microsoft creates new Gen AI team to develop smaller and cheaper language models: Report\n   Microsoft highlighted that the recent breach shares a commonality with the SolarWinds hacking campaign, considered \"the most sophisticated nation-state attack in history.\" The SVR primarily focuses on intelligence-gathering, targeting governments, diplomats, think tanks, and IT service providers in the US and Europe.\n   The recent activities of Midnight Blizzard further highlight the persistent threat posed by this Russian-linked hacking group.\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase          At Flipkart, merit-based payouts push out salary hikes in increment season       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 26 Jan 2024, 09:31 AM IST\n\t\nTopics You May Be Interested In \n Business \n Microsoft \n Microsoft email hacking \n Russian Micrososft email hacking \n russian group hacking \n email hacking \n cyber security \n company \n Midnight Blizzard \n Cozy Bear \n Russia backed hacking group \n companies under threat Recent developments suggest that Midnight Blizzard's activities extend beyond Microsoft. Hewlett Packard Enterprise Co. (HPE) reported a breach in its cloud-based email system on January 24, attributing it to the activities of Midnight Blizzard. This signals a broader reach for the hacking group. In a prior disclosure, Microsoft revealed that the group compromised a \"legacy non-production test tenant account\" to gain access to a \"small number\" of email accounts, including those of senior leadership and employees in cybersecurity and legal roles. Also Read | Microsoft lays off 1,900 Activision Blizzard, Xbox staff: Report The initial target was information about Midnight Blizzard itself. The investigation later revealed that the compromised email account lacked multifactor authentication, a standard security measure. Hewlett Packard Enterprise (HPE), an information technology provider, reported that it was notified on December 12 about a breach by a nation-state hacking group in its email systems. Investigators believe the hackers accessed and infiltrated data starting in May, primarily targeting a small percentage of HPE mailboxes from employees in cybersecurity and other departments. Also Read | AI race propels Silicon Valley tech firms Microsoft, Meta, and Google to new highs. Here's why Russian Link to Midnight BlizzardThe hackers, identified as Russia's SVR foreign intelligence agency, gained access to Microsoft by compromising credentials on a \"legacy\" test account, hinting at outdated code.\n   The United States government has linked the hacking group, also known as Nobelium, to Russia. This group gained notoriety for breaching SolarWinds Corp. in a massive cyber-espionage campaign against several federal agencies.\n   Also Read | Microsoft creates new Gen AI team to develop smaller and cheaper language models: Report\n   Microsoft highlighted that the recent breach shares a commonality with the SolarWinds hacking campaign, considered \"the most sophisticated nation-state attack in history.\" The SVR primarily focuses on intelligence-gathering, targeting governments, diplomats, think tanks, and IT service providers in the US and Europe.\n   The recent activities of Midnight Blizzard further highlight the persistent threat posed by this Russian-linked hacking group.\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase          At Flipkart, merit-based payouts push out salary hikes in increment season       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 26 Jan 2024, 09:31 AM IST\n\t\nTopics You May Be Interested In \n Business \n Microsoft \n Microsoft email hacking \n Russian Micrososft email hacking \n russian group hacking \n email hacking \n cyber security \n company \n Midnight Blizzard \n Cozy Bear \n Russia backed hacking group \n companies under threat The hackers, identified as Russia's SVR foreign intelligence agency, gained access to Microsoft by compromising credentials on a \"legacy\" test account, hinting at outdated code. The United States government has linked the hacking group, also known as Nobelium, to Russia. This group gained notoriety for breaching SolarWinds Corp. in a massive cyber-espionage campaign against several federal agencies. Also Read | Microsoft creates new Gen AI team to develop smaller and cheaper language models: Report Microsoft highlighted that the recent breach shares a commonality with the SolarWinds hacking campaign, considered \"the most sophisticated nation-state attack in history.\" The SVR primarily focuses on intelligence-gathering, targeting governments, diplomats, think tanks, and IT service providers in the US and Europe. The recent activities of Midnight Blizzard further highlight the persistent threat posed by this Russian-linked hacking group. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}