{
    "title": null,
    "date": "1/5/2024",
    "url": "https://appleinsider.com/articles/24/01/05/microsoft-poised-to-overtake-apple-as-most-valuable-company",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy Credit: Microsoft As Microsoft stock rises and Apple's falls over analysts expectation of slowing iPhone demand, the two firms are once more within $100 billion of each other —  the smallest gap in over two years.\r  Apple and Microsoft have a long history of competing for the title of the world's most valuable company, although originally that was specifically in the technology category. In 2010, Apple dethroned Microsoft when it hit a market capitalization of $222 billion, and then in 2018 Microsoft briefly regained that top position.\rNow those sums seem quaintly low, and the two companies have instead been vying for the title of most valuable company globally, in any category. In August 2020, Apple became the first publicly-traded US company to reach a $2 trillion market cap, and Microsoft became the second one in June 2021.\rLater in October 2021, Microsoft took over the top spot, and for a time was move valuable than Apple by $100 billion.\rWhile the values of the two firms have continually changed, Microsoft is now worth just $100 billion less than Apple, according to MarketWatch. Microsoft is valued at $2.73 trillion, while Apple —  fallen from its recent $3 trillion high —  is currently at $2.83 trillion.\rHow Microsoft may be beating Apple MarketWatch notes that Microsoft's stock rose 57% in 2023, compared to Apple's which rose 48%. Microsoft shares have also reportedly seen what are described as slimmer losses at the start of 2024.\rApple, on the other hand, has seen its shares take a considerable drop in recent days. The first hit was taken following a claim by Barclays that iPhone demand is weakening and that the iPhone 16 range will not offer any compelling new features to tempt upgraders. \rThe analyst view that Apple is dependent on iPhone sales is part of why Microsoft is doing better. Analysts see Microsoft has being less attached to any hardware, and more attached to subscription software such as Office 365, and so therefore less attached to any falling demand for phones or computers.\rAnd, Microsoft has launched an AI tool in Copilot, while Apple has not unveiled any similar ChatGPT-style app or service. Analysts appear to be ignoring that Apple has been using AI for many years, under the name Machine Learning, though, and also that it is never first to a market, even ones that it later comes to dominate. Apple and Microsoft have a long history of competing for the title of the world's most valuable company, although originally that was specifically in the technology category. In 2010, Apple dethroned Microsoft when it hit a market capitalization of $222 billion, and then in 2018 Microsoft briefly regained that top position. Now those sums seem quaintly low, and the two companies have instead been vying for the title of most valuable company globally, in any category. In August 2020, Apple became the first publicly-traded US company to reach a $2 trillion market cap, and Microsoft became the second one in June 2021. Later in October 2021, Microsoft took over the top spot, and for a time was move valuable than Apple by $100 billion. While the values of the two firms have continually changed, Microsoft is now worth just $100 billion less than Apple, according to MarketWatch. Microsoft is valued at $2.73 trillion, while Apple —  fallen from its recent $3 trillion high —  is currently at $2.83 trillion. MarketWatch notes that Microsoft's stock rose 57% in 2023, compared to Apple's which rose 48%. Microsoft shares have also reportedly seen what are described as slimmer losses at the start of 2024. Apple, on the other hand, has seen its shares take a considerable drop in recent days. The first hit was taken following a claim by Barclays that iPhone demand is weakening and that the iPhone 16 range will not offer any compelling new features to tempt upgraders. The analyst view that Apple is dependent on iPhone sales is part of why Microsoft is doing better. Analysts see Microsoft has being less attached to any hardware, and more attached to subscription software such as Office 365, and so therefore less attached to any falling demand for phones or computers. And, Microsoft has launched an AI tool in Copilot, while Apple has not unveiled any similar ChatGPT-style app or service. Analysts appear to be ignoring that Apple has been using AI for many years, under the name Machine Learning, though, and also that it is never first to a market, even ones that it later comes to dominate. William Gallagher has 30 years of experience between the BBC and AppleInsider discussing Apple technology. Outside of AppleInsider, he's best known for writing Doctor Who radio dramas for BBC/Big Finish, and is the De... They have been using AI, but have they been using generative AI? They have been using AI, but have they been using generative AI? mikethemartian said:\nThey have been using AI, but have they been using generative AI?\n\r\nAs I suggested in another thread, there are ways that Apple can implement its own generative AI that would be more useful while avoiding the plagiarism and unreliability underlying the current generative AI models already out there. Microsoft’s generative AI is little more than a massive database of copyrighted material and a barely competent linguistic algorithm that regurgitates that material without adequately crediting or compensating the sources. As noted in the last paragraph of the above article, Apple doesn’t need to be first with something. They’ll just come in when they’re ready with an indispensable implementation of a technology, while others have raced to market with a janky hot mess. As I suggested in another thread, there are ways that Apple can implement its own generative AI that would be more useful while avoiding the plagiarism and unreliability underlying the current generative AI models already out there. Microsoft’s generative AI is little more than a massive database of copyrighted material and a barely competent linguistic algorithm that regurgitates that material without adequately crediting or compensating the sources. AppleZulu said:\n\nmikethemartian said:\nThey have been using AI, but have they been using generative AI?\n\r\nAs I suggested in another thread, there are ways that Apple can implement its own generative AI that would be more useful while avoiding the plagiarism and unreliability underlying the current generative AI models already out there. Microsoft’s generative AI is little more than a massive database of copyrighted material and a barely competent linguistic algorithm that regurgitates that material without adequately crediting or compensating the sources. \n\r\nMaybe you don't know, but MS already is using generative AI in their MS 365 ecosystem, specifically in business and enterprises. IMO, that's more useful than what Apple is doing with AI.  As noted in the last paragraph of the above article, Apple doesn’t need to be first with something. They’ll just come in when they’re ready with an indispensable implementation of a technology, while others have raced to market with a janky hot mess. Interesting that the article said that Apple is never first in the market, but they don't mention that Apple was ahead of the competition when they acquire Siri.  Thirteen years later we have a stagnant Siri and Apple behind the competition.  At the same time, OpenAI and Microsoft have a strong AI presence with services, datacenters and apps with AI integration. At the moment I haven't seen the \"indispensable integration of technology\" you mention Apple would bring.  I would wait and see what Apple brings in WWDC and compare it to what MS announce in their Build event. Maybe you don't know, but MS already is using generative AI in their MS 365 ecosystem, specifically in business and enterprises. IMO, that's more useful than what Apple is doing with AI. Interesting that the article said that Apple is never first in the market, but they don't mention that Apple was ahead of the competition when they acquire Siri.  Thirteen years later we have a stagnant Siri and Apple behind the competition.  At the same time, OpenAI and Microsoft have a strong AI presence with services, datacenters and apps with AI integration. At the moment I haven't seen the \"indispensable integration of technology\" you mention Apple would bring.  I would wait and see what Apple brings in WWDC and compare it to what MS announce in their Build event. I can't point to much of what Microsoft is doing that another company isn't doing as well. Zoom is still a favorite for many over Teams. Azure hasn't killed AWS. Surface hasn't really put a dent in the iPad Generative AI has so much issues that have already been mentioned in this thread (copyright) the only reason why the Tech Press maintains the prattle is because they don't understand  the Tech industry beyond surface level stuff.  I find the Vision Pro launch to be significantly more important to computing than Generative AI.   And if Apple is effectively able to put LLM right in silicon without heavy reliance on external servers for most of the daily AI tasks that will leapfrog much of today's  \"Hey we have AI in our app but please don't use it too much because it's expensive\" approach to extant AI use cases. I can't point to much of what Microsoft is doing that another company isn't doing as well. Zoom is still a favorite for many over Teams. Azure hasn't killed AWS. Surface hasn't really put a dent in the iPad Generative AI has so much issues that have already been mentioned in this thread (copyright) the only reason why the Tech Press maintains the prattle is because they don't understand  the Tech industry beyond surface level stuff.  I find the Vision Pro launch to be significantly more important to computing than Generative AI.   And if Apple is effectively able to put LLM right in silicon without heavy reliance on external servers for most of the daily AI tasks that will leapfrog much of today's  \"Hey we have AI in our app but please don't use it too much because it's expensive\" approach to extant AI use cases. For the longest time I have written off Microsoft as being far behind Apple and Google and I didn't actually consider them a proper contender to either.They don't have the aspirational appeal of Apple nor the software chops of Google. In fact, their UI is often very cluttered and overly complex.However, in recent years they have become the safest tech company to bet on. People who are familiar with Microsoft's antitrust cases from way back will find it funny that the companies that were against Microsoft such as Apple and Google, are now being charged for the same things that they accused Microsoft for.Microsoft's office suite still remains the default, their cloud services has a lot of potential even more than AWS(the current leader), Windows is the only PC choice for the majority of people (no programmer is going to buy a Chromebook and not everyone can afford a Mac), the recent game studio acquisitions has been slowly dethroning Sony and making Windows the only real PC gaming environment. Google started the cloud gaming market yet dropped out( they do this a lot...) and now Microsoft is carrying that with Xbox pass.They don't have the same revenue dependency on ads and therefore don't have much to fear over new privacy regulations, they also don't have 50% of their revenue dependent on one product, such as iPhones for Apple.They are also currently the leaders at AI along with Google, so I think they are future proofed too.The only place they are lagging at is on the mobile market and I don't think they are going to succeed there as Apple and Google have grown too big in that space, but only time will tell, you never know with a company as big as them. Ever since Satya Nadella became CEO, Microsoft has been a different beast, making one right decision after another and he is arguably the best thing that happened to Microsoft. For the longest time I have written off Microsoft as being far behind Apple and Google and I didn't actually consider them a proper contender to either.They don't have the aspirational appeal of Apple nor the software chops of Google. In fact, their UI is often very cluttered and overly complex.However, in recent years they have become the safest tech company to bet on. People who are familiar with Microsoft's antitrust cases from way back will find it funny that the companies that were against Microsoft such as Apple and Google, are now being charged for the same things that they accused Microsoft for.Microsoft's office suite still remains the default, their cloud services has a lot of potential even more than AWS(the current leader), Windows is the only PC choice for the majority of people (no programmer is going to buy a Chromebook and not everyone can afford a Mac), the recent game studio acquisitions has been slowly dethroning Sony and making Windows the only real PC gaming environment. Google started the cloud gaming market yet dropped out( they do this a lot...) and now Microsoft is carrying that with Xbox pass.They don't have the same revenue dependency on ads and therefore don't have much to fear over new privacy regulations, they also don't have 50% of their revenue dependent on one product, such as iPhones for Apple.They are also currently the leaders at AI along with Google, so I think they are future proofed too.The only place they are lagging at is on the mobile market and I don't think they are going to succeed there as Apple and Google have grown too big in that space, but only time will tell, you never know with a company as big as them. Ever since Satya Nadella became CEO, Microsoft has been a different beast, making one right decision after another and he is arguably the best thing that happened to Microsoft. Apple will be holding WWDC 2024 from June 10, showing off its future operating system updates and maybe even new hardware. This is what has been rumored so far. Canada's complex car theft ring, which often involves stealing and shipping expensive cars and SUVs around the world, just got even creepier thanks to AirTag. We now have a date for WWDC 2024, we have perhaps more idea than ever of just what it will cover, and we have ever increasing rumors of a smart Apple Ring. All we need now is the release of new iPads. B&H has dropped MacBook Pro prices further as March comes to a close. Pick up an M3 MacBook Pro with 16GB RAM for just $1,549 — or opt for the M3 Pro MacBook Pro 14-inch for $1,699. Both are record-breaking deals. Fake iPhones, AirPods and iPhone cases were among counterfeit goods seized in police raids in Northern Ireland. A photograph of cases intended for the iPhone 16 indicates at least one accessory producer is leaning in on rumors of a new vertical camera arrangement in the new models. While Apple has publicly only said that it will add RCS messaging support to iOS later in 2024, a Google announcement appears to pin it down further. Apple is believed to be sticking with titanium for the forthcoming iPhone 16 Pro, but a new leak claims that an improved manufacturing process will give it a more polished look. With the earliest possible trial date start likely in late 2026, analysts are generally nonplussed by the Department of Justice omnibus antitrust suit and are telling investors to stick with Apple. Aiming to show that its carbon reduction efforts are not mere \"climate-washing,\" Apple has spotlighted how its Restore Fund is contributing to the restoration of a Brazilian rainforest, and attempts to save over 3,000 types of tree from extinction. Investment firm Evercore says Apple is facing weakening demand and strong competition from AI rivals, but investors should stick with it for the long term.  "
}