{
    "title": "Microsoft's market cap surpassed $3 trillion for first time",
    "date": "1/25/2024",
    "url": "https://economymiddleeast.com/news/microsoft-market-cap/",
    "text": "Microsoft briefly surpassed a market value of $3 trillion on January 24, solidifying its position as the world’s second most valuable company, just behind Apple, the renowned iPhone manufacturer. Since the beginning of the year, Microsoft and Apple shares have been competing for the top spot as the most capitalized stocks on Wall Street. This milestone comes two weeks after Microsoft surpassed Apple to become the world’s most valuable public company on January 12. However, Apple reclaimed its top position on Wednesday, reaching a market cap of approximately $3.02 trillion. Microsoft’s shares reached an all-time high of $404.72, a 1.5 percent increase, enabling the tech giant to briefly surpass the $3 trillion market cap threshold. Meanwhile, Apple’s shares were trading at $195.47, up 0.14 percent, resulting in a market value of $3.02 trillion. Investors have shown optimism toward Microsoft, with its shares rising over 7 percent year to date, particularly due to the company’s investments in artificial intelligence (AI). Since the launch of chatGPT, Microsoft’s shares have experienced a growth of more than 60 percent, outperforming the S&P 500 by 20 percent and surpassing NASDAQ’s high-tech surge of nearly 40 percent during the same period. Microsoft’s stock gain also exceeded Apple’s by almost 30 percent in that timeframe. Read more: Saudi Arabia regional headquarters boom: Vision 2030 attracts Amazon, Google, Microsoft, and more According to CNBC, analysts anticipate that Microsoft will deliver strong earnings in the next quarter, partially due to its leading position in generative artificial intelligence (GenAI). Similarly, Morgan Stanley analysts stated in a memo on Tuesday that they believe Microsoft’s prominence and contributions in the field of AI are becoming even stronger. Microsoft is scheduled to report its earnings for the second quarter of fiscal year 2024 on January 30. In recent times, Microsoft has distinguished itself as one of the few major companies that has translated the immense interest in AI into significant financial success, achieving record revenues in the past two quarters. The company’s AI-heavy smart cloud division has experienced a year-on-year growth of 20 percent. During the World Economic Forum (WEF) held lately, Microsoft CEO Satya Nadella said he is “hopeful” and “optimistic” about the future of AI. However, he stressed the need for countries to align and adopt a common set of industry standards to ensure a cohesive approach. In a discussion with Klaus Schwab, chairperson of the WEF, Nadella explored his perspectives on the future direction of the AI industry and emphasized the importance of implementing global safety guardrails. “As a digital technology industry, the biggest lesson learned perhaps for us is that we have to take the unintended consequences of any new technology along with all the benefits,” Nadella said. “[We have to] think about them simultaneously as opposed to waiting for the unintended consequences to show up and then address them,” Nadella said. For more news on banking & finance, click here.    © 2024 Economy Middle East. Published by JC Media Group. All Rights Reserved. "
}