{
    "title": "Microsoft Adds Copilot AI Subscriptions For Consumers, Small Business",
    "date": "1/16/2024",
    "url": "https://www.silicon.co.uk/e-innovation/artificial-intelligence/microsoft-copilot-ai-545889",
    "text": "All Tech News > category news Innovation > category news Artificial Intelligence Microsoft expands Copilot generative AI subscription access for consumers, smaller businesses as it integrates AI across product line Microsoft has opened up subscriptions to its ChatGPT-based Copilot AI tool to more users with a consumer version, called Copilot Pro, and a business edition that makes the offering accessible to smaller organisations. Copilot, introduced early last year under the name Bing Chat, is based on technology from OpenAI and Microsoft has been integrating a free version of it across its product line, including the Bing search engine and the Edge browser. The company has been testing a version integrated with its Office suite, called Copilot for Microsoft 365, since March, and in November introduced a subscription version of that product for enterprises worldwide that required a minimum of 300 users. The firm has now added a consumer version of the subscription product, called Copilot Pro, for $20 per person per month (£19 in the UK), and has removed the minimum user requirement for the business version of Copilot for Microsoft 365, allowing companies to sign up for $30 (£24) per user per month. Customers with a cloud subscription to Office will be able to use Copilot to help answer questions, summarise data, and create content in Word, Excel, PowerPoint, Outlook, and OneNote on PC, Mac and iPad. The subscription version, unlike the free version, gives users priority access to OpenAI’s latest models, starting with GPT-4 Turbo, prioritising access during peak times for faster performance, Microsoft said. It said users would soon be able to toggle between models to optimise their experience as they choose. The subscription gives access to faster AI image creation using Image Creator from Microsoft Designer – based on OpenAI’s Dall-E – along with Dall-E’s latest features, such as more detailed image quality and a landscape image format. Microsoft said it would soon give subscribers access to Copilot GPT Builder, which allows users to create their own Copilot GPT with a series of prompts. The firm said it was aiming the subscriptions at existing “power users” such as creators, researchers and programmers along with “anyone looking to take their Copilot experience to the next level”. Microsoft is a major investor in OpenAI and the company’s moves to integrate AI technology across its product line have helped boost its market capitalisation by over $1tn over the past year. As a result it overtook Apple as the world’s most valuable company late last week, with a market capitalisation of $2.89tn as of Monday’s close. The announcements come as the World Economic Forum opens in Davos, Switzerland, where AI is planned as a key topic and Microsoft chief executive Satya Nadella is scheduled to give a talk on Tuesday. NEWSLETTER Subscribe to our best articles Brand Discovery offers Advertisers the opportunity to speak directly to our professional communities. It’s an ad format that blends in with the editorial content and overall page design giving non-intrusive, flowing advertising experience. Readers can easily identify their provenance with the “Brand Discovery” mention. For any further information, contact us at the following address:\t\t\t\t\t\t internationalsales@netmediaeurope.com Follow us: "
}