{
    "title": "Microsoft CEO Satya Nadella to visit India in February. He may meet…",
    "date": "1/29/2024",
    "url": "https://www.hindustantimes.com/business/microsoft-ceo-satya-nadella-to-visit-india-in-february-he-may-meet-101706510044038.html",
    "text": "Subscribe Now! Get features like Microsoft Chief Executive Officer Satya Nadella will be visiting India on February 7 and 8 as part of his annual visit. The main focus of his India trip will be Artificial Intelligence (AI) and its opportunities. Puneet Chandok, Microsoft India and South Asia's president, said in an internal message to the company that Satya Nadella’s visit signifies Microsoft’s commitment to applying technology to expand opportunities in India. “AI is playing a game-changing role in shaping ‘India’s Techade’ and will make India and South Asia one of the most exciting markets for technology,” the email reportedly read. Last year, PM Modi met Satya Nadella during his US visit as he held meetings with prominent US and Indian technology executives such as Tim Cook from Apple and Sundar Pichai from Google. Satya Nadella's office then released a statement discussing his meeting with the PM highlighting the importance of Artificial Intelligence and India’s capabilities. “One important topic was the power of technology, particularly Artificial Intelligence, to help improve the lives of Indians. India is home to one of the most vibrant developer and start-up ecosystems in the world, and Microsoft remains deeply committed to the growth of Indian technology - that will impact both India and markets across the globe,” Microsoft’s statement then said. Last year, Satya Nadella made a four-day official visit to India during which he met some of the key customers, start-ups developers, not-for-profit organisations and students as well. Moneycountrol reported that founders of some of India’s prominent AI start-ups including Lightspeed and Peak XV-backed Sarvam, Bhavish Aggarwal's AI startup Krutrim may meet Satya Nadella in Mumbai and Bangalore this year. In October 2023, Satya Nadella highlighted Microsoft's big plans for AI after its partnership with OpenAI. It also announced that Micorsoft will be strengthening its partnership with OpenAI by integrating the Bing search engine into ChatGPT. After OpenAI’s board dismissed Sam Altman, Microsoft CEO Satya Nadella announced that Altman, Brockman, and other OpenAI employees will be joining the company's new advanced AI research team. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}