{
    "title": "German chancellor welcomes Microsoft's $3.5 billion AI investment in Germany",
    "date": "2/15/2024",
    "url": "https://apnews.com/article/germany-microsoft-ai-scholz-investment-63f9ec57e2e3d90e762b7a1c5133f6d8",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. Easter 2024 Federal Chancellor Olaf Scholz, right, and Vice Chair and President of Microsoft Corporation Brad Smith shake hands in Berlin, `Thursday, Feb. 15, 2024, after a press conference held by Microsoft Deutschland GmbH on the company’s investments in the AI sector in Germany. Chancellor Olaf Scholz welcomed an announcement by Microsoft on Thursday that it would invest more than 3.2 billion euros ($3.4 billion) in Germany over the next two years to massively expand its data center capacities for applications in the field of artificial intelligence and cloud computing. (Kay Nietfeld/dpa via AP) Federal Chancellor Olaf Scholz, right, and Vice Chair and President of Microsoft Corporation Brad Smith arrive in Berlin, `Thursday, Feb. 15, 2024, for a press conference held by Microsoft Deutschland GmbH on the company’s investments in the AI sector in Germany. Chancellor Olaf Scholz welcomed an announcement by Microsoft on Thursday that it would invest more than 3.2 billion euros ($3.4 billion) in Germany over the next two years to massively expand its data center capacities for applications in the field of artificial intelligence and cloud computing. (Kay Nietfeld/dpa via AP)     BERLIN (AP) — German Chancellor Olaf Scholz welcomed an announcement Thursday by Microsoft that it would invest almost 3.3 billion euros ($3.5 billion) in Germany over the next two years to massively expand its data center capacities for applications in the field of artificial intelligence and cloud computing. “This is a really good commitment to progress, to growth, to modernity and to global openness as the basis for these opportunities,” he said, adding it was also linked to the “fact that Germany remains very determined to be an open economy.” “Not only are we probably the most successful export economy in the world in terms of the size of our country, but we are also a country that trades with the whole world, that invests everywhere, but also invests in our own country,” he said. Microsoft President Brad Smith made the announcement in Berlin during a presentation with Scholz. The largest single investment in Microsoft’s 40-year history in Germany also includes an AI training program that aims to reach up to 1.2 million people, German news agency dpa reported. Microsoft is looking to be close to major customers, such as the pharmaceutical company Bayer AG and energy company RWE, in order to keep data latency between data centers and applications as low as possible. The central German state of Hesse will also benefit from Microsoft’s investments. Copyright 2024 The Associated Press. All Rights Reserved. "
}