{
    "title": "Microsoft is building its own server tech — networking hardware will lessen \nreliance on Nvidia and possibly ...",
    "date": "2/21/2024",
    "url": "https://www.techradar.com/pro/microsoft-is-building-its-own-server-tech-networking-hardware-will-lessen-reliance-on-nvidia-and-possibly-supercharge-ai-speeds",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Could Microsoft's move spell disaster for Nvidia and others? In a bold move to enhance the performance of its Maia AI server chip, Microsoft is reportedly developing its own network cards. According to a report by The Information, the project is reportedly being headed up by Pradeep Sindhu, CVP Silicon at Microsoft and CEO of Fungible, a server chip startup that Microsoft acquired in 2023. If true, Microsoft, one of the world’s biggest investors in artificial intelligence, could significantly reduce its reliance on Nvidia, which currently provides the industry with many crucial components. The rumored network card, similar to Nvidia’s ConnectX-7 card, is envisioned to optimize the performance of Microsoft’s Maia AI server chip. If successful, it could reduce the time required for OpenAI – another company that has benefited from major Microsoft investments – to train models on Microsoft servers, helping to improve cost efficiency. The report speculates that the development could take more than a year. Besides the positive impacts on Microsoft and company-backed artificial intelligence, more in-house components will help the Redmond giant to reduce its reliance on other companies, like Nvidia. Microsoft’s Maia chip, introduced in November, is designed to power large language models (LLMs) and support AI computing. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Moreover, the company’s significant investments in OpenAI, the startup behind the popular ChatGPT AI chatbot, have further solidified its position in the competitive market for artificial intelligence. Though both companies now sit below the all-important threshold (at the time of writing), Microsoft became the second company in the world to hit a market valuation of $3 trillion, following in Apple’s footsteps. Nvidia’s shares have also gone up a staggering amount since artificial intelligence hit the ground running, and its powerful position saw it reach an all-time high position as the third-most valuable company in the US. Though Microsoft’s developments do not look imminent, such a drastic move could severely impact Nvidia’s profits and share prices. With several years’ experience freelancing in tech and automotive circles, Craig’s specific interests lie in technology that is designed to better our lives, including AI and ML, productivity aids, and smart fitness. He is also passionate about cars and the decarbonisation of personal transportation. As an avid bargain-hunter, you can be sure that any deal Craig finds is top value! Canonical announces Snap Store crackdown after crypto scam apps overload DNA storage is coming, it's just a matter of when not if — SNIA quietly unveils first specifications for storing bytes in DNA medium, an important first step towards almost ultra-cheap, limitless storage Chrome's new Declutter tool may soon help manage your 100 plus open tabs By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Lance UlanoffMarch 29, 2024 By Craig HaleMarch 29, 2024 By Craig HaleMarch 29, 2024 By Rowan DaviesMarch 29, 2024 By Chris NortonMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}