{
    "title": "BNY Mellon partners with Microsoft - ThePaypers",
    "date": "2/6/2024",
    "url": "https://thepaypers.com/online-mobile-banking/bny-mellon-partners-with-microsoft--1266632",
    "text": "Following this announcement, both companies will focus on improving the overall capital markets and the broader financial services industry. By leveraging Microsoft Azure cloud and BNY Mellon’s extensive financial data and analytics offerings, the platform is expected to provide BNY Mellon’s buy-side and sell-side customers with an improved data management tool. The product was developed in order to offer deeper insights and actionable data that will optimise users’ investment performance, risk management, and distribution reach. The global collaboration between the firms will give financial institutions and companies the possibility to navigate complex market dynamics, with the needed precision, security, and agility while optimising risk management and improving operational efficiency as well.   As part of the expanded strategic deal, both Microsoft and BNY Mellon are set to explore the manner in which artificial intelligence (AI) technologies can be incorporated for optimised productivity and better-informed and efficient decision-making processes. While focusing on the expertise and platform to improve the way users achieve their goals, BNY Mellon will also prioritise the process of migrating its data and analytics workloads to Microsoft Azure. The companies will focus on meeting the needs, preferences, and demands of clients while remaining compliant with the laws and regulations of the local industry as well. By combining BNY Mellon’s data infrastructure and analytics solutions with Microsoft’s cloud services, the partnership will focus on the challenges that customers face as the technology and data ecosystems are becoming more and more complex, cost-intensive, and competitive. Throughout this collaboration, the companies aim to offer optimised applications for data and analytics, as BNY Mellon will take advantage of multiple technologies from Microsoft in order to develop advanced data management and software products which were personalised to the needs of capital markets firms. This will include data and analytics associated with increasing investments in multiple private markets, as well as alternative assets. In addition, the incorporation is set to provide BNY Mellon’s customers with near real-time, data-driven, and secure decision-making services that could optimise agility and adaptability in the evolving capital markets landscape. At the same time, BNY Mellon’s data and analytics suite of services will be completely available on the cloud, as the collaboration will prioritise the process of accelerating the release of the company’s data and analytics cloud-based SaaS capability. This tool was developed in order to optimise the way clients fast-track their asset onboarding, while also taking advantage of improved data and analytics at scale. This will also offer them the continuous integration and delivery of new upgrades and features. Every day we send out a free e-mail with the most important headlines of the last 24 hours. Subscribe now The Paypers is the Netherlands-based leading independent source of news and intelligence for professionals in the global payment community.\r\n                        The Paypers provides a wide range of news and analysis products aimed at keeping the ecommerce, fintech, and payment professionals informed about latest developments in the industry. tp:news\ntp:research\ntp:events The Paypers\r\n                        Prinsengracht 777e\r\n                        1017 JZ Amsterdam\r\n                        The Netherlands Telephone: +31 20 658 0652 © 2024 The Paypers BV. All rights reserved.\r\n                    No part of this site can be reproduced without explicit permission of The Paypers(V2.7). Privacy Policy\nCookie Statement\nTerms and Conditions "
}