{
    "title": "Microsoft CEO Satya Nadella, other tech top bosses to visit India in \nFebruary",
    "date": "2/1/2024",
    "url": "https://newsable.asianetnews.com/business/microsoft-ceo-satya-nadella-other-tech-top-bosses-to-visit-in-india-in-february-gcw-s868f0",
    "text": "Top executives from Microsoft Corp. and Alphabet Inc. are touring India over the next week to court the country's millions of programmers and support the adoption of artificial intelligence services in a key market. Over the course of the next week, top executives from Alphabet Inc. and Microsoft Corp. will be visiting India in an effort to woo the nation's millions of programmers and encourage the use of AI services in a critical market. Next week, Microsoft CEO Satya Nadella will visit Bengaluru, the centre of the nation's IT industry, to speak with developers and researchers about \"discovering new opportunities with AI\". He will also discuss the advantages and disadvantages of next-generation AI with Mumbai's business elites. Separately, Google Chief Scientist Jeff Dean will address academics, developers, and entrepreneurs in Bengaluru on AI's next frontier. He will also take part in a fireside talk regarding India's role in allowing AI to deliver significant social impact. The simultaneous appearances underscore the significance of India for businesses as well as the larger AI industry. At a time when AI expertise is frequently in short supply, India is developing as one of the greatest sources of AI talent for startups and multinational corporations, with over 5 million programmers. Nvidia Corp. CEO Jensen Huang stated that India may become the world's biggest supplier of AI knowledge while on a vacation there last year. Before moving to the US for graduate school, Nadella and Google CEO Sundar Pichai both studied engineering as young adults growing up in India. The AI push might define both of their careers. The transition to artificial intelligence (AI) has been dubbed \"bigger than the internet\" by Pichai and \"Microsoft's moment\" by Nadella. Microsoft recently said that it will provide 100,000 Indian engineers with training on the newest AI tools and technologies. Nearly half a million developers with expertise in AI and data sciences were tallied by Nasscom, the trade association for the Indian IT sector, last year. TCS begins freshers' hiring! You can apply till April 10; Here's how you can apply Explained: Why is government mulling geo-tagging telecom infrastructure? Ambani and Adani ink 'power' deal; Reliance to buy 26% stake in Mahan Energen Kerala: Gold rate sets record for first time; One sovereign gold crosses Rs 50000 Lok Sabha Polls 2024: INC's DK Suresh files nomination, declares assets worth Rs 1064 crore in real estate Mitchell Starc's struggles in IPL 2024: Former Indian all rounder Irfan Pathan offers advice False promises turn into nightmare for cousins: 2 men from Haryana tortured for refusing to join Russian army Biden reveals World leaders' concerns about Trump winning 2024 Presidential polls at India's G20 summit Why does Imran Khan pay Rs 9 lakh to Karan Johar every month? Should we wash our hair daily? From AI to UPI, what Bill Gates and PM Modi will discuss during interaction in Delhi (WATCH) Bengaluru water crisis: Residents under scrutiny for defying orders on Holi pool parties, rain dance (WATCH) Colours of Holi in Washington DC's Dupont Circle (WATCH) Groundbreaking! India becomes largest gaming market worldwide with 568 million gamers (WATCH) Delhi man stabs woman in Mukherjee Nagar for 'making fun of him'; video viral on social media (WATCH) Follow us on: "
}