{
    "title": "5 Best Stocks to Buy According to Billionaire D.E. Shaw",
    "date": "2/29/2024",
    "url": "https://www.insidermonkey.com/blog/5-best-stocks-to-buy-according-to-billionaire-d-e-shaw-1266058/5",
    "text": "DE Shaw’s Stake: $2,568,939,070 Microsoft Corp (NASDAQ:MSFT) is the biggest holding of DE Shaw since the billionaire’s fund owns a $2.6 billion stake in Microsoft Corp (NASDAQ:MSFT) as of the end of 2023. RiverPark Large Growth Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter: “Microsoft Corporation (NASDAQ:MSFT): MSFT was a top contributor in the quarter following strong FY1Q24 earnings in late October. In that earnings report, MSFT delivered better-than-expected revenue (+13%) and earnings (+27%), with growth in both accelerating from the prior quarter. All three major segments grew revenue faster than expected, highlighted by 28% constant currency growth in Azure, the company’s cloud offering. This marked the first quarter-over-quarter acceleration for Azure in six quarters. Operating margins (48%) were 400 basis points better than expected and earnings came in 13% ahead of expectations. Cloud-based services have become the company’s largest revenue and earnings producer. The company’s Azure platform alone has the potential to grow to more than $100 billion in annual revenue over the next decade. Overall, we believe that the company will continue to deliver double-digit revenue and EPS growth and generate an enormous amount of free cash flow to both return to shareholders and use for acquisitions.” Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below. You can also look at the 13 Best Long-Term Dividend Stocks To Buy Now and the 10 Small-Cap Energy Stocks with Strong Returns. NASDAQ:AMDNASDAQ:AAPLNASDAQ:AMZNNASDAQ:MSFTNASDAQ:NVDAApple Inc (NASDAQ:AAPL)Nvidia Corp (NASDAQ:NVDA)Microsoft Corp (NASDAQ:MSFT)Amazon.com Inc. (NASDAQ:AMZN)Advanced Micro Devices Inc. (NASDAQ:AMD)13 Best Long-Term Dividend Stocks to Buy Now10 Small-Cap Energy Stocks with Strong Returns5 Best Stocks to Buy According to Billionaire D.E. ShawShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}