{
    "title": "Microsoft Unveils Ambitious Partnership Plan To Develop AI With India",
    "date": "2/8/2024",
    "url": "https://www.ndtv.com/india-news/microsoft-unveils-ambitious-partnership-plan-to-develop-ai-with-india-5017078",
    "text": "Microsoft today unveiled an ambitious plan for the India's burgeoning AI landscape. The company's CEO, Satya Nadella, today outlined their vision to build tools specifically tailored for AI developers and to become India's most-trusted partner in the realm of artificial intelligence. \"AI for everyone. We want to be India's most trusted partner for that,\" Mr Nadella said at a keynote session in Bengaluru, emphasizing the company's commitment to making AI accessible and inclusive. Microsoft will provide 2 million people in India with AI skilling opportunities by 2025, Mr Nadella Nadella said on Wednesday, adding that it is imperative for India and the United States to cooperate on AI norms and regulations.  The skilling will focus on training individuals in tier-2 and tier-3 cities, as well as rural areas and unlock inclusive socio-economic progress, the company said in a statement. \"I hope consensus emerges and that is what really helps, in some sense, (with) the diffusion of this technology,\" Mr Nadella said. Reflecting on the evolution from chat-based AI like GPT, the CEO highlighted the progress made in computing history over the past 70 years. The goal, he said, is to create computers that understand human users, enabling seamless conversations and interactions across diverse topics, including sports like cricket and baseball. The heart of Microsoft's strategy lies in digitising and analysing data through a neural engine, aimed at making sense of vast amounts of information and identifying patterns. The company sees immense potential for AI in contributing to economic growth, particularly through products like Microsoft Copilots, which is set to launch with a new ad campaign to establish its place in the AI landscape. PromotedListen to the latest songs, only on JioSaavn.com Microsoft is not just stopping at tools and platforms but is actively involved in building AI infrastructure, including model training and inferencing. Mr Nadella said the company prides itself on having the best large models, including GPT varieties, and has an aggressive roadmap for advancing AI.  Track Latest News Live on NDTV.com and get news updates from India  and around the world. Watch Live News: Follow Us: ................................ Advertisement ................................ "
}