{
    "title": "Apple won’t be forced to open iMessage to rivals, EU decides, as it also \nlets three Microsoft services off DMA hook",
    "date": "2/13/2024",
    "url": "https://techcrunch.com/2024/02/13/apple-wont-be-forced-to-open-imessage-to-rivals-eu-decides-as-it-also-lets-three-microsoft-services-off-dma-hook/",
    "text": "Apple won’t be forced to make iMessage interoperate with WhatsApp and other messaging rivals after all, nor will Microsoft face tighter controls on how it can operate its search engine Bing in the European Union after the bloc’s lawmakers concluded the services do not meet the bar for designation under the Digital Markets Act (DMA). The Commission also said today that it has closed two other market investigations — into Microsoft’s web browser Edge and online advertising service, Microsoft Advertising — without finding that they should be designated as so-called “core platform services” under the regulation. So the decisions mean there’s no expansion of the initial list of 22 core platform services the Commission announced last year. Apple and Microsoft were both confirmed as DMA “gatekeepers” for a total of five core platform services last fall — when Apple’s mobile OS iOS, its App Store and web browser Safari, and Microsoft’s Windows OS and social network LinkedIn, were named as falling in-scope of the ex ante competition regulation. The pan-EU regulation puts interoperability requirements on in-scope messaging apps, and — more broadly — applies a set of up front obligations and requirements on how gatekeeping giants can run designated services. WhatsApp is preparing to roll out third-party chat support  At the time of the initial designations, the Commission said it would open investigations to consider submissions from the two tech giants arguing, respectively, that iMessage (in Apple’s case), and Bing, Edge and Microsoft Advertising (in Microsoft’s), should not be added to the list of regulated core platform services. The pan-EU regulation sets a usage bar of 45 million+ monthly active users (and 10,000 business users) for service designation and the pair had claimed the services in question were insufficiently popular — including, in the case of Apple, claiming business users of iMessage are actually using a separate product. The Commission had allowed itself a maximum of five months to consider the pair’s arguments against further designations and wrap up the investigations. So, in the event, it’s taken the full allocation — saying it adopted the decisions yesterday. Apple and Microsoft were contacted for comment on the designation reprieves for iMessage, Bing, Edge and Microsoft Advertising respectively. At press time Microsoft could not be reached but an Apple spokesperson sent us this statement — welcoming the development: We thank the Commission for agreeing with us that iMessage should not be designated under the DMA. iMessage is a great service that Apple users love because it provides an easy way to communicate with friends and family while offering industry-leading privacy and security protections. Consumers today have access to a wide variety of messaging apps, and often use many at once, which reflects how easy it is to switch between them. The decisions not to designate the four additional services stand for now. But the Commission’s press release notes it “will continue to monitor the developments on the market with respect to these services, should any substantial changes arise” — implying that notable changes in market share could trigger a reassessment. Gatekeepers — including Apple and Microsoft — are expected to ensure designated core platform services are compliant with the DMA rules by March 7 — which is why, in recent weeks, we’ve seen a raft of announcements and changes from tech giants claiming to be getting their services ready for the deadline. Whether they are actually compliant remains to be seen — it’ll be for the Commission, which enforces the DMA on gatekeepers, to determine that. (NB: Penalties for breaching the regime can scale up to 10% of global annual turnover, or 20% for repeat offenders.) Apple’s answer to EU’s gatekeeper rules is new ‘core tech’ fee for apps  A closer look at Apple’s browser-related changes to iOS in EU  "
}