{
    "title": "Microsoft 365 Insider Bug Bounty program is here, up to $30K for grabs",
    "date": "2/28/2024",
    "url": "https://mspoweruser.com/microsoft-365-insider-bug-bounty-program-is-here-up-to-30k-for-grabs/",
    "text": "Follow us Share this article Improve this guide 1 min. read Published on February 28, 2024 published on \n\nFebruary 28, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft is upping the ante to find and fix security vulnerabilities in pre-release versions of its popular productivity suite. The company announced today that it’s doubling the maximum reward for critical bugs found in Microsoft 365 Insider builds, raising the bar to a staggering USD 30,000. This move comes alongside expanding the program’s scope, now encompassing a wider range of vulnerability types and products. Previously unreported vulnerabilities that bypass security features or impact Microsoft OneNote, for example, are now eligible for rewards. Additionally, a tiered award system has been implemented, offering varying payouts based on the severity of the vulnerability and the quality of the report submitted. “We are constantly evolving our bounty programs to stay ahead of the curve in the ever-changing security landscape,” Said Bruce Robinson of the Microsoft Security Response Center (MSRC). Researchers interested in participating can join the Microsoft 365 Insider program and submit their findings through the MSRC Researcher Portal. This update highlights Microsoft’s continued commitment to working with the security research community to identify and address potential security issues before malicious actors can exploit them. More here. More about the topics: Bug Bounty Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}