{
    "title": "Company IT admins can now get faster access to non-security Windows 11 \nupdates",
    "date": "3/26/2024",
    "url": "https://www.neowin.net/news/company-it-admins-can-now-get-faster-access-to-non-security-windows-11-updates/",
    "text": "8 minutes ago 2 hours ago 3 hours ago 4 hours ago 8 minutes ago 2 hours ago 5 hours ago 15 hours ago Mar 28, 2024 Mar 27, 2024 Mar 26, 2024 Mar 26, 2024 Mar 28, 2024 Mar 28, 2024 Mar 26, 2024 Mar 26, 2024 5 hours ago 6 hours ago 7 hours ago 7 hours ago Mar 25, 2024 Mar 23, 2024 Mar 20, 2024 Mar 17, 2024 Dec 31, 2023 Oct 14, 2023 Apr 11, 2023 Mar 27, 2024 Mar 25, 2024 Mar 10, 2024 Mar 3, 2024 Mar 24, 2024 Mar 21, 2024 Sep 23, 2023 Sep 21, 2023 16 hours ago Mar 28, 2024 Mar 28, 2024 Jun 14, 2003 Feb 23, 2024 Jan 20, 2024 Dec 6, 2023 Jun 6, 2023 John Callaham\n\nNeowin\n@JCalNEO        ·\n    \n\n    Mar 26, 2024 18:24 EDT\n    \n\nwith 5 comments Earlier today, Microsoft released the latest non-security update for its supported versions of Windows 11, which includes the many new features found as part of the \"Moment 5\" release for the operating system (Windows 10 also received new updates). Today, Microsoft announced a new feature for company IT admins who are in charge of updating the Windows 11 PCs for their business or organization. In a blog post, Microsoft announced that IT admins can now expedite non-security updates for Windows 11. Previously, those workers could only expedite security updates for the OS. Microsoft stated that the feature has helped in managing those kinds of releases. It offered some reasons why this new non-security feature will be helpful: By expediting non-security quality updates, you can quickly obtain many fixes that are considered critical by your peers. Additionally, we want you to be able to deploy out-of-band (OOB) updates to devices faster than ever. In short, you can now improve the stability, performance, and functionality of devices by addressing quality issues before the next security update. The new feature will be available for IT pros who use Intune and Microsoft Graph for their Windows 11 PC updates. Microsoft says the procedure to get expedited non-security updates is the same as the one used for security updates in Intune. The blog includes specific instructions and requirements for handling these updates. Microsoft does note that this new feature is only for companies that have Windows 11-based PCs. It says: This new feature is intricately designed to align with the unique architecture and requirements of Windows 11, providing you with optimized experience. Today's non-security update for Windows 11, under KB5035942, includes adding more content to its lock screen, additional voice access language support, a dedicated mode for Windows 365 Boot, and a number of other new features, improvements, and bug fixes. Sayan Sen\n                                                ·\n                    \nJul 28, 2023\n\nwith\n8\n                            comment\n                                s Usama Jawad\n                                                ·\n                    \nApr 12, 2023\n\nwith\n2\n                            comment\n                                s Usama Jawad\n                                                ·\n                    \nApr 4, 2023\n\nwith\n0\n                            comment\n                                s Usama Jawad\n                                                ·\n                    \nFeb 16, 2023\n\nwith\n0\n                            comment\n                                s Login or Sign Up to read and post a comment. Please enter your reason for reporting this comment. dragons dogma 2 beestation promo baseus microsoft weekly windows 11 insider preview promo twirl 157 windows 11 insider preview promo windows 11 moment 5 windows 11 moment 5 baseus pb tails © Since 2000 Neowin®\n                                    All trademarks mentioned are the property of their respective owners. "
}