{
    "title": "Microsoft Copilot for Security Debut Imminent",
    "date": "3/22/2024",
    "url": "https://www.msspalert.com/news/microsoft-copilot-for-security-release-date-is-april-1",
    "text": " Credit: Adobe Stock Images Microsoft Copilot for Security is scheduled for general availability on April 1, following a private preview of the software giant's AI assistant for security by select customers including MSSPs. Microsoft will offer the technology as both a standalone product and one that is embedded within the security products customers already use. To make Copilot for Security accessible to a wider range of organizations, Microsoft is introducing a provisioned pay-as-you-go licensing model. This is different from the debut of Microsoft Copilot for 365 which came with a $30 per seat licensing fee and a minimum number of seats purchased at 300. Microsoft did not offer not-for-resale licenses to partners for Copilot for 365. Microsoft said the consumption model for Copilot for Security means it will be easy to get started quickly and on a small scale and  to experiment and learn with no upfront per device or per user charges. Customers will use their existing Azure subscription or sign up for one if they are not already an Azure customer. They will then be able to provision Azure capacity to support all their Copilot for Security workloads, both standalone and embedded. Copilot for Security capacity is anticipated to be billed monthly via a new Security Compute Unit (SCU) at the rate of $4/hr.  Microsoft recommends that customers have MDE P2 or Microsoft Sentinel for a better product experience. Microsoft describes Copilot for Security as a product to complement rather than replace human skills. Noting a recent research study conducted by its Office of the Chief Economist, experienced security analysts using Copilot for Security were 22% faster at common security tasks. Their accuracy increased by 7%. And 97% of security analysts said they wanted to use Copilot again, Microsoft said. “Our partners bring their experience, skills, and established methods for dealing with vulnerabilities,” Microsoft’s Julie Sanford, vice president of Programs & Experiences, Partner GFM, wrote in her blog post. “This new tool enables them to apply their expertise to services and offerings that AI solutions without human insights cannot match.”  Sanford said that the solution combines the most advanced GPT4 model from OpenAI with Microsoft-developed AI orchestration. It also consolidates and integrates Microsoft global threat intelligence capabilities, as well as a comprehensive set of security products in one place. Microsoft said Copilot for Security provides a live, comprehensive view of a user’s security estate that lets them consistently evaluate and enhance their protection — to increase efficiency and cooperation with a simplified, natural language-based user experience. Over the past six months, Microsoft has partnered with more than 100 MSSPs and independent software vendors in a Copilot for Security Partner private preview. These organizations have enhanced Copilot’s development by testing and enhancing new scenarios, providing feedback on product development and operations for future releases, and assessing APIs to aid in Copilot for Security extensibility. Microsoft said it will conduct a series of sales and technical readiness bootcamps in the coming months to equip its entire partner ecosystem with the skills to support customers in meeting their security requirements. “Partners have the opportunity to help with scalability, operational team design and reporting through flexible allocation of analysts, audience-specific reporting, and promoting quick response and cooperation,” Sanford said. “The benefits of managed security services may also include managed SOC expertise, scenario-based processes, and the design and operation of unified and adaptable teams.” The product launch was preceded by the release of Copilot for Microsoft 365, Copilot for Finance, Copilot for Sales, Copilot for Service, and Copilot for the education market. With respect to Security Copilot embedded in the Microsoft 365 Defender XDR platform, organizations that work with MSSPs and are part of Microsoft’s Early Access Program will be able to extend access to their Security Copilot environment. As such, MSSPs can participate using Security Copilot (Bring Your Own — MSSP). Jim Masters is Managing Editor of MSSP Alert, and holds a B.A. degree in Journalism from Northern Illinois University. His career has spanned governmental and investigative reporting for daily newspapers in the Northwest Indiana Region and 16 years in a global internal communications role for a Fortune 500 professional services company. Additionally, he is co-owner of the Lake County Corn Dogs minor league baseball franchise, located in Crown Point, Indiana. In his spare time, he enjoys writing and recording his own music, oil painting, biking, volleyball, golf and cheering on the Corn Dogs. Jim MastersMarch 19, 2024 Gartner predicts that GenAI will reduce the cybersecurity skills gap, alleviating the talent crisis. Jim MastersMarch 15, 2024 The new embedded experience opens up scenarios directly from within Microsoft 365 Defender. Jim MastersMarch 14, 2024 Avalor’s data fabric capability will be combined with ZScaler's large security data set.  "
}