{
    "title": "Microsoft Gaming CEO Phil Spencer Reflects: 'I Don't Want This Industry To \nBe A Place Where People Can't, With ...",
    "date": "3/27/2024",
    "url": "https://www.tradingview.com/news/benzinga:1d58613d5094b:0-microsoft-gaming-ceo-phil-spencer-reflects-i-don-t-want-this-industry-to-be-a-place-where-people-can-t-with-confidence-build-a-career/",
    "text": "Phil Spencer, the CEO of Microsoft Corp.'s MSFT Gaming division, offered a candid perspective on the current state of the gaming industry. \"The math on [making] a game has definitely changed,\" Spencer told Polygon, noting how production costs are soaring to unprecedented levels — sometimes hitting $300 million per game. Beyond the financial burden, Spencer emphasized the impact on creativity. \"This cost really reduces the risk that publishers are willing to take,\" he added. It's a reality that forces developers to prioritize safe bets over innovative ventures. See Also: Phil Spencer's Xbox Handheld Vision Unveiled: 'Seamless Integration, Full-Screen App' And What Else To Expect When discussing console exclusives, Spencer admitted: \"The case for exclusivity gets pressured as the cost of the game goes up.\" It's a tough reality for developers trying to strike a balance between profit margins and consumer demand. Turning to market growth, Spencer expressed concern over stagnation, bluntly stating: \"The console market has not grown in the past year.\" In an industry where competition is fierce and consumer bases remain static, the challenge lies in attracting new players. As for whether the 1,900 layoffs at Activision Blizzard King are just a part of the gaming industry's broader challenges or something unique to Xbox, Spencer says, \"It's a little bit of both.\" Publicly traded gaming companies are under pressure to demonstrate growth to their investors. \"When you have an industry that is projected to be smaller next year... the side of the business that then gets scrutinized is the cost side,\" he laments. \"I don’t want this industry to be a place where people can’t, with confidence, build a career.\" Read Next: Xbox's Phil Spencer Announces Day-One Release Of All Activision Games On Xbox Game Pass: Is Call Of Duty Included? Image credits: Miguel Lagoa on Shutterstock and photo courtesy eVRydayVR on Flickr © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}