{
    "title": "Seaport Res Ptn Equities Analysts Increase Earnings Estimates for \nChesapeake Energy Co. (NASDAQ:CHK)",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-chk-analyst-earnings-estimates-2024-03-21/",
    "text": "Chesapeake Energy Co. (NASDAQ:CHK - Free Report) - Equities researchers at Seaport Res Ptn boosted their Q3 2024 EPS estimates for shares of Chesapeake Energy in a report released on Tuesday, March 19th. Seaport Res Ptn analyst N. Pope now forecasts that the company will post earnings per share of $0.72 for the quarter, up from their previous estimate of $0.64. The consensus estimate for Chesapeake Energy's current full-year earnings is $3.24 per share. Seaport Res Ptn also issued estimates for Chesapeake Energy's Q4 2024 earnings at $0.83 EPS, FY2024 earnings at $2.82 EPS, Q1 2025 earnings at $0.94 EPS, Q2 2025 earnings at $0.55 EPS, Q3 2025 earnings at $0.97 EPS, Q4 2025 earnings at $1.49 EPS and FY2025 earnings at $3.95 EPS. Several other research firms also recently commented on CHK. Mizuho dropped their price target on shares of Chesapeake Energy from $104.00 to $100.00 and set a \"buy\" rating for the company in a research note on Wednesday, March 6th. Johnson Rice lowered shares of Chesapeake Energy from a \"buy\" rating to an \"accumulate\" rating in a research note on Thursday, December 14th. Benchmark dropped their price target on shares of Chesapeake Energy from $107.00 to $93.00 and set a \"buy\" rating on the stock in a research note on Friday, January 12th. StockNews.com lowered shares of Chesapeake Energy from a \"hold\" rating to a \"sell\" rating in a research report on Tuesday, December 19th. Finally, Wells Fargo & Company reduced their price target on shares of Chesapeake Energy from $89.00 to $88.00 and set an \"equal weight\" rating on the stock in a report on Wednesday, November 22nd. One equities research analyst has rated the stock with a sell rating, four have issued a hold rating and five have assigned a buy rating to the company. Based on data from MarketBeat, the stock currently has a consensus rating of \"Hold\" and an average target price of $101.56. Get Our Latest Report on Chesapeake Energy Shares of NASDAQ:CHK traded up $0.06 during trading on Thursday, hitting $86.25. The company's stock had a trading volume of 1,669,337 shares, compared to its average volume of 2,280,474. The business has a 50 day moving average price of $79.85 and a two-hundred day moving average price of $81.60. The company has a market capitalization of $11.28 billion, a PE ratio of 5.13, a P/E/G ratio of 5.48 and a beta of 0.51. The company has a debt-to-equity ratio of 0.19, a quick ratio of 1.99 and a current ratio of 1.99. Chesapeake Energy has a fifty-two week low of $72.17 and a fifty-two week high of $91.00. Chesapeake Energy (NASDAQ:CHK - Get Free Report) last posted its earnings results on Tuesday, February 20th. The company reported $1.31 earnings per share for the quarter, beating the consensus estimate of $0.42 by $0.89. Chesapeake Energy had a net margin of 27.74% and a return on equity of 6.74%. The firm had revenue of $1.95 billion during the quarter, compared to the consensus estimate of $962.95 million. During the same quarter last year, the firm earned $4.22 EPS. A number of institutional investors and hedge funds have recently added to or reduced their stakes in CHK. Belpointe Asset Management LLC grew its position in Chesapeake Energy by 478.3% in the first quarter. Belpointe Asset Management LLC now owns 347 shares of the company's stock worth $26,000 after acquiring an additional 287 shares in the last quarter. Principal Securities Inc. bought a new stake in Chesapeake Energy in the fourth quarter worth approximately $28,000. Parkside Financial Bank & Trust grew its position in Chesapeake Energy by 132.1% in the second quarter. Parkside Financial Bank & Trust now owns 362 shares of the company's stock worth $30,000 after acquiring an additional 206 shares in the last quarter. Salem Investment Counselors Inc. bought a new stake in Chesapeake Energy in the first quarter worth approximately $32,000. Finally, Gladius Capital Management LP bought a new stake in Chesapeake Energy in the third quarter worth approximately $36,000. 97.93% of the stock is owned by hedge funds and other institutional investors. The business also recently disclosed a quarterly dividend, which will be paid on Tuesday, March 26th. Investors of record on Thursday, March 7th will be given a dividend of $0.575 per share. This represents a $2.30 dividend on an annualized basis and a yield of 2.67%. The ex-dividend date is Wednesday, March 6th. Chesapeake Energy's payout ratio is presently 13.66%. Chesapeake Energy Corporation operates as an independent exploration and production company in the United States. It engages in acquisition, exploration, and development of properties to produce oil, natural gas, and natural gas liquids from underground reservoirs. The company holds interests in natural gas resource plays in the Marcellus Shale in the northern Appalachian Basin in Pennsylvania and the Haynesville/Bossier Shales in northwestern Louisiana.Featured StoriesFive stocks we like better than Chesapeake EnergyHow is Compound Interest Calculated?Google and Meta Circling the Market on a TikTok Ban RallyDo ETFs Pay Dividends? What You Need to KnowIntuitive Machines: Charting a Course Among the StarsThe How and Why of Investing in Gold StocksKB Home’s Stock Price Can Move Higher, Here’s Why  Before you consider Chesapeake Energy, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Chesapeake Energy wasn't on the list. While Chesapeake Energy currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}