{
    "title": "Microsoft's VP of HR: 'Our ultimate goal is to create a more effective and \nefficient HR function'",
    "date": "3/13/2024",
    "url": "https://www.hcamag.com/nz/specialisation/diversity-inclusion/microsofts-vp-of-hr-our-ultimate-goal-is-to-create-a-more-effective-and-efficient-hr-function/480883",
    "text": "Amy Coleman sits down with HRD to chat growth mindset, DEI pushes and the changing face of HR Amy Coleman, VP of HR and corporate functions at Microsoft, wears a lot of hats. Speaking to HRD, she says that her days are a dynamic blend of strategic oversight and hands-on management and work, which always manages to keep her on her toes. “[My role spans] HR, legal and philanthropies, business development, marketing and finance - and for my role supporting the HR organization, I’m responsible for helping define our long-term people strategy and people priorities, including shaping our company culture. “In addition, I also lead our Global Employee Relations function and am the HR leader for our Crisis Management team, which we’ve mobilized a lot over the past few years to address major moments like the pandemic, the resulting shift to remote work, social unrest and local conflicts, and wars. There’s not really a typical day, but rather many related parts that come together under various circumstances and across teams.” Coleman’s experiences are reflective of the colossal changes that the HR function has undergone in the years since COVID. Where once CEOs might have seen HR leaders as serving on singular ‘people-led’ purpose, HR practitioners now touch practically every arm of the business – from employee relations to ESG to budget planning. According to data from Sage, 96% of C-suite executives say that HR’s role has changed dramatically over the past five years, with 73% adding that they believe the term ‘human resources’ is actually outdated. Furthermore, a majority of CEOs say that HR leaders should be taking on more of a strategic focus, however 76% admit that the role is still heavily involved in the administrative side of the business. At Microsoft, HR seems to be heavily involved in both – something which is seen in their inclusive and growth-mindset culture. “The most important driver of Microsoft’s success is our culture,” says Coleman. “We fundamentally believe that we need a culture founded in a growth mindset, a belief that everyone can grow and develop, that potential is nurtured, not predetermined, and that anyone can change their mindset. This foundational mindset ensures that we build the constant curiosity, desire to learn, and psychological safety needed to embrace innovation and navigate the uncertainty that innovation and progress can bring.” Colman tells HRD that she and her team exercise their growth mindset every day through three cultural attributes: Customer-obsessed: “We aim to learn about our customers and their businesses with a beginner’s mind and then provide solutions that meet their needs.” Diverse and inclusive: “We believe in harnessing the power of diversity for better ideas and products, by seeking out and inviting differences, and being open to learning, addressing biases and changing our behaviours.” One Microsoft: “Our shared mission – to empower every person on the planet to achieve more – unites us in our efforts, resulting in teamwork that makes our goals achievable. I also aim to align with our management framework that is designed to deliver success through empowerment and accountability by modelling, coaching, and caring.” And while all this commitment to change is exceptional, it’s somewhat meaningless unless HR leaders are actively monitoring the progress and metrics. At Microsoft, this is done annually via their internal report. “The 2023 report was our 10th year publicly releasing diversity and inclusion (D&I) data and reinforces our unwavering focus: To attract, develop, and retain a workforce that reflects the world and build a culture where everyone can thrive,” Coleman tells HRD. “To sustain our momentum, we apply long-term vision, the conviction and accountability of our most senior leaders, and persistence to build on our efforts, day after day, year after year.” In addition to demographic data, the HR team seeks to understand how employees feel so they can gauge the impact of their D&I efforts and close the gap between the culture they aspire to and the lived experiences of everyone at Microsoft. “By weaving D&I into everything we do, we spark the innovation necessary to drive business results. When employee lived experience is positive, everything else gets better, including customer experiences and product innovation.” Of course, HR competencies include tech’s ever-prominent role – especially where generative AI is concerned. According to research from Gartner, up to 81% of HR leaders are using AI, with further data from Harvard Business Review finding that 46% of HR practitioners are using the tech to make ‘smarter hiring decisions’. “We’re excited about the potential for AI to actually bring more humanity into the workplace, and into HR,” explains Coleman. “We envision AI as a tool that will bring the ‘human’ in human resources to the forefront by alleviating some of the daily drudge work so that our HR leaders can instead focus on the things that take emotional intelligence, judgement and humanity to do – things like mentorship, leadership, and more. “Our ultimate goal is to create a more effective and efficient HR function, one that supports and enables our most valuable asset: our people. This means using AI to create more meaningful work for our HR employees, as well as improving the experiences of employees who use these services.” An example of this is Microsoft’s AskHR Virtual assistant, an AI-powered virtual assistant that can answer employee questions or provide HR resources by referencing its policies. To date, this solution has enabled the company and HR professionals to save about 21,000 hours that would have been spent on answering simple queries, and instead allows them to use that time for assisting employees and managers in more strategic ways. Looking ahead to what the future holds for both HR at Microsoft and the sector in general, Coleman tells HRD that change will continue to dominate. “HR roles have transformed significantly over the past 25 to 30 years,” she says. “Today, HR professionals actively participate in strategic conversations, influencing how employees think, feel, and experience work. Being at the table during these discussions is exciting because it allows HR to elevate and shape the people strategies within the organisation. “I’m proud of initiatives that promote global women’s leadership at Microsoft. Role modelling and providing visible examples of senior female leaders are crucial for retention and career growth. “I’m also excited by the opportunity that AI offers for freeing people up to focus on the work that matters and what that means for creativity, job satisfaction and innovation. As we continue to evolve our culture through another major shift in work, I can take learnings from the culture work we did during the pandemic to support our team through this transition. It’s an exciting time to work in HR, to learn how to work with AI and lead change within an organisation for building a culture that will thrive with AI.”  26 Mar 2024 26 Mar 2024 29 Mar 2024 "
}