{
    "title": "Truist Financial Reaffirms Buy Rating for Microsoft (NASDAQ:MSFT)",
    "date": "3/25/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-msft-reiterated-rating-2024-03-25/",
    "text": "Microsoft (NASDAQ:MSFT - Get Free Report)'s stock had its \"buy\" rating reissued by investment analysts at Truist Financial in a research report issued on Monday, Benzinga reports. They currently have a $600.00 price target on the software giant's stock. Truist Financial's target price would indicate a potential upside of 41.89% from the stock's current price. MSFT has been the subject of several other reports. Argus upped their target price on Microsoft from $390.00 to $430.00 and gave the company a \"buy\" rating in a report on Tuesday, December 5th. Macquarie boosted their price objective on Microsoft from $430.00 to $450.00 and gave the stock an \"outperform\" rating in a research report on Wednesday, January 31st. Royal Bank of Canada boosted their price objective on Microsoft from $415.00 to $450.00 and gave the stock an \"outperform\" rating in a research report on Wednesday, January 31st. DA Davidson reiterated a \"buy\" rating and set a $500.00 price objective on shares of Microsoft in a research report on Friday, March 15th. Finally, Wells Fargo & Company upped their target price on Microsoft from $435.00 to $460.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, January 31st. Four equities research analysts have rated the stock with a hold rating and thirty-six have issued a buy rating to the company. According to MarketBeat, the company has a consensus rating of \"Moderate Buy\" and an average target price of $422.05. Check Out Our Latest Report on Microsoft Shares of NASDAQ:MSFT traded down $5.88 during trading on Monday, hitting $422.86. The company's stock had a trading volume of 18,042,123 shares, compared to its average volume of 23,165,963. The company has a debt-to-equity ratio of 0.19, a quick ratio of 1.20 and a current ratio of 1.22. Microsoft has a fifty-two week low of $272.05 and a fifty-two week high of $430.82. The stock's 50-day moving average price is $408.33 and its two-hundred day moving average price is $372.38. The company has a market capitalization of $3.14 trillion, a PE ratio of 38.23, a PEG ratio of 2.28 and a beta of 0.89. Microsoft (NASDAQ:MSFT - Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 earnings per share for the quarter, beating the consensus estimate of $2.76 by $0.17. The firm had revenue of $62.02 billion during the quarter, compared to analyst estimates of $61.14 billion. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. Microsoft's quarterly revenue was up 17.6% on a year-over-year basis. During the same period in the previous year, the company earned $2.32 earnings per share. As a group, sell-side analysts expect that Microsoft will post 11.63 EPS for the current year. In related news, major shareholder Corp Microsoft sold 1,000,000 shares of the stock in a transaction that occurred on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the sale, the insider now owns 11,677,398 shares in the company, valued at approximately $22,770,926.10. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this hyperlink. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of the firm's stock in a transaction on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the transaction, the insider now owns 11,677,398 shares of the company's stock, valued at $22,770,926.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this hyperlink. Also, EVP Kathleen T. Hogan sold 21,955 shares of the firm's stock in a transaction on Monday, March 11th. The shares were sold at an average price of $403.96, for a total transaction of $8,868,941.80. Following the transaction, the executive vice president now directly owns 159,764 shares of the company's stock, valued at approximately $64,538,265.44. The disclosure for this sale can be found here. Insiders have sold a total of 1,070,258 shares of company stock worth $30,690,456 in the last quarter. Corporate insiders own 0.03% of the company's stock. A number of large investors have recently bought and sold shares of MSFT. Moneta Group Investment Advisors LLC boosted its holdings in Microsoft by 112,158.6% during the fourth quarter. Moneta Group Investment Advisors LLC now owns 150,187,424 shares of the software giant's stock worth $36,017,948,000 after purchasing an additional 150,053,637 shares during the last quarter. Norges Bank purchased a new position in Microsoft during the fourth quarter worth about $35,920,047,000. International Assets Investment Management LLC purchased a new position in Microsoft during the fourth quarter worth about $9,625,201,000. Aaron Wealth Advisors LLC boosted its holdings in Microsoft by 35,465.9% during the first quarter. Aaron Wealth Advisors LLC now owns 20,611,140 shares of the software giant's stock worth $66,852,000 after purchasing an additional 20,553,188 shares during the last quarter. Finally, Vanguard Group Inc. boosted its holdings in Microsoft by 2.4% during the fourth quarter. Vanguard Group Inc. now owns 664,908,939 shares of the software giant's stock worth $250,032,357,000 after purchasing an additional 15,701,937 shares during the last quarter. 71.13% of the stock is currently owned by institutional investors and hedge funds. Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.Further ReadingFive stocks we like better than MicrosoftHow to invest in blue chip stocks5 Top-Rated Dividend Stocks With Double-Digit UpsideThe How And Why of Investing in Oil StocksShould You Buy Boeing Stock After CEO Resignation Announcement?Stocks with Unusual Volume: How to Find Unusual Volume Stocks in Real TimeThese Are The Most Upgraded Stocks From Q1  Before you consider Microsoft, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list. While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of seven stocks and why their long-term outlooks are very promising. Microsoft's stock price is pulling back following the Q4 results, suggesting a top is in play, but investors should not be so quick to shed their shares. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}