{
    "title": "AlTi Global (NASDAQ:ALTI) Shares Down 5.2%",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-alti-percent-decline-2024-03-19/",
    "text": "AlTi Global, Inc. (NASDAQ:ALTI - Get Free Report) was down 5.2% during trading on Tuesday . The company traded as low as $6.16 and last traded at $6.23. Approximately 59,536 shares were traded during mid-day trading, a decline of 52% from the average daily volume of 123,236 shares. The stock had previously closed at $6.57. Separately, Raymond James upgraded AlTi Global from a \"market perform\" rating to a \"strong-buy\" rating and set a $9.00 price objective for the company in a report on Thursday, January 25th. Get Our Latest Analysis on ALTI The stock has a 50-day moving average price of $6.10 and a two-hundred day moving average price of $6.95. The company has a debt-to-equity ratio of 0.20, a quick ratio of 0.68 and a current ratio of 0.68. The stock has a market capitalization of $749.24 million, a PE ratio of -1.98 and a beta of 0.62. Hedge funds have recently bought and sold shares of the business. Swiss National Bank grew its position in AlTi Global by 15.4% in the 3rd quarter. Swiss National Bank now owns 51,067 shares of the basic materials company's stock valued at $355,000 after acquiring an additional 6,800 shares during the last quarter. American International Group Inc. bought a new position in shares of AlTi Global during the 2nd quarter worth $78,000. Mesirow Financial Investment Management Inc. grew its position in shares of AlTi Global by 78.1% during the 3rd quarter. Mesirow Financial Investment Management Inc. now owns 35,666 shares of the basic materials company's stock worth $248,000 after buying an additional 15,642 shares in the last quarter. Bank of New York Mellon Corp bought a new position in shares of AlTi Global during the 2nd quarter worth $430,000. Finally, Susquehanna International Group LLP bought a new position in shares of AlTi Global during the 1st quarter worth $3,216,000. Institutional investors own 9.02% of the company's stock. AlTi Global, Inc provides wealth and asset management services individuals, families, foundations, and institutions in the United States and internationally. The company offers discretionary investment management, non-discretionary investment advisory, trust, and administration services, as well as family office services comprising wealth transfer planning, multi-generational education planning, wealth and asset strategy, trust and fiduciary, chief financial officers and outsourced family office, philanthropy, and lifestyle and special projects services.See AlsoFive stocks we like better than AlTi GlobalWhat Are Dividends? Buy the Best Dividend StocksGrowing Twice as Fast as Tesla, XPeng is a BuyDividend Tax Calculator4 Stocks Building Long-Term Value for Shareholders 3 Must-Buy Warren Buffett Stocks for Volatile TimesFedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount Before you consider AlTi Global, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and AlTi Global wasn't on the list. While AlTi Global currently has a \"Strong Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}