{
    "title": "Microsoft to shut down 50 cloud services for Russian businesses",
    "date": "3/23/2024",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-shut-down-50-cloud-services-for-russian-businesses/",
    "text": "Google: Spyware vendors behind 50% of zero-days exploited in 2023 Germany warns of 17K vulnerable Microsoft Exchange servers exposed online Free VPN apps on Google Play turned Android phones into proxies Google fixes Chrome zero-days exploited at Pwn2Own 2024 Activision: Enable 2FA to secure accounts recently stolen by malware Red Hat warns of backdoor in XZ tools used by most Linux distros Google Podcasts service shuts down in the US next week Work better with $200 off Microsoft Office for Windows and Mac How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to open a Windows 11 Command Prompt as Administrator How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Microsoft plans to limit access to over fifty cloud products for Russian organizations by the end of March as part of the sanctions requirements against the country issued by EU regulators last December. The suspension was initially scheduled for March 20, 2024, but it was moved to the end of the month to give impacted entities more time to set up alternative solutions. The news of these impending suspensions was first reported by the Softline Group of Companies, one of Russia's largest remaining IT service providers. \"On behalf of Softline Group of Companies, we confirm receipt of official information from Microsoft and Amazon about the suspension of access to cloud products in Russia from March 20, 2024,\" says Softline's machine-translated post. \"In this regard, Softline Group of Companies warns about possible functional limitations in the operation of cloud products and services from Microsoft, Amazon and Google.\" Softline shared the letter from Microsoft on Telegram, which states that the suspensions are due to EU Council Regulation 2023/2873, enacted last December. \"As you may know, the European Union recently imposed new economic sanctions that, effective March 20, 2024, prohibit Microsoft from supplying certain management or design software (including cloud-based solutions) to entities incorporated in Russia. Microsoft has identified that one or more of your subscriptions or bundled services appear to be subject to these prohibitions. Microsoft is committed to compliance with EU trade laws and regulations, as well as all other jurisdictions in which it operates. In compliance with these government mandates, Microsoft must terminate these subscriptions by March 20, 2024, absent future EU guidance that would change this determination or a general or specific authorization from EU regulators. After March 20, 2024, you will not be able to access those Microsoft products or services, or any data stored in them.\" - Microsoft. Reportedly, after conversations with Softline, Microsoft agreed to postpone suspending the services until the end of March. Microsoft's letter did not specify which services would be pulled, but TASS has compiled a list of over 50 products that will be unavailable at the end of March. Some of the most important products that will have their license keys invalidated are: In addition to the above, Microsoft will block access to LinkedIn-related software and the Media Player development kits. It has been clarified that the invalidation of licenses impacts Russian companies and organizations engaging in architecture, design, construction, manufacturing, media, education and entertainment, building information modeling (BIM), computer-aided design (CAD), and computer-aided manufacturing (CAM). However, no plans to restrict access to individuals were announced, so the mentioned products are assumed to remain available to regular users. Though this wasn't an entirely unexpected development given that Ukraine's situation remains unchanged, many Russian entities previously opted to purchase subscriptions to Microsoft products using foreign accounts or other bypasses. Microsoft has not responded to our multiple emails requesting information about the suspensions. The same fate is allegedly planned for Amazon, Google, and Oracle cloud services that fall under the same package of sanctions (2023/2873), with Russian users sharing an email on Telegram that they received from Amazon Web Services.  This recent move is anticipated to further steer Russian consumers and businesses towards embracing locally developed alternatives, replacing Western-made products. This shift aligns with the Russian government's efforts to promote domestic solutions through various strategies. US sanctions crypto exchanges used by Russian darknet market, banks CISA, NSA share best practices for securing cloud services U.S. sanctions Predator spyware operators for spying on Americans Get certified in Microsoft Azure with $61 off this exam prep bundle Russian hackers shift to cloud attacks, US and allies warn Sad it took the corporate greed machines so long to GAF about putins murder attack on Ukraine. Ok, but ppl using those services are from small business to the big boys. I don't think Russia's gov is using any USA-made service... So, it impacts Putin, but also normal ppl. Not a member yet? Register Now Red Hat warns of backdoor in XZ tools used by most Linux distros Cisco warns of password-spraying attacks targeting VPN services AdwCleaner Malwarebytes Anti-Malware Windows Repair (All In One) McAfee Consumer Products Removal tool Everything Desktop Search Terms of Use -  Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2024  Bleeping Computer® LLC  - All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited. "
}