{
    "title": "Microsoft's $100 BILLION \"Stargate\" supercomputer for AI might not happen. \nHere's why",
    "date": "3/29/2024",
    "url": "https://mspoweruser.com/microsofts-100-billion-stargate-supercomputer-for-ai-might-not-happen-heres-why/",
    "text": "Follow us Share this article Improve this guide EU Commissions were looking into Microsoft's financial backing for OAI. 2 min. read Published on March 29, 2024 published on \n\nMarch 29, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Is Microsoft getting greedy again? The Redmond company with OpenAI is apparently ready to spend crazy money on a data center with a supercomputer to train AI, calling it a “Stargate.” The estimated cost of the whole thing? $100 billion. Yes, you’ve read that right. It’s billion with the B. According to this speculation, which was first exclusively reported by The Information on Friday, the supercomputer will have millions of specialized server chips and cost a hundred times more than many big data centers today. Executives over at Redmond see it as the first of several installations planned over the next six years. It’s safe to say that Microsoft has somewhat been at the forefront of the AI war for quite some time. The OpenAI partnership, which cost them billions of dollars, has been quite fruitful, despite plenty of AI models coming out recently from their competitors. Copilot’s experiences with Windows 11 have also been the company’s major selling point for a while now. Google, on the other hand, has Gemini, but even then, Microsoft and OpenAI seem to be moving way too fast with AI-related decisions, a drama months ago which led OAI’s boss Sam Altman to get fired and re-hired in a span of days. But this supercomputer project won’t be without controversies, especially from competition regulators to say the least. Just earlier this year, the European Commission said that it’s investigating Microsoft’s financial backing for OpenAI, which some view has given it an unfair advantage because it gives Microsoft closer, exclusive access to OpenAI’s technology. Although, the $100 billion isn’t specifically directed for OpenAI, but rather for Microsoft’s AI efforts, including a new organization called Microsoft AI led by top AI talents. But still, this may possibly not be favorable for the Redmond tech giant in the eyes of its competitors. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}