{
    "title": "17 Capital Partners LLC Takes $3.85 Million Position in Microsoft Co. \n(NASDAQ:MSFT)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/17-capital-partners-llc-takes-3-85-million-position-in-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 17 Capital Partners LLC acquired a new stake in shares of  Microsoft Co. (NASDAQ:MSFT – Free Report) in the fourth quarter, Holdings Channel.com reports. The firm acquired 10,239 shares of the software giant’s stock, valued at approximately $3,850,000. Microsoft makes up  about  3.5% of 17 Capital Partners LLC’s investment portfolio, making the stock its 2nd largest position. A number of other large investors have also made changes to their positions in MSFT. Joule Financial LLC bought a new stake in  Microsoft in the fourth quarter valued at about $1,592,000.  Avity Investment Management Inc. increased its stake in  Microsoft by 3.9% in the fourth quarter. Avity Investment Management Inc. now owns 121,715 shares of the software giant’s stock valued at $45,770,000 after acquiring an additional 4,604 shares during the period.  Talbot Financial LLC increased its stake in  Microsoft by 2.1% in the fourth quarter. Talbot Financial LLC now owns 204,758 shares of the software giant’s stock valued at $76,997,000 after acquiring an additional 4,164 shares during the period.  OneAscent Wealth Management LLC increased its stake in  Microsoft by 9.5% in the fourth quarter. OneAscent Wealth Management LLC now owns 4,910 shares of the software giant’s stock valued at $1,846,000 after acquiring an additional 424 shares during the period.  Finally, OneAscent Financial Services LLC increased its stake in  Microsoft by 125.8% in the fourth quarter. OneAscent Financial Services LLC now owns 17,841 shares of the software giant’s stock valued at $6,709,000 after acquiring an additional 9,941 shares during the period. Institutional investors and hedge funds own  71.13% of the company’s stock. A number of research firms recently weighed in on MSFT. Argus upped their target price on shares of Microsoft from $390.00 to $430.00 and gave the company a “buy” rating in a research note on Tuesday, December 5th. China Renaissance initiated coverage on shares of Microsoft in a research note on Tuesday, December 5th. They set a “buy” rating and a $466.00 price objective on the stock. Barclays upped their price objective on shares of Microsoft from $421.00 to $475.00 and gave the stock an “overweight” rating in a research note on Wednesday, January 31st. Jefferies Financial Group  reaffirmed a “buy” rating and set a $465.00 price objective on shares of Microsoft in a research note on Wednesday, March 6th. Finally, DA Davidson  reaffirmed a “buy” rating and set a $500.00 price objective on shares of Microsoft in a research note on Friday, March 15th. Four analysts have rated the stock with a hold rating and thirty-six have assigned  a buy rating to the company. Based on data from MarketBeat.com, Microsoft  has a consensus rating of “Moderate Buy” and a consensus target price of $423.34. View Our Latest Analysis on MSFT In other news, insider Bradford L. Smith sold 3,303 shares of the business’s stock in a transaction dated Monday, February 5th. The stock was sold at an average price of $406.12, for a total value of $1,341,414.36. Following the sale, the insider now directly owns 570,826 shares in the company, valued at $231,823,855.12. The sale was disclosed in a filing with the SEC, which is accessible through the SEC website. In other news, insider Bradford L. Smith sold 3,303 shares of the business’s stock in a transaction dated Monday, February 5th. The stock was sold at an average price of $406.12, for a total value of $1,341,414.36. Following the sale, the insider now directly owns 570,826 shares in the company, valued at $231,823,855.12. The sale was disclosed in a filing with the SEC, which is accessible through the SEC website. Also, EVP Kathleen T. Hogan sold 21,955 shares of the business’s stock in a transaction dated Monday, March 11th. The shares were sold at an average price of $403.96, for a total value of $8,868,941.80. Following the completion of the sale, the executive vice president now owns 159,764 shares in the company, valued at $64,538,265.44. The disclosure for this sale can be found here. Insiders have sold a total of 1,070,258 shares of company stock worth $30,690,456 over the last three months. Corporate insiders own  0.03% of the company’s stock. Shares of Microsoft stock opened at $420.72 on Friday. The company has a market capitalization of $3.13 trillion, a P/E ratio of 38.04, a price-to-earnings-growth ratio of 2.24 and a beta of 0.89. The company has a debt-to-equity ratio of 0.19, a current ratio of 1.22 and a quick ratio of 1.20. The business has a 50-day moving average of $410.82 and a two-hundred day moving average of $374.31. Microsoft Co. has a 1 year low of $275.37 and a 1 year high of $430.82. Microsoft (NASDAQ:MSFT – Get Free Report) last announced its earnings results on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, topping the consensus estimate of $2.76 by $0.17. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. The firm had revenue of $62.02 billion for the quarter, compared to the consensus estimate of $61.14 billion. During the same period last year, the company posted $2.32 EPS. The business’s quarterly revenue was up 17.6% on a year-over-year basis.  As a group, equities analysts predict that  Microsoft Co. will post 11.63 EPS for the current year. The company also recently declared a quarterly dividend, which will be paid on Thursday, June 13th. Shareholders of record on Thursday, May 16th will be paid a $0.75 dividend. This represents a $3.00 annualized dividend and a dividend yield of 0.71%. The ex-dividend date is Wednesday, May 15th. Microsoft’s dividend payout ratio  is 27.12%. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. OneAscent Wealth Management LLC Has $2.87 Million Stock Position in Apple Inc. (NASDAQ:AAPL) Apple Inc. (NASDAQ:AAPL) Shares Sold by Grandview Asset Management LLC "
}