{
    "title": "Is Microsoft a Top Artificial Intelligence (AI) Investment?",
    "date": "3/2/2024",
    "url": "https://www.fool.com/investing/2024/03/02/is-microsoft-a-top-artificial-intelligence-ai-inve/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Microsoft (MSFT -0.17%) has quietly had a tremendous run as a stock, up about 65% in the last year. Part of this rise is the frenzy of artificial intelligence (AI) investing, as Microsoft positioned itself at the forefront of this exciting trend. While Microsoft may not be as exposed as other companies like Nvidia, it still plays a huge role in the rollout of AI to the average worker. But does this position make Microsoft a top AI investment right now? Most people know Microsoft's products as they use them daily in their jobs. However, Microsoft aims to make these workers more efficient by integrating AI. Microsoft partnered with OpenAI to integrate ChatGPT into many products. Microsoft Copilot is available for businesses as a $30 monthly add-on to Microsoft 365. While that may seem like a lot, it's a bargain. If Copilot can make 100 employees 1% more efficient, it could replace one worker. The annual cost for Copilot for these 100 workers would be $36,000. Considering that the average salary in the U.S. in 2024 is just over $53,000 per year, according to the U.S. Bureau of Labor Statistics, this would be a significant cost savings. That's also a low-ball estimate, as its Copilot product can make employees more than 1% more efficient. Additionally, Microsoft is highly exposed to the AI trend through its cloud computing product, Azure. Cloud computing is crucial in the proliferation of AI, allowing clients to rent out computing power. Most businesses don't require a supercomputer on hand to train AI models. Instead, they can offload some of that work to Microsoft's servers, which they can use by paying a rental fee. Azure has been a powerhouse segment for Microsoft as it rose 30% in the fiscal second quarter of 2024 (ended Dec. 31). While Microsoft doesn't give individual segment results, its intelligent cloud division (which Azure is a part of) delivered $25.9 billion in revenue in the quarter, making it Microsoft's largest division. Clearly, AI is having a big impact on Microsoft's business right now, and it has done well in positioning itself to take advantage of the move. But is it a good investment? Microsoft undeniably checks the box as an excellent AI company. Its track record and product rollout speak for itself. However, this has caused Microsoft stock to earn a hefty premium compared to other stocks on the market. It's a very expensive stock with a price-to-earnings (P/E) ratio of 37 and a forward P/E of 35.  MSFT PE Ratio data by YCharts For reference, AI powerhouse Nvidia trades at a lower forward P/E of 32. This illustrates how high the expectations are for Microsoft and raises some concerns about whether it will be able to hit expectations. From a historical perspective, Microsoft's stock hasn't been this expensive (outside of a few years when its earnings were skewed) since the early 2000s, when Microsoft was caught up in the dot-com crash.  MSFT PE Ratio data by YCharts I'm not saying Microsoft is due for a crash, but the stock is extremely pricey. So, is Microsoft a good AI investment? I'd say no. The bar is set incredibly high to begin with, which will make it difficult for Microsoft stock to rise significantly. Plus, with Microsoft already making up 7% of the S&P 500, I'm highly exposed to the stock through my 401(k) investments. Microsoft is a great AI company, but its high price tag doesn't make it a great AI investment, at least for right now. Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Microsoft and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}