{
    "title": null,
    "date": "3/4/2024",
    "url": "https://www.chicagotribune.com/2024/03/04/microsoft-ignite-conference-chicago-mccormick-place/",
    "text": "eNewspaper Sign up for email newsletters  Sign up for email newsletters eNewspaper Trending: Nearly a decade after holding its first Microsoft Ignite event in Chicago — and then abruptly pulling up stakes for other cities — the software giant is bringing its annual information technology conference back to McCormick Place in November. Microsoft’s return engagement, announced Monday, is expected to bring thousands of IT professionals to McCormick Place and $44 million in economic impact to the city during the five-day event, a late-season windfall for Chicago’s tech and tourism industries. “Microsoft’s choice to host Ignite 2024 in Chicago reaffirms this city’s standing as a hub for innovation, technological advancement, and major corporate events,” Mayor Brandon Johnson said in a news release. Launched in May 2015, the inaugural Ignite conference drew 20,000 attendees to McCormick Place, generating nearly 90,000 hotel room nights and high hopes for a recurring annual event. But five months later, Microsoft announced it was canceling its scheduled 2016 Chicago return, moving Ignite to Atlanta and pushing it back to the fall. At the time, it was a significant blow for Chicago, with a Microsoft corporate partner notifying more than 50 participating hotels to cancel reservations. Officials estimated the loss of the 2016 Ignite conference cost the city $56 million in economic impact. For nine years, Microsoft Ignite took place far from its Chicago origins. After one year in Atlanta, Ignite was held in Orlando for three years, then it canceled a planned move to New Orleans in 2020 when the pandemic hit, going exclusively digital until 2021. For the past two years, Microsoft has hosted the in-person conference in its home city of Seattle. The return of Microsoft Ignite to Chicago is scheduled for Nov. 18 to 22, with the event centered on the burgeoning applications of artificial intelligence. “This year’s focus is to empower our customers and partners through AI transformation,” Takeshi Numoto, Microsoft’s chief marketing officer, said in the release. Microsoft did not respond to an additional request for comment Monday on its decision to return to Chicago or its future plans for the conference. The late-season addition of Microsoft Ignite bolsters the continued recovery of Chicago’s tourism industry, which was hard-hit by event cancellations during the pandemic. In 2019, McCormick Place held 129 convention center events generating $1.94 billion in economic impact, according to Cynthia McCafferty, a McCormick Place spokesperson. When the pandemic hit in March 2020, the convention center shut down and was briefly converted to an alternate medical care facility to handle overflow COVID-19 patients. The convention business began returning in 2022, with 103 events generating $1.65 billion in economic impact, McCafferty said. In 2023, McCormick Place held 115 events generating $1.81 billion in economic impact, she said. This year, there are 92 scheduled convention center events, including Microsoft Ignite, which are projected to create $2.21 billion in economic impact, McCafferty said. The Metropolitan Pier and Exposition Authority is a municipal corporation that owns McCormick Place, the Hyatt Regency, the Marriott Marquis Chicago, Wintrust Arena and Navy Pier, which it leases to a not-for-profit corporation for $1 per year. The economic engine of Chicago’s tourism industry, the McCormick Square convention and hotel complex generated a net operating income of $856,000 in fiscal year 2019, but bled red ink during the pandemic, losing nearly $73 million in 2021 and $5.8 million in 2022. The McCormick Place campus returned to profitability in 2023, generating $7.9 million in net operating income for the fiscal year ending June 30, according to MPEA. In addition to Microsoft Ignite and other McCormick Place events, Chicago is gearing up to host the Democratic National Convention Aug. 19-22 at the United Center. The convention is projected to bring 50,000 visitors, 20,000 members of the media and 5,500 delegates to the city, according to the Chicago DNC 2024 host committee. rchannick@chicagotribune.com Copyright © 2024 Chicago Tribune "
}