{
    "title": "Microsoft Corp. stock outperforms competitors despite losses on the day",
    "date": "3/28/2024",
    "url": "https://www.marketwatch.com/data-news/microsoft-corp-stock-outperforms-competitors-despite-losses-on-the-day-b6a75ff8-8a102fd4622d",
    "text": "Shares of Microsoft Corp. \n        MSFT,\n        -0.17%\n       sank 0.17% to $420.72 Thursday, on what proved to be an all-around positive trading session for the stock market, with the S&P 500 Index \n        SPX,\n        +0.11%\n       rising 0.11% to 5,254.35 and the Dow Jones Industrial Average \n        DJIA,\n        +0.12%\n       rising 0.12% to 39,807.37. This was the stock's fifth consecutive day of losses. Microsoft Corp. closed $10.10 below its 52-week high ($430.82), which the company achieved on March 21st. The stock demonstrated a mixed performance when compared to some of its competitors Thursday, as Apple Inc. \n        AAPL,\n        -1.06%\n       fell 1.06% to $171.48, Alphabet Inc. Cl C \n        GOOG,\n        +0.21%\n       rose 0.21% to $152.26, and Alphabet Inc. Cl A \n        GOOGL,\n        +0.04%\n       rose 0.04% to $150.93. Trading volume (21.7 M) remained 1.1 million below its 50-day average volume of 22.8 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. Readers weigh in on Medicare/Medigap vs. Medicare Advantage, the investment case for Trump Media & Technology Group, and why Apple is not a monopoly Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}