{
    "title": null,
    "date": "3/14/2024",
    "url": "https://www.pinkvilla.com/trending/world/microsoft-co-founder-bill-gates-shares-throwback-pic-holding-a-cd-rom-highlighting-technologys-evolution-1286433",
    "text": "Happy ASTRO’s Cha Eun Woo Day: True Beauty, Island and more, top 5 webtoon-based K-dramas of face genius Best-dressed celebs of the week: From Alia Bhatt to Ananya Panday, five celebs who set style bar high Did Invincible Recast Ezra Miller's D.A. Sinclair In Season 2 Amid Actor's Controversies? Here's What We Know Arjun Reddy reunion: Vijay Deverakonda and ‘his favorite boys’ Sandeep Reddy Vanga, Gowtam Tinnanuri pose for PIC Neha Kakkar and Rohanpreet Singh steal hearts with debut duet on Superstar Singer 3 grand premiere Did Kartik Aaryan's big-budget film with Vishal Bhardwaj and Sajid Nadiadwala get TITLE? Here's what we know Boston Celtics Injury Report: Will Jayson Tatum Play Against New Orleans Pelicans Tonight? Deets Inside Ram Charan jets off for summer vacation in Thailand with wife Upasana Konidela and daughter; WATCH Is Nayak 2 in works? Anil Kapoor's meeting with S Shankar at former's house hints at highly-anticipated sequel Did Invincible Recast Ezra Miller's D.A. Sinclair In Season 2 Amid Actor's Controversies? Here's What We Know Arjun Reddy reunion: Vijay Deverakonda and ‘his favorite boys’ Sandeep Reddy Vanga, Gowtam Tinnanuri pose for PIC Did Kartik Aaryan's big-budget film with Vishal Bhardwaj and Sajid Nadiadwala get TITLE? Here's what we know Ram Charan jets off for summer vacation in Thailand with wife Upasana Konidela and daughter; WATCH Is Nayak 2 in works? Anil Kapoor's meeting with S Shankar at former's house hints at highly-anticipated sequel Kartik Aaryan teaches FC Bayern’s Harry Kane ‘Chandu nahi Champion hai mai’ dialogue; video goes viral Should Frieren: Beyond Journey's End Have Season 2? Here's What We Think What Is The Beatles Classic Blackbird About? Meaning Explored Amid Beyonce's Cowboy Carter Cover EXCLUSIVE: Nitesh Tiwari gears up to take Ramayana on floors on April 2 in Mumbai; Ranbir Kapoor to join soon Leo-Aries to Libra-Gemini: 4 Zodiac Besties Who Illuminate Each Other's Paths Through Friendship Aries to Gemini: 4 Zodiac Signs Who Unapologetically March to the Beat of Their Own Drum Virgo to Pisces: 4 Zodiac Signs Who Evaluate And Learn from Past Fights in Relationships 101+ Hopeless Romantic Quotes That Will Melt Your Heart Gemini to Aries: 4 Zodiac Signs Who Are Unbiased And Receptive to New Ideas Leo-Aries to Virgo-Taurus: 4 Zodiac Couples Who Love Giving Back to the Community as a Family Virgo to Leo: 4 Zodiac Signs Who Understand Their Emotions And Triggers Exceptionally Well Types of Parenting Styles And How They Shape a Child’s Well-being 12 Unmistakable Signs of a Narcissistic Wife That Are Hard to Miss Boston Celtics Injury Report: Will Jayson Tatum Play Against New Orleans Pelicans Tonight? Deets Inside ‘He Should Have Drafted Me’: Luka Doncic Takes Playful Dig At Kings Ex-Gm Vlade Divac Following Dallas’ Win Shaquille O'Neal Makes Bold Claim on feud with Dwight Howard; Details Inside Victor Wembanyama Matches Another Shaquille O'Neal's Feat in Epic Rookie Season Latest Update on Drew McIntyre’s WWE Contract After WrestleMania 40 REVEALED; Find Out Who Is Olivier Rioux? All We Need To Know About Tallest Teenager in the World Who Will Play for Florida Gators ‘He’s Top 5 of All-Time If....’: Paul Pierce Makes Bold Statement on Steph Curry; Find Out the Details Watch: LeBron James’s Heartwarming Moment With Former Heat Teammate And His Family Ahead of Lakers vs Pacers Here's What Draymond Green Allegedly Said Which Led To His Ejection Against Magic; Read On Happy ASTRO’s Cha Eun Woo Day: True Beauty, Island and more, top 5 webtoon-based K-dramas of face genius INFINITE’s Sungjong parts ways with SPK Entertainment following legal battle; pens letter to fans Han So Hee, Ryu Jun Yeol officially break up 2 weeks after relationship announcement; latter’s agency confirms Kim Young Dae, Park Ju Hyun, Kim Myung Soo, more shine in first look of new webtoon-based drama Perfect Family BTS’ J-Hope’s HOPE ON THE STREET Ep 2 Review: Idol masters popping with Gucchon; special cameo by Jungkook leaves us surprised HOPE ON THE STREET Vol. 1 Review: BTS' J-Hope continues to cement all-rounder tag with personal album THROWBACK: When Super Junior humorously predicted Ryewook's marriage during green-room game BTS' RM goes 'Namjooning' for first military vacation; backs J-Hope's HOPE ON THE STREET Vol. 1 feat Jungkook 'All the songs are done': GOT7's BamBam CONFIRMS group comeback after Jay B and Jinyoung's military discharge 10 Best Bride After-party Dresses to Help You Steal the Spotlight 10 Best Eyelid Lifting Serums And Creams I Have Tried And Reviewed 11 Best Hair Scissors – Tested And Recommended By Our Experts 11 Best Toners for Hyperpigmentation — Tested And Approved by Experts 10 Best Hypoallergenic Shampoos to Gently Cleanse Sensitive Scalps 13 Best Tinted Moisturizers for Hydration And Adequate Coverage 9 Best Hugo Boss Colognes for Men to Master Masculinity 10 Best Face Washes for Hyperpigmentation - Expert’s Reviews 11 Best Eyeshadow Palettes for Brown Eyes — Tested And Reviewed Best-dressed celebs of the week: From Alia Bhatt to Ananya Panday, five celebs who set style bar high Malaika Arora looks hot in an all-white ensemble at son Arhaan Khan's bash Mira Rajput repeats her backless Alice and Olivia halter jumpsuit for dinner with friends Priyanka Chopra is kicking off weekend in style in her white bralette and skirt from Devon Windsor Sonam Kapoor wears white floral embroidered jacket from her, Anand Ahuja’s brand Bhaane to amp up basic off-duty look Alia Bhatt, Katrina Kaif, Karisma Kapoor and others: Save these 5 celebrity-approved kurta sets for Ramadan 2024 Shraddha Kapoor vs Sara Ali Khan fashion face-off: Who wore the flashy silver fit with cargo pants better? Top 13 gorgeous backless blouse designs inspired by Bollywood divas for summer 2024; Deepika Padukone, Kiara Advani, and more Alia Bhatt serves fashion finesse in 2 incomparable looks at London’s Hope Gala; a vintage resham saree and timeless velvet gown Yoga for Constipation: 10 Poses to Relieve Gas And Get Things Moving Exercises And Yoga for Tinnitus, Alternative Therapies, And More Miranda Lambert's Weight Loss Journey: Diet And Workout Tips Revealed Jordyn Woods Weight Loss Transformation Story — Secrets Revealed How to Do Cobbler’s Pose (Baddha Konasana) to Open Up Your Hips Seated Yoga Poses to Stretch And Rejuvenate: Types And Benefits Kundalini Meditation: Balancing Mind, Body, And Spirit Emily Simpson’s Weight Loss Journey: How the RHOC Star Shed 40 Lbs Garland Pose (Malasana): The Hip-opener You Need in Your Yoga Routine How to Apply Foundation Easily: Steps And Tips for Smooth Application Benefits of Body Lotion: Tips to Use, Side Effects, And More How to Deep Condition Your Hair: A Complete Guide to Getting Smooth Locks How to Use Rosemary Oil for Hair Growth: Benefits, DIY Remedies, And Precautions How Long Does Sunburn Last? Understanding Duration, Symptoms, And Treatment How Do Silicone Scar Sheets Work: Efficacy, Uses, And Benefits How to Make Your Eyelashes Grow Naturally: A Comprehensive Guide How to Fix a Broken Nail: Causes, Tips, And Preventive Measures How to Stop Sweating on the Face: Everything You Need to Know Horoscope Today, March 30, 2024 Pisces Horoscope Today, March 30, 2024 Aquarius Horoscope Today, March 30, 2024 Capricorn Horoscope Today, March 30, 2024 Sagittarius Horoscope Today, March 30, 2024 Scorpio Horoscope Today, March 30, 2024 Libra Horoscope Today, March 30, 2024 Virgo Horoscope Today, March 30, 2024 Leo Horoscope Today, March 30, 2024 Microsoft co-founder Bill Gates posted a nostalgic photo of him holding CD-ROM, depicting the evolution of technology. Bill Gates shared a picture on Instagram that made a lot of people feel nostalgic. In the photo, the tech genius can be seen holding a brand new storage device called Compact Disc-Read Only Memory (CD-ROM), which was taken almost three decades ago. He is seen seated on a tall stack of paper in the 1994 photo, with another stack positioned directly next to it. A young Gates can be seen smiling at the camera while holding a CD-ROM. He wrote the caption, \"Thirty years ago, we wanted to show just how much information a single CD-ROM could hold. The team decided a visual demonstration was necessary!\"   The Microsoft website also has details about the currently viral image. They state, \"Bill Gates wanted to show to the public in 1994 just how much data could fit on a CD-ROM. Rather than employing the then-unfamiliar 700-megabyte unit, he released an image of himself perched in the branches of trees above enormous piles of paper hundreds of feet tall—roughly equivalent to the number of pages on a CD. Bill's picture helped people understand an unusual number by placing it in context.\"\nRelated StoriestrendingGypsy Rose Blanchard splits from husband shortly after prison release; says THIStrendingPrivacy experts express concerns over Amazon's palm payment service sign-up app; Know WHY The picture is definitely impactful and visually impressive. It demonstrated the vast amount of data that could be stored on a single disk, saving tons of paper. This photo will forever symbolize the technological advancements made by humans, even though disks are now considered outdated compared to newer storage options. ALSO READ: What is Spotify's new feature? Music app now to allow users to play full-screen music video A content writer with a Bachelor's Degree in Mass Media and two years of experience in Content Writing. \n...\nA content writer with a Bachelor's Degree in Mass Media and two years of experience in Content Writing. Apart from being a dancer, Marita is a movie buff and can watch South films all day. Here to give you all the updates on what is trending with fact checks. Currently working as a Trending Content Writer at PINKVILLA. A content writer with a Bachelor's Degree in Mass Media and two years of experience in Content Writing. A content writer with a Bachelor's Degree in Mass Media and two years of experience in Content Writing. Apart from being a dancer, Marita is a movie buff and can watch South films all day. Here to give you all the updates on what is trending with fact checks. Currently working as a Trending Content Writer at PINKVILLA. By providing this information, you agree that we may process your personal data in accordance with our Privacy Statement "
}