{
    "title": "FTC investigates AI oligopolies; calls on Microsoft, Alphabet, Amazon to \ndisclose investments in startups",
    "date": "1/26/2024",
    "url": "https://www.itworldcanada.com/article/ftc-investigates-ai-oligopolies-calls-on-microsoft-alphabet-amazon-to-disclose-investments-in-startups/557447",
    "text": "Videos PodcastsBlogsSlideshows Yesterday, following a half day summit hosted by the U.S. Federal Trade Commission (FTC) that convened experts to examine the key players and the litany of consumer protection issues arising from the mushrooming AI market, the agency announced that it is investigating tech goliaths’ investments in artificial intelligence startups. Microsoft, Amazon, Alphabet, Anthropic, and OpenAI will be the subjects of the inquiry, and will be required to provide information regarding recent investments and partnerships involving generative AI companies and major cloud service providers. They will have 45 days to respond to the agency. Since the start of the generative AI buzz last year, Amazon and Google have injected a total of US$6 billion in Anthropic, while Microsoft pledged over US$10 billion to OpenAI. “History shows that new technologies can create new markets and healthy competition. As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity, ” said FTC Chair Lina M. Khan. During yesterday’s summit, industry experts discussed how the AI tech stack – from the semiconductor level to the cloud to the data – is incredibly concentrated. Nvidia is making all the AI chips, it’s selling to the hyperscalers, who end up announcing their own chips, making it difficult for new entrants to come into the market, explained Daven Rauchwerk, a technologist who founded a semiconductor startup. Hyperscalers making their own chips, he added, grants them a form of innovation surveillance, whereby they can look into the memory inside of the chip itself and see what their customers are doing, and figure what needs to be made before it is made. “Now has never been a better time to be in the semiconductor business. We’re going to have more fabrication capacity in the next five years than we’ve ever had. And there’s enormous demand. And yet the dynamics of the market make it extremely challenging to get off the ground.” Rauchwerk argued that innovation is happening in real-time at the lowest layers of the stack, but we do not get to see it because of the concentration of the dominant players. “It’s to the point where the hyperscaler becomes the customer for the chip startup, and you talk to the chip companies, they say, ‘we can sell to one hyperscaler, one data center is millions of units, and it’ll make our whole business.’” Plus, AI chips are extremely expensive and supply-constrained, and how they get doled out by vendors like Nvidia “has always been something out of a black box” and effectively makes Nvidia the new kingmaker in the entire space, explained Corey Quinn, the chief cloud economist at The Duckbill Group, a company that helps companies manage their Amazon Web Services (AWS) bills. Hyperscalers also do a lot of bundling and packaging across the board that allows them to net the most chips, he stated. For instance, Nvidia would give Amazon more chips in exchange for a preferred placement on amazon.com for the company’s other retail lines. “There’s no transparency, and it’s this cross-cutting across so many different units of business that lets them tie things together in strange ways, that we just don’t know what’s happening,” said Quinn. Even the hyperscalers, he added, are in a centralized, co-dependent system. You can decide, for instance, to build an ecommerce store on Azure so that you do not have to deal with AWS. But if you use financial services like Stripe, which is the strategic payments partner of AWS, then no one can buy from your shop if AWS is down. Even the U.S. government, he noted, runs a staggering percentage of its compute on the Big Three hyperscalers. “I’m not suggesting that there’s undue influence of ‘stop investigating us or your computers are going to stop working’”, Quinn said. “I don’t think anyone is getting to that point. But there is a sense of how much can really be done when you are critically dependent upon the continued existence and well being of these companies.” Further, Tania Van den Brande, director of economics at the U.K.’s communications regulator, Ofcom, detailed how the hyperscalers make it difficult for customers to move their data out of their clouds, through things like egress fees. Additionally, they face difficulties re-engineering apps to move them from one cloud to another, or connecting apps hosted on different clouds. Quinn affirmed that it’s obvious we have a monopoly, or if not, the next thing to it, because the cloud companies talk in the language of monopolists, touching on ideas of survival and the risk of being out-innovated by a startup in a garage. That, he says, is implausible unless you give that startup, for instance, $6 billion of funding for all their AI training runs, plus the massive hiring binges and the specialized hardware. “We face basic questions of power and governance,” said Khan. “Will this be a moment of opening up markets to fair and free competition, unleashing the full potential of emerging technologies, or will a handful of dominant firms concentrate control over these key tools, walking us into a future of their choosing?” Our experienced team of journalists and bloggers bring you engaging in-depth interviews, videos and content targeted to IT professionals and line-of-business executives. © IT World Canada. All Rights Reserved. "
}