{
    "title": "Microsoft Doubles Down on AI With Copilot Expansion and $1.5B Vodafone \nPartnership",
    "date": "1/16/2024",
    "url": "https://www.investopedia.com/microsoft-doubles-down-on-ai-with-copilot-expansion-and-vodafone-partnership-8426674",
    "text": " Ethan Miller / Getty Images Microsoft (MSFT) shares rose in early trading Tuesday after the company announced an expansion of its Copilot features and a $1.5 billion partnership with Vodafone (VOD) as part of the tech giant's artificial intelligence (AI) push. The enhancements for Microsoft's AI assistant, Copilot, include Copilot Pro, Copilot for Microsoft 365 for small businesses, and a Copilot mobile app. Microsoft and Vodafone, a telecommunications company offering Internet of Things (IoT) and cloud services, also announced a $1.5 billion 10-year partnership focused on generative AI (GenAI). \"Vodafone will invest $1.5 billion over the next 10 years in cloud and customer-focused AI services developed in conjunction with Microsoft,\" the companies said in a release. Through the partnership, Vodafone will utilize OpenAI technology through Microsoft Azure. The companies added that Microsoft intends to invest in Vodafone’s managed IoT connectivity platform, which will become a separate, standalone business by April 2024. With AI tools and applications through Copilot and Azure, as well as its ongoing partnership with ChatGPT maker OpenAI, Microsoft has established itself as a leader in the AI race early on, with Wedbush analysts calling Microsoft \"essentially the torch bearer of the global AI Revolution.\" CFRA analyst Angelo Zino noted that the firm's \"highest conviction call from a fundamental basis among the 'Magnificent Seven' names remains MSFT, given the resilience of its business model and growth opportunities tied to artificial intelligence (AI) initiatives.\" Microsoft shares were up 0.5% at $390.38 per share as of about noon ET Tuesday following the news, and have gained over 62% over the past year. Microsoft. \"Bringing the full power of Copilot to more people and businesses.\" Vodafone. \"Vodafone and Microsoft sign 10-year strategic partnership to bring generative AI, digital services and the cloud to more than 300 million businesses and consumers.\" Wedbush. “Microsoft Holding Shareholder Meeting that Caps a Trophy Case Year.” CFRA. \"MSFT Dec-Q Preview – AI, Cloud, and Gaming to Drive Upside Ahead.\" "
}