{
    "title": "Microsoft's new Copilot key marks first big change to Windows keyboard in \n30 years",
    "date": "1/4/2024",
    "url": "https://www.thenationalnews.com/business/technology/2024/01/04/microsofts-new-copilot-key-marks-first-big-change-to-windows-keyboard-in-30-years/",
    "text": "Microsoft said it aims to make 2024 'the year of the AI PC'. AP Microsoft said it aims to make 2024 'the year of the AI PC'. AP Technology company Microsoft has announced the addition of a new Copilot key on the Windows keyboard in a move aimed at supporting the adoption of artificial intelligence in its hardware products. The key, which will be available in laptops and personal computers manufactured by Microsoft and its partners, will grant users immediate access to the AI-driven Windows Copilot experience, the company said on Thursday. The new key will activate the integrated Windows Copilot within Windows 11, presenting a ChatGPT-like chatbot capable of responding to inquiries and carrying out actions. It will be placed next to the alt key on most keyboards, but the placement could vary depending on the manufacturers and different markets. The move is one of the biggest modifications to the Windows PC keyboard configuration in almost 30 years. It will empower people to “participate in the AI transformation more easily”, Microsoft said. The company aims to make 2024 “the year of the AI PC” commencing with a latest alteration. “Nearly 30 years ago, we introduced the Windows key to the PC keyboard that enabled people all over the world to interact with Windows,” said Yusuf Mehdi, executive vice president and consumer chief marketing officer at Microsoft. “We see this as another transformative moment in our journey with Windows where Copilot will be the entry point into the world of AI on the PC … AI will be seamlessly woven into Windows from the system, to the silicon, to the hardware.” Following the announcement, Microsoft's shares surged 0.48 per cent to trade at $372.38 a share at 8.10pm UAE time on Thursday, giving it a market value of $2.77 trillion. Designed by Microsoft, Windows is an operating system that comes pre-loaded on most new PCs and laptops. It was the dominant desktop OS worldwide as of July 2023, with a market share of around 70 per cent, according to Statista. Apple’s Mac OS has also gained market share over the years, growing to command around a fifth of the market. Copilot's early version was released on September 26 as part of a free update for Windows 11. It is powered by generative AI, which rose to prominence thanks to the emergence of ChatGPT from OpenAI, which is backed by Microsoft, in late 2022. Consumers will soon start to see the Copilot key on many of the new Windows 11 PCs from Microsoft's ecosystem partners, with availability beginning in late February. However, the exact timing of the Copilot feature delivery and availability will vary by market and device. Users will require a Microsoft account to log in. When Copilot for Windows is not available or enabled on the device, pressing the Copilot key will launch Windows Search. Yes and no. If users have a Microsoft account, they will have access to certain basic features. But if they want more, they will need to pay a fee, which varies in different markets. Future Beat Your round-up of the stories shaping tomorrow’s world "
}