{
    "title": "PRESSR: Du to strengthen cybersecurity standards in telecom industry \nsupported by Microsoft",
    "date": "2/29/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024-02-29:newsml_Zaw4c8qcD:0-pressr-du-to-strengthen-cybersecurity-standards-in-telecom-industry-supported-by-microsoft/",
    "text": "First published: 29-Feb-2024 13:53:42 Dubai, UAE: du, from Emirates Integrated Telecommunications Company (EITC), today announced a collaboration with Microsoft to integrate cutting-edge unified security products, managed services, and threat intelligence. This collaboration aims to revolutionize cybersecurity practices within the telecom sector, ensuring the highest level of protection for du's network and customer data. The adoption of Microsoft's unified security solutions, including Microsoft Defender XDR, represents a significant leap forward in du's efforts to combat cyber threats. These advanced products will establish a comprehensive security framework, encompassing various layers of defense and safeguarding the integrity and resilience of du's network infrastructure. Yaaqoub Al Zarooni  at Head of Information Security & IOC management at du said: \"We are excited to join forces with Microsoft in our quest for excellence in cybersecurity. This strategic collaboration underscores our commitment to customer trust and service reliability. By integrating Microsoft's innovative security products and availing their managed services and threat intelligence, we are reinforcing our position as a leading telecom provider with the highest level of security standards.\" In addition to the technology integration, du will benefit from Microsoft's managed services, which offer expert oversight and continuous monitoring of security systems. This dedicated support will enable proactive detection and response to potential threats, ensuring swift mitigation and minimizing any potential impact on du's operations. Furthermore, Microsoft's threat intelligence capabilities will provide du with actionable insights into emerging cyber threats. This knowledge will empower du to implement proactive defense measures, staying ahead of malicious actors and ensuring the utmost protection for its customers' sensitive information. Yazan Al Khasawneh, Cybersecurity Director , Microsoft UAE, said: \"We are pleased to collaborate with du and bring our advanced unified security solutions, managed services, and threat intelligence to enhance their cybersecurity posture. By using Microsoft's expertise, du is well-equipped to navigate the evolving threat landscape and fortify their network against potential cyber risks, setting new benchmarks for security in the telecom industry.\" As a global technology leader, Microsoft offers a comprehensive suite of software, services, and solutions. The company's commitment to security, privacy, and compliance aligns with du's mission to offer a secure and dependable telecommunications experience to its customers. About du Operating under the steadfast umbrella of Emirates Integrated Telecommunications Company (EITC), du is an integral driver of the UAE’s economic, social, and digital transformation. Thriving on digitally innovating all facets of the contemporary telecom experience, we touch the lives of millions of customers everyday as a dedicated enabler of connectivity, continuity and growth across consumer and enterprise segments. Whether delivering state-of-the-art Smart City infrastructure, bespoke enterprise ICT solutions, government communications, secure data solutions, or the very best in home entertainment and value, we are a reliable telco and ICT player shaping the future of communication for a more connected tomorrow. http://du.ae © Press Release 2024 Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release. The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk. To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}