{
    "title": "Microsoft's partnership with Mistral raises lobbying concerns in the EU",
    "date": "2/28/2024",
    "url": "https://mspoweruser.com/microsofts-partnership-with-mistral-raises-lobbying-concerns-in-the-eu/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on February 28, 2024 published on \n\nFebruary 28, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft has partnered with French AI startup Mistral, sparking concerns about potential conflicts of interest and the influence of big tech companies on European Union regulations. The partnership involves a $16 million investment from Microsoft and will see Mistral’s AI models offered on Microsoft’s Azure cloud platform. This move mirrors a similar partnership Microsoft has with OpenAI. However, the deal has raised eyebrows among some EU lawmakers, who question whether France lobbied for looser AI regulations to benefit Mistral and Microsoft. The French government has denied any prior knowledge of the partnership. Lobbying means attempting to influence the decisions or policies of government officials or bodies. The lobbying concerns While Mistral’s CEO emphasizes the company’s commitment to independence and is excited about the partnership’s growth potential, the incident highlights the ongoing debate surrounding tech companies, governments, and the development of responsible AI regulations. Why does this matter? More here. More about the topics: Mistral Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}