{
    "title": "Microsoft Stock Is Soaring, But I'd Buy This Canadian Tech Stock Instead",
    "date": "2/7/2024",
    "url": "https://www.fool.ca/2024/02/07/microsoft-stock-is-soaring-but-id-buy-this-canadian-tech-stock-instead/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Microsoft (NASDAQ:MSFT) stock has been growing higher and could reach US$450 per share! But there’s another tech stock offering more value. Image source: Getty Images. Microsoft (NASDAQ:MSFT) continues to trade on a tear, though shares dipped slightly this week as the world’s largest company hit 52-week highs. Yet, according to analysts, there should be even more room to run. That might be true, but the stock continues to be incredibly expensive and volatile. So, let’s look at why you might want to buy or avoid this stock and perhaps another tech stock to consider. The biggest bullish bet for Microsoft stock comes from the company’s ability to continue its incredible revenue growth. Yet analysts believe that growth should continue, especially after company comments on its cloud business. Microsoft stock reported its capital expenditure forecast for the future, with spending to “increase materially on a sequential basis.” This comes after more investments into both cloud and artificial intelligence (AI) infrastructure. What this points to is the company is likely to see a large increase in cloud revenue in the future. Furthermore, even though Microsoft stock continues to be the one to beat for AI, there is reason to believe it could scale out at an incredible level. Yet after hitting those 52-week highs, shares of Microsoft stock are down, trading at about US$404 as of writing. This could mean a huge opportunity for shareholders in the future, with the consensus target price now at US$451, as of writing. Analysts have been increasing the guidance on the heels of even more product innovation and learning from their clients to drive even more innovation in the future. And AI should continue to be a large part of this process. AI alone contributed to a six-point increase in cloud growth in the latest quarter. This means AI is becoming the core product for Microsoft stock. Yet if you want in on AI, there are other companies working with Microsoft stock on this AI future, including a Canadian tech stock you’ll want to consider. One company investors will want to consider is OpenText (TSX:OTEX), a company that also deals in cloud data and AI. During its recent earnings report, the company achieved record revenue results yet saw shares drop as it narrowed its earnings before interest, taxes, depreciation, and amortization. However, in an interview with the Motley Fool, Chief Financial Officer Mandhu Ranganathan stated that this is to help the company invest more in AI. And a recent divestment of part of its Micro Focus acquisition will certainly help with that. In fact, the company announced last year it will be rolling out seven new AI vectors. Each will help a different part of the company’s productivity and optimization. And given that the company is a partner with Microsoft stock, if OpenText stock does well, so too will Microsoft stock, and vice versa. AI is the future, and there are many companies around the world getting into it. But if you want the best of the best for revenue growth and more cloud usage, then I would consider Microsoft stock and OpenText stock. However, if you’re only going to choose one, OpenText stock offers far more value than Microsoft stock at this point. Despite dropping in share price, that’s likely to turn around as the company grows cloud bookings and integrates more AI. And with more cash coming their way, buybacks have also been noted as part of the future. So, certainly consider this stock if you’re also looking at Microsoft stock today. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 15, 2024 | Joey Frenette Shopify (TSX:SHOP) stock has been pulling back of late, opening up a window for dip buyers. Read more » March 15, 2024 | Amy Legate-Wolfe These growth stocks have already proven their worth this year, but are solid investments for long-term holders as well. Read more » March 15, 2024 | Amy Legate-Wolfe Nvidia (NASDAQ:NVDA) stock has surged in share price, but so has this stock, with a far lower share price to… Read more » March 15, 2024 | Brian Paradza, CFA Unveiling the Code: Should you Buy, Hold, or Sell Constellation Software (TSX:CSU) stock at current levels? Read more » March 15, 2024 | Nicholas Dobroruka Growth investors should have these two tech stocks high up on their watch lists. Read more » March 14, 2024 | Karen Thomas, MSc, CFA Well Health stock has been hit, but the company remains on a path of record-breaking revenues as it approaches positive… Read more » March 14, 2024 | Amy Legate-Wolfe CSU stock (TSX:CSU) may be the priciest stock on the TSX today, but there is a very good reason for… Read more » March 13, 2024 | Amy Legate-Wolfe CSU stock (TSX:CSU) has surged in the last year, yet even if growth slows by half, you could create immense… Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}