{
    "title": "You'll soon be able to mute/unmute yourself with AirPods on Microsoft Teams \nfor Mac",
    "date": "2/19/2024",
    "url": "https://mspoweruser.com/youll-soon-be-able-to-mute-unmute-yourself-with-airpods-on-microsoft-teams-for-mac/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on February 19, 2024 published on \n\nFebruary 19, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Do you use AirPods and Macs? If so, we may have a piece of good news for you: you will soon be able to mute/unmute your microphone when using Microsoft Teams for Mac. AirPods users on iPhones have enjoyed this convenient mic mute/unmute control since iOS 17 on models older than iPhone XS/XR. While this capability took a while to arrive on Macs, Microsoft recently announced on its 365 roadmap site it will be available in March 2024 for users with macOS Sonoma, which is primarily available on iMac models released in 2019 or later and MacBook Air/Pro models released in 2018 or later. Before this, you would need to manually mute/unmute yourself on Microsoft Teams. Once this update rolls out, you can just tap on your AirPods’ Touch control on the stem, just like how you play or pause songs. And then, to resume playback, simply press it again. In fact, there have been a few interesting crossovers between Microsoft and Apple products recently. Just this month, Apple launched a new app called Apple Devices for Windows PCs, in a move towards splitting the popular iTunes app for Windows into three different apps depending on functionality. You can do things like backing up your iPhone data to your computer or even transferring photos from PC to iPhone with this new app. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}