{
    "title": "Microsoft confirms Windows 11 24H2 update is coming later this year",
    "date": "2/9/2024",
    "url": "https://www.techspot.com/news/101829-microsoft-confirms-windows-11-24h2-update-coming-later.html",
    "text": "What just happened? Microsoft has announced that the Windows 11 24H2 update will be released later this year. While the exact launch date remains a mystery, it promises to be a major update, with a number of AI features and other quality of life improvements. The official confirmation comes just days after the \"Windows 11 24H2\" moniker was spotted in official support documents. The announcement is part of the Windows 11 Insider Preview build 26052 release notes, which were published earlier this week. According to the post, builds 26xxx will henceforth be denoted as Windows 11 version 24H2 in the Settings app and winver. The company also confirmed that Windows 11 will have an annual feature update cadence that will release in the second half of the calendar year. The latest development seems to scotch rumors that Microsoft will skip major Windows 11 updates in the future and go straight to Windows 12 instead. The speculations suggested that the next major version of Windows, to be released in late 2024, will be based on a new platform called Germanium and marketed as Windows 12. However, Microsoft has now put those rumors to rest by confirming that it still intends to support Windows 11 with major feature updates, at least for one more year.  Not much is known about Windows 11 24H2, but rumors suggest that it will include a ton of AI features in keeping with the latest trend in tech. According to Windows Latest, the biggest new feature will be an AI-powered Windows Shell with an \"advanced Copilot.\" The feature will reportedly work in the background to \"enhance search, jumpstart projects or workflows, understand context, and much more.\" However, before 24H2 is released, Microsoft is slated to roll out the Moment 5 update later this month. While it's not expected to bring any groundbreaking new changes, reports suggest that it will introduce minor functional improvements, such as the ability to hide the newsfeed that some users find annoying. Other changes will include accessibility and sharing improvements, new features for Windows 365 integration, a character count for Notepad, a new section in the Microsoft Store, etc. In addition, people in the European Union will also be able to uninstall Microsoft Edge with just a few clicks as part of the company's plans to comply with the EU's Digital Markets Act (DMA). TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}