{
    "title": "When You Look Back in 5 Years, You'll Wish You'd Bought This \nTrillion-Dollar Artificial Intelligence (AI) Stock",
    "date": "2/2/2024",
    "url": "https://www.fool.com/investing/2024/02/02/when-look-5-years-bought-trillion-dollar-ai-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The stock market just entered another quarterly earnings season, with the majority of companies set to report their financial results for the period ended Dec. 31, 2023. The technology sector is under the microscope because it's on the front lines of the artificial intelligence (AI) revolution, which is gearing up to be an incredible source of value in the coming years. Microsoft (MSFT -0.17%) is one of the most important AI companies to watch. It invested $10 billion in ChatGPT developer OpenAI last year, and it has integrated the start-up's technology into its entire product portfolio. In fact, Microsoft is one of very few companies successfully monetizing AI software at scale right now. The company's results for the fiscal 2024 second quarter (ended Dec. 31) are now in the books, and growth in its AI-related segments is skyrocketing. When investors look back on this moment five years from now, they might wish they'd bought Microsoft stock. Here's why. Image source: Getty Images. For the past year, most investors have focused on Microsoft's business-to-business cloud computing platform Azure, where the company is deploying AI-as-a-service to tens of thousands of customers. That segment is still critical, and I'll discuss it in more detail shortly, but first, let's explore Copilot because it gained a heap of momentum in Q2. Microsoft Copilot is a virtual assistant powered by large language models (LLM) and generative AI, which is capable of creating text, images, videos, and even computer code. It was developed independently of ChatGPT, but Copilot does borrow some of OpenAI's technology. It's embedded for free in the Windows operating system, Edge internet browser, and Bing internet search engine. Copilot is also available in Office 365 applications like Word, PowerPoint, and Excel. Businesses can access it for $30 per user, per month, and Microsoft's research found it accelerated tasks like writing, searching, and summarizing by 29%. Microsoft has more than 400 million paid 365 seats (users), and all of them are candidates for the Copilot upgrade, so this is a substantial financial opportunity. Then there is Copilot for the Microsoft Power Platform, which allows businesses to build everything from websites to software applications without writing code. No-code technology can effectively turn any employee into a developer, and in Q2, over 230,000 businesses were using Power, which was a whopping 80% increase from just three months prior. But it gets better. The new Copilot Studio platform allows businesses to customize Copilot for their own needs. It means they don't have to use the out-of-the-box version of Copilot for 365, for example, which empowers them to unlock an even greater productivity boost. Over 10,000 organizations are using Copilot Studio in Q2, with prices starting at $200 per month. As Copilot becomes more widely adopted, the Studio platform will eventually be an essential tool for every organization. Microsoft generated a record-high $62 billion in revenue during Q2, which was an 18% increase year over year. The company breaks its results into three core segments, but Intelligent Cloud led the way (as is normally the case), with revenue growing by 20.3% to $25.8 billion. But the real story within Intelligent Cloud was Azure. Its revenue grew by an impressive 30%, with 6 percentage points of that growth coming specifically from AI. That's double the contribution AI made in the prior quarter just three months earlier. Microsoft delivers OpenAI's latest industry-leading GPT-4 models to its business customers through Azure, which they can use to develop their own AI applications. The company said it had over 53,000 Azure AI customers in Q2, and one-third of them weren't Azure users at all 12 months ago. In other words, AI specifically has attracted around 17,700 new business customers to Azure in the past year. Microsoft also said more than half of the Fortune 500 companies are now Azure AI customers, including beverage giant Cola-Cola, which has deployed generative AI in a few different ways of late. Azure deal sizes are also growing, with an increase in billion-dollar contracts in Q2. Microsoft says telecommunications provider Vodafone will invest $1.5 billion in cloud and AI services over the next 10 years. Microsoft told investors that generative AI is driving a 70% increase in productivity for some work tasks, and if that trend continues, there could be thousands of businesses like Vodafone around the world that deploy billions of dollars into the technology. Microsoft delivered $2.93 in earnings per share (profit) during Q2. Not only was that a 33% increase year over year, but it was also comfortably above Wall Street's expectations of $2.78. The company has now generated $11.06 in trailing-12-month earnings, which places its stock at a price-to-earnings (P/E) ratio of 36.8. That is expensive relative to the rest of the market. The Nasdaq-100 technology index, for example, trades at a P/E ratio of 31.4. But here's why Microsoft has earned that premium. First, Azure is the world's second-largest cloud platform behind Amazon Web Services (AWS). However, AWS only grew its revenue by 12% in its last quarter, whereas Azure grew by 29% during the equivalent period -- and now 30% in the more recent Q2. In other words, it's rapidly taking market share, and much of that is due to AI. Beyond Azure, Microsoft likely has more scale with which to monetize AI software than any other company. Given the substantial installed base of Office 365 applications, the transition to AI-enabled versions will be extremely simple. Microsoft doesn't even have to acquire new customers to generate significant financial growth; it simply has to upsell its existing users. Even if Microsoft grows its earnings per share by a relatively modest compound annual rate of 10% for the next five years -- and assuming its P/E ratio remains constant -- that could translate into 61% upside in its stock price. But considering Microsoft's earnings soared by 30% in the first six months of fiscal 2024, that 10% growth rate might prove to be a very conservative baseline. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}