{
    "title": "Microsoft says its 1900 layoffs \"cannot be attributed fully to the merger\" \nbecause Activision was already planning ...",
    "date": "2/8/2024",
    "url": "https://www.gamesradar.com/microsoft-says-its-1900-layoffs-cannot-be-attributed-fully-to-the-merger-because-activision-was-already-planning-massive-cuts-of-its-own/",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. If Microsoft didn't lay off those people, it says Activision would've instead Today, the US Federal Trade Commission criticized Microsoft for its plans to lay off 1,900 employees in the wake of its Activision Blizzard acquisition. Now, Microsoft has issued a response, saying that these layoffs \"cannot be attributed fully to the merger,\" especially because Activision Blizzard already planned on eliminating a lot of jobs before the deal went through. Basically, the FTC has argued that since Microsoft is eliminating redundant positions between itself and the incoming Activision Blizzard, it's no longer going to be in a position to divest itself of the new business if regulators decide that's necessary. Importantly, Microsoft said in court that it was going to make sure Activision Blizzard would be able to operate independently in the \"unlikely event\" it'd be necessary to split the company out again. Now, Microsoft has issued a response, saying that \"the FTC’s factual assertions are incomplete and misleading. Consistent with broader trends in the gaming industry, Activision was already planning on eliminating a significant number of jobs while still operating as an independent company. The recent announcement thus cannot be attributed fully to the merger.\" Additionally, Microsoft says it \"continues fully to stand behind its representations to this court.\" The company says that \"while some overlap was identified and some jobs were eliminated, Microsoft has structured and is operating the post-merger company in a way that will readily enable it to divest any or all of the Activision businesses as robust market participants in the unlikely event that a divestiture ultimately is ordered. This is precisely what Microsoft represented previously.\" In other words, Microsoft is arguing that Activision Blizzard will still be able to operate independently even with all these layoffs, contrary to the FTC's fears. More importantly, it seems like the messy fight between the company and federal regulators isn't quite over yet. If you need a recap of everything, here's the whole Xbox Activision deal explained. Weekly digests, tales from the communities you love, and more Dustin Bailey joined the GamesRadar team as a Staff Writer in May 2022, and is currently based in Missouri. He's been covering games (with occasional dalliances in the worlds of anime and pro wrestling) since 2015, first as a freelancer, then as a news writer at PCGamesN for nearly five years. His love for games was sparked somewhere between Metal Gear Solid 2 and Knights of the Old Republic, and these days you can usually find him splitting his entertainment time between retro gaming, the latest big action-adventure title, or a long haul in American Truck Simulator. Helldivers 2's war on Automatons is going way too well, and new signs point to a major twist from Game Master Joel coming soon Starfield and Baldur's Gate 3 actors say their games are \"easily\" better-written than many TV shows and films they've worked on 32 must-see samurai movies for Ghost of Tsushima fans By Lauren Milici29 March 2024 By Austin Wood29 March 2024 By Kaan Serin29 March 2024 By Ali Jones29 March 2024 By Iain Harris29 March 2024 By Kaan Serin29 March 2024 By Catherine Lewis29 March 2024 By Catherine Lewis29 March 2024 By Kaan Serin29 March 2024 By Ali Jones29 March 2024 By Dustin Bailey29 March 2024 GamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. "
}