{
    "title": "Microsoft turns to NVIDIA's competitor Intel to strike AI chip deal",
    "date": "2/23/2024",
    "url": "https://interestingengineering.com/innovation/microsoft-intel-ai-chip",
    "text": "Microsoft’s in-house chip will be Intel-approved. By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time. Intel, one of the biggest manufacturers of semiconductor computer circuits, has secured Microsoft as a client for its custom chip manufacturing division. As Intel’s CEO Pat Gelsinger introduced Intel Foundry, a sustainable systems foundry business tailored for the artificial intelligence (AI) era, Satya Nadella revealed that Microsoft has a chip design intended for production that will use the Intel 18A process. “We are in the midst of a very exciting platform shift that will fundamentally transform productivity for every individual organization and the entire industry,” Nadella said. “To achieve this vision, we need a reliable supply of the most advanced, high-performance, and high-quality semiconductors. “That’s why we are so excited to work with Intel Foundry, and why we have chosen a chip design that we plan to produce on Intel 18A process,” added the Microsoft CEO. While the specific product remains undisclosed, Microsoft has previously unveiled plans for two proprietary chips: a central processing unit (CPU) for computers and an artificial intelligence (AI) accelerator. Intel also insinuated that it anticipates surpassing its internal deadline of 2025 to outpace its primary competitor, Taiwan Semiconductor Manufacturing Company (TSMC), in advanced chip manufacturing. This comes amid the current economic environment and global political tensions, such as trade disputes between the US and China, Russia’s conflict with Ukraine, tensions in Israel, and growing tensions between mainland China and Taiwan. Intel revealed this information at an event in San Jose, California, during the first technology conference for Intel Foundry. And how do they plan on reclaiming the title of making the fastest chips from TSMC? The first would be the Intel 18A manufacturing technology and the second plan of action would be to maintain their lead through 2026 with Intel 14A technology. “AI is profoundly transforming the world and how we think about technology and the silicon that powers it,” said Gelsinger. “This is creating an unprecedented opportunity for the world’s most innovative chip designers and for Intel Foundry, the world’s first systems foundry for the AI era. Together, we can create new markets and revolutionize how the world uses technology to improve people’s lives.” Intel also announced that its Foundry has secured design wins for various process generations, like Intel 18A, Intel 16, and Intel 3. Overall, Intel Foundry’s expected deal value exceeds $15 billion. “We are offering a world-class foundry, delivered from a resilient, more sustainable and secure source of supply, and complemented by unparalleled systems of chips capabilities,” said Stuart Pann, senior vice president of Intel Foundry. “Bringing these strengths together gives customers everything they need to engineer and deliver solutions for the most demanding applications.” Intel is also banking on the US government’s subsidies and external customer contracts to revive its operations, reported Reuters. Leveraging its global factory presence, it aims to attract customers wary of TSMC’s Taiwan-centric facilities. Despite signing four major clients for its 18A technology, including potential ties with Microsoft, their identities remain undisclosed. "
}