{
    "title": "Now a Microsoft partner, Mistral AI challenges OpenAI with three new LLMs",
    "date": "2/26/2024",
    "url": "https://siliconangle.com/2024/02/26/now-microsoft-partner-mistral-ai-challenges-openai-three-new-llms/",
    "text": "UPDATED 16:39 EST / FEBRUARY 26 2024 by \nMaria Deutscher Mistral AI, the well-funded artificial intelligence startup, today introduced three large language models and a chatbot service designed to rival OpenAI’s ChatGPT. The company also detailed a new partnership with Microsoft Corp., OpenAI’s top investor. The alliance will give Mistral’s engineers access to supercomputing infrastructure in Azure. Additionally, Microsoft is making the startup’s models available to customers of its cloud platform. Although it was downplayed, Microsoft is also investing €15 million ($16.3 million) into the company, which will convert to equity in the startup’s next funding round. The possible reason it was downplayed is that the European Commission will look into the deal, relatively small as it is. Paris-based Mistral launched last May and closed a $113 million seed round four weeks later. In December, it raised another $415 million from a consortium led by Andreessen Horowitz and Lightspeed Venture Partners. Until today, the company’s product portfolio comprised two open-source language models with 7 billion and 46.7 billion parameters, respectively. Mistral is expanding its LLM lineup with three proprietary models headlined by Mistral Large. It can generate text in English, French, Spanish, German and Italian, as well as craft software code and solve math problems. A user prompt may contain up to 32,000 tokens, units of data that each comprise a few letters or numbers. The company claims the model is the second most advanced of its kind on the market behind GPT-4. In a test involving four LLM reasoning benchmarks, Mistral Large trailed OpenAI’s flagship model by less than 10%. In a separate evaluation, it significantly outperformed Llama 2 70B, an open-source GPT-4 alternative released by Meta Platforms Inc. last year. Developers can access Mistral Large through an application programming interface. The API provides the ability to create custom moderation policies for the model, as well as connect it to external applications. Software teams can, for example, have Mistral Large use information from an external database to answer user questions. The API can optionally package the model’s output into JSON files. JSON is a data format that makes it easier to move data between applications. As a result, it can reduce the amount of work involved in making an AI system’s output available to a company’s custom applications. Mistral Large is rolling out alongside a second new LLM dubbed Mistral Small. The latter model has less advanced reasoning capabilities, but offers lower pricing and latency. Despite the scaled-backed feature set, it still promises to outperform Mistral’s previous flagship LLM across several types of reasoning tasks. The company will enable customers to access its latest AI models in multiple ways. In addition to providing the LLMs via an API, Mistral intends to make them available as part of a new ChatGPT-like service called Le Chat. The latter service will also provide access to a third, prototype model dubbed Mistral Next that the company says is “designed to be brief and concise.” In conjunction, Mistral is making its flagship LLMs available through Azure as part of the new partnership it announced with Microsoft today. On launch, the cloud platform offers access to Mistral Large. The AI developer’s other proprietary models and its earlier open-source LLMs are set to follow suit down the road. The partnership, which is described as a multiyear alliance, also has other components. Mistral is gaining access to supercomputing infrastructure in Azure that it will use to train new models and run inference workloads. Furthermore, the company will team up with Microsoft to explore the possibility of developing customized versions of its LLMs optimized for specific use cases. THANK YOU Blockchain-focused cryptography startup Zama raises $73M to protect data in use Bipartisan bill could see TikTok banned in US if it doesn’t split with China OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions Taalas raises $50M to develop chips optimized for specific AI models Claroty secures $100M to enhance cyber-physical system security Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research Blockchain-focused cryptography startup Zama raises $73M to protect data in use SECURITY - BY MIKE WHEATLEY . 3 HOURS AGO Bipartisan bill could see TikTok banned in US if it doesn’t split with China POLICY - BY JAMES FARRELL . 6 HOURS AGO OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions AI - BY MIKE WHEATLEY . 8 HOURS AGO Taalas raises $50M to develop chips optimized for specific AI models AI - BY MARIA DEUTSCHER . 9 HOURS AGO Claroty secures $100M to enhance cyber-physical system security SECURITY - BY DUNCAN RILEY . 9 HOURS AGO Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research AI - BY MARIA DEUTSCHER . 10 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}