{
    "title": "Nadella Has Made Microsoft World's Most Valuable Firm",
    "date": "2/5/2024",
    "url": "https://www.newser.com/story/345971/microsoft-ceo-hits-10-year-milestone.html",
    "text": "Microsoft CEO Satya Nadella hit the 10-year milestone at the company Sunday, just weeks after the company hit a huge milestone of its own, overtaking Apple as the world's most valuable company with a market capitalization of more than $3 trillion. Nadella, who took the reins from Steve Ballmer in 2014, is the third CEO in Microsoft's 49-year history, after Ballmer and Bill Gates.   He \"changed the narrative\" at Microsoft. Nadella has been \"widely praised across the tech industry for changing the narrative at Microsoft,\" per CNBC. The company's stock, which fell 30% during Ballmer's 14 years as CEO, rose more than 1,000%, from below $40 to more than $400, under Nadella as he turned the firm into a leader in areas including artificial intelligence and cloud computing. \"The biggest transformation of a tech company.\" \"Nadella's had the biggest transformation of a tech company potentially ever,\" Wedbush Securities analyst Daniel Ives tells the AP. \"The only one that would rival it was (Steve) Jobs coming back to Apple and turning it around with the iPhone.\" Nadella pushed hard to build up the Azure cloud computing platform, and pulled back from his predecessor's efforts to make Microsoft a leader in smartphones, which included the $7.3 billion acquisition of Nokia.  A talent for dealmaking. Axios reports that Nadella is known for his dealmaking, with major acquisitions over the last decade including Minecraft creator Mojang, LinkedIn, and, most recently, Activision Blizzard. He has also invested more than $10 billion in OpenAI.  He's probably not going anywhere soon. Nadella, known for his down-to-earth, collaborative style, has been with Microsoft since 1992. Despite looming challenges including greater antitrust scrutiny, analysts expect him to remain at the helm for years to come. \"From everything I can gather, he's really enjoying himself,\" Barclays analyst Raimo Lenschow tells the AP. \"We're in very, very, very interesting times. I would expect him to stay for a while.\"   (More Microsoft stories.) "
}