{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.financialexpress.com/life/technology-this-is-messed-up-elon-musk-takes-down-microsoft-over-new-windows-pc-bkg-3406885/",
    "text": "The Financial Express X CEO Elon Musk has raised new concerns with his new post on Microsoft. Musk recently took to the social media platform to share his issues about the new Windows laptop PC he purchased, reaching out directly to Microsoft CEO Satya Nadella via text message. Musk expressed discomfort with the mandatory requirement of a Microsoft account on Windows PCs, questioning its necessity for basic functionalities and raising concerns about potential access to Microsoft’s AI. Just bought a new PC laptop and it won’t let me use it unless I create a Microsoft account, which also means giving their AI access to my computer! This is messed up.There used to be an option to skip signing into or creating a Microsoft account. Are you seeing this too? In his X post, Musk suggested that the mandatory use of Microsoft services for basic computer functionality gives Microsoft the ability to effectively shut off a user’s computer. This sparked discussions on social media, with some users supporting Musk’s concerns regarding data privacy and potential AI influence. However, others pointed out that creating a Microsoft account is a standard practice for Windows PCs, offering various features such as cloud storage, app downloads, and system updates. Numerous individuals provided alternate solutions to Musk in response to his post, including suggestions from X’s ‘fact-check’ feature Community Notes, which indicated that setting up the latest version of Windows without a Microsoft account is still possible. Musk countered this by asserting that the fact-checking tool was incorrect, stating, “Community Notes is failing here. This option no longer exists.” After a series of tweets, Musk eventually revealed that he successfully accessed his Windows laptop PC without creating a Microsoft account. He shared a workaround suggested by a user on X, explaining that he was able to skip the account creation step by deselecting the automatic connection to a local WiFi without a password. Musk expressed gratitude for the solution, highlighting the importance of user feedback and collaborative problem-solving. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}