{
    "title": "Shilanski & Associates Inc. Reduces Stock Holdings in Microsoft Co. \n(NASDAQ:MSFT)",
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/shilanski-associates-inc-reduces-stock-holdings-in-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Shilanski & Associates Inc. decreased its position in  Microsoft Co. (NASDAQ:MSFT – Free Report) by 2.8% during the 4th quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The fund owned 15,277 shares of the software giant’s stock after selling 438 shares during the period. Microsoft comprises approximately  2.2% of Shilanski & Associates Inc.’s portfolio, making the stock its 12th biggest holding. Shilanski & Associates Inc.’s holdings in Microsoft were worth $5,745,000 at the end of the most recent reporting period. Other institutional investors have also bought and sold shares of the company. Monumental Financial Group Inc. bought a new stake in  Microsoft during the 1st quarter valued at $28,000.  Atlantic Private Wealth LLC raised its holdings in  Microsoft by 534.5% during the 2nd quarter. Atlantic Private Wealth LLC now owns 184 shares of the software giant’s stock valued at $63,000 after acquiring an additional 155 shares during the period.  Hibernia Wealth Partners LLC bought a new stake in  Microsoft during the 3rd quarter valued at $69,000.  Iron Horse Wealth Management LLC increased its holdings in shares of  Microsoft by 89.0% in the third quarter. Iron Horse Wealth Management LLC now owns 223 shares of the software giant’s stock worth $70,000 after purchasing an additional 105 shares during the period.  Finally, MayTech Global Investments LLC bought a new position in shares of  Microsoft in the fourth quarter worth $83,000. Hedge funds and other institutional investors own  69.20% of the company’s stock. Several research analysts have recently weighed in on the stock. KeyCorp assumed coverage on shares of Microsoft in a report on Thursday. They issued an “overweight” rating and a $490.00 price target on the stock. China Renaissance assumed coverage on shares of Microsoft in a report on Tuesday, December 5th. They issued a “buy” rating and a $466.00 price target on the stock. Piper Sandler  restated an “overweight” rating and set a $455.00 price target on shares of Microsoft in a research report on Thursday, January 25th. Tigress Financial raised their price target on Microsoft from $433.00 to $475.00 and gave the company a “buy” rating in a research report on Wednesday, November 29th. Finally, Mizuho raised their price target on Microsoft from $420.00 to $450.00 and gave the company a “buy” rating in a research report on Friday, December 15th. Four analysts have rated the stock with a hold rating and thirty-six have issued  a buy rating to the stock. Based on data from MarketBeat.com, the stock currently has an average rating of “Moderate Buy” and a consensus target price of $417.37. Check Out Our Latest Stock Analysis on Microsoft Shares of NASDAQ MSFT opened at $428.74 on Friday. Microsoft Co. has a twelve month low of $272.05 and a twelve month high of $430.82. The firm has a market cap of $3.19 trillion, a P/E ratio of 38.76, a PEG ratio of 2.28 and a beta of 0.89. The company has a 50 day moving average of $408.33 and a 200 day moving average of $371.83. The company has a quick ratio of 1.20, a current ratio of 1.22 and a debt-to-equity ratio of 0.19. Microsoft (NASDAQ:MSFT – Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 earnings per share for the quarter, topping analysts’ consensus estimates of $2.76 by $0.17. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. The company had revenue of $62.02 billion during the quarter, compared to analyst estimates of $61.14 billion. During the same period in the previous year, the business earned $2.32 EPS. The firm’s revenue for the quarter was up 17.6% on a year-over-year basis.  As a group, research analysts expect that  Microsoft Co. will post 11.63 EPS for the current fiscal year. The company also recently disclosed a quarterly dividend, which will be paid on Thursday, June 13th. Investors of record on Thursday, May 16th will be issued a $0.75 dividend. The ex-dividend date is Wednesday, May 15th. This represents a $3.00 dividend on an annualized basis and a yield of 0.70%. Microsoft’s payout ratio is currently 27.12%. In related news, EVP Kathleen T. Hogan sold 21,955 shares of the business’s stock in a transaction that occurred on Monday, March 11th. The shares were sold at an average price of $403.96, for a total value of $8,868,941.80. Following the completion of the transaction, the executive vice president now directly owns 159,764 shares in the company, valued at approximately $64,538,265.44. The sale was disclosed in a document filed with the SEC, which is available through this hyperlink. In other Microsoft news, EVP Kathleen T. Hogan sold 21,955 shares of Microsoft stock in a transaction that occurred on Monday, March 11th. The shares were sold at an average price of $403.96, for a total value of $8,868,941.80. Following the completion of the sale, the executive vice president now owns 159,764 shares of the company’s stock, valued at approximately $64,538,265.44. The transaction was disclosed in a legal filing with the SEC, which is available at the SEC website. Also, major shareholder Corp Microsoft sold 1,000,000 shares of Microsoft stock in a transaction that occurred on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the sale, the insider now directly owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The disclosure for this sale can be found here. Insiders sold a total of 1,070,258 shares of company stock worth $30,690,456 in the last three months. Insiders own  0.03% of the company’s stock. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Creative Financial Designs Inc. ADV Makes New $35,000 Investment in Commerce Bancshares, Inc. (NASDAQ:CBSH) Brookstone Capital Management Makes New Investment in FT Vest U.S. Equity Buffer ETF  October (BATS:FOCT) "
}