{
    "title": "Microsoft Deal With Oracle Provides Clues To Its AI Investments 03/15/2024",
    "date": "3/15/2024",
    "url": "https://www.mediapost.com/publications/article/394406/microsoft-deal-with-oracle-provides-clues-to-its-a.html",
    "text": "Username Password Remember me Forgot your password? Subscribe today to gain access to every Research Intelligencer article we publish as well as the exclusive daily newsletter, full access to The MediaPost Cases, first-look research and daily insights from Joe Mandese, Editor in Chief. If you're already a paid subscriber, please sign-in. Username Password  \n                                      Forgot?  Log in if you are already a member Username Password  \n                                      Forgot? Microsoft is making investments in infrastructure to dominate the\nworld of artificial intelligence (AI) and cloud services, and to increase its presence in advertising. Larry Ellison, Oracle founder, spoke following the release of the company's fiscal Q3\nearnings earlier this week, and said Oracle is preparing to put its cloud infrastructure in three additional Microsoft data centers. Oracle has been a provider of database services, but has\nshifted to provide cloud infrastructure. Ellison said last\nyear that Oracle Cloud Infrastructure (OCI) was being installed in 20 Microsoft data centers. On Monday's call, he told analysts that number could increase. That number of servers\nwould not be cheap. advertisement advertisement The companies have been working closely for several months, with Microsoft renting GPUs from Oracle to run artificial intelligence (AI) in Microsoft’s Bing search\nengine, according to one report. On Thursday, the companies revealed the expanded availability\nof the Oracle Database@Azure service that enable users to access Oracle services running on OCI in Azure data centers. The partnership adds five additional regions, including a first German\nregion in Frankfurt. It marks the debut of Oracle Database@Azure in Europe, and the second region after Microsoft Azure East US general availability in December 2023. Microsoft\ncontinues to make many changes as it begins to integrate AI across its product lines. During Microsoft’s monthly product meeting a company executive ran through several updates. For\nexample, advertisers in 32 markets can now buy Display ads directly in the Microsoft Advertising Platform to reach specific customers across more platforms with ads. While not\nmentioned during the update, Hana Kobzová posted on X that Microsoft Advertising is testing a different online\ninterface. “It is modern, sleek & fast and very similar to Google Ads,\" she wrote in a blog post. “Microsoft's AI chat assistant Copilot features its own icon in the top\nhorizontal menu, which, when clicked, opens a chat window on the right side,” she wrote. “Additionally, it's integrated into the search bar, and interacting with it also opens the chat\nwindow on the right.” Microsoft also recently announced that Copilot for Security will become generally available worldwide on April 1. The platform uses generative AI to help\nsecurity and IT professionals catch what others miss, move faster, and strengthen team expertise. Copilot is informed by more than 78 trillion security signals processed by Microsoft\ndaily. advertisement "
}