{
    "title": "Microsoft Alum Launches Hey, Black Seattle!: A Hub of Connection for the \nAfrican Diaspora in the Emerald City",
    "date": "3/5/2024",
    "url": "https://finance.yahoo.com/news/microsoft-alum-launches-hey-black-140400636.html",
    "text": "SEATTLE, March 5, 2024 /PRNewswire/ -- Today entrepreneur and former Microsoft director Kiesha Garrison proudly introduces Hey, Black Seattle!, a platform to help Seattle residents of the African diaspora answer the question \"Where are all the Black people?\" This community-centered initiative aims to connect, support, and celebrate the vibrant yet dispersed Black population in the region by using data and technology for good. Pushing Back on a Stifling Narrative Despite the often-cited small percentage of Black residents in the Greater Seattle area (6.7% in the city of Seattle, 8% in the central Puget Sound as of July 2022 census), the region is home to a rich tapestry of Black community organizations, Black-owned businesses, and artists actively working to preserve Black culture and address the isolation experienced by many Black residents.  Some, like the Langston Hughes Performing Arts Institute and the Black Heritage Society of Washington State have been mainstays for decades, while others like the Africatown Community Land Trust and Arte Noir were formed more recently to push back against gentrification and massive displacement in the historic Central District neighborhood.  All are an example of the creative resilience of a people who refuse to be erased by systemic inequality. Founder Kiesha Garrison emphasizes, \"When people repeat the popular hyperbole 'there are no Black people in Seattle,' they do so out of genuine frustration, but it is clear they are missing out on the important work of the deeply committed Black leaders here.\" Hey, Black Seattle! seeks to close the awareness gap so that disconnected individuals can come to know the facilitators of Black culture & community that are doing this powerful work in the region. Founder's Data-Tech Background Meets Her Love of Community Garrison, a Spelman alumna who held various business leadership positions in consumer products and enterprise AI at Microsoft, also worked at Vitals, a popular physician finder website. She was also a founding board member for The Live Music Project, a Seattle-based nonprofit which supports access to the arts through the development of community-driven technology products. She drew inspiration from Microsoft Employee Resource Group leaders who provided Black community resource lists to their employee population as well as from her conversations with local non-profit leaders who have long desired to have a digital community hub but lacked the bandwidth and expertise to build it. Leveraging her background with data-driven tech and her passion for the wellbeing of all Black people, Garrison set out to create a central space for the community to share and find information that transcends professional and social silos. A Simple Yet Necessary Mission The mission of Hey, Black Seattle! is simple yet profound: to shorten the time it takes for Black people to find their community in the beautiful Puget Sound region. Garrison, also a public speaker who focuses on how oppression affects personhood and culture, shares, \"Community is essential because I believe isolation is a dream killer.  And I want Black people and our dreams to thrive wherever we live.\" At the center of the web service is a comprehensive database of entities serving the Black community across King, Pierce, Kitsap, and Snohomish counties. Hey, Black Seattle! pre-seeded their database with over two hundred vetted community organizations, social groups, businesses, and artists, creating a rich directory that will grow through collective knowledge and aspires to give hope to those who might otherwise relocate for a sense of belonging and wellness. A Comprehensive Platform Beyond the community resource directory, Hey, Black Seattle! also offers: An events calendar, providing a focused space for the community to post and discover events which can often seem buried in traditional search sites. A job board, offering organizations a direct channel to list employment opportunities and support of economic empowerment for the Black community. A photo archive to contribute to the preservation of the historical record of Black life in the region. Regular meetups to introduce newcomers to neighborhoods and educate them about the rich Black history of Seattle. And space for residents to share \"Black Love Notes,\" acknowledging the importance of appreciation in any culture. Hey, Black Seattle! is more than a platform, it is a movement. A call to action for Black residents of the Greater Seattle area to come together and contribute to a vibrant, inclusive community where everyone can thrive. Connect with Hey, Black Seattle!: Website: www.heyblackseattle.com Instagram: @HeyBlackSeattle For media inquiries, contact: media@heyblackseattle.com About Hey, Black Seattle! Hey, Black Seattle! is a community-driven platform dedicated to connecting and celebrating the African diaspora in the Seattle region. Through its rich database, media, events, and merchandise, Hey, Black Seattle! strives to be a beacon for Black life, highlighting resources and spaces for the community to connect and thrive. Contacts:Kiesha Garrisonmedia@heyblackseattle.com View original content to download multimedia:https://www.prnewswire.com/news-releases/microsoft-alum-launches-hey-black-seattle-a-hub-of-connection-for-the-african-diaspora-in-the-emerald-city-302080008.html SOURCE Hey, Black Seattle! "
}