{
    "title": null,
    "date": "3/4/2024",
    "url": "https://www.aap.com.au/factcheck/microsoft-myth-traced-back-to-fake-news-website/",
    "text": "Microsoft says it will disable computers of people who spread misinformation online. False. No such announcement has been made by the company. A prominent misinformation website claims Microsoft has announced plans to disable the computers of people who spread misinformation online. This is false. The website’s article provides no evidence the tech giant has said anything of the sort. Microsoft also told AAP FactCheck the claim is false. The claim was made in a February 3 article published on a disinformation site called The People’s Voice. The website is operated by Sean Adl-Tabatabai, a former MTV producer turned serial misinformation spreader who regularly churns out deceptive clickbait stories. The article was headlined: “Microsoft To Disable Computers of Users Who Share ‘Non-Mainstream Content’ Online”. “Microsoft has announced plans to disable the computers of people who share ‘non-mainstream’ content online, in an attempt to combat so-called ‘misinformation’ in the run-up to the 2024 election,” the first sentence reads. However, the rest of the article refers to an NBC News interview with Microsoft CEO Satya Nadella in January 2024. It makes no further mention of computers being shut down. Neither the article nor the links within it include any evidence to back up the claim Microsoft had made an announcement about disabling computers. Despite lacking any evidence for its central claim, the article has been widely shared on Facebook, X, Reddit and other social media platforms. The NBC News interview with Mr Nadella is also available on YouTube here. In the interview, the Microsoft boss talks about the risks and opportunities of Artificial Intelligence (AI), but does not mention anything resembling the claim. When asked about putting a stop to online misinformation relating to the 2024 US presidential election, Mr Nadella said his company was investing in technological verification tools. “We are doing all the work across the tech industry around watermarking, detecting deep fakes and content IDs. There is going to be enough and more technology, quite frankly, in order to be able to identify the issues around disinformation and misinformation,” he said (video mark 1min 08sec). “Then the question again comes back to, how do we build consensus between parties, candidates and the norms around what is acceptable, not acceptable?” At no point does Mr Nadella say anything about disabling computers. AAP FactCheck found no credible evidence to indicate Mr Nadella or anyone at Microsoft had announced plans to disable the computers of people who share misinformation. AAP FactCheck could not find any information on Microsoft’s website about the supposed announcement. A Microsoft spokeswoman told AAP FactCheck the claim was false. “No, there are no plans to disable any computers for users as described in these claims,” she said. Other fact-checking organisations have also debunked the same claim – here, here and here. Mr Adl-Tabatabai previously ran a disinformation website called YourNewsWire, described in a 2019 Mashable article (archived here) as “one of the most well-known purveyors of fake news online”. YourNewsWire was rebranded as NewsPunch, which then turned into The People’s Voice. AAP FactCheck has previously debunked Mr Adl-Tabatabai’s claims the World Economic Forum was trying to cancel Christmas and one billion had people died since the COVID-19 vaccine rollout. The claim Microsoft has announced it will disable the computers of people who spread misinformation online is false. The claim originates from an article on a fake news website. The article includes no evidence of the supposed announcement. Microsoft told AAP FactCheck the claim is false and the company has no plans to disable computers. False – The claim is inaccurate. AAP FactCheck is an accredited member of the International Fact-Checking Network. To keep up with our latest fact checks, follow us on Facebook, Twitter and Instagram. All information, text and images included on the AAP Websites is for personal use only and may not be re-written, \n\tcopied, re-sold or re-distributed, framed, linked, shared onto social media or otherwise used whether for compensation \n\tof any kind or not, unless you have the prior written permission of AAP. For more information, please refer to our \n\tstandard terms and conditions. Media Literacy Campaign  Stay in Touch AAP FactCheck provides factual, authoritative information Australians can rely on. Accredited with the Poynter Institute's International Fact-Checking Network and adhering to the highest industry standards, our experienced team works to minimise the impact of misinformation. Image buyers from all industries rely on AAP Photos. A digital treasure trove of content depicting Australian life, our fully-searchable database contains millions of images from around the country and around the world.  AAPNews delivers newswire content direct to the public. Choose from a number of subscription models to not only gain access to high-quality fact-based news on your desktop or mobile device, but also to show your support for Australia's only not-for-profit newswire. Get the news feed your organisation needs, with AAP offering extensive coverage of news, courts, politics, sports, finance and the arts. Take advantage of AAP’s partner content to get the international news that matters to your business, with news feeds delivered via multiple channels including API and FTP. AAP is Australia's only independent newswire service, delivering stories and images around the country and around the world every day. By supporting AAP with your contribution you are backing a team of dedicated, objective journalists to continue this work. Thank you.  Donations over $2 are tax deductible. AAP Acknowledgement of Country In the spirit of reconciliation Australian Associated Press acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their Elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today. © 2024 Australian Associated Press. All rights reserved. "
}