{
    "title": "Microsoft CEO Satya Nadella says Bill Gates' original mission 'always \nbothered me'",
    "date": "3/23/2024",
    "url": "https://sg.news.yahoo.com/microsoft-ceo-satya-nadella-says-192713132.html",
    "text": "(Microsoft CEO Satya Nadella and cofounder Bill Gates.Microsoft) Around 1980, Bill Gates gave Microsoft, the company he founded, a clear mission: \"A computer on every desk and in every home.\" But Microsoft CEO Satya Nadella, who started at the company as a programmer in 1992 and rose to the top job in 2014, thinks Gates' famous mission had a big flaw. \"When I joined the company in 1992, we used to talk about our mission as putting a PC in every home, and by the end of the decade we have done that, at least in the developed world,\" Nadella told USA Today in a profile published on Monday. \"It always bothered me that we confused an enduring mission with a temporal goal.\" In other words, Nadella is saying that Gates' vision for the future of Microsoft had a logical stopping point and did not consider what the company's direction would be once the goal was achieved. In the 2000s, under former CEO Steve Ballmer, Microsoft became better known for its efforts to preserve its control of the PC industry than for innovating. Nadella believes in making Microsoft more driven by a sense of purpose — in 2015, he said Microsoft's mission was \"to empower every person and every organization on the planet to achieve more.\" And he has encouraged the company not to rest on its laurels. Under Nadella, Microsoft has taken the focus off Windows and the PC and pinned its hopes to the rise of its Azure and Office 365 cloud-computing products, both of which are growing as the company's older businesses stagnate. While this approach hasn't translated to huge revenue growth, it has revitalized the company's image. Gates told USA Today that he enjoys working with Nadella, serving his twice-removed successor as a special adviser and helping guide the company's investments in cutting-edge technology as it competes with Apple, Google, and Amazon. Related Video: New Microsoft Lineup Caters to Creativity (2016) For more news videos visit Yahoo View, available now on iOS and Android. NOW WATCH: These apps for your iPhone are better than the ones Apple makes More From Business Insider These courses can help you master the single most powerful tool in Excel I’ve tested over 100 headphones in the past year, and I keep coming back to this $26 pair Microsoft's 'big bet factory' has a new mission: hacking human health Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\"  Abby Hensel officially tied the knot in 2021, it has been revealed This food habit is linked to a specific type of dementia. \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault.  Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Devastating glide bombs have been a major threat to Ukraine's forces, and they can only be beaten by shooting down planes before they're released.  There is a growing understanding across the Western allies that Ukraine is losing the ground war against Russia, and by summer could face defeat.  Russia is pounding front lines with artillery, rocket and drone fire — and at over five times the rate the Ukrainian army can reply.  Volodymyr Zelensky’s troops are exhausted — after sustaining in some sectors a heavier concentration of incoming artillery than at the Somme in 1916, or the Normandy Bocage after D-Day in 1944. A Russian fighter jet crashed into the sea off the Crimean port of Sevastopol on Thursday, the regional governor has said. The two perpetrators claimed that they were \"dissatisfied\" with Jacky Wu's \"hosting style\"  The post Lian Hup Heng: Underrated atas cafe-style tarts & cake loaves for $3.80, hidden within a hawker centre appeared first on SETHLUI.com. Tim Cook's days start before 5 a.m., and his mornings are filled with emails, strength training, and coffee. I tried out the Apple CEO's schedule. Nordegren has moved on and built a life that focuses on her six kids  Premier League ball boys and girls have been ordered to stop throwing the ball back to players during matches, amid concerns that the “multi-ball” system is giving home teams an unfair advantage. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. Shocking CCTV footage captures the moment a drunk driver plows a red sedan into a beauty clinic in the Lopburi province of Thailand, on March 20. The impact injured two staff members and caused significant damage to the clinic and adjacent beauty salon. The driver was found with a blood alcohol level four times the legal limit. "
}