{
    "title": "Microsoft Unveils Copilot Chatbot for Finance Tasks - Technology Times",
    "date": "3/2/2024",
    "url": "https://technologytimes.pk/2024/03/02/microsoft-unveils-copilot-chatbot-for-finance-tasks/",
    "text": "Latest Science, Technology & Innovation news In a strategic move aimed at enhancing efficiency in finance sector, Microsoft has announced the impending release of its Copilot chatbot tailored specifically for finance professionals. In a strategic move aimed at enhancing efficiency in the finance sector, Microsoft has announced the impending release of its Copilot chatbot tailored specifically for finance professionals. The tech giant revealed its plans on Thursday, stating that the chatbot would be capable of executing crucial tasks and streamlining workflows within financial departments. Initially set for a public preview, Microsoft has hinted that pricing details will soon follow. The introduction of Copilot for finance follows a trend among business software providers, such as HubSpot and Salesforce, who have been integrating generative artificial intelligence into their offerings. This trend gained momentum after the 2022 launch of OpenAI’s ChatGPT chatbot, renowned for its ability to produce natural-sounding text with minimal human input. Charles Lamanna, a corporate vice president at Microsoft, expressed the company’s ambition to empower every department with Copilot capabilities during an interview with CNBC in San Francisco. Microsoft has already deployed Copilot across various sectors, including general-purpose industrial use in Office applications, as well as specialized versions for sales and customer service. The finance-oriented Copilot is poised to revolutionize tasks such as variance analysis, data reconciliation in Excel, and expediting the collections process in Outlook. Leveraging data from SAP and Microsoft Dynamics 365, the software aims to provide comprehensive support for financial operations. Lamanna hinted at forthcoming features for the finance Copilot later this year. Dentsu, a prominent Japanese advertising agency, is among the early adopters slated to utilize Copilot for finance tasks, according to Lamanna. Microsoft disclosed that its finance department actively contributed to the development of the new Copilot, citing early benefits observed from its use. Cory Hrncirik, modern finance lead in Microsoft’s office of the chief financial officer, emphasized the potential impact of Copilot on streamlining reconciliation tasks. With the new chatbot, what once took hours for thousands of finance professionals now takes mere minutes, allowing them to focus on more value-added activities. While the adoption of Copilot remains optional for Microsoft’s finance employees, Lamanna highlighted the potential benefits for companies aiming to expedite financial processes. Quicker closures of financial books could become a reality for firms embracing these automations, presenting a compelling proposition for chief financial officers. Microsoft’s foray into finance-focused AI underscores a broader industry trend towards leveraging artificial intelligence to optimize workflows and enhance productivity. With Copilot Chatbot, Microsoft aims to empower finance professionals with tools that not only streamline mundane tasks but also unlock time for more strategic initiatives, ultimately driving organizational efficiency and innovation.  Technology Times Latest Science, Technology & Innovation news Proudly powered by WordPress\t\t\t\t\t\t\t\t\n | \nTheme: Newsup by Themeansar. "
}