{
    "title": "Single Point Partners LLC Sells 255 Shares of Microsoft Co. (NASDAQ:MSFT)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/single-point-partners-llc-sells-255-shares-of-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Single Point Partners LLC lowered its position in shares of  Microsoft Co. (NASDAQ:MSFT – Free Report) by 5.8% in the 4th quarter, according to the company in its most recent Form 13F filing with the Securities & Exchange Commission. The fund owned 4,141 shares of the software giant’s stock after selling 255 shares during the period. Single Point Partners LLC’s holdings in Microsoft were worth $1,557,000 at the end of the most recent reporting period. Several other hedge funds have also recently added to or reduced their stakes in MSFT. Monumental Financial Group Inc. bought a new stake in shares of  Microsoft in the 1st quarter valued at about $28,000.  Atlantic Private Wealth LLC lifted its stake in shares of  Microsoft by 534.5% in the 2nd quarter. Atlantic Private Wealth LLC now owns 184 shares of the software giant’s stock valued at $63,000 after acquiring an additional 155 shares during the last quarter.  Hibernia Wealth Partners LLC bought a new stake in shares of  Microsoft in the 3rd quarter valued at about $69,000.  Iron Horse Wealth Management LLC lifted its stake in shares of  Microsoft by 89.0% in the 3rd quarter. Iron Horse Wealth Management LLC now owns 223 shares of the software giant’s stock valued at $70,000 after acquiring an additional 105 shares during the last quarter.  Finally, MayTech Global Investments LLC bought a new stake in shares of  Microsoft in the 4th quarter valued at about $83,000. Institutional investors own  71.13% of the company’s stock. In related news, major shareholder Corp Microsoft sold 1,000,000 shares of the firm’s stock in a transaction on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total value of $1,950,000.00. Following the transaction, the insider now directly owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The sale was disclosed in a legal filing with the SEC, which is available through the SEC website. In other Microsoft news, insider Bradford L. Smith sold 45,000 shares of the stock in a transaction on Friday, February 2nd. The stock was sold at an average price of $411.78, for a total value of $18,530,100.00. Following the completion of the sale, the insider now owns 574,129 shares in the company, valued at approximately $236,414,839.62. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is available at this link. Also, major shareholder Corp Microsoft sold 1,000,000 shares of the stock in a transaction on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total value of $1,950,000.00. Following the completion of the sale, the insider now owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The disclosure for this sale can be found here. In the last three months, insiders have sold 1,070,258 shares of company stock valued at $30,690,456. 0.03% of the stock is owned by company insiders. Shares of MSFT opened at $420.72 on Friday. The business’s fifty day simple moving average is $410.82 and its two-hundred day simple moving average is $374.31. The company has a current ratio of 1.22, a quick ratio of 1.20 and a debt-to-equity ratio of 0.19. Microsoft Co. has a 12 month low of $275.37 and a 12 month high of $430.82. The company has a market cap of $3.13 trillion, a price-to-earnings ratio of 38.04, a P/E/G ratio of 2.24 and a beta of 0.89. Microsoft (NASDAQ:MSFT – Get Free Report) last released its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 earnings per share for the quarter, beating the consensus estimate of $2.76 by $0.17. The firm had revenue of $62.02 billion for the quarter, compared to analysts’ expectations of $61.14 billion. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The company’s revenue was up 17.6% compared to the same quarter last year. During the same period in the prior year, the firm earned $2.32 EPS.  Research analysts anticipate that  Microsoft Co. will post 11.63 earnings per share for the current fiscal year. The business also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Investors of record on Thursday, May 16th will be issued a $0.75 dividend. The ex-dividend date is Wednesday, May 15th. This represents a $3.00 dividend on an annualized basis and a yield of 0.71%. Microsoft’s dividend payout ratio  is currently 27.12%. MSFT has been the subject of a number of recent research reports. Barclays boosted their target price on Microsoft from $421.00 to $475.00 and gave the company an “overweight” rating in a research note on Wednesday, January 31st. BMO Capital Markets upped their price target on Microsoft from $420.00 to $455.00 and gave the company an “outperform” rating in a research report on Wednesday, January 31st. KeyCorp assumed coverage on Microsoft in a research report on Thursday, March 21st. They set an “overweight” rating and a $490.00 price target for the company. StockNews.com lowered Microsoft from a “buy” rating to a “hold” rating in a research report on Thursday, February 22nd. Finally, Royal Bank of Canada upped their price target on Microsoft from $415.00 to $450.00 and gave the company an “outperform” rating in a research report on Wednesday, January 31st. Four analysts have rated the stock with a hold rating and thirty-six have issued  a buy rating to the company’s stock. According to data from MarketBeat, the stock currently has a consensus rating of “Moderate Buy” and a consensus price target of $423.34. Read Our Latest Stock Report on Microsoft (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Willis Investment Counsel Trims Stock Position in Microsoft Co. (NASDAQ:MSFT) 17 Capital Partners LLC Takes $3.85 Million Position in Microsoft Co. (NASDAQ:MSFT) "
}