{
    "title": "US Congress bans staff use of Microsoft's AI Copilot, Axios reports",
    "date": "3/29/2024",
    "url": "https://www.saltwire.com/halifax/business/us-congress-bans-staff-use-of-microsofts-ai-copilot-axios-reports-100952461/",
    "text": "SaltWire.com would like to send you notifications for breaking news alerts. Activate notifications? SaltWire.com would like to send you notifications for breaking news alerts. Activate notifications? Important information regarding Saltwire's CCAA filing STORY CONTINUES BELOW THESE SALTWIRE VIDEOS Barley Risotto and Kimchi: A Culinary Crossroads| SaltWire #food #cookingshorts #kimchi (Reuters) -The U.S. House of Representatives has set a strict ban on congressional staffers' use of Microsoft's Copilot generative AI assistant, Axios reported on Friday. \"The Microsoft Copilot application has been deemed by the Office of Cybersecurity to be a risk to users due to the threat of leaking House data to non-House approved cloud services,\" the House's Chief Administrative Officer Catherine Szpindor said, according to the Axios report. \"We recognize that government users have higher security requirements for data. That’s why we announced a roadmap of Microsoft AI tools, like Copilot, that meet federal government security and compliance requirements that we intend to deliver later this year,” a Microsoft spokesperson told Reuters. The U.S. House's chief administrative office did not immediately respond to a Reuters request for comment. Policymakers have been looking at potential risks in federal agency adoption of artificial intelligence and the adequacy of safeguards to protect individual privacy and ensure fair treatment. Last year, two Democratic and two Republican U.S. senators introduced legislation to ban the use of artificial intelligence that creates content falsely depicting candidates in political advertisements to influence federal elections. (Reporting by Mrinmay Dey and Mehnaz Yasmin in Bengaluru; Editing by Daniel Wallis and Marguerita Choy and David Gregorio) "
}