{
    "title": "Microsoft Names Indian American Pavan Davuluri as Head of Windows and \nSurface Devices Teams",
    "date": "3/27/2024",
    "url": "https://americankahani.com/business/microsoft-names-indian-american-pavan-davuluri-as-head-of-windows-and-surface-devices-teams/",
    "text": "  Microsoft has named company veteran Pavan Davuluri to lead its Windows operating system and Surface devices teams. Six months ago, the Indian American took over the Surface silicon and devices work, while Mikhail Parakhin led a new team focused on Windows and web experiences. Now, Davuluri will be responsible for both Windows and Surface, as Parakhin has “decided to explore new roles,” as reported by The Verge. Today, we announced our first ever #Surface AI PCs built exclusively for business: Surface Pro 10 for Business and Surface Laptop 6 for Business! I'm incredibly proud of the team for the work they did to bring these devices and experiences to life for our customers #Copilot… pic.twitter.com/NxTxp7p69V CNBC notes that Davuluri’s promotion “comes a week after Microsoft said it was hiring former DeepMind co-founder Mustafa Suleyman as the head of a new organization called Microsoft AI.” Citing an internal memo from Rajesh Jha, Microsoft’s head of experiences and devices, The Verge reported that Microsoft is now bringing together its Windows and devices teams again. According to Jha, this merger will enable the company “to take a holistic approach to building silicon, systems, experiences, and devices that span Windows client and cloud for this AI era. An IIT Madras alumni, Davuluri began his career at Microsoft as a Reliability Component Manager in 2001. During a 23-year tenure at the company, he has held various leadership positions, working across PC and Xbox hardware, Surface, and Windows. He took on the role of corporate vice president for Windows and Silicon & Systems Integration in 2021, overseeing efforts to optimize Windows for Arm-based devices. According to his LinkedIn profile, he completed his post-graduation from the University of Maryland. Jha additionally outlined other changes in the company structure since the hiring of Suleyman. Shilpa Ranganathan, Microsoft’s Windows CVP since April 2022 and a 15-plus-year company veteran, and her team will report to Davuluri. Fatima Kardar, a 22-plus-year Microsoft veteran and CVP of AI infrastructure and partnerships, will report to Ribas. Rukmini Iyer, CVP of Microsoft Advertising product engineering and a 13-year Microsoft veteran will lead Advertising, join the Microsoft AI leadership team, and report to Suleyman. In contrast, engineer Paul Viola, and Weiqing Tu, CVP leading the Microsoft Start content feed product, will report to Iyer. Get notified about exclusive stories every week!     Your email address will not be published. Save my name, email, and website in this browser for the next time I comment.  © 2020 American Kahani LLC. All rights reserved. Our site uses cookies. Learn more about our use of cookies: cookie policy Get notified about exclusive stories every week! "
}