{
    "title": "MSFT Stock: Microsoft’s Gaming Strategy Is AAA",
    "date": "3/28/2024",
    "url": "https://www.technologyforyou.org/msft-stock-microsofts-gaming-strategy-is-aaa/",
    "text": "Unsurprisingly, Microsoft’s (NASDAQ:MSFT) recent earnings report focused heavily on the Big Tech company’s artificial intelligence (AI) and cloud segments. MSFT stock investors — and the tech world as a whole — simply cannot hear enough about AI right now. However, one beleaguered division of the company had its results banished to the end of the presentation slides almost as an afterthought: Gaming. Considering how much trouble Microsoft went through last year to close the Activision-Blizzard acquisition and how outsized of an impact the acquisition had on the company’s revenue, this is quite surprising. What’s even more surprising is that Microsoft rewarded its Gaming division, which includes its Xbox and first-party developers Activision, Blizzard, ZeniMax and others, with layoffs in January. To be fair, layoffs after a merger or acquisition are, unfortunately, nothing new. But these layoffs were, at least to some extent, different. They heralded a major shakeup in not just Microsoft’s Gaming division, but the broader industry. Turning back the clock a decade to 2014, the top three largest video game companies were almost precisely the same: Tencent (OTCMKTS:TCEHY), Sony (NYSE:SONY) and Microsoft. With last year’s Activision-Blizzard merger, Microsoft leapfrogged itself to the top of the list. This merger also heralded a new strategy by Microsoft for dominating the gaming industry: Focus on the hits. Hardware sales had already been slowly losing relevance for quite some time, and the heydays of the Xbox 360 were long over. In fact, Sony’s PlayStation line has outsold every generation of Xbox to date. Microsoft’s gaming division reported a measly 1% increase in hardware sales for the second quarter of 2024. As many investors might recall, during the merger, there had been a fierce legal battle waged between Microsoft and Activision on one side and Sony and antitrust regulators on the other. One of the big sticking points was the concern that Activision’s incredibly popular (and lucrative) Call of Duty franchise would become an Xbox exclusive. After legal back and forth and lots of corporate drama, Microsoft and Sony came to an agreement to keep Call of Duty on Sony’s consoles. The thing is, Microsoft never really wanted to make Call of Duty a console exclusive. That was never the goal. As The Verge put it: “Microsoft has always maintained it would keep Call of Duty on PlayStation, arguing it doesn’t make financial sense to pull the game from Sony’s consoles.” Microsoft’s goal in acquiring Activision-Blizzard was to grow its collection of highly lucrative intellectual property. The plan was not to hoard AAA titles to sell Xboxes, but to expand and conquer. We’d already seen the precursor to this shift in 2021 when Microsoft acquired ZeniMax (specifically for Bethesda Studios, the makers of the Fallout franchise). When it came to the next step, gaming division CEO Phil Spencer wanted a “career moment” and even considered a wide range of potential targets, including Nintendo (OTCMKTS:NTDOY) and Sega (OTCMKTS:SGAMY). Now, this shift isn’t exactly a dramatic change in strategy. Console producers have always wanted to put out top-selling AAA titles. Yet, over the past 20 years, companies like Microsoft have bought up developer after developer to try and get the next big hit. If anything, Microsoft was a little slow, or perhaps methodical, in its acquisitions of studios. Rare, which made Golden Eye 007 and Banjo-Kazooie, was acquired in 2002. Bungie, of Halo and now Destiny fame, was acquired in 2000 but split off in 2007. Mojang, creators of the legendary blocky hit Minecraft, was acquired in 2014. Lastly, the two other biggest acquisitions — ZeniMax and Activision-Blizzard — have occurred in the last three years. Sony has followed a far messier mergers and acquisitions strategy on a much larger scale. It even acquired Bungie in 2022 after 15 years of independence from Microsoft. As of August 2023, Sony has 21 first-party studios compared to Microsoft’s 15 (nine of which directly came from acquisitions). And despite the almost unending news of layoffs in the industry, M&A activity is expected to pick up even more this year. Sony’s experience should be a warning to Microsoft: Don’t overdo it. The international entertainment giant underwent its own round of layoffs in its gaming division at the beginning of March. It was quick to blame those laid off for mismanaging budgets, but Gamesindustry.biz’s Brendan Sinclair puts the blame for the layoffs on senior leadership for betting too hard on expensive acquisitions and live-service and augmented reality R&D. Despite a contentious legal battle, the Activision-Blizzard merger seems to be working out well already for Microsoft and MSFT stock. Activision brought in $2.08 billion of revenue in Q2 2024, driving the majority of Microsoft’s 49% gaming revenue increase. That’s impressive. However, leadership needs to be careful not to let it go to their heads here. Simply put, they should stick to the plan and not get greedy and overextend like their competition. Gone are the days when hardware sales were the goal. Also gone is the strategy of taking a loss on hardware and making it up with first-party console-exclusive games or subscriptions. Now, Microsoft’s strategy is to simply be everywhere with the biggest titles. Console exclusivity is a relic of the past. The industry is changing and very volatile. Warner Bros. Discovery (NASDAQ:WBD) wants to focus on “free-to-play and mobile,” which might sound like déjà vu to some, as that pretty much defined the industry in the 2010s. Embracer Group (OTCMKTS:THQQF) spent the last part of a decade gobbling up every studio it could find and is now paying the price for its overextension. Sega is spinning off Relic Entertainment, one of its few remaining crown jewels, and undergoing layoffs. Independent studios and developers have been struggling to get financing for their projects. With the competition suffering almost across the board, there’s some wisdom in picking up a big name right now. And Microsoft made a very good buy with Activision-Blizzard. Thus, the recent layoffs suggest Microsoft really is, per its press release, “focused on the best opportunities for growth.” Putting aside the corporate speak, the company’s Gaming division appears to be operating with not only the “fiscal discipline” that investors are looking for in the tech world right now, but a longer-term “strategic discipline” as well. For MSFT stock investors hedging their bets on Microsoft’s AI and cloud endeavors, its Gaming division should provide some long-term solace. On the date of publication, Andrew Bush held a LONG position in MSFT, SONY and WBD stocks. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Andrew Bush is a financial news editor for InvestorPlace and holds two degrees in International Affairs. He has worked in education, the tech sector and as a research analyst for a DC-based national security-focused consulting firm. Source Link Save my name, email, and website in this browser for the next time I comment.  "
}