{
    "title": "Microsoft Launches Copilot AI for Finance Pros in Excel and Outlook",
    "date": "3/1/2024",
    "url": "https://world-wire.com/microsoft-launches-copilot-ai-for-finance-pros-in-excel-and-outlook/",
    "text": "To help finance teams save time and help them perform tasks easily and efficiently so that they can contribute to the other profitability aspects of the business, Microsoft has launched a solution called Copilot for Finance. Let’s read the news and find out more. Microsoft Launches Copilot AI for Finance Pros in Excel and Outlook On Thursday, the well-known American multinational company Microsoft announced the release of a chatbot, Copilot, which can help workers in the finance sector handle key tasks. Copilot for Finance, currently in public preview, will help connect with the company’s financial systems, such as Dynamics 365 and SAP, to offer role-specific workflow automation, suggested actions, and recommendations in Microsoft Teams, Microsoft Outlook, Excel, and other Microsoft 365 apps. This newly launched tool is a new hope for those who handle tedious financial tasks. With this tool, Copilot for Finance, Microsoft claims that it contains various features that can help Finance people carry out tasks efficiently and save time. The key features highlighted are: Help quickly conduct a variance analysis in Excel, simplify the reconciliation process in Excel, provide a complete summary of customer account details in Outlook, and lastly, allow customers to turn raw data in Excel into presentation-ready visuals and reports. It is also said that additional features will be added to the Copilot for Finance later this year. Also, read “Google Launches Gemini AI for Workspace Tools at $20.” Microsoft has previously released Copilots tailored for customer service and sales representatives and a general-purpose industrial Copilot for Office applications. The Copilot for Finance is now made to reduce the burden and time for the finance workers to focus on other work and further contribute to the company’s growth. These days, many have been continuously experimenting with incorporating generative artificial intelligence into their existing options to increase customer efficiency; several business software providers, such as HubSpot and Salesforce, have also been involved in such experimentation. It all started with The ChatGPT chatbot, developed by a startup company called OpenAI in 2022, which became the trendsetter for this experimentation with AI. The ChatGPT can provide human-like responses with several inputs, and it also helps provide content. In an interview with CNBC on Wednesday in San Francisco, Microsoft corporate vice president Charles Lamanna stated, “We want every one of the departments to be enabled and enriched with a Copilot.” Also, read “Samsung Unveils New Memory Chip With ‘Highest-Capacity to Date’ For AI.” According to Lamanna, the Japanese advertising agency Dentsu will use the Copilot for financial tasks. Microsoft also proudly reported that its finance division contributed to creating the new Copilot and has already noticed some advantages. Cory Hrncirik, modern finance lead in Microsoft’s chief financial officer’s office, noted, “Our finance organization is just like any other – looking for technology to help us do our work in a more efficient and impactful way – and we’re excited to track our journey as customer zero of Microsoft Copilot for Finance.” Sarper Baysal, Microsoft Commercial Revenue Planning Lead, stated, “Financial analysts today spend, on average, one to two hours reconciling data per week. With Copilot for Finance, that is down to 10 minutes. Functionality like data reconciliation will be a huge time saver for an organization as complex as Microsoft.” Subscribe to Email Updates : Name *Email Address *SubscribePlease do not fill in this field. Eliana Cooper is an esteemed editor at World-Wire, recognized for her expertise in sports and government news. With a background in Journalism and Political Science, she excels in delivering in-depth and factual reporting. Her work is known for its thorough research and clear presentation, making complex topics accessible. Eliana's contributions have earned her recognition, including the \"Excellence in Sports Journalism\" award in 2023. Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.    World-Wire provides quality informational content on politics, current events and current affairs from USA and around the globe. "
}