{
    "title": "Zacks Research Weighs in on ProAssurance Co.'s FY2024 Earnings (NYSE:PRA)",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-pra-analyst-earnings-estimates-2024-03-21/",
    "text": "ProAssurance Co. (NYSE:PRA - Free Report) - Equities researchers at Zacks Research cut their FY2024 earnings per share (EPS) estimates for ProAssurance in a report released on Tuesday, March 19th. Zacks Research analyst K. Dey now forecasts that the insurance provider will post earnings of $0.27 per share for the year, down from their prior forecast of $0.32. The consensus estimate for ProAssurance's current full-year earnings is $0.27 per share. Zacks Research also issued estimates for ProAssurance's Q4 2024 earnings at $0.08 EPS. PRA has been the subject of several other reports. JMP Securities lowered their price objective on shares of ProAssurance from $24.00 to $22.00 and set a \"market outperform\" rating for the company in a research report on Thursday, February 29th. TheStreet downgraded shares of ProAssurance from a \"c-\" rating to a \"d+\" rating in a research report on Wednesday, December 6th. Piper Sandler lowered their price target on shares of ProAssurance from $16.00 to $15.00 and set an \"overweight\" rating for the company in a report on Monday, March 4th. Finally, Truist Financial lowered their price target on shares of ProAssurance from $15.00 to $14.00 and set a \"hold\" rating for the company in a report on Thursday, February 29th. Two research analysts have rated the stock with a hold rating and two have given a buy rating to the stock. Based on data from MarketBeat, ProAssurance has an average rating of \"Moderate Buy\" and an average price target of $17.00. Read Our Latest Report on ProAssurance Shares of PRA stock traded down $0.02 during trading on Thursday, hitting $12.41. The company had a trading volume of 420,644 shares, compared to its average volume of 274,908. The company has a debt-to-equity ratio of 0.38, a quick ratio of 0.27 and a current ratio of 0.27. The firm has a market capitalization of $632.54 million, a P/E ratio of -16.80 and a beta of 0.23. The stock's 50-day moving average price is $12.90 and its 200 day moving average price is $14.75. ProAssurance has a one year low of $11.76 and a one year high of $19.38. ProAssurance (NYSE:PRA - Get Free Report) last issued its quarterly earnings results on Tuesday, February 27th. The insurance provider reported ($0.05) earnings per share (EPS) for the quarter, missing the consensus estimate of $0.04 by ($0.09). The company had revenue of $296.96 million during the quarter, compared to the consensus estimate of $252.74 million. ProAssurance had a negative net margin of 3.39% and a negative return on equity of 0.53%. The company's quarterly revenue was up .8% on a year-over-year basis. During the same quarter last year, the firm posted $0.06 earnings per share. Institutional investors have recently bought and sold shares of the company. Point72 Middle East FZE bought a new stake in ProAssurance during the fourth quarter valued at $25,000. Lazard Asset Management LLC bought a new stake in ProAssurance during the first quarter valued at $31,000. Intrepid Capital Management Inc. bought a new stake in ProAssurance during the second quarter valued at $32,000. Tower Research Capital LLC TRC boosted its position in ProAssurance by 23.3% during the fourth quarter. Tower Research Capital LLC TRC now owns 4,449 shares of the insurance provider's stock valued at $61,000 after acquiring an additional 842 shares during the last quarter. Finally, FMR LLC boosted its position in shares of ProAssurance by 19.8% during the 3rd quarter. FMR LLC now owns 4,923 shares of the insurance provider's stock worth $93,000 after purchasing an additional 812 shares in the last quarter. Institutional investors own 85.14% of the company's stock. ProAssurance Corporation, through its subsidiaries, provides property and casualty insurance, and reinsurance products in the United States. The company operates through Specialty Property and Casualty, Workers' Compensation Insurance, and Segregated Portfolio Cell Reinsurance segments. It offers professional liability insurance to healthcare providers and institutions, and attorneys and their firms; medical technology liability insurance to medical technology and life sciences companies; and custom alternative risk solutions, including assumed reinsurance, loss portfolio transfers, and captive cell programs for healthcare professional liability insureds.Further ReadingFive stocks we like better than ProAssuranceInsider Trading - What You Need to KnowGoogle and Meta Circling the Market on a TikTok Ban RallyDo ETFs Pay Dividends? What You Need to KnowIntuitive Machines: Charting a Course Among the StarsUptrend Stocks Explained: Learn How to Trade Using UptrendsKB Home’s Stock Price Can Move Higher, Here’s Why  Before you consider ProAssurance, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and ProAssurance wasn't on the list. While ProAssurance currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}