{
    "title": "Microsoft earnings beat easily. Here’s why that may be met with a shrug.",
    "date": "1/30/2024",
    "url": "https://www.marketwatch.com/story/microsoft-earnings-beat-across-the-board-as-cloud-ai-drive-momentum-8e84c43e",
    "text": "Microsoft Corp. posted beats across the board with its latest results Tuesday afternoon, calling out momentum in the cloud and traction with artificial intelligence. Microsoft’s \n        MSFT,\n        -0.17%\n       Azure and other cloud-services businesses posted revenue growth of 28% on a constant-currency basis in the fiscal second quarter, with that rate coming in ahead of the 27% growth that analysts tracked by FactSet were expecting. What stood out to analysts was that AI services contributed 6 percentage points to Azure’s growth in the December quarter, up from 3 points in the September quarter. On the earnings call, UBS’s Karl Keirstead called the lift “extraordinary.” Meanwhile, Microsoft’s management expects to see similar overall growth for Azure in the current quarter. “Growth will be driven by our Azure consumption business with continued strong contribution from AI,” Chief Financial Officer Amy Hood said on the earnings call. Despite the upbeat results and AI commentary, however, shares of Microsoft slipped 1% in premarket trade on Wednesday. Could the stock’s recent rally over the past three months (up 21%) and past 12 months (up 69%) have something to do with the muted response? “AI is becoming a major story, but at this point it’s well-known and was priced into the stock,” David Russell, TradeStation’s global head of market strategy, said in an email. See also: Alphabet’s stock dips because advertising was good, but not good enough In his view, “traders could very well take profits and rotate to cyclicals, like financials and industrials, given the increasingly solid economic data,” meaning that Microsoft’s report “may be a sell-the-news event,” or at least one that makes investors shrug. Overall, Microsoft recorded $62.0 billion in revenue for its fiscal second quarter, up from $52.7 billion a year earlier. Analysts were modeling $61.1 billion. “By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector,” Chief Executive Satya Nadella said in the company’s press release. During the December quarter, Microsoft generated $19.2 billion in revenue from its productivity and business-processes segment, which houses Office. Analysts were modeling $18.6 billion. Heading into Microsoft’s report, analysts were curious about the impact of AI on Microsoft’s software portfolio, especially after the company launched Copilot, an AI assistant for its Microsoft 365 product, late last year. The company didn’t offer too much detail on Tuesday’s call but hinted at traction. “While it’s early days for the Microsoft 365 Copilot, we’re excited about the adoption to date and continue to expect revenue to grow over time,” Hood said on the call. Intelligent-cloud revenue was up 20% to $25.9 billion, while the FactSet consensus was for $25.3 billion. The More Personal Computing segment, which includes Xbox and Windows, saw revenue rise 19% to $16.9 billion and edging ahead of the consensus view, which was for $16.8 billion. “A stronger-than-expected performance from Activision was offset by the weaker-than-expected console market,” Hood said. Microsoft posted net income of $21.9 billion, or $2.93 a share, up from $16.4 billion, or $2.20, in the year-ago quarter. Earnings per share came in ahead of the consensus view, which was for $2.79. See also: These 4 software stocks are ‘underloved.’ Here’s what could get them appreciated. Readers weigh in on Medicare/Medigap vs. Medicare Advantage, the investment case for Trump Media & Technology Group, and why Apple is not a monopoly Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}