{
    "title": "Microsoft pips Apple to become world's most valuable company",
    "date": "1/11/2024",
    "url": "https://www.republicworld.com/business/microsoft-pips-apple-to-become-world-s-most-valuable-company/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated January 11th, 2024 at 21:18 IST Microsoft shares rose 1.5%, giving it a market valuation of $2.888 trillion. Tech giant Microsoft has overtaken Apple as the world's most valuable company after the iPhone maker began 2024 with the most rocky start in years due to growing demand concerns. Shares of Redmond, Washington-based Microsoft rose 1.5 per cent, giving it a market valuation of $2.888 trillion as its early lead in the race to make money from generative artificial intelligence helped draw investors. Notably, on Tuesday San Francisco court's stated that Microsoft CEO Satya Nadella's could face questioning in a lawsuit by a group of video gamers. The gamers' lawsuit has claimed that Microsoft's $69 billion purchase of \"Call of Duty\" maker Activision will hurt competition. Apple was 0.3 per cent lower with a market capitalisation of $2.887 trillion. This is the first time since 2021 that Apple's valuation has slipped below that of Microsoft. The Cupertino, California-based company's stock has slid 3.3 per cent so far in January as of last close, compared with a 1.8 per cent rise in Microsoft. The weakness in Apple follows a series of rating downgrades that have fanned worries that sales of the iPhone, its biggest cash cow, would stay weak, especially in major market China. \"China could be a drag on performance over the coming years,\" brokerage Redburn Atlantic said in a client note on Wednesday. The brokerage pointed out to a competition from a resurgent Huawei and Sino-US tensions that have increased pressure on Apple. Apple's services business, a growth driver in recent quarters, continues facing threats as regulators have intensified scrutiny of a lucrative deal that makes Google the default search engine on iOS. Shares of Apple, whose market capitalisation peaked at $3.081 trillion on December 14, ended last year with a gain of 48 per cent. That was lower than the 57 per cent rise posted by Microsoft, which aggressively rolled out genAI-powered tools in 2023 thanks to its tie-up with ChatGPT-maker OpenAI. Microsoft has briefly taken the lead over Apple as the most valuable company a handful of times since 2018, most recently in 2021 when concerns about COVID-driven supply chain shortages hit the iPhone maker's stock price. Currently, Wall Street is more positive on Microsoft. The company has no \"sell\" rating and nearly 90 per cent of the brokerages covering the company recommend buying the stock. Apple has two \"sell\" ratings and only two-thirds of the analysts covering the company rate it a \"buy\". Both the stocks look relatively expensive in terms of price to their expected earnings, a common method of valuing publicly listed companies. Apple is trading at a forward PE of 28, well above its average of 19 over the past 10 years, according to LSEG data. Microsoft is trading around 31 times forward earnings, above its 10-year average of 24. (With Reuters inputs)  Published January 11th, 2024 at 21:16 IST Send us your views, we’ll publish them. This section is moderated. UP: Portion of Under-Construction Bridge Collapses in Bulandshahr Upset Over Relationship Issues, B.Tech Student Dies by Suicide in Noida Daughter-in-Law of Former Lok Sabha Speaker Shivraj Patil Joins BJP Google's timeline for RCS support on iPhone Han So Hee-Ryu Jun Yeol Call It Quits Within Two Weeks Amid Controversy Zodiac Signs That Are Born To Be Rebels And Challenge The Status Quo 'Received I-T Notice Last Night', Claims DK Shivakumar AAP's Bharadwaj, Atishi to Address Press Conference at Noon Today | LIVE BTech Graduate from Jodhpur Held for Stealing Laptops From PGs in B'luru Elderly Woman Touches Pilot's Feet On A Flight To Ayodhya, Video Viral © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}