{
    "title": "REACTION: Vodafone and Microsoft's £300m AI deal",
    "date": "1/16/2024",
    "url": "https://www.capacitymedia.com/article/2cq0wlaes7214vmv2kq9s/news/reaction-vodafone-and-microsofts-300m-ai-deal",
    "text": "Vodafone will invest US$1.5 billion over the next 10 years in cloud and customer-focused AI services developed in conjunction with Microsoft. Microsoft will also use Vodafone’s fixed and mobile connectivity services. The companies will collaborate to transform Vodafone’s customer experience using generative AI while the firm also aims to overhaul its global data centre cloud strategy. Microsoft also intends to invest in Vodafone’s managed IoT connectivity platform which will become a separate, standalone business by April 2024. “Today, Vodafone has made a bold commitment to the digital future of Europe and Africa,” Margherita Della Valle, chief executive at Vodafone Group said. “This unique strategic partnership with Microsoft will accelerate the digital transformation of our business customers, particularly small and medium-sized companies, and step up the quality of customer experience for consumers.” Vodafone and Microsoft say they have identified five key areas of collaboration around the areas of Generative AI, scaling IoT, digital acceleration in Africa, enterprise growth and Cloud transformation. “This new generation of AI will unlock massive new opportunities for every organisation and every industry around the world,” said Satya Nadella, chairman and CEO, of Microsoft. “We are delighted that together with Vodafone we will apply the latest cloud and AI technology to enhance the customer experience of hundreds of millions of people and businesses across Africa and Europe, build new products and services, and accelerate the company’s transition to the cloud.” Reaction Keith McAleese, head of telco, media and tech (TMT) at NTT DATA UK and Ireland believes telcos are under pressure to prove return on investment on fibre and 5G investments, but they must get their data strategy right before they think about getting generative AI to do their “heavy lifting”. “This partnership between Microsoft and Vodafone shows one of the pathways available to telcos aiming to grow their business-to-business (B2B) revenue beyond basic connectivity services – with this deal helping Vodafone to scale its enterprise and new standalone IoT businesses,” he said. “It will be another turbulent year for UK and Irish telcos, and the pressure is on to demonstrate ROI on recent years’ capital investments, which have been largely fibre and 5G related, to their shareholders. McAleese says that telcos of all sizes are exploring AI and automation use cases, with many running “lighthouse” projects and trying to determine where these technologies can drive the most value. With Microsoft’s generative AI and Vodafone’s extensive customer base, McAleese believes that both are uniquely positioned to create highly personalised services that could reshape consumer expectations. “Despite the hype around generative AI and other machine learning applications, telcos must continue to ensure that data literacy, trust, and governance are in place before generative AI does the heavy lifting. Otherwise, challenges will emerge quickly.” Growth for IoT Luc Vidal, head of M2/IoT business and mobility at BICS believes this partnership shows sustained growth for IoT service, likely resulting in increased attention for “connectivity twins”. “They’re the missing piece enterprises need to virtually clone IoT devices, including their connectivity components, for a single real-time view of their end-to-end IoT solutions, along with all device and application components,” he says. “Digital twins turn device-centric information into a business visualisation allowing more efficient decisions.” Vidal adds that as the volume of IoT devices continues to ramp up, these connectivity twins will be essential for enterprises to troubleshoot problems faster, better predict downtime and maintenance, facilitate end-to-end security and improve overall service quality. “Without these, businesses deploying IoT will effectively be blind, lacking real control over their systems and devices.” As a premium subscriber, you can gift this article for free You have reached the limit for gifting for this month There was an error processing the request. Please try again later. "
}