{
    "title": "Going Into Earnings, Is Microsoft Stock a Buy, a Sell, or Fairly Valued?",
    "date": "1/19/2024",
    "url": "https://www.morningstar.com/stocks/going-into-earnings-is-microsoft-stock-buy-sell-or-fairly-valued",
    "text": "We’ll be watching growth in Azure and commercial bookings Microsoft MSFT is set to release its fiscal second-quarter earnings report on Jan. 30, after the close of trading. Here’s Morningstar’s take on Microsoft’s earnings and our outlook for its stock. With its 3-star rating, we believe Microsoft’s stock is fairly valued compared with our long-term fair value estimate of $370 per share, which implies a fiscal 2024 enterprise value/sales multiple of 11 times, adjusted P/E multiple of 34 times, and a 1% free cash flow yield. We model a five-year compound annual growth rate for revenue of approximately 12% inclusive of the Activision acquisition. We envision stronger revenue growth ahead, as Microsoft’s prior decade was bogged down by the downturn in 2008, the complete evaporation of mobile handset revenue from the disposal of the Nokia handset business, and the model transition to subscriptions (which initially resulted in slower revenue growth). However, we believe macro and currency factors will pressure revenue in the near term. We believe revenue growth will be driven by Azure, Office 365, Dynamics 365, LinkedIn, and emerging AI adoption. Azure is the single most critical revenue driver over the next 10 years, in our view, as hybrid environments (where Microsoft excels) drive mass cloud adoption. We believe the combination of Azure, DBMS, Dynamics 365, and Office 365 will drive above-market growth as CIOs continue to consolidate vendors. We believe More Personal Computing will grow modestly above GDP over the next 10 years. Read more about Microsoft’s fair value estimate. We assign Microsoft overall a wide moat based on its switching costs, network effects, and cost advantages. We believe the firm is a leader across a variety of key technology areas, which should result in economic returns well in excess of its cost of capital for years to come. We believe Microsoft’s different segments and products benefit from different moat sources. High switching costs and cost advantages drive a wide moat for Azure, which is clearly the growth engine for the Intelligent Cloud segment and one of the critical products the “new” Microsoft will be built around. Read more about Microsoft’s moat rating. Microsoft faces risks that vary among its products and segments. High market share in the client-server architecture over the last 30 years means significant high-margin revenue is at risk, particularly in OS, Office, and Server. Microsoft has thus far been successful in growing revenues in a constantly evolving technology landscape, and it is enjoying success in both moving existing workloads to the cloud for current customers and attracting new clients directly to Azure. However, the firm must continue to drive revenue growth of cloud-based products faster than revenue declines in on-premises products. While we do not see significant ESG risks, we note that Microsoft faces strong competition for software engineers on the hiring front, and it also faces risks arising from a potential data breach within its data centers. Read more about Microsoft’s risk and uncertainty. This article was compiled by Quinn Rennell. The author or authors do not own shares in any securities mentioned in this article.\n\n\t\t\t\t\t\tFind out about Morningstar’s editorial policies. Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}