{
    "title": "Microsoft hits $3 trillion market value, briefly surpasses Apple Inc",
    "date": "1/24/2024",
    "url": "https://www.hindustantimes.com/business/microsoft-hits-3-trillion-market-value-briefly-surpasses-apple-inc-as-worlds-most-valued-company-101706113480286.html",
    "text": "Subscribe Now! Get features like As the company shares rallied on the stock market, tech giant Microsoft's market value hit $3 trillion for the first time on Wednesday, briefly making it the most valued company in the world. Eventually, Microsoft retained its position as the second most valued company in the world, just behind iPhone maker Apple. Notably, Apple Inc was the first company in the world to hit the $3 trillion mark with its valuation. Microsoft stock rose as much as 1.3% to $403.95 on January 24, leading to the market capitalisation touching $3 trillion, and briefly surpassing Apple as the most valued company in the world. Apple and Microsoft traded places for the top spot in the early trade hours, with Microsoft retaining the second spot on the list of largest public stocks in the world. The Redmond, Washington-based company is one of the so-called Magnificent 7 that fueled the market’s advance over 2023, gaining about 57%. The advance continued into this year, with a 7.4% rise that exceeds the 4.6% gain of the Nasdaq 100 Index. Microsoft accounts for 7.3% of the S&P 500 Index. The valuation of Microsoft hitting $3 trillion is one of the prime examples of how the top tech companies in the world are using artificial intelligence to boost and expand their operations, cutting costs as revenues rise. The boost in share prices reflects on the enthusiasm of the investors over Microsoft's AI advancements, especially since the company backed OpenAI, the maker of ChatGPT. Microsoft-backed OpenAI is seen as one of the biggest beneficiaries of AI. It has released AI-supported services to customers over the last few years, seeing a major spike in revenue and profits. According to Bloomberg Intelligence data, Microsoft is expected to see a nearly 15 percent rise in revenue in the fiscal year of 2024, which is higher than majority of the companies in this sector. Majority of the analysts tracked by Bloomberg gave Microsoft stock the ‘buy’ rating, making it one of the most popular stocks on Wall Street. (With inputs from Bloomberg)   "
}