{
    "title": "Microsoft Briefly Dethrones Apple To Become World's Most Valuable Company",
    "date": "1/12/2024",
    "url": "https://retailwire.com/microsoft-briefly-dethrones-apple-to-become-worlds-most-valuable-company/",
    "text": "Logout iStock.com/Jean-Luc Ichard January 12, 2024 Lucille Barilla On Thursday, Microsoft briefly dethroned Apple to become the world’s most valuable company. Microsoft claimed the top spot, edging past Apple, whose shares faced a sluggish start in 2024 due to mounting worries about consumer supply and demand in the new year. According to Reuters, “Microsoft’s stock closed 0.5% higher, giving it a market valuation of $2.859 trillion. It rose as much as 2% during the session and the company was briefly worth $2.903 trillion.” In comparison, Apple’s shares dropped by 0.3%, and its stock market value is now at $2.886 trillion. So although Apple reclaimed the top spot by the end of the day, Microsoft overtook it for a short time during trading. Microsoft has incorporated OpenAI’s technology across its productivity software suite, which helped spark a rebound in the July-September quarter. Microsoft is a backer of OpenAI, the maker of ChatGPT, and the creator of the AI platform Copilot. Microsoft is considered to be well-positioned for the AI boom that many investors and analysts view as a near certainty over the next few years. Meanwhile, Apple struggles with weakening demand as its biggest revenue generator is the iPhone. Microsoft briefly overtakes rival Apple as world's most valuable company https://t.co/HGqnuHMXSm Microsoft and Apple have been trading places as the most valuable public company for years. Microsoft surpassed Apple’s market cap in 2021, 2020, and 2018 before Apple once again retook the top spot. Google also briefly took over the top spot from Apple in 2016. Apple was the first company to amass a $1 trillion value in 2018. It has remained the world’s largest company ever since, except for brief periods when Microsoft stole the title, per Sky News. Microsoft’s top ranking was short-lived, like several previous times. However, both companies are still extremely close in value, and Microsoft is blazing a new technology path that Apple will have to keep up with to stay in the lead. “It was inevitable that Microsoft would overtake Apple since Microsoft is growing faster and has more to benefit from the generative AI revolution,” said D.A. Davidson analyst Gil Luria. Recent News In a bid to beat rival platforms like Instagram and TikTok, YouTube has revealed that numerous creators are now monetizing their short videos on the platform and earning a sizable paycheck. Read More A Creator on YouTube Earns $20,000 a Month to Make 1-Minute VideosContinue As the battle to bring the most cost-effective electric vehicles to the market heats up, the Chinese smartphone company Xiaomi announced that its first electric car will go on sale for significantly less than Tesla’s Model 3. Read More Xiaomi Unveils EV $4K Cheaper Than Tesla’s Model 3Continue SpaceX CEO Elon Musk has proposed an ambitious plan to make travel to Mars affordable for the masses. Musk envisions a ticket price of $100,000, believing it could be achievable for most individuals through hard work and saving. Read More SpaceX’s ‘Affordable’ Journey to MarsContinue Kroger, the grocery chain, has announced the closure of three spoke facilities in its e-commerce operations in Texas and Florida. This decision marks a strategic shift for the company in its efforts to streamline operations and enhance efficiency. Read More Kroger Shuts Down E-Commerce Spoke Facilities in Texas and FloridaContinue Retail industry’s premier source for news, analysis, and discussion. © 2023 RetailWire · Privacy Policy · Community Guidelines · Sitemap Username or Email Address Password Remember Me  Lost your password? Don't have an account yet? Sign up "
}