{
    "title": "Microsoft: 1 Reason To Avoid The Stock, And It Isn't OpenAI (NASDAQ:MSFT)",
    "date": "1/10/2024",
    "url": "https://seekingalpha.com/article/4662225-microsoft-1-reason-to-avoid-stock-and-it-isnt-openai",
    "text": "Ben Kriemann/Getty Images Entertainment  Ben Kriemann/Getty Images Entertainment I am bullish on mega-cap tech titans, but I need to make one thing clear: my bullishness does not extend to Microsoft (NASDAQ:MSFT). While the company continues to impress in terms of resilient top-line growth, strong profit margins, return of cash to shareholders, and its positioning for generative AI, I am of the view that the stock is pricing in this optimism - and more. There are arguably signs of irrational exuberance at play, with investors seemingly focusing only on the company’s Bing to take potential in search but ignoring that the company’s Windows has been ceding market share incessantly. MSFT remains one of the highest-quality names in the market today and deserves a premium valuation, but the current multiple makes it very difficult to predict market-beating returns from here. I reiterate my “avoid” rating and recommend investors look towards other mega-cap tech names with higher potential. MSFT was one of the few tech names to suffer relatively modest declines during the 2022 tech crash and soar to all-time highs as of recent trading. Data by YCharts I last covered MSFT stock in September, where I recommended avoiding the stock due to the potential for a “lost decade ahead” (specifically the high likelihood of underperforming the broader market). The stock has returned double-digits since then and does not quite trade at levels worth getting bearish at. I remain of the view that valuation issues will eventually catch up to the stock: you cannot outrun the fundamentals forever. In its most recent quarter, revenue growth was strong at 13% (12% constant currency). It is impressive that MSFT can sustain such resilient growth rates in spite of its large revenue base and the tough macro environment. Due to operating leverage, earnings grew even faster, growing 26% to $2.99 per share. FY24 Q1 Presentation FY24 Q1 Presentation The company’s core productivity and business processes segment, which houses products like Microsoft Word, saw revenues grow 14% constant currency, ahead of guidance for 11% growth. MSFT delivered strong operating leverage in this segment, with operating margins expanding 300 bps to a stunning 53.6%. I suspect that consensus estimates are expecting the rest of the businesses to converge towards this number. FY24 Q1 Presentation FY24 Q1 Presentation Many investors may be drawn to MSFT for its cloud operations, including Azure. Azure grew at a 28% clip, surpassing management’s already-impressive guidance for 25% growth. MSFT appears to be benefitting from its association with OpenAI, as customers are undoubtedly prioritizing generative AI capabilities in their cloud spending decisions. FY24 Q1 Presentation FY24 Q1 Presentation MSFT saw a steep recovery in its “more personal computing” segment, with revenues growing by 2% YoY and operating income by 22%. This segment has proven to be quite cyclical and thus is of lower earnings quality than the rest of the businesses, but remains an important cash generator nonetheless. FY24 Q1 Presentation FY24 Q1 Presentation MSFT ended the quarter with $143.8 billion of cash versus $71.4 billion of debt, in addition to around $13 billion invested in OpenAI (or around $30 billion based on the projected $90 billion stock sale). The strong balance sheet and high profit margins enabled MSFT to generously return cash to shareholders through $4.8 billion of stock repurchases and $5.1 billion of dividends. On the conference call, management noted that cloud optimization trends remain present, but “higher-than-expected AI consumption” more than offset that. Management continues to expect AI to power Azure growth, expecting 26% to 27% constant currency growth from Azure in the next quarter. These are incredible numbers, especially considering that cloud titan peers are not seeing the same strength. Management went on further to guide for “roughly stable” revenue growth for the second half of the fiscal year, again representing an incredible number. I think many investors are expecting a solid recovery in cloud revenues upon a macro recovery, but MSFT is already showing strong cloud results thanks to its first-mover advantage in generative AI. The one potential negative was that management guided for full year operating margins “to remain flat year-over-year,” implying some margin deterioration over the rest of the year given the strong first quarter results. That is not necessarily a bad thing, given that the company is likely investing heavily ahead of the generative AI opportunity, and I wouldn’t rule out the company eventually outperforming on expectations. Consensus estimates call for the company to generate $61 billion in revenue, representing 15.7% YoY growth and representing some sequential acceleration. Analysts expect the company to earn $2.76 in EPS, representing 25.5% YoY growth. Both these targets look achievable given the recovery seen in tech peers. Subsequent to the quarter-end, there was drama at OpenAI which first saw CEO Sam Altman ousted by the board of directors, only to soon return along with a new board of directors. In my view, this drama is not so important as it pertains mainly to the company’s investment in OpenAI, which makes up only a fraction of MSFT’s nearly $3 trillion market cap. Moreover, I view MSFT’s benefits from the OpenAI partnership to be mainly coming from integrating OpenAI capabilities into MSFT’s existing products, something that is unlikely to be affected by leadership turmoil at OpenAI. The important factor to focus on is instead MSFT’s continued ability to execute on sustaining resilient growth rates at Azure. Thus far, we have seen MSFT show an attractive combination of resilient revenue growth alongside margin expansion in spite of a tough macro environment. Those are strong fundamental factors, but fundamental analysis also must include a discussion of valuation. At recent prices, MSFT was trading at a nosebleed 33x earnings, ahead of the company’s 5-year average of 30x earnings, and representing a stark contrast with Alphabet (GOOGL), which trades at a notable discount to its own 5-year average. Many tech companies trade at a discount to pre-pandemic valuations due to both the higher interest rate environment and lingering effects of the 2022 tech crash, but generative AI appears to have powered incremental enthusiasm into MSFT’s stock. Seeking Alpha Seeking Alpha I can make the argument that consensus estimates look very full, if not aggressive, given that MSFT is expected to show minimal deceleration in revenue growth over the coming decade in spite of being projected to generate an astounding $243 billion in full-year revenues this year. The flipside is that earnings estimates may appear conservative if one believes that the company can hit revenue targets, as consensus estimates are factoring in only 170 bps of net margin expansion to 35.9% in 2033. Seeking Alpha Seeking Alpha In my prior report, I showed that using assumptions of 45% long term net margins, 9% revenue growth, and a 1.5x price to earnings growth ratio (‘PEG ratio’), MSFT might trade at around 6.1x sales, implying a stock price of around $503 per share in 2033. That suggests around 3% annual return potential over the next 9.5 years (or around 6% inclusive of the earnings yield). I note that due to me using a 45% long-term net margin assumption, we are not being affected by the possibly conservative consensus estimates for earnings. If we further up our optimism and assume that MSFT trades at 10x sales in 2033, then the stock might trade at around $823 per share, representing around 8.5% annual return potential over the next 9.5 years (or around 11% to 12% inclusive of the earnings yield). If MSFT generates a 40% net margin in 2033 (ahead of consensus estimates), then the stock would be trading at around 25x earnings based on that price target. Some investors might point to the stock of Apple (AAPL) as offering potential support for believing that MSFT can sustain a premium valuation even after maturing for another decade. There are some important differences between the two companies. AAPL’s valuation multiple appears justified by the company’s strong network effects. MSFT clearly has the perception of possessing similar benefits, often being regarded as the Death Star of enterprise tech. I have previously expressed some doubts in regards to that title, though I acknowledge that integrating generative AI into its product suites has likely helped improve its competitive footing. However, I must point out that the company’s dominance of the operating system market has been undermined over the last decade, with AAPL rapidly taking share. It is ironic that just as MSFT is viewed as being a potential disruptor of search versus Alphabet (GOOGL), it may be on the opposite side of that equation with regards to AAPL. Due to the competitive threats, I find it unlikely that MSFT is able to sustain a premium 25x earnings multiple in a decade, and even then the prospective return potential is not so attractive. MSFT is firing on all cylinders as one of the biggest beneficiaries of generative AI. The stock’s current valuation, however, prevents me from endorsing a buy rating - I reiterate my neutral rating as investors are likely to find better opportunities elsewhere among mega-cap tech names. After a historic valuation reset, the growth investing landscape has changed. Get my best research at your fingertips today. Get access to Best of Breed Growth Stocks:  This article was written by Julian Lin is a financial analyst. He finds undervalued companies with secular growth that appreciate over time. His approach is to look for companies with strong balance sheets and management teams in sectors with long growth runways. Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I am long all positions in the Best of Breed Growth Stocks Portfolio. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}