{
    "title": "Microsoft Launches New Partner Benefits Packages",
    "date": "1/22/2024",
    "url": "https://www.crn.com/news/cloud/2024/microsoft-launches-new-partner-benefits-packages-with-copilot-access-azure-credits",
    "text": "Microsoft launches new benefits for partners with access to Copilot, AI, GenAI, Azure tools.  Microsoft has started to roll out three types of partner benefits packages aimed at solution providers at different growth stages, with the packages including access to Microsoft Sales Copilot, product licenses, Azure credits and more. The three packages are Partner Launch Benefits, Partner Success Core Benefits and Partner Success Expanded Benefits, according to the Redmond, Wash.-based tech giant. Monday marks the availability of the packages in major markets, with the packages expanding to most other locations by the end of March. “With the amount of innovation that Microsoft is releasing into the market, particularly around our AI workloads, it's really important that we continue to deliver benefits that support our partners’ growth and to ultimately help deliver success to their customers,” Julie Sanford, Microsoft’s vice president of partner go-to-market (GTM), programs and experiences, told CRN in an interview. [RELATED: Microsoft 365 Copilot Goes GA, Bringing GenAI To Enterprise Customers] Microsoft has about 400,000 channel partners worldwide, according to CRN’s 223 Channel Chiefs. The packages complement the core and expanded benefits already available to partners with the Microsoft “solutions partner” designation and independent software vendors in the ISV Success program, according to the vendor. Sanford (pictured above) said that new and existing Microsoft solution providers can also leverage these benefits packages as stepping stones as they work toward earning designations. Microsoft solution providers building their first offering or expanding capabilities should find a package relevant to their business, according to the vendor. Partner Launch Benefits is focused on product discovery and testing. Partner Success Core Benefits has more robust tools and support. And Partner Success Expanded Benefits is aimed at larger scaling. “We wanted to make sure that we were providing offers for each and every” partner, Sanford said. “We really wanted to make sure we had offers in market that met the partner where they are.” Here is a breakdown of the three different packages: Partner Launch Benefits Success Core Benefits Success Expanded Benefits Solution providers can buy each benefits package individually and on top of existing benefits. Partners don’t have to start with the basic Launch Benefits package to buy a higher-tier package, according to the vendor. Each package has the Microsoft Sales Copilot tool aimed at bringing generative AI (GenAI) to customer interactions. The packages also have the Copilot tool formerly known as Bing Chat and Bing Chat Enterprise. The packages also have product licenses, credits for the Microsoft Azure cloud offering and capabilities for building, testing and delivering customer offerings, according to the vendor. Speaking of Microsoft’s Signature Cloud Support benefit, the vendor provided an update Monday saying that SCS for Solutions Provider designated partners or partners with gold and silver legacy benefits packages will no longer be unlimited “as a result of our regular assessment of market conditions and the competitive landscape.” Starting July 1, on a partner’s anniversary date, the partner will be limited to 50 SCS incidents a year. The change happens when partners renew their designation or legacy benefits package. Microsoft promised that “additional details will be shared in the coming months.” The new benefits packages come on the heels of the vendor making its Copilot for Microsoft 365 GenAI offering available for solution providers in the Cloud Solution Provider (CSP) program to sell to customers. Customers with Office 365 E3 and E5 licenses can also purchase Copilot for M365. Microsoft also dropped the 300-seat minimum for M365 Copilot, making the offering more available to smaller businesses and organizations, and expanded Semantic Index for Copilot to O365 E3 and E5 licenses. That Index tool is needed for relevant, actionable responses to Copilot prompts, according to the vendor. Even without that minimum, customers do need a product license for one of the prerequisite base stock-keeping units (SKU) for each seat of Copilot for M365 they purchase, according to the vendor. Sanford said that the new partner benefits packages come amid more investment from the vendor in workshops and bootcamps around Copilot and other AI offerings. “We've seen a tremendous amount of excitement from our partner ecosystem engaging in that content as well,” she said. “So we see the partner offerings and the benefits that they get out of these packages really complementing all of that support we're doing from an enablement perspective.” Sanford advised that Microsoft solution providers early in their AI adoption or customers’ AI adoption look to the available AI transformation playbook and other resources on the partner portal. Solution providers who find areas where Copilot helps them internally can turn those into external customer offerings, she said. Customer organization boards have also shown support for AI use cases with demonstrable returns on investment within 12 months, such as automating manual tasks, for example. "
}