{
    "title": "Microsoft's Diversity Report Reveals Racial Pay Gaps: An Unsettling Insight",
    "date": "2/23/2024",
    "url": "https://www.mrctv.org/blog/nick-kangadis/isnt-illegal-microsoft-openly-brags-about-paying-white-people-men-less",
    "text": "Imagine bragging about your own innate racism in a report to shareholders about how diverse and inclusive your company is and continues to strive to be. Also, imagine bragging about discriminating against one race and one gender of people as if it were somehow virtuous. That company? Microsoft. In their 2023 Global Diversity & Inclusion Report, in the section “Pay equity,” Microsoft actually admits paying “all racial and ethnic minority groups” more than “white employees…with the same job title and level and considering tenure.” They even go so far as to break down how much more each minority and ethnic group makes more than white employees. “As of September 2023, inside the US, all racial and ethnic minority groups who are rewards eligible combined earn $1.007 total pay for every $1.000 earned by US rewards-eligible white employees with the same job title and level and considering tenure. Specifically, for those who are rewards eligible, US Black and African American employees earn $1.004; Hispanic and Latinx employees earn $1.004; and Asian employees earn $1.012 for every $1.000 earned by US rewards-eligible white employees with the same job title and level and considering tenure.” Sure, the difference in pay between people in minority and ethnic groups is about a fraction of a penny more than their white counterparts, but if the difference were insignificant, why brag about it? But, that’s not all. If you’re a white man, you’re really getting the shaft. Related: Racist Doc Wants to 'Take' Part of White Men's Salaries & Give to Black Women Microsoft also breaks down how women are paid more than men. “As of September 2023, outside the US, women who are rewards eligible earn $1.003 total pay for every $1.000 earned by men who are rewards eligible with the same job title and level and considering tenure in these combined geographies.” This is what I’ve been saying since leftists, establishment hacks in the propaganda media, activists and corporations began using the term “equity.” “Equality” means equal opportunity for all, while “equity” means equal outcomes — except in this case, apparently. In this case, Microsoft’s version of “equity” means screw whitey — oh, and men. Also, and this might not be important at all — but isn’t this kind of discrimination illegal? Actually, it is. According to the U.S. Equal Employment Opportunity Commission’s website, the text on “Race/Color Discrimination & Work Situations states the following: “The law forbids discrimination when it comes to any aspect of employment, including hiring, firing, pay, job assignments, promotions, layoff, training, fringe benefits, and any other term or condition of employment.” You can view Microsoft’s full report here. H/T: Libs of TikTok  Follow Us On X Colombia & China top the list of criminal invaders entering America along the San Diego border.https://t.co/5rJfa4YnMs The mission of the Media Research Center is to document and combat the falsehoods and censorship of the news media, entertainment media and Big Tech in order to defend and preserve America's founding principles and Judeo-Christian values. The MRC is a research and education organization operating under Section 501(c)(3) of the Internal Revenue Code, and contributions to the MRC are tax-deductible. Sign up for our MRCTV Daily newsletter to receive the latest news. "
}