{
    "title": "Microsoft Fixes Bug That Replicated Chrome Tabs And Browsing Data Without \nUser Consent; Heres What Company Said",
    "date": "2/16/2024",
    "url": "https://english.jagran.com/technology/microsoft-fixes-bug-that-replicated-chrome-tabs-and-browsing-data-without-user-consent-here-is-what-company-said-10134110",
    "text": "Microsoft has announced an update for its Edge browser to fix a bug that imported tabs and browsing data of users from Google Chrome without permission. The setting in the previous case was not syncing correctly across devices which led to the malfunctioning of automatic imports, Microsoft noted. Redmond-headquartered tech giant Microsoft has announced an update for its internet browser Edge to fix a bug that imported tabs and browsing data of users from Google Chrome without permission. In one case, the bug opened the tabs in the Edge browser which were otherwise active in Chrome after a routine Windows update restart, according to The Verge. While the company did not share a statement with the news outlet in the past, the bug was recently fixed in the stable build update.  \nThe setting in the previous case was not syncing correctly across devices which led to the malfunctioning of automatic imports. In the past, the company has also adopted tactics such as pinning Edge to the Windows taskbar without user consent and prompts that ask you to stick with Microsoft's offering when you head out to download Google Chrome from the internet browser. \n\nAlso Read: Copilot In Microsoft Shopping To Review Summaries, What's New In Microsoft Edge's AI Suite | Know Here  \n\"Edge has a feature that provides an option to import browser data on each launch from other browsers with user consent. This feature's state might not have been syncing and displaying correctly across multiple devices. This is fixed,\" Microsoft said. The Stable Channel update will roll out \"over one or more days.\"  \nThe update to address the sync issue will roll out for all Microsoft Edge users soon. (Image:Microsoft)\nOn a related note, Firefox maker Mozilla recently commissioned a research note to investigate the tactics adopted by the Windows maker to encourage its Edge browser. The report noted that the company adopted several ways such as opening links in Edge once a user clicks on a link from the Windows Widgets or search results. \nAlso Read: Microsoft To Bring 'Next Wave Of AI Innovation' With These Cutting-Edge Features In New Bing\nAmong the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google. The setting in the previous case was not syncing correctly across devices which led to the malfunctioning of automatic imports. In the past, the company has also adopted tactics such as pinning Edge to the Windows taskbar without user consent and prompts that ask you to stick with Microsoft's offering when you head out to download Google Chrome from the internet browser. \n\nAlso Read: Copilot In Microsoft Shopping To Review Summaries, What's New In Microsoft Edge's AI Suite | Know Here  \n\"Edge has a feature that provides an option to import browser data on each launch from other browsers with user consent. This feature's state might not have been syncing and displaying correctly across multiple devices. This is fixed,\" Microsoft said. The Stable Channel update will roll out \"over one or more days.\"  \nThe update to address the sync issue will roll out for all Microsoft Edge users soon. (Image:Microsoft)\nOn a related note, Firefox maker Mozilla recently commissioned a research note to investigate the tactics adopted by the Windows maker to encourage its Edge browser. The report noted that the company adopted several ways such as opening links in Edge once a user clicks on a link from the Windows Widgets or search results. \nAlso Read: Microsoft To Bring 'Next Wave Of AI Innovation' With These Cutting-Edge Features In New Bing\nAmong the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google. Also Read: Copilot In Microsoft Shopping To Review Summaries, What's New In Microsoft Edge's AI Suite | Know Here  \n\"Edge has a feature that provides an option to import browser data on each launch from other browsers with user consent. This feature's state might not have been syncing and displaying correctly across multiple devices. This is fixed,\" Microsoft said. The Stable Channel update will roll out \"over one or more days.\"  \nThe update to address the sync issue will roll out for all Microsoft Edge users soon. (Image:Microsoft)\nOn a related note, Firefox maker Mozilla recently commissioned a research note to investigate the tactics adopted by the Windows maker to encourage its Edge browser. The report noted that the company adopted several ways such as opening links in Edge once a user clicks on a link from the Windows Widgets or search results. \nAlso Read: Microsoft To Bring 'Next Wave Of AI Innovation' With These Cutting-Edge Features In New Bing\nAmong the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google. Also Read: Copilot In Microsoft Shopping To Review Summaries, What's New In Microsoft Edge's AI Suite | Know Here  \n\"Edge has a feature that provides an option to import browser data on each launch from other browsers with user consent. This feature's state might not have been syncing and displaying correctly across multiple devices. This is fixed,\" Microsoft said. The Stable Channel update will roll out \"over one or more days.\"  \nThe update to address the sync issue will roll out for all Microsoft Edge users soon. (Image:Microsoft)\nOn a related note, Firefox maker Mozilla recently commissioned a research note to investigate the tactics adopted by the Windows maker to encourage its Edge browser. The report noted that the company adopted several ways such as opening links in Edge once a user clicks on a link from the Windows Widgets or search results. \nAlso Read: Microsoft To Bring 'Next Wave Of AI Innovation' With These Cutting-Edge Features In New Bing\nAmong the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google. \"Edge has a feature that provides an option to import browser data on each launch from other browsers with user consent. This feature's state might not have been syncing and displaying correctly across multiple devices. This is fixed,\" Microsoft said. The Stable Channel update will roll out \"over one or more days.\"  \nThe update to address the sync issue will roll out for all Microsoft Edge users soon. (Image:Microsoft)\nOn a related note, Firefox maker Mozilla recently commissioned a research note to investigate the tactics adopted by the Windows maker to encourage its Edge browser. The report noted that the company adopted several ways such as opening links in Edge once a user clicks on a link from the Windows Widgets or search results. \nAlso Read: Microsoft To Bring 'Next Wave Of AI Innovation' With These Cutting-Edge Features In New Bing\nAmong the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google. The update to address the sync issue will roll out for all Microsoft Edge users soon. (Image:Microsoft)\nOn a related note, Firefox maker Mozilla recently commissioned a research note to investigate the tactics adopted by the Windows maker to encourage its Edge browser. The report noted that the company adopted several ways such as opening links in Edge once a user clicks on a link from the Windows Widgets or search results. \nAlso Read: Microsoft To Bring 'Next Wave Of AI Innovation' With These Cutting-Edge Features In New Bing\nAmong the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google. On a related note, Firefox maker Mozilla recently commissioned a research note to investigate the tactics adopted by the Windows maker to encourage its Edge browser. The report noted that the company adopted several ways such as opening links in Edge once a user clicks on a link from the Windows Widgets or search results. \nAlso Read: Microsoft To Bring 'Next Wave Of AI Innovation' With These Cutting-Edge Features In New Bing\nAmong the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google. Also Read: Microsoft To Bring 'Next Wave Of AI Innovation' With These Cutting-Edge Features In New Bing\nAmong the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google. Among the recent tweaks in the search browser include the Copilot AI chat engine with default integration in the UI. While it might help some users, the other group who prefers a different search engine will get better independence with the arrival of the Digital Markets Act (DMA) in the EU. The new draft legislation will let users of Windows 11 remove the Edge browser and extend more controls to alternative search services from providers like Google.   Jagran English brings you all the latest and breaking news from India and around the world. Get live English news from India, World, Politics, Entertainment, Lifestyle, Business, Education, Sports, Technology, and much more. Follow english.jagran.com to stay updated with the latest English news. Copyright © 2023 Jagran Prakashan Limited. "
}