{
    "title": "Microsoft Employee Feedback Improves Teams Premium",
    "date": "2/9/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/making-microsoft-teams-premium-better-for-customers/",
    "text": "How Microsoft does IT Feb 9, 2024\t\t\t\t\t  |  Angela Gamba Microsoft Teams Premium is an exciting new offer for Microsoft customers with enhanced features and the latest AI-powered technologies. It provides a seamless, one-stop shop experience to improve any kind of Microsoft Teams meeting from personal one-on-one discussions to large-scale events or webinars. The aim of the new Microsoft Teams Premium experience is to make any Microsoft Teams meeting more personalized, intelligent, and secure. But to ensure these features are indeed a value-add for our customers, Microsoft employees must first use and test them extensively to understand the additional benefits they bring. After using some of the initial Teams Premium capabilities internally, with the latest technologies including AI-powered language models, Teams Premium is going to provide a real advantage for users. It offers a set of solutions that makes Microsoft Teams meetings highly customizable and intelligent. —Sara Bush, principal PM manager, Microsoft Digital Employee Experience For the past several months, Microsoft Digital Employee Experience, the company’s IT organization that is responsible for serving as Customer Zero for Microsoft products, along with the Teams product group, have been working together to ensure Microsoft Teams Premium lives up to its promise and provides an enriched set of features for our customers. “After using some of the initial Teams Premium capabilities internally, with the latest technologies including AI-powered language models, Teams Premium is going to provide a real advantage for users,” says Sara Bush, a principal PM manager in Microsoft Digital Employee Experience. “It offers a set of solutions that makes Microsoft Teams meetings highly customizable and intelligent.” How to get started with Microsoft Teams Premium: Get Started with Microsoft Teams Premium – Microsoft Community Hub To learn more about Microsoft Teams Premium, I spoke with several Microsoft employees who have been at the forefront of testing the new capabilities and are some of the early users to find out more about the new features and additional benefits. Virtual Microsoft Teams meetings have allowed more people than ever to connect, engage, learn, and collaborate. Currently, within a regular Teams meeting, you can easily follow along with who’s talking with speaker-attributed live captions and transcription. But what happens if you are presenting to people who don’t speak the same language as you? How do you ensure the conversation is seamless and easy for them to understand? The new live translation for captions capability delivers AI-powered, real-time translations from 40 spoken languages so meeting participants can read captions in the language that they prefer most. This is thanks to the help of Microsoft Azure Cognitive Service Speech Translation. For instance, if the meeting organizer has Microsoft Teams Premium, then all meeting attendees can enjoy live translated captions. This capability helps break down language barriers, putting participants at ease and allowing for a more productive and frictionless experience. “Live translated captions is a real game changer, especially for large, global companies,” says Jan Steberl, a product manager in the Microsoft Teams product group. “This feature really puts all meeting participants on an even playing field, no matter what their language of choice is or where they are located. For someone like me, who is based in the Czech Republic and participates in virtual Teams meetings with colleagues from all over the world, it really has been a difference maker.” Building upon the basic webinar functionality available in Microsoft Office 365 and Microsoft 365 offerings, with advanced webinar in Microsoft Teams Premium, users get the familiar and secure experience of Microsoft Teams combined with new host and event management controls that make it easier to connect with your audience. Whether presenting a keynote, training new employees, or showing off a new product to customers, the advanced webinar capabilities deliver a high-quality experience that improves overall event logistics. Building upon the basic webinar capabilities in Microsoft Teams today, with the new registration waitlist and manual approval capability within Microsoft Teams Premium, the registration experience is now a lot more robust. Enabling the waitlist will allow the event organizer to keep webinar registration open (even after the event has reached capacity), allowing additional people to register and be automatically added to the waitlist. As new spots open, people are automatically moved to the pending approval state, enabling the organizer to approve or reject the additional registrants. In addition, organizers can customize the start and end time and specify when they want registration to start and end, making it much easier to manage an event. Remember pre-COVID days, when presenters used to gather with the event host in the physical green room to go through a dry run or hammer our last-minute details of an event? With virtual green room, the host and participants are still able to connect and manage all the behind-the-scenes action prior to the meeting start. “Anyone who plans virtual events, team meetings, or presentations knows that there are always eleventh-hour changes leading right up to the start, so the addition of the green room has been a much-needed, welcome feature,” says Michelle Strub, an executive and internal communications lead in Microsoft Digital Employee Experience. “It allows presenters a dedicated space, separate from attendees, to hash those final details out, socialize, monitor the chat or Q&A window, and manage what attendees see before the event begins.” For more information on how to manage the meeting experience go to: Manage your meeting presentation experience for sensitive Microsoft Teams meetings. And the benefits of green room are there for the attendees of the event as well! As attendees wait for the meeting to get started, green room will provide a welcome screen, and participants can use the chat and Q&A windows to engage with each other or prepare questions for the upcoming presenters. End-to-end encryption and confidentiality settings Managing and protecting confidential information in virtual meetings is now much more secure thanks to some of the end-to-end encryption features and advanced meeting protection available in Microsoft Teams Premium. For those extremely sensitive meetings that require disabling some of the features for an advanced security option, users can apply end-to-end encryption (E2EE) to the meeting. Data is always secure within Microsoft Teams, but there may be some customers that need an extra layer of protection for ultra-sensitive business topics that Microsoft Teams Premium now provides. Upgrading safeguards for confidential business meetings, like watermarking to deter information from being leaked or limiting who can record a meeting, gives customers the additional assurance they need to keep a virtual meeting private. With Microsoft Teams Premium, meeting organizers can leverage unique watermarks over attendees’ screen shares and video feeds to confidently display and present any confidential information. In addition to the added benefits you get with Teams Premium, I see it providing a real opportunity for customizing and securing the meeting experience for our customers. Given the myriad capabilities to set options, brand visuals, and even templates for meeting types, it is a huge value-add. —Chanda Jensen, senior product manager, Microsoft Digital Employee Experience “These new features are really good for those who are obsessed with security,” says Hongsik Choi, a principal program manager in the Microsoft Autonomy, Space, Critical Industry and Innovation (ASCII) group. “Customers who prioritize security in general tend to worry about the security of online virtual meetings, but end-to-end encryption is very useful and provides that next level security layer for audio, video, and shared screen.”  Through intense internal testing and use and by incorporating the latest in AI-powered capabilities, Microsoft employees are ensuring that Microsoft Teams, and specifically the new Microsoft Teams Premium offering, provides customers with the solutions they need to adapt to the ever-changing workplace environment and improve their organization’s productivity. The increased security, personalization, and modern technology that comes with Teams Premium makes the new offering a no-brainer for customers trying to up their game when it comes to communication, collaboration, and managing virtual meetings. The additional investment will be a boost to our customers, supporting the new ways of working, securely collaborating, and personalizing their enterprise experience. “In addition to the added benefits you get with Teams Premium, I see it providing a real opportunity for customizing and securing the meeting experience for our customers,” says Chanda Jensen, a senior product manager in Microsoft Digital Employee Experience. “Given the myriad capabilities to set options, brand visuals, and even templates for meeting types, it is a huge value-add.” Since its launch six years ago, Microsoft Teams continues to innovate at a rapid pace. With the introduction of Microsoft Teams Premium and with new features continuing to roll out, we can feel confident that the feedback we’re providing as Customer Zero for Microsoft will only continue to fuel the innovation and keep the bar very high for Microsoft Teams solutions for years to come.  Tags: Employee Experience, Microsoft Teams Mar 29, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tAngela Gamba The use of business applications in Microsoft Teams has become a strategic advantage for many organizations, as they can accelerate the digital transformation of all business areas, generating a high demand for the Information Technology (IT) team to make these applications available. While use of apps for Microsoft Teams can be daunting for IT Teams... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Our core system for managing our external workforce was showing its age in an increasingly demanding modern workplace environment—we needed to simplify our external staff management. Here at Microsoft, our large and diverse external, non-FTE workforce plays a vital role in our success. For us, external staff includes contractors, consultants, freelancers, and business guests who... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Microsoft runs on Microsoft technology. We are the proving ground for our products and when we say that software is enterprise-ready this means that we have already built it for and run it at scale in our own enterprise. We are in the business of building the future of technology. And more often than not,... Mar 25, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tInside Track staff Next-generation connectivity is enabling us to transform our internal enterprise network here at Microsoft. Deploying a more agile, secure, and effective network environment across Microsoft is empowering our employees to thrive in our new hybrid world. This article describes how we’re implementing this new network strategy, including goals, action areas, expected results, and a brief... New hybrid meeting experiences are coming to Microsoft’s employees and guests, a Microsoft Teams Rooms-powered transformation that will save space at the table for everyone, no matter where they join from. Thanks to new meeting room layouts, improved technology, and better integration with Microsoft Teams, remote participants will feel more included in meetings that will...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more New Microsoft Teams-powered hybrid meeting room technology is helping us design new experiences for our employees and vendors here at Microsoft and helping customers understand how to achieve these experiences for themselves. “We want to create an environment that is halfway between the physical and virtual,” says Matt Hempey, a principal program manager with Microsoft...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more At Microsoft, we’re transforming the meeting experience to encourage collaboration and increase productivity. At the beginning of the COVID-19 pandemic, the shift to predominantly remote meetings inspired our Microsoft Digital Employee Experience (MDEE) team to examine what makes an effective meeting in which everyone feels included. We then used this research to develop the Microsoft...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}