{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.barrons.com/news/eu-to-examine-microsoft-french-ai-mistral-partnership-55daebb4",
    "text": "This copy is for your personal, non-commercial use only. To order presentation-ready copies for distribution to your colleagues, clients or customers visit http://www.djreprints.com. https://www.barrons.com/news/eu-to-examine-microsoft-french-ai-mistral-partnership-55daebb4 Microsoft's partnership with French startup Mistral AI faces inspection by EU regulators, who are already probing the world's largest digital companies' ties to AI developers, the EU said Tuesday. Microsoft said Monday it sealed a \"multi-year partnership\" that would allow Mistral to use its platforms including Azure AI, which enables businesses to build apps using AI. A Microsoft spokesperson said the company was pouring 15-million-euros ($16 million) into the collaboration with Mistral. Mistral, established last year by former Google and Meta researchers, is a rare European player in a field dominated by US firms. A spokesperson for the European Commission, which is the EU's powerful antitrust regulator, said it would look into the new partnership. \"As you know, the commission is looking into agreements that have been concluded between large digital market players and generative AI developers and providers,\" the spokesperson said. \"In this context, we have received the mentioned agreement, which we will analyse,\" the spokesperson added. While this could lead to a formal investigation, it is still early days. Microsoft did not comment on the commission's statement. The commission in January started a preliminary study of Microsoft's multi-billion-dollar investment in ChatGPT developer OpenAI to see if it could be a disguised merger. Britain is also conducting a similar study. When ChatGPT burst onto the scene in late 2022, it heralded the popular arrival of the generative AI revolution, and saw the EU race to approve the world's most comprehensive law regulating the technology. Generative AI can produce text, images and audio that are often indiscernible from those made by humans. The EU's AI law is expected to be formally adopted later this year. raz/ec/gv Microsoft's partnership with French startup Mistral AI faces inspection by EU regulators, who are already probing the world's largest digital companies' ties to AI developers, the EU said Tuesday. An error has occurred, please try again later. Thank you This article has been sent to  Copyright ©2024 Dow Jones & Company, Inc. All Rights Reserved This copy is for your personal, non-commercial use only. Distribution and use of this material are governed by our Subscriber Agreement and by copyright law. For non-personal use or to order multiple copies, please contact Dow Jones Reprints at 1-800-843-0008 or visit www.djreprints.com. "
}