{
    "title": "From Sarvam AI to Open Healthcare Network, AI-based solutions to real-world \nproblems",
    "date": "2/8/2024",
    "url": "https://www.forbesindia.com/article/news/from-sarvam-ai-to-open-healthcare-network-aibased-solutions-to-realworld-problems/91341/1",
    "text": "Naini is a writer at Forbes India, who likes to dabble in storytelling across all forms of media. She writes on various topics ranging from innovation and startups to cryptocurrency and agricultureâ\u0080\u0094anything and everything that makes for an interesting story. Before her stint at Forbes India, she worked for close to a year at Outlook Business. With five years of work experience, she co-produces Forbes Indiaâ\u0080\u0099s video series â\u0080\u009cFrom The Fieldâ\u0080\u009d and hosts the podcast â\u0080\u009cTeenpreneursâ\u0080\u009d. She also emcees at events and moderates panel discussions from time-to-time. Naini is a part of Forbes Indiaâ\u0080\u0099s digital team, also handles Forbes Indiaâ\u0080\u0099s Instagram account and helps plan events. An avid learner, she has completed her PGDM in Journalism from Xavier Institute of Communication and Bachelorâ\u0080\u0099s of Mass Media from Sophia College for Women in Mumbai. Be it at work or home, you will not find her working without her headphones and work playlist. She loves trekking and travelling, experimenting in the kitchen, watching films and reading. At the Microsoft AI Tour event, the company hosted a select developer showcase to give an overview of how Indian developers are discovering opportunities in AI to solve global challenges; Image: Shutterstock For hassle free instant subscription, just give your number and email id and our customer care agent will get in touch with you OR click here to Subscribe Online Jharkhand government spruces up education system Photo of the day: Indonesia Fashion Week Jharkhand government implements schemes for social upliftment From Mazgaon Dock's defence ambition to India's T20 future, here are our top stories of the week New York City congestion toll approved for part of Manhattan A time capsule of humanity is being sent to the Moon Indian companies should focus on high value manufacturing: Vijay Govindarajan Polycab, Motilal Oswal, Bira91 among latest companies to be hit by ransomware attacks Bitwise files spot Ethereum ETF application with the SEC Photo of the day: Good Friday procession 65 percent passengers paid extra to reserve a seat on the plane in the past year: Survey Ex-Gucci star Alessandro Michele named Valentino creative director Climate change is messing with how we measure time: study How Safeena Husain has ensured over a million girls stay in school How Ruchira Gupta has dedicated her life to helping sex-trafficking survivors "
}