{
    "title": "Executive pay cuts wouldn't prevent layoffs, ex-Microsoft HR VP says",
    "date": "2/1/2024",
    "url": "https://www.businessinsider.com/executives-pay-cuts-dont-avoid-prevent-layoffs-2024-2",
    "text": "       With all the layoffs in the news we're seeing, there's always the question: Why don't the highly paid executives take a pay cut? Couldn't they trim their massive pay packages and save some jobs? In my more than 40 years in business, including being the vice president of human resources for Microsoft, I've seen more than a few layoffs. This observation is a fair one. The executives in charge never seem to pay a price for the pain they cause, and here are several reasons. One reason, the reason executives most commonly use to justify it to themselves, is simple math. Cutting their salary wouldn't make a significant impact. Take Google or Microsoft, two companies with very similar math. These companies both have about 200,000 employees. Both have laid off somewhere around 10,000 employees in the past year or so. And both CEOs are paid similar amounts, with salaries of about $2 million a year. For these companies, cutting 10,000 employees saves them about a billion dollars a year in costs. Cutting the CEO's salary entirely would save just 0.2% of that. The math is so large that executives like to point out that cutting their salary wouldn't even put a dent in the problem. But wait, you protest, Google's Sundar Pichai made more than $200 million last year! And Microsoft's Satya Nadella made almost $50 million in 2022! That's what makes the news, but it's really not what's happening. They weren't paid these amounts; they were given stock grants. Grants that vest (become exercisable) over a period of time. Sundar's for example, vests over three years. If Google's stock price were to plummet, so would his compensation. But it soared, up by about 50% in the past year. Sundar did exceptionally well. These kinds of grants are common in executive compensation because the companies like them. The stock doesn't cost the company this money out of pocket. Accounting magic makes these kinds of grants very cheap for the firm. More importantly, boards see handcuffing the executive to the stock-price roller coaster as a good thing. If the CEO doesn't fix the cost problem, their compensation takes a huge hit. If they take action that increases the company's value and its stock price, everyone wins. Or at least all the stockholders win, which includes the executive, the board, many employees, and investors. Related stories Much like the salary, because these grants don't affect the current bottom line, cutting them won't save the money they need to trim. The company, the board, and the CEO will say when asked that it wouldn't make a dent in the problem. Another factor is the fierce competition for talent for these executive positions. Much like in the sports world, very few people can play at this level. Precious few executives have the experience to lead nearly trillion-dollar companies with hundreds of thousands of employees and operations on a global scale. Like star athletes, those who can perform at this level look to their peers. They compare and contrast, often with envy. There's a reason base compensation in the Fortune 500 is very similar. The talent competition is tight, and those who play at that level know their worth. The difference, then, is the stock package and the stock price — just what the boards of these companies want. They want to be able to hire a star, load them up with stock, and say, \"Make the stock soar, and you'll be handsomely rewarded.\" The last thing boards of companies facing cost pressure want to do is cause their leaders to go looking. Cutting the compensation — making it not competitive with their peers — would do just that. It's something they don't want to risk. The problem with this purely economic discussion, however, is that it misses the entire point. These CEOs are supposed to be leaders. They're supposed to be setting a new course, and they're supposed to be models of behavior for the organization. If the company is going through pressure, and if things are so bad that people are losing their jobs, shouldn't the CEOs share the pain? Of course they should. Some have, under public pressure, made public commitments to do better. Sundar Pichai committed a year ago to lower his pay, but as I already mentioned, his total compensation this past year was over $200 million. Tim Cook at Apple publicly requested his stock grant be cut in half — to $40 million. His base pay of $3 million and bonus of $6 million were unchanged. But most don't. They'll make all the excuses above, justifying it to themselves, their boards, and their stockholders. Then they'll turn to the company and make impassioned speeches about how hard this all is, how sad it is to see people go, and how they wish there were other options. Most of all, they'll talk about how we're all in this together, working for a stronger company tomorrow, then smile while they cash the checks and sell their stock. Chris Williams is the former VP of HR at Microsoft. He's an executive-level advisor and consultant with more than 40 years of experience leading and building teams. On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Read next Jump to "
}