{
    "title": "Microsoft's Activision Blizzard Acquisition Leads To Growth Despite High \nCosts (MSFT)",
    "date": "2/7/2024",
    "url": "https://seekingalpha.com/article/4668440-microsofts-activision-blizzard-acquisition-leads-to-long-term-growth-despite-high-costs",
    "text": "NurPhoto/NurPhoto via Getty Images NurPhoto/NurPhoto via Getty Images Microsoft's (NASDAQ:MSFT) Activision Blizzard acquisition has meant high short-term costs, but due to Microsoft's liquidity, it has had a minimal effect on its balance sheet. As such, the net long-term benefit for Microsoft as a result of the deal reiterates my Buy investment case for MSFT shares at this time, even considering valuation and company risks specific to Activision Blizzard. Microsoft first announced its intent to acquire Activision Blizzard in January 2022 for $95 per share in an all-cash transaction. The value of the acquisition was expected at $68.7 billion including Activision Blizzard's net cash. Concerns were raised by the UK's Competition and Markets Authority due to the impact of the acquisition on cloud game streaming. Therefore, Microsoft restructured the deal. It transferred the streaming rights for all Activision Blizzard games released over the next 15 years to Ubisoft (OTCPK:UBSFY). Microsoft officially acquired Activision Blizzard in October 2023 for $75.4 billion, and it incorporated it into its gaming sector. The move brought international bestsellers like Call of Duty, World of Warcraft, and Candy Crush Saga into Microsoft's portfolio. Microsoft announced 1,900 layoffs within its Activision Blizzard and Xbox divisions in January 2024, around 8.6% of its gaming sector employees. The intent is to streamline operations after the acquisition. Following the deal, Blizzard's president at the time, Mike Ybarra, also stepped down. Bobby Kotick, the former CEO of Activision Blizzard, left the company officially in December 2023. Bobby Kotick wrote a letter of appreciation and expressed his sincere positive outlook on Activision Blizzard's future under Microsoft's leadership. Notably, in 2024, Activision Blizzard is set to launch The War Within, which will be its first installment in The Worldsoul Saga series for World of Warcraft. These are game expansions that should draw significant attention from both existing and new fans. World of Warcraft is ranked #1 out of 140 Massively Multiplayer Online games for server and player populations. As of the most recent data, the total player base is 135.17 million with 1.28 million daily players estimated. There is also much anticipation about Activision Blizzard titles arriving on Xbox Game Pass (its gaming subscription service) following the acquisition. However, the scope and timing of this remains speculative at this stage. There is uncertainty amongst gaming fans that Call of Duty may not come to Xbox Game Pass, and while Microsoft has hinted that it will be sharing more about its future of Xbox soon, the early stages after Activison was acquired have not given too much away. The synergy between Activision and Xbox will be paramount to Microsoft's efficiency and revenue generation in its gaming division. The video game industry is going through an evolution of live-service, and the impact of generative AI will likely affect the production of games in the future significantly. Microsoft is the most well-financed and arguably the strongest positioned to take existing titles from Activision that have been successful and evolve them with more advanced technologies as time progresses. Xbox Game Pass has particular significance, often being described as the 'Netflix (NFLX) for gaming', and its integration of Activision Blizzard titles will be paramount to its long-term success in the area. Statista notes that the global video game market could reach $282.3 billion in revenue in 2024 and then grow at an annual rate of 8.76% from 2024 to 2027, with an expected market volume of $363.2 billion by 2027. It also presents that the number of video game users could be 1.472 billion by 2027. Fortune Business Insights reports a projected $665.77 billion global gaming market size by 2030. This significant potential growth is fundamental to why Activision Blizzard was a timely investment for Microsoft to make. Revenue by Market, Updated November 2023 (Statista) Revenue by Market, Updated November 2023 (Statista) Microsoft ($3 trillion market cap) will face competition challenges from Tencent (OTCPK:TCEHY) ($356 billion market cap), Sony (SONY) ($119.3 billion market cap), Nintendo (OTCPK:NTDOY) ($66 billion market cap), Electronic Arts (EA) ($36.4 billion market cap), and Take-Two Interactive Software (TTWO) ($28.3 billion market cap), among many others. As such, Microsoft will have to make sure to retain the elements of Activision's success that made its titles so popular whilst also allowing for suitable integration with Microsoft's successful strategies that have worked for its Xbox gaming divisions. Microsoft has already reported significant growth in its gaming revenue as a result of the Activision Blizzard acquisition. For Microsoft's quarter ending December 31, 2023, the company reported a 61% YoY growth in Xbox revenue, attributing 55 percentage points to the Activision acquisition. We can see the significant cash acquisition cost on the cash flow statement for the last trailing twelve months, indicating the significant impact on a much lower net change in cash of $1.66 billion in the last twelve months as opposed to in June 2023, when a $20.77 billion net change in cash was reported. Seeking AlphaSeeking Alpha Seeking Alpha Seeking Alpha As of the last report, the company still has cash and short-term equivalents of $80.98 billion, which is lower than historically but still very high. This shows the considerable security on Microsoft's balance sheet even after an acquisition of this size. The Activision Blizzard acquisition was the largest gaming acquisition in history. My analysis shows me the firm likely used cash from the balance sheet to finance its acquisition as well as its cash outflows. Seeking Alpha Seeking Alpha Activision Blizzard's market cap prior to its acquisition was relatively much higher than all of its major peers. This represents just how significant the acquisition was in strengthening Microsoft's portfolio and dominance in the gaming industry. In April 2023, Activision's market cap was around $67 billion, second place went to Nintendo, with a market cap of around $48 billion: Market Capitalization of the Largest Gaming Companies Worldwide in Billion U.S. Dollars (Statista) Market Capitalization of the Largest Gaming Companies Worldwide in Billion U.S. Dollars (Statista) All of the evidence suggests that Microsoft's immense liquidity in financial health has contributed towards a wise, unleveraged acquisition of the most highly valued gaming company on the planet. I see this is an incredibly positive move for Microsoft to make. Since the acquisition was completed in October 2023, the share price and market cap of Microsoft have risen roughly 25%. This is obviously not all directly correlated to the Activision Blizzard deal, as Microsoft has been making a range of advancements, including creating significant growth as a result of its Azure cloud operations. Seeking Alpha Seeking Alpha At the time of this writing, Microsoft's forward P/E GAAP ratio is 35.41, which is 24.49% higher than the sector median of 28.44. I think it is fair to say that the market has modestly overvalued Microsoft shares at this time, but the higher valuation relative to peers is arguably validated by its strong financials. The acquisition of Activision Blizzard only further strengthens Microsoft's portfolio. If I compare Microsoft to major technology players used to high valuations based on exceptional business models and financial health, its P/E GAAP ratio is still the highest: Author, Using Seeking Alpha Author, Using Seeking Alpha In addition considering the stock's valuation from a discounted cash flow perspective, the fair value could appear to be around $305 if considering tangible book value per share of $12.03 added. My result is based on the following calculation: Author, Using GuruFocus Author, Using GuruFocus While this presents a negative margin of safety of around 33%, this is considerably negated by the high level of investor sentiment, the strong business model focused on continued growth and long-term outlook for Microsoft, indicated by the Activision Blizzard acquisition. There is a moderate risk that the acquisition of Activision Blizzard could affect the production and development processes and vision within the department over time. As such, it could lose appeal if it fails to attract the same levels of popularity that were common under prior leadership, especially now there have been major executive outgoings, including former CEO Bobby Kotick. Additionally, there could be integration challenges that may prevent the company from successfully executing continued success in Activision Blizzard's most popular titles. Activision Blizzard has also faced charges from the SEC for failing to disclose complaints of workplace misconduct and for violating whistleblower protection rules. The findings by the SEC related to the period between 2018-2021 and resulted in a $35 million penalty without denial. While this is a past concern and maybe only a one-off charge, there could be other internal problems that are not common to public knowledge and will need to be dealt with by Microsoft now it has acquired the firm. Overall, including the risks and the financial implications of Microsoft's acquisition of Activision Blizzard, my research has shown that the deal was a long-term net positive for Microsoft, making it now undoubtedly the largest company active in the gaming industry. It substantially adds value to an investment case for Microsoft, even when considering the valuation risk inherent in the shares. As such, Microsoft's Activision Blizzard deal reinforces the Buy rating I have for the company at this time. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of MSFT, AAPL, GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}