{
    "title": "Nvidia heads toward $2 trillion market cap after blowout forecast",
    "date": "2/22/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L3N3F72O1:0-nvidia-heads-toward-2-trillion-market-cap-after-blowout-forecast/",
    "text": "** Shares of Nvidia NVDA jump 13.9% to $768.8 in premarket trading - on track to hit a record high at market open ** The chip designer forecast a roughly threefold surge in quarterly revenue that handily beat estimates as it banked on towering demand for its artificial-intelligence (AI) chips ** Stock set to add more than $230 bln in market cap, taking it closer to the $2 trillion mark for the first time ** Co also forecast Q1 revenue growth of 233%, ahead of Wall St est of 208% growth ** Thursday's early gains put Nvidia on track to reclaim the title of the third most valuable U.S. company, behind Microsoft MSFT and Apple AAPL ** U.S.-listed shares of British chip designer Arm Holdings ARM, ARM gains 9.6%, Super Micro Computer SMCI, seen as a big beneficiary of strong AI technology demand, jumps 14.6% ** Other chipmaker Advanced Micro Devices AMD up 5.9% ** Smaller AI firms: Bigbear.ai BBAI climbs 9.3%, C3.ai AI up 6.5%, SoundHound AI SOUN rallies 8.8% ** VanEck Semiconductor ETF SMH up 5.8%, iShares Semiconductor ETF SOXX adds 4.0% ** Low-float Beamr Imaging BMR, an Israel-based video software maker that said last week it would present research relating to automated video modernization with Nvidia, rallies 23.0% Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}