{
    "title": "Microsoft hits AI snag amid weak cloud forecast, OpenAI probe",
    "date": "2/29/2024",
    "url": "https://www.jacksonprogress-argus.com/arena/thestreet/microsoft-hits-ai-snag-amid-weak-cloud-forecast-openai-probe/article_7ac2fb2d-a762-5c92-85b3-e59ff47faaeb.html",
    "text": "     Microsoft  (MSFT)  shares recently lagged the broader gains in tech stocks, following softer-than-expected cloud sales outlooks from two key rivals and a report that suggested U.S. regulators are probing ChatGPT creator OpenAI. Salesforce CRM, which competes against Microsoft's Azure in the burgeoning cloud computing space, posted better-than-expected fourth-quarter earnings late Wednesday but issued a muted revenue growth forecast for the coming year. Snowflake  (SNOW) , a smaller rival in the cloud space, also sees 2024 revenues below Wall Street estimates, with product sales of around $3.25 billion, amid a pullback in corporate spending and intensifying competition. An astrologist and rideshare driver shares astrology readings with Lyft in advance of the April 8 solar eclipse.  Click for more.A rare total solar eclipse is coming on April 8. Here's what it means for your astrological sign Cloud spending growth remains a key plank in Microsoft's AI ambitions, as it layers various offerings across its broader tech stack, tied in part to the rollout of its AI support program called Copilot. Stephen Brashear/Getty Images Microsoft said earlier this year that AI infusions added around 6 percentage points to the revenue growth of Azure, its flagship cloud product, over the three months ending in December. That's more than double the impact over the September quarter and helped Azure grow revenue by around 30%, which in turn powered a better-than-expected top line for the group's Intelligent Cloud unit of $25.9 billion. Microsoft's bigger concern, however, may lie in a Wall Street Journal report that says the Securities and Exchange Commission is looking into the communications of OpenAI CEO Sam Altman, who was publicly backed by Microsoft boss Satya Nadella during a boardroom coup last year, amid concerns that the ChatGPT creator's investors may have been misled. Altman was briefly ousted by the OpenAI board, who cited the CEO hadn't been “consistently candid in his communications\" in November. Following an outpouring of support from OpenAI staff and public statements from Nadella, Altman returned to the helm shortly after. Related: Analysts reveal new Microsoft price targets after AI costs cloud earnings OpenAI recently closed a private fundraising that values the group at around $80 billion. Microsoft reportedly invested $13 billion in OpenAI, including a $10 billion increase in January of last year, but the funding is tied to a share of future profits and was not structured as an equity stake. That arrangement has raised concerns among regulators in the U.K., which have challenged other Microsoft deals, including its $69 billion takeover of video game maker Activision Blizzard. Britain's Competition and Markets Authority late last year that it would look into Microsoft acquiring a seat on the OpenAI board, which it assumed following Altman's chaotic exit and return, to determine if it means \"de facto control\" of the group. Last summer, the U.S. Federal Trade Commission said it plans to investigate OpenAI over allegations of using personal data in the ChatGPT platform. The FTC said it is concerned that ChatGPT, a large-language model search engine launched by OpenAI earlier this year, generates \"statements about real individuals that are false, misleading, or disparaging.\" Related: Microsoft may face UK, FTC probes into OpenAI partnership after taking board seat European regulators are also set to probe Microsoft's partnership with AI start-up Mistral to determine if, as in the CMA investigation into OpenAI, the tech giant's stake amounts to \"a decisive influence\" over the Paris-based startup. \"The likely initial questions European lawmakers will focus on is how the new deal works in practice and, more specifically, what rights Microsoft has acquired over Mistral in the context of the EU’s merger control framework/rules,\" said Alex Haffner, a competition partner at the London-based law firm Fladgate. More AI Stocks: Microsoft's larger AI focus likely won't be derailed by any deepening investigation at OpenAI, given the scale and leadership of its cloud division, but any suggesting that a probe would stifle innovation at ChatGPT, the key driver of its effort to challenge Google parent Alphabet in online search, would be notable. More Personal Computing, the reporting group that includes Microsoft's Bing search engine, generated just under $17 billion in December quarter revenues, a near 20% increase from the year-ago period, thanks in part to ChatGPT enhancements. Microsoft shares have gained around 24% over the past six months, valuing the Redmond, Washington, tech stock at just over $3 trillion. Related: Veteran fund manager picks favorite stocks for 2024 Success! An email has been sent to  with a link to confirm list signup. Error! There was an error processing your request. Get breaking news stories and alerts from the Jackson Progress-Argus delivered to your email inbox.     Please log in, or sign up for a new, free account to read or post comments. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Last week, a special feature was published of tips on how to save at the grocery store. The goal is to cut costs on items you are already purchasing, but make it simple. \n\nSaving Money on a Weekly Grocery Trip Can Be Easy! Here's How\n\nThe items pictured were actual purchases and the last photo highlighted additional deals, at both Kroger and Publix, that may be beneficial to the majority. \n\nDid you find this helpful? Let us know in the comments how it was helpful and/or how it can be improved! Connect with us on social media: Sports Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: Get up-to-the-minute news sent straight to your device. "
}