{
    "title": null,
    "date": "3/14/2024",
    "url": "https://techcrunch.com/2024/03/14/after-aws-and-google-microsoft-says-its-removing-azure-egress-data-transfer-fees-but-with-caveats/",
    "text": "Microsoft has revealed that it, too, will allow business customers to transfer data out of its Azure cloud infrastructure with no “egress fees” attached, following hot on the heels of similar moves by cloud rivals AWS and Google. While Microsoft positions the announcement as a voluntary pro-customer move, the fact that it was quietly revealed with little fanfare via a short blog post might suggest ulterior motives. Indeed, the company said that it supports “customer choice, including the choice to migrate your data away from Azure,” while later acknowledging that the move also aligns with stipulations set out in the all-new European Data Act that applies from next year, designed to promote competition by making it easier to switch cloud providers. Microsoft’s Azure constitutes one-third of the “big three” public cloud triopoly, nestled in second place somewhere between frontrunner AWS and Google. The latter of these announced it was ditching egress fees in January, followed by AWS earlier this month. The crux of the problem — according to customers and regulators, at least — is that while these tech giants make it free to move data into their clouds (“ingress”), they charge for moving data out of their clouds to elsewhere, whether that’s a rival provider or to their own in-house infrastructure. And this can make it prohibitively expensive to leave. Similar to rivals, including AWS, Microsoft did already allow customers to transfer 100GB of data out of Azure each month for free. This might prove useful for companies looking to process or analyze some data perhaps in-house or on other third-party infrastructure. But companies wishing to shift everything off Azure might face exorbitant costs for doing so — and that is what today’s announcement goes some way toward addressing. Microsoft’s move has already been criticized by some as having too many caveats. For example, it is only for customers looking to completely end their association with Azure — that is, it’s for “exiting” customers only, with requirements in place that the customer must cancel all their Azure subscriptions once their data is transferred, before they can qualify for a rebate on the egress fees. So a business wishing to adopt a multi- or hybrid-cloud approach that includes Azure will still have to pay egress fees once they’ve used up their 100GB monthly allowance. This is notable, because a lot of companies will want to use some Azure services, without having to go all in on it. So in some ways, this move pays a degree of lip service to the EU’s new Data Act. “There is no flexibility here to support the multi-cloud needs of modern businesses,” Mark Boost, CEO of U.K.-based cloud computing services company Civo, explained to TechCrunch. Moreover, Microsoft’s blog post doesn’t mention this, but the free transfer out only applies to storage data, as per this support page. So data transfers from other Azure services, such as the Azure Content Delivery Network (CDN), will still include the standard charges. “Don’t be fooled by Big Tech’s apparent rush to abolish egress exit fees,” Boost continued. “Clearly in the mind of the hyperscalers, flexibility still comes at a price.” "
}