{
    "title": "How to Share Files Between Devices with Microsoft Edge Drop",
    "date": "3/1/2024",
    "url": "https://www.groovypost.com/howto/share-files-between-devices-with-edge-drop/",
    "text": "If you need to share files or notes between PCs and phones, you can share files between devices with Microsoft Edge’s Drop feature. Here’s how. Microsoft Edge includes a feature called Drop that allows you to share files and notes between mobile and desktop devices. Drop is available in all versions of Edge with an accessible Drop button from the sidebar. The good news is that you don’t need to install an extension to use it — it’s built into the browser. It requires minimal setup, but you do need a OneDrive account. After that, you’ll be sharing files between devices on Edge. We’ll show you how to share files between different devices using Microsoft Edge Drop below. Before you begin, you’ll need to be signed in to your Microsoft account and have the necessary storage space for the file(s) you wish to transfer. Provided the minimum requirements are met, you can begin using the Edge Drop service. If you’re unsure about your available space, you can check the amount of storage space available in OneDrive. Accessing your shared files from another device is as easy as signing into your machine with the same Microsoft account. When you drop a file, other PCs should receive a notification that lets you know a new file is available.   That will show you the amount of storage space you have remaining on OneDrive. Also, from there, you can free up storage, upgrade your storage plan, and change some default settings.  When you share a file with Drop, you can access it on your phone or tablet, you need to ensure you’re signed in with the same Microsoft account across all devices. The following steps show using Drop on Edge on iPhone. The Microsoft Edge Drop feature is a convenient way to share files and comments among your other PCs and mobile devices. This option works great when you need to share a file with a phone or tablet running Edge. The files are also stored in OneDrive, so you can access them by signing into your account. However, you can only send notes via Edge Drop. You can’t do that from OneDrive, so it’s an additional perk for using Drop. Awesome, share it: Thanks for getting in touch with us. dan February 23, 2023 at 12:12 am I do get the ‘paper plane’ icon that you show but it says TELEGRAM; is that the same as DROP? David March 13, 2023 at 8:44 pm Simply doesn’t work. I have Edge mobile on my phone, same account, and nothing appears. There’s no indication of a “Drop” feature on the latest mobile Edge. Bad implementation. Brian Burgess October 20, 2023 at 11:33 am Ensure you are signed into the same Microsoft account on both devices. Also, ensure you have the latest version of Edge on your phone or tablet. When Drop was first rolled out in February 2023 it was a bit sketchy. But modern versions now in October 2023 work. We added a section on signing into Drop on iPhone to help clarify things. But we verified the steps and it works great. Thanks for reading! Your email address will not be published. Required fields are marked * Comment * Name * Email *   Δ Save my name and email and send me emails as new comments are made to this post. Copyright © 2007-2024 groovyPost™ LLC | All Rights Reserved | A Raptive Partner Site "
}