{
    "title": "TAP Consulting LLC Has $844,000 Holdings in Microsoft Co. (NASDAQ:MSFT)",
    "date": "3/11/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-msft-sec-filing-2024-03-11/",
    "text": "TAP Consulting LLC lessened its stake in Microsoft Co. (NASDAQ:MSFT - Free Report) by 50.2% in the 3rd quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission. The fund owned 2,672 shares of the software giant's stock after selling 2,693 shares during the quarter. TAP Consulting LLC's holdings in Microsoft were worth $844,000 as of its most recent SEC filing. Several other large investors also recently made changes to their positions in the stock. Monumental Financial Group Inc. bought a new stake in Microsoft in the 1st quarter valued at $28,000. Atlantic Private Wealth LLC raised its stake in Microsoft by 534.5% in the 2nd quarter. Atlantic Private Wealth LLC now owns 184 shares of the software giant's stock valued at $63,000 after acquiring an additional 155 shares during the period. Hibernia Wealth Partners LLC bought a new stake in Microsoft in the 3rd quarter valued at $69,000. Iron Horse Wealth Management LLC raised its stake in Microsoft by 89.0% in the 3rd quarter. Iron Horse Wealth Management LLC now owns 223 shares of the software giant's stock valued at $70,000 after acquiring an additional 105 shares during the period. Finally, MayTech Global Investments LLC bought a new stake in Microsoft in the 4th quarter valued at $83,000. Institutional investors and hedge funds own 69.20% of the company's stock. Microsoft Trading Down 0.4 % MSFT stock traded down $1.45 during trading on Monday, hitting $404.77. The company had a trading volume of 9,574,761 shares, compared to its average volume of 22,982,438. The business has a 50-day moving average of $399.55 and a 200-day moving average of $365.88. Microsoft Co. has a one year low of $245.73 and a one year high of $420.82. The stock has a market cap of $3.01 trillion, a PE ratio of 36.73, a PEG ratio of 2.16 and a beta of 0.89. The company has a current ratio of 1.22, a quick ratio of 1.20 and a debt-to-equity ratio of 0.19. Microsoft (NASDAQ:MSFT - Get Free Report) last released its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, beating analysts' consensus estimates of $2.76 by $0.17. The business had revenue of $62.02 billion during the quarter, compared to analyst estimates of $61.14 billion. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. Microsoft's quarterly revenue was up 17.6% compared to the same quarter last year. During the same period in the prior year, the firm posted $2.32 EPS. Research analysts predict that Microsoft Co. will post 11.63 earnings per share for the current fiscal year. Analyst Upgrades and Downgrades Several research analysts have weighed in on MSFT shares. Piper Sandler reiterated an \"overweight\" rating and set a $455.00 price objective on shares of Microsoft in a research report on Thursday, January 25th. Barclays increased their price objective on Microsoft from $421.00 to $475.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, January 31st. DA Davidson reiterated a \"buy\" rating and set a $500.00 price objective on shares of Microsoft in a research report on Tuesday, March 5th. Truist Financial reiterated a \"buy\" rating on shares of Microsoft in a research report on Tuesday, January 23rd. Finally, Jefferies Financial Group restated a \"buy\" rating and issued a $465.00 price target on shares of Microsoft in a research report on Wednesday, March 6th. Four investment analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company. According to MarketBeat.com, the stock currently has a consensus rating of \"Moderate Buy\" and a consensus price target of $415.00. Read Our Latest Stock Report on MicrosoftInsider Buying and Selling at Microsoft In other Microsoft news, insider Bradford L. Smith sold 3,303 shares of the company's stock in a transaction on Monday, February 5th. The stock was sold at an average price of $406.12, for a total value of $1,341,414.36. Following the completion of the transaction, the insider now owns 570,826 shares in the company, valued at approximately $231,823,855.12. The sale was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through the SEC website. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of the stock in a transaction on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the transaction, the insider now owns 11,677,398 shares in the company, valued at approximately $22,770,926.10. The transaction was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. Also, insider Bradford L. Smith sold 3,303 shares of the stock in a transaction on Monday, February 5th. The stock was sold at an average price of $406.12, for a total value of $1,341,414.36. Following the transaction, the insider now owns 570,826 shares of the company's stock, valued at approximately $231,823,855.12. The disclosure for this sale can be found here. Insiders sold 1,048,303 shares of company stock worth $21,821,514 in the last quarter. 0.03% of the stock is currently owned by company insiders. Microsoft Profile (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.Featured StoriesFive stocks we like better than MicrosoftWhere to Find Earnings Call TranscriptsUnbearably Good Investment: A Build-A-Bear Stock AnalysisHow to Use the MarketBeat Stock Split CalculatorCoinbase Stock Tempting but isn’t without its RisksWhat is Insider Trading? What You Can Learn from Insider TradingThis Industrial Products Stock is Goldman’s Favorite This CycleThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Did You Get Your Free Bitcoin Yet? (From Crypto Swap Profits) (Ad)Should you invest $1,000 in Microsoft right now?Before you consider Microsoft, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list.While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here Metaverse Stocks And Why You Can't Ignore ThemThinking about investing in Meta, Roblox, or Unity? Click the link to learn what streetwise investors need to know about the metaverse and public markets before making an investment.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Microsoft, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list. While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Thinking about investing in Meta, Roblox, or Unity? Click the link to learn what streetwise investors need to know about the metaverse and public markets before making an investment. Microsoft's stock price is pulling back following the Q4 results, suggesting a top is in play, but investors should not be so quick to shed their shares. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}