{
    "title": null,
    "date": "3/12/2024",
    "url": "https://www.windowslatest.com/2024/03/12/windows-10-kb5035845-turns-on-new-features-direct-download-links/",
    "text": "Windows 10 KB5035845 is now available for everyone, and it has some new features, such as WhatsApp integration in the Share menu. This Patch Tuesday security update can be installed via Windows Update, or you can also grab Windows 10 KB5035845 offline installers in .msu through the Update Catalog. KB5035845 is a nice update with some noteworthy changes. As mentioned above, Windows 10’s March 2024 security update lets you quickly share files, documents, images or videos to WhatsApp. For example, you could browse the “Documents” folder in File Explorer and directly share the .pdf or .txt file using WhatsApp. As shown in the screenshot below, you need to right-click the file or media, select share, and choose “WhatsApp” from the list. You can pick the contact and send the file to your friends or family directly. Previously, Windows 10 required you to open WhatsApp, click its attachment button, use File Explorer picker, and then share files. Sounds like a pretty good addition to Windows 10, right? If you like this feature, you can grab the update from Settings > Updates & Security> Windows Update. You’ll see the following patch when you click to check for updates: 2024-03 Cumulative Update for Windows 10 Version 22H2 for x86-based Systems (KB5035845) Windows 10 KB5035845 Direct Download Links: 64-bit and 32-bit (x86). The above link for 64-bit and 32-bit will open the Microsoft Update Catalog, where you need to select the “Download” button next to the supported version. This will download the .msu file, and you can double-click to begin the installation. Installing the update will advance systems to Windows 10 Build 19045.4170. As mentioned above, you can now share using Windows Share UI with your favourite apps like WhatsApp. Microsoft has also enabled support for Gmail, Facebook, and LinkedIn in the share menu, but  X (formerly Twitter) is currently missing. However, it will be added in a future release. Windows 10 Build 19045.4170 will also respect your preference if you install games using the Microsoft Store on a secondary drive. All files and folders will remain on the secondary drive instead of the primary installation drive. Additionally, Microsoft is making the following changes with today’s security update: If you’re on Windows 11, you’ll also find these fixes in KB5035853, but there are many new features and major improvements. About The Author Mayank Parmar Mayank Parmar is an entrepreneur who founded Windows Latest. He is the Editor-in-Chief and has written on various topics in his seven years of career, but he is mostly known for his well-researched work on Microsoft's Windows. His articles and research works have been referred to by CNN, Business Insiders, Forbes, Fortune, CBS Interactive, Microsoft and many others over the years. Featured in "
}