{
    "title": "RESAAS Selected for Microsoft Founders Hub",
    "date": "3/5/2024",
    "url": "https://finance.yahoo.com/news/resaas-selected-microsoft-founders-hub-133000540.html",
    "text": "VANCOUVER, BC, March 5, 2024 /CNW/ - RESAAS Services Inc. (TSXV: RSS) (OTCQB: RSASF), (\"RESAAS\" or the \"Company\"), a leading provider of technology solutions for the Real Estate Industry, is pleased to announce it has been accepted into the prestigious Microsoft (NASDAQ: MSFT) Founders Hub program, securing RESAAS $150,000 USD grant in Microsoft \"Azure\" Cloud and OpenAI usage. The Microsoft Founders Hub program is designed to provide a select group of innovative technology companies support from Growth stage through to Exit. The financial grant from Microsoft enables RESAAS to leverage Microsoft's \"Azure\" Cloud Platform. RESAAS has previously won the Microsoft Cloud Partner of the Year award. \"The hallmark of a global technology platform is the ability to scale and serve customers in different regions around the world,\" said Tom Rossiter, CEO of RESAAS. \"Strengthening RESAAS's existing relationship with Microsoft enables continued international expansion to collect additional unique Real Estate Data. Microsoft's selection, support and financial grants continue RESAAS's mission of advancing the Real Estate Industry.\" Microsoft Founders Hub also provides RESAAS with additional financial grants for OpenAI's GPT-4, an Artificial Intelligence Large Language Model (LLM) Service. RESAAS has previously integrated ChatGPT to assist Real Estate Agents. \"Having RESAAS be selected for our Founders Hub program is exciting for Microsoft,\" said Scott Guthrie, Executive Vice President of Cloud & A.I. at Microsoft. \"We are thrilled to have RESAAS's innovative Real Estate Platform running on Microsoft Azure.\" In addition to grants and other financial benefits, Founders Hub provides RESAAS with connections to Microsoft's Global Network of Investors and Partners. About RESAAS Services Inc. RESAAS is an award-winning technology company serving the Real Estate Industry, uniting all Real Estate Brokerages and Agencies in one Global, Centralized Industry Platform. Over 600,000 RESAAS Agents in 160 countries have access to unique Real Estate Data, providing access to qualified international referrals and Coming Soon listings only available inside RESAAS. Some of Real Estate's largest organizations leverage RESAAS to provide Business Intelligence, new business opportunities, and real-time industry-wide communication. For more information, please visit www.resaas.com. Disclaimer The TSX Venture Exchange has neither approved nor disapproved the contents of this news release. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. The statements made in this news release may contain forward-looking statements that may involve a number of risks and uncertainties. Actual events or results could differ materially from RESAAS Services Inc.'s expectations and projections. SOURCE RESAAS SERVICES INC. View original content to download multimedia: http://www.newswire.ca/en/releases/archive/March2024/05/c0498.html Related Quotes "
}