{
    "title": "Michael J. Mcconnell Purchases 5,000 Shares of OneSpan Inc. (NASDAQ:OSPN) \nStock",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-ospn-insider-buying-and-selling-2024-03-18/",
    "text": "OneSpan Inc. (NASDAQ:OSPN - Get Free Report) Director Michael J. Mcconnell bought 5,000 shares of the stock in a transaction on Friday, March 15th. The stock was purchased at an average cost of $9.83 per share, with a total value of $49,150.00. Following the completion of the purchase, the director now directly owns 73,849 shares in the company, valued at approximately $725,935.67. The purchase was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this hyperlink. OSPN stock traded down $0.13 during midday trading on Monday, hitting $10.19. The stock had a trading volume of 353,452 shares, compared to its average volume of 437,739. The firm has a market cap of $385.08 million, a PE ratio of -13.77 and a beta of 0.77. The company's 50-day moving average price is $10.13 and its 200 day moving average price is $10.18. OneSpan Inc. has a 12-month low of $7.64 and a 12-month high of $18.61. OneSpan (NASDAQ:OSPN - Get Free Report) last posted its earnings results on Wednesday, March 6th. The company reported $0.12 earnings per share for the quarter, beating the consensus estimate of ($0.05) by $0.17. The business had revenue of $62.93 million for the quarter. OneSpan had a negative net margin of 12.68% and a negative return on equity of 6.43%. As a group, sell-side analysts anticipate that OneSpan Inc. will post 0.71 EPS for the current year. Hedge funds and other institutional investors have recently made changes to their positions in the business. Cerity Partners LLC acquired a new position in shares of OneSpan during the 1st quarter valued at $367,000. FMR LLC lifted its holdings in OneSpan by 80.0% in the 1st quarter. FMR LLC now owns 2,084 shares of the company's stock worth $36,000 after buying an additional 926 shares in the last quarter. PNC Financial Services Group Inc. lifted its holdings in OneSpan by 267.7% in the 4th quarter. PNC Financial Services Group Inc. now owns 2,732 shares of the company's stock worth $31,000 after buying an additional 1,989 shares in the last quarter. TFO Wealth Partners LLC lifted its holdings in OneSpan by 15,900.0% in the 4th quarter. TFO Wealth Partners LLC now owns 3,520 shares of the company's stock worth $38,000 after buying an additional 3,498 shares in the last quarter. Finally, Point72 Middle East FZE acquired a new position in OneSpan in the 4th quarter worth $45,000. Institutional investors and hedge funds own 86.78% of the company's stock. Separately, StockNews.com raised shares of OneSpan from a \"hold\" rating to a \"buy\" rating in a research note on Monday, March 11th. Read Our Latest Research Report on OneSpan OneSpan Inc, together with its subsidiaries, designs, develops, and markets digital solutions for identity, authentication, and secure digital agreements worldwide. The company offers OneSpan Sign, a range of e-signature requirements for occasional agreement to processing tens of thousands of transactions; OneSpan Cloud Authentication, a cloud-based multifactor authentication solution that supports a range of authentication options, including biometrics, push notification, and visual cryptograms for transaction data security, SMS, and hardware authenticators; and OneSpan Identity Verification, which enables banks and financial institutions identity verification services.Featured ArticlesFive stocks we like better than OneSpanWhat to Know About Investing in Penny StocksWalmart: Here’s Your Chance to Get in Cheaper in 2024Stock Market Upgrades: What Are They?Insider Selling of Amazon Spikes in Q1, but it's Not Time to SellWhat is Short Interest? How to Use It2 Deep Value, High Yield Stocks With a Double-Digit Upside Before you consider OneSpan, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and OneSpan wasn't on the list. While OneSpan currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Thinking about investing in Meta, Roblox, or Unity? Click the link to learn what streetwise investors need to know about the metaverse and public markets before making an investment. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}