{
    "title": "Venture with Microsoft: French startup Mistral AI vows to maintain open \nsource",
    "date": "3/13/2024",
    "url": "https://today.rtl.lu/news/business-and-tech/a/2177013.html",
    "text": "The launch of ChatGPT and other American models set off a rush by European companies to make up for their delay /     ©\n\n    AFP/File French startup Mistral AI, a rising star in artificial intelligence, pledged Tuesday to maintain open source coding even as it launches into a venture with Microsoft that involves selling some of its software. The announcement comes as US billionaire Elon Musk has sued ChatGPT creator OpenAI -- which also has ties to Microsoft -- accusing the firm of breaking its original non-profit mission to make AI research available to all. Musk said Monday he would make his own chatbot, Grok, open source. During an event organised by Microsoft in Paris, Mistral AI's  head of public affairs, Audrey Herblin-Stoop, said open source is essential to build a European ecosystem around AI to try to catch up with US companies. \"The goal is not to abandon open source,\" she said. \"This technology is revolutionary and we have to be transparent -- we must enable people to look under the hood and it's open source that allows this.\" The French company, valued at about $2 billion according to some financial players, presented a third generation of its language model \"Mistral Large\" in late February and said it was entering into a partnership with Microsoft. Mistral Large, which Mistral says is comparable to OpenAI's GPT-4, is now available on Microsoft's platform Azure AI. At the time, Mistral's co-founder Arthur Mensch, told French daily Le Monde that he was not abandoning open source despite selling its software through the US tech giant. \"Commercial activity will enable us to finance the costly research needed to develop new models,\" he said. \"We will continue to work on both tracks.\" The launch of ChatGPT and other American models set off a rush by European companies to make up for their delay. Mistral AI was founded in April 2023 by three French engineers who had previously worked at Facebook parent company Meta and Google. "
}