{
    "title": "Microsoft taps DeepMind co-founder Suleyman to spearhead consumer AI push",
    "date": "3/19/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L3N3FX43Q:0-microsoft-taps-deepmind-co-founder-suleyman-to-spearhead-consumer-ai-push/",
    "text": "Microsoft MSFT has appointed DeepMind co-founder Mustafa Suleyman as the head of a newly created consumer AI unit and hired several employees of his Inflection AI startup, seeking to defend its lead against rising competition from Google. Suleyman will be CEO of the unit, Microsoft AI, the company said on Tuesday, bringing under one roof its consumer AI efforts such as its Copilot chatbot and the new Bing browser that uses the technology. The Copilot, built using technology from ChatGPT-maker OpenAI, is the lynchpin of Microsoft's efforts to generate revenue from its AI efforts and can write emails, summarize documents and make presentations. \"This infusion of new talent will enable us to accelerate our pace yet again,\" Microsoft CEO Satya Nadella said in a blog post. \"As part of this transition, Mikhail Parakhin and his entire team, including Copilot, Bing, and Edge; and Misha Bilenko and the GenAI team will move to report to Mustafa,\" he said. It comes when Microsoft has been partnering with other startups including France's Mistral AI against the backdrop of heightened regulatory scrutiny of its tie-up with OpenAI. Nadella said on Tuesday that Microsoft is \"very committed\" to its OpenAI partnership. Karen Simonyan, who co-founded Inflection AI along with Suleyman and Microsoft board member Reid Hoffman, will join as chief scientist. Meanwhile, Alphabet's GOOG Google unit is expanding its AI-related efforts. Bloomberg News reported on Monday that Apple was in talks to build Google's Gemini artificial intelligence engine into the iPhone. Inflection AI has emerged as one of the most high-flying names in the genAI race after raising $1.3 billion from Microsoft and Nvidia NVDA in a mix of cash and cloud credit at a valuation of $4 billion last June. The startup behind the chatbot Pi said on Tuesday Sean White, former head of research and development at Mozilla, will be its new CEO and that it plans pivot to serving models to commercial customers, instead of focusing on consumers. It also added that its Inflection-2.5 will be available on Microsoft Azure. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}