{
    "title": "Microsoft is adding an AI button to PC keyboards",
    "date": "1/4/2024",
    "url": "https://www.businessinsider.com/microsoft-ai-button-pc-keyboards-windows-copilot-2024-1",
    "text": "       Microsoft is adding an AI button to Windows. On Thursday, the company announced the new Copilot key would be added to Windows 11 PCs, with availability beginning in late February. In a blog post, Microsoft's executive vice president and consumer chief marketing officer, Yusuf Mehdi, said the new key would allow users to engage Copilot for everyday use. Related stories The key aimed to make it easier for people to participate in the AI transformation, Mehdi added. Microsoft has already incorporated its AI companion into Bing, Windows, and Office 365. Users who want to access Copilot on Windows 10 or Windows 11 PCs can already do so by holding down the Windows and the C key. Copilot has proved popular with users, giving the company a boost in the AI arms race being fought between Big Tech companies. Microsoft has invested heavily in ChatGPT creator OpenAI, leveraging the company's tech to power its own AI products. An analyst previously told Business Insider that \"Microsoft has captured the zeitgeist\" of generative AI with Copilot. Since purchasing GitHub, the company has also successfully driven AI across the developer community. The introduction of the Copilot key marks the first significant addition to the Windows PC keyboard in nearly three decades. The key will appear on many of the new Windows 11 PCs, including on upcoming Surface devices. The placement of the key will vary, but in some cases, it will replace the right CTRL key or Menu key, a Microsoft spokesperson told BI. Although the move marks the first keyboard addition for many years, the company did remove the Start button from its Windows 8 operating system in 2012. Given the button's long history, its removal contributed to dissatisfaction among Windows 8 users, although Microsoft cited a lack of use for the decision to kill it. The company eventually backtracked and reinstated it. Read next Jump to "
}