{
    "title": "EU Eyes Microsoft's $13B OpenAI Investment for Potential Anti-Competitive \nPractices - Microsoft (NASDAQ:M",
    "date": "1/9/2024",
    "url": "https://www.benzinga.com/government/24/01/36554760/eu-eyes-microsofts-13b-openai-investment-for-potential-anti-competitive-practices",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Microsoft Corp's MSFT $13 billion investment in OpenAI is under scrutiny by the European Union, potentially leading to a full investigation under the bloc's merger rules. This follows concerns that the partnership may hinder fair competition in the rapidly growing field of artificial intelligence and virtual worlds. The European Commission, alongside the UK's Competition and Markets Authority, explores the depth of Microsoft's involvement with OpenAI, particularly in light of the recent internal upheaval at ChatGPT's creator, Bloomberg reports. EU antitrust commissioner Margrethe Vestager emphasizes keeping new markets competitive and open for innovation. Microsoft's integration of OpenAI's products across its businesses has quickly established it as a leading AI company, prompting rivals like Alphabet Inc's GOOG GOOGL Google to intensify their efforts in the sector. Also Read: Microsoft President Makes Startling Revelations on Arrival of Advanced AI The partnership's scrutiny intensified after the firing and rehiring of Sam Altman as OpenAI's chief, revealing close ties between the two companies. Microsoft CEO Satya Nadella was personally involved in negotiating Altman's return, highlighting the interconnectedness of Microsoft and OpenAI. This partnership revolves around the immense computing power required for generative AI, making OpenAI a significant customer of Microsoft's cloud services. The EU's investigation also includes a call for feedback on competitive issues in AI and virtual worlds, reflecting the EU's growing interest in the sector's competitive dynamics and the significant venture capital investment in AI in Europe. The U.K.'s Competition and Markets Authority (CMA) is also scrutinizing Microsoft's partnership with OpenAI and is considering launching a probe into their collaboration for potential competition issues. This evaluation follows the CMA's approval of Microsoft's acquisition of Activision Blizzard. Microsoft, as OpenAI's principal investor, has invested $13 billion in the AI startup, leading to OpenAI's integration into Microsoft's enterprise tools and reliance on Microsoft's cloud services. The European Union (EU) is reportedly close to reaching an agreement that could result in extensive regulation of artificial intelligence (AI) technologies, including ChatGPT and Google Bard, marking a crucial step in global AI policy. The Microsoft stock gained 65% last year versus the broader index Invesco QQQ Trust, Series 1 QQQ at 50%. Price Actions: Microsoft shares traded lower by 0.16% at $374.10 on the last check Tuesday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}