{
    "title": "Microsoft lays off 1900 Activision Blizzard and Xbox employees",
    "date": "1/25/2024",
    "url": "https://www.theverge.com/2024/1/25/24049050/microsoft-activision-blizzard-layoffs",
    "text": "By  Tom Warren, a senior editor covering Microsoft, PC gaming, console, and tech. He founded WinRumors, a site dedicated to Microsoft news, before joining The Verge in 2012. Microsoft is laying off 1,900 employees at Activision Blizzard and Xbox this week. While Microsoft is primarily laying off roles at Activision Blizzard, some Xbox and ZeniMax employees will also be impacted by the cuts. The cuts work out to roughly 8 percent of the overall Microsoft Gaming division that stands at around 22,000 employees in total. The Verge has obtained an internal memo from Microsoft Gaming CEO Phil Spencer that confirms the layoffs: It’s been a little over three months since the Activision, Blizzard, and King teams joined Microsoft. As we move forward in 2024, the leadership of Microsoft Gaming and Activision Blizzard is committed to aligning on a strategy and an execution plan with a sustainable cost structure that will support the whole of our growing business. Together, we’ve set priorities, identified areas of overlap, and ensured that we’re all aligned on the best opportunities for growth. As part of this process, we have made the painful decision to reduce the size of our gaming workforce by approximately 1900 roles out of the 22,000 people on our team. The Gaming Leadership Team and I are committed to navigating this process as thoughtfully as possible. The people who are directly impacted by these reductions have all played an important part in the success of Activision Blizzard, ZeniMax and the Xbox teams, and they should be proud of everything they’ve accomplished here. We are grateful for all of the creativity, passion and dedication they have brought to our games, our players and our colleagues. We will provide our full support to those who are impacted during the transition, including severance benefits informed by local employment laws. Those whose roles will be impacted will be notified, and we ask that you please treat your departing colleagues with the respect and compassion that is consistent with our values. Looking ahead, we’ll continue to invest in areas that will grow our business and support our strategy of bringing more games to more players around the world. Although this is a difficult moment for our team, I’m as confident as ever in your ability to create and nurture the games, stories and worlds that bring players together. Phil Alongside the layoffs, Blizzard president Mike Ybarra has decided to leave the company. “As many of you know, Mike previously spent more than 20 years at Microsoft. Now that he has seen the acquisition through as Blizzard’s president, he has decided to leave the company,” says Microsoft’s game content and studios president, Matt Booty, in an internal memo. Microsoft plans to name a new Blizzard president next week. Allen Adham, Blizzard’s chief design officer, is also leaving the company. “As one of Blizzard’s cofounders, Allen has had a broad impact on all of Blizzard’s games. His influence will be felt for years to come, both directly and indirectly as Allen plans to continue mentoring young designers across the industry,” says Booty. Blizzard’s previously announced survival game has also been canceled as part of these changes. Booty says Microsoft will be “shifting some of the people working on it to one of several promising new projects Blizzard has in the early stages of development.” The layoffs come the same month Riot Games, Google, Discord, Twitch, Unity, eBay, and others announced cuts. Microsoft completed its $68.7 billion acquisition of Activision Blizzard in October, following 20 months of battles with regulators in the UK and US. Former Activision Blizzard CEO Bobby Kotick stepped down at the end of December, with Microsoft not appointing a direct replacement. Instead, a suite of Activision Blizzard executives now report up to Matt Booty. Today’s layoffs come just a few months after some big Xbox leadership changes saw Sarah Bond promoted to Xbox president, leading all Xbox platform and hardware work. Booty was also promoted to president of game content and studios, which includes overseeing Bethesda, ZeniMax studios, and Activision Blizzard. Microsoft last announced big layoffs a year ago, affecting 10,000 employees. The software maker is due to report its fiscal Q2 2024 earnings next week, which, for the first time, will include results from the impact of the Activision Blizzard acquisition. Here’s Matt Booty’s internal memo in full: Blizzard team, As you may have read in Phil’s note, today is a challenging day as we say goodbye to some of our colleagues. This is a difficult process, but it is one that will best enable Blizzard and Xbox to deliver ambitious games for our players on more platforms and in more places than ever before. We are moving forward with a more focused strategy across Microsoft Gaming that sets us up for sustainable growth and aligns our talent and resources to our top priorities. In addition to the events today, Mike Ybarra and I have been discussing his future and some of his personal passions for some time. As many of you know, Mike previously spent more than 20 years at Microsoft. Now that he has seen the acquisition through as Blizzard’s president, he has decided to leave the company. As we move forward, we will continue to build on the positive momentum that Mike created and strive to continue exceeding the expectations of Blizzard’s players. I want to thank Mike for his leadership and for his partnership and counsel since the deal closed. I know he plans to travel and spend more time with his family. We wish him the very best. Additionally, Allen Adham, Blizzard’s Chief Design Officer, is leaving the company. As one of Blizzard’s cofounders, Allen has had a broad impact on all of Blizzard’s games. His influence will be felt for years to come, both directly and indirectly as Allen plans to continue mentoring young designers across the industry. The new Blizzard President will be announced next week. What Happens Next Those who are impacted are being informed in meetings starting today. Given the challenging day ahead, anyone who is set up to work from home and would prefer to, can work remotely today. Due to time zones and local holidays, some impacted employees in APAC and EMEA will be informed later this evening and into early next week. After the notifications are complete, leaders will bring their teams together. Please be mindful of this process in your conversations and outreach during these next few days. Details on Today’s Actions The changes announced today reflect a focus on products and strategies that hold the most promise for Blizzard’s future growth, as well as identified areas of overlap across Blizzard and Microsoft Gaming. Today’s actions affect multiple teams within Blizzard, including development teams, shared service organizations and corporate functions. As part of this focus, Blizzard is ending development on its survival game project and will be shifting some of the people working on it to one of several promising new projects Blizzard has in the early stages of development. No matter the reason behind these decisions, they are never made lightly. Changes like these affect the lives of colleagues and friends, and we are all grateful for their meaningful contributions to Blizzard and its world class lineup of games. As Phil stated, we will provide our full support to those who are impacted during the transition, including severance benefits informed by local employment laws. I understand that this is a challenging time and that it can be a lot to process. I haven’t met many of you yet, and hearing about these decisions from me may be difficult. Today, I am here on Blizzard’s Irvine campus, and I am personally committed to supporting you as teams and individuals, keeping you informed, and approaching this transition period with care and transparency. Thank you for working through these changes with us. Together we will continue to create amazing games for our players, with a culture that empowers everyone to be their most authentic selves and do their best work. - Matt Update January 25th, 10:45AM ET: Article updated with full memo from Matt Booty. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}