{
    "title": "March Rate Cut Odds Plummet As Magnificent 7 Surge",
    "date": "1/21/2024",
    "url": "https://www.forbes.com/sites/bill_stone/2024/01/21/march-rate-cut-odds-plummet-as-magnificent-7-surge/",
    "text": "The Magnificent 7 led the charge higher again with a gain of 2.5%, while the equal-weighted S&P 500 ... [+] declined by 0.2%. The fourth-quarter earnings season picks up steam this week, with 74 S&P 500 companies scheduled to report. (Photo by Movie Poster Image Art/Getty Images) The earnings season continued its slow start last week, with only 23 S&P 500 companies reporting. Banks were a large contingent of the reporters, which weighed on earnings again. The S&P 500 rose 1.2% for the week, finally eclipsing its all-time high from 2022. The 10-year Treasury yield rose from 3.9% to 4.1%. The Magnificent 7 led the charge higher again with a gain of 2.5%, while the equal-weighted S&P 500 declined by 0.2%. Recall the Magnificent 7 consists of Microsoft\nMSFT\n (MSFT), Meta Platforms\nFB\n (META), Amazon.com (AMZN), Apple\nAAPL\n (AAPL), NVIDIA\nNVDA\n\nDIA\n (NVDA), Alphabet (GOOGL), and Tesla\nTSLA\n (TSLA). The fourth-quarter earnings season picks up steam this week, with 74 S&P 500 companies scheduled to report. A more detailed preview of the earnings season is available here. Even though the inflation rate appears to be moderating, the 10-year Treasury yield rose from 3.9% to 4.1%. A string of better-than-expected economic data, including consumer spending, has boosted the estimates for fourth-quarter GDP to 2.3%, which will be released on Thursday. 4Q 2023 U.S. GDP Growth Estimate Further, the initial applications for unemployment benefits fell to the second lowest level since the pandemic. While the resilience of the labor market bolsters the case for a durable economy able to avoid a recession, it raises the specter of rekindling inflation growth via wage pressures. Initial Jobless Claims Combined, all the better economic data has caused the probability of a March short-term interest rate cut from the Federal Reserve to plunge to below 50% from over 90% late in 2023. Probability Of A March 2024 Fed Rate Cut At this early point in the reporting season, blended earnings, which combine actual with estimates of companies yet to report, are worse than forecasts at the end of the quarter. There was little movement from other sectors, but bank earnings within the financial sector again scuttled the overall S&P 500 reading. S&P 500 Earnings Season Bank and financial earnings again dominated the second week of the earnings season. According to FactSet, Truist Financial (TFC), Morgan Stanley\nMS\n (MS), and U.S. Bancorp\nTBBK\n (USB) missed earnings estimates and were the most significant detractors from S&P 500 earnings growth last week. The FDIC special assessment to fund the losses from the 2023 banking crisis and other charges complicated bank earnings this quarter. The range of companies reporting earnings broadens out this week. Among the companies scheduled include Johnson & Johnson\nJNJ\n (JNJ), Tesla (TSLA), Netflix\nNFLX\n (NFLX), Procter & Gamble\nPG\n (PG), and several defense companies and railroads. 4Q 2023 Earnings By Sector Sales growth is closely tied to nominal GDP growth, combining after-inflation economic growth (real GDP) with inflation. With nominal GDP growth likely solid year-over-year for the fourth quarter, topline revenue growth for companies should have some tailwind. So far, with a few companies reporting, sales growth has moved fractionally lower than expectations going into the earnings season but moved slightly higher last week despite the continued deterioration in earnings growth. 4Q 2023 Sales By Sector So far, the blended earnings performance has underperformed expectations at the end of the quarter. Combining actual results with consensus estimates for companies yet to report, the blended earnings growth rate for the quarter is at -1.7% year-over-year, below the expectation of +1.6% at the end of the quarter. S&P 500 Earnings Summary The continued worse-than-expected large bank earnings have made for ugly earnings headlines, but the earnings season should improve after last week. This week brings some much-needed diversity of earnings reports outside of the banks. Investors should expect better year-over-year earnings growth for the quarter now that most bank earnings are behind us. Separately, the stock market has become very narrow again, with the Magnificent 7 primarily responsible for the new all-time high in stocks. The S&P 500 is 1.5% higher year-to-date, while the Magnificent 7 is up 3.7%. However, the average stock is lower for the year, with the equal-weight S&P 500 1.5% lower year-to-date. A crossroads could be near for stocks, which could see more companies joining the rally or the Magnificent 7 needing a rest as yields rise in response to better economic growth. Disclosure: Glenview Trust currently has holdings of Microsoft (MSFT), Meta Platforms (META), Amazon.com (AMZN), Apple (AAPL), NVIDIA (NVDA), and Alphabet (GOOGL) within its recommended investment strategies.  "
}