{
    "title": "Microsoft (MSFT), PNNL Use AI to Identify New Battery Material",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/news/microsoft-msft-pnnl-ai-identify-112000567.html",
    "text": "Microsoft MSFT has teamed up with the Pacific Northwest National Laboratory (“PNNL”) to develop a new way of building batteries that feature up to 70% less lithium than current offerings.The collaboration illustrates the transformative impact of combining advanced artificial intelligence (AI) with next-generation cloud computing to revolutionize the pace of scientific discovery, particularly in fields critical to addressing global energy and sustainability challenges.Microsoft and PNNL utilized AI, specifically Microsoft's Azure Quantum Elements, in the process. The AI algorithms proposed 32 million candidates, which were then filtered based on stability, reactivity and potential to conduct energy.The AI system reduced the candidates to about 500,000 and further filters were applied using high-performance computing (HPC) for higher accuracy. HPC verified the stability and practicality of the materials.The use of AI and HPC has significantly accelerated the process of discovering new materials, which, in this case, allowed the researchers to identify 23 promising material candidates in a total time of 80 hours.The discovered material, which uses both lithium and sodium, could potentially reduce lithium content by up to 70%, addressing concerns related to the scarcity and environmental impact of lithium-ion batteries.The AI-HPC combination reduced the time spent computing and cloud-based AI tools provided accessibility and flexibility, avoiding the constraints of shared supercomputers.The success of this collaboration suggests that similar approaches could be applied across various scientific fields, addressing urgent challenges in sustainability, pharmaceuticals and more. Microsoft Corporation price-consensus-chart | Microsoft Corporation Quote Quantum computer stocks represent companies trying to revolutionize cryptography, optimization, drug discovery and AI. It holds promise for solving complex problems currently infeasible for classical computers due to their exponential time requirements.Microsoft is pushing hard in the quantum computing realm. This Zacks Rank #3 (Hold) company offers Azure Quantum as a cloud service that allows users to build and refine quantum algorithms. Azure’s aim is to achieve scalability toward the realization of a general-purpose quantum computer. Along these lines, Azure Quantum applications are crafted to empower quantum chemists and scientists in their research endeavors. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.The company is also working on higher-level applications, with efforts to make reliable qubits that can remain error-free. The longer a qubit is stable, the more complex applications it can run.The Zacks Consensus Estimate for fiscal 2024 revenues is pegged at $242.341 billion, indicating 14.3% growth from fiscal 2023. The consensus estimate for fiscal 2024 earnings is pinned at $11.14 per share, up 13.5% from the year-ago actual figure.NVIDIA NVDA launched a new system that is the first graphic processing unit-accelerated quantum computing program in 2023. Its platform allows researchers to build applications combining quantum and classical computing.The company is working with quantum computer manufacturer IQM to build future hybrid quantum applications. NVDA is also collaborating with a software company, Terra Quantum, to enhance data analytics using hybrid quantum computing to provide better performance.Amazon AMZN is getting into the quantum computing space through Amazon Web Services, a comprehensive cloud service with more than 200 fully featured services, and powered by data centers worldwide. Amazon Braket is the company’s fully managed quantum computing service, allowing users to build quantum algorithms and test, run and analyze the results.International Business Machines IBM has increased its focus on AI and machine learning applications. Through the IBM Quantum Network, the company collaborates with more than 250 Fortune 500 companies, universities, labs and startups. The network fosters partnerships and provides exclusive access to meetings and channels.IBM recently introduced the IBM Quantum Heron, marking the first in a new series of utility-scale quantum processors. Engineered over four years, it boasts IBM’s highest performance metrics and lowest error rates among its quantum processors. Furthermore, IBM unveiled the Quantum System Two, its inaugural modular quantum computer. The system is operational with three IBM Heron processors and associated control electronics, representing a significant step in IBM’s quantum-centric supercomputing architecture. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report International Business Machines Corporation (IBM) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}