{
    "title": null,
    "date": "1/27/2024",
    "url": "https://www.fool.com/investing/2024/01/27/3-dividend-paying-tech-stocks-to-buy-right-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Tech stocks are known more for their significant long-term growth than for their dividends. However, investing in a tech company with a reliable dividend can be an excellent way to expand your portfolio, benefiting from a high-growth industry and by potential dividend reinvestment. It's no coincidence that five of the six most valuable companies on the American stock market are tech firms. The industry generates massive amounts of cash, allowing some larger firms to reward investors with more than just stock growth. While these companies' dividend yields might not compare to some non-tech stocks, they are worth considering along with their stellar share-price appreciation. So here are three dividend-paying tech stocks to buy right now. Microsoft (MSFT -0.17%) is easily one of the most reliable options in tech, having increased its dividend payout for 19 consecutive years. The company raised its dividend yield to 0.75% in 2023, which translates to an annual payout of $3 per share (three times what it was 11 years ago). Consistent dividend growth reflects Microsoft's solid business model. Potent products like Windows, Office, Azure, and Xbox have made the company a tech behemoth. The success of these products has seen its annual revenue rise 144% over the last decade, with operating income up 217%. Meanwhile, free cash flow has soared 134%, hitting more than $63 billion last year. Along with solid financials, there are plenty of reasons to believe Microsoft will continue increasing its dividend. It pays out only about 26% of its earnings in dividends, indicating it could keep growing its dividend even if headwinds arise. Moreover, the company is investing heavily in some of the fastest-growing sectors, including cloud computing and artificial intelligence (AI). Microsoft's lucrative positions in these markets will likely see its earnings continue to soar over the long term. A forward price-to-earnings (P/E) ratio of 35 makes its stock somewhat expensive. However, a dominating role in tech and consistent dividend growth means its stock has likely earned its high valuation and is worth considering right now. Rather than focusing exclusively on high yields, one of the best ways to find dividend stocks is to seek out companies with significant cash resources, like Apple (AAPL -1.06%). A focus on high yields could lead you to an investment in a financially struggling business; meanwhile, a cash cow like Apple can almost guarantee dividend growth over the long term. In the last decade, its dividend yield has increased 120%. It rose to $0.24 per quarter in 2023, with a yield of 0.5%. Apple has increased its dividend for 12 consecutive years, with its payout requiring only about 15% of its earnings. Apple's yield might not be as impressive as popular dividend stocks like Verizon or Coca-Cola, but sticking with its current dividend growth trajectory could see the payouts double again over the next 10 years. With a stock that has risen over 800% since 2014, the company could be one of the smartest long-term investments. And it's hard to argue with Apple's powerful position in tech. The company hit nearly $100 billion in free cash flow last year thanks to the immense popularity of products like the iPhone, MacBook, and iPad, and its many digital services. The company's forward P/E of 29 makes it slightly cheaper than Microsoft but still pricey. However, a reliable dividend and expansions into lucrative markets like AI and virtual reality make its stock a solid buy this month. Nvidia's (NVDA 0.12%) business exploded last year as its graphics processing units (GPUs) became the go-to for AI developers worldwide. The company became the first chipmaker to hit a market cap above $1 trillion, with its stock rising 239% over the 12-month period. The company paid its first dividend in 2013 and increased it every year until November 2018. Its dividend remained a respectable $0.64 annually until May 2021. A 4-for-1 stock split the same year brought its quarterly dividend crashing down to $0.04 per share, for a 0.03% yield, where it currently stands. However, it remains an attractive dividend-paying tech stock. When companies like Amazon and Alphabet have no dividends to speak of, Nvidia's impressive stock growth, alongside even a marginal dividend, makes its stock worth buying. Nvidia's quarterly revenue has climbed 200% over the last year, while operating income has soared 729%. The company is on a promising growth trajectory that will likely see it raise its dividend in the coming years.  Data by YCharts. Moreover, this chart shows that Nvidia's earnings could hit $24 per share by fiscal 2026. Multiplying that figure by the company's forward P/E of 49 yields a stock price of $1,176, projecting stock growth of 96% over the next two fiscal years. Along with a reliable dividend, Nvidia's stock looks like a no-brainer investment right now. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends Verizon Communications. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}