{
    "title": "Is Microsoft Corp (MSFT) Stock Worth a Buy Thursday?",
    "date": "1/18/2024",
    "url": "https://www.investorsobserver.com/news/stock-update/is-microsoft-corp-msft-stock-worth-a-buy-thursday-2",
    "text": "Microsoft Corp (MSFT) stock has gained 66.68% over the last 12 months, and the average rating from Wall Street analysts is a Strong Buy. InvestorsObserver’s proprietary ranking system, gives MSFT stock a score of  71 out of a possible 100. \n\n\n\n\n\nThat rank is primarily influenced by a long-term technical score of 90. MSFT's rank also includes a short-term technical score of 82. \n\n\n\n\n\n\n MSFT has an Overall Score of 71. Find out what this means to you and get the rest of the rankings on MSFT!\nSee Full MSFT Report\n\n\nWhat's Happening with MSFT Stock Today\nMicrosoft Corp (MSFT) stock has gained 0.92% while the S&P 500 has gained 0.79% as of 3:19 PM on Thursday, Jan 18. MSFT has gained $3.57 from the previous closing price of $389.47 on volume of 13,666,681 shares. Over the past year the S&P 500 has gained 21.58% while MSFT has gained 66.68%. MSFT earned $10.33 a per share in the over the last 12 months, giving it a price-to-earnings ratio of 38.05. \n\n Click Here to get the full Stock Report for Microsoft Corp stock. Microsoft Corp (MSFT) stock has gained 66.68% over the last 12 months, and the average rating from Wall Street analysts is a Strong Buy. InvestorsObserver’s proprietary ranking system, gives MSFT stock a score of  71 out of a possible 100. \n\n\n\n\n\nThat rank is primarily influenced by a long-term technical score of 90. MSFT's rank also includes a short-term technical score of 82. \n\n\n\n\n\n\n MSFT has an Overall Score of 71. Find out what this means to you and get the rest of the rankings on MSFT!\nSee Full MSFT Report\n\n\nWhat's Happening with MSFT Stock Today\nMicrosoft Corp (MSFT) stock has gained 0.92% while the S&P 500 has gained 0.79% as of 3:19 PM on Thursday, Jan 18. MSFT has gained $3.57 from the previous closing price of $389.47 on volume of 13,666,681 shares. Over the past year the S&P 500 has gained 21.58% while MSFT has gained 66.68%. MSFT earned $10.33 a per share in the over the last 12 months, giving it a price-to-earnings ratio of 38.05. \n\n Click Here to get the full Stock Report for Microsoft Corp stock. Subscribe to our daily morning update newsletter and never miss out on the need-to-know market news, movements, and more. Thank you for signing up! You're all set to receive the Morning Update newsletter Stock Price data may be delayed up to 15 minutes. Copyright © 2024. Portions of this content may be copyrighted by Fresh Brewed Media, Investors Observer, and/or O2 Media LLC. All Rights Reserved. Portions of this content protected by US Patent numbers 7,865,496, 7,856,390, and 7,716,116. Investing in stocks, bonds, option and other financial instruments involve risks and may not be suitable for everyone. Portfolio results are unaudited and based on varying investment expiration dates. Terms of Service | Privacy Policy "
}