{
    "title": "Microsoft, OpenAI hit with new lawsuit by authors over AI training",
    "date": "1/6/2024",
    "url": "https://www.moneycontrol.com/news/technology/microsoft-openai-hit-with-new-lawsuit-by-authors-over-ai-training-12007401.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now OpenAI and its financial backer Microsoft (MSFT.O) were sued on Friday in Manhattan federal court by a pair of nonfiction authors who say the companies misused their work to train the artificial-intelligence models behind the popular chatbot ChatGPT and other AI-based services. Writers Nicholas Basbanes and Nicholas Gage told the court in a proposed class action that the companies infringed their copyrights by including several of their books as part of the data used to train OpenAI's GPT large language model. Representatives for Microsoft and OpenAI did not immediately respond to requests for comment on the complaint. The lawsuit follows several others filed by fiction and nonfiction writers ranging from comedian Sarah Silverman to \"Game of Thrones\" author George R.R. Martin against tech companies over the alleged use of their work to train AI programs. The New York Times also sued OpenAI and Microsoft last week over the use of its journalists' work to train AI applications.Basbanes and Gage are both former journalists. Their lawyer, Michael Richter, said it was \"outrageous\" that the companies could use their works to \"power a new billion-dollar-plus industry without any compensation.\"  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}