{
    "title": "Microsoft: the world's most valuable company",
    "date": "2/16/2024",
    "url": "https://www.intelligentinvestor.com.au/recommendations/microsoft-the-worlds-most-valuable-company/153292",
    "text": "Microsoft just capped off one of the great corporate turnarounds. The tech giant has surpassed Apple as the world’s most valuable company, boasting a US$3tn valuation. It’s an enormous figure that demands some context. A little over a decade ago, the Big Australian BHP was worth more than Microsoft. Then, an arrogant and complacent Windows-centric culture allowed rivals to seize control of search, social media, and smartphones. Many questioned if the company would recover. Login or to reset your password, select Forgotten password We have sent you an email with the details of your registration.  SMS code cannot be sent due to: {{ twilioStatus }} Looks you are already a member. Please enter your password to proceed Not a member? Sign up Forgotten password? Click here {{mfaTokenResponseText}} The code you entered is incorrect. Please try again. {{ upgradeCTAText }} Please make sure your payment details are up to date to continue your membership. Having trouble renewing? Please contact Member Services on support@investsmart.com.au or 1300 880 160 It may take a few minutes to update your subscription details, during this time you will not be able to view locked content. If you are still having trouble viewing content after 10 minutes, try logging out of your account and logging back in. Still having trouble viewing content? Please contact Member Services on support@investsmart.com.au or 1300 880 160 Forgotten password? Click here Registration for this event is available only to Eureka Report members. View our membership page for more information. Registration for this event is available only to Intelligent Investor members. View our membership page for more information. Please enter your email address below to request a new password Not a member? Sign up Already a member? Log in By default, members will receive the following communications via email. At any time, once logged in, you can choose which emails your wish to receive (or not) via the My Details section: Mid-week update - Lists all the research and recommendations from the week. Weekend Briefing - An overview of the week gone and what to expect in the week to come. If you add your investments to the portfolio manager you will also receive regular updates including; recommendations, alerts, market pricing, dividends, profit & loss and your overall net wealth. Featured reports, invites to investor seminars and events, plus exclusive offers. As an InvestSMART group member, you will occasionally receive operational updates. These could be about new features, changes to your membership, security information, or general business updates. Proudly IMPORTANT: This information is general financial product advice only and you should consider the relevant Product Disclosure Statement (PDS),  Financial Services Guide (FSG), Target Market Determination (TMD) or seek professional advice before making any investment decision. The PDS for financial products offered through InvestSMART can be downloaded from this website or obtained by contacting 1300 880 160. * InvestSMART’s capped management fees (capped at $550 p.a.) do not include indirect cost ratio charged by ETF providers nor brokerage.  Indirect Costs are estimated to be between 0.09% - 0.30% p.a. depending on the portfolio.  For more information about fees and costs, please see the Product Disclosure Statement and Investment Menu. # Performance figures are after management and admin fees excl. brokerage and assuming dividends re-invested and no withdrawals. Performance figures for periods greater than one year are annualised and presented as \"per annum\" values. The peer comparison figures have been sourced from Morningstar data and is therefore limited to the funds and investment products included in their database. This may not include all funds available for retail investment in Australia. The peer calculation is inclusive of admin and management fees; excludes brokerage and no withdrawals have been made. InvestSMART cannot determine whether or not franking has been included, nor if dividends have been reinvested. Historical performance is not a reliable indicator of future performance. ^ Only funds and investment products included in the Morningstar Australia database are available for fee and performance comparison. This may not include all funds available for retail investment in Australia. Only funds with > three year returns were included in any fee comparison, and were compared to Morningstar’s nominated benchmark. Fees are calculated by Morningstar as the average over 10 years. Whilst every care has been taken in producing these numbers, InvestSMART does not guarantee the accuracy of the figures produced in the table. Fee data may not include all costs being charged such as platform and adviser fees. For the effect of fees on your cumulative returns, please see our report How Fees Can Destroy Your Wealth. ^^ The performance figures for the Intelligent Investor Income and Growth Model Portfolios are since inception on 1 August 2001 using theoretical buys and sells without brokerage and management fees until 1 July 2015. After the 1 July 2015 performance figures (after fees and brokerage) were recorded from the Separately Managed Accounts that mirrored these models. After 18 June 2019 performance figures (after fees and brokerage) have been recorded from the Australian Equity Income ETF (ASX: INIF) which mirrors the Income Model and after 5 October 2020 performance figures (after fees and brokerage) have been recorded from the Australian Equity Growth ETF (ASX: IIGF) which mirrors the Growth Model. Past performance may not be a reliable indicator of future performance. "
}