{
    "title": "Microsoft Corporation's (NASDAQ:MSFT) high institutional ownership speaks \nfor itself as stock continues to impress, up ...",
    "date": "2/12/2024",
    "url": "https://finance.yahoo.com/news/microsoft-corporations-nasdaq-msft-high-130011545.html",
    "text": "Institutions' substantial holdings in Microsoft implies that they have significant influence over the company's share price The top 25 shareholders own 43% of the company Insiders have sold recently A look at the shareholders of Microsoft Corporation (NASDAQ:MSFT) can tell us which group is most powerful. And the group that holds the biggest piece of the pie are institutions with 72% ownership. Put another way, the group faces the maximum upside potential (or downside risk). And as as result, institutional investors reaped the most rewards after the company's stock price gained 3.7% last week. The gains from last week would have further boosted the one-year return to shareholders which currently stand at 56%. Let's take a closer look to see what the different types of shareholders can tell us about Microsoft. See our latest analysis for Microsoft Institutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index. Microsoft already has institutions on the share registry. Indeed, they own a respectable stake in the company. This implies the analysts working for those institutions have looked at the stock and they like it. But just like anyone else, they could be wrong. When multiple institutions own a stock, there's always a risk that they are in a 'crowded trade'. When such a trade goes wrong, multiple parties may compete to sell stock fast. This risk is higher in a company without a history of growth. You can see Microsoft's historic earnings and revenue below, but keep in mind there's always more to the story. Since institutional investors own more than half the issued stock, the board will likely have to pay attention to their preferences. We note that hedge funds don't have a meaningful investment in Microsoft. The company's largest shareholder is The Vanguard Group, Inc., with ownership of 8.7%. With 7.2% and 3.9% of the shares outstanding respectively, BlackRock, Inc. and State Street Global Advisors, Inc. are the second and third largest shareholders. Our studies suggest that the top 25 shareholders collectively control less than half of the company's shares, meaning that the company's shares are widely disseminated and there is no dominant shareholder. While it makes sense to study institutional ownership data for a company, it also makes sense to study analyst sentiments to know which way the wind is blowing. Quite a few analysts cover the stock, so you could look into forecast growth quite easily. The definition of an insider can differ slightly between different countries, but members of the board of directors always count. Company management run the business, but the CEO will answer to the board, even if he or she is a member of it. Most consider insider ownership a positive because it can indicate the board is well aligned with other shareholders. However, on some occasions too much power is concentrated within this group. Our most recent data indicates that insiders own less than 1% of Microsoft Corporation. Being so large, we would not expect insiders to own a large proportion of the stock. Collectively, they own US$1.1b of stock. It is good to see board members owning shares, but it might be worth checking if those insiders have been buying. The general public-- including retail investors -- own 28% stake in the company, and hence can't easily be ignored. While this size of ownership may not be enough to sway a policy decision in their favour, they can still make a collective impact on company policies. While it is well worth considering the different groups that own a company, there are other factors that are even more important. Consider risks, for instance. Every company has them, and we've spotted   1 warning sign for Microsoft   you should know about. But ultimately  it is the future, not the past, that will determine how well the owners of this business will do. Therefore we think it advisable to take a look at this free report showing whether analysts are predicting a brighter future. NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}