{
    "title": "FWD Group partners with Microsoft to shape the future of AI-driven \ninsurance experiences",
    "date": "2/25/2024",
    "url": "https://www.specialtimes.co.kr/news/articleView.html?idxno=340062",
    "text": "HONG KONG, Feb. 26, 2024 /PRNewswire/ -- FWD Group Holdings Limited (\"FWD Group\" or \"FWD\") today announced it is extending its partnership with Microsoft with a four-year agreement to provide access to the latest generative artificial intelligence (AI) innovations, while continuing to support FWD's cloud-first technology strategy. FWD Group plans to drive its generative AI initiatives by leveraging Microsoft's Azure OpenAI Service and other enterprise-grade innovations. FWD Group expects to benefit from the private networking, monitoring and security capabilities of Microsoft Azure as well as its advanced AI models. Ryan Kim, Group Chief Digital Officer of FWD Group, said, \"Digital innovation has always been core to FWD's vision of changing the way people feel about insurance. This collaboration marries FWD's pioneering spirit in Asia in some of the fastest growing insurance markets in the world, with the global scale and skill that Microsoft brings in engineering and AI. \"We're excited to harness more next-generation innovations to develop new industry use cases and standards that we believe will shape the insurance journey of the future.\" FWD Group is working to enhance the customer experience and its operations in areas like acquisition, marketing, channel and agent performance, underwriting, claims and customer service. The company is also an early adopter of Copilot for Microsoft 365, an AI companion that supports employees in their day-to-day work. Bill Borden, Corporate Vice President of Worldwide Financial Services, Microsoft, said, \"AI is driving transformation across the financial services industry, opening new opportunities for innovation and business growth with agility and at scale. We are thrilled to strengthen our AI partnership with FWD by offering Azure OpenAI Service and Copilot for Microsoft 365 capabilities to enable world-class customer experiences and operations securely and responsibly. \"As a pivotal player in the global financial landscape, the Asia Pacific region stands out for its dynamism and adaptability, fostering continuous growth and driving innovation. We are committed to empowering our customers in the region with generative AI capabilities in a responsible way. With Microsoft's enterprise-grade AI advancements, we are helping the financial services ecosystem accelerate innovation to drive operational efficiency and greater value creation to customers.\" FWD Group embarked on its AI journey in 2019 and now has almost 200 active AI models applied across its business, with over 600 use cases. About FWD Group FWD Group is a pan-Asian life insurance business with more than 11 million customers across 10 markets, including some of the fastest-growing insurance markets in the world. FWD reached its 10-year anniversary in 2023. The company is focused on making the insurance journey simpler, faster and smoother, with innovative propositions and easy-to-understand products, supported by digital technology. Through this customer-led approach, FWD is committed to changing the way people feel about insurance. For more information, please visit www.fwd.com About Microsoft Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organisation on the planet to achieve more.  "
}