{
    "title": "Stock-Split Watch: Is Microsoft Next?",
    "date": "2/18/2024",
    "url": "https://www.fool.com/investing/2024/02/18/stock-split-watch-is-microsoft-next/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Since last year, some great technology stocks have run wild on the market's enthusiasm for artificial intelligence (AI). For example, Microsoft (MSFT -0.17%) has spiked to over $400 per share, which makes it harder for individual investors to accumulate shares for their portfolios. Not many people are sitting on thousands of dollars to buy shares. That puts the company on watch for a possible stock split. Companies splitting their stock is a common practice that can benefit investors and employees. But investors must know about some important rules for stock splits. Here is why Microsoft could split its stock and what you need to know if it happens. Stock splits aren't just for fun; they do good things for investors and company employees. For investors, a high share price makes accumulating full shares harder. Many companies issue stock to employees as part of their compensation. A high share price can make it harder for employees to control how they liquidate their stock. Splitting the stock lowers the share price, lessening this problem for buyers and sellers alike. Microsoft has split its stock many times before, but all of its splits happened many years ago. The stock split nine times from the late 1980s to the early 2000s but hasn't split once since then. As you can see below, the share price has now appreciated many times over:  MSFT data by YCharts The company launched Azure and the cloud computing age in 2010, and 2023 potentially marks the beginning of Microsoft's next golden age, artificial intelligence (AI). A split would help investors and employees position themselves for what seems like a very bright future. Investors' biggest mistake with stock splits is associating a lower share price with a cheaper valuation. Remember that price and valuation aren't the same. In other words, investors are paying a certain amount for a piece of the underlying company's profits. Splitting the stock cuts the company into more pieces but those pieces each represent less of the company's profits. Analysts believe Microsoft will earn $11.60 per share this fiscal year, which, for Microsoft, ends in June. Suppose Microsoft announces a 10-for-1 split, meaning that one share of stock will turn into 10 smaller shares. For a $400 stock, that's 10 shares priced at $40 each. Microsoft's profits would also be split 10 ways, meaning earnings per share would be $1.16. The stock's P/E ratio would remain the same because $400 divided by $11.16 and $40 divided by $1.16 get the same answer: 34.5. You shouldn't buy a stock based on whether or not it splits, because it doesn't impact how much bang you're getting for your buck. Instead, consider comparing Microsoft's valuation with what its growth might look like. Today, Microsoft's P/E ratio is roughly 35, and analysts expect the company's earnings to grow by an average of 15% annually over the long term. That's a PEG ratio of 2.3, which indicates Microsoft is a bit expensive for the growth you might get (a PEG ratio of 1 indicates a fair price).  MSFT PE Ratio (Forward) data by YCharts It's not a science; the company might grow faster than expected (or slower), and the narrative may be different in hindsight. A long-term horizon always helps because it gives Microsoft more time to grow into and beyond the stock's valuation. Whether or not you buy Microsoft, make sure you're doing it based on fundamentals and not a possible stock split. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}