{
    "title": "Tech investors showed their insatiable appetite this week",
    "date": "2/2/2024",
    "url": "https://finance.yahoo.com/news/tech-investors-showed-their-insatiable-appetite-this-week-110607768.html",
    "text": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with: The chart of the day What we're watching What we're reading Economic data releases and earnings The years of cost efficiency being enough are over, and investors showered by gains from Big Tech are looking for more. Primed by towering expectations of an AI-fueled transformation and narratives of relentless growth, the market is applying the same cutthroat logic of more with less. But instead of executives touting their efficiency to eke through tough quarters, it’s shareholders applying the pressure for perfection. Alphabet (GOOG, GOOGL) and Microsoft (MSFT) were on the receiving end of the squeeze this week. The pair surpassed analyst expectations, but investors fixated on the perceived weak points, collectively pining for outstanding results to justify holding expensive stocks. But the areas that appeared softer — ad revenue and cloud growth — only seemed squishy when investors applied a harsh rubric to the trillion-dollar giants. It's not enough for results to flirt with forecasted figures, or beat them. Only a smashing success can fully satiate Big Tech shareholders. Meta (META) and Amazon (AMZN) delivered the goods on Thursday, offering strong outlooks for the months ahead, and in CEO Mark Zuckerberg's case, introducing a sweetener: a new dividend. Investors rejoiced. The forking paths of Big Tech's siblings this week highlight the unforgiving judgment of investors accustomed to abundance. Doing merely great isn't going to cut it. As analyst Dan Ives said, following what he saw as a successful Microsoft report, the quarter \"should be printed out and hung in the Louvre.\" But investors figuratively opted to skip the exhibit, highlighting the mismatch between inflated desire and what booming enterprises can deliver. Investors expressed other financial qualms among otherwise thriving businesses. The grand pitch that executives are selling about AI’s transformative power apparently also comes with some fine print in the form of heavy up-front investments. Alphabet reported capital expenditures that ballooned 45% for the quarter, exceeding $11 billion. Microsoft too recorded a 55% increase in capex. The boosted spending in Alphabet’s case was tied mostly to servers and data centers, the company said, as it prepares for the long-term growth potential of global AI applications. And there’s more where that came from. CFO Ruth Porat said that investment in capex will be noticeably larger in 2024. The tech, just like popular excitement, can be a challenge to prop up. Even purchasing the fuel to drive the dream of AI dominance can count against you. Hamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on Twitter @hshaban. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Related Quotes "
}