{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.cmcmarkets.com/en-au/opto/alibabas-big-ai-bet-japan-chip-drive-eu-investigates-microsoft",
    "text": "5 Top Stories By OPTO  28 Feb 2024, 04:00 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. Alibaba [BABA] led a $1bn funding round for Moonshot AI, pushing the valuation of the Chinese artificial intelligence (AI) start-up to some $2.5bn. This was the latest in a series of major investments on the part of the e-commerce giant, and the largest single financing round for an AI firm in the country, Bloomberg reported. Founded in March 2023, Moonshot AI launched its Kimi chatbot last November, and has since released a platform that lets developers build AI apps. US start-up Tenstorrent, headed by Tesla [TSLA] and Apple [AAPL] veteran Jim Keller, is to partner with Rapidus, the research group that has been funded by the Japanese government to lead on its drive to develop the semiconductor sector. Together, they will work on the design of Japan’s first advanced AI chip. Elsewhere, Samsung Electronics [005930.KS] said on Tuesday it has developed a new memory chip aimed at AI, and that it has the “highest capacity” in the industry. The software company [U] share price fell in extended training on Monday, after it said that it plans to exit its hardware components businesses for multiplayer games, which it says operated at a significant loss. Unity will focus instead on its main products for video game creators. “We believe that we are making the right interventions to win with customers for many years to come through a more focused portfolio,” the company said in a letter to shareholders. The EU’s competition watchdog is to look into Microsoft’s [MSFT] €15m investment in Mistral AI. On Monday, Mistral announced a “strategic partnership” with the software giant, which will involve making its AI models available to Microsoft Azure cloud customers. Meanwhile, Microsoft’s relationship with OpenAI is being investigated by regulators in both the UK and the EU, and Alphabet [GOOGL] has intensified criticism of Microsoft’s cloud “monopoly”. The Zoom [ZM] share price gained more than 10% in extended trading Monday, after the firm reported quarterly sales and profit above analysts’ estimates. It also announced a $1.5bn share buyback. Having been a pandemic darling, Zoom saw a major sales slowdown amid competition from Microsoft’s Teams. It has since expanded its offering to include phone systems, call centres and AI assistants. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles 5 Top Stories Intuitive Falls; ARK Trims TSM; Samsung Wearables The Intuitive Machines share price dropped by some 30% Monday, after the space exploration firm announced that its Odysseus moon lander had fallen over. 26 Feb 2024 Analysis What Gives ARK Invest Its Edge? Cathie Wood, Founder, CEO, and CIO of ARK Invest, discusses what sets the company apart from competitors with OPTO Sessions. 25 Feb 2024 5 Top Stories Nvidia Barnstormer; Intel Announcements; Chinese Cyberattacks Shares in chipmaker wunderkind Nvidia surged in early trading, after it beat analyst forecasts with its latest earnings. 22 Feb 2024 5 Top Stories Uber Robots in Japan; Apple Under Fire; Ford Slashes Prices The ride-hailing giant has announced that it is to start transporting food using autonomous robot couriers in Tokyo. 21 Feb 2024 © 2024 CMC Markets Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Chi-X (Chi-X Australia), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Terms and Conditions, Product Disclosure Statement ('PDS') and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Our Financial Services Guide contains details of our fees and charges. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. "
}