{
    "title": "A decade of tech triumphs",
    "date": "2/4/2024",
    "url": "https://borneobulletin.com.bn/a-decade-of-tech-triumphs/",
    "text": "NEW YORK (AP) – Satya Nadella, marking a decade as Microsoft CEO, led the company through a remarkable decade of growth, with its stock soaring over 1,000 per cent and achieving a market value of USD3 trillion. Since taking the helm in 2014, Nadella’s strategic vision steered the slow-moving software giant towards a laser focus on cloud computing and artificial intelligence (AI), propelling Microsoft to new heights. This growth surpasses the broader S&P 500, with Microsoft’s market value now exceeding that of any US publicly traded company, including its long-time rival, Apple. Nadella’s transformative impact is widely recognised, with Wedbush Securities analyst Daniel Ives stating, “Nadella’s had the biggest transformation of a tech company potentially ever.” Comparisons are drawn to Steve Jobs’ turnaround of Apple with the iPhone, highlighting the magnitude of Microsoft’s shift under Nadella’s leadership. Shareholder wealth creation has been extraordinary, reaching USD2.8 trillion in the past decade. An investor who bought a USD10,000 stake in Microsoft at the time Nadella took over would now hold a stake worth about USD113,000. The transformation under Nadella was swift. He redirected resources towards building up the Azure cloud computing platform, a departure from the company’s historical reliance on its flagship Windows operating system. Notably, he curtailed Microsoft’s ill-fated attempts to catch up in the smartphone market, marked by the USD7.3 billion acquisition of Nokia’s phone business under his predecessor, Steve Ballmer. However, the most significant changes were not just strategic but cultural. Nadella shifted Microsoft’s internal dynamics from a brash and competitive environment to a more collaborative approach. His “learn-it-all” culture, in contrast to a traditional “very strong ego CEO,” emphasises a measured approach to explaining future directions. Raimo Lenschow, a stock analyst at Barclays, notes that Nadella treats everyone with respect, fostering a more inclusive and collaborative company culture. Nadella’s leadership style was evident even in casual encounters, such as his interest in a startup at CES. A small Michigan-based startup, showcasing its product Audio Radar for deaf and hard-of-hearing gamers, received a visit from Nadella. The founder, Tim Murphy, described Nadella as “very down to earth,” showcasing genuine curiosity and engagement. Beyond business success, Nadella’s commitment to accessibility in technology is deeply personal. Raised a son who was visually impaired, quadriplegic, and had cerebral palsy, Nadella has long prioritised making technology inclusive. His influence on Microsoft’s emergence as an AI leader has been substantial, setting the agenda on how AI tools are used in work and society. The partnership with OpenAI, creator of ChatGPT, played a pivotal role in Microsoft’s AI advancements. Historically, Microsoft might not have been the first choice for innovative startups, but Nadella secured OpenAI’s commitment to Azure, providing a significant competitive advantage over Google and Amazon. Despite Nadella’s success, his tenure has not been without challenges. Cybersecurity concerns persist, with Microsoft’s tendency to prioritize convenience over security highlighted. Instances of successful compromises of Microsoft Office 365 have raised questions about the company’s approach to safeguarding sensitive information. Additionally, ongoing antitrust scrutiny has resurfaced, putting Microsoft under the regulatory spotlight once again. Nadella’s response to these challenges has been notable. He has called for a cyber Geneva Convention with Russia and China, emphasising the need for global collaboration in addressing cybersecurity threats. His confident testimony at a federal court hearing helped secure approval for Microsoft’s purchase of video game giant Activision Blizzard. Looking ahead, Nadella, 56, appears poised to continue leading Microsoft through these challenges. Despite the complexities of the cybersecurity landscape and renewed antitrust scrutiny, his leadership role and enjoyment in navigating these “very, very, very interesting times” signal a commitment to staying at the helm for a while, according to analyst Raimo Lenschow. Borneo Bulletin is the leading English daily in the country. It was first published by Brunei Press. Today, Borneo Bulletin has become the foremost source of information on local and foreign affairs, and the region’s business news. © 2013 Borneo Bulletin Online - The Independent Newspaper in Brunei Darussalam, Sabah and Sarawak "
}