{
    "title": null,
    "date": "3/16/2024",
    "url": "https://greekcitytimes.com/2024/03/17/microsoft-and-gek-terna-join-forces-for-the-construction-of-first-data-center-in-spata/",
    "text": "The managing director of the US giant for Greece, Cyprus and Malta, Gianna Andronopoulou, said yesterday in a press briefing that the licences for the preliminary works have been received. Answering related questions, Andronopoulou noted that the licensing process did not proceed as quickly as Microsoft would have liked, however, the company’s intention is to speed up the construction and this is helped by the public and private sector’s interest in technology and in particular in cloud services. The construction of the Microsoft Data Center in Spata will start at the beginning of April, the managing director of the US giant for Greece, Cyprus and Malta, Gianna Andronopoulou, revealed on Monday. It is recalled that Microsoft is proceeding with the construction and operation of three data centres, with a total budget of 976.168 million euros (excluding VAT). This investment has been characterized as strategic, offering the possibility of rapid licensing and zoning through the preparation of a Special Spatial Development Plan. The US giant is financing its investment in Greece with 100% equity. The total budget concerns the purchase of the plots for 77,400 million, the construction of the data centres for 404,956 million, and their technological and digital equipment for 264,192 million. The operational costs for the eight years are estimated at 229,620 million euros, including payroll costs, facility management costs, maintenance, etc. The investment is considered important for the digital transformation of the economy while generally helping all investments in the Information and Communication Technologies (ICT) sector. You must be logged in to post a comment.  Copyright Greekcitytimes 2024 Copyright Greek City Times 2024 To provide the best experiences, we and our partners use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us and our partners to process personal data such as browsing behavior or unique IDs on this site and show (non-) personalized ads. Not consenting or withdrawing consent, may adversely affect certain features and functions. Click below to consent to the above or make granular choices. Your choices will be applied to this site only. You can change your settings at any time, including withdrawing your consent, by using the toggles on the Cookie Policy, or by clicking on the manage consent button at the bottom of the screen.    "
}