{
    "title": "TransDigm Group Incorporated (NYSE:TDG) Receives $1,096.73 Average PT from \nAnalysts",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-tdg-consensus-analyst-rating-2024-03-19/",
    "text": "TransDigm Group Incorporated (NYSE:TDG - Get Free Report) has been assigned an average rating of \"Moderate Buy\" from the sixteen ratings firms that are currently covering the stock, MarketBeat.com reports. Five analysts have rated the stock with a hold recommendation and eleven have assigned a buy recommendation to the company. The average twelve-month target price among brokerages that have covered the stock in the last year is $1,096.73. Several analysts have issued reports on the company. Royal Bank of Canada boosted their target price on TransDigm Group from $1,150.00 to $1,250.00 and gave the company an \"outperform\" rating in a research note on Friday, February 9th. William Blair initiated coverage on shares of TransDigm Group in a research report on Tuesday, December 12th. They set an \"outperform\" rating for the company. Susquehanna boosted their price target on shares of TransDigm Group from $875.00 to $1,100.00 and gave the company a \"neutral\" rating in a research report on Friday, February 9th. StockNews.com lowered shares of TransDigm Group from a \"buy\" rating to a \"hold\" rating in a research note on Friday, February 9th. Finally, The Goldman Sachs Group boosted their target price on shares of TransDigm Group from $1,164.00 to $1,285.00 and gave the company a \"buy\" rating in a report on Friday, February 9th. Read Our Latest Stock Report on TransDigm Group TDG traded up $19.92 during trading on Tuesday, hitting $1,200.92. 174,351 shares of the company's stock were exchanged, compared to its average volume of 222,827. The stock has a market cap of $66.78 billion, a P/E ratio of 50.13, a PEG ratio of 2.45 and a beta of 1.42. The business's 50 day moving average is $1,123.03 and its two-hundred day moving average is $988.75. TransDigm Group has a fifty-two week low of $689.66 and a fifty-two week high of $1,207.58. TransDigm Group (NYSE:TDG - Get Free Report) last posted its earnings results on Thursday, February 8th. The aerospace company reported $7.16 earnings per share for the quarter, beating analysts' consensus estimates of $6.41 by $0.75. TransDigm Group had a negative return on equity of 59.61% and a net margin of 20.80%. The company had revenue of $1.79 billion for the quarter, compared to analyst estimates of $1.68 billion. During the same quarter last year, the company earned $4.15 earnings per share. The company's revenue for the quarter was up 28.1% on a year-over-year basis. On average, sell-side analysts forecast that TransDigm Group will post 28.98 earnings per share for the current year. In related news, Director W Nicholas Howley sold 38,863 shares of the business's stock in a transaction dated Wednesday, January 10th. The stock was sold at an average price of $1,015.05, for a total value of $39,447,888.15. Following the sale, the director now directly owns 21,548 shares in the company, valued at $21,872,297.40. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available through this link. In related news, COO Joel Reiss sold 3,000 shares of the stock in a transaction dated Tuesday, January 16th. The shares were sold at an average price of $1,022.29, for a total value of $3,066,870.00. Following the sale, the chief operating officer now directly owns 3,600 shares of the company's stock, valued at approximately $3,680,244. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, Director W Nicholas Howley sold 38,863 shares of the business's stock in a transaction that occurred on Wednesday, January 10th. The shares were sold at an average price of $1,015.05, for a total value of $39,447,888.15. Following the transaction, the director now owns 21,548 shares of the company's stock, valued at approximately $21,872,297.40. The disclosure for this sale can be found here. Insiders have sold 91,480 shares of company stock valued at $100,102,829 over the last ninety days. Insiders own 4.96% of the company's stock. Hedge funds have recently bought and sold shares of the business. Fisher Asset Management LLC purchased a new stake in shares of TransDigm Group during the fourth quarter valued at $227,000. Wellington Management Group LLP increased its position in shares of TransDigm Group by 22.2% during the fourth quarter. Wellington Management Group LLP now owns 2,640 shares of the aerospace company's stock worth $2,671,000 after acquiring an additional 479 shares during the period. American International Group Inc. raised its stake in shares of TransDigm Group by 2.6% during the fourth quarter. American International Group Inc. now owns 15,225 shares of the aerospace company's stock valued at $15,402,000 after acquiring an additional 382 shares in the last quarter. EP Wealth Advisors LLC boosted its holdings in shares of TransDigm Group by 1.6% in the fourth quarter. EP Wealth Advisors LLC now owns 6,045 shares of the aerospace company's stock valued at $6,115,000 after purchasing an additional 96 shares during the period. Finally, Syon Capital LLC grew its stake in TransDigm Group by 5.9% in the fourth quarter. Syon Capital LLC now owns 304 shares of the aerospace company's stock worth $308,000 after purchasing an additional 17 shares in the last quarter. Institutional investors own 95.78% of the company's stock. TransDigm Group Incorporated designs, produces, and supplies aircraft components in the United States and internationally. The Power & Control segment offers mechanical/electro-mechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, batteries and chargers, databus and power controls, sensor products, switches and relay panels, hoists, winches and lifting devices, and cargo loading and handling systems.Further ReadingFive stocks we like better than TransDigm GroupBest Aerospace Stocks Investing Growing Twice as Fast as Tesla, XPeng is a BuyComparing and Trading High PE Ratio Stocks4 Stocks Building Long-Term Value for Shareholders Options Trading - Understanding Strike PriceFedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount  Before you consider TransDigm Group, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and TransDigm Group wasn't on the list. While TransDigm Group currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here If a company's CEO, COO, and CFO were all selling shares of their stock, would you want to know? Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}