{
    "title": "Microsoft (MSFT) Posts Big Earnings Beat, Azure Revenues Up 90%",
    "date": "3/22/2024",
    "url": "https://ca.movies.yahoo.com/movies/microsoft-msft-posts-big-earnings-212909701.html",
    "text": "Microsoft Corp. MSFT just released its first quarter fiscal 2018 financial results, posting earnings of 84 cents per share and revenues of $24.5 billion. Currently, MSFT is a Zacks Rank #3 (Hold), and is up about 2% to $80.36 per share in trading shortly after its earnings report was released. The tech giant: Beat earnings estimates. Microsoft reported earnings of 84 cents per share, beating the Zacks Consensus Estimates of 72 cents per share. Net income was $6.6 billion for the quarter. Beat revenue estimates. The company saw revenue figures of $24.5 billion, beating our consensus estimates of $23.52 billion and increasing 12% year-over-year. Operating income came in at $7.7 billion and increased 15% from the prior-year quarter. Microsoft said that revenue in Intelligent Cloud was $6.9 billion, a 14% year-over-year gain; its Azure cloud platform saw 90% revenue growth, while server products and cloud services revenue increased 17%. And, the company said that LinkedIn contributed $1.1 billion in revenue during Q3. “This quarter we exceeded $20 billion in commercial cloud ARR, outpacing the goal we set just over two years ago,” said Satya Nadella, chief executive officer at Microsoft. “Our results reflect accelerating innovation and increased usage and engagement across our businesses as customers continue to choose Microsoft to help them transform.” Microsoft Corporation Price, Consensus and EPS Surprise | Microsoft Corporation Quote Microsoft builds and develops products that include operating systems for computing devices, servers, phones, and other intelligent devices; server applications for distributed computing environments; cross-device productivity applications; business solution applications; desktop and server management tools; software development tools; video games; and online advertising. They also design and sell hardware including PCs, tablets, gaming and entertainment consoles, phones, other intelligent devices, and related accessories. They offer cloud-based solutions that provide customers with software, services, platforms, and content.  Looking for Stocks with Skyrocketing Upside?Zacks has just released a Special Report on the booming investment opportunities of legal marijuana.Ignited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look. See the pot trades we're targeting>> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report To read this article on Zacks.com click here. A man suspected of using guns and explosives to hold four people hostage in a Dutch cafe was detained by police on Saturday, after a dramatic hours-long standoff that involved scores of armed police and a remote-controlled robot. WASHINGTON (AP) — As Donald Trump campaigns on promises of mass deportations and pardons for those convicted in the Jan. 6, 2021, riot at the Capitol, his ideas are being met with little pushback and some enthusiasm by a new era of Republicans in Congress. It’s a shift from the first time around when the presumptive Republican presidential nominee encountered early skepticism and, once in a while, the uproar of condemnation. Rather than being dismissed as campaign bluster or Trump speaking his m IBKR EventTrader - A new, straightforward way to trade CME futures markets Follow the latest updates from St James' Park as the Premier League returns From the outside, Johannesburg does not look like it is doing well. Nearly four in five NASUWT teacher members in England said they do not support moving to a national statutory ballot for industrial action.  Exclusive: Senior officers tried to set up a food bank for recruits as figures reveal scale of police food poverty The siblings, 34, posted several videos on TikTok Friday Investigator footage provided glimpses from inside the Dali cargo ship that collided with the Francis Scott Bridge in Baltimore on Tuesday, March 24, causing it to collapse.The footage, filmed by the National Transport Safety Board (NTSB) on March 28 and released a day later, shows investigators inspecting the damage from inside the container vessel. The NTSB said those aboard downloaded the voyage data from the ship.NTSB chair Jennifer Homendy previously told NBC that the investigation could take up to two years to complete. Credit: NTSB via Storyful  Follow all the live action from the 2024 Boat Race in the blog below With March Madness in full swing, you may have seen a funny AT&T commercial that showcases Kendrick Perkins, Carmelo Anthony, and TJ Ford, players from the 2003 NBA Draft. In partnership with AT&T, Perk took some time out of his hectic schedule to ... Spurs welcome the Hatters to town looking to get back on track  Tesla is the worst S&P 500 stock in 2024 as analysts slash earnings estimates. China EV giant BYD is ramping up a price war. LMPD: Man shot several times in The Highlands area following vehicle crash, argument Inconsistent Blues hope to enjoy home comforts against relegation contenders  Meteorologist Taylor Cox shows calmer wind today, but breezy for tomorrow, then storms on Monday. The Blues look to extend a strong run at Stamford Bridge The enigmatic masked trio from Melbourne hypnotise with a psychedelic fusion of Aussie surf rock and traditional Indian music  \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" As Germany authorises the consumption and cultivation of cannabis from 1 April, the mayor of Strasbourg is calling for the introduction of a local 'experiment' to move away from France's repressive approach to marijuana. According to Mayor Jeanne Barseghian: \"In a shared catchment area, we are going to have two different sets of regulations, almost diametrically opposed, between Germany, which authorises the recreational use of cannabis, and France, which has one of the most repressive sets of l The Emmy nominee tells PEOPLE she and the actor \"have a very lovely friendship\" that feels like \"we've known each other for many lifetimes\" "
}