{
    "title": "Putin-Backed Russian Hacking Group Infiltrates Microsoft Systems",
    "date": "3/9/2024",
    "url": "https://www.financial-world.org/news/news/financial/25271/putinbacked-russian-hacking-group-infiltrates-microsoft-systems/",
    "text": "The well-known hacking group Nobelium from Russia, which is supported by Putin, breached the security systems of Microsoft, and this group has previously been associated with cyber attacks on American companies Hackers supported by the Russian state, as part of a sophisticated attack, managed to get through Microsoft's core software systems, the company said. It has been confirmed that it is a hacking group that is directly financed by the Kremlin. The discovery of this attack dates back to January, when the company's security team noted unusual activity on corporate email accounts, which led to the conclusion that hackers had managed to penetrate vital parts of Microsoft's systems. Russian hackers, identified as the Nobelium group, have been identified as the culprits behind this attack, ABC News reported, emphasizing the seriousness of the situation. This is a well-known hacker group from Russia that has previously been linked to cyber attacks against American companies. Microsoft said in recent weeks it has noticed activity by Russian hackers using information from corporate email systems to gain unauthorized access. This includes access to parts of the company's source code and internal systems, which is a serious security breach. Urgent intervention is now needed to repair the damage and time limit the group from exploiting this stolen information. So far, Microsoft claims that no evidence has been found that customer systems have been compromised as a result of this attack, but the situation is still under evaluation. Microsoft pointed out that it is still not possible to assess the extent to which this incident will affect the company's financial condition or business results. However, security experts warn that such attacks can have serious consequences, including loss of user trust and damage to the company's reputation. Then this case may encourage other hacker groups to increase their attacks due to the vulnerability of Microsoft's security systems. This is not the first time Russian hackers have been linked to cyberattacks on major tech companies. The global community is becoming increasingly aware of the growing threat posed by such attacks, and companies such as Microsoft are expected to take additional measures to protect their systems and users from future incidents if they do not want to further damage the company's reputation. Microsoft remains focused on its users and continuously works to improve the security of its systems to ensure the stability and reliability of its services in the future, the company announced. "
}