{
    "title": "Microsoft and Mistral AI's Multi-Million Euro Partnership to Reshape AI \nLandscape, New Challenger to OpenAI's Dominance",
    "date": "3/3/2024",
    "url": "https://www.techtimes.com/articles/302240/20240303/microsoft-mistral-ais-multi-million-euro-partnership-reshape-ai-landscape.htm",
    "text": " Microsoft is doubling down on its commitment to artificial intelligence (AI) innovation. Beyond its substantial investments in OpenAI and the integration of AI into products like Copilot in Windows 11, the tech giant is extending its influence to a new contender in the AI landscape: French startup Mistral AI. On Feb. 27, Microsoft announced a surprising 15-million euro ($16 million) investment in Mistral AI, an AI company based in Paris. TechTimes previously reported that the investment includes plans to integrate Mistral's AI models into Microsoft's Azure cloud computing platform. Microsoft and Mistral AI are set to turbocharge AI innovation, thrusting Mistral Large, the flagship commercial model of Mistral AI, into the spotlight on Microsoft Azure. Mistral Large, a versatile language model adept in code and mathematics, can process multiple documents in a single call. Supporting languages including French, German, Spanish, Italian, and English, it stands as the world's second-ranked model available through an API, closely trailing GPT-4, per TechRadar. The collaboration revolves around supercomputing infrastructure, market scaling, and AI research and development. Microsoft plans to contribute Azure AI supercomputing infrastructure to enhance AI training and inference workloads for Mistral AI's flagship models. Customers will gain access to Mistral AI's premium models through Models as a Service (MaaS) in Azure AI Studio and the Azure Machine Learning model catalog. This coupled with Azure's AI-optimized infrastructure and enterprise-grade capabilities, offers Mistral AI expanded opportunities to promote, sell, and distribute its models to Microsoft customers globally. Mistral AI's CEO Arthur Mensch expressed excitement about the partnership, stating, \"Together, we are committed to driving impactful progress in the AI industry and delivering unparalleled value to our customers and partners globally.\"  (Photo : Toby Melville - WPA Pool/Getty Images) Arthur Mensch, cofounder and CEO of Mistral AI attends the AI Safety Summit at Bletchley Park on November 2, 2023 in Bletchley, England. As earlier reported by TechTimes, Mistral is making significant strides, asserting that its latest AI language model, Mixtral 8x7B, rivals OpenAI's GPT-3.5 in performance. This claim holds weight, considering the dominance of OpenAI's ChatGPT 3.5 in the current market.Recently achieving 'unicorn status' with substantial funding reaching $2 billion in its latest funding round, Mistral is now one of the most valuable startups in the AI sector.Mistral AI introduced the Mixtral 8x7B language model, incorporating a mixture of expert models (MoE) with open weights. Positioned as the strongest and most cost-effective language model, it boasts a permissive license. Mistral confidently asserts that the Mixtral 8x7B matches or surpasses GPT-3.5 on most standard benchmarks, establishing itself as a formidable contender in the competitive AI landscape. Read Also: Nearly One-Third Return Apple Vision Pro Due to Setup Confusion In its early stages, the Mixtral 8x7B handles an impressive 32,000 context tokens and supports multiple languages, including English, French, German, Italian, and Spanish.Mistral boldly claims superiority over Meta's LLaMa 2 model on various benchmarks, showcasing up to six times faster interference. This assertion, coupled with substantial funding and promising early performance metrics, positions Mistral as a serious contender in the race for AI language model supremacy. Meanwhile, Microsoft's work with Mistral AI has prompted EU legislators to seek for an antitrust inquiry. This comes as EU antitrust regulators investigate Microsoft's cooperation with ChatGPT maker OpenAI. The European Commission is concerned about these corporations violating the competition laws of the European Union.Microsoft stated that the investment will turn into stock in Mistral's next fundraising round, as many tech companies do when investing in AI businesses without value. Microsoft stressed that it did not manage OpenAI during an examination of its multi-billion-dollar investment last year. Microsoft invested in OpenAI, gaining access to its advanced models and earnings, a matter currently under antitrust examination in both the EU and the US. Related Article: MWC 2024: Vodafone's CEO Advocates for Regulatory Reform and Industry-Wide Collaboration   Sign up for our free newsletter for the Latest coverage!   "
}