{
    "title": "American Century Companies Inc. Boosts Holdings in NETSTREIT Corp. \n(NYSE:NTST)",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-ntst-sec-filing-2024-03-19/",
    "text": "American Century Companies Inc. increased its holdings in NETSTREIT Corp. (NYSE:NTST - Free Report) by 16.5% in the third quarter, according to its most recent Form 13F filing with the Securities & Exchange Commission. The firm owned 2,157,248 shares of the company's stock after acquiring an additional 304,742 shares during the quarter. American Century Companies Inc. owned about 3.14% of NETSTREIT worth $33,610,000 as of its most recent filing with the Securities & Exchange Commission. A number of other institutional investors and hedge funds also recently added to or reduced their stakes in the business. Public Employees Retirement System of Ohio lifted its stake in NETSTREIT by 18.9% in the third quarter. Public Employees Retirement System of Ohio now owns 96,123 shares of the company's stock worth $1,498,000 after acquiring an additional 15,270 shares during the period. The Manufacturers Life Insurance Company raised its holdings in NETSTREIT by 35.5% in the third quarter. The Manufacturers Life Insurance Company now owns 30,887 shares of the company's stock worth $481,000 after purchasing an additional 8,094 shares in the last quarter. GSA Capital Partners LLP bought a new position in NETSTREIT in the third quarter worth $361,000. Sei Investments Co. raised its holdings in NETSTREIT by 4.4% in the third quarter. Sei Investments Co. now owns 760,743 shares of the company's stock worth $11,852,000 after purchasing an additional 32,227 shares in the last quarter. Finally, Legal & General Group Plc raised its holdings in NETSTREIT by 8.6% in the third quarter. Legal & General Group Plc now owns 418,176 shares of the company's stock worth $6,515,000 after purchasing an additional 33,070 shares in the last quarter. Several equities analysts have recently weighed in on NTST shares. Truist Financial reduced their price target on NETSTREIT from $22.00 to $18.00 and set a \"buy\" rating for the company in a report on Monday, November 27th. BTIG Research reduced their price target on NETSTREIT from $23.00 to $19.00 and set a \"buy\" rating for the company in a report on Wednesday, November 22nd. Wolfe Research upgraded NETSTREIT from a \"peer perform\" rating to an \"outperform\" rating and set a $22.00 price target for the company in a report on Tuesday, January 2nd. Mizuho raised their price target on NETSTREIT from $18.00 to $19.00 and gave the company a \"buy\" rating in a report on Thursday, March 7th. Finally, BNP Paribas downgraded NETSTREIT from an \"outperform\" rating to a \"neutral\" rating and set a $17.00 price target for the company. in a report on Wednesday, December 13th. One research analyst has rated the stock with a sell rating, three have assigned a hold rating and five have issued a buy rating to the company's stock. Based on data from MarketBeat, the company presently has a consensus rating of \"Hold\" and a consensus price target of $18.34. Read Our Latest Report on NETSTREIT NTST traded up $0.10 on Tuesday, hitting $17.25. 876,879 shares of the company's stock traded hands, compared to its average volume of 1,185,514. The company's 50 day simple moving average is $17.67 and its 200-day simple moving average is $16.64. The firm has a market cap of $1.26 billion, a price-to-earnings ratio of 156.79, a P/E/G ratio of 3.55 and a beta of 0.96. NETSTREIT Corp. has a one year low of $13.49 and a one year high of $18.93. The company has a current ratio of 3.25, a quick ratio of 3.25 and a debt-to-equity ratio of 0.47. The business also recently declared a quarterly dividend, which will be paid on Thursday, March 28th. Investors of record on Friday, March 15th will be issued a dividend of $0.205 per share. The ex-dividend date is Thursday, March 14th. This represents a $0.82 annualized dividend and a yield of 4.76%. NETSTREIT's payout ratio is presently 745.52%. NETSTREIT Corp. is an internally managed real estate investment trust (REIT) based in Dallas, Texas that specializes in acquiring single-tenant net lease retail properties nationwide. The growing portfolio consists of high-quality properties leased to e-commerce resistant tenants with healthy balance sheets.See AlsoFive stocks we like better than NETSTREITWhere to Find Earnings Call TranscriptsGrowing Twice as Fast as Tesla, XPeng is a BuyWhat does consumer price index measure? 4 Stocks Building Long-Term Value for Shareholders Transportation Stocks InvestingFedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount  Before you consider NETSTREIT, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NETSTREIT wasn't on the list. While NETSTREIT currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat has just released its list of 20 stocks that Wall Street analysts hate. These companies may appear to have good fundamentals, but top analysts smell something seriously rotten. Are any of these companies lurking around your portfolio? Find out by clicking the link below. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}