{
    "title": "Midday movers: Nvidia, Microsoft, Dollar Tree and more",
    "date": "3/26/2024",
    "url": "https://au.lifestyle.yahoo.com/lifestyle/nvidia-microsoft-alphabet-splunk-rise-074126792.html",
    "text": "Investing.com -- U.S. stocks were falling as Federal Reserve officials meet in Jackson Hole, Wyo., for their annual conference, with investors hoping for clues about the central bank's next move on interest rates. Here are some of the biggest U.S. stock movers today: Nvidia (NASDAQ:NVDA) stock rose 2.9% after the world’s most valuable chip maker posted stellar quarterly earnings, with second-quarter revenues crushing lofty expectations, boosted by the frenzy over generative artificial intelligence. Microsoft (NASDAQ:MSFT) stock fell 1.5% and Google-owner Alphabet (NASDAQ:GOOGL) stock fell 1.3% after the strong Nvidia earnings as both companies have been rushing to incorporate generative AI into their web search platforms. Dollar Tree (NASDAQ:DLTR) stock fell 11.7% after the discount retailer forecast annual profit below expectations as it expects a hit from a shift in spending towards lower-margin consumables. Boeing (NYSE:BA) stock fell 3.8% after the planemaker warned of delays in near-term deliveries of 737 MAX jets due to a fresh quality issue involving its biggest supplier Spirit AeroSystems (NYSE:SPR), down 12%. Splunk (NASDAQ:SPLK) stock rose 13% after the data analytics software maker forecast third-quarter revenue above market estimates on expectations of AI-related spending. Petco Health and Wellness Company (NASDAQ:WOOF) stock fell 20% after the pet supply retailer swings to a quarterly loss and cuts its annual guidance. Kenvue (NYSE:KVUE) stock dipped 0.8% after Goldman Sachs upgraded its stance on the consumer health company to 'Buy' from 'Neutral', saying it could rally more than 20%. United States Steel (NYSE:X) stock fell 2.9%, extending losses from the previous session that were sparked by a decision by Esmark to scrap its pursuit of a takeover of the alloy producer. -- Peter Nurse contributed to this report Related Articles Midday movers: Nvidia, Microsoft, Dollar Tree and more RBC plans job cuts after profit beat, TD misses on higher expenses Boeing shares fall as 737 goal at risk from supplier defect involving Spirit This food habit is linked to a specific type of dementia. Abby Hensel officially tied the knot in 2021, it has been revealed  The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The British monarch will not host an Easter lunch after the service, either. If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens 'We love a girly that shreds,' one fan said of the very 'Barbie' moment. The actress is soaking up every moment of 'paradise.' Benny Larkin and daughter Taylor Larkin, 14, were boating down Dora Creek, New South Wales, Australia, when they broke down and were approached by a fuming kayaker. 連續13日閃購，PS5 Slim、Marshall、Switch OLED、AirPods Pro 2、DJI等人氣產品平到笑！ Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president.  King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago The person who wrote on the road has been called a \"top bloke\" by motorists. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia.  ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’ ‘I guess turning 29 isn’t so bad,’ the ‘American Idol’ alum joked. King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service  \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann. Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent. ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says "
}