{
    "title": "The FTC is investigating Microsoft, Amazon and Alphabet's investments into \nAI startups",
    "date": "1/25/2024",
    "url": "https://www.engadget.com/the-ftc-is-investigating-microsoft-amazon-and-alphabets-giant-investments-into-ai-startups-190939602.html",
    "text": "The Federal Trade Commission is launching an inquiry into massive investments made by Microsoft, Amazon and Alphabet into generative AI startups OpenAI and Anthropic, the agency announced on Thursday. The FTC said that it had issued “compulsory orders” to the companies and would scrutinize their relationships with AI startups to understand their impact on competition. “History shows that new technologies can create new markets and healthy competition,” FTC Chair Lina Khan said in a statement. “As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity. Our study will shed light on whether investments and partnerships pursued by dominant companies risk distorting innovation and undermining fair competition.” The companies have 45 days to respond to the agency. Ever since OpenAI released ChatGPT at the end of 2022, generative AI has exploded, sparking both excitement about its potential to increase productivity as well as anxiety about job losses. Against this backdrop, the world’s largest tech companies have been racing to develop their own versions of the tech as well as pouring billions of dollars into smaller startups creating it. Microsoft, for instance, invested more than $13 billion into OpenAI for a 49 percent stake, using the startup’s tech to add generative AI capabilities to Bing, its own search engine, as well as Windows and Office. Amazon and Alphabet invested $4 billion and $2 billion respectively in Anthropic, an AI startup that makes a chatbot called Claude. In an opinion column in The New York Times last year, the FTC’s Khan wrote that “the expanding adoption of AI risks further locking in the market dominance of large incumbent technology firms” and argued for AI regulation. As part of its investigation, the FTC is seeking information about the specifics of Microsoft, Amazon and Alphabet’s investments, decisions around new product releases, oversight rights, analyses of market share and potential for sales growth among other details. The US isn’t the only country examining Big Tech’s ties with generative AI startups. The UK’s Competition and Markets Authority said last month that it was examining whether Microsoft’s investment into OpenAI was subject to antitrust law. In a post on X in December, Microsoft’s president Brad Smith characterized the company’s OpenAI investment as a partnership “that has fostered more AI innovation and competition, while preserving independence for both companies.” Microsoft currently has a non-voting observer seat on OpenAI’s board, which, said Smith, was “very different from an acquisition.” “We hope the FTC’s study will shine a bright light on companies that don’t offer the openness of Google Cloud or have a long history of locking-in customers – and who are bringing that same approach to AI services,\" a Google spokesperson told Engadget. \"The U.S. has assumed a global AI leadership position because important American companies are working together,\" Rima Alaily, Microsoft's vice president for Competition and Market Regulation, told Engadget in a statement. \"Partnerships between independent companies like Microsoft and OpenAI, as well as among many others, are promoting competition and accelerating innovation. We look forward to providing the FTC with the information it needs to complete its study.” Spokespeople from Amazon and Anthropic declined to comment. OpenAI did not respond to a request for comment from Engadget. "
}