{
    "title": "Microsoft, Alphabet earnings: What to expect from Big Tech",
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/video/microsoft-alphabet-earnings-expect-big-144900566.html",
    "text": "Ahead of earnings reports from Microsoft (MSFT) and Alphabet (GOOG, GOOGL), Yahoo Finance Tech Editor Dan Howley previews investor expectations for the Big Tech players. Both tech giants have invested heavily in AI, with Microsoft developing Copilot while Alphabet has focused on Duet AI and Gemini. Investors will be watching how these AI pivots may impact revenue and margins. Microsoft is forecasted to post revenue of $61.14 billion and adjusted EPS of $2.76. Alphabet has revenue expectations of $70.98 billion and adjusted EPS of $1.72. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith BRAD SMITH: Microsoft recently introducing Copilot, an AI assistant, and they have cloud computing platform Azure. Alphabet has a Duet in AI in Google Workspaces, and then recently released its Gemini AI model. Both companies are under pressure to show results, though, from their AI investments. Here with more, we've got \"Yahoo Finance's\" Dan Howley. So Dan, what's the biggest thing that you're watching in Microsoft's report after the closing bell today? DAN HOWLEY: For Microsoft, it's going to be the overall cloud segment. So let's just break down some of the earnings for you, guys, real quick. First, the expectation here is for Microsoft to post adjusted earnings of $2.78 on revenue of $61.1 billion. That would be up from $2.32 on $52.7 billion last year. The Intelligent Cloud segment, that's where you get Azure and everything, that's going to be expected to come in at $25.3 billion. And then Microsoft's cloud overall, $32.2 billion. That would be up from $27.1 billion last year. A lot of numbers thrown out there. I think the big thing, though, that we're going to be focused on is where Microsoft reports its Copilot earnings, right? That's the AI software that they're pushing with Copilot for Microsoft 365. They also offer different AI capabilities through Azure, where you can build out your own AI Copilot of your own. And oh by the way, the productivity tools that they also have AI built in as well. Not to forget though, Microsoft's personal computing business was also hurting as we saw PC sales slip through the last year. We're expecting a rebound. Perhaps that'll happen in this report, maybe the next one. But revenue there is expected to be $16.8 billion, up from $14.2 billion last year. SEANA SMITH: And then these are two stocks we're going to take a look at, Microsoft and also Alphabet, their shares trading at all time highs. When it comes to Alphabet, the focus likely going to be on AI, but also the ad part of the business, their ad market and the recovery that we're expected to see there. DAN HOWLEY: Yeah, we're expecting revenue TAC, that's traffic acquisition costs of $7.95 billion. That would be up from $63.1 billion. And yeah, a lot of that is going to be coming from the advertising space. Google makes the vast majority of its money. Google advertising expected to come in at $69.5 billion. That would be $10 billion more-- $10.9 billion more than last year. And Google Services of $75.9 billion, up from $67.8. But Google Cloud revenue-- they broke that out relatively recently. And that's where we're going to potentially see a big jump from $7.2 billion to $8.9 billion. Google Cloud, incredibly important for them to get that up off the ground. Obviously, advertising is still the main revenue generator for Google, and will continue to be for the foreseeable future. But they want to build this out on its own to compete with Microsoft's Azure and Amazon's AWS. BRAD SMITH: Dan, thanks so much. Of course, two big reports that we're going to be watching for. SEANA SMITH: Big day for you. DAN HOWLEY: Cannot wait. Sweating. BRAD SMITH: All right, \"Yahoo Finance's\" tech DH, Dan Howley there. Related Quotes "
}