{
    "title": "'2024 Will Be Another Good Year for Software': Jefferies Names MSFT, ADBE \nand ESTC as Top Picks",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/2024-another-good-software-jefferies-101159956.html",
    "text": "Last year saw powerful gains in the stock markets – ones that were led by the tech sector. Among the chief gainers were the largest of the mega-cap stocks, the so-called Magnificent Seven, that are leaders in software, wireless devices, internet, semiconductor chips, and electric cars – the range of products shows how versatile a category ‘tech’ is. In broader terms, investors were heartened by a general slowdown in the pace of inflation, and later in 2023 by indications that the Fed will pare back interest rates this year. That sentiment helped power a solid year for equities, and pushed tech stocks to the top of the heap. And software companies reaped plenty of those gains. Looking at 2024, analyst Brent Thill of Jefferies sees some short-term bumps in the road ahead – but smoother going in the second half. He’s picked out the software segment as most likely to benefit from conditions this year, and telling us that this ‘will be another good year.’ Thill outlines the overall picture: “Expect ’24 to be another positive year for software, though likely see more measured returns vs. the IGV +59% in ’23. 1H could be challenging given 4Q23 rally and seasonal Q1 black ice. But would position selectively for better 2H driven by: fundamental acceleration, increased adoption of AI SKUs, lower interest rates, still reasonable valuation, and potential M&A pick-up.” Specifically, Thill has picked out MSFT, ADBE, and ESTC as his ‘Top Picks’ for this year. We ran these software stocks through the TipRanks database to see what makes them stand out. Let’s check the details. Microsoft Corporation (MSFT) The first Jefferies pick we’ll look at is Microsoft, the Magnificent Seven stock on the list. This company boasts one of the most recognizable brand names in any industry, along with a $2.73 trillion market cap that makes it the second-largest publicly traded firm in the world, and has been a leader in personal computing and computer software since the 1970s. Over the years, Microsoft has had a finger in every pot on the computing stove, from early word processors to operating systems to web browsers and, more recently, to artificial intelligence. Microsoft has found important support from some of its best-in-class products. Prominent among these are Azure and Copilot, along with the venerable O365. Released last year, Copilot is the AI tool designed to assist users in getting the best performance from the company’s more established software products. Azure, a cloud computing platform available by subscription, contains more than 200 cloud-based products and services. Users can build, run, and manage applications of all sorts, at all scales. The platform and service are particularly popular among enterprise clients, and MS boasts that 95% of Fortune 500 companies use Azure in their day-to-day business. O365 should be familiar to anyone who uses business software on a regular basis – it’s the subscription package for Microsoft’s popular office suite, and it includes the well-known ‘productivity apps’ all in one subscription package: Word, Excel, PowerPoint, Outlook, OneDrive, and all the rest – it’s all there. The package is available by subscription, with deals available for personal, home, business, and student use. Copilot may be less familiar. It’s an AI chatbot, first launched last year under the Bing name. Since then, the company has upgraded and fine-tuned the tool, and adapted it to the various MS software packages. Copilot communicates with users in real time and in natural language, providing dedicated assistance in creating content of all sorts. Microsoft has announced that it will be adding a Copilot button to the Windows PC keyboard, a move that will mark the first change to the standard computer keyboard in decades. Turning to the financials, Microsoft’s last earnings release, for fiscal 1Q24 (September quarter), showed that the company realized $56.5 billion in revenues for the quarter ending on September 30, 2023. This was up 13% year-over-year, and was $1.95 billion better than had been expected. The company had an EPS of $2.99, 34 cents per share over the forecast. Microsoft’s Intelligent Cloud services, which includes Azure, saw its revenue increase 19% y/y, to reach $24.3 billion of the company’s total top line. In his coverage of Microsoft for Jefferies, analyst Brent Thill outlines an upbeat take on the company, giving several reasons why investors should stick with this stock: “We remain positive on MSFT for the following reasons: 1) continued potential reacceleration of Azure, taking a share due to Gen AI offerings as cloud cost optimization headwinds abate; 2) potential for MSFT’s Copilots to drive significant revenue uplift in CY24 and beyond; 3) margins boosted by AI over time; and 4) reacceleration of O365 Commercial growth. All in, we are increasingly confident in MSFT’s ability to regain double-digit organic revenue growth… We suspect MSFT shares will accelerate as investors get line of sight to AI rev contribution…” Thill puts a Buy rating on MSFT shares, along with a $450 price target that indicates his own confidence in a 22% upside potential for the coming year. (To watch Thill’s track record, click here) Overall, Microsoft has picked up 37 recent analyst reviews, with a heavily asymmetric breakdown of 36 to 1 in favor of Buy over Hold giving the stock a Strong Buy consensus rating. The shares are trading for $367.75 and the $425.88 average target price implies a 16% gain on the one-year horizon. (See Microsoft stock forecast) Adobe, Inc. (ADBE) Next up is a software company almost as easily recognizable as Microsoft. Adobe is an industry leader in publishing and content creation software and tool packages, and it’s popular with graphic designers and online editors. The company first came to the public eye as the inventor of the PDF document, a format that allowed easy transfer of documents from one user to another without risk of damaging the content and with easy access through a freely available reader application. Today Adobe is the company behind the Creative Cloud, a set of online creation and editing tools that brings many of the company’s products, formerly available separately by subscription, into one package. The Creative Cloud includes an even score of apps, with Photoshop, Illustrator, InDesign, Acrobat, and Premiere Pro prominent among them. Subscribers also get access to other benefits, such as thousands of Adobe fonts. For digital design and content professionals, Adobe has become a one-stop shop for creation tools. While not a ‘Magnificent Seven’ stock, Adobe is certainly in the upper tier of the tech world. The company has a market cap of $257 billion, putting it into the mega-cap category, and is considered one of the world’s top software firms. Adobe has developed and successfully marketed a wide-ranging set of software tools, and has created a brand that commands professional respect. These are solid achievements for any company; for Adobe, they have translated into multi-billion-dollar annual revenue. In its fiscal year 2022, the company brought in $17.61 billion at the top line. For fiscal year 2023, which ended on December 1, 2023, that revenue total reached  $19.41 billion, up 10% y/y and marking a company record. For 4Q23 alone, Adobe’s top line hit $5.05 billion, up 111.5% y/y and $30 million over the estimates. Quarterly income came to $4.27 per diluted share by non-GAAP measures, 13 cents ahead of expectations. Analyst Thill is optimistic about Adobe, and explains clearly why this company is one of his top software picks, writing, “ADBE is a top 2 AI monetization play for 2024. ADBE should also continue to benefit from tailwinds in digital transformation, explosion in creative content, shift to first party data for marketing, and potential for expanded share buyback. Initial FY24 new ARR guide disappointed high expectations ($1.90B vs. St. $2.02B), but ADBE has a history of conservative guide, with actual beating initial by >$200M in 4 of last 5 FYs.” Looking ahead, Thill believes that Adobe will continue to benefit from its strong cloud performance, and says of the company’s prospects, “FY24 is well positioned to repeat and could exceed $2.1B thanks to many drivers tied to Firefly AI adoption, incl. CC price increases, rollout to more products & geos, enterprise adoption, new user adds, existing user upgrades, launch of Express mobile app, and gen AI launch for Document Cloud.” These comments support Thill’s Buy rating on ADBE, while his $700 price target implies a solid 24% upside for the next 12 months. The Strong Buy consensus rating on ADBE is derived from 29 recent analyst reviews that include 24 Buys, 4 Holds, and 1 Sell. The shares are priced at $564.60 and the $657.85 average target price suggests a 16.5% gain for 2024. (See Adobe stock forecast) Elastic (ESTC) Last on our Jefferies-backed list is a software company that is not a household name – but one that has still built up a strong business in an essential digital niche. Elastic’s line of Software-as-a-Service products are focused in the world of digital search – solving user issues involved in searching databases and finding answers. The company’s products allow for searching, data analytics, security updates, higher observability rates, and accurate record keeping and access logs. Elastic’s software has found a solid user base, including more than half of the Fortune 500 firms – and such major names as Walmart, Cisco, and the US Air Force. The company has adapted itself to the needs of multiple economies – digital, industrial, retail, governmental – and all at multiple scales. This past November, Elastic announced and completed an acquisition move targeting Opster, a smaller software company that offers platforms designed to monitor and manage search tools, Elasticsearch in particular. Used together, the two companies’ tools complement each other well. The financial terms of the acquisition were not disclosed. ESTC shares got a big boost on December 1, surging by 37% on the back of an earnings release that beat expectations all around. Elastic reported $311 million in revenue for its fiscal 2Q24, or $7 million over the forecast and up by 17.6% year-over-year. The company’s bottom line, of 37 cents per share in non-GAAP measures, outperformed by 13 cents per share. This company’s ability to position itself so strongly in its core digital search business caught the attention of Jefferies’ Thill, and the analyst makes Elastic his third pick for software stocks going forward. Thill writes of this solid company in upbeat tones, saying, “We like ESTC’s positioning as a premier enterprise search platform that should benefit from Generative AI and vector search demand. ESTC has shown its ability to execute with 3 straight quarters of solid execution and 4 straight quarters of RPO growth acceleration. Improving cloud consumption trends, a new CRO, and upside from incremental upsell conversion to higher subscription tiers from vector search should help catalyze growth.” In Thill’s view, that growth potential justifies a Buy rating, and he gives the stock a $130 price target, pointing toward a 25% gain by the start of next year. Thill’s take is one of the Street’s most upbeat ones. Overall, Elastic holds a Moderate Buy consensus rating, based on 19 recent analyst reviews of which 13 are to Buy and 6 to Hold. The shares are trading for $104.10 and have an average price target of $106.81, indicating they will stay rangebound for the foreseeable future. (See Elastic stock forecast) To find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a tool that unites all of TipRanks’ equity insights. Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment. Related Quotes "
}