{
    "title": "Microsoft briefly overtakes Apple as world's most valuable firm",
    "date": "1/12/2024",
    "url": "https://www.iol.co.za/business-report/companies/microsoft-briefly-overtakes-apple-as-worlds-most-valuable-firm-db819fe7-a47c-4f69-ae72-08e8c3ece1cc",
    "text": "Saturday, March 30, 2024 A Microsoft logo is seen at a pop-up site for the new Windows 10 operating system at Roosevelt Field in Garden City, New York. file image. Published Jan 12, 2024 | Published Jan 12, 2024 Share Microsoft briefly dethroned its rival Apple to become the world's most valuable company Thursday, illustrating the contrast between a firm driven by artificial intelligence and another whose iPhone sales are a cause for concern. Shortly after markets opened on Wall Street, the value of the Windows operating system creator reached a market capitalization of almost $2.9 trillion, slightly above Apple, according to calculations made by AFP. Microsoft only held the top spot for a few seconds before returning to second place, but this nonetheless underscores how the explosion of interest in AI has reshaped investors' enthusiasm for the two firms. The Redmond, Washington-based group has been riding high due in large part to its partnership with OpenAI, the creator of the generative AI interface ChatGPT, in which it controls almost half the capital. Since the launch of ChatGPT in November 2022, Microsoft shares have gained almost 75 percent. Over the same period, Apple has had to make do with a more modest -- yet still impressive -- 35 percent rise. Since the arrival of ChatGPT, Microsoft has launched several products enabling businesses and individuals to use the capabilities of generative AI, notably via its Bing search engine and Copilot virtual assistant. Apple, for its part, has been penalized by market concerns about its ability to maintain the unbridled growth it has posted for decades. Earlier this month, an analyst at Barclays lowered their outlook for the stock, citing concerns about a slowdown in iPhone 15 sales particularly in China, which is a major market for Apple. On Wednesday, analysts at Redburn Atlantic revised their opinion to \"neutral\" from \"buy\" on concerns about the prospect of limited growth in the coming years, and mixed results for the current quarter. Since January 2022, Apple's market capitalization has on several occasions surpassed the symbolic threshold of three trillion dollars. However, the group regularly carries out massive share buybacks and cancels shares once they are in its possession, which mechanically reduces the number of shares in circulation and the lowers its market capitalization. AFP Related Topics: Independent Online, popularly known as IOL, is one of South Africa’s leading news and information websites bringing millions of readers breaking news and updates on Politics, Current Affairs, Business, Lifestyle, Entertainment, Travel, Sport, Motoring and Technology. Read more © 2024 Independent Online and affiliated companies. All rights reserved. "
}