{
    "title": "Microsoft (MSFT) to Report Q2 Earnings: What's in the Cards?",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/microsoft-msft-report-q2-earnings-153900673.html",
    "text": "Microsoft MSFT is set to report second-quarter fiscal 2024 results on Jan 30.The Zacks Consensus Estimate for revenues is pegged at $61.03 billion, indicating growth of 15.71% from the figure reported in the year-ago quarter.The consensus mark for earnings has moved up by a penny to $2.76 per share over the past 30 days, suggesting 18.97% year-over-year growth.Microsoft’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 7.83%.Strength in Intelligent Cloud and Productivity and Business Processes driven by growth in Azure, Office 365 suite and other cloud services is expected to have aided top-line growth in the to-be-reported quarter.Shares of MSFT have returned 13.7% and outperformed the broader Zacks Computer & Technology sector and Apple AAPL, which have gained 12.4% and 0.7%, respectively, in the past six-month period. Microsoft underperformed Lenovo LNVGY, which has gained 17.3% in the same time frame. Shares of  Hewlett Packard HPE have lost 11.9% in the past six months.Let’s see how things have shaped up for the upcoming announcement: Microsoft Corporation price-eps-surprise | Microsoft Corporation Quote The steady adoption of the company’s productivity and collaboration tools and services is expected to have aided top-line growth in the to-be-reported quarter.For the fiscal second quarter, Microsoft expects revenues in the Productivity and Business Processes segment between $18.8 billion and $19.1 billion. Our model estimate is pegged at $18.93 billion, indicating growth of 11.4% year over year.Teams’ expanding customer base and features have been helping Microsoft win shares in the enterprise communication market against Zoom. Teams’ user growth is expected to have been driven by the hybrid/flexible work model.This Zacks Rank #2 (Buy) company expects Office 365 Commercial revenue growth to be roughly 16% at constant currency (cc), which is in line with our model estimate. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Office Commercial products revenues are expected to decline in mid to high-teens. In Office Consumer products and cloud services, Microsoft expects revenue growth in the mid-single digits. For LinkedIn, the company expects revenue growth in the mid-single digits.The company expanded the availability of Microsoft 365 Copilot to a wider range of customers, which is expected to have boosted revenue growth.Strong adoption of Dynamics 365 is expected to have driven top-line growth in the to-be-reported quarter. In Dynamics, MSFT expects revenue growth in high-teens. Our model estimate for Dynamic 365 is pegged at revenue growth of 17.7%.Microsoft and OpenAI's shared commitment to building generative artificial intelligence (AI) systems and products that are trustworthy and safe is noteworthy.In the to-be-reported quarter, Microsoft announced a partnership with leaders from the United Nations that will enable the UNFCCC to create a new AI-powered platform and global climate data hub to measure and analyze global progress in reducing emissions.The company also partnered with The American Federation of Labor and Congress of Industrial Organizations to create an open dialogue to discuss how AI must anticipate the needs of the workers and include their voices in its development and implementation. Revenues from Windows are likely to have been driven by steady traction seen in Windows Commercial products and cloud services growth amid improving personal computer (PC) demand.After eight consecutive quarters of year-over-year decline, the PC market is showing initial signs of stabilization. Per Gartner report, Worldwide PC shipments totaled 63.3 million units in the fourth quarter of 2023, representing a 0.3% increase from the fourth quarter of 2022.Among big PC vendors, Lenovo and HPE registered an increase in shipments. Lenovo and HPE registered a year-over-year increase of 3.2% and 5.6% in shipments to 16.2 million and 13.95 million units, respectively. Apple registered a 7.2% year-over-year improvement in shipments to 6.34 million units.For More Personal Computing, the company projects revenues between $16.5 billion and $16.9 billion. It expects Windows OEM revenues to grow in the mid to high-single-digits range.Our model estimate is pegged at $16.83 billion, indicating growth of 18.3% from the figure reported in the year-ago quarter.In Gaming, the company expects revenue growth in the mid to high 40s. This includes roughly 35 points of net impact from the Activision acquisition. Microsoft expects Xbox content and services revenue growth in the mid to high 50s, driven by roughly 50 points of net impact from the Activision acquisition.For Intelligent Cloud, the company anticipates revenues between $21.5 billion and $25.4 billion. In Azure, Microsoft expects revenue growth in the range of 26-27% at cc.Our model estimate is pegged at $25.11 billion, indicating growth of 16.8% from the figure reported in the year-ago quarter.Stay on top of upcoming earnings announcements with the Zacks Earnings Calendar. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Lenovo Group Ltd. (LNVGY) : Free Stock Analysis Report Hewlett Packard Enterprise Company (HPE) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}