{
    "title": "New Year, New Computer",
    "date": "1/23/2024",
    "url": "https://www.microsoft.com/en-us/surface/do-more-with-surface/new-year-new-computer",
    "text": "January 23, 2024 Share this page As the New Year rolls in, it's the perfect time to consider upgrading your tech game. And what better way to start than by buying a new computer? Whether you're after a top gaming PC, you’re a professional, or you’re just looking for something to help make daily life easier, there's a lot to consider before making your choice. Here's a quick guide to help you make an informed decision along with tips for finding New Year's deals and features you might love. Reflect on your current device The first step in your journey is to evaluate what you like and dislike about your current computer. Is the speed up to your expectations? Do you crave better graphics, more storage, or perhaps a lighter, more portable design? Understanding your current device's pros and cons will help you pinpoint what you need in your new computer. Personal preferences matter Your personal preferences play a crucial role in selecting a new computer. Do you prefer a touchscreen over a traditional monitor? How important is battery life to you? Are you looking for something that easily integrates with your other devices? These are critical questions that will guide your decision-making process. Credit: Image created with AI Keep up with the latest features Technology is evolving at breakneck speed, and staying updated can be a challenge. When looking for a new computer, consider the latest features available on the market. Here are a few things to watch: Surface devices to consider When considering a new purchase, keep in mind that Surface devices can provide the ideal blend of style, performance, and versatility. Meanwhile, the newest Surface devices have AI built in, positioning you to take full advantage of this groundbreaking technology in the new year. In fact, all Windows 11 devices come with AI-powered Copilot in Windows.¹ This feature can make everything from web navigation to task completion and organization easier and more efficient. Here are our top Surface recommendations for the new year: Surface Pro 9 2-in-1 PC Surface Pro 9 is perfect for any type of user who’s looking for a portable, yet powerful device. It offers the best of both worlds: the power of a laptop and the flexibility of a tablet. It also comes equipped with a choice of Intel® processors or the Microsoft SQ 3 processor with 5G.² Its 13-inch PixelSense™ touchscreen is ideal for jotting, sketching, and navigating with Surface Slim Pen 2. Combining blazing processors with ultra-fast Thunderbolt™ 4 ports, Surface Pro 9 ensures high performance, enhanced audio/video capabilities, and robust connectivity options. Surface Laptop 5 Surface Laptop 5 combines style and substance, ideal for everyday tasks like working, browsing, or streaming. Its lightweight design, available in 13.5-inch for portability and 15-inch for enhanced multitasking, is powered by an efficient 12th Gen Intel® Core™ processor. Users benefit from all-day battery life,³ quick Thunderbolt™ 4 connectivity, and major sensory appeal thanks to Dolby Vision® and Atmos® sound. Enhanced camera features and Studio Mics ensure high-quality video calls, while Windows 11, Windows Hello sign-in, and secured OneDrive storage provide a seamless and secure user experience. Surface Laptop Go 3 Surface Laptop Go 3 is ideal for everyday use, offering a blend of portability and performance. It's 60% faster than its predecessor, thanks to the 12ᵗʰ Gen Intel® Core™ i5 processor, and caters to on-the-go productivity with a 12.4-inch touchscreen and full-size keyboard. With up to 16 GB RAM and 256 GB storage, you can expect smooth streaming, browsing, and app usage. This laptop also boasts Fast Charging, reaching 80% in under 1.5 hours. Enhanced with optional built-in Microsoft security features like a fingerprint power button and coming in various stylish colors, Surface Laptop Go 3 could be your go-to for the new year. Surface Laptop Studio 2 Surface Laptop Studio 2 delivers a top-notch computing experience, providing the power for smooth workflow integration. With multiple elite graphics options, this laptop delivers stunning, AI-enhanced visuals that are ideal for gaming, content creation, and professional design tasks. Surface Laptop Studio 2 handles heavy workloads effortlessly with up to 64 GB of memory, ensuring stability during extended, complex sessions. It also features an advanced Studio Camera for authentic on-screen representation and supports the Slim Pen 2 with built-in storage and charging. Snagging New Year's deals with help from Microsoft Edge Now, how do you go about getting the best deals? Microsoft Edge offers built-in tools to help you find the best New Year's sales, compare prices, apply coupons automatically, and even earn rewards as you shop. It's a smart way to ensure you're getting the right computer at the best possible price. Buying a new computer is about balancing your needs, preferences, and budget. With the latest features in accessibility, AI, gaming, and connectivity—along with the smart shopping tools available in Microsoft Edge—you're well-equipped to make a wise decision. If you’re looking for a new Surface, let us help you choose. Happy New Year, and happy shopping! Differentiate devices and learn the unique benefits of using a detachable keyboard. There’s a Surface laptop to fit your needs, your family, and your budget. See how Surface Laptop 5 comes with everything you need from the start. "
}