{
    "title": "Bill Gates used to memorize the license plate of every Microsoft employee \nto keep tabs on them — Paul Allen says ...",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/news/bill-gates-used-memorize-license-120000732.html",
    "text": "Microsoft ranked second on Forbes' list of best employers in 2023. The tech giant scored well in several areas, including talent development, remote working options, parental leave benefits, diversity, work-life balance and employee pride. However, it’s unlikely the company would have ranked anywhere on this list back when co-founder Bill Gates was trying to establish the firm in the mid- to late-’70s. Commercial real estate has outperformed the S&P 500 over 25 years. Here's how to diversify your portfolio without the headache of being a landlord Take control of your finances in 2024: 5 money moves to start the new year off strong The US dollar has lost 87% of its purchasing power since 1971 — invest in this stable asset before you lose your retirement fund In those days, Gates had a reputation as a micromanager who would memorize the license plates of every employee in order to keep tabs on them. “He was growing into the taskmaster who would prowl the parking lot on weekends to see who’d made it in,” co-founder Paul Allen once told Vanity Fair. Gates isn’t the only tough boss in the billionaires’ club. In fact, some famous entrepreneurs claim it’s the only way to run a company successfully. However, this leadership style has faced pushback in recent years, and some wonder if strict management is a prerequisite for success — or an annoying roadblock for employees. There’s a long list of entrepreneurs who are just as famous for being successful as they are for being difficult to work for. Steve Jobs was notorious for being ruthless and controlling with employees, according to his business partner Steve Wozniak. Elon Musk’s “ultra hardcore” work culture pushed some employees to sleep on the floor of the office after working a 12-hour shift. Meanwhile, Jeff Bezos once called “work-life balance” a “debilitating phrase.” In 2023, Amazon delivery drivers filed a lawsuit against the company for forcing them to urinate in bottles — rather than stopping to go to a bathroom — during their shifts. Suffice it to say, billionaires don’t mind pushing people to the edge of sanity. But is this aggressive work culture really a key to success or an unnecessary hassle? Research seems to lean towards the latter. Read more: Find out how to save up to $820 annually on car insurance and get the best rates possible Researchers have studied the impact of micromanagement in recent years and the results might not be surprising for anyone who has worked for a difficult boss. A study published in the Asian Journal of Economics and Banking found that controlling bosses reduced employee morale and productivity. In fact, productivity suffered even if the micromanager somehow sustained employee morale. Authoritative bosses undermined employee autonomy and made them more likely to agree with fake news even if they knew it was fake, according to a recent paper published in Scientific Reports. Unsurprisingly, employees are not keen to work for controlling bosses. A survey conducted by Monster found that 73 percent of workers felt micromanagement was their biggest workplace issue. The survey also found that 46 percent of workers would consider leaving because of it. Micromanagement might also be unnecessary for business leaders trying to enter the billionaires’ club. Warren Buffett is the perfect example. Buffett’s management style has been described as hands-off and laissez-faire. Business owners acquired by his company are allowed to “operate on their own, without our supervising and monitoring them to any degree,” Buffett once said. “Most managers use the independence we grant them magnificently, by maintaining an owner-oriented attitude.” In other words, Buffett is a master delegator who trusts his associates to work independently with minimal oversight. If the world’s seventh-richest man doesn’t need micromanagement to succeed, it’s probably not necessary for anyone else. This Pennsylvania trio bought a $100K abandoned school and turned it into a 31-unit apartment building — how to invest in real estate without all the heavy lifting Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2024 Rising prices are throwing off Americans' retirement plans — here’s how to get your savings back on track This article provides information only and should not be construed as advice. It is provided without warranty of any kind. "
}