{
    "title": "Microsoft's AI-powered Copilot assistant launches for small businesses and \nconsumers",
    "date": "1/15/2024",
    "url": "https://siliconangle.com/2024/01/15/microsofts-ai-powered-copilot-assistant-launches-small-businesses-consumers/",
    "text": "UPDATED 18:47 EST / JANUARY 15 2024 by \nMike Wheatley Microsoft Corp. is expanding access to its Copilot virtual assistant, making it available to users of its Office suite of productivity applications. In addition, consumers who pay for Microsoft 365 can now access a new, paid version of Copilot too. Today’s updates will allow Microsoft to bring generative artificial intelligence capabilities to more of its users. Generative AI is the technology that was popularized by OpenAI’s ChatGPT last year, and it works by creating original text, images, code, videos and more, based on natural language prompts given by humans. By expanding access to its generative AI tech, Microsoft is hoping it can start covering the extreme costs of building and running the computing infrastructure required to power it. Investors are confident that Microsoft will ultimately be able to capitalize on the growing demand for generative AI capabilities in computing systems, cloud, productivity software, internet search and other areas, even with the competition it faces from rivals such as Google LLC. Last week, Microsoft finally surpassed Apple Inc. as the world’s most valuable publicly traded company. Microsoft Chief Executive Satya Nadella has made generative AI a big focus for the company going forward, saying it will become central to its identity in the coming years. “Our vision is pretty straightforward,” he said at the Microsoft Ignite conference in Seattle last November. “We are the Copilot company.” It was at that event that the company first announced Copilot for Microsoft 365, powered by OpenAI’s large language models. It originally offered the service to larger enterprises and educational institutions, launching it in December with a price tag of $30 per person, per month, on top of their existing subscription costs. . With today’s announcement, Microsoft is now bringing its generative AI Copilot to smaller businesses that subscribe to Microsoft 365 Business Premium and Business Standard. It said they can sign up for 299 licenses for the same price of $30 per person per month. The announcement came via Microsoft’s head of Windows and Surface Yusuf Mehdi in a blog post, where he revealed the company is also getting rid of the 300-seat minimum for commercial plans. He also said Microsoft 365 E3 and E5 subscribers, who pay less, can also now start using Copilot services. While there have been some ways to use Microsoft’s Copilot tools free of charge, such as by accessing it through the Bing search engine or through copilot.microsoft.com, the tools could not be used in apps such as Word, Excel or Outlook. But that is now changing, as Microsoft is offering a new Copilot Pro add-on to Microsoft 365 Personal and Family subscribers that costs an additional $20 per person each month. “Whether you need advanced help with writing, coding, designing, researching or learning, Copilot Pro brings greater performance, productivity and creativity,” Mehdi wrote. Subscribers to Copilot Pro will receive priority access to the very latest models, starting with OpenAI’s GPT-4 Turbo, Mehdi said. Priority access will ensure they can use Microsoft’s cutting edge generative AI models even during the busiest times. They’ll also be able to switch among different models and design custom chatbots with an upcoming tool called Copilot GPT builder. In addition to the new subscriptions, Mehdi announced new functionality for Copilot, including the availability of Copilot GPTs that allow users to customize the tools’ behavior for specific topics of interest. There’s also a new Copilot mobile application available on Android and iOS that provides users with the power of Copilot on the go, and Copilot in the Microsoft 365 mobile application, which will launch on Android and iOS for Microsoft account holders. THANK YOU Blockchain-focused cryptography startup Zama raises $73M to protect data in use Bipartisan bill could see TikTok banned in US if it doesn’t split with China OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions Taalas raises $50M to develop chips optimized for specific AI models Claroty secures $100M to enhance cyber-physical system security Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research Blockchain-focused cryptography startup Zama raises $73M to protect data in use SECURITY - BY MIKE WHEATLEY . 6 HOURS AGO Bipartisan bill could see TikTok banned in US if it doesn’t split with China POLICY - BY JAMES FARRELL . 9 HOURS AGO OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions AI - BY MIKE WHEATLEY . 11 HOURS AGO Taalas raises $50M to develop chips optimized for specific AI models AI - BY MARIA DEUTSCHER . 12 HOURS AGO Claroty secures $100M to enhance cyber-physical system security SECURITY - BY DUNCAN RILEY . 12 HOURS AGO Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research AI - BY MARIA DEUTSCHER . 13 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}