{
    "title": "Microsoft/Vodafone $1.5 Billion Deal Will Help Expand M-Pesa",
    "date": "1/16/2024",
    "url": "https://www.pymnts.com/partnerships/2024/microsoft-vodafone-1-5-billion-deal-will-help-expand-m-pesa/",
    "text": "Microsoft and Vodafone have launched a $1.5 billion payments and AI-focused collaboration. The partnership will see the companies employ Microsoft’s generative artificial intelligence (AI) to enhance Vodafone’s customer experience, Microsoft said in its announcement Tuesday (Jan. 16). The tech giant and the telecom will also build new digital and financial services for businesses, particularly small and mid-sized enterprises (SMEs) in Europe and Africa. That includes helping expand Vodafone’s financial technology platform M-Pesa — already the largest such platform in Africa — by housing it on Microsoft’s Azure and launching new cloud-native applications. “The companies are also launching a purpose-led program that seeks to enrich the lives of 100 million consumers and 1 million SMEs across the African continent,” the announcement said. “The goal is to enhance digital literacy, skilling and youth outreach programs, as well as offer digital services to the underserved SME market. The partnership aims to boost financial services innovation, building a community of certified developers.” As PYMNTS wrote last year, M-Pesa is considered one of the most successful mobile payment systems in Africa — if not the world — and has, since its debut in 2007, helped speed financial inclusion in the region. The platform, at the time, had more than 40 million active customers and over 500,000 merchants accepting M-Pesa in Kenya alone. Aside from the payments aspect, the Microsoft/Vodafone partnership will see the companies use Azure OpenAI to “deliver frictionless, real-time, proactive and hyper-personalized experiences” for things like Vodafone’s digital assistant TOBi. Microsoft says it also plans to invest in Vodafone’s new, standalone Internet of Things (IoT)-managed connectivity platform, which connects 175 million devices and platforms around the world. Vodafone, meanwhile, will become part of the Azure ecosystem, making the IoT platform available to “a vast developer and third-party community using open APIs.” The collaboration is happening as Microsoft’s investments in AI have helped put the company in the running for the world’s largest in terms of market value. Last week, shares in Microsoft climbed to push its market value to $2.87 trillion, ahead of its long-time rival. “Microsoft has benefitted from investor enthusiasm in the rise of generative artificial intelligence (AI) technology in the wake of the rising popularity of AI chatbot ChatGPT,” PYMNTS wrote last week. “Microsoft is the largest backer of OpenAI, the company behind ChatGPT.”  We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}