{
    "title": "Microsoft and Alphabet earnings disappoint despite AI boom",
    "date": "1/31/2024",
    "url": "https://www.siliconrepublic.com/business/microsoft-alphabet-earnings-ai-cloud-stock",
    "text": "by Leigh Mc Gowran 31 Jan 2024 Image: © ColleenMichaels/Stock.adobe.com The two companies both saw a boost in overall revenue and their cloud businesses, but this wasn’t enough to really impress investors. Microsoft and Alphabet have revealed their latest earnings reports which caused stock drops, despite a positive result overall from the tech giants. Alphabet ended 2023 with a strong fourth quarter, as revenue grew 13pc year-over-year to $86.3bn. The company’s operating income and net income also grew significantly in the last quarter of 2023, suggesting a boost in efficiency. Alphabet was one of many tech giants that cut significant staff numbers last year, as the tech sector tightened its belt in response to macro-economic issues. Alphabet is continuing its job cuts this year The company also focused on AI last year, releasing various products to challenge its key rival in the sector, Microsoft. Alphabet saw growth in its ad revenue for Google Search and YouTube. However, the overall result for advertising was short of analysts’ expectations, CNBC reports. As a result, the company’s share price dipped slightly. Google Cloud had a positive result, with revenue growth of more than 25pc in the last quarter, reaching nearly $9.2bn. This beat analyst expectations, representing a change in fortune compared to a more disappointing result from earlier in 2023. “We are pleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud,” said Alphabet and Google CEO Sundar Pichai. “Each of these is already benefiting from our AI investments and innovation. As we enter the Gemini era, the best is yet to come.” Meanwhile, Microsoft had a strong second fiscal quarter, with a significant growth to both revenue and net income. The company’s second quarter ended 31 December 2023 and saw revenue reach $62bn, a boost of 18pc compared to the same period in the previous year. Net income hit $21.9bn – an increase of 33pc – while operating income saw the same level of growth, reaching $27bn. 2023 was a highly significant year for the tech giant, which completed its massive acquisition of Activision Blizzard in October 2023 – before cutting 1,900 staff across multiple gaming businesses. Microsoft has also been a frontrunner in the AI race, getting a significant boost from its partnership with ChatGPT creator OpenAI. The focus on AI helped Microsoft briefly hit the $3trn valuation and challenge Apple for the title of the most valuable company in the world. Revenue from the company’s Intelligent Cloud division – which includes Azure – grew by 20pc to $25.9bn. But despite the positive results, Microsoft’s shares have dipped slightly and there are reports that the results failed to appease the market. Forrester principal analyst Lee Sustar spoke positively about the cloud results of both Microsoft and Alphabet and said all eyes will be on Amazon Web Services to see if it had “similar gains from AI”. “The notable gain in Microsoft Cloud revenues – which include both Azure and SaaS offerings like Microsoft 365 and Dynamics 365 – show that the AI boom is giving a significant boost to cloud providers’ bottom line,” Sustar said. “Google Cloud has left behind years of quarterly losses and now accounts for 10pc of Alphabet revenue as it uses the AI moment to reintroduce itself to enterprise IT leaders as a partner.” 10 things you need to know direct to your inbox every weekday. Sign up for the Daily Brief, Silicon Republic’s digest of essential sci-tech news. Related:\n                    Microsoft,             reports,             cloud,             Google,             Alphabet,             earnings,             AI Leigh Mc Gowran is a journalist with Silicon Republic editorial@siliconrepublic.com 26 Jan 2024 19 Mar 2024 2 days ago 1 day ago 20 Mar 2024 20 Mar 2024 19 hours ago 20 hours ago 21 hours ago 21 hours ago 23 hours ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}