{
    "title": "Microsoft Brings Generative AI-Powered Photo Editing Features To Hundreds \nOf Millions Of Windows Users",
    "date": "2/23/2024",
    "url": "https://www.tradingview.com/news/benzinga:2f7442572094b:0-microsoft-brings-generative-ai-powered-photo-editing-features-to-hundreds-of-millions-of-windows-users/",
    "text": "Microsoft Corp. MSFT has started rolling out new Generative AI-powered photo editing features to hundreds of millions of Windows 10 users, with support for Windows 11 expected to follow soon. What Happened: Microsoft has updated the Windows Photos app with a \"Generative erase\" feature that leverages AI to eliminate distractions from images, the company said in a blog post. The update also includes other AI editing tools like background removal, blur and replace, among others. Microsoft is currently rolling this out to Windows Insiders across all channels, including those on Windows 10 in the Release Preview Channel. See Also: US Supreme Court Just Saved Apple $503M After Putting An End To A 14-Year-Long Legal Battle The Generative erase tool is an enhanced version of the previous Spot fix tool. It enables users to eliminate background items or visual noise from their images, delivering a more cohesive and realistic outcome. Users can access this feature by selecting the Erase option under Edit Image and brushing over the objects or areas they wish to eliminate. For more precise control or to remove multiple objects simultaneously, users can deactivate Auto Apply to add or remove masks. Why It Matters: The introduction of AI-powered features in Windows Photos comes amidst a trend of tech giants leveraging AI in their products. In October, Alphabet Inc.'s GOOG GOOG Google added a slew of AI-powered features with the Pixel 8 series. In January 2024, Samsung Electronics Co Ltd. SSNLF launched the Galaxy S24 with AI-powered features borrowed from Apple Inc. AAPL and Google’s Pixel 8 series. Microsoft has also added a range of AI features to Windows, bringing Copilot, an AI-powered assistant, to all users. The introduction of Generative erase and other AI editing features in Windows Photos is a continuation of Microsoft’s commitment to leveraging AI in its products. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: ‘Godfather Of GPU’ Nvidia’s Jensen Huang Says ‘AI Factories’ Will One Day Take Over The World Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Microsoft © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}