{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.euronews.com/next/2024/02/26/microsoft-partners-with-french-ai-start-up-mistral-ai-as-it-unveils-new-ai-tool",
    "text": "It marks a dramatic shake-up for the company which launched as partially open sourced, meaning the software is free for the public to modify and distribute. French artificial intelligence (AI) champion Mistral AI has unveiled a new large language model (LLM) set to rival OpenAI's ChatGPT, it announced on Monday. Called Mistral Large, the company says it \"reaches top-tier reasoning capabilities,\" and is fluent in French, English, German, Spanish and Italian. But the LLM, the underlying technology that powers generative AI products, will be available to Microsoft customers as the two firms announced a partnership on Monday. It marks a dramatic shake-up for the company which launched as partially open sourced, meaning the software is free for the public to modify and distribute. Mistral AI's first model open sourced its model weights - the numerical parameters that influence how an AI model performs - but not the data or training process. But this will not be the case for Mistral Large, which will be available to Azure customers, Microsoft’s cloud computing service. The tech giant will also have a minor stake in Mistral, but it has not been disclosed how much, according to the Financial Times. Asked if the company was changing its open source business model, Mistral cofounder Arthur Mensch said in an interview with the Le Monde: \"We started with open source models, which anyone can deploy for free because that's a way of distributing them widely and creating demand. \"But from the outset, we have provided a business model with [the most powerful] optimised models\". He added that \"commercial activity\" will allow the company \"to finance the costly research required for model development\". Mistral also unveiled its multilingual conversational assistant called Le Chat (the cat), which the 10-month-old company said \"is natively multilingual and offers a pedagogical and fun way to explore Mistral AI’s technology\". The company has released a beta version of Le Chat, which anyone can try out at the moment for free. Users can try out three different models — Mistral Small, Mistral Large and Mistral Next. “This is a significant milestone for us, as the unparalleled performance of this multilingual model will continue to push the boundaries of what is possible with frontier AI,” Arthur Mensch, cofounder and CEO of Mistral AI, said in a press release. “We are very proud to announce the availability of Mistral Large on Azure AI. Microsoft's trust in our model is a step forward in our journey to put frontier AI in everyone's hands”. Founded by the alums from Google’s DeepMind and Meta,  Mistral was valued at around €2 billion in December to reach unicorn status, a company valued at €1 billion. Microsoft is going big on AI, having already invested $13 billion (€12 billion) in ChatGPT maker OpenAI. Microsoft is not the only Big Tech company to enter the age of AI. Amazon and Google are also heavily investing in building generative AI. This article has been updated to add context about the Mistral/Microsoft partnership.   "
}