{
    "title": "Intel To Manufacture Microsoft Chips, CEO Satya Nadella Says - Intel \n(NASDAQ:INTC)",
    "date": "2/21/2024",
    "url": "https://www.benzinga.com/news/24/02/37242631/intel-to-manufacture-microsoft-chips-ceo-satya-nadella-says",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Intel Corporation INTC and Microsoft Corporation MSFT announced that Microsoft will be using Intel's 18A process to manufacture its own chip design. The Details: The announcement was made Wednesday at Intel Foundry Direct Connect by Microsoft CEO Satya Nadella. “We are in the midst of a very exciting platform shift that will fundamentally transform productivity for every individual organization and the entire industry,” Nadella said. “To achieve this vision, we need a reliable supply of the most advanced, high-performance and high-quality semiconductors. That’s why we are so excited to work with Intel Foundry, and why we have chosen a chip design that we plan to produce on Intel 18A process.” Intel also announced the launch of Intel Foundry as a more sustainable systems foundry business designed for the AI era and an expanded process roadmap. “AI is profoundly transforming the world and how we think about technology and the silicon that powers it,” said Intel CEO Pat Gelsinger. “This is creating an unprecedented opportunity for the world’s most innovative chip designers and for Intel Foundry, the world’s first systems foundry for the AI era. Together, we can create new markets and revolutionize how the world uses technology to improve people’s lives,” Gelsinger added. Related News: What’s Going On With Rivian Stock Ahead Of Earnings? INTC, MSFT Price Action: According to Benzinga Pro, Microsoft shares are down 0.88% at $399.25, and Intel shares are down 1.73% at $43.75 at the time of publication. Image: from Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}