{
    "title": "3 Power Stocks Ready to Ride the Market's Upward Wave",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/news/3-power-stocks-ready-ride-110100455.html",
    "text": "On February 4, CBS’ 60 Minutes broadcast Federal Reserve Chair Jerome Powell saying that the Fed members “want some more confidence before” cutting rates. As a result, stocks fell sharply on Feb. 5. But, as I noted in a previous column, Powell also said on Jan. 31 that “if the economy evolves broadly as expected, it will likely be appropriate to begin dialing back policy restraint at some point this year.” So it seems that rate cuts may be delayed, but they almost certainly will occur later this year. This backdrop has led to to this list of stocks to buy. With the Street looking forward to those cuts and the economy staying quite strong, U.S. equities are likely to keep trending higher for the rest of the year. For momentum traders and momentum investors, here are three stocks to buy that have already climbed by large amounts and are likely to keep doing so as the bull market continues for the rest of 2024. Source: Asif Islam / Shutterstock.com Microsoft (NASDAQ:MSFT) reported better-than-expected fiscal second-quarter results on Jan. 31, propelled, as expected, by the strength of its cloud business. Specifically, the sales of its Azure cloud-infrastructure unit soared 30% last quarter versus the same period a year earlier. InvestorPlace - Stock Market News, Stock Advice & Trading Tips Also impressively, the company noted that it expects Azure to generate similar year-over-year revenue growth during the current quarter. Clearly, as I and many others had anticipated, Azure is benefiting tremendously from selling AI-powered services, “products and tools.” According to Dan Ives, a well-known analyst at investment bank Wedbush, more than 60% of MSFT’s current customers are looking to utilize AI throughout their firms “over the next few years.” As a result, MSFT’s sales of AI-powered systems will likely continue to surge going forward, enabling MSFT to continue to report very strong quarterly financial results and boosting MSFT stock higher. Source: khunkornStudio / Shutterstock.com The Street continues to be in love with ServiceNow (NYSE:NOW), which provides automated IT tools and has made a big push into selling and implementing AI tools for its clients. Specifically, multiple banks were very pleased by the company’s very strong fourth-quarter results. Citing positive “macro” catalysts and the “momentum” of the company’s AI-powered Pro+ offering, investment bank Evercore ISI hiked its price target on the shares to $850 from $820. Moreover, Evercore called NOW stock “one of the best compounding stories in software for long-term investors.” Also bullish on NOW stock in the wake of its results was Goldman Sachs which raised its price target on NOW to $910. Among the positive catalysts for the company and its shares going forward are its launch in Amazon’s AWS market last month and the boost it’s getting from its AI offerings, Goldman wrote. As of the afternoon of Feb., 5, NOW had soared 28% in the previous three months and 72% in the last 12 months. But given the affection the Street obviously has for the firm and its ability to benefit from the AI boom, I believe that NOW is one of the best stocks to buy at this point. Source: Shutterstock As I noted in a previous column, Intel (NASDAQ:INTC) reported very strong fourth-quarter results, as its PC business is rebounding, while its AI chips are starting to move the needle for the tech giant. What’s more, over the longer term, the company’s nascent business of making chips for other firms is poised to become huge. Nonetheless, the shares sold off following the firm’s results because its Q1 revenue guidance was weaker than expected. But that miss was likely caused by a combination of conservatism by the company and the struggles of one of its peripheral businesses which it plans to spin off. But it looks like the shares are shaking off their post-earnings blues, as, on Feb.5, INTC climbed as high as 4% above its post-earnings low of $41.60, set on Feb 2. As a result, I believe that the name is ready to resume its gains of recent months, money. Indeed, after its post-earnings pullback, INTC stock has still jumped 30% from its October closing low of $32.57. On the date of publication, Larry Ramer held a long position in INTC and his wife held a long position in NOW. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. The #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The post 3 Power Stocks Ready to Ride the Market’s Upward Wave appeared first on InvestorPlace. Related Quotes "
}