{
    "title": "Microsoft partners with Mistral AI in Azure supercomputing deal",
    "date": "2/26/2024",
    "url": "https://www.datacenterdynamics.com/en/news/microsoft-partners-with-mistral-ai-in-azure-supercomputing-deal/",
    "text": "Appears similar to arrangement with OpenAI Microsoft has entered into a partnership with French generative AI lab Mistral AI to help commercialize its new generative AI language models. As part of the deal, Microsoft will support the company with Azure AI supercomputing infrastructure, including exploring using the increased compute to train purpose-specific models for select customers, including European public sector workloads. Alongside taking a small stake in the business, last valued at €2 billion ($2.1bn), Microsoft will offer Mistral's models on its Azure service. Mistral 7B was already a part of the Azure AI model catalog, accessible through Azure AI Studio and Azure Machine Learning since last November. But the AI startup has now put its latest model, Mistral Large, on Azure. Mistral Large is a general-purpose language model that handles French, German, Spanish, Italian, and English. The company claims that it is the world’s second-ranked model generally available through an API (after OpenAI's GPT), according to common benchmarks. It is currently only available on Azure, although the language in the announcement suggests that this is a timed exclusivity deal. “We are thrilled to embark on this partnership with Microsoft. With Azure’s cutting-edge AI infrastructure, we are reaching a new milestone in our expansion propelling our innovative research and practical applications to new customers everywhere,\" Arthur Mensch, Mistral AI CEO, said. Philippe Rambach, chief AI officer at Schneider Electric, added: “We have tested Mistral Large through the Azure AI Studio in a use case aimed at internal efficiency. \"The performance was comparable with state-of-the-art models with even better latency. We are looking forward to exploring further this technology in our business.” Mistral Small will also be available today, with improved latency over Mistral’s 8x7B model. The deal comes a year after Microsoft last invested in OpenAI, with a rumored $10bn pumped into the generative AI leader. The majority of that investment was in the form of Azure cloud credits, which OpenAI has used to train and run its latest models. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}