{
    "title": "Microsoft unveils Face Check for secure identity verification",
    "date": "2/6/2024",
    "url": "https://venturebeat.com/security/microsoft-unveils-face-check-for-secure-identity-verification/",
    "text": "Join us in Atlanta on April 10th and explore the landscape of security workforce. We will explore the vision, benefits, and use cases of AI for security teams. Request an invite here.  Microsoft today announced the launch of Face Check, a new facial recognition feature for its Entra Verified ID digital identity platform. Face Check allows businesses to match a user’s selfie to their government ID or employee credentials, providing an extra layer of security for sensitive operations like password resets or help desk access. “Rather than compete with an overcrowded market, we’re partnering with leading verification providers to make it easy for businesses and developers to integrate world-class verification services (like government ID or legal entity verification) with minimal custom code,” said Ankur Patel, Microsoft’s partner product manager for Entra Verified ID, in an interview with VentureBeat. “Businesses and verifications partners can integrate Face Check to enhance real-time privacy respecting biometric verification,” he said. “Verified ID’s open-standards based technical approach coupled with a strategy to partner rather than compete will help Entra ID deliver enterprise-grade verification, in addition to security, compliance, and privacy.” Face Check leverages Microsoft’s Azure AI services to compare the live selfie to the individual’s verified photo ID in a privacy-respecting way. Only the match results, and not any sensitive biometric data, are shared with the verifying application. The AI Impact Tour – Atlanta This approach minimizes privacy and compliance risks associated with facial recognition technology, according to Patel. “The user’s liveness data is only matched with their permission and is not shared. The match score is the only information shared with the requesting application,” he said. Microsoft partners say Face Check is already delivering results. For example, BEMO, a leader in help desk services, has implemented Face Check to verify the identity of many of its help desk employees. The company says that more than 100 BEMO business customers have also implemented Face Check. Face Check enters a crowded identity verification market, but Microsoft is betting on integration over competition. Face Check’s open API approach may also give it an advantage for enterprise adoption. Identity verification has become critically important with the rise in cybercrime and AI-enabled fraud. By leveraging open standards over proprietary facial recognition tech, Microsoft is positioning Entra Verified ID as a universal hub for digital identity platforms. With Face Check, Microsoft aims to make multi-factor identity verification seamless across devices, apps, and platforms. The company hinted that more identity attributes like work history and legal entity validation will be supported soon. For now, Face Check is available in preview mode free of cost. VB Daily\nStay in the know! Get the latest news in your inbox daily\n\n\n\n\n Subscribe\n\nBy subscribing, you agree to VentureBeat's Terms of Service.\n\n\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\nAn error occured. Stay in the know! Get the latest news in your inbox daily By subscribing, you agree to VentureBeat's Terms of Service. Thanks for subscribing. Check out more VB newsletters here. An error occured. Join Gen AI leaders in Atlanta an exclusive invitation-only event filled with networking and insights on how generative AI is transforming the security workforce. © 2024 VentureBeat. All rights reserved. "
}