{
    "title": "Despite years of animosity, CCleaner is now available in the Windows 11 \nMicrosoft Store",
    "date": "2/9/2024",
    "url": "https://mspoweruser.com/microsoft-bans-ccleaner-2-2/",
    "text": "Follow us Share this article Improve this guide 2 min. read Updated on February 9, 2024 updated on \n\nFebruary 9, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more The Windows 11 Microsoft app store is certainly a new start for the company, with Microsoft letting go of its paternalistic attitude and letting Windows 11 users and developers access the full capabilities of win32 applications via the Store. This has meant we have seen new kinds of listings, such as for browsers such as Firefox and Opera, and it appears also apps which Microsoft has a long history of animosity towards. Softpedia reports that CCleaner, the famous Windows optimization app, is now available in the Microsoft Store.  In 2020 Microsoft officially marked CCleaner as a Potentially Unwanted Application on their Microsoft Security site: That decision was reportedly due to the installer installing some additional unnecessary applications. CCleaner has in the past been compromised to deliver malware to Windows PCs, and there have also been some issues with CCleaner not being compatible with Windows 10, though those issues have now been fixed. In general most of the things you can do in CCleaner you can do with built-in tools, but it is good to see Microsoft letting go of some control and allowing users to make their own decisions. If you’re looking for a CCleaner alternative for Windows 11, you’ll be glad to know that there are many available options. More about the topics: app, CCleaner, windows 10 Surur Davids Smartphone Expert Surur Davids is the founder of WMPoweruser which later became MSPoweruser.com. He's a smartphone expert with over a decade of experience. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Surur Davids Smartphone Expert Surur Davids is the founder of WMPoweruser which later became MSPoweruser.com. He's a smartphone expert with over a decade of experience. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}