{
    "title": "Two magnificent seven stocks beat earnings estimates but didn’t move markets",
    "date": "2/2/2024",
    "url": "https://www.fxstreet.com/news/two-magnificent-seven-stocks-beat-earnings-estimates-but-didnt-move-markets-202402020445",
    "text": "Jacob Wolinsky\n\nValueWalk Two of the so-called “Magnificent 7” stocks – Microsoft (NASDAQ: MSFT) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) — posted earnings that beat estimates on Tuesday afternoon after the market closed, but neither were able to move the market. Both the S&P 500 and Nasdaq Composite ended Tuesday down slightly, and they were both trending lower in early morning trading. Also, both the S&P 500 and Nasdaq Composite were down on Wednesday morning. It may seem unusual that two of the mega-cap technology stocks that drove markets last year failed to make a blip this week after posting solid earnings. However, there are other forces at play — namely, the Federal Reserve meeting on Wednesday and its subsequent decision on interest rates. Currently the world’s largest company by market cap, Microsoft, had a strong fiscal second quarter, which ended on Dec. 31. The company’s revenue jumped 18% to $62 billion while its net income rose 33% year over year to $21.9 billion, or $2.93 per share. However, Microsoft’s stock price was down by about 1% Wednesday morning, trading at around $403 per share. The tech giant’s revenue continues to be driven by its cloud-computing business, which saw a 24% increase in revenue, rising to $33.7 billion in the quarter. Of that amount, $25.9 billion was generated through its artificial-intelligence-fueled Intelligent Cloud business, which was up 20% year over year, also beating estimates. “We’ve moved from talking about AI to applying AI at scale,” said Satya Nadella, chairman and CEO at Microsoft. “By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector.” Microsoft’s outlook for the third quarter may have been part of the reason its stock was moving lower on Wednesday, as its revenue is projected to be between $60 billion and $61 billion in Q3, down slightly from Q2’s $62 billion. While both the Intelligent Cloud and Productivity and Business Processes businesses are expected to see quarter-over-quarter revenue increases, the More Personal Computing segment is projected to see a drop. Microsoft also projected operating expenses in Q3 to be between $15.8 billion and $15.9 billion, which would be up from about $15.3 billion in Q2. However, that guidance includes about $300 million in costs related to the integration of the recently purchased Activision. On the earnings call, Chief Financial Officer Amy Hood expanded on that, saying the company expects capital expenditures to “increase materially on a sequential basis, driven by investments in our cloud and AI infrastructure.” Alphabet, the company that owns Google and other properties, also beat estimates, but its stock was dropping on Wednesday, down by about 6% in the morning to around $143 per share. Currently the fourth-largest company in the world by market cap, Alphabet saw its revenue increase 13% year over year to $86.3 billion in the quarter. Its operating margin increased from 24% to 27% compared to the fourth quarter of 2022, and its net income rose 52% to $20.7 billion. Alphabet saw a 26% year-over-year increase in revenue in its cloud-computing business to $9.2 billion, while Google Advertising, which includes Google Search and YouTube ads, was up 11% to $65.5 billion. However, the Google Advertising numbers came in slightly below estimates. “We are pleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud. Each of these is already benefiting from our AI investments and innovation. As we enter the Gemini era, the best is yet to come,” Alphabet CEO Sundar Pichai said in the earnings release. Gemini is Alphabet’s recently launched AI-driven search model, which was built to rival OpenAI’s ChatGPT. With it will come some hefty capital investments, as the company outlined in its 10-K filing. “During the years ended December 31, 2022 and 2023, we spent $31.5 billion and $32.3 billion on capital expenditures, respectively,” Alphabet said in the filing. “We expect to increase, relative to 2023, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services.” That may have also impacted investor sentiment toward Alphabet. However, if you look at how Wall Street analysts reacted, it was a mixed bag, with roughly half raising their price targets and half lowering them. Thus, the bottom line is that neither of these Magnificent Seven stocks were able to move the markets despite solid quarters, but investors may be preoccupied to some extent with what the Fed might do on Wednesday. VALUEWALK LLC is not a registered or licensed investment advisor in any jurisdiction.\nNothing on this website or related properties should be considered personalized investments advice. Any investments recommended here in should be made only after consulting with your personal investment advisor and only after performing your own research and due diligence, including reviewing the prospectus or financial statements of the issuer of any security.\n\nVALUEWALK LLC, its managers, its employees, affiliates and assigns (collectively “The Company”) do not make any guarantee or warranty about the advice provided on this website or what is otherwise advertised above.\n\nThe Company is not registered or licensed by any governing body in any jurisdiction to give investing advice or provide investment recommendation.\n\nThe Company disclaims any liability in the event any information, commentary, analysis, opinions, advice and/or recommendations provided herein prove to be inaccurate, incomplete or unreliable, or result in any investment or other losses. EUR/USD remains depressed below 1.0800 after soft French inflation data, amid minimal volatility and thin liquidity on Good Friday. The pair barely reacted to US PCE inflation data, with the Greenback shedding some pips.  Fed Chair Jerome Powell set to speak ahead of the weekly close. GBP/USD trades sideways above 1.2600 amid a widespread holiday restraining action across financial markets. Investors took a long weekend ahead of critical United States employment data next week. Fed Chair Powell coming up next. Gold price holds near a fresh all-time high at $2,236 in thinned trading amid the Easter Holiday. Most major world markets remain closed, although the United States published core PCE inflation, the Federal Reserve’s favorite inflation gauge. Jito (JTO) price has been on an uptrend since forming a local bottom in early January. Since then, JTO has revisited the key swing point formed in early December, suggesting the bulls’ intention to move higher. Next week, the main focus will be inflation and the labour market in the Eurozone. We expect services inflation to be impacted by the easter effect, while the unemployment rate to be unchanged. Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer. Trading foreign exchange on margin carries a high level of risk and may not be suitable for all investors. The high degree of leverage can work against you as well as for you. Before deciding to trade foreign exchange you should carefully consider your investment objectives, level of experience and risk appetite. The possibility exists that you could sustain a loss of some or all of your initial investment and therefore you should not invest money that you cannot afford to lose. You should be aware of all the risks associated with foreign exchange trading and seek advice from an independent financial advisor if you have any doubts. Opinions expressed at FXStreet are those of the individual authors and do not necessarily represent the opinion of FXStreet or its management. FXStreet has not verified the accuracy or basis-in-fact of any claim or statement made by any independent author: errors and omissions may occur. Any opinions, news, research, analyses, prices or other information contained on this website, by FXStreet, its employees, clients or contributors, is provided as general market commentary and does not constitute investment advice. FXStreet will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on such information. "
}