{
    "title": "Options Traders Target Microsoft Stock Amid Record Highs",
    "date": "2/12/2024",
    "url": "https://www.schaeffersresearch.com/content/options/2024/02/12/options-traders-target-microsoft-stock-amid-record-highs",
    "text": "The shares of the most valuable publicly traded company in the world, Microsoft Corp (NASDAQ:MSFT), hit an all-time high of $420.82 on Friday, after closing its fifth-straight week of gains. With help from the artificial intelligence (AI) demand, the Big Tech giant's market cap has hit record-breaking levels, currently valued at over $3.12 trillion. Today, the stock is dipping from its recent highs, down 1.1% at $416.13 at last check.  Unsurprisingly, options traders have continued to target MSFT. Per Schaeffer's Senior Quantitative Analyst Rocky White's list of stocks that attracted the highest weekly options volume during the last 10 days, Microsoft stock has seen 3,216,566 calls and 1,686,164 puts exchanged. The most popular contract during this time period was the weekly 2/9 420-strike call.  This penchant for bullish bets is nothing new. According to data at the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX), the security's 50-day call/put volume ratio of 2.03 stands higher than all other readings from the past year. These options traders are in luck, as the equity's Schaeffer's Volatility Index (SVI) reading of 18% sits in the 12th percentile of annual readings. This implies options traders are pricing in relatively low volatility expectations.  Target Effortless Triple-Digit Gains Every Sunday Evening For Life! 101.0% GAIN on Apollo Global Management calls\n103.6% GAIN on JP Morgan  Chase calls\n105.3% GAIN on DraftKings calls\n101.3% GAIN on Airbnb calls\n203.0% GAIN on Shopify calls\n102.0% GAIN on Cboe Global Markets calls\n100.9% GAIN on Boeing calls\n102.1% GAIN on Microsoft puts\n102.3% GAIN on First Solar calls\n101.5% GAIN on PulteGroup calls\n101.0% GAIN on Apple calls\n209.4% GAIN on NXP Semiconductors calls\n100.8% GAIN on Uber Technologies calls\n100.4% GAIN on Academy Sports and Outdoors puts\n102.2% GAIN on Trade Desk calls\n100.8% GAIN on DoorDash calls\n100.0% GAIN on Camping World Holdings puts\n100.0% GAIN on Cboe Global Markets calls\n100.2% GAIN on C3.ai calls\n238.5% GAIN on Oracle calls     "
}