{
    "title": "Microsoft Q2 hails shift to \"applying AI” amidst cloud influx",
    "date": "2/1/2024",
    "url": "https://erp.today/microsoft-q2-hails-shift-to-applying-ai-amidst-cloud-influx/",
    "text": "ERP Today has established itself as THE independent voice of the enterprise technology sector through its use of dynamic journalism, creativity and purpose. Microsoft’s second quarter earnings for the financial year 2024 have surpassed analysts’ expectations, driven by the intelligent cloud business. The results for the quarter ended December 31, 2023, saw Microsoft’s revenue grow to $62bn, up 18 percent year-on-year (YoY), exceeding analysts’ expectations of $61bn. Intelligent cloud business gave the company a big boost, with its revenue up 20 percent to $25.9bn as server products and cloud services revenue increased by 22 percent – spurred by Azure and other cloud services revenue growth of 30 percent. Satya Nadella, chairman and CEO of Microsoft, emphasized the role of AI as part of its offering: “We’ve moved from talking about AI to applying AI at scale. By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector.” Over the quarter, the company reached 53,000 Azure AI customers, with over one-third joining Azure over the past 12 months. In the company’s earnings call, Nadella highlighted that Azure again took share this quarter by leaning on the added value of its AI Advantage. “Our new models-as-a-service offering makes it easy for developers to use LLMs from our partners, like Cohere, Meta and Mistral, on Azure without having to manage underlying infrastructure,” said Nadella. “We have also built the world’s most popular SLMs, which offer performance comparable to larger models but are small enough to run on a laptop or mobile device.” Meanwhile, operating income reached $27.0bn, a 33 percent jump, as net income also increased 33 percent to $21.9bn. Amy Hood, executive vice president and CFO of Microsoft added that robust execution by its sales teams and partners has again driven share gains this quarter across many of the businesses. “Strong execution by our sales teams and partners drove Microsoft Cloud revenue to $33.7bn, up 24 percent (up 22 percent in constant currency) YoY,” said Hood. In some of its notable deals from the quarter, Microsoft teamed up with Vodafone in a mammoth new strategic partnership to bring advances in generative AI and the cloud closer to more than 300 million businesses. The company also partnered with the American Federation of Labor and Congress of Industrial Organizations to create an open dialogue on AI policy that supports workers. In addition, Microsoft recently announced a collaboration with Eviden, the Atos Group business, to help clients move to the cloud and facilitate their use of Azure OpenAI Service. "
}