{
    "title": "Microsoft Will Skill 2Mln Indians In AI: Satya Nadella",
    "date": "2/8/2024",
    "url": "https://indiawest.com/microsoft-will-skill-2mln-indians-in-ai-satya-nadella/",
    "text": "BENGALURU, (IANS) – Microsoft Chairman and CEO Satya Nadella on February 7 announced that the company will train more than two million people in India in generative AI skills, to address talent shortage in the AI era. Addressing an event here, Nadella said that making sure that youth have the necessary skills to be able to thrive in this new AI age is the most important thing that we should be doing. “We are happy to play our role in it. But it’s not just the skills but also the jobs that will get created with AI,” Nadella told the gathering. He said that India has the best software developers and has a robust AI engineering community on the Microsoft-owned developer platform Github, second only to the US. “In rural India, people are now participating in the AI economy,” he added. Nadella said that it is very exciting in a country like India, where there is so much investment and so much capital going into the core basic science-driven industries to be able to really come to help India leapfrog even some of the scientific revolution would be very exciting. The Microsoft CEO said that the company will continue to invest more in the country. “We have more Cloud regions in India than any other hyperscale around the world. We have three regions, and the fourth one is coming soon. We are investing more in India to make sure that compute with low latency at scale, including the AI, are available for all of you to be able to take advantage,” said Nadella. Microsoft is integrating the power of AI across the entire data and tech stack, seeing increased usage from AI-first start-ups and some of the world’s largest companies, he added. Save my name, email, and website in this browser for the next time I comment.  Subscribe to Our Newsletter\n\n\n\n\n\n        Your Email Address                    * Subscribe to Newsletter\n\n\n\n\n\n        Your Email Address                    * Copyright © 2022 India West | Developed By Codeblend Labs. "
}