{
    "title": "Tech Moves: Microsoft's new Surface and Windows chief; ex-Zillow CEO joins \nMatch Group board; Oleria adds execs",
    "date": "3/25/2024",
    "url": "https://www.geekwire.com/2024/tech-moves-microsofts-new-surface-and-windows-chief-ex-zillow-ceo-joins-match-board-oleria-adds-execs/",
    "text": "by Taylor Soper on March 25, 2024 at 6:07 pmMarch 25, 2024 at 7:01 pm Tech Moves covers notable hires, promotions and personnel changes in the Pacific NW tech community. Submissions: tips@geekwire.com — Longtime Microsoft exec Pavan Davuluri is taking on a new role leading the company’s Surface and Windows divisions, according to a report from The Verge. Following last year’s departure of former chief product officer Panos Panay, Microsoft split up its Surface and Windows groups with separate leaders, including Davuluri, who headed up Surface silicon and devices work. But now the tech giant is bringing the two together again, with Davuluri overseeing the combined group, according to a memo cited by The Verge. As part of the change, Mikhail Parakhin, who was leading a new Windows group focused on “Windows and web experiences,” is exploring a new opportunity, likely outside the company, according to The Verge. The changes follow last week’s hiring of AI pioneer Mustafa Suleyman and colleagues from Inflection AI. Suleyman, co-founder of DeepMind, will lead a new organization called Microsoft AI. Davuluri joined Microsoft more than 23 years ago. He recently appeared on stage at an AMD event with AMD CEO Lisa Su in December. We’ve followed up with Microsoft for comment, and will update if we hear back. Update: The company declined to comment. — Former Zillow Group CEO Spencer Rascoff joined the board of Match Group, the online dating behemoth that owns Tinder, Hinge, and other brands. “Similar to Zillow Group, Match Group is a multi-brand, mobile-first, category-leading, two-sided marketplace in an important category — relationships,” Rascoff wrote on LinkedIn. Match Group also added Instacart CMO Laura Jones to its board. Rascoff helped start Zillow back in 2005 and was CEO until 2019. He currently runs a venture capital fund in Los Angeles called 75 & Sunny Labs and is board chair at real estate marketplace startup Pacaso. Last year he co-founded a Seattle AI startup called HeyLibby. Rascoff previously sat on the boards of TripAdvisor and Palantir. — Seattle cybersecurity startup Oleria added two new executives: Jeremy Korst as chief commercial officer, and Shana Glenzer as head of marketing. Korst is a longtime Seattle-area tech leader, with stints at Microsoft, Avalara, and T-Mobile. He became a senior advisor and investor in Oleria in 2022. Korst is also a partner and the former president of Seattle marketing consultantcy GBK Collective. Glenzer was vice president of marketing at Diligent, a New York City-based governance software startup. She also held marketing leadership roles at Crowdskout and MakeOffices, and co-founded DCFemTech, a Washington D.C.-based group helping boost women in tech. Oleria helps companies manage employee access to applications and data. Founded last year, the company announced a $33.1 million Series A round in January. The company is led by CEO Jim Alkove, a former chief trust officer at Salesforce.  TalentReach is one of Seattle’s top recruiting firms, specializing in engineering and sales recruitment for tech companies. Our team has unmatched industry experience and is a pioneer of Recruiting-as-a-Service. We invest in relationships with both candidates and employers to build better teams. Talent is your company’s most valuable asset. Invest in the best. Learn more here. Learn more about underwritten and sponsored content on GeekWire. Tech Moves: VC firm Ascend names new partner; Common Room adds board member; and more Tech Moves: Smartsheet co-founder will leave board; Pandion hires logistics execs; and more Tech Moves: Accolade names new chief people officer; YouTube gaming leader joins Microsoft Subscribe to GeekWire's free newsletters to catch every headline Have a scoop that you'd like GeekWire to cover? Let us know. Longtime Microsoft hardware leader Panos Panay is leaving the company after 19 years Tech Moves: Former Amazon, Flexport exec Tim Collins joins Blue Origin as supply chain chief Tech Moves: Microsoft leader Joe Belfiore to retire; Fabric adds CPO; Mariners hire Expedia exec Tech Moves: Appen lands ex-Upwork CTO; DocuSign hires former Amazon GM Catch every headline in your inbox "
}