{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.connectcre.com/stories/microsoft-pivots-decides-to-hold-on-to-bellevue-office-space/",
    "text": "Menu Get Daily News Advertise Connect Money Search Your source for daily news covering CRE transactions and trends. Stay informed on national, regional and property sector news that matters to your business. Offering on-demand online courses that provide continuing education credits for brokers, attorneys, appraisers and architects. Select from easily accessible video and written courses that cover a variety of CRE topics. News when you need it. All our Breaking News, right to your inbox. Sign up for Connect emails to stay informed with CRE stories that are 150 words or less. Oregon Pacific Northwest Portland Seattle Washington Apartments CRE Insider Distressed Assets Finance Healthcare Hospitality Industrial Net Lease Office Opportunity Zones Retail Senior Housing Student Housing Weekender Lease Sale/Acquisition Development Financing People Economy Policy/Gov't Recruitment Microsoft Corp. is straying from its original plans to abandon all of the company’s space in downtown Bellevue. The technology conglomerate is opting to keep some space for its LinkedIn subsidiary, which will remain on floors 17 and 18 of the Lincoln Square North tower at 10401 NE Eighth Street, reported the Puget Sound Business Journal, citing industry sources. While Microsoft and Amazon have exited much of their existing space as leases expire in the area, other tech companies are using the vacant space as opportunities to expand. Social media and e-commerce company TikTok, which is owned by parent company ByteDance, is expanding its footprint in Bellevue with six floors in the Lincoln Square North Tower, doubling its existing space. And Skanska signed a long-term lease for its mixed-use development, The Eight, a 25-story, office tower in Bellevue with entertainment company Pokémon. Per the Journal, Microsoft’s move will take more than 88,000 square feet of office space off the market. Jasmine Kilman is Content Director of Connect Commercial Real Estate, covering Chicago and greater Chicagoland, the Midwest, Seattle, and the Pacific Northwest. She covers industry trends, transaction deals, market research, and produces daily news stories.\nWith experience in marketing and communications for academic nonprofits and corporate clients, including Hearst Media, Hilton, and Coldwell Banker, Kilman has written about commercial real estate, environmental, social, and corporate governance (ESG), technology, healthcare, and philanthropy. She was born and raised in California and graduated with a degree in public relations. In her spare time, Kilman enjoys hiking and traveling to new locations with her family. "
}