{
    "title": "'Massive conflict of interest' as US politician buys $27 million in MSFT \ncall options",
    "date": "3/9/2024",
    "url": "https://finbold.com/massive-conflict-of-interest-as-us-politician-buys-27-million-in-msft-call-options/",
    "text": "In recent months, the involvement of United States politicians in the stock market has raised concerns about potential conflicts of interest. Former House Speaker Nancy Pelosi, in particular, has drawn attention for her stock purchases and realized profits from her stake in the semiconductor giant Nvidia (NASDAQ: NVDA). In the latest disclosure, data from Quiver Quant published on March 8 revealed that US Representative Josh Gottheimer, for New Jersey’s 5th congressional district, made a substantial investment of $27 million in Microsoft’s (NASDAQ: MSFT) call options. Representative Josh Gottheimer just disclosed a purchase of up to $27M of Microsoft call optionsThat's not a typo: $27MLikely related to Gottheimer's former role as a strategist at MicrosoftStill seems like a massive conflict of interestWill be keeping an eye on it pic.twitter.com/scPFxiqQn8 Quiver Quant labeled this purchase as a ‘massive conflict of interest’ on the part of the politician. Notably, a call option gives an investor the right, but not the obligation, to buy an underlying asset at a predetermined price (strike price) before the option expires. Investors aim to profit by exercising the option if the market price rises above the strike price. The timing of Gottheimer’s investment is significant, given his prior role as a strategist at Microsoft. While it’s not uncommon for individuals with business backgrounds to invest in familiar companies, the scale of the transaction has raised suspicions of a conflict of interest, although representatives are allowed to engage in stock purchases. It’s worth noting that in February 2022, Gottheimer publicly pledged to establish a blind trust to manage his assets, a move often employed by politicians to avoid conflicts of interest and maintain transparency. On the other hand, Gottheimer is an active trader, with data retrieved from Quiver Quant on March 9 indicating that he has executed 2,604 trades, with the information technology sector leading with 715. His total trade volume stands at $264 million. It’s worth noting that Microsoft’s stock has stood out, particularly due to the company’s foray into the lucrative artificial intelligence (AI) sector. Over the past year, MSFT has experienced a significant gain of approximately 60%, and in 2024 alone, the equity has yielded nearly a 10% return. Several politicians have similarly enjoyed substantial returns from their stock investments. For example, as reported by Finbold, Pelosi tripled her annual salary through the exercise of Nvidia stock options. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}