{
    "title": "OneSpaWorld Holdings Limited (NASDAQ:OSW) Director Maryam Banikarim Sells \n6,411 Shares",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-osw-insider-buying-and-selling-2024-03-18/",
    "text": "OneSpaWorld Holdings Limited (NASDAQ:OSW - Get Free Report) Director Maryam Banikarim sold 6,411 shares of OneSpaWorld stock in a transaction on Thursday, March 14th. The shares were sold at an average price of $13.07, for a total value of $83,791.77. Following the completion of the sale, the director now directly owns 75,765 shares of the company's stock, valued at $990,248.55. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this link. Shares of OneSpaWorld stock traded up $0.07 on Monday, reaching $12.93. 348,235 shares of the company were exchanged, compared to its average volume of 630,612. OneSpaWorld Holdings Limited has a 1-year low of $9.82 and a 1-year high of $15.12. The company has a market cap of $1.30 billion, a P/E ratio of -117.53 and a beta of 2.14. The company has a debt-to-equity ratio of 0.36, a current ratio of 1.57 and a quick ratio of 0.98. The stock's 50 day moving average price is $13.62 and its 200-day moving average price is $12.41. Several research firms have weighed in on OSW. Stifel Nicolaus lifted their target price on OneSpaWorld from $20.00 to $21.00 and gave the company a \"buy\" rating in a research report on Wednesday, January 10th. Truist Financial lifted their target price on OneSpaWorld from $14.00 to $16.00 and gave the company a \"buy\" rating in a research report on Friday, January 5th. Check Out Our Latest Report on OSW A number of institutional investors and hedge funds have recently made changes to their positions in the stock. Vanguard Group Inc. grew its position in shares of OneSpaWorld by 6.2% during the fourth quarter. Vanguard Group Inc. now owns 2,092,286 shares of the company's stock worth $29,501,000 after buying an additional 121,758 shares in the last quarter. Wellington Management Group LLP acquired a new position in OneSpaWorld in the fourth quarter valued at approximately $4,926,000. Goldman Sachs Group Inc. boosted its holdings in OneSpaWorld by 13.2% in the fourth quarter. Goldman Sachs Group Inc. now owns 173,946 shares of the company's stock valued at $2,453,000 after purchasing an additional 20,270 shares in the last quarter. Price T Rowe Associates Inc. MD boosted its holdings in OneSpaWorld by 11.9% in the fourth quarter. Price T Rowe Associates Inc. MD now owns 20,998 shares of the company's stock valued at $297,000 after purchasing an additional 2,237 shares in the last quarter. Finally, Pier Capital LLC boosted its holdings in OneSpaWorld by 2.1% in the fourth quarter. Pier Capital LLC now owns 753,826 shares of the company's stock valued at $10,629,000 after purchasing an additional 15,592 shares in the last quarter. 99.64% of the stock is owned by institutional investors and hedge funds. OneSpaWorld Holdings Limited operates health and wellness centers onboard cruise ships and at destination resorts worldwide. Its health and wellness centers offer services, such as traditional body, salon, and skin care services and products; self-service fitness facilities, specialized fitness classes, and personal fitness training; pain management, detoxifying programs, and body composition analyses; weight management programs and products; and medi-spa services.Featured ArticlesFive stocks we like better than OneSpaWorldHow to Use the MarketBeat Stock Split CalculatorWalmart: Here’s Your Chance to Get in Cheaper in 2024What is the NASDAQ Stock Exchange?Insider Selling of Amazon Spikes in Q1, but it's Not Time to SellHow to Calculate Return on Investment (ROI)2 Deep Value, High Yield Stocks With a Double-Digit Upside  Before you consider OneSpaWorld, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and OneSpaWorld wasn't on the list. While OneSpaWorld currently has a \"Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}