{
    "title": "Pavan Davuluri named Windows and Surface Chief",
    "date": "3/27/2024",
    "url": "https://www.americanbazaaronline.com/2024/03/27/pavan-davuluri-named-windows-and-surface-chief-456364/",
    "text": "Microsoft has appointed Indian born Pavan Davuluri, an alumnus of the prestigious Indian Institute of Technology (IIT) Madras, as its new chief for Windows and Surface. According to technology news website The Verge, Microsoft underwent organizational restructuring following the surprise departure of former product lead Panos Panay to Amazon last year. This restructuring led to the separation of the Windows and Surface groups, with Davuluri assuming responsibility for Surface silicon and devices, while Mikhail Parakhin led a new team focused on Windows and web experiences. READ: Microsoft laying off 10,000 employees (January 19, 2023) Now both Windows and Surface will be Davuluri’s responsibility, as Parakhin has “decided to explore new roles.” Microsoft is now bringing together its Windows and devices teams once more, the Verge reported citing an internal memo from Rajesh Jha, Microsoft’s head of experiences and devices, outlining the new Windows organization. “This will enable us to take a holistic approach to building silicon, systems, experiences, and devices that span Windows client and cloud for this AI era,” explains Jha. Davuluri is now the leader of Microsoft’s Windows and Surface team, reporting directly to Rajesh Jha. Davuluri has worked at Microsoft for more than 23 years and was deeply involved in the company’s work with Qualcomm and AMD to create custom Surface processors. Davuluri has been instrumental in Microsoft’s initiatives to optimize Windows for Arm-based devices. In a recent post on X, he expressed pride in the team’s efforts, announcing the launch of the first-ever #Surface AI PCs designed exclusively for business: Surface Pro 10 for Business and Surface Laptop 6 for Business. He commended the team for their work in bringing these devices and experiences to fruition for customers. Jha says the Windows team will “work closely with the Microsoft AI team on AI, silicon, and experiences,” but there’s going to be some interesting areas of potential overlap that these new leaders are going to have to navigate. Microsoft AI now looks after Edge, a browser that’s a key part of the Windows experience. Davuluri, now joins the ranks of prominent Indian-origin leaders in major tech companies worldwide. Notable figures include Sundar Pichai, the CEO of Alphabet and Google, Satya Nadella,  CEO of Microsoft, Arvind Krishna, CEO of IBM, Nikesh Arora of Palo Alto Networks, Neal Mohan from YouTube, and Shantanu Narayen of Adobe. The Windows shake-up comes just days after Google DeepMind co-founder and former Inflection AI CEO Mustafa Suleyman joined Microsoft as the CEO of a new AI team. Microsoft also hired a bunch of Inflection AI employees, including co-founder Karén Simonyan who is now the chief scientist of Microsoft AI. As a result, most of Inflection’s staff is joining Microsoft AI in what is being seen as a talent acquisition that carefully avoids direct regulatory scrutiny. Suleyman is now the CEO of Microsoft AI, a new team that will handle the company’s consumer-facing AI products like Copilot, Bing, and Edge. Suleyman reports directly to Microsoft CEO Satya Nadella. Arun Kumar joined The American Bazaar after reporting on world affairs from four vantage points — New Delhi, Islamabad, Beijing and Washington — for Indian national media. Previously as North America Bureau Chief of the IANS news agency based in Washington DC, he told the American story for its subscribers spread around the world for 11 years.\nBefore that Arun worked as a foreign correspondent for PTI in Islamabad and Beijing for over eight years. On return to India, he worked as Chief News Editor, Editor of Special Services, and Assistant General Manager at PTI. Arun has penned five books for PTI providing an in-depth analysis of Indian elections from Nehru to Vajpayee besides compiling and editing PTI Offbeat, a coffee table book of offbeat pictures taken by PTI photographers.     Save my name, email, and website in this browser for the next time I comment. Please enter an answer in digits:9 − one =    Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Let's connect on any of these social networks! The American Bazaar is a publication of American Bazaar, Inc., based in Germantown, MD. Type above and press Enter to search. Press Esc to cancel. "
}