{
    "title": "Microsoft, OpenAI planning $100B data center to house AI supercomputer",
    "date": "3/29/2024",
    "url": "https://nypost.com/2024/03/29/business/microsoft-openai-planning-100b-data-center-to-house-ai-supercomputer/",
    "text": "Thanks for contacting us. We've received your submission. Microsoft and ChatGPT parent OpenAI are working on plans for a data-center project that could cost as much as $100 billion and  include an artificial intelligence supercomputer called “Stargate” set to launch in 2028, according to a report on Friday. The companies did not immediately respond to Reuters’ requests for comment. Rapid adoption of generative artificial intelligence technology has led to sky-rocketing demand for AI data centers capable of handling more advanced tasks than traditional data centers. The Information reported that Microsoft would likely be responsible for financing the project, which would be 100 times more costly than some of the biggest current data centers, citing people involved in private conversations about the proposal. The proposed US-based supercomputer would be the biggest in a series of installations the companies are looking to build over the next six years, the report added. The Information attributed the tentative cost of $100 billion to a person who spoke to OpenAI CEO Sam Altman about it and a person who has viewed some of Microsoft’s initial cost estimates. It did not identify those sources. Altman and Microsoft employees have spread supercomputers across five phases, with Stargate as the fifth phase. Microsoft is working on a smaller, fourth-phase supercomputer for OpenAI that it aims to launch around 2026, according to the report. Microsoft and OpenAI are in the middle of the third phase of the five-phase plan, with much of the cost of the next two phases involving procuring the AI chips that are needed, the report said. AI chips are often sold at high prices. Chip company Nvidia CEO Jensen Huang told CNBC earlier in March that the latest “Blackwell” B200 artificial intelligence chip will be priced between $30,000 and $40,000. Microsoft had also announced a duo of custom-designed computing chips in November last year. The report said the new project would be designed to work with chips from different suppliers. “We are always planning for the next generation of infrastructure innovations needed to continue pushing the frontier of AI capability,” Frank Shaw, a Microsoft spokesperson, said in a statement to the publication. The proposed efforts could cost in excess of $115 billion, more than three times what Microsoft spent last year on capital expenditures for servers, buildings and other equipment, the report stated. "
}