{
    "title": "Microsoft cuts 1,900 jobs in gaming division",
    "date": "1/25/2024",
    "url": "https://www.foxbusiness.com/lifestyle/microsoft-cuts-1900-in-gaming-division",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Piper Sandler managing director and SR economist Jake Oubina sits down with 'Mornings with Maria' to discuss the shift from focusing on inflation to unemployment and the risk of recession on the horizon. Microsoft announced it is cutting 1,900 roles within its gaming division, marking the latest round of job layoffs in the tech industry. Amazon, Google and Google's parent company, Alphabet, have already laid off employees this year, as have banking titan Citigroup and the Los Angeles Times. Microsoft's cuts will primarily impact roles in its Activision Blizzard team, according to an internal email obtained by The Verge. Some Xbox and ZeniMax employees will also be laid off. LAYOFFS SURGED 98% IN 2023; IT COULD GET WORSE THIS YEAR In total, the job cuts will impact 8% of the company's gaming division, which employs about 22,000 people, the outlet reported. Signage outside the Microsoft Campus in Redmond, Washington, on March 3, 2022. (Chona Kasinger/Bloomberg via Getty Images / Getty Images) In an email to staff, Microsoft Gaming CEO Phil Spencer told employees that \"the leadership of Microsoft Gaming and Activision Blizzard is committed to aligning on a strategy and an execution plan with a sustainable cost structure that will support the whole of our growing business.\" THE NUMBER OF HIGH-PAYING JOBS IS DWINDLING Spencer continued by saying that the company has \"set priorities, identified areas of overlap, and ensured that we’re all aligned on the best opportunities for growth.\" The news comes just three months after the company closed its $69 billion purchase of Activision Blizzard after months of battling regulatory hurdles. GET FOX BUSINESS ON THE GO BY CLICKING HERE In the deal, Microsoft acquired some of the most popular gaming franchises in history on console, PC and mobile platforms, including Pitfall, Call of Duty, World of Warcraft and Candy Crush. Microsoft did not respond to FOX Business' request for comment. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}