{
    "title": "Microsoft Teams went down around the world for over eight hours — it's \nbetter now",
    "date": "1/26/2024",
    "url": "https://www.theverge.com/2024/1/26/24051966/microsoft-teams-down-outage",
    "text": "By  Sean Hollister, a senior editor and founding member of The Verge who covers gadgets, games, and toys. He spent 15 years editing the likes of CNET, Gizmodo, and Engadget. Was it a joyous outage where you got to relax, or did something mission-critical go wrong? Either way, “a portion” of Microsoft Teams went down Friday for over eight hours — with outages in North America, South America, Europe, the Middle East, and Africa, according to status updates from Microsoft’s official account. At 8:17PM ET Friday, Microsoft tweeted that the worst is over, but that the company was still mopping up, with a handful of issues still ongoing. Shortly after midnight Saturday, the company called the all-clear: “we’ve confirmed that our Microsoft Teams service and features have been restored or have returned to optimal health,” it writes. So yeah, if you couldn’t communicate with your colleagues via Microsoft’s biz comm platform, that’s probably why. We’d seen reports of users not being able to log into Teams at all, while others saw missing messages, missing attachments, delays, and more. As of late Friday, Microsoft had already gotten to the point where you should’ve be able to log in, load messages, view media, and access call recordings — but that anonymous users might still have been unable to join meetings, seen delays, had trouble rejoining meetings or loading Copilot history, and that you probably shouldn’t reboot your computer if you need to log into Teams since that was an issue too. The spike in problem reports at DownDetector suggested this outage had been going on for at least three hours at the time we originally published our story, and Microsoft officially recognized the issue at around 11:45AM ET. The company said it identified “a networking issue impacting a portion of the Teams service,” and began failovers to resolve the problem. Four hours later, though, Microsoft reported that “Our failover operation did not provide immediate relief to all end users in North and South America regions.” While the DownDetector spike has subsided, it’s not clear whether that’s because services are substantially restored or because there’s no point complaining anymore. Here’s how far Microsoft got by the eight-hour mark: We’re continuing to apply mitigations across the affected infrastructure and our telemetry is showing additional improvement in the user experience, though many customers are still affected by this issue. We’re also working to apply fixes to address individual affected Teams features in parallel while our broader remediation strategy is ongoing. We’re evaluating any and all additional workstreams that will allow us to reduce the impact to those customers that are still affected. It took roughly 13 hours for Microsoft to completely address the issue. If you had access to a Microsoft Teams admin console, you were able to check the status at TM710344. For hours after the outage began, Microsoft’s status page was all green, suggesting Microsoft Teams was fine, but it updated with a lengthy description shortly before 2PM ET, including that “We’ve completed a failover in the Europe, Middle East, and Africa (EMEA) region and telemetry is showing improvement,” and that it planned to take similar steps in other regions. IT admins saw a similar message in their dashboards around 1PM ET, according to an r/sysadmin user: Here’s Microsoft’s final update on the outage: Title: Some users may experience multiple issues with their Microsoft Teams User impact: Users may have experienced multiple issues with their Microsoft Teams. More info: Affected scenarios included, but weren’t limited to the following: - Users logging in or unlocking their devices after some time may have had missing messages. - Users may have been unable to load messages in channels and chats. - Users were unable to view or download their media (images, videos, audio, call recordings, code snippets). - Some users were experiencing delays sending and receiving chat messages. - Anonymous users may have been unable to join meetings. - Teams connectors for Power Automate/Power Apps were experiencing errors. -Call Recordings might take longer to appear in user’s OneDrive for Business and SharePoint Online. - Users may have been unable to load previous Copilot history, or new history was not written - Bots may have been unable to download attachments - Sending and receiving read receipt notifications may have been delayed - Users may have experienced issues resuming or rejoining meetings. - Users within organizations leveraging an Information Barrier may have experienced issues joining meetings - Users performing a cold boot may have been unable to log into teams and would have seen an “oops” page Final status: After extended monitoring and various optimizations and mitigation efforts, we’ve confirmed that our Microsoft Teams service and features have been restored or returned to optimal health. Start time: Friday, January 26, 2024, at 2:55 PM UTC End time: Saturday, January 27, 2024, at 1:30 AM UTC This is the final update for the event. Microsoft Teams had a four-hour outage almost exactly a year ago. It had a pair of large outages in 2021, and ones in 2020 and in 2019, too, but this eight-hour-plus outage may take the cake — depending on how many people were affected, anyhow. Update, 8:00PM ET: Added that the outage is still ongoing, and Microsoft’s latest update. Update, 9:04PM ET: Added that the outage seems to be mostly over, but a number of specific issues remain. Update January 26th, 1:13AM ET: Story now reflects that the outage is over and includes Microsoft’s final updates. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}