{
    "title": null,
    "date": "1/5/2024",
    "url": "https://www.businesstoday.in/technology/news/story/keyboards-will-no-longer-be-the-same-microsoft-makes-first-big-change-after-30-years-411987-2024-01-05",
    "text": "Feedback Microsoft is introducing a new dedicated Copilot key for upcoming laptops and PC keyboards that are powered by Windows. It is ‘the first significant change to the Windows PC keyboard in nearly three decades’, wrote the company in its official blogpost. Just like Windows key opens the Start menu, Copilot key will quickly summon Copilot AI. Microsoft said, ‘Nearly 30 years ago, we introduced the Windows key to the PC keyboard that enabled people all over the world to interact with Windows.’  Windows 11 is taking a giant leap into the world of AI. The Copilot key is your gateway to a more intelligent PC. Learn more: https://t.co/OMQ6QVJln4 For the unversed, Copilot AI is an AI chatbot, like ChatGPT, that uses large language models (LLM) to support users in various tasks and decision-making processes. According to Microsoft, this key is the “entry point into the world of AI on the PC”. In the blogpost, Microsoft spokesperson said, “Nearly 30 years ago, we introduced the Windows key to the PC keyboard that enabled people all over the world to interact with Windows.” As per the official video shared Microsoft, this key will likely replace the right ‘Ctrl’ key on the keyboard which has been present since decades. Uses of Copilot Copilot can create images as per your description, polish drafts of emails or any other piece of content, help you research on topics of your choice and so on. Currently, you can summon Copilot by pressing Windows + C, given that your Windows is up-to-date and Copilot is enabled. The company reveals that the key will appear on the new Windows 11 PCs launching in Spring and in the upcoming Surface devices. Keyboard is not the only segment getting Copilot, the company has also integrated with Bing, Microsoft 365 and in Windows. Microsoft is also reportedly working on a Windows “refresh” that will focus on AI. Last year, Intel had hinted that the new version of Windows is in works that will launch in 2024. According to a report by The Verge, Windows “refresh” or Windows 12 will focus on AI. “As we start to develop future versions of Windows we’ll think about other places where AI should play a natural role in terms of the experience,” said Yusuf Mehdi, Microsoft’s head of consumer marketing told the publications. Also Read: This tech company fired its entire workforce in a ‘two-minute Google Meet call’ Dell unveils revamped XPS 13, 14 and 16 laptops ahead of CES 2024; see details Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}