{
    "title": "30 Best Investors to Follow on Twitter and Social Media",
    "date": "1/21/2024",
    "url": "https://finance.yahoo.com/news/30-best-investors-twitter-social-171430248.html",
    "text": "In this article, we will take a look at the 30 best investors to follow on Twitter and social media. If you want to skip our detailed analysis, you can go directly to 5 Best Investors to Follow on Twitter and Social Media. On December 31, 2023, Morgan Stanley reported that falling inflation levels are expected to be sluggishly above bank targets ahead of 2024. Such may lead to price dispersion and provide hedge fund alpha opportunities across asset classes. Throughout 2024, the Fed is expected to ease monetary policy which may eventually push wide discrepancies among winners and losers. While an easing cycle coupled with higher interest rates may increase volatility in bond prices, hedge funds may be able to benefit from higher interest rates, especially with derivative-based investing strategies. Morgan Stanley is bullish on diversified and alpha hedge fund portfolios in the current environment. The market is uncertain and the outlook for 2024 seems unclear, which may be a hint towards avoiding big and risky bets. Institutional investors are heavily positioned in Microsoft Corporation (NASDAQ:MSFT), NVIDIA Corporation (NASDAQ:NVDA), and Amazon.com, Inc. (NASDAQ:AMZN). Let's take a look at these stocks in detail. You can also take a look at some of the most promising stocks to buy according to hedge funds. Microsoft Corporation (NASDAQ:MSFT) was a part of 306 hedge fund portfolios at the close of the third quarter of 2023. The total stakes of these hedge funds amounted to $72.19 billion, up from $69.79 billion in the previous quarter with 300 positions. The hedge fund sentiment for the stock is positive. On November 28, 2023, Microsoft Corporation (NASDAQ:MSFT) declared a quarterly dividend of $0.75 per share. The dividend is payable on March 14 to shareholders of record on February 15. As of January 18, the stock has a forward dividend yield of 0.76% and a 5-year dividend growth rate of 10.16%. The company has been growing its dividends consistently for 19 years and has a payout ratio of 26.70%. Hedge funds are bullish on NVIDIA Corporation (NASDAQ:NVDA). The stock was a part of 180 hedge fund portfolios at the close of the third quarter of 2023. The total stakes of these hedge funds amounted to $29.58 billion, up from $25.97 billion in the previous quarter with 175 positions. NVIDIA Corporation (NASDAQ:NVDA) is also on analysts' radars. On January 18, Tigress Financial analyst Ivan Feinseth maintained a Buy rating on NVIDIA Corporation (NASDAQ:NVDA) and raised his price target from $560 to $790. Over the past 3 months, 32 Wall Street analysts have given a buy rating on NVIDIA Corporation (NASDAQ:NVDA). NVIDIA Corporation (NASDAQ:NVDA) has an average price target of $668.61 and a high forecast of $1,100. Amazon.com, Inc. (NASDAQ:AMZN) was a part of 286 hedge fund portfolios at the close of the third quarter of 2023. The total stakes of these hedge funds amounted to $38.90 billion, up from $34.90 billion in the previous quarter with 278 positions. The hedge fund sentiment for the stock is positive. As of December 31, 2023, Beech Hill Partners is the largest shareholder in Amazon.com, Inc. (NASDAQ:AMZN) and has a position worth $8.01 million. The stock covers 3.87% of the fund's portfolio. Now that we have discussed top picks among hedge funds, let's take a look at the 30 best investors to follow on Twitter and social media. You can also take a look at the stocks Warren Buffet and hedge funds love. 30 Best Investors to Follow on Twitter and Social Media Our Methodology We employed a thorough research process to come up with the 30 best investors to follow on Twitter and social media. To commence with our research we first established certain parameters to define a niche for our list. Therefore, our list consists of popular hedge fund managers that primarily own a Twitter account, and other social media channels if available. We first consulted four reports on the internet including Forbes, Benzinga, Investopedia, and Yahoo Finance. We then applied certain filters on LinkedIn using keywords such as \"hedge fund manager\" to ensure we did not miss any important names. Finally, we also looked up founding members and owners of popular hedge funds. This thorough process enabled us to come up with 55 hedge fund managers. We then conducted a manual search to find the Twitter account of every investor along with other social media such as LinkedIn and Instagram, if available. Moreover, we consulted Forbes to extract profiles and the net worth of each investor. It is to be noted that while we intended to include hedge fund managers with a significant social media presence, some of the most popular names in the hedge fund industry do not own Twitter accounts. For such investors, we have ranked them earlier in the list based on their social media presence on any other social media site such as Linkedin, Instagram, or YouTube. The list of the 30 best investors to follow on Twitter and social media is in ascending order of Twitter followers as of January 18, 2024. Followers on Twitter as of January 18, 2024: N/A Followers on LinkedIn as of January 18, 2024: 218 Ole Andreas Halvorsen, is a leading hedge fund manager based in Norway. The Norwegian hedge fund manager is the CEO and co-founder of Viking Global Investors. The firm manages $37 billion in assets. Andreas has a net worth of $5.9 billion, as of January 18. Some of his top picks include Amazon.com, Inc. (NASDAQ:AMZN), Workday, Inc. (NASDAQ:WDAY), and Visa Inc. (NYSE:V). Followers on Twitter as of January 18, 2024: N/A Followers on LinkedIn as of January 18, 2024: 303 Israel \"Izzy\" Englander, is a hedge fund manager and philanthropist based in the United States. Izzy has a net worth of $11.8 billion, as of January 18. He also founded Millennium Management in 1989, which manages $58 billion in assets. Some of his top picks include Amazon.com, Inc. (NASDAQ:AMZN), NVIDIA Corporation (NASDAQ:NVDA), and Microsoft Corporation (NASDAQ:MSFT) . Followers on Twitter as of January 18, 2024: N/A Followers on LinkedIn as of January 18, 2024: 704 David Alan Tepper is a billionaire hedge fund manager based in the United States. David Tepper has a net worth of $20.6 billion, as of January 18. He founded his hedge fund, Appaloosa Management in 1993. He is also particularly fond of football, which is why he bought the Carolina Panthers professional football team for $2.3 billion in 2018. Followers on Twitter as of January 18, 2024: N/A Followers on LinkedIn as of January 18, 2024: 738 David Elliot Shaw, commonly referred to as David E. Shaw, ranks as one of the best investors to follow on social media. The scientist and former hedge fund manager has a net worth of $8.3 billion, as of January 18. He founded D.E. Shaw, a quantitative hedge fund that manages over $95.7 billion in 13F securities, as of Q3 2023. Shaw is one of the pioneers of algorithmic trading strategies. Followers on Twitter as of January 18, 2024: N/A Followers on LinkedIn as of January 18, 2024: 12,071 With a net worth of $36.8 billion, as of January 18, Kenneth Cordele Griffin ranks as one of the best investors to follow on social media. Griffin runs Citadel LLC, a hedge fund that manages more than $466.5 billion in 13F securities, as of Q3 2023. Some of his top picks include NVIDIA Corporation (NASDAQ:NVDA), Boston Scientific Corporation (NYSE:BSX), and Microsoft Corporation (NASDAQ:MSFT). Followers on Twitter as of January 18, 2024: 27 Followers on LinkedIn as of January 18, 2024: 743 Christopher Hohn ranks as one of the best investors to follow on social media. According to Forbes, Hohn has a net worth of $6.7 billion, as of January 18. Hohn founded his hedge fund, The Children's Investment Fund, in 2003. Some of his top picks include General Electric Company (NYSE:GE), S&P Global Inc. (NYSE:SPGI), and Visa Inc. (NYSE:V). Followers on Twitter as of January 18, 2024: 992 Followers on LinkedIn as of January 18, 2024: 613 Louis Moore Bacon, the founder of Moore Capital Management, ranks as one of the best investors to follow on social media. Louis has a net worth of $1.5 billion, as of January 18. He is also known as Wall Street's macro trading legend. While he shut down his hedge fund in November 2019, Moore Capital still manages internal money. Some of his top picks include NVIDIA Corporation (NASDAQ:NVDA), Alphabet Inc. (NASDAQ:GOOG), and Meta Platforms Inc. (NASDAQ:META). Followers on Twitter as of January 18, 2024: 1760 Followers on LinkedIn as of January 18, 2024: N/A James Harris Simons, commonly referred to as Jim Simons, ranks as one of the best investors to follow on Twitter and social media. The mathematician has a net worth of $30.7 billion, as of January 18. He owns Renaissance Technologies, a quantitative hedge fund that manages over $58.6 million in 13F securities, as of Q3 2023. Followers on Twitter as of January 18, 2024: 7,118 Followers on LinkedIn as of January 18, 2024: 1,929 Stanley Druckenmiller, a former hedge manager and billionaire ranks among the best investors to follow on Twitter and social media. Stanley has a net worth of $6.2 billion, as of January 18, 2024. He served as a hedge fund manager for 30 years. He owned Duquesne Capital Management, a hedge fund that managed $12 billion in assets. Followers on Twitter as of January 18, 2024: 8,775 Followers on LinkedIn as of January 18, 2024: N/A Seth Klarman ranks as one of the best investors to follow on Twitter and social media. The billionaire, hedge fund manager, and author has a net worth of $1.3 billion, as of January 18. The investor runs and manages Baupost, a large hedge fund with almost $30 billion worth of assets under management. Some of Klarman's top picks include Liberty Live Group (NASDAQ:LLYVK), Alphabet Inc. (NASDAQ:GOOG), and Fidelity National Information Services, Inc. (NYSE:FIS). Followers on Twitter as of January 18, 2024: 21,000 Followers on LinkedIn as of January 18, 2024: N/A Stephen Frank Mandel Jr., also known as Stephen Mandel, is an American hedge fund manager, investor, and philanthropist. With a net worth of $2.5 billion, as of January 18, Stephen ranks as one of the best investors to follow on Twitter and social media. He founded Lone Pine Capital in 1997. He stepped down from managing investments in 2019, however, he still serves as the managing director. Followers on Twitter as of January 18, 2024: 32,200 Followers on LinkedIn as of January 18, 2024: N/A Mario Joseph Gabelli, commonly referred to as Mario Gabelli, has a net worth of $1.6 billion, as of January 18. Gabelli founded Gamco Investors, Gabelli Asset Management Company Investors, in 1977. Some of the top picks by Mario include Herc Holdings Inc. (NYSE:HRI), GATX Corporation (NYSE:GATX), and Mueller Industries, Inc. (NYSE:MLI). Followers on Twitter as of January 18, 2024: 36,900 Followers on LinkedIn as of January 18, 2024: 104 Philippe Laffont ranks among the best investors to follow on Twitter and social media, with a net worth of $6.1 billion, as of January 18. Laffont founded Coatue Management in 1999, a hedge fund and venture capital firm, with $40 billion in assets under management. The hedge fund focuses on technology investment. Some of the top picks by Laffont include Microsoft Corporation (NASDAQ:MSFT), Amazon.com, Inc. (NASDAQ:AMZN), Meta Platforms Inc. (NASDAQ:META), and NVIDIA Corporation (NASDAQ:NVDA). Followers on Twitter as of January 18, 2024: 58,100 Followers on LinkedIn as of January 18, 2024: 909 Paul Tudor Jones II is a hedge fund manager and philanthropist based in the United States. Paul has a net worth of $8.1 billion, as of January 18. Paul is particularly popular for his macro trades, and his bets on interest rates and currencies. He founded Tudor Investment Corporation in 1980, which manages almost $13 billion in assets. One of the top picks by Jones is Splunk Inc. (NASDAQ:SPLK). Followers on Twitter as of January 18, 2024: 75,700 Followers on LinkedIn as of January 18, 2024: N/A John Douglas Arnold, also known as John Arnold, is among the best investors to follow on Twitter and social media. Arnold has a net worth of $3.3 billion, as of January 18. The philanthropist built his hedge fund, Centaurus Advisors. As of now, Arnold and his wife, Laura, run Arnold Ventures LLC, a company aimed at providing criminal justice, education, health care, and public finance services. Followers on Twitter as of January 18, 2024: 76,100 Followers on LinkedIn as of January 18, 2024: 403 David Einhorn ranks as one of the best investors to follow on Twitter and social media. Einhorn is an American investor and hedge fund manager. He owns Greenlight Capital, a long-short value-oriented hedge fund. He is one of the most prominent long/short equity hedge fund managers. Some of his top picks include Green Brick Partners, Inc. (NYSE:GRBK), CONSOL Energy Inc. (NYSE:CEIX), and Brighthouse Financial, Inc. (NASDAQ:BHF). Followers on Twitter as of January 18, 2024: 80,300 Followers on LinkedIn as of January 18, 2024: 6,885 John Hempton is a famous investor in Australia. The investor owns Bronte Capital Management, a leading asset management company. Some of his top picks include Alphabet Inc. (NASDAQ:GOOG), Berkshire Hathaway Inc. (NYSE:BRK-A), Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN), and Interactive Brokers Group, Inc. (NASDAQ:IBKR). Followers on Twitter as of January 18, 2024: 120,300 Followers on LinkedIn as of January 18, 2024: 1,533 With a net worth of $3.3 billion, Daniel Loeb ranks as one of the best investors to follow on Twitter and social media. Loeb founded Third Point in 1995. The hedge fund manages $12 billion in assets. Loeb is known as the pioneer of activist investing. Some of the billionaire's top picks include Microsoft Corporation (NASDAQ:MSFT), PG&E Corporation (NYSE:PCG), and Danaher Corporation (NYSE:DHR). Followers on Twitter as of January 18, 2024: 125,700 Followers on LinkedIn as of January 18, 2024: 1,929 Clifford Scott Asness, also known as Cliff Asness, is an investor and hedge fund manager based in New York, United States. Asness is the founder of AQR Capital Management which manages over $100 billion in assets. Asness has a net worth of $1.6 billion, as of January 18. Top picks of his hedge fund include Apple Inc. (NASDAQ:AAPL), Walmart Inc. (NYSE:WMT), Amazon.com, Inc. (NASDAQ:AMZN), and Meta Platforms, Inc. (NASDAQ:META). Followers on Twitter as of January 18, 2024: 154,600 Followers on LinkedIn as of January 18, 2024: 77,458 Howard Marks, co-founder and co-chairman of the famous Oaktree Capital Management, ranks as one of the best investors to follow on Twitter and social media. Howard Marks has a net worth of $2.2 billion, as of January 18. Some of his top picks include TORM plc (NASDAQ:TRMD), Chesapeake Energy Corporation (NASDAQ:CHK), and Garrett Motion Inc. (NASDAQ:GTX). Followers on Twitter as of January 18, 2024: 262,100 Followers on LinkedIn as of January 18, 2024: N/A Michael James Burry, commonly referred to as Michael Burry, is an investor and hedge fund manager based in California, United States. He founded the hedge fund, Scion Capital, and managed it until 2008, after which he sold his stake. He then founded Scion Asset Management, LLC in 2013. Burry's top picks include Nexstar Media Group, Inc. (NASDAQ:NXST), Stellantis N.V. (NYSE:STLA), and Euronav NV (NYSE:EURN). Followers on Twitter as of January 18, 2024: 263,200 Followers on LinkedIn as of January 18, 2024: 9,549 Thomas Steyer, also known as Tom Steyer, has a net worth of $2.1 billion, as of January 18. The billionaire managed his hedge fund, Farallon Capital, for 26 years, before he sold his stake in 2012. Tom Steyer is particularly interested in propagating clean energy initiatives. He also founded several climate change initiatives including NextGen America and Galvanize Climate Solutions LLC. Tom also has 92,900 followers on his official Instagram account, where he advocates for climate change solutions. Followers on Twitter as of January 18, 2024: 286,900 Followers on LinkedIn as of January 18, 2024: N/A Steven A. Cohen, also known as Steve Cohen, is a popular hedge fund manager based in New York, United States. The American billionaire has a net worth of $19.8 billion, as of January 18. The hedge fund manager founded Point72 Asset Management, a hedge fund managing over $32 billion in 13F securities, as of Q3 2023. His top picks include Microsoft Corporation (NASDAQ:MSFT), Amazon.com, Inc. (NASDAQ:AMZN), and NVIDIA Corporation (NASDAQ:NVDA). Followers on Twitter as of January 18, 2024: 401,700 Followers on LinkedIn as of January 18, 2024: N/A George Soros, born in Hungary, is a prominent hedge fund manager and billionaire. With a net worth of $6.7 billion, as of January 18, Soros is widely acclaimed as a hedge fund tycoon. Soros founded Soros Fund Management LLC in 1970. His fund's top picks include Alphabet Inc. (NASDAQ:GOOG), Novo Nordisk A/S (NYSE:NVO), and Liberty Broadband Corporation (NASDAQ:LBRDK). Soros has 87,300 followers on his official Instagram account, as of January 18. Followers on Twitter as of January 18, 2024: 439,900 Followers on LinkedIn as of January 18, 2024: 11,295 Kenneth Fisher, also known as Ken Fisher, is a prominent investor and author based in California, United States. Fisher is the founder and chairman of Fisher Investments. The firm has over $197 billion in assets under management. According to Forbes, Fisher has a net worth of $7.9 billion, as of January 18. Ken Fisher has 8,000 followers on his official Instagram account where he shares his insights on the financial market regularly. His top stock picks include Apple Inc. (NASDAQ:AAPL), Microsoft Corporation (NASDAQ:MSFT), and Alphabet Inc. (NASDAQ:GOOG). Click here to continue reading and see 5 Best Investors to Follow on Twitter and Social Media. Suggested articles: 13 Most Promising Future Stocks To Buy According To Hedge Funds 11 Recent Spin-off Companies That Hedge Funds Are Piling Into Warren Buffett and Hedge Funds Love These 11 Stocks Disclosure: None. 30 Best Investors to Follow on Twitter and Social Media is originally published on Insider Monkey. Related Quotes "
}