{
    "title": "How To Earn $500 A Month From Microsoft Stock Ahead Of Q2 Earnings Report - \nMicrosoft (NASDAQ:MSFT)",
    "date": "1/18/2024",
    "url": "https://www.benzinga.com/news/earnings/24/01/36672981/how-to-earn-500-a-month-from-microsoft-stock-ahead-of-q2-earnings-report",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Microsoft Corporation  MSFT shares closed slightly lower during Wednesday’s session. Microsoft’s Activision issued a warning to \"Call of Duty\" players, stating that its anti-cheat technology, Ricochet, will now automatically close the game if it detects aim assist being used with a mouse and keyboard. The company is also set to expand its consumer base with the introduction of a new $20 per month AI subscription service aimed at individual consumers and small businesses. Microsoft is expected to release earnings results for its second quarter after the closing bell on Jan. 30, 2024. With the recent buzz around Microsoft, some investors may be eyeing potential gains from the company’s dividends. As of now, Microsoft offers an annual dividend yield of 0.77%, which is a quarterly dividend amount of 75 cents per share ($3.00 a year). So, how can investors exploit its dividend yield to pocket a regular $500 monthly? To earn $500 per month or $6,000 annually from dividends alone, you would need an investment of approximately $778,940 or around 2,000 shares. For a more modest $100 per month or $1,200 per year, you would need $155,788 or around 400 shares. Read This:  Top 4 Tech And Telecom Stocks That May Crash In January To calculate:  Divide the desired annual income ($6,000 or $1,200) by the dividend ($3.00 in this case). So, $6,000 / $3.00 = 2,000 ($500 per month), and $1,200 / $3.00 = 400 shares ($100 per month). Note that dividend yield can change on a rolling basis, as the dividend payment and the stock price both fluctuate over time. How that works:  The dividend yield is computed by dividing the annual dividend payment by the stock's current price. For example, if a stock pays an annual dividend of $2 and is currently priced at $50, the dividend yield would be 4% ($2/$50). However, if the stock price increases to $60, the dividend yield drops to 3.33% ($2/$60). Conversely, if the stock price falls to $40, the dividend yield rises to 5% ($2/$40). Similarly, changes in the dividend payment can impact the yield. If a company increases its dividend, the yield will also increase, provided the stock price stays the same. Conversely, if the dividend payment decreases, so will the yield. MSFT Price Action: Shares of Microsoft fell 0.2% to close at $389.47 on Wednesday. Read More: Real estate crowdfunders are cropping up quickly, but one Jeff Bezos-backed platform is pulling ahead.  Read the full story to discover how you can invest in its offerings with just $100. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}