{
    "title": "Microsoft-backed OpenAI Valued at Over $80 Billion in Latest Deal",
    "date": "2/18/2024",
    "url": "https://www.pymnts.com/cpi_posts/microsoft-backed-openai-valued-at-over-80-billion-in-latest-deal/",
    "text": " Microsoft-backed OpenAI has finalized a deal that places its value at a staggering $80 billion or more. According to a report by The New York Times on Friday, sources familiar with the transaction revealed the details. The deal involves the sale of existing shares through a tender offer spearheaded by venture firm Thrive Capital. This arrangement enables employees to liquidate their shares in the company, deviating from the conventional route of fundraising to inject capital into the business, as per the report. OpenAI, known for its cutting-edge advancements in artificial intelligence, did not immediately respond to requests for comment from Reuters. Read more: UK Competition Watchdog Investigates Microsoft-OpenAI Partnership This recent deal echoes a similar agreement struck early last year. Venture-capital heavyweights Thrive Capital, Sequoia Capital, Andreessen Horowitz, and K2 Global came together to purchase OpenAI shares in a tender offer, placing the company’s valuation at approximately $29 billion, according to the report. The emergence of OpenAI’s ChatGPT in late 2022 has spurred significant excitement and interest in the field of AI, prompting companies across industries to explore innovative ways to leverage the technology’s capabilities. This latest valuation reflects the growing recognition of AI’s potential to revolutionize various sectors, from healthcare to finance, and beyond. With OpenAI at the forefront of AI research and development, backed by the support of industry giants like Microsoft, the company’s trajectory continues to capture the attention of investors and industry observers alike. As AI continues to evolve and permeate further into our daily lives, deals of this magnitude underscore the immense value placed on companies at the forefront of this technological revolution. Source: Reuters FTC Urged to Enforce Rarely Used Antitrust Law Against Retail Giants\nMar 28, 2024 by\n                    CPI UK’s Fingleton Bolsters Team with New Additions\nMar 28, 2024 by\n                    CPI Britain’s Competition Regulator Clears Aviva’s Acquisition of AIG Life UK\nMar 28, 2024 by\n                    CPI White House Implements New AI Safeguards to Protect Rights and Safety\nMar 28, 2024 by\n                    CPI Denver Court Sets August Date for Kroger-Albertsons Merger Showdown\nMar 28, 2024 by\n                    CPI Antitrust Chronicle® – Real Estate & Antitrust\nMar 27, 2024 by\n                    CPI Systematic National Evidence of Steering by Real Estate Agents\nMar 27, 2024 by\n                    CPI Compliance Now! Actionable Antitrust Advice for the Residential Real Estate Industry\nMar 27, 2024 by\n                    CPI Real Estate Commissions:  Some Insights from the Economics of Multi-Sided Platforms\nMar 27, 2024 by\n                    CPI New Ideas for Promoting Real Estate Brokerage Price Competition\nMar 27, 2024 by\n                    CPI "
}