{
    "title": "Microsoft Adds Expedite Readiness Report to Windows Update for Business",
    "date": "2/1/2024",
    "url": "https://petri.com/wufb-deployment-service-expedite-readiness/",
    "text": "Security for your customers, revenue for your MSP practice. Access key insights on how to scale your practice with SkyKick’s new eGuide. Based on input from our top-performing MSPs, SkyKick prepared the MSP Guide to help you navigate the security landscape. In this episode, Stephen Rose and Darrell Webster discuss the differences between Teams Premium and Copilot in Teams. The survey surfaces some surprising information about the state of Active Directory disaster recovery preparedness today. Microsoft has released a new device readiness test feature for its Windows Update for Business deployment service. This release allows organizations to evaluate their devices’ eligibility for Windows quality updates before the actual deployment process. The Windows Update for Business deployment service allows administrators to approve, schedule, and monitor updates delivered to managed devices through Windows Updates. The cloud-based service works seamlessly with existing Windows Update for Business reports and policies. It helps to ensure that problematic updates are not delivered to devices that could lead to downtime and productivity loss. Microsoft added a new expedite capability to Windows Update for Business in December 2022. This feature enables organizations to speed up the delivery of monthly patches that are considered critical. For example, IT administrators can prioritize the patching of security vulnerabilities that are deemed a high priority for their organization. The expedited updates capability only applies to Windows 11 and Windows 10 security patches. However, commercial customers will require an E3 or E5 license to use the expedited quality updates feature in Microsoft Intune. Previously, the Windows Update for Business deployment service only allowed administrators to receive post-deployment report summaries for devices that could not be expedited. However, the new feature now provides additional information on whether a Windows device can install a patch without deploying it first. It should help customers respond quickly to potential security threats or vulnerabilities. “Unlike the actual deployment, the new device readiness test doesn’t deliver content to the devices. Instead, it scans each device and generates alerts if any prerequisites are missing. Once you resolve these alerts successfully, you’ll have confidence that the deployment process will be smooth, with minimal disruptions,” Microsoft explained. Microsoft notes that the new device readiness test feature is available through Microsoft Graph. This feature is designed to assist administrators in identifying Windows devices that qualify for expedited updates. Administrators can review the alerts to detect ineligible devices, and the report also provides remediation steps that should help resolve any issues. Rabia comes from a solid IT background and has been writing professionally about Microsoft products and other technology for four years. Rabia has also written for OnMSFT.com as well as Windows Report. She is always up to date on the latest trends in... Create a free account today to participate in forum conversations, comment on posts and more. Our sponsor help us keep our knowledge base free. Active Directory is an essential part of Windows Server. It allows IT pros to manage computer resources on the network. In this guide, we’ll show you how to install Active Directory Users and Computers and the basics of working with it so you can manage Active Directory. Active Directory Users and Computers (ADUC) is built... Last Update: Jun 15, 2023 Windows PCs may sometimes encounter issues during startup, and that can happen when Windows fails to load properly. In this post, we’ll explain how you can use Windows Boot Manager to troubleshoot boot errors and get your PC up and running again. What is Windows Boot Manager? Windows Boot Manager (Bootmgr.exe) is Microsoft’s proprietary Unified Extensible Firmware... Last Update: Mar 13, 2024 In this article, we will review PowerShell For loops, While loops, Do-While loops, and Do-Until loops. I’ll explain how PowerShell loops are constructed and how to define conditions to enter or exit a loop. PowerShell For loop The For loop is а counting loop, and it’s mostly used when you need to repeat a task... Last Update: Mar 13, 2024 Cayosoft delivers the only unified solution enabling organizations to securely manage, continuously monitor for threats or suspect changes, and instantly recover their Microsoft platforms. Monitor, manage, and secure your IT infrastructure with enterprise-grade solutions built from the ground up. Create a free account today to participate in forum conversations, comment on posts and more. "
}