{
    "title": "Microsoft's 'vision for the future of Xbox' to be unveiled next week",
    "date": "2/6/2024",
    "url": "https://www.techradar.com/gaming/xbox/microsofts-vision-for-the-future-of-xbox-to-be-unveiled-next-week",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. \"We're listening and we hear you\" The CEO of Microsoft Gaming, Phil Spencer, has confirmed that Microsoft will share its “vision for the future of Xbox” in a business update event next week. This follows weeks of rumors of the company reportedly considering a multi-platform approach for certain Xbox-exclusive games. In a post on Twitter / X yesterday (February 5), Spencer wrote: “We're listening and we hear you. We've been planning a business update event for next week, where we look forward to sharing more details with you about our vision for the future of Xbox. Stay tuned.” We're listening and we hear you. We've been planning a business update event for next week, where we look forward to sharing more details with you about our vision for the future of Xbox. Stay tuned.February 5, 2024 Just in case you missed it, it’s been claimed (but not officially confirmed) that Microsoft is considering releasing certain Xbox-exclusive games like Hi-Fi Rush, Sea of Thieves, Starfield, and even the upcoming Indiana Jones and the Great Circle on PlayStation. XboxEra has alleged that, according to its sources, Starfield is planned to release on PlayStation 5 at some point after its Shattered Space DLC releases. Meanwhile, The Verge cited an anonymous source which reportedly claimed that the Indiana Jones game may have a relatively short exclusivity period on Xbox Series X|S and PC, and potentially arrive on PS5 several months after its initial launch. Again, none of these rumors have been officially verified by Xbox or Microsoft at the time of writing - we’ll just have to see what’s revealed during next week’s business update event. The company has not yet confirmed what date or time this event will occur. It’s safe to say that 2024 has been rather busy for Xbox so far. Less than three weeks ago, the company hosted its first Developer_Direct event of the year, unveiling the first in-game footage for Indiana Jones and the Great Circle, along with deeper looks at other upcoming games like Avowed and Visions of Mana. Looking for some excellent games to dive into right now? You can find some top-class recommendations on our lists of the best Xbox Series X games and best PC games. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. Catherine is a News Writer for TechRadar Gaming. Armed with a journalism degree from The University of Sheffield, she was sucked into the games media industry after spending far too much time on her university newspaper writing about Pokémon and cool indie games, and realising that was a very cool job, actually. She previously spent 19 months working at GAMINGbible as a full-time journalist. She loves all things Nintendo, and will never stop talking about Xenoblade Chronicles. Xbox will 'respect the investments that people have made' and encourage backward compatibility in the future Xbox is already focused on ‘delivering the largest technical leap you will have ever seen in a hardware generation’ Philips Hue lights to work way better with Samsung TVs and SmartThings, for a price By Demi WilliamsMarch 27, 2024 By Sead FadilpašićMarch 27, 2024 By Hamish HectorMarch 27, 2024 By Darren AllanMarch 27, 2024 By Sead FadilpašićMarch 27, 2024 By Demi WilliamsMarch 27, 2024 By Chiara CastroMarch 27, 2024 By Mackenzie FrazierMarch 27, 2024 By Dashiell WoodMarch 27, 2024 By Andy HilliardMarch 27, 2024 By Kristina TerechMarch 27, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}