{
    "title": "Microsoft hits the highest market cap of any company to date at over $3 \ntrillion",
    "date": "2/12/2024",
    "url": "https://mspoweruser.com/microsoft-hits-the-highest-market-cap-of-any-company-to-date-at-over-3-trillion/",
    "text": "Follow us Share this article Improve this guide The record was previously set by Apple. 1 min. read Published on February 12, 2024 published on \n\nFebruary 12, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft has had quite a busy past few months. Now, the Redmond tech giant has officially scored the highest market capitalization of any company — at least until the time of this writing. Satya Nadella’s time took another triumphant week as it reached $3.125 trillion in market cap, according to recent data. The record was previously set by Apple, which reached $3.09 trillion last summer. On the other hand, the iPhone makers ended Friday with $2.916 trillion in market cap. The AI hype train has somewhat cemented Microsoft’s name as the leading company in its development, resulting in a few impressive numbers over the past few months. “By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector,” Nadella said back then. As revealed in the recent financial reports for the second quarter (Q2) of the fiscal year 2024, Microsoft’s total revenue increased by 18% to $62 billion. The major growth was influenced mostly by Redmond’s role in developing AI in Windows 11, like its Copilot assistant tool, as well as the successful, big-money Activision acquisition for its gaming department. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}