{
    "title": "2 Artificial Intelligence (AI) Stocks That Could Help Set You Up for Life",
    "date": "2/21/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT/pressreleases/24233681/2-artificial-intelligence-ai-stocks-that-could-help-set-you-up-for-life/",
    "text": "A boom in artificial intelligence (AI) kicked off last year and has shown no signs of slowing. The nearly $200 billion industry is projected to expand at a compound annual growth rate of 37% until at least 2030. That trajectory would see the market hit close to $2 trillion before the end of the decade. AI can potentially boost countless industries, from healthcare to consumer tech, education, e-commerce, cloud computing, autonomous vehicles, and much more. With growth catalysts across multiple sectors, it could be one of the smartest moves to dedicate a portion of your portfolio to AI and profit from its long-term development. As the world's first- and fourth-most valuable companies, Microsoft(NASDAQ: MSFT) and Nvidia(NASDAQ: NVDA) are two attractive options. These companies are heavily investing in AI and have secured powerful roles in the market, with one leading the software side of AI and the other dominating hardware.  Data by YCharts Microsoft and Nvidia stocks have already made more than a few millionaires, with their shares skyrocketing over the last decade (as seen in the chart above). While past growth doesn't always indicate what's to come, I wouldn't bet against these tech firms delivering significant gains thanks to AI long into the future. So, here are two AI stocks that could set you up for life. Nvidia has become a Wall Street darling since the start of last year after snapping up an estimated 80% to 95% market share in AI graphics processing units (GPUs), the chips necessary for training and running AI models. Increased interest in AI has led to a spike in demand for GPUs. Meanwhile, Nvidia's years of dominance in the GPU market allowed it to get a head start in the segment while rivals like Advaned Micro Devices and Intel scrambled to catch up. These chipmakers have since unveiled competing AI GPUs, but will likely have difficulties overcoming Nvidia's lead.  Data by YCharts Over the last year, Nvidia's quarterly revenue, operating income, and free cash flow have hit new heights as each has delivered triple-digit growth thanks to soaring chip sales. In fact, Nvidia's free cash flow hit more than $17 billion in 2023, significantly higher than AMD's just over $1 billion and Intel's negative $14 billion. Nvidia's running start in AI has given it the financial resources to continue investing in its business and retain its lead in AI. The uses for artificial intelligence are rapidly expanding, suggesting GPU demand will continue rising for the foreseeable future. Nvidia has an exciting long-term outlook as it continues developing in AI and supplies its chips to other areas of tech, such as video game consoles, PCs, and cloud platforms. Its price/earnings-to-growth ratio has dropped 85% in the last six months to an attractive 0.4, indicating it could be trading at a bargain compared to its growth potential. Nvidia is a screaming buy for anyone looking to invest in AI and could deliver major gains for years. In January, Microsoft surpassed Apple as the world's most valuable company, with its market cap currently at just over $3 trillion. The company is a tech behemoth with positions in multiple areas of the industry, leading in productivity software, game consoles, cloud computing, and operating systems. Meanwhile, heavy investment in ChatGPT developer OpenAI has led to a lucrative partnership and access to some of the most advanced AI models in the industry. The Windows company has used OpenAI's technology to introduce AI features across its product lineup. In 2023, Microsoft added new AI tools to its Azure cloud platform, integrated aspects of ChatGPT into its Bing search engine, and boosted productivity in its Office software suite with the help of AI. Moreover, the company is taking early steps to monetize its new offerings, launching an AI assistant called Copilot through its Microsoft 365 subscription service. The company describes the assistant as \"your everyday AI companion.\" Some of its generative capabilities include creating a first draft in Word, generating a full PowerPoint presentation based on a simple prompt, and producing data visualizations in seconds in Excel. Copilot has debuted as a $30 monthly add-on to a 365 membership, which could lead to significant earnings boosts for Microsoft. The tech giant achieved more than $67 billion in free cash flow last year, highlighting the reliability of its business and its value as a long-term investment. The company's stock is slightly overvalued, with its forward price-to-earnings ratio at about 35. However, its long history of growth, dominant role in tech, and expanding venture into AI means it is likely worth its high valuation. The company is profiting from tailwinds across tech and has excellent prospects in AI, suggesting a long-term investment in Microsoft's stock could set you up for life. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 20, 2024  Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short February 2024 $47 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}