{
    "title": "The future of Xbox: all the news on Microsoft's strategy shift",
    "date": "2/16/2024",
    "url": "https://www.theverge.com/24073286/xbox-console-exclusivity-hardware-update-game-pass",
    "text": "Filed under: By  Andrew Webster, an entertainment editor covering streaming, virtual worlds, and every single Pokémon video game. Andrew joined The Verge in 2012, writing over 4,000 stories. On February 15th Microsoft released a particularly interesting episode of the official Xbox podcast in which it outlined the beginning of a slightly new direction for the company. The episode featured Microsoft Gaming CEO Phil Spencer, head of Xbox game studios Matt Booty, and Xbox president Sarah Bond, who discussed everything from Xbox exclusives coming to the PS5 and Nintendo Switch, the latest Game Pass subscriber numbers, and even (vague) future plans for its next-gen console. We also had the chance to speak to Spencer about what it all means — and you can catch up with every bit of news right here. Feb 16 Tom Warren Microsoft announced yesterday that four Xbox-exclusive games are coming to PS5 and Nintendo Switch soon, opening up a new strategy for Xbox to be on more screens. Just two hours before Microsoft’s big announcement, Microsoft Gaming CEO Phil Spencer explained the company’s new Xbox vision in an internal memo to employees. The Verge has obtained a copy of the memo. It’s the first time Spencer has fully outlined a new strategy “where every screen is an Xbox” to employees, after an internal town hall meeting earlier this month didn’t address multi-platform games directly. Feb 15 Emma Roth At one point, Xbox wanted to get its cloud gaming service on the App Store — but now that Apple will actually allow it, the gaming giant isn’t biting. Here’s Xbox boss Phil Spencer: There’s not room for us to monetize Xbox Cloud Gaming on iOS. I think the proposal that Apple put forward... doesn’t go far enough to open up. In fact, you might even say they go the opposite direction in some way, but they definitely don’t go far enough to open up competition on the world’s largest gaming platform. Feb 15 Sean Hollister Gaming CEO Phil Spencer: One of the weak points in the experience on a ROG or the Lenovo [Legion Go] is Windows. How Windows works on controller input only on that kind of DPI, on a smaller eight- or seven-inch screen. That’s a real design point that our platform team is working with Windows to make sure that the experience is even better. Does that mean handheld mode isn’t just a hackathon project anymore? There was that Xbox app compact mode... Feb 15 Andrew Webster Taken on their own, today’s gaming announcements from Microsoft might not seem all that earth-shattering. A handful of unspecified Xbox games are coming to rival platforms, the subscriber numbers for Game Pass have grown, Diablo IV will lead the rush of Activision Blizzard titles on Game Pass, and more hardware is on the way, including a powerful next-gen console and possibly a handheld. But they all point to a future that Microsoft hasn’t exactly been shy about: making Xbox into more than just a console. In an internal memo to employees, Microsoft Gaming CEO Phil Spencer explained the strategy like this: Feb 15 Andrew Webster You can read all of the news right here, but if you want to check out the podcast where Xbox leadership discussed everything from platform exclusives to the state of Game Pass to some vague talk of new hardware, the whole thing is embedded below. Feb 15 Tom Warren Microsoft has been gradually moving Xbox away from the idea of a single piece of hardware in recent years, with ambitions to reach billions of gamers across consoles, PCs, and mobile devices. Now it’s officially bringing four Xbox-exclusive games to PS5 and Nintendo Switch amid an “Xbox Everywhere” effort inside Microsoft that will likely see even more games arriving on rival consoles. It’s a seismic strategy shift that the company is downplaying publicly, so I sat down with Microsoft Gaming CEO Phil Spencer to get some answers and discuss the company’s vision for the future of Xbox. Feb 15 Tom Warren Microsoft’s Xbox Game Pass service now has 34 million subscribers. That’s up 36 percent from the 25 million Microsoft previously reported more than two years ago. Microsoft revealed the new 34 million figure in an official Xbox podcast today, as part of an announcement that some Xbox exclusives are coming to the PS5 and Nintendo Switch. It’s the first time Microsoft has disclosed fresh Xbox Game Pass subscriber numbers since announcing its Activision Blizzard acquisition in January 2022. Feb 15 Tom Warren It’s official: Microsoft is bringing some Xbox-exclusive games to PS5 and Nintendo Switch. It’s part of a broader strategy shift inside Microsoft’s gaming business to grow games beyond just the company’s Xbox consoles. “We’ve made the decision that we’re going to take four games to the other consoles,” reveals Microsoft Gaming CEO Phil Spencer on the official Xbox podcast. Bizarrely, Microsoft is refusing to name the four titles, but the company says that two are community-driven games and the other two are smaller titles. Feb 15 Ash Parrish Diablo IV will be the first Activision Blizzard game coming to Xbox Game Pass, launching on the service on March 28th. Once Microsoft completed its billion-dollar acquisition of Activision Blizzard, fans speculated that its games would arrive immediately on the subscription service. Microsoft Gaming CEO Phil Spencer said in October of last year, right when the deal closed, that fans would have to wait until 2024 before games like Call of Duty would start showing up on the service. That time is now, but instead of Call of Duty, we’re getting Diablo IV. Feb 15 Tom Warren Microsoft is teasing the potential for unique Xbox hardware in the future and a powerful next-gen console. Four previously exclusive Xbox games are officially coming to the PS5 and Nintendo Switch soon, and Microsoft wants to reassure Xbox fans that it’s still very much invested in the future of its platform and hardware. In an official Xbox podcast today, Xbox president Sarah Bond teased that Microsoft will deliver “the largest technical leap” with the next-generation Xbox: Feb 15 Andrew Webster Later today Microsoft will be sharing “updates on the Xbox business” in an episode of the Xbox podcast that will feature Microsoft Gaming CEO Phil Spencer, head of Xbox game studios Matt Booty, and Xbox president Sarah Bond. If rumors are to be believed, we’ll be hearing about multiplatform games and possibly even new hardware. It’ll be available at 3PM ET and you can check it out on the Xbox YouTube channel — and, of course, stay tuned to The Verge for all the news. Feb 14 Sean Hollister The Nintendo Switch is on track to become the bestselling game console of all time. Sony’s PS5 will likely surpass the Xbox One’s entire lifetime sales later this year. Meanwhile, Microsoft’s newer Xbox Series X and S, with their comparatively disappointing exclusive games, are firmly in third place yet again — and it doesn’t look like Xbox Game Pass will ever fill the gap. Microsoft isn’t planning to take this lying down. It’s among the largest video game companies in the world now that it owns Activision Blizzard, and it’s going to act. This Thursday, we expect the company to reveal a seismic shift in strategy, one where it could bring Xbox exclusives like Hi-Fi Rush, Starfield, even Indiana Jones to PlayStation and / or Switch. Feb 12 Tom Warren Microsoft’s Xbox business needs to get bigger. The company’s Xbox Series S and X sales still lag behind Sony’s PlayStation 5, and Microsoft Gaming CEO Phil Spencer has previously admitted its Xbox Game Pass subscriptions were slowing down, too. He admitted that in 2022, a dry year for Xbox games after Microsoft’s big exclusive Bethesda game Starfield was delayed. An Xbox Game Pass slowdown might be why I’m hearing that a number of Xbox exclusives are coming to consoles with which Microsoft usually competes. Sources familiar with Microsoft’s plans tell The Verge that the company is getting ready to launch a select number of Xbox games on PS5 and Nintendo Switch. Weeks of rumors suggest that Hi-Fi Rush, Sea of Thieves, and even Bethesda titles like Starfield and Indiana Jones could appear on non-Xbox platforms. Feb 12 Tom Warren After weeks of rumors of Xbox exclusives coming to PS5 and Nintendo Switch, Microsoft is now planning to discuss its vision for the future of Xbox at an event later this week. Microsoft’s Xbox business update event will take place on Thursday, February 15th at 12PM PT / 3PM ET. Weeks of rumors suggest that Hi-Fi Rush, Sea of Thieves, and even Bethesda titles like Starfield and Indiana Jones could appear on non-Xbox platforms. Microsoft hasn’t addressed these rumors directly, but Microsoft Gaming CEO Phil Spencer didn’t dismiss them last week. “We’re listening and we hear you,” said Spencer, before announcing the Xbox business update event. Feb 5 Tom Warren Microsoft is planning to share details about its plans to bring Hi-Fi Rush and other Xbox exclusives to PS5 and Nintendo Switch consoles, according to sources familiar with Microsoft’s plans. Details of Microsoft’s multi-platform plans have been gradually leaking, with The Verge revealing over the weekend that the upcoming Indiana Jones game is being considered for PS5. Now, Microsoft is getting ready to outline the future of Xbox next week after a weekend of leaks and uncertainty for Xbox fans. “We’re listening and we hear you,” says Microsoft Gaming CEO Phil Spencer in a post on X. “We’ve been planning a business update event for next week, where we look forward to sharing more details with you about our vision for the future of Xbox. Stay tuned.” Feb 4 Tom Warren Bethesda’s upcoming Indiana Jones game is also tentatively set to launch on Sony’s PlayStation 5 console. We got our first glimpse of Indiana Jones and the Great Circle during Microsoft’s Xbox Developer Direct event last month, where it was announced for Xbox and PC. A source familiar with Microsoft’s plans tells The Verge that Bethesda is also considering bringing Indiana Jones and the Great Circle to PS5. A new multi-platform approach for certain Xbox games is emerging inside Microsoft, we’re told, with the company weighing up which titles will remain exclusive and others that will appear on Switch or PS5 in the future. Indiana Jones appears to be part of this new wave of multi-platform games. Feb 1 Tom Warren After rumors of Xbox console exclusive Hi-Fi Rush coming to PS5 and Nintendo Switch, data miners might have just found a smoking gun. T-shirt files included in the game’s latest update include a “I’m here baby!” in PlayStation blue, a “Rock out! Anywhere” in Nintendo Switch red, and “Shadow dropped” in Xbox green. The rock out anywhere slogan must reference the Switch’s portability, the “I’m here baby!” the sheer surprise of an Xbox game on PS5, and the shadow drop for the original surprise Xbox launch. There’s no smoke without fire. 1/3 / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}