{
    "title": "Microsoft-backed OpenAI secures $80 billion valuation",
    "date": "2/17/2024",
    "url": "https://www.hindustantimes.com/world-news/microsoftbacked-openai-secures-80-billion-valuation-101708147785840.html",
    "text": "Subscribe Now! Get features like OpenAI, an artificial intelligence company backed by Microsoft, has secured a deal that values it at more than $80bn, according to the New York Times. The deal involves a tender offer led by Thrive Capital, a venture firm, in which existing shareholders of OpenAI can sell their shares. The report said that this would allow employees to cash out their shares instead of raising money for the company through a conventional funding round. This is not the first time that OpenAI has done such a deal. In early 2023, the company agreed to a similar tender offer from four venture capital firms: Thrive Capital, Sequoia Capital, Andreessen Horowitz and K2 Global. That deal valued OpenAI at about $29bn, the report said. OpenAI has also received several large investments from Microsoft, which invested $10bn in the company in January 2023 and also funded it in 2019 and 2021. ALSO READ| Donald Trump's New York City fraud trial: How can the former president pay the $354 million fine? OpenAI has been at the forefront of AI innovation and has generated a lot of excitement around its products. One of its most popular products is ChatGPT, an AI tool that can chat with users. ChatGPT was launched in late 2022 and has inspired many companies to leverage AI technology for their own purposes. Microsoft, for instance, has integrated AI into its Bing search engine and has continued to develop its own AI products. On Thursday, OpenAI announced a new product called Sora, which can create videos from text inputs. The day before, it said that it was testing a deeper memory feature for ChatGPT, which would enable it to recall more of its previous conversations with users. Sam Altman, the CEO of OpenAI, has also been looking for ways to enhance the company’s AI capabilities. He has reportedly been in discussions to buy a chip maker or to secure more access to the costly AI chips that power its products. ALSO READ| Elon Musk throws shade at Sam Altman as OpenAI unveils text-to-video model Sora The deal comes after a brief crisis in the company in late 2023, when Altman was ousted by the board of directors but was reinstated after a backlash from the employees. In early January, officials from the European Commission said that they would examine whether Microsoft’s backing of OpenAI poses any competition issues. On 24 January, the US Federal Trade Commission said that it was probing whether the investments from Microsoft, Google and Amazon in AI companies, including OpenAI, are harmful to competition.    "
}