{
    "title": "Microsoft Responds To New York Times Lawsuit With AI-startup Claiming, 'No \nNews Organization Has A Monopoly'",
    "date": "2/19/2024",
    "url": "https://finance.yahoo.com/news/microsoft-responds-york-times-lawsuit-163011631.html",
    "text": "After being sued by The New York Times for training artificial intelligence (AI) to become its direct competitor, Microsoft Corp. (NASDAQ:MSFT) has announced a partnership with Semafor to use AI to help journalists. The collaboration aims to revolutionize journalism by harnessing the power of AI to assist journalists rather than replace them. Semafor Signal will provide news from various perspectives with content written by journalists and assisted by AI. According to Semafor's announcement, \"[Journalists are] aided by AI tools that help them search news sources across multiple languages and geographies, allowing them to extend their reach to bring more, and more diverse, perspectives to readers.\" Don't Miss: This startup is accepting investors for as little as 25 cents – what’s the catch? This Los Angeles startup is closing a real estate market gap worth hundreds of billions and you can invest in it with as little as $100. Contrary to the fears of AI replacing human journalists, this collaboration creates a new approach where AI is a complement to journalistic endeavors. This collaboration comes amid a legal battle between The New York Times, Microsoft and OpenAI, shedding light on the intricate relationship between artificial intelligence and journalism. Central to the dispute is the allegation that OpenAI’s ChatGPT was trained on millions of New York Times articles without proper authorization. Trending: This startup in the climate tech industry could unlock the riches flowing 30 feet above your head. Semafor responded to that saying, “No news organization has a monopoly on the facts or the smartest analysis — no matter what any of them claim.\" By partnering with Semafor, Microsoft is addressing the concerns raised by The New York Times and embracing a new approach to journalism. These tools empower journalists to navigate through vast amounts of data, offering insights and perspectives that transcend individual news organizations. As the media landscape evolves, Microsoft’s proactive collaboration with Semafor highlights the importance of balancing innovation with ethical considerations in addressing AI challenges in journalism. Read Next: A startup that solves the age-old paywall problem is growing exponentially and looking for new shareholders. Here is where your most successful angel investment may be hidden. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? MICROSOFT (MSFT): Free Stock Analysis Report This article Microsoft Responds To New York Times Lawsuit With AI-startup Claiming, 'No News Organization Has A Monopoly' originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}