{
    "title": "Elon Musk is suing Microsoft-backed OpenAI and CEO Sam Altman",
    "date": "3/2/2024",
    "url": "https://finimize.com/content/doubt-your-intelligence",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest 29 days ago  •  2 mins What’s going on here? Elon Musk sued Microsoft-backed OpenAI for the sake of humanity – apparently. What does this mean? OpenAI was originally a non-profit company with a mission to make sure that AI would benefit humanity. It takes a lot of cash to develop world-changing technology, though, so ChatGPT’s owner added a capped profit-making arm in 2019. But Elon Musk believes the company’s veered too close toward a traditional money-making model, arguing that truly working for the benefit of humanity would involve sharing the underlying code with the world. Mind you, plenty of skeptics believe that Musk’s lawsuit is a shrewd competitive move. He has his own rival AI firm, after all. Either way, the Tesla tycoon isn’t afraid to pick a fight: he’s currently battling Google, Disney, and the US government. Why should I care? For markets: Microsoft’s in hot water. Microsoft makes a fortune selling ChatGPT services, a revenue stream that would likely dry up if the latest updates were freely available. Plus, Musk’s lawsuit alleges that OpenAI’s latest model should be classed as artificial general intelligence, the Black Mirror-style type that can do as well as humans on some tasks. Microsoft doesn’t have a deal for that, though, so it could lose its exclusive access. On top of that, the New York Times has also sued Microsoft and OpenAI for copyright infringement, and US, European, and British competition watchdogs are keeping a close eye on the duo. Bear in mind, though, that legal threats have a habit of harboring more bark than bite. The bigger picture: This could be the start of the storm. Economist Carlota Perez has described a necessary “reset” that takes place when a revolutionary technology moves from development to deployment. According to Perez, that includes social tensions, government interventions, a shift in political thoughts, and often, a financial crash. Take note, AI investors. ai elon musk information technology microsoft tech stocks us adobe ads gbp m&a Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. "
}