{
    "title": "Want an AI Play to Keep the Bears Away? Consider MSFT Stock.",
    "date": "3/3/2024",
    "url": "https://investorplace.com/2024/03/want-an-ai-play-to-keep-the-bears-away-consider-msft-stock/",
    "text": " Put MSFT stock in your portfolio for premium AI-market exposure Advertisement Source: gguy / Shutterstock.com Microsoft (NASDAQ:MSFT), with its investment in ChatGPT developer OpenAI, is already a powerful competitor in the field of artificial intelligence technology. Yet, there are still areas for Microsoft to conquer and ways for the company to evolve and expand. For the long run, my MSFT stock analysis envisions much higher prices and rich rewards for patient investors. Microsoft enhanced its Bing search and Edge browser, as well as the company’s Copilot assistant, with the latest and greatest in AI functionalities. So, what should Microsoft stockholders expect the company to do next? Stay tuned. (and definitely stay invested) as Microsoft’s greatest inroads into the wide-open AI-tech field could come in 2024 and 2025. Here’s a move that’s undeniably brilliant. According to a Reuters report (citing The Information), Microsoft is developing a network card which could reduce the company’s dependence on Nvidia (NASDAQ:NVDA). Potentially, the new network card will improve the performance of its Microsoft’s Maia AI server chip. Microsoft introduced this server chip in November, and it’s designed to support AI applications and large language models. This new network card could be compared to Nvidia’s ConnectX-7 card. However, Reuters reported that Microsoft’s new “equipment could take more than a year to develop.” Even if it takes a while to develop this network card, this is still a savvy move for Microsoft. It’s cost-effective for the company to keep its production process in-house as much as possible. And who knows? Maybe Microsoft will be able to produce AI-compatible network cards for other tech-hardware companies at some point. Move over, Nvidia! Truly, Microsoft’s quest for AI-industry dominance isn’t limited to U.S. borders. In November, for example, the company disclosed its plans to invest 2.5 billion pounds during the next three years to expand AI-compatible data centers across the United Kingdom. If you thought this would be Microsoft’s only AI push in the European continent, think again. Just recently, Microsoft revealed its intentions to invest in AI in Germany as well as in Spain. The news is coming fast and furious from Microsoft, and investors ought to be excited about this. In Germany, Microsoft plans to “invest 3.2 billion euros ($3.44 billion) in Germany in the next two years,” according to Reuters, “mostly” in AI. German Chancellor Olaf Scholz expressed his enthusiastic support for this planned AI investment from Microsoft. In Spain, meanwhile, Reuters stated that Microsoft “will expand” its AI and “cloud infrastructure in Spain through an investment of $2.1 billion in the next two years.” Microsoft Vice Chair and President Brad Smith touted this investment as part of the company’s “37-year commitment to Spain, its security, and development and digital transformation of its government, businesses, and people.” Clearly, Microsoft is making all the right moves in advancing its position as a global AI leader. First of all, Microsoft is reducing its dependence on Nvidia by developing its own AI-enabled network card. In addition, Microsoft is establishing its AI-market footprint in multiple European nations through strategic investments. My MSFT stock analysis calls for an extended rally in this year and in the coming years. Ultimately, to get prime AI exposure in your portfolio, a share position in Microsoft is an absolute must. On the date of publication, David Moadel did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. David Moadel has provided compelling content – and crossed the occasional line – on behalf of Motley Fool, Crush the Street, Market Realist, TalkMarkets, TipRanks, Benzinga, and (of course) InvestorPlace.com. He also serves as the chief analyst and market researcher for Portfolio Wealth Global and hosts the popular financial YouTube channel Looking at the Markets. Artificial Intelligence, Cloud, Software, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/want-an-ai-play-to-keep-the-bears-away-consider-msft-stock/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}