{
    "title": "Microsoft Announces New Windows, Surface CEO Replacing Panos Panay",
    "date": "3/25/2024",
    "url": "https://www.econotimes.com/Microsoft-Announces-New-Windows-Surface-CEO-Replacing-Panos-Panay-1674327",
    "text": "Menu Search Menu Search Namyang Dairy Board Reshuffle as Hahn & Co. Takes Control of Company Shiba Inu Community Alerted: Airdrop Bot Scam Exposed, Urgent Warning Issued New electrochemical technology could de-acidify the oceans - and even remove carbon dioxide in the process Porsche Recalls 1,000 Taycan EVs Over Battery Issue Nissan, Mitsubishi Forge EV Alliance to Challenge Tesla, Unveil Electric Pickup Plan Xiaomi's SUV Challenge to Tesla: SU7 Sedan Successor Set for Year-End Launch Ford Motor Slashes F-150 Lightning Workers as EV Sales Slow Wendy’s Signs Deal With PAR Punchh AI Platform to Advance Customer Loyalty Program Many drugs are prescribed for conditions they weren’t tested for – here’s what you need to know Ally Financial Designates Michael Rhodes as CEO After Leaving Chief Role at Discover Financial Analyst Foresees Bitcoin Hitting $75K with Conditions Amid Market Volatility Illuvium's $12M Funding Boost Precedes Q2 Game Launch And Airdrop Tease Philip Morris International Gears Up for IQOS Launch in Austin Traders Stake $2.4M on SEC's Verdict for Ether ETFs by May Deadline Burger King Teases the Return of 'Fake Burger' in Japan Take-Two Interactive Buys Gearbox Entertainment Company From Embracer The Independent Takes Over BuzzFeed, HuffPost in the UK and Ireland in Merger Deal     Microsoft found its CEO replacement and named Pavan Davuluri  as new chief. Microsoft Recruits Google DeepMind Co-Founder Mustafa Suleyman to Lead AI Unit as CEO Microsoft to Debut AI Copilot for Cybersecurity Against Hackers Tesla Advances on Unique Diner and Drive-In Theater, Supercharger Kick Off Interior Work SEC Directs NTC to Block Binance in Philippines Over Licensing Concerns 'Rich Dad' Author Robert Kiyosaki's Pre-Halving Bitcoin Spree Signals Bullish Market Forecast Microsoft Corporation has finally selected a new chief executive officer who will replace Panos Panay, who abruptly resigned to join Amazon as the new head of its devices and services business last year. The Redmond, Washington-headquartered technology company, named Pavan Davuluri as the new CEO of its Windows and Surface units. Davuluri’s Leadership Assignment After Panay left the company, Microsoft separated Windows and Surface and placed each under the leadership of two different leaders. Davuluri was assigned to lead Surface silicon and device work in this setup, while Mikhail Parakhin took over Windows and web experiences. The management structure was updated, and Davuluri will now lead Windows and Surface businesses. Parakhin is reportedly moving after deciding to explore new roles. CNBC noted that the latest shuffle comes after Mustafa Suleyman of Google DeepMind was named CEO of Microsoft’s AI unit. Announcement from Microsoft According to The Verge, Rajesh Jha, the company’s head of experiences and devices, released a memo for employees to inform everyone about the new Windows organization. In his note, which the publication viewed, Jha explained that the change will allow Microsoft to take an all-inclusive approach to building silicon, systems, experiences, and devices that extend to all clients of Windows and cloud in the era of artificial intelligence. “Pavan Davuluri will lead this team and continue to report to me. Shilpa Ranganathan and Jeff Johnson and their teams will report directly to Pavan,” Rajesh Jha said in the memo. “The Windows team will continue to work closely with the Microsoft AI team on AI, silicon, and experiences. The Web Experiences team will report to Mustafa in the new Microsoft AI organization.” He added that they are excited about the new Windows and Surface team as it will help Microsoft AI attain its goal of building world-class consumer AI services and products. “And I very much look forward to closely partnering with Mustafa and the team as we bring our AI products, including Copilot, to the breadth of our E+D products and services,” he said.  Photo by: Bram Van Oost/Unsplash Breathing through your nose when you exercise may make your runs easier Entrepreneurs are facing a mental health crisis — here's how to help them Are fish oil supplements as healthy as we think? And is eating fish better? Will AI kill our creativity? It could – if we don’t start to value and protect the traits that make us human Does AI have a right to free speech? Only if it supports our right to free thought How can I lower my cholesterol? Do supplements work? How about psyllium or probiotics? Why we need to set limits on sperm donation Aging with a healthy brain: How lifestyle changes could help prevent up to 40% of dementia cases Seven techniques to avoid weight regain, approved by experts Xiaomi's SUV Challenge to Tesla: SU7 Sedan Successor Set for Year-End Launch Kyrie Irving's Signature Shoe Success Post-Nike Era: A Slam Dunk for Anta Sports Tesla Cybertruck Gears Up for Thailand, Steals Spotlight in Mexico KFC Expands Menu With New Saucy Chicken Nuggets, Apple Pie Poppers Dessert Lawsuit Against Goldman Sachs, Morgan Stanley Over Archegos Collapse Dismissed by US Judge IXO™ 2024: South Korea's Largest Web3 Roadshow Expands Lineup US Finalizes Ban List for Chinese Chipmakers; Boosts Mexico Semiconductor Ties China's Commerce Minister to Advocate EV Sector in Europe Amid Subsidy, Tariff Probe FxWirePro:GBP/ NZD runs out of steam but maintains bullish outlook FxWirePro:GBP/AUD loses momentum but outlook is bullish Back to Top ▲ ©Econometrics LLC . All Rights Reserved. By using this site, you agree to the Terms of Service, Privacy Policy, and Cookie Policy. Disclaimer: EconoTimes provides references and links to selected blogs and other sources of economic and market information as an educational service to its clients and prospects and does not endorse the opinions or recommendations of the blogs or other sources of information. Clients and prospects are advised to carefully consider the opinions and analysis offered in the blogs or other information sources in the context of the client or prospect's individual analysis and decision making. None of the blogs or other sources of information is to be considered as constituting a track record. Past performance is no guarantee of future results and EconoTimes specifically advises clients and prospects to carefully review all claims and representations made by advisors, bloggers, money managers and system vendors before investing any funds or opening an account with any Brokerage. Any news, opinions, research, data, or other information contained within this website is provided as general market commentary and does not constitute investment or trading advice. EconoTimes expressly disclaims any liability for any lost principal or profits without limitation which may arise directly or indirectly from the use of or reliance on such information. As with all such advisory services, past results are never a guarantee of future results. Sign up for daily updates for the most important\n            stories unfolding in the global economy.  "
}