{
    "title": null,
    "date": "3/4/2024",
    "url": "https://www.technologyforyou.org/oregon-startup-agility-robotics-names-former-microsoft-exec-peggy-johnson-ceo/",
    "text": "Prominent Oregon startup Agility Robotics named a new CEO on Monday, hiring former Microsoft Vice President Peggy Johnson to run the business. Johnson was most recently CEO of the high-profile augmented reality startup Magic Leap before leaving that position in October. Agility Robotics makes a robot that walks upright to work in factories and warehouses. The Corvallis-based company has raised more than $180 million from investors and potential partners including Amazon, which is exploring ways to expand the use of robotics in its warehouses. Agility Robotics has about 250 employees, about half of them in Corvallis. It is preparing to open a factory in Salem to manufacture its robots. The company said Monday it will expects to begin testing its first Salem production line this spring and expects to begin sending robots to customers for trials by the end of the year. As CEO, Johnson succeeds Agility Robotics co-founder Damion Shelton, who worked at a company office in Pennsylvania. Shelton will now serve as Agility Robotics’ president. Johnson will continue living in San Diego, spending part of her time at an Agility Robotics office in the San Francisco Bay Area. Johnson was a vice president at semiconductor manufacturer Qualcomm before leaving for Microsoft in 2014, where she spent six years. She was Microsoft’s vice president of business development when she left that company for Magic Leap in 2020. Magic Leap had raised $2.6 billion for its augmented reality technology. The company failed to gain traction in the consumer and gaming markets, though, so Magic Leap shifted to focus on business customers who might use its headset to help factory workers or repair personnel. That put it in competition with Vancouver-based RealWear. — Mike Rogoway covers Oregon technology and the state economy. Reach him at mrogoway@oregonian.com or 503-294-7699 Our journalism needs your support. Please become a subscriber today at OregonLive.com/subscribe Source Link Save my name, email, and website in this browser for the next time I comment.  "
}