{
    "title": "Apple, Microsoft, Amazon, Alphabet, and Nvidia Have All Invested in \nVoice-Recognition Software. Here's 1 Artificial ...",
    "date": "3/1/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT-Q/pressreleases/24493296/apple-microsoft-amazon-alphabet-and-nvidia-have-all-invested-in-voice-recognition-software-heres-1-artificial-intelligence-ai-stock-that-could-go-parabolic/",
    "text": "The euphoria surrounding artificial intelligence (AI) played a major in the Nasdaq Composite's 43% return last year. Indeed, investor enthusiasm for AI has carried over into 2024 -- helping fuel the S&P 500 to record levels. While each member of the \"Magnificent Seven\" is playing a role in AI development, several companies in this cohort also share a more specific interest in voice-recognition software. Let's break down the various moves megacap tech has made in speech-powered AI assistants, and assess one stock in particular that could be set for liftoff. Image Source: Statista Whether you realize it or not, you probably interact with voice-based assistants almost every day. Apple acquired AI-assistant Siri back in 2010 and has since integrated the technology across its ecosystem of hardware devices. More recently, Cupertino bought the music recognition app Shazam for $400 million. Both Alphabet and Amazon have also shown a keen interest in voice-recognition applications, as each company's smart home appliances leverage this technology. Moreover, Microsoft acquired conversational AI tool Nuance a couple of years ago for $20 billion -- the third-largest acquisition in the software giant's history. But most recently, semiconductor manufacturer Nvidia revealed that it has built a small stake in voice-recognition software developerSoundHound AI(NASDAQ: SOUN). Following the news of Nvidia's investment, SoundHound AI stock rocketed higher -- the stock gained 347% in the month of February. I find this deal with Nvidia particularly delightful because in early January, I predicted that SoundHound AI may be a stock to keep your eyes on in 2024. My thesis primarily hinged on two ideas: voice-based software tools could become increasingly popular as use cases for AI continue to evolve, since voice controls can make AI tools easier to use. Furthermore, the market's appetite for acquisitions could rise this year. Since SoundHound AI's trailing-12-month revenue is only $46 million, the company is still quite small. But with cumulative subscriptions and bookings backlog of $661 million, it's clear that the demand for voice-powered AI is rising -- and it's not all coming from big tech. Considering that industry research sees the market for voice-recognition technology reaching $50 billion by the end of the decade, it appears to be early innings for SoundHound AI. While the stock has some momentum pushing it higher right now, this little-known AI company could emerge as a big winner in the long run. Should you invest $1,000 in SoundHound AI right now? Before you buy stock in SoundHound AI, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and SoundHound AI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}