{
    "title": "Microsoft Bing Head to Step Down Amid AI Push",
    "date": "3/26/2024",
    "url": "https://www.pymnts.com/personnel/2024/microsoft-bing-head-to-step-down-amid-ai-push/",
    "text": "The head of Microsoft’s Bing search engine and ad business is reportedly leaving that role. Mikhail Parakhin’s departure — the subject of a Monday (March 25) Bloomberg News report — comes a week after the tech giant appointed DeepMind co-founder Mustafa Suleyman to head up Microsoft’s consumer artificial intelligence (AI) efforts, with Parakhin reporting to him. Parakhin, who had been chief executive for advertising and web services, will report to Chief Technology Officer Kevin Scott while seeking a new role, Microsoft told Bloomberg. However, the report notes that it’s not clear whether Parakhin would exit the company or take on a new position inside Microsoft. Microsoft announced the hiring of Suleyman last week. He had been heading a startup known as Inflection, with most of that company’s staff transferring over with him. Inflection developed the Pi chatbot, which was designed to mimic human conception of emotions and act as — to quote the company — as a “kind and supportive companion.” The Bloomberg report said the move underlined Microsoft CEO Satya Nadella’s impatience with the company’s AI project, citing two sources familiar with his thinking. In the last year, the company has integrated AI into projects like Windows, Office and the Bing search engine, and released digital assistants as part of its Copilot brand. Still, Bing trails Google in the search space, while other products are still works in progress, the report said. As covered here last week, Microsoft is among the “titans” in the AI race, having invested $13 billion in OpenAI, recently valued at $80 billion. “Microsoft’s hefty investment is one reason why OpenAI is now seen as so valuable,” PYMNTS wrote. “In addition to OpenAI, Microsoft is investing $2.1 billion in another AI company, Mistral, based in France.” Elsewhere in the AI space, PYMNTS recently examined the proposed deal between two other tech titans — Apple and Google — that would see the latter company integrate its Gemini AI engine into the iPhone. “Apple’s largest moat, the App Store and Apple Services and their nearly 2 billion loyal and affluent customers, will lead to them investing in AI for developer tools for app development, app content, and a category that’s eluded Apple forever, search,” Michael Jaconi, CEO of the AI marketing tech company Button, said in an interview with PYMNTS. “Apple’s $18 billion paycheck from Google is great, but no one monetizes AI search today, really, so why not own that future when so much of the current search market already starts with you.”  We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}