{
    "title": "Bulletproof recognized as a Microsoft Security Excellence Awards finalist \nfor Security Trailblazer and Security ...",
    "date": "3/13/2024",
    "url": "https://wreg.com/business/press-releases/cision/20240313HA60520/bulletproof-recognized-as-a-microsoft-security-excellence-awards-finalist-for-security-trailblazer-and-security-changemaker/",
    "text": "WREG.com Please enter a search term. Please enter a search term. News provided by Mar 13, 2024, 11:20 AM\t\t\t\t\t\tET FREDERICTON, NB, March 13, 2024 /PRNewswire/ - Bulletproof today announced it is a Security Trailblazer and Security Changemaker award finalist in the Microsoft Security Excellence Awards. The company was honored among a global field of industry leaders that demonstrated success across the security landscape during the past 12 months and has named Ricardo Nicolini, CTO at Bulletproof as Security Changemaker finalist for making a remarkable security contribution to the company and larger community.  \"We are thrilled to be recognized as finalists for the Security Trailblazer and Security Changemaker awards. This recognition is a testament to the hard work and dedication of our team at Bulletproof. I am particularly proud of my colleague, Ricardo Nicolini, for being recognized as a Security Changemaker finalist. We are honored to be part of such a prestigious group of industry leaders and look forward to continuing our work in the security landscape,\" said Wade Dauphinee, Senior VP of Managed Security Services at Bulletproof. Ricardo Nicolini, CTO at Bulletproof, stated \"It's an incredible honor to be recognized as a finalist in the Security Changemaker category. This nomination is a testament to Bulletproof's relentless pursuit of cybersecurity excellence. I am profoundly grateful for this recognition, which underscores our collective efforts to innovate and lead in the cybersecurity landscape. This honor inspires us to continue chasing our vision to serve, secure, and empower the world through people and technology; one customer at a time.\" At the Microsoft Security Excellence Awards on May 6, 2024, Microsoft will celebrate finalists in 9 award categories honoring partner trailblazers, solution innovators, customer and technology champions, and changemakers. This is the fifth year Microsoft is recognizing partners for their outstanding work in the security landscape. All finalists are members of the Microsoft Intelligent Security Association (MISA), an ecosystem of independent software vendors (ISVs) and managed security service providers (MSSPs) that have integrated their security products and services with Microsoft's security technology. \"I'm very pleased to extend my warmest congratulations to this year's finalists for the Microsoft Security Excellence Awards. These are presented each year to recognize the outstanding achievements of our Microsoft Intelligent Security Association members as they improve customers' ability to identify and respond to security threats. Our community is made up of the most reliable and trusted security vendors worldwide. This year we received hundreds of quality submissions from partners and Microsoft stakeholders, so this year's finalists stood out in a crowd of exceptional talent. It's my pleasure to acknowledge and celebrate their work over the past year,\" said Maria Thomson, Director, Microsoft Intelligent Security Association. MISA was established to bring together Microsoft leaders, ISVs, and MSSPs to work together to defeat security threats and make the world a safer place. The industry veterans in MISA and Microsoft will vote to select the winners of the Microsoft Security Excellence Awards, providing an opportunity for colleagues to honor their peers for delivering exceptional work to our shared customers. With locations across North America and around the globe, Bulletproof has decades of IT, security, and compliance expertise. Bulletproof works with all industries of all sizes and leverages its extensive industry experience to mitigate risk and improve client processes, systems, and business infrastructure. Named Microsoft's global Security Partner of the Year  in 2021 for delivering excellence and innovative end-to-end security solutions, Bulletproof is also a member of the Microsoft Intelligent Security Association (MISA). For more information on Bulletproof, please visit our website and follow us on LinkedIn, Twitter, and Facebook.  View original content to download multimedia:https://www.prnewswire.com/news-releases/bulletproof-recognized-as-a-microsoft-security-excellence-awards-finalist-for-security-trailblazer-and-security-changemaker-302088250.html SOURCE  Bulletproof, A GLI Company NOTE: This content is not written by or endorsed by \"WREG\", its advertisers, or Nexstar Media Inc. "
}