{
    "title": "Microsoft Co. (NASDAQ:MSFT) Stake Raised by Osher Van de Voorde Investment \nManagement",
    "date": "3/23/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-msft-sec-filing-2024-03-23/",
    "text": "Osher Van de Voorde Investment Management increased its holdings in shares of Microsoft Co. (NASDAQ:MSFT - Free Report) by 7.4% during the fourth quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission (SEC). The institutional investor owned 57,793 shares of the software giant's stock after purchasing an additional 3,981 shares during the quarter. Microsoft accounts for 4.8% of Osher Van de Voorde Investment Management's portfolio, making the stock its 5th biggest holding. Osher Van de Voorde Investment Management's holdings in Microsoft were worth $21,732,000 as of its most recent SEC filing. Other hedge funds and other institutional investors have also recently modified their holdings of the company. Cadian Capital Management LP lifted its holdings in Microsoft by 15.1% in the second quarter. Cadian Capital Management LP now owns 107,000 shares of the software giant's stock valued at $36,438,000 after acquiring an additional 14,000 shares during the period. Gunderson Capital Management Inc. lifted its holdings in Microsoft by 0.7% in the fourth quarter. Gunderson Capital Management Inc. now owns 24,887 shares of the software giant's stock valued at $9,359,000 after acquiring an additional 185 shares during the period. C M Bidwell & Associates Ltd. lifted its holdings in Microsoft by 5.2% in the second quarter. C M Bidwell & Associates Ltd. now owns 5,075 shares of the software giant's stock valued at $1,728,000 after acquiring an additional 253 shares during the period. Geneos Wealth Management Inc. lifted its holdings in Microsoft by 4.1% in the third quarter. Geneos Wealth Management Inc. now owns 82,267 shares of the software giant's stock valued at $25,976,000 after acquiring an additional 3,209 shares during the period. Finally, HS Management Partners LLC lifted its holdings in Microsoft by 18.0% in the third quarter. HS Management Partners LLC now owns 298,208 shares of the software giant's stock valued at $94,159,000 after acquiring an additional 45,560 shares during the period. 69.20% of the stock is owned by institutional investors. Several research firms have recently commented on MSFT. Mizuho raised their price objective on Microsoft from $420.00 to $450.00 and gave the stock a \"buy\" rating in a research note on Friday, December 15th. KeyCorp began coverage on Microsoft in a research note on Thursday. They issued an \"overweight\" rating and a $490.00 price objective on the stock. StockNews.com downgraded Microsoft from a \"buy\" rating to a \"hold\" rating in a research note on Thursday, February 22nd. Royal Bank of Canada raised their price objective on Microsoft from $415.00 to $450.00 and gave the stock an \"outperform\" rating in a research note on Wednesday, January 31st. Finally, Jefferies Financial Group reaffirmed a \"buy\" rating and issued a $465.00 price objective on shares of Microsoft in a research note on Wednesday, March 6th. Four investment analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company. According to data from MarketBeat, Microsoft presently has a consensus rating of \"Moderate Buy\" and a consensus target price of $417.37. Check Out Our Latest Report on MSFT Shares of Microsoft stock traded down $0.63 on Friday, reaching $428.74. The company had a trading volume of 17,648,473 shares, compared to its average volume of 21,394,508. The firm has a market cap of $3.19 trillion, a price-to-earnings ratio of 38.76, a P/E/G ratio of 2.28 and a beta of 0.89. The company has a debt-to-equity ratio of 0.19, a current ratio of 1.22 and a quick ratio of 1.20. The firm's 50-day moving average price is $408.33 and its two-hundred day moving average price is $371.83. Microsoft Co. has a 1 year low of $272.05 and a 1 year high of $430.82. Microsoft (NASDAQ:MSFT - Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 earnings per share (EPS) for the quarter, topping analysts' consensus estimates of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The firm had revenue of $62.02 billion during the quarter, compared to analyst estimates of $61.14 billion. During the same period last year, the company earned $2.32 EPS. Microsoft's quarterly revenue was up 17.6% compared to the same quarter last year. As a group, research analysts predict that Microsoft Co. will post 11.63 earnings per share for the current fiscal year. The firm also recently declared a quarterly dividend, which will be paid on Thursday, June 13th. Investors of record on Thursday, May 16th will be paid a dividend of $0.75 per share. This represents a $3.00 dividend on an annualized basis and a dividend yield of 0.70%. The ex-dividend date is Wednesday, May 15th. Microsoft's dividend payout ratio is currently 27.12%. In related news, insider Bradford L. Smith sold 3,303 shares of the firm's stock in a transaction that occurred on Monday, February 5th. The stock was sold at an average price of $406.12, for a total transaction of $1,341,414.36. Following the completion of the sale, the insider now directly owns 570,826 shares of the company's stock, valued at approximately $231,823,855.12. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this hyperlink. In other Microsoft news, insider Bradford L. Smith sold 3,303 shares of Microsoft stock in a transaction on Monday, February 5th. The stock was sold at an average price of $406.12, for a total transaction of $1,341,414.36. Following the completion of the sale, the insider now directly owns 570,826 shares of the company's stock, valued at approximately $231,823,855.12. The sale was disclosed in a filing with the SEC, which is available at the SEC website. Also, EVP Kathleen T. Hogan sold 21,955 shares of Microsoft stock in a transaction on Monday, March 11th. The shares were sold at an average price of $403.96, for a total value of $8,868,941.80. Following the sale, the executive vice president now directly owns 159,764 shares of the company's stock, valued at $64,538,265.44. The disclosure for this sale can be found here. In the last three months, insiders sold 1,070,258 shares of company stock valued at $30,690,456. Insiders own 0.03% of the company's stock. Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.Read MoreFive stocks we like better than MicrosoftHow Can Investors Benefit From After-Hours TradingMarketBeat Week in Review – 3/18 – 3/223 Stocks to Protect Your Portfolio from the Coronavirus Contagion KB Home: Building on Strong Foundations During Volatile Times3 Fintech Stocks With Good 2021 ProspectsNike Stock and the 30% Rally That's Expected  Before you consider Microsoft, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list. While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's guide to investing in 5G and which 5G stocks show the most promise. Microsoft's stock price is pulling back following the Q4 results, suggesting a top is in play, but investors should not be so quick to shed their shares. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}