{
    "title": "Meet man who was rejected 35 times, worked for Rs 10000, then got Rs 2 \ncrore salary job at Microsoft but left",
    "date": "3/29/2024",
    "url": "https://www.dnaindia.com/business/report-meet-manu-agrawal-35-times-began-working-for-rs-10000-then-got-rs-2-crore-salary-job-but-left-it-due-3083356",
    "text": "India's T20 World Cup squad likely to be announced on this date Meet woman who rejected Rs 1 crore job offer, started her firm with Rs 1 lakh, turned it into... Social media influencer faces backlash over airport conveyor belt stunt, video goes viral Meet IAS officer, who resigned from TCS, cracked several govt exams before clearing UPSC CSE, with AIR... Janki Bodiwala chooses favourite between Shaitaan, Vash; reveals her parents' reaction to film: 'Mom was...'| Exclusive Business After graduating, he applied for jobs but was rejected by over 35 companies. But, he continued his efforts and eventually secured a job at Wipro with a monthly salary of 10,000 INR. Meanwhile, he did his master's in Computer Application at the National Institute of Technology in Tiruchirappalli. Jaisal Kaur Updated : Mar 30, 2024, 02:25 PM IST Tough times are the best teachers of life, and the ‘students’ who survive in them, go on to become the most inspiring and successful people. One such inspirational life story is of Manu Agrawal, founder of Tutort, who faced extreme adversities to clinch extraordinary success. Hailing from Jhansi in Uttar Pradesh, Manu studied at a Hindi-medium government school where he was an average student and had problems with maths. Thereafter, he pursued a degree in BCA (Bachelor of Computer Application) at Bundelkhand University after receiving a high AIEEE score. After graduating, Manu applied for jobs but was rejected by over 35 companies. But, he continued his efforts and eventually secured a job at Wipro with a monthly salary of 10,000 INR. Meanwhile, he did his master's in Computer Application at the National Institute of Technology in Tiruchirappalli. Later in 2016, he was chosen by Microsoft for an internship, post which he secured a job offer at Microsoft in Seattle, Washington. He was hired for a staggering salary package worth Rs. 1.9 crore, as per Navbharat Times. Despite clinching success at a young age, Manu had bigger aspirations. He returned to India during Covid-19 times as his family convinced him, and he started working as a software engineer for Google in India. Thereafter, he quit his job and collaborated with his friend Abhishek Gupta to start his startup named Tutort Academy in 2021, which is an online platform popular for its master courses in programming and software engineering including areas like Data Science, Artificial Intelligence, Data Structure, etc. Currently, Tutort Academy aspires to teach over one million students Software Engineering through its unique approach and renowned trainers from prestigious institutions like IITs, NITs, and IIMs. Controversy: Why So Much Hate Towards Hardik? Fan War Explained | Hardik Pandya Vs Shivam Dube | IPL Virat Kohli Scripts History, Wins 4th ICC Men's ODI Cricketer Of The Year Award | ICC Awards 2023 A Message For Fans | Team India's Losses In Last 10 years | U19 World Cup 2024 | T20 World Cup 2024 IND vs ENG Test Series 2024 Highlights | India Lead Series By 2-1 Against England | IND v ENG Recap "
}