{
    "title": null,
    "date": "3/6/2024",
    "url": "https://idm.net.au/article/0014666-how-get-most-out-your-microsoft-copilot-investment",
    "text": "From drafting emails to summarising Teams meeting tasks, and even screening new prospective HR candidates, Copilot for Microsoft 365 is already revolutionising the way I work. Whilst some organisations using Copilot for M365 are already realising the tangible productivity benefits, many have no plan for rolling out Copilot, or importantly, the remediation and readiness work required to prepare their data estate to enable Copilot to make smart, safe and relevant recommendations. When most organisations purchase new software, there is an extensive procurement process and a plan in place about how it will be rolled out. Since 1 November when Copilot for M365 was released, that’s not been the case. Executives all over the country (from the CEO and CFO down) have been scrambling to get their hands on 300 licenses. What I’m hearing from customers, showcased at Microsoft’s recent AI Tour Sydney, is that they are struggling to balance their desire to deploy Copilot now and clean up their data estate in M365. In this piece, I will outline the important steps organisations need to take in order to get their data estate “Copilot ready” to maximise their significant investment in Copilot for M365. Getting your data in order Your data is your organisation’s biggest asset, but in the context of Copilot, it can also be your biggest liability. As you seek to roll out Copilot, you will run into at least one of the issues described below, primarily related to your data estate. Importantly, none of these issues are prohibitive. Firstly, the issue of siloed information. A lot of business-critical data lives outside of Microsoft 365 in proprietary systems like DropBox and OpenText. Some of this data lives in closed systems for good reason, for example, controlled documents that contain heavily guarded IP owned by medical device companies. The problem is that Copilot has no way to access data in many proprietary systems, the same systems that house your most important and relevant information. Then comes the challenge of determining who gets a Copilot license. It’s not realistic or productive to give licenses to every employee. You need to make a decision, based on facts, about which employees will provide the organisation with an ROI on a Copilot investment. A lack of visibility over your employees' activity and how they interact with Microsoft 365 makes this very difficult. For example, in a law firm, one might think it would make sense to provide a license to the most highly paid staff - the partners - so they can increase their billable hours. When in fact, it’s more likely to be the executive assistants who are spending their entire day on Microsoft 365 that gain the most value from Copilot (some partners still don’t even use PCs!). Managing permissions and sensitivity risks is arguably the biggest challenge organisations are facing when adopting Copilot. Let’s take one example. It’s critical to know whether the information Copilot is generating its insights from has personally identifiable information (PII). Imagine writing a proposal for a new client and having an existing customer’s name or PII data included. Of course, there are some safeguards,  but they’re fairly rudimentary. It’s also important to identify and resolve any redundant, obsolete and trivial (ROT) data. The same goes for managing active and important workspaces. Data is easily accumulated and no organisation I’ve met likes to delete data in M365 (how often is retention turned on?).  Just think about how many times you’ve created a new Microsoft Team and then never referred back to it once the project is complete. You don’t want Copilot referencing a project status report created six years ago as if it contains relevant information for a project status report for a new customer in 2024. Finally, measuring and delivering ROI is critical. Figuring out how to measure adoption and productivity from AI-driven tools is new territory for every organisation. Ensuring staff get the right training is critical to the success of Copilot but has so far been overlooked by most organisations. Once licenses are deployed, how are they managed? How can you make sure licenses are reallocated when teams change or when usage is low? It’s incremental oversights like this that lead to little to no ROI and will see the same executives who wanted to purchase Copilot decide to pull the investment. Automating Copilot readiness Now you know what challenges organisations are already facing when adopting Copilot, your next question is probably “How do I overcome them?”. You probably have lots of data outside of Microsoft 365 and no information lifecycle management in place. You’re probably also thinking about how long remediation and readiness are going to take, knowing your executives wanted Copilot deployed yesterday. The good news is that there are automated solutions to help you get Copilot ready, and fast! From data migration and detailed analytics through to automated solutions for data security risk insights, ROT reporting & remediation, Coiloit training, license management and policy enforcement. Automated solutions are the only answer to Copilot readiness. It’s not possible to manually remediate your data estate and set your organisation up for success. These automated solutions can identify and easily manage sensitive information in minutes to make sure it’s not indexed by Copilot. They can automatically remove ROT content for accurate content generation. They can also automatically manage workspaces for relevant recommendations and track the usage and spending of licenses appropriately. Whilst Copilot will change the way we work for generations to come, if an organisation isn’t ready, it’s going to fail. There are many hurdles to Copilot's success, but each and every one is achievable with the right automated solutions to make remediation and readiness attainable within weeks. This will keep your executives happy and get Copilot for M365 in the hands of your staff quickly. Max McNamara is VP and Managing Director of AvePoint ANZ  "
}