{
    "title": "Microsoft and OpenAI want to build a $100 billion datacenter",
    "date": "3/30/2024",
    "url": "https://interestingengineering.com/culture/microsoft-and-openai-want-to-build-a-100-billion-datacenter",
    "text": "When you want to build the world’s most powerful AI data center, it comes with a cost, and a supercomputer named Stargate. By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time.  Microsoft may finance the world’s most expensive data center project. The company is planning to build a supercomputer facility with OpenAI that will cost them over $100 billion. This project will take six years to complete, and also lead to the development of an advanced AI supercomputer dubbed Stargate, which is scheduled to be operational by 2028. However, Stargate isn’t the only highlight of this five-phase project. Once this project is completed, Microsoft and OpenAI will have all the gear to train the world’s most powerful AI models including the future versions of ChatGPT. “We are always planning for the next generation of infrastructure innovations needed to continue pushing the frontier of AI capability,” a Microsoft representative told Reuters. Microsoft has already invested billions of dollars in OpenAI and has been actively supporting its AI operations since 2019. Much of the computing power and cloud servers that power ChatGPT come from Microsoft. The planned data center project is also a part of their ongoing partnership. The tech giant is currently looking for a location in the US where they could set up their data center. While Stargate will mark the end of the fifth phase of the data center project, the two companies are currently in the third phase in which they are building multiple supercomputers to further improve the performance of ChatGPT. In the fourth phase, Microsoft plans to develop and launch a supercomputer smaller than Stargate but more powerful than most existing systems. They expect to achieve this feat by 2026, and the supercomputer might be used to power OpenAI’s voice recognition or text-to-video AI tools. Experts estimate that all these phases may collectively cost Microsoft around $115 billion, much of which i.e. around $100 billion will burn in the fourth and fifth phases. Normal data centers don’t cost hundreds of billions of dollars. Even the biggest data centers on Earth cost between $250 million to a couple of billion dollars. So then why Microsoft’s proposed data center is costing $100 billion? This high cost is linked to the rise of artificial intelligence. Compared to a traditional data center, an AI data center requires more power, advanced hardware cooling systems, a higher number of chips (probably millions), and greater cloud storage and data processing capacity. “By virtue of generative AI workloads requiring much more compute, and more widely affecting energy efficiency and cooling in the data center, undoubtedly cloud costs will continue to rise as more companies adopt generative AI,” Tracy Woo, an IT research analyst told WSJ. Therefore, you shouldn’t be surprised if you hear about a data center in the future that costs more than $100 billion. "
}