{
    "title": null,
    "date": "3/12/2024",
    "url": "https://mspoweruser.com/microsoft-declares-quarterly-dividend-of-0-75-per-share/",
    "text": "Follow us Share this article Improve this guide 1 min. read Published on March 13, 2024 published on \n\nMarch 13, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft has announced that its board of directors has declared a quarterly dividend of $0.75 per share. The dividend will be paid on June 13, 2024, to shareholders of record as of May 16, 2024. The ex-dividend date is the date for shareholders to be eligible for the upcoming dividend payment, which is set for May 15, 2024. Dividends are a way for companies to distribute a portion of their earnings back to shareholders, and a consistent dividend policy can be a sign of a company’s financial health and stability. Microsoft is a leading technology company known for its software products, cloud services, and hardware and is the most valuable company in the world. The declaration of dividends depends on approval by the board of directors and is a common practice among publicly traded companies. Investors often consider dividend yield and consistency as factors in their investment decisions. Here is the summary: The information is solely based on the press release and doesn’t include investment advice. More about the topics: dividend Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}