{
    "title": null,
    "date": "1/5/2024",
    "url": "https://www.forbes.com/advisor/business/software/microsoft-planner-review/",
    "text": "You might be using an unsupported or outdated browser. To get the best possible experience please use the latest version of Chrome, Firefox, Safari, or Microsoft Edge to view this website. Reviewed Reviewed Updated: Jan 5, 2024, 4:04pm Microsoft Planner is an included app with a business version of Microsoft 365, an ecosystem of office productivity applications. The browser- and mobile-based program is more of a task management app than project management app, but it can be useful for users of Microsoft products. In our Microsoft Planner review, we spent hours researching the features, functionality, ease of use and support for the app. At Forbes Advisor, we try to get hands-on experience as users with all software we review. In this case, we were able to test an account, but not one of our own due to Microsoft failing to respond to our requests for help. We were able to test customer support, which you can read about below. With that in mind, we were not able to share the initial experience after signing up for an account, but we are able to provide a thorough rundown of all that Microsoft Planner has to offer. Microsoft Planner is a task management tool included in the Microsoft 365 subscription for businesses. It natively integrates with other Microsoft products, such as Word, Excel and Teams, making it a good solution for businesses already using Microsoft 365. Microsoft introduced Planner in 2016 as part of its Microsoft 365 app ecosystem. The purpose of the app is to provide task management features for Microsoft business users. It also gets added functionality with other Microsoft products, such as Word and Excel for document creation and collaboration and Teams for communication.  Microsoft Planner is included in every business version of Microsoft 365, so you don’t have to purchase separate task management software for your teams if you already subscribe to Microsoft 365. It offers seamless integrations with other Microsoft products, so you can easily create documents and spreadsheets with Word or Excel and share them on Planner. Built-in collaboration comes via Microsoft Teams, so there’s no need to connect a third-party app. As valuable as the native integrations are in Microsoft 365 for Microsoft Planner, they aren’t going to help if you don’t already use or plan to use Microsoft products. The biggest benefit of Microsoft Planner is what sets it apart from the competition: native integrations with Microsoft products. Beyond that, it’s easy to use, so you won’t have much of a learning curve even if your team hasn’t used Kanban boards before. Microsoft Planner is only available via a browser or mobile app. You cannot download a desktop version. As a task management app, it works well enough but it doesn’t provide enough functionality to be a fully featured project management tool (that’s what Microsoft Project is for). Also, you cannot purchase or subscribe to Microsoft Planner as a stand-alone product. You need to have a Microsoft 365 subscription, and it isn’t available for personal or home users, only business plans. Featured Partners 1 monday.com Yes From $8 monthly per user Zoom, LinkedIn, Adobe, Salesforce and more 1 monday.com On monday.com's Website 2 Smartsheet Yes, for one user and two editors $7 per user per month Google Drive, Slack, Tableau, Miro, Zapier and more 2 Smartsheet On Smartsheet's Website 3 ClickUp Yes, for unlimited members $7 per month Slack, Microsoft Outlook, HubSpot, Salesforce, Timely, Google Drive and more 3 ClickUp On ClickUp's Website At its core, Microsoft Planner is a task management application. You can easily create to-do lists, checklists and projects. The Kanban, charts and calendar views are intuitive for anyone to use and give a clear view of the tasks at hand. Although the features are fewer than other project management tools, they are effective for simple projects. It took years for Microsoft to add a task assignment feature. Now you can create a task and assign it to a user either via Planner or Teams. Even more helpful is that you can assign a task to multiple users (up to 11). You cannot separate sections of a task, though. So if one person marks a task as complete, it marks it as complete for all users. Microsoft Planner offers three views for projects and tasks. You can use a Kanban board that has a classic interface with columns, known as buckets, and cards for tasks, and you can simply drag and drop the cards as the work flows. There’s a charts view that gives you a visual representation (pie and bar charts) of tasks, buckets and user availability. The calendar view is labeled as a schedule view, which simply shows the tasks with due dates on a calendar.  One of the best things about Microsoft Planner is that it’s a part of the Microsoft 365 family of apps. The integrations with Office products, Teams and Outlook, for example, are seamless. There are also optional integrations with apps such as Slack and Zapier. Compared to some of the best task management apps, Microsoft Planner has fewer integrations, though. Access to Microsoft Planner is only available through the subscription of one of Microsoft Office 365 business plans. Pricing starts at $6 per user per month (billed annually). There is a free 30-day trial available of any of the plans, but you must provide payment information to start the trial. See MoreSee Less The entry-level business plan of Microsoft Office 365 Basic gives you access to a lot of features, including a business email, a 50GB mailbox via Outlook and a calendar. You’ll be able to use most apps associated with Microsoft 365, including Microsoft Planner, Word, Excel, Teams and SharePoint, but all of these are only available through a browser or mobile app. Security features include MFA, password policies and custom permission settings. Pricing for this subscription costs $6 per user per month (billed annually). The Standard plan gives you all of what’s included in the Basic package with the addition of downloadable desktop apps (but not for Microsoft Planner). You also get access to a webinar app. This plan costs $12.50 per user per month (billed annually). There are no additional features in Microsoft Planner at this level. If you need more access control and management for better security, the Premium plan grants this feature plus enterprise-grade level security. Other features include device management, so you can remove business data from devices as needed. Getting started with Microsoft Planner starts with signing up for a business version of Microsoft Office 365. Planner does not exist as a stand-alone product. Once you’ve created an account, you can find the app in the list of available apps in 365. To get started, create a new plan and the app will open in the Kanban board view. Microsoft refers to the columns on the board as buckets. Simply click the plus sign under a bucket to create a task card. Fill out information and then assign the task to users. Within each card are fields for pertinent information, such as start date, progress, due date and attachments. You can also choose priority level and set up the card as a repeating task on a daily, weekly or monthly basis. All of these fields are intuitive and are similar to other task management apps such as Trello or Wrike. One annoyance we had is that you can’t format notes in bullet lists or with boldface or italics, which most other project managements allow. After you have a plan with tasks created, you can view the plan in a list format, as charts for a high-level view of task statuses or choose the schedule view to see tasks in on a calendar. There’s an option to view your project in a timeline view, but this takes you to Microsoft Project, a superior project management tool that includes feature Planner is missing such as task dependencies and custom fields.  Microsoft Planner is fairly self-explanatory. Navigation is intuitive, as are the buttons to create a new plan, task and bucket. Most of the fields are what you’d expect as well, and all you need to do is click and add a user, a date or information about a task. You can also easily create a checklist for a variety of subtasks within a single task card. With all that said, Microsoft Planner’s interface doesn’t always make sense. The part that’s most confusing about the grid view, for example, is that tasks don’t automatically arrange in an organized way. There’s no rhyme or reason to why one task comes before another; it isn’t arranged alphabetically, by date, bucket or even by progress or priority. Also, you can’t move tasks on the grid view to rearrange the order.  Microsoft takes security very seriously and most of the features you’d need to keep data and logins safe are available for all of the business plans for Microsoft 365. All plans offer email filtering, the ability to create password policies and MFA sign-ins. You can also create groups with specific permissions for users. The highest-tier plan offers advanced security features, such as stronger security to protect against ransomware and phishing attacks. You can also delete sensitive information from business devices as needed, such as when an employee leaves the company or a device is lost or stolen. Customer support is available for business plan users of Microsoft 365 by live chat, email and phone. Hours vary depending on your location and we received different answers from different agents; one said it’s available 9 a.m. to 5 p.m. ET weekdays, while another claimed support is available 6 a.m. to 6 p.m. ET weekdays. Our experience with Microsoft support varied. In one case, we were able to request a call back rather than stay on hold and received a call within 30 minutes. The agent was as helpful as they could be, but we needed to contact support again. The other calls to support were less successful. Hold times were approximate, but more than 120 minutes. After waiting for 90 minutes, we received the option to get a call back but when we chose it, we got a message that it wasn’t working and were disconnected from the call. A final attempt was made to contact support but we never got through and no one ever returned a call. We did get an email days later and scheduled a call, but no one followed up after several weeks of waiting.  See MoreSee Less *Billed annually When comparing Microsoft Planner to some of the best project management software such as ClickUp, Airtable and Jira, it’s clear to see that it doesn’t stack up. It’s fairer to say that Microsoft Planner is strictly a task management tool, but even then it doesn’t provide enough advanced features to be as useful as other task management apps. If you’re signing up for a business version of Microsoft 365 to gain access to Microsoft Planner, you’ll end up paying more per month than for ClickUp, which offers far more functionality. However, a subscription to Microsoft 365 for $6 per user per month (billed annually) gets you a lot of browser-based apps by Microsoft that can be helpful for office and work management that ClickUp doesn’t have. Still, ClickUp costs $5 per user per month (billed annually) and provides a comprehensive set of features for project management. If you compare Microsoft Planner versus Airtable, you’ll find that the most they have in common is task management. Airtable is a much more flexible, automated and customizable option for project management and collaboration. Airtable is more expensive at $10 per user per month (billed annually), while Microsoft Planner (as part of Microsoft 365) costs $6 per user per month. Jira is considered one of the most effective project management tools for product and software development. It’s made for Agile development with Scrum boards, customizable templates, Gantt charts and budgeting features. Microsoft Planner is more affordable than Jira, but it only matches Jira in its Kanban board view. Featured Partners 1 monday.com Yes From $8 monthly per user Zoom, LinkedIn, Adobe, Salesforce and more 1 monday.com On monday.com's Website 2 Smartsheet Yes, for one user and two editors $7 per user per month Google Drive, Slack, Tableau, Miro, Zapier and more 2 Smartsheet On Smartsheet's Website 3 ClickUp Yes, for unlimited members $7 per month Slack, Microsoft Outlook, HubSpot, Salesforce, Timely, Google Drive and more 3 ClickUp On ClickUp's Website The only businesses that Microsoft Planner makes sense for are those that are already using Microsoft Office 365. Microsoft Planner is included at no additional cost with a Microsoft 365 business subscription. It’s easy to use for task management and planning simple projects. Plus you can make good use of its built-in communication via Teams, document creation via Word and Excel and email from the Outlook client. Microsoft Planner is instantly intuitive and it’s a simple way to track tasks for a single project. However, it needlessly labels columns as buckets and projects as plans. It also doesn’t offer enough functionality to be a viable project management tool for teams that require Gantt charts, task dependencies, timelines, milestones, budgeting tools or billing and invoicing. There’s no clear reason why Microsoft Planner works the way it does. If you switch from the Kanban view to a grid view, there’s no organization of tasks, which is a standard behind-the-scenes feature we realize we take for granted in other task management apps. There are plenty of options for support and if you can solve the issue with Microsoft’s robust knowledge base, it’s serviceable. Live support is available via chat and phone, but wait times are so long that it’s frustrating to use, at best. Technically, no. Microsoft Planner is included in business plans for Microsoft Office 365. It’s also available in Office education plans. Microsoft Planner is a simple task management tool that lets you track tasks and due dates. Microsoft Project is more of a project management app with more functionality for tracking tasks, dependencies, costs and milestones. Microsoft Planner is primarily a task and project planning tool with its default view being a Kanban-like board. You can create and move card tasks that fit into columns, or as Microsoft calls them, “buckets.” It includes the ability to assign tasks to different users. Get the Forbes Advisor newsletter for helpful tips, news, product reviews and offers from a name you can trust. "
}