{
    "title": null,
    "date": "1/27/2024",
    "url": "https://finance.yahoo.com/news/18-best-52-week-low-102910064.html",
    "text": "In this article, we will take a detailed look at the 18 Best 52-Week Low Stocks To Buy Now. For a quick overview of such stocks, read our article 5 Best 52-Week Low Stocks To Buy Now. Many analysts believe US stocks are poised to grow, albeit slowly, in 2024 despite uncertainties around the election, inflation and the Federal Reserve's next plan of action. Lori Calvasina from RBC Capital Markets in December said, while talking to CNBC, that the market is poised to grow slowly in the second half of 2024 but for now investors need to rest a little to digest the massive gains seen in the fourth quarter of 2023. Calvasina has a 5,000 target for the S&P 500 for 2024. Buying solid stocks when they are trading at attractive valuations has been the age-old and time-tested strategy of wise investors. Many believe there are many opportunities for under-the-radar stocks and investors should look beyond just the mega-cap tech stocks like Microsoft Corp (NASDAQ:MSFT), Meta Platforms Inc (NASDAQ:META) and  Salesforce Inc (NYSE:CRM). Long-term investors are always on the lookout for bargains in the market since there are always companies that are trading below their intrinsic value. As the legendary value investor Seth Klarman said long ago in one of his letters to investors, value investing outperforms when everything else in the market is not working: \"I must remind you that value investing is not designed to outperform in a bull market. In a bull market, anyone, with any investment strategy or none at all, can do well, often better than value investors. It is only in a bear market that the value investing discipline becomes especially important because value investing, virtually alone among strategies, gives you exposure to the upside with limited downside risk. In a stormy market, the value investing discipline becomes crucial, because it helps you find your bearings when reassuring landmarks are no longer visible. In a market downturn, momentum investors cannot find momentum, growth investors worry about a slowdown, and technical analysts don't like their charts. But the value investing discipline tells you exactly what to analyze, price versus value, and then what to do, buy at a considerable discount and sell near full value. And, because you cannot tell what the market is going to do, a value investment discipline is important because it is the only approach that produces consistently good investment results over a complete market cycle.\" Photo by Kaleidico on Unsplash Methodology For this article we first used a stock screener to identify stocks that are trading near or at their 52-week lows. From these stocks we chose 18 companies with the highest number of hedge fund investors. Why hedge funds? Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Number of Hedge Fund Investors: 7 Canada-based Aurora Cannabis Inc (NASDAQ:ACB) is one of the best 52-week low stocks to buy according to hedge funds. A total of seven hedge funds tracked by Insider Monkey had stakes in Aurora Cannabis Inc (NASDAQ:ACB). The most notable hedge fund stakeholder of Aurora Cannabis Inc (NASDAQ:ACB) was Israel Englander's Millennium Management. During the second quarter results posted in November 2023, Aurora Cannabis Inc (NASDAQ:ACB) said its revenue jumped 30.3% on a year-over-year basis. Number of Hedge Fund Investors: 7 Clinical stage biopharma company BioVie Inc (NASDAQ:BIVI) ranks 17th in our list of the best 52-week low stocks to buy according to hedge funds. While the stock was trading in the green as of January 26, it has lost about 80% in value over the past 12 months. A big blow for the stock came in November 2023 when BioVie Inc (NASDAQ:BIVI) said the primary efficacy endpoint of Phase 3 trial of NE3107 for treatment of mild to moderate Alzheimer's Disease missed statistical significance \"due to exclusions.\" As of the end of the third quarter of 2023, seven hedge funds tracked by Insider Monkey had stakes in BioVie Inc (NASDAQ:BIVI). Number of Hedge Fund Investors: 8 Brooge Energy Ltd (NASDAQ:BROG) shares took a plunge in December 2023 after federal regulators fined Brooge Energy Ltd (NASDAQ:BROG) for allegedly inflating its revenues in documents for a $500 million stock sale. In October, the stock jumped after Brooge Energy Ltd (NASDAQ:BROG) said it received a takeover offer from Dubai-listed maritime and shipping company Gulf Navigation Holdings. Insider Monkey's database of 910 hedge funds shows that eight hedge funds had stakes in Brooge Energy Ltd (NASDAQ:BROG). Number of Hedge Fund Investors: 9 SES AI Corp (NYSE:SES) makes high-performance lithium-metal rechargeable batteries for electric vehicles, electric vehicle take-off and landing, and other applications. The stock has lost about 62% over the past one year. As of the end of the third quarter of 2023, nine hedge funds tracked by Insider Monkey had stakes in SES AI Corp (NYSE:SES). Number of Hedge Fund Investors: 13 Quick service restaurants company Portillos Inc (NASDAQ:PTLO) ranks 14th in our list of the best 52-week low stocks to buy according to hedge funds. Over the past one year the stock has lost about 38% in value. A total of 13 hedge funds in Insider Monkey's database of 910 funds had stakes in Portillos Inc (NASDAQ:PTLO). The biggest hedge fund stakeholder of Portillos Inc (NASDAQ:PTLO) during this period was William B. Gray's Orbis Investment Management which owns a $78 million stake in Portillos Inc (NASDAQ:PTLO). Number of Hedge Fund Investors: 14 AerSale Corp (NASDAQ:ASLE) shares have lost about 45% over the past one year. Earlier this month AerSale Corp (NASDAQ:ASLE) filed a prospectus related to the proposed resale of 9.55 million shares by selling stockholders. This prospectus is not an offer to sell these securities. As of the end of the third quarter of 2023, 14 hedge funds out of the 910 funds in Insider Monkey's database had stakes in AerSale Corp (NASDAQ: ASLE). Number of Hedge Fund Investors: 14 African telecom company IHS Holding Ltd (NYSE:IHS) shares are down by about 48% over the past 12 months. Insider Monkey's database of 910 hedge funds shows that 14 funds had stakes in IHS Holding Ltd (NYSE:IHS). In November IHS Holding Ltd (NYSE:IHS) posted Q3 results. Revenue in the quarter fell 10.4% year over year to $467 million, beating estimates by $9.13 million. Number of Hedge Fund Investors: 14 SSR Mining Inc (NASDAQ:SSRM) ranks 11th in our list of the best 52-week low stocks to buy according to hedge funds. In November SSR Mining Inc (NASDAQ:SSRM) posted Q3 results. Revenue in the quarter jumped 131.3% year over year to $385.39 million. As of the end of the third quarter of 2023, 14 hedge funds tracked by Insider Monkey had stakes in SSR Mining Inc (NASDAQ:SSRM). Palm Valley Capital Management made the following comment about SSR Mining Inc. (NASDAQ:SSRM) in its Q3 2023 investor letter: “We did not fully sell any positions during the third quarter. We purchased four new names: Avista Corporation (ticker: AVA), Farmland Partners (ticker: FPI), Equity Commonwealth (ticker: EQC), and SSR Mining Inc. (NASDAQ:SSRM). We believe these opportunities materialized because higher interest rates are disproportionately impacting investor sentiment toward certain sectors, even as capitalization-weighted, tech-heavy indexes have powered through the headwinds. SSR Mining is back in the Fund after a brief hiatus. SSR is a precious metals producer with four mines located in the United States, Turkey, Canada, and Argentina. The company is selling at a meaningful discount to its tangible book value and our calculated net asset value. SSR has a very strong balance sheet with more cash than debt and $4.6 billion in stockholders’ equity. Furthermore, the firm has a history of generating free cash flow, buying back stock, and paying a sustainable dividend.” Number of Hedge Fund Investors: 15 NovaGold Resources Inc (NYSE:NG) shares have lost about 54% over the past one year. A total of 15 hedge funds out of the 910 funds tracked by Insider Monkey had stakes in NovaGold Resources Inc (NYSE:NG). The biggest stakeholder of NovaGold Resources Inc (NYSE:NG) during this period was John Paulson's Paulson & Co which owns an $85 million stake in NovaGold Resources Inc (NYSE:NG). Number of Hedge Fund Investors: 17 Chinese internet and data center services company VNET Group Inc - ADR (NASDAQ:VNET) ranks ninth in our list of the best 52-week low stocks to buy according to hedge funds. 17 hedge funds had stakes in VNET Group Inc - ADR (NASDAQ:VNET) as of the end of the September 2023 quarter. The biggest stake in VNET Group Inc - ADR (NASDAQ:VNET) is owned by Seth Fischer's Oasis Management which owns an $11 million stake in VNET Group Inc - ADR (NASDAQ:VNET). Number of Hedge Fund Investors: 17 Vertex Energy Inc (NASDAQ:VTNR) recently hit its two-year lows after Fitch downgraded Vertex Energy Inc's (NASDAQ:VTNR) default rating amid declines in the price difference between refined products and crude oil, known as a crack spread. As of the end of the third quarter of 2023, 17 hedge funds in Insider Monkey's database of hedge funds had stakes in Vertex Energy Inc (NASDAQ:VTNR). The most notable hedge fund stakeholder of Vertex Energy Inc (NASDAQ:VTNR) was Adam Usdan's Trellus Management Company which owns a $9.4 million stake. Unlike Microsoft Corp (NASDAQ:MSFT), Meta Platforms Inc (NASDAQ:META) and  Salesforce Inc (NYSE:CRM), which are highly popular among hedge funds, VTNR is a small company with a lower number of hedge fund investors. Number of Hedge Fund Investors: 19 Canadian mining company B2Gold Corp (NYSE:BTG) is one of the best 52-week low stocks to buy according to hedge funds. The stock is down by about 33% over the past one year. A total of 19 hedge funds in Insider Monkey's database of 910 hedge funds had stakes in B2Gold Corp (NYSE:BTG). The biggest stakeholder of B2Gold Corp (NYSE:BTG) was John Overdeck and David Siegel's Two Sigma Advisors which owns a $34 million stake in B2Gold Corp (NYSE:BTG). CIBC recently cut its price target on BTG stock to Neutral from Outperform and set a $3.60 price target, down from $4.20. Number of Hedge Fund Investors: 19 BlackBerry Ltd (NYSE:BB) stock ranks sixth in our list of the best 52-week low stocks to buy according to smart money investors. In December the stock plunged after weak guidance. For the fourth quarter BlackBerry Ltd (NYSE:BB) said it expects revenue between $150 million and $159 million, well below the average analyst estimate of nearly $190 million.  During the third quarter the company's adjusted EPS came in at $0.01, beating estimates by $0.03. In addition to BlackBerry, hedge funds are also buying Microsoft Corp (NASDAQ:MSFT), Meta Platforms Inc (NASDAQ:META) and  Salesforce Inc (NYSE:CRM).  Click to continue reading and see 5 Best 52-Week Low Stocks To Buy Now.  Suggested Articles: 13 Most Buzzing Stocks To Buy Now 13 Best Grocery Stocks To Buy Now 15 Best Affordable Stocks To Buy Now Disclosure: None. 18 Best 52-Week Low Stocks To Buy Now is originally published on Insider Monkey. Related Quotes "
}