{
    "title": null,
    "date": "1/17/2024",
    "url": "https://techwireasia.com/01/2024/microsoft-brings-more-new-features-to-copilot/",
    "text": "Microsoft takes another step forward in improving generative AI by introducing several new features to Copilot. (Source – Microsoft). By Aaron Raj | 17 January, 2024 Microsoft wants to ensure users get the most out of generative AI, not least because it’s fundamentally embedded in large-scale investments in the technology through OpenAI. There is no denying that AI will continue its growth and adoption. In fact, Gartner predicts generative AI is due to make people “better and more powerful” in the relatively short term. Individuals can use generative AI to create better resumes, reports, work products and even interactions with others. By 2027, the productivity value of AI in the workplace is expected to be recognized as a primary economic indicator of national power, largely due to widespread gains in workforce productivity. Muhammad Zulhusni | 8 January, 2024 Recognising as much, Microsoft is  introducing several new features to Copilot. Since unveiling Copilot, Microsoft has continued to develop the technology, launching new features almost every quarter. The latest features announced would allow Microsoft customers, be they businesses or individuals, to have better opportunities and access to making the most of AI on their devices. In a blog post, Yusuf Mehdi, executive vice president, consumer chief marketing officer at Microsoft, said that Copilot has already worked on more than 5 billion chats and more than 5 billion images to date. For Microsoft, the increased usage can be divided into two categories of users. The first would be those who want rapid access to AI. These include creators, researchers and programmers. The second would be those who want to use Copilot for personal projects and such. Microsoft wants to make Copilot “the everyday AI companion” to millions of people around the world. Microsoft is introducing three key updates to Copilot. This first is Copilot GPTs. Copilot GPTs let users customize the behavior of Copilot on a topic that is of particular interest to them. The Copilot GPT builds on Microsoft’s partnership with OpenAI. The GPTs, which will start rolling out, will have specific purposes such as fitness, travel, cooking and more. Microsoft also unveiled the Copilot mobile app for both Android and iOS devices. The Copilot app gives users the power of Copilot on the go as their Copilot queries and chats will roam across users’ phones and PCs. The Copilot mobile app includes the same capabilities as Copilot on the PC including access to GPT-4, Dall-E 3 for image creation, and the ability to use images from your phone when chatting with Copilot. The third feature is more for business. Microsoft is adding Copilot to the Microsoft 365 mobile app for Android and iOS for individuals with a Microsoft account. This new feature is rolling out over the next month. Access Copilot right inside the app and easily export the content users create to a Word or PDF document. Microsoft also unveiled the Copilot mobile app for both Android and iOS devices. (Source – Microsoft). Copilot Pro is a new premium subscription service for individuals that provides a higher tier of service for AI capabilities, brings Copilot AI capabilities to Microsoft 365 Personal and Family subscribers, and new capabilities, such as the ability to create Copilot GPTs. Microsoft is also announcing the general availability of Copilot app for iOS and Android phones. Finally, Microsoft will bring Copilot for Microsoft 365 to more commercial customers by expanding the availability to businesses of all sizes, including small- and medium-sized businesses, starting today. With a subscription price of US$20 per month, Copilot Pro is expected to deliver more advanced features and capabilities to individuals. Specifically, users will get a single AI experience that runs across their devices, understanding their context on the web, on their PC and across their apps. It will be soon available on their mobile devices as well. Users will also get priority access to the very latest models, including GPT-4 Turbo as well as access to enhanced AI image creation with Image Creator from Designer. Moreover, they will have the ability to build their own Copilot GPT.  Copilot GPT is a customized Copilot tailored for a specific topic, with just a simple set of prompts. Businesses will be able to leverage the new updates offered by Copilot for Microsoft 365. (Source – Microsoft). While individuals can make the most out of Copilot Pro, businesses will be able to leverage the new updates offered by Copilot for Microsoft 365. Despite only being launched to enterprises in November 2023, 40% of the Fortune 100 participated in Microsoft’s Early Access Program, and since GA for enterprise, customers like Visa, BP, Honda, Pfizer, and partners like Accenture, KPMG and PwC are already using Copilot. “This means thousands of people across industries and sectors have started working in new ways, with an AI-powered copilot at their side. Today we are excited to announce that Copilot for Microsoft 365 is now available for organizations of all sizes — with no seat minimum. We are also enabling our partners to help every business become AI-powered,” said Mehdi. The new updates announced include the general availability of Copilot for Microsoft 365 to small businesses. Microsoft 365 Business Premium and Business Standard Customers can purchase between one and 299 seats for US$30 per person per month. Microsoft is also removing the 300-seat purchase minimum for commercial plans and making Copilot available for Office 365 E3 and E5 customers. Commercial customers can now purchase Copilot for Microsoft 365 through the network of Microsoft Cloud Solution Provider partners. “Copilot for Microsoft 365 is even more powerful for organizations because it works across your entire universe of data at work — including emails, meetings, chats, documents and more, plus the web. With natural language prompts like “Tell my team how we updated the product strategy,” Copilot can generate a status update based on the morning’s meetings, emails and chat threads,” added Mehdi. Microsoft has also announced a new, far-reaching 10-year strategic partnership with Vodafone. The partnership leverages their respective strengths in offering scaled digital platforms to more than 300 million businesses, public sector organizations, and consumers across Europe and Africa. Through the partnership, the companies will collaborate to transform Vodafone’s customer experience using Microsoft’s generative AI; hyperscale Vodafone’s leading managed IoT connectivity platform; develop new digital and financial services for businesses, particularly SMEs across Europe and Africa; and overhaul its global data center cloud strategy. Vodafone will invest US$1.5 billion over the next 10 years in cloud and customer-focused AI services developed in conjunction with Microsoft. Additionally, Microsoft will use Vodafone’s fixed and mobile connectivity services. Microsoft also intends to invest in Vodafone’s managed IoT connectivity platform, which will become a separate, standalone business by April 2024. The new company will attract new partners and customers, driving growth in applications and expanding the platform to connect more devices, vehicles and machines.  By Aaron Raj Aaron RajAaron enjoys writing about enterprise technology in the region. He has attended and covered many local and international tech expos, events and forums, speaking to some of the biggest tech personalities in the industry. With over a decade of experience in the media, Aaron previously worked on politics, business, sports and entertainment news. Aaron enjoys writing about enterprise technology in the region. He has attended and covered many local and international tech expos, events and forums, speaking to some of the biggest tech personalities in the industry. With over a decade of experience in the media, Aaron previously worked on politics, business, sports and entertainment news. © 2024 Tech Wire Asia | All Rights Reserved Terms of use Privacy Policy "
}