{
    "title": "Microsoft Becomes $3 Trillion Company After Mass Layoffs",
    "date": "1/26/2024",
    "url": "https://gamerant.com/microsoft-3-trillion-company-mass-layoffs/",
    "text": "Just days after announcing major layoffs, Microsoft achieves a new feat of becoming a $3 trillion company, sparking mixed reactions. Just days after laying off 1,900 workers under the recently acquired Activision Blizzard, Microsoft has become only the second company ever to reach a $3 trillion market value. The recent layoffs by Microsoft were met with inquisition from audiences concerned about the company's profits, though it would seem Microsoft is showing no signs of declining value. One of the most profitable companies in the world, Microsoft sits just behind fellow technological powerhouse Apple in the $3 trillion club. Both Microsoft and Apple have continued to show increases in stock valuation over the past few years, and the two continue to compete for the top spot as the most highly valued company. First reported by Gamevro, Microsoft achieved a market valuation of $3.009 trillion at the end of trading on January 25. This placed Microsoft ahead of Apple, which finished trading yesterday at $3.002 trillion. The two tech giants have been alternating between the top two market value spots, with Microsoft only once falling below the $3 trillion mark. Much of Microsoft's recent rise in investment value has been attributed to the company's dedication to artificial intelligence with OpenAI, the maker of ChatGPT. While the milestone marks a historic achievement for Microsoft, the leap in trading value has come in the wake of an announcement that 1,900 Activision-Blizzard staff are getting laid off. With Phil Spencer, head of Microsoft gaming, attributing these layoffs to cost restructuring, the $3 trillion valuation has received mixed reactions from fans. Audiences have continued to question and even critique the continuing trend of major companies in the technology and gaming industries resorting to massive layoffs in order to cut costs. Consumers have remained highly critical of companies letting go of hundreds of employees while simultaneously boasting record profits and stock valuations. Microsoft is among the companies to receive scrutiny, particularly as it received a similar boost in corporate value just one year ago, which also came under similar circumstances. In January 2023, Microsoft cut 10,000 jobs and then saw its stock value rise up to 70% in the following months. While January of last year was the beginning of Microsoft's AI investments and subsequent enthusiasm from stockholders, audiences remain weary of when the layoff trend will come to an end. With many in the technology and gaming industries constantly reeling from layoffs, cancelations, and shutdowns, it is understandable that Microsoft's $3 trillion achievement has raised a number of eyebrows. Several former Microsoft executives have left their positions, and an unnamed Blizzard survival game was canceled due to the layoffs. As consumers brace for potential impacts on their end, Microsoft and other companies continue to work to reassure fans and shareholders alike that these cutbacks will be for the better in the long run.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Charming Holiday is a former cultural policy advisor who has turned his focus to his lifelong passion of gaming. He lived and worked in South Korea from early 2016 to mid-2019 but has since returned to the greater Chicago area, working remotely in the video game music and live event spheres. Having worked at conventions such as MAGFest and Holiday Matsuri, Charming is a fan of IRL experiences that allow him to discover and enjoy the full-bredth of what the gaming and pop culture industries have to offer. His first console was the original Playstation, though he now focuses on the Nintendo Switch and its growing library of first party and indie games. Charming is also a die-hard Lord of the Rings fan and has been a loyal K-Pop lover since 2012. His tastes in gaming and entertainment vary, but Charming is particularly fond of mystery point-and-click games and action adventure platformers (2D and 3D). Charming hopes to expand his talents into the gaming news industry with the ultimate goal of one day getting to write for and ship a game. Oh, and he'd also LOVE to go to San Diego Comic Con someday. Someday... Years after it didn't take off as a revolutionary gaming peripheral, a gamer spots an Xbox Kinect serving a different and useful purpose. Elon Musk files a lawsuit against OpenAI, sparking a legal battle between the tech entrepreneur and the renowned AI research organization. Xbox Game Pass is losing a popular RPG today, but the departing title can be grabbed at its lowest-ever Xbox Store price before that happens. Hideo Kojima is one of the most innovative developers in the video game industry, but which of his many titles is considered the hardest? An obscure Bandai Namco RPG has been surprisingly delisted from the Steam store without any warning, removing the last available version of the game. The Elder Scrolls Online will drop major content on March 11 in anticipation of the Gold Road chapter, which is set to release this June. "
}