{
    "title": "Microsoft Cancels New Blizzard Video Game After Six Years of Development",
    "date": "1/25/2024",
    "url": "https://finance.yahoo.com/news/microsoft-cancels-blizzard-video-game-204010596.html",
    "text": "(Bloomberg) -- Video-game maker Blizzard Entertainment canceled one of its biggest projects on Thursday as part of a reorganization under new owner Microsoft Corp. that led to mass layoffs of 1,900 people, or 8% of the gaming division’s total staff. The cancelation of the game, codenamed Odyssey, left Blizzard employees reeling as some lost their jobs and others were left wondering about the future of the studio. Most Read from Bloomberg Musk Says First Neuralink Patient Received Implant in Brain Traders Line Up for ‘Once-in-a-Generation’ Emerging Markets Bet UPS to Cut 12,000 Jobs, Bring Workers in Five Days a Week Blackstone Is Building a $25 Billion Empire of Power-Hungry Data Centers Trump Cash Stockpile at Risk From $450 Million Dual Verdicts Microsoft announced the news in an email to employees early Thursday morning, and many members of the Odyssey team were subsequently informed that they were being let go. The news arrived three months after Microsoft closed the $69 billion acquisition of Activision Blizzard in the largest video-game deal in history. As part of the reorganization, Blizzard also parted ways with President Mike Ybarra and Chief Design Officer Allen Adham, one of the company’s co-founders. Blizzard said its new president will be announced next week. The maker of many hit games, including World of Warcraft and Diablo IV, has mostly focused on its large, existing franchises. But in recent years, the company made a big investment in Odyssey, building up a team of more than 100 people to develop it. The game, set in a new universe, was in development for more than six years and outlasted many other Blizzard incubation projects. Now, the future of such efforts outside of existing franchises is uncertain. In a statement, Blizzard spokesman Andrew Reynolds said the game’s development had ended “as part of a focus on projects that hold the most promise for future growth” and that the company would “move some of the people on the team to one of several exciting new projects Blizzard has in the early stages of development.” Odyssey started in 2017 as a pitch from Craig Amai, a Blizzard veteran who worked on World of Warcraft. It was conceived as a survival game, like Minecraft and Rust, but with more polish and fewer bugs. In subsequent years, the team working on the game expanded, and it was announced publicly in 2022 as the company began hiring more staff.Despite the additional resources, the project struggled largely due to technical issues surrounding the engine, or the suite of tools and technology that developers use to construct a game, according to people familiar with the process. Odyssey was originally prototyped on the popular Unreal Engine, from Epic Games Inc., but Blizzard executives decided to switch, in part, because it wouldn’t support their ambitions for vast maps supporting up to 100 players at once. Blizzard instead directed the Odyssey team to use Synapse, an internal engine that the company had originally developed for mobile games and envisioned as something that would be shared across many of its projects. But that led to significant problems as the technology was slow to coalesce, and Odyssey’s artists instead spent time prototyping content in the Unreal Engine that they knew would have to be discarded later, said the people. When the Microsoft acquisition was finalized, some Blizzard staff were hopeful that they might be able to switch back to Unreal Engine rather than trying to finish the game on Synapse. In an interview at BlizzCon in November, Ybarra said that their new parent company would offer them the freedom to use the technology of their choice without having to go through the board of directors as in the past. “The tech leaders will decide what the engines are,” he said. Despite the challenges, Odyssey appeared to be making progress. People who played early versions of the game enjoyed it and thought there was a lot of potential in the market for a survival game that hit Blizzard’s bar for quality. Still, Odyssey was years away from completion. At one point, Blizzard was looking to expand the team to hundreds of people in hopes of targeting a 2026 release, but even that seemed overly optimistic to some developers. Instead, the project was canceled as the company concluded that Synapse was not ready for production. “As difficult as making these decisions are, experimentation and risk taking are part of Blizzard’s history and the creative process,” spokesman Reynolds said. “Ideas make their way into other games or in some cases become games of their own. Starting something completely new is among the hardest things to do in gaming, and we’re immensely grateful to all of the talented people who supported the project.” Most Read from Bloomberg Businessweek There’s So Much Data Even Spies Are Struggling to Find Secrets Basketball, Basketball, Basketball: Inside Steve Ballmer’s New $2 Billion Arena How a Lucky Break Fueled Eli Lilly’s $600 Billion Weight-Loss Empire How to Handle the Dreaded Political Shop Talk at Work AI Needs So Much Power That Old Coal Plants Are Sticking Around ©2024 Bloomberg L.P. Related Quotes "
}