{
    "title": "The Right Way to AI",
    "date": "1/31/2024",
    "url": "https://www.microsoft.com/en-us/worklab/the-right-way-to-ai",
    "text": "Strategies What we’re learning about successful AI adoption from the companies getting it right. Illustration by Leonardo Betti Follow these steps to help with your AI rollout Download the checklist IIf 2023 was all about AI’s promise, 2024 will be all about the proof.f 2023 was all about AI’s promise, 2024 will be all about the proof. Organizations that have embraced generative AI are already seeing the benefits. According to our latest Work Trend Index, 70 percent of Microsoft Copilot users said that, after just three months, they were more productive, and 68 percent said it improved the quality of their work. And the most efficient Copilot users? They saved more than 10 hours a month. But these productivity gains only come when companies take an intentional and programmatic approach to their rollout. “Becoming an AI-powered organization doesn’t happen with the flip of a switch,” says Jared Spataro, Corporate Vice President of Modern Work and Business Applications at Microsoft. “AI is unlike any technology we’ve seen before, which means it requires a unique strategy to deploy and drive adoption. Organizations that take a thoughtful and deliberate approach are going to be the ones to reap the benefits of AI.” Here are five steps to nail your AI rollout—along with key lessons from companies leading the charge. Get your data house in order. What we’ve learned The magic of Copilot is its ability to reason over all the data and content in your organization—enabling it to deliver personalized, relevant, and actionable responses. It automatically inherits your existing Microsoft 365 data and security permissions, which makes it essential to have solid content management practices and data governance in place before rollout begins. Futurist Amy Webb advises leaders to ask their teams: “When was the last time you did a data audit?” If you want a future where you can get the full value of AI, she says, you need to shore up your internal infrastructure. Are all your confidential files labeled accordingly? You’ll want to make sure your data is labeled properly so only those who should have eyes on a file get access. What early adopters are getting right In the highly regulated financial services industry, security is a top priority. “We wanted to find an AI solution that could provide us with great time-saving benefits without making us feel like we were placing ourselves at unnecessary risk,” says Vicki Holman, a Collaboration Platform Owner at Hargreaves Lansdown, a UK-based financial services company. With Copilot for Microsoft 365, “we found a highly secure alternative to the AI solutions employees were using outside of our well-protected environment.” Because Copilot automatically inherits an organization’s security, compliance, and privacy policies for Microsoft 365, Holman and her colleagues felt confident that their new AI bet would safeguard their data. “We had peace of mind using Copilot because we’ve already got our Microsoft 365 E5 licenses, and we are quite mature in terms of the security and compliance we already have in place.” “To build an AI-powered organization, leaders need to help their teams embrace new mindsets and habits. Before starting any project, document, email, or presentation, first ask yourself: how can AI help me with this task?”  Be intentional about your rollout. What we’ve learned  To maximize the return on your AI investment, you’ll need to make sure that the first people who have access are the ones who will glean the most value. With Copilot, we’ve found that a three-pronged approach is most effective: Give the technology to entire teams within a specific business function, like customer service or sales. That way, they can share insights and learn from one another—multiplying the technology’s impact. Allocate remaining seats to a variety of roles and levels, from senior leaders to IT admins to project managers. We recommend that most seats go to non-executive employees. Define clear objectives for how each team will use the new technology, such as “reducing ticket volume” for customer service. This will help guide employees toward the most pressing business needs. What early adopters are getting right Multinational technology company Lumen Technologies first gave Copilot to its customer service, sales, and customer experience teams. The customer service team is using AI to surface relevant policies, summarize tickets, and access step-by-step repair instructions from manuals, while the sales and customer experience teams are using it to enrich customer interactions with additional depth and context. “Our people are seeing immediate productivity improvements with Copilot,” CEO Kate Johnson says, which ultimately helps them better serve their customers and makes it easier to do business with them. Identify champions to lead the way. What we’ve learned AI advocates are internal influencers: they show off exactly how Copilot can help in their day-to-day work and get work friends and colleagues excited to try it themselves (no #promocode needed). Ask managers to identify one power user from their team to be a representative and empower these advocates to lead internal trainings—like a Copilot 101 session for salespeople—and create quick video demos that can spread organically throughout the company. Another idea, from Wharton professor and AI expert Ethan Mollick: “I don’t think you’d be remiss as a leader of a large-scale Fortune 1000 company to take the top 20 percent most creative people in your company, require they all use AI for a week, and give a million-dollar prize to whoever comes up with the best way to automate parts of their job, all while promising you’re not going to fire anyone as a result of this.” Of course, that won’t be feasible for many companies. Another way to get started: task your internal champions with filming short, social media–style videos of their favorite ways to use AI in their work and share them with your people in regular email or Teams dispatches. What early adopters are getting right Our own early Copilot champions at Microsoft are discovering agile ways to share their skills—and their passion—across teams, quickly scaling AI habits and helping everyone learn. They’ve led virtual demo workshops, Ask Me Anything sessions, and Copilot tips Teams channels where they share favorite prompts. One of the most impactful initiatives to date? Function-specific training sessions, where each champion led an interactive training geared toward the day-to-day work in, say, marketing. “Grassroots champions have been a key to Copilot adoption,” says Daniel Vargas, a Senior Director of Product Marketing—and unofficial Copilot ambassador—at Microsoft. “When people embed AI into their daily work and share the things they’ve done with it, it helps others see the potential and inspires them to explore the technology for themselves.” Prioritize skilling. What we’ve learned  Without ongoing training, AI won’t make much of a difference to your bottom line. That’s why it’s vital to create—and maintain—virtual spaces for people to share tips, ask questions, and find resources. Organizations should encourage people to share their most powerful AI prompts with their teams, says A.J. Brush, a researcher on human-computer interaction and Partner Group Manager at Microsoft, who keeps a running list of her favorites that she gets from co-workers. (A good one she heard recently: “Go through my flagged emails and rank the top five in importance.”) Copilot Lab, our collection of prompt tips and prompt guidance, can help companies grow that muscle. What early adopters are getting right To get the most out of Copilot, Morula Health, a small business that provides regulatory medical writing services to the healthcare industry, has been building out its very own prompt library. Sharing great prompts helps the team save time as they use Copilot to keep action items on track, write first drafts of blogs, and redact documents. That process, says Philip Burridge, Morula’s Director of Operations and Strategy, “ensures sustained high-quality output, allowing us to seamlessly integrate technology without compromising consistency.” Help people build new work habits. What we’ve learned  To build an AI-powered organization, leaders need to help their teams embrace new mindsets and habits. Before starting any project, document, email, or presentation, first ask yourself: how can AI help me with this task? Working effectively with AI requires the ability to delegate, exercise good judgment, and apply subject-matter expertise—in other words, you need to think like a manager. You’ll also need to re-learn how to search. In our global survey of 18,100 people, respondents said they spend more time searching for information (27% of their day) than creating (24%), communicating (24%), or consuming it (25%). AI eases this pain by scanning your entire data universe—emails, meetings, chats, documents, and more, plus the web—to find what you’re looking for. What early adopters are getting right In the Crop Science division of Bayer, a global enterprise with a focus on healthcare and agriculture, researchers and data scientists can use a few key phrases in Copilot in Teams to quickly locate studies and predictive models elsewhere in the company. Via a customized Teams plugin, Copilot not only calls up the relevant models, it identifies who is responsible for the research—making it easier to connect with the expert source on a specific topic. In one instance, a researcher in the United States was working on a project that would require a significant amount of time to complete. By using Copilot to investigate other models being created at the company, the researcher identified a predictive model developed by a researcher in Germany, preventing a duplicate model from being developed. That saved two to three months of work—and sped up the time it took to get a solution to farmers. And at global ad agency dentsu, Copilot has changed workflows entirely. “Before, we would sit with a client in a room for an ideation session, we would come up with ideas together, we’d take that information, and days or weeks later we’d come back with creative visualizations of these ideas,” says James Thomas, Dentsu Creative’s Global Head of Technology. “With Copilot, we’ve already got visuals and draft ideas of what things could look like with the client in the room, which means we can get to the right idea faster.” AI can transform your organization, but only if you adopt it with intention and strategy. And while there’s no one-size-fits-all approach to getting it right, these insights can help guide leaders who want to get the most out of their AI investment. Stay in the AI know with WorkLab: Sign up for our biweekly newsletter to get the latest AI research, insights, and trends delivered straight to your inbox. Work Trend Index Special Report Interactive Quiz "
}