{
    "title": "As Microsoft becomes the world's most valuable company, this infographic \ndetails its increasingly diverse portfolio",
    "date": "1/16/2024",
    "url": "https://www.windowscentral.com/microsoft/as-microsoft-becomes-the-worlds-most-valuable-company-this-infographic-reveals-its-increasingly-diverse-portfolio",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Artificial intelligence drives Microsoft to new heights, as the smartphone market cools. Microsoft and Apple have been locked in a tussle for the top spot over the past few weeks, with both companies hovering around $2.8 trillion in market capitalization. As of writing, Microsoft just hit $2.9 trillion, as Apple's dips a little further on fears that the smartphone market may cool in the coming years. Apple had some good news of its own, however, with analysts revealing that sidestepped Samsung to become the #1 smartphone shipper of 2023, taking 23 per cent of the global market share to Samsung's 17 per cent. Samsung has lost significant ground in China, which was credited with its decline. Despite these wins, investors seem to be concerned that Apple is increasingly banking on its smartphone dominance, and hasn't yet found its way to the kind of diversification Microsoft enjoys. Microsoft is also riding a wave of artificial intelligence hype, buoyed further today by the reveal of its Copilot Pro subscription service, which could become an incredibly lucrative source of revenue for the service.  For a better idea of how Microsoft's portfolio looks, take a look at this infographic from EconomyApp from Twitter (X). Based on Microsoft's Q1 FY24, you can see just how increasingly diversified Microsoft's business operation looks, with platforms like Xbox, Windows, Office, LinkedIn, and Bing all seeing strong growth. This is also before Microsoft includes Activision-Blizzard into the mix, which will see revenues from Call of Duty, Candy Crush, and World of Warcraft factored in for the first time. It could make Xbox leapfrog Windows as a revenue stream for Microsoft, which would be a true sign of the times for the company. Indeed, the largest share of Microsoft's income sits within the Azure organization, which serves cloud solutions to creators and businesses of all shapes and sizes.  Platforms like Copilot stand to turbo-charge Microsoft's cloud business potentially, with Copilot AI baked into various products, from business solutions to domestic use cases straight into Windows or even Xbox. The Copilot subscription gives you priority access to more advanced language models and should increase the speed of the responses you get, but it remains to be seen just how much money Microsoft can extract from this potentially lucrative new business sector. Right now, Copilot and similar services like OpenAI ChatGPT cost hundreds of thousands of dollars per day to run, but it's not hard to see how they could become overnight success stories, baked into various products and services with subscription fees attached to it.  All of the major tech companies are looking for new sources of income in a rapidly changing world. Apple seems to be banking on VR with its expensive face computer the Vision Pro, alongside Meta. Both companies are investing billions in this area, yet investors increasingly seem to think that consumers don't want to wear a computer on their head. Hmm. Microsoft ditched large swaths of its own metaverse plays, from HoloLens to Windows Mixed Reality in recent years. Much of the engineering clout has flipped over to artificial intelligence instead, and so far, it looks as though it's paying dividends (literally). Whether it's all just hype or well and truly the industry-shaking innovation that Windows was back in the day remains to be seen, but at least for right now, it seems that investors are banking on \"yes.\" All the latest news, reviews, and guides for Windows and Xbox diehards. Jez Corden is a Managing Editor at Windows Central, focusing primarily on all things Xbox and gaming. Jez is known for breaking exclusive news and analysis as relates to the Microsoft ecosystem while being powered by tea. Follow on Twitter @JezCorden and listen to his XB2 Podcast, all about, you guessed it, Xbox! Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}