{
    "title": "Palantir Joined Amazon And Microsoft In Showing That AI Already Lived Up To \nThe Hype",
    "date": "2/13/2024",
    "url": "https://finance.yahoo.com/news/palantir-joined-amazon-microsoft-showing-180620124.html",
    "text": "Although much of the AI buzz has been somewhat saved for the magnificent seven, which are Microsoft Corporation (NASDAQ: MSFT), Amazon.com Inc (NASDAQ: AMZN), Apple Inc (NASDAQ: AAPL), Alphabet Inc (NASDAQ: GOOG)(NASDAQ: GOOGL), Meta Platforms (NASDAQ: META), Nvidia Corporation (NASDAQ: NVDA) and Tesla Inc (NASDAQ: TSLA), there are other companies successfully riding the wave. Last week, Palantir Technologies Inc (NYSE: PLTR) reported its fourth quarter earnings and it topped estimates fueled by AI demand that continues to be unrelenting in the U.S. For the quarter ended on December 31st, Palantir reported revenue grew 20% YoY to $608.4 million, topping LSEG’s estimate of $602.4 million. Net income grew from $30.9 million, or 1 cent per share Palantir earned in 2022’s comparable quarter to $93.4 million, or 4 cents per share. Adjusted earnings of 8 cents were in line with LSEG’s estimate. Palantir reported its customer base grew 35% YoY to 497 customers it served during the fourth quarter, showing it is enjoying a surging demand in the private sector whose customer count rose 44% annually. Therefore, Palantir showed it is successfully building its business outside its legacy government sector. What’s even more impressive is that Palantir used a low-cost mechanism to get customers into its pipeline. While Microsoft infused billions into OpenAI, with Amazon and Alphabet following suit by investing into Antrophic, Palantir tried to stand out with a unique lead generation strategy. By hosting almost 600 immersive seminars that it calls \"boot camps”, Palantir aimed to fuel interest in its AI platform as it gives attendees the opportunity to try out its software and understand the value of Palantir’s contribution in generative AI-drive use cases. In 2023 alone, Palantir successfully hosted over 500 of those boot camps with growth of its private sector software users showing they did a good job of luring them in. Palantir has delivered when it comes to profitability and it passed the test of consistency. Although its market cap of only $51 billion doesn’t place it in the basket tech mammoths like Microsoft, its latest jaw-dropping report had no shortage of impressive key performance indicators that sent its stock to the Moon as it rocketed by roughly 50% over the five trading days that followed its latest report. Like Microsoft and Amazon, Palantir showed what AI can do for business with expanding margins flowing to the bottom line, along with compounding cash flow. DISCLAIMER: This content is for informational purposes only. It is not intended as investing advice. This article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? MICROSOFT (MSFT): Free Stock Analysis Report This article Palantir Joined Amazon And Microsoft In Showing That AI Already Lived Up To The Hype originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}