{
    "title": "Microsoft Eyes High-Speed Wireless Network Inside Data Center",
    "date": "2/19/2024",
    "url": "https://www.datacenterknowledge.com/networks/microsoft-eyes-high-speed-wireless-network-inside-data-center",
    "text": "Data Center Knowledge is part of the Informa Tech Division of Informa PLC This site is operated by a business or businesses owned by Informa PLC and all copyright resides with them. Informa PLC's registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 8860726. Mike Dano | Feb 19, 2024 This article originally appeared in Light Reading Microsoft is looking to test a wireless network inside a data center that's located near the tech company's headquarters in Redmond, Washington. Related: Microsoft, Amazon-Backed Cloud Body in Talks Over EU Dispute In a recent FCC filing, Microsoft said it wants to \"explore the use of wireless communications... to supplement the wired communication links in data centers.\" When questioned about the filing by Light Reading, Microsoft declined to provide any further information. The company said it would use equipment from network-testing vendor Keysight Technologies for the tests. The FCC approved the company's test request in January. Related: Is Rear Rack Cooling Right For Your Data Center Operations? There are several interesting elements in Microsoft's proposal, including the use of spectrum in the 246GHz-275GHz range. That extremely highband spectrum has been pegged for use in possible future 6G networks. Such spectrum may be able to carry vast amounts of data, but broadcasts likely won't travel far due to the physics involved in transmissions in highband spectrum. Regardless, Microsoft believes this kind of \"sub THz\" spectrum would be suitable for use inside data centers. \"Sub THz links have several features that make them attractive for use in data centers,\" the company wrote in its FCC filing. \"First, highly directional beams achieved by large element antenna arrays allow coexistence of multiple communication links through spatial multiplexing; the short communication range of sub THz beams due to high atmospheric attenuation enhances spatial reuse. The directional antenna arrays enable setting up and tearing down of RF links on-demand. A large indoor operating environment and the ability to enhance the building walls to minimize RF propagation enables the establishment of wide-bandwidth high data rate links with minimum interference to potential outdoor deployments, promoting efficient spectrum sharing and coexistence.\" The company also mentioned free-space optical (FSO) technology in its filing. FSO uses light propagating in free space – rather than inside cables – to wirelessly transmit data. FSO isn't a new concept. The technology was first developed in the 1960s and several FSO companies in the early 2000s tried to position the technology as a good option for backhaul back when 3G networks were still being deployed. The topic has been revived in the 5G era. Further, Microsoft noted that FSO inside data centers has been studied before. \"However, these optical links exhibit poor performance in data centers due to the challenge of accurately pointing the optical beams in the presence of vibrations,\" the company wrote. \"We anticipate sub THz RF [radio frequency] will not suffer from alignment issues due to the relatively large and adjustable beam width. The ability to electronically steer the RF beam rapidly will also enable us to develop appropriate control loops to further mitigate challenges caused by equipment vibrations.\" Microsoft's interest in the communications inside data centers comes as no surprise. The company's capital expenses in the final quarter of last year reached $9.7 billion, an increase of 55% over the year-ago period. That spike is partly attributable to its investments into the high-performance computing necessary to run AI technology inside its Azure cloud data centers. As Light Reading has previously reported, those kinds of massive AI investments are also generating demand for new communications technologies inside data centers. At the heart of the issue is a need to connect all the GPUs (graphical processing units) that underpin the development of artificial intelligence. Vendors like Corning and Coherent are keen to sell their communications components to data center operators beefing up communications inside their data center operations. \"Following a torrid pace of leasing in 2023, Microsoft continues to be the most active leaser of data center capacity amongst the hyperscalers,\" wrote the financial analysts at TD Cowen in a recent note to investors, comparing Microsoft against other hyperscale companies like Amazon, Meta and Google. \"Furthermore, our checks indicate that the driver behind the [Microsoft's] heavy data center capex investment is its internal view that there is a clear pathway to monetizing AI via the integration of AI into both its existing product set and the launch of new AI products. This, coupled with its selection of an AI deployment architecture ahead of its hyperscale peers, has given Microsoft a notable head start in securing [data center] capacity vs. peers.\" Thus, it's possible that a renewed interest in extremely highband spectrum, coupled with investments in FSO technology, is driving Microsoft's interest in its new data center tests. That interest may also create challenges for companies like Cisco, Corning, and Coherent that are looking to sell optical hardware for high-speed communications inside data centers. More information about text formats Follow us: "
}