{
    "title": "Microsoft AI Tour highlights the transformative power of AI in India",
    "date": "2/9/2024",
    "url": "https://indianexpress.com/article/technology/artificial-intelligence/microsoft-ai-tour-india-satya-nadella-9153413/",
    "text": "Artificial Intelligence is truly touching the world. The industry is not just about companies fighting for dominance in the brand new world of generative AI. Big tech corporations like Microsoft are also working towards developing tools that can empower start-ups that are working towards public welfare. From creating tools that can assist scientists in managing and assessing data to AI that can teach students to AI assistants in hospitals to help medical professionals manage patients efficiently, Microsoft’s AI innovation seems to be the backbone of these new-age start-ups and their unique initiatives. At the Microsoft AI Tour held in Bengaluru, along with the CEO Satya Nadella’s insightful keynote, the company also demonstrated its AI capabilities in action. As part of the event, three companies that used Microsoft’s AI services for some groundbreaking innovations in the social sector displayed new possibilities for India. Microsoft is supporting the development of a voice-based generative AI application through its partnership with AI startup Sarvam AI. The company is working on making its Indic Voice large language model (LLM) available on Azure. Sarvam AI is building generative AI models with indic languages based in local contexts. With this, the company aims to make the development and deployment of generative AI tools across India more accessible and cost-effective for a variety of use cases. The start-up’s Indic voice LLM is intended to provide a natural voice-based interface to LLMs which is currently in Hindi. The company has plans to cover more Indian languages along with supporting colloquial use. During the demo session, the company showcased a video of a young student who is reluctant to do her routine studies. The student is later introduced to a Gen AI tool monikered Tuition Anna, which helps her learn in a language of her comfort. “Primarily, we are trying to build the Indic LLM layer which is supporting Indian languages and doing so efficiently. One of the things that we get asked is how India will use this technology, and if it has to be a voice-led interface, which means it has to be conversational, in real-time, and voice first. We typically tend to mix Hindi and English, it should work on mobile devices,” said Dr Pratyush Kumar, one of the co-founders of the start-up. Sarvam AI’s demo showcased the incredible potential of Indic LLM, which can be instrumental in a plethora of use cases for India. Indian multinational tech services company Persistent Systems is harnessing the power of Microsoft’s Azure OpenAI and Github Copilot. The company in partnership with Microsoft, recently released a cutting-edge generative AI-driven Population Health Management Solution. It focuses on social determinants of health, aiding in predicting care costs and addressing patients’ non-clinical needs. The innovation facilitates timely, quality care delivery, optimising resources and cost-effectiveness for healthcare entities. “We have 27 million cancer patients and over 70 million diabetes patients, and this number is growing. So we need an urgent way of focussing on this population and how uniquely they can be treated. We are a technology partner to some of the industry associations that are trying to create the datasets, collect data, digitise the data, and then enable it on a digital platform so that the researchers on the Indian population can access it easily,” said Pandurang Kamat, Chief Technology Officer, at Persistent Systems. According to Shreekanth Joshi, Vice President at Persistent, the company has developed a platform where one can pull all of the data together using Azure Cloud and Azure Infrastructure Data Services. The idea is to allow researchers to bring all of this patient data into the platform to figure out what kind of therapy is possible. “Indian data exists in silos, not brought together. To find cancer therapies, one needs to start with genomic data which is the biggest and most complex source. We have developed a platform using Azure to allow researchers to bring patient data together to figure out possible therapies,” said Joshi during the demo. One of the major highlights of the demo sessions was the 10bedICU programme, an initiative by Srikanth Nadhamuni with the support of the Open Healthcare Network (OHC). The OHC is an open-source community working to provide health care in settings with limited resources. The 10BedICU programme established ICUs in small-town government hospitals during Covid using the CARE platform. Over 200 10-Bed ICUs now operate across India, enabling specialist support and saving over 15,000 lives. Nadhamuni, the former Head of Technology at UID Authority of India, said that OHC is among the most active open-source communities in India. “The 10-bed ICU creates ICUs in rural government hospitals. I started this during the delta wave of Covid. We equip government hospitals at the sub-district level, which mostly lack ICUs. It cost us about Rs 50 lakh to create a 10-bed ICU with state-of-the-art equipment. We deployed our CARE software platform with over 400 OHC volunteers using GitHub Copilot,” said Nadhamuni, adding that Microsoft’s AI services have immensely helped their cause. Nadhamuni also demonstrated the TeleICU, which, according to him, has completely changed the game. The TeleICU enables doctors in medical colleges to assist patients through their cloud network. “We are in over 200 hospitals in nine states. In two years, we have covered about 23 per cent of India’s districts. We intend to cover every district of the country with critical care support,” said Nadhamuni. The developer demos presented at the Microsoft AI tour merely scratched the surface of the vast potential of AI in enhancing societal well-being. The showcased startups and initiatives further underscored Nadella’s vision of fostering equitable AI for the greater good.  Bijin Jose, an Assistant Editor at Indian Express Online in New Delhi, is a technology journalist with a portfolio spanning various prestigious publications. Starting as a citizen journalist with The Times of India in 2013, he transitioned through roles at India Today Digital and The Economic Times, before finding his niche at The Indian Express. With a BA in English from Maharaja Sayajirao University, Vadodara, and an MA in English Literature, Bijin's expertise extends from crime reporting to cultural features. With a keen interest in closely covering developments in artificial intelligence, Bijin provides nuanced perspectives on its implications for society and beyond.                        ... Read More Delhi Chief Minister Arvind Kejriwal's uncle, Girdhar Lal Bansal, speaks about his nephew's rise to power and his recent arrest. Locals in Kejriwal's ancestral village express disappointment with his lack of visits and the AAP's failure to make an impact in Haryana.    "
}