{
    "title": "Tech Titans Clash: Microsoft's OpenAI Investment Reshapes AI Market \nDynamics Alongside Google",
    "date": "2/20/2024",
    "url": "https://www.globalvillagespace.com/tech-titans-clash-microsofts-openai-investment-reshapes-ai-market-dynamics-alongside-google/",
    "text": "Microsoft's significant investment in OpenAI shapes the AI market landscape and web search dynamics while intensifying competition with Google, as advancements like Sora and Gemini 1.5 highlight the race for dominance in artificial intelligence. – OpenAI is backed by Microsoft, which hopes to increase presence in web search through ChatGPT. Google’s Chrome comes on top among web browsers with 64.4% share; Microsoft’s Bing has 3%, Edge at 5.3% – OpenAI has 34.2% share in AI market, much higher than Google’s 10%; its ChatGPT-4 has over 1 trillion parameters, more than Google’s PaLM with 540 billion parameters The competition between OpenAI and Google has intensified in recent months in the race for artificial intelligence (AI) as both companies roll out their next-generation AI models one after another. OpenAI announced Thursday its text-to-video AI model named Sora, while the research firm said it is teaching AI to understand and simulate the physical world in motion. Sora is an AI model that can create realistic and imaginative scenes from text instructions, and the company said its goal is to train models that can help people solve problems that require real-world interaction. In addition, Sora can generate videos up to a minute long while maintaining visual quality and adherence to its user’s prompt. Just the same day, Google introduced its new AI model called Gemini 1.5, almost two months after its initial release, which was formerly known as Bard — the major rival of OpenAI’s ChatGPT. Gemini 1.5 can dramatically enhance performance with a breakthrough in long-context understanding across modalities, according to the company. The latest model comes a week after the introduction of Gemini 1.0 Ultra, which Google said is the “most capable” one, adding it has significantly increased the amount of information the models can process, running up to one million tokens consistently and “achieving the longest context window of any large-scale foundation model yet.” Despite the increasing rivalry, the two companies can be considered neighbors since they are only 40 miles (64.4 kilometers) apart, both located in Silicon Valley — the global center of technological innovation located in the south of the San Francisco Bay Area in the state of California. Silicon Valley has been home to dozens of major technology, hardware, software and internet companies in the last four decades such as Apple, Intel, Nvidia, Cisco Systems, Meta (formerly Facebook), Google’s parent firm Alphabet and OpenAI, which is backed by Microsoft. Seattle-based Microsoft, located in the state of Washington, saw its market value surpass $3 trillion again on Jan. 26, overtaking Apple as the US’s most valuable publicly traded company by market capitalization. Microsoft had provided OpenAI with an initial investment of $1 billion in 2019 and announced in January 2023 that it was investing an additional $10 billion. As part of the deal, Microsoft will have a 75% share of OpenAI’s profits until it makes the money back on the investment, after which it would control a 49% stake in OpenAI. Having a stake will allow Microsoft to increase its presence in web search through OpenAI’s ChatGPT — the chatbot based on a large language model that enables users to refine a conversation towards a requested format, length, language and detail. The following month, Microsoft unveiled the new version of its search engine Bing with ChatGPT built-in running on GPT-4. This provides users with a ChatGPT-like experience within Microsoft’s search engine. Microsoft, in addition in early February 2023 unveiled a new version of its Edge web browser that includes built-in AI, which allows users to summarize search results with AI and converse with chatbots to get their questions answered. Bing’s market share, however, is around 3% among web browsers, and Microsoft hopes to turn it around with the use of ChatGPT and AI, while Edge had a market share of 5.3% as of January 2024. Google’s Chrome, meanwhile, comes on top among web browsers with a whopping 64.4% share, far higher than its closest follower, Apple’s Safari, which has almost 18.9%, according to independent web analytics company Statcounter. When it comes to global search engine market share, Google dominates that market with a staggering 91.5%, followed by Bing with just 3.4%, according to Statcounter. While search engines allow users to quickly find information and easily access them despite thousands of irrelevant web pages, companies that develop browsers can utilize them to gather users’ data and use it for advertising purposes for other firms. However, when it comes to the global AI market, OpenAI has a 34.2% market share in the AI category with 2,616 customers in 10 countries, according to data firm 6sense’s market share ranking index. Read More: Brazil Calls Gaza War “Holocaust”, Recalls Ambassador from Israel Google AI, on the other hand, has a 10% market share in the AI category with 764 customers in 10 countries. While Google plans to implement its AI technology soon into Google Cloud, Gmail and Docs, its two large language models — PaLM and LaMDA — have 540 billion and 137 billion parameters, respectively, compared to OpenAI’s GPT-3.5, which has 175 billion parameters. ChatGPT-4, however, boasts around 1.76 trillion parameters. Parameters can be described as learned variables that encode knowledge acquired by AI during its training process for it to make relevant predictions. Compared to search engines, Google trained LaMDA, or Language Models for Dialogue Applications, for it to converse with people naturally instead of getting multiple results for questions in search engines. PaLM, or Pathways Language Model, is advanced in reasoning tasks including code and math, classification and question answering, translation and multilingual proficiency. ChatGPT, on the other hand, can operate offline. But without access to the internet, it cannot check the input data with accurate sources. The New York Times in December sued both OpenAI and Microsoft for copyright infringement, claiming that the companies used millions of news articles published by the organization without permission to train ChatGPT and make it smarter. While Google’s AI has its source of information based on current data on the internet and displays links to web pages as its results, ChatGPT provides direct answers and summaries for users. Due to using current data, Google’s results are highly accurate most of the time, but ChatGPT may provide some outdated data and sometimes incorrect ones. Google’s AI has the upper hand in delivering instant results and customizing those based on users’ data and history. ChatGPT, on the other hand, can take some time to generate responses and there is no personalization for the answers.  "
}