{
    "title": "Deploying Copilot for Microsoft 365 Internally at Microsoft",
    "date": "2/5/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/deploying-copilot-for-microsoft-365-internally-at-microsoft/",
    "text": "How Microsoft does IT Feb 5, 2024\t\t\t\t\t  |  Lukas Velush We have deployed Copilot for Microsoft 365 to nearly all our employees and vendors at Microsoft. As Customer Zero, we are the first enterprise to do so at scale. As of this week, nearly everyone at the company has it. We’re seeing immediate and wide-ranging benefits. “Our employees are putting it to work for them right away,” says Claire Sisson, a principal group product manager in Microsoft Digital (MSD), the internal IT organization at Microsoft. “It immediately starts giving you smart insights that help you get on top of your work.” We’re pioneers in using AI in our products. We’re the first enterprise in the world to launch Copilot at scale, and we’re capturing a ton of insights. — Claire Sisson, principal group product manager, Microsoft Digital So, what is Copilot for Microsoft 365, exactly? It’s our new productivity solution that uses the power of AI and large language models (LLMs) to help us be more productive. It’s part of our Microsoft Copilot offering that creates a single, seamless user experience across Microsoft 365, Copilot in Windows, Bing, the Microsoft Cloud, and other Microsoft applications. Here at Microsoft, we got Copilot for Microsoft 365 early as part of our role as the company’s Customer Zero, which allows us to test our products at enterprise scale. “We’re pioneers in using AI in our products,” says Sisson, who is leading the rollout of Copilot for Microsoft 365 internally at Microsoft. “We’re the first enterprise in the world to launch Copilot at scale, and we’re capturing a ton of insights.” Sharing the feedback that we get from our early adopters is helping the company create the best possible version of Copilot for Microsoft 365 for our customers. “We’re learning so much,” Sisson says. “We’re learning how to deploy it at enterprise scale, how to make sure we put in the right protections for our employees and for Microsoft, and then ensuring our employees start using it in productive ways that reap all the new benefits of Copilot.” Copilot for Microsoft 365 gets its power from seamlessly integrating with data in Microsoft 365 Graph and the various Microsoft 365 applications and services that we all—our employees and our customers—use to get work done, including Word, Excel, PowerPoint, Outlook, and Teams. It helps you in numerous ways, ranging from summarizing action items from an important meeting, to helping you conduct on-the-spot analysis of data that has just come your way, to instantly crafting high quality content that helps you land an important project. “Its capacity to boost productivity and produce high quality work for our employees enables them to dedicate their attention to their core work and big aspirations,” Sisson says. “And frankly, that’s what’s happening—our employees are getting time back to work on the things they love, and that’s the high value work that drives this company forward.” [Learn how we’re getting the most out of generative AI at Microsoft with good governance. See how we’re responding to the AI revolution with an AI Center of Excellence. Check out how we’re embracing AI at Microsoft with new AI certifications. Find out how we’re enabling and securing Microsoft Teams meeting data retention at Microsoft.] We know that Copilot for Microsoft 365 is evolving day by day. As the company’s IT organization, we work to understand those changes, document them, and translate them into communications and readiness assets for our employees. As we work to build a better product, the speed of these cycles accelerates awareness and improvement. Each of the main Microsoft 365 applications has a Copilot that you can use. Here are some of the ways you can use Copilot in each of the apps: Copilot in Teams Microsoft 365 Chat Copilot in PowerPoint Copilot in Word Copilot in Excel Copilot in Outlook Copilot in Loop Copilot in Whiteboard “We’re constantly engaging our employees,” Sisson says. “Every application within Microsoft 365 has its own product team developing Copilot features and experiences. We’re working with these teams to provide valuable feedback, and while doing that, we, like our customers, benefit from the product getting better and better.” As the company’s Customer Zero, it’s our job to make sure that our products are human-centric, and that using them makes sense in consistent and coherent ways. Culture, religion, and political beliefs are a few considerations that we’re using to evaluate how Copilot for Microsoft 365 is working for and interacts with our employees. To help with this, Copilot is available in eight languages with a plan to add more shortly. “The level of complexity that we’re dealing with is very high,” Sisson says. “We’re capturing and responding to very diverse feedback from employees who are spread across the globe.” We also prioritize trust, security, and compliance. We’re working with the product teams, a broad set of regulatory bodies, and regional works’ councils to ensure that we’re looking out for the best interests of our employees and our company. “The true potential of Copilot for Microsoft 365 lies not just in its current capabilities but in its future possibilities,” Sisson says. By continuously integrating feedback, staying attuned to global best practices, and harnessing the latest in AI research, Copilot for Microsoft 365 is poised to redefine the boundaries of workplace productivity. One of the ways we provide valuable Customer Zero feedback to the product group is via our partnership with our works councils in the European Union. They’re currently helping us examine the regulatory and ethical boundaries for Copilot usage across the company. Our works councils and other employee representation groups are providing valuable feedback on how AI should work to augment human capabilities, not replace them. They’re evaluating our internal deployment and considering Copilot for Microsoft 365 use cases to ensure compliance with local laws as well as how AI can increase productivity and job satisfaction among their members. They’ve also provided critical insights that help us respect cultural nuances and ensure language accessibility. “Our strong relationship with our works council in Germany helped us get the approvals we needed to deploy Copilot quickly,” says Anna Kopp, director of business programs for MSD in Germany. “Because of our proactive outreach, our works council almost immediately moved into a state of ‘tolerance’ for Copilot—which basically means that they haven’t blessed it, but they’re not blocking it either.” It was about working together early and often. “We gave our works council members early access to Copilot for Microsoft 365 so they could test it and give feedback,” Kopp says. “Their feedback helped us improve the product in numerous ways, especially around potential uses for behavioral assessment, which is not allowed in Germany. Giving them early access enhanced trust and enabled them to help us improve the product for all our customers with works councils.” While AI technology has recently generated considerable attention and excitement, questions and concerns also exist. Our teams have strong governance measures in place that aim to protect our employees and the company while not getting in the way of our powerful new AI tools. We build trust and are transparent with our employees as part of adhering to our Responsible AI and governance guidelines and are committed to working with our global employees who are represented by labor unions and works councils. “It’s important that our employees—and the larger Copilot for Microsoft 365 user base—understand that we’re implementing AI as an enhancer and accelerator, not a replacer,” Sisson says. “Successful use of AI lies in helping humans make better decisions, not in replacing those decisions altogether.” We’ve done a lot of work to put strong governance measures in place here at Microsoft, and that early work is helping us to deploy Copilot for Microsoft 365 quickly. Three tips for accelerating works’ council reviews of Copilot for Microsoft 365: “Copilot for Microsoft 365 governance and compliance lies within the underlying data that it uses to deliver its insights and take action,” says David Johnson, the principal PM architect in MSD who leads our governance efforts. “The data discovery that Copilot does is built on a good data governance structure. We have strong permission systems in place that make sure our AI tools don’t share insights based on data that an employee shouldn’t have access to.” Johnson and his team are working with the Microsoft Copilot product teams to ensure that these data governance practices and standards are used across all Copilot deployments. This includes deploying governance measures—highlighted by our robust and matrixed labeling measures—designed to prevent oversharing of data, to educate employees on appropriate AI use cases, and to continually assess how Copilot uses our data and how we use the data that Copilot is serving up to us. “It’s all working together to create an environment where Copilot for Microsoft 365 can be a trusted, practical companion for productivity and empowerment for our employees,” Johnson says. Getting Copilot for Microsoft 365 in the hands of our employees is only the first step—now we want to get them to start using it in the flow of their work. It’s about showing them that they can use it to do more high-level work and have more impact by doing things for them like analyzing Excel data sets and creating PowerPoint presentations from Word documents. We use a robust, tried-and-true adoption approach built on the pillars of envisioning, where you build a strong plan for getting your employees to adopt a new product, on onboarding, where you launch your adoption effort, and on driving value, where you look to help your employees find value in your product.  Prompting Copilot for Microsoft 365 is the process of giving instructions or asking questions to Copilot in natural language. You can prompt Copilot by typing your request in the Copilot window. Copilot will then respond with relevant output, such as text, images, graphs, or actions. To prompt Copilot effectively, follow these best practices: In the end, the best way to get your employees to start using a new product like Copilot for Microsoft 365 is to show them how it can make their lives better. “Copilot represents a profound shift in how our employees are working,” says Stephan Kerametlian, a director for employee experience in MSD. “They’re seeing benefits immediately.” For starters, they’re now using natural language to unlock tools that have been right in front of them for a long time—they just didn’t know that they were there, or if they did, how to use them. “Most people only use a small fraction of the features built into Microsoft 365 apps,” Kerametlian says. “Copilot users don’t need to know precisely where a feature is in the app’s interface—they don’t even need to know that it’s there. They just have to imagine what they want to accomplish, and the Copilot will surface the feature for them.” As a result, our employees are discovering new and creative ways to work. Copilot for Microsoft 365 boosts our employees’ productivity by taking care of their mundane tasks and repetitive processes. “That lets them focus on ideation, creativity, and strategy, the tasks where they can genuinely add value,” Kerametlian says. It’s also upleveling our employees’ skill sets. “Talking to the Copilot using intuitive natural language interaction leads to easier discovery and accelerated learning,” Kerametlian says. “This makes our employees better at what they’re good at and helps them quickly become experts at what they’re learning. They can rapidly get comfortable with the handful of commands that help them learn the technology and boost their skill.” In truth, Kerametlian says, Copilot for Microsoft 365 is so powerful that it is unleashing a new era of employee creativity and productivity. “It’s such a natural thing to do, to ask it for help,” he says. “The more interesting thing will be to see what our employees do with it. We expect that we’re going to see some very creative, and surprising results.” The future vision for Copilot for Microsoft 365 is bright. The measure of a tool’s success isn’t just in its deployment but its adoption, utility, and the tangible impact it brings to everyday tasks. Our Customer Zero emphasis on capturing user feedback from internal teams and external customers will be instrumental in shaping how we grow into using Copilot for Microsoft 365 over time. “We’re committed to the evolution of Copilot for Microsoft 365 at Microsoft,” Sisson says. “As we move forward, our mission continues to be to facilitate a seamless, productive, and enriched work experience for our employees.” We’re charting a path where technology and human ingenuity converge through continuous feedback, rigorous refinement, and adherence to best practices. “We’re very excited about where we are right now,” Sisson says. “Copilot for Microsoft 365 isn’t just a tool for our employees to use—it’s a testament to the future of work, a future where technology augments human potential, empowering every individual to achieve more.” Here are some things to think about as you consider getting started with Copilot for Microsoft 365: If you want to learn more about Copilot and how to use it, you can check out the following resources: Learn how to get ready for Copilot for Microsoft 365 at your company. Want more information? Email us and include a link to this story and we’ll get back to you. Please share your feedback with us—take our survey and let us know what kind of content is most useful to you. Tags: AI governance, Copilot, Data and AI, generative AI, Microsoft 365 Mar 29, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tAngela Gamba The use of business applications in Microsoft Teams has become a strategic advantage for many organizations, as they can accelerate the digital transformation of all business areas, generating a high demand for the Information Technology (IT) team to make these applications available. While use of apps for Microsoft Teams can be daunting for IT Teams... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Our core system for managing our external workforce was showing its age in an increasingly demanding modern workplace environment—we needed to simplify our external staff management. Here at Microsoft, our large and diverse external, non-FTE workforce plays a vital role in our success. For us, external staff includes contractors, consultants, freelancers, and business guests who... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Microsoft runs on Microsoft technology. We are the proving ground for our products and when we say that software is enterprise-ready this means that we have already built it for and run it at scale in our own enterprise. We are in the business of building the future of technology. And more often than not,... Mar 25, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tInside Track staff Next-generation connectivity is enabling us to transform our internal enterprise network here at Microsoft. Deploying a more agile, secure, and effective network environment across Microsoft is empowering our employees to thrive in our new hybrid world. This article describes how we’re implementing this new network strategy, including goals, action areas, expected results, and a brief... Since generative AI exploded onto the scene, it’s been unleashing our employees’ creativity, unlocking their productivity, and up-leveling their skills. But we can fly into risky territory if we’re not careful. The key to protecting the company and our employees from the risks associated with AI is adopting proper governance measures based on rigorous data...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more The AI revolution is here, so what are you going to do about it? This question is for IT leaders, IT practitioners, and others out there who need to decide how your companies will respond to the onslaught of AI products and solutions that are coming your way. We had the same question here at...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more As an organization, we immediately saw that advanced AI was going to create opportunities for our employees to increase their reach and impact. We knew we needed to move quickly to help them get ready for the moment. Our response? We assembled an ambitious data and AI curriculum through Microsoft Viva Learning that draws from...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}