{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.thestatesman.com/business/microsoft-ends-week-with-3-125-tn-mcap-becomes-most-valuable-company-ever-1503268556.html",
    "text": " The company’s market value topped the previous record set by Apple, which reached $3.09 trillion in July. IANS | February 11, 2024 8:45 am Microsoft.(Photo:Twitter) Microsoft ended the week with a market capitalisation of $3.125 trillion, the highest for any company ever, Barron’s reported. The company’s market value topped the previous record set by Apple, which reached $3.09 trillion in July. Apple ended Friday with a market cap of $2.916 trillion. Microsoft is also the first U.S. company to close with a market cap greater than $3.1 trillion, Barron’s reported. Microsoft stock closed the week at $420.55. Over the past 12 months, its shares have soared 60 per cent, largely thanks to the enthusiasm about its artificial intelligence software.  Advertisement The company last month reported quarterly revenue and profit ahead of Wall Street’s forecasts, and the management made note of the company’s AI gains. “We’ve moved from talking about AI to applying AI at scale,” Microsoft CEO Satya Nadella said in a statement at the time. “By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector,” Nadella had said, Barron’s reported.  Advertisement Microsoft Chairman and CEO Satya Nadella on Tuesday welcomed Mustafa Suleyman as CEO of the company’s artificial intelligence (AI) venture. In a setback for Microsoft-backed OpenAI, the US Patent and Trademark Office (PTO) has refused to allow the Sam Altman-run company to register the word GPT (generative pre-trained transformer) as a trademark. It means that these services will not face new obligations, including a requirement to offer interoperability with other messaging services. Advertisement  PEOPLE'S PARLIAMENT, ALWAYS IN SESSION Address\r\n                                    The Statesman Net Private Limited\r\n                                    Statesman House, First Floor 148 Barakhamba Road\r\nNew Delhi – 110001\r\n(+91) (011) 41605781, 41605958 © 2023, thestatesman.com | All rights reserved "
}