{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.northwestgeorgianews.com/microsofts-1-billion-data-center-investment-in-floyd-county-will-reap-local-benefits-for-years/article_fb1ad26c-d80a-11ee-b608-1b771fd3b70a.html",
    "text": "     From October: Paul Englis, a community affairs manager at Microsoft, speaks to the Rome-Floyd County Development Authority about plans for a data center off Huffaker Road. The biggest business news for Floyd County, by far, in the past year was the announcement that Microsoft will invest $1 billion in a data center campus off Huffaker Road. The project encompasses a 347 acre property on Huffaker Road that Microsoft will purchase at $40,000 per acre. Javascript is required for you to be able to read premium content. Please enable it in your browser settings. A look inside one of Microsoft’s Azure data centers. Missy Kendrick A Microsoft data center in Cheyenne, Wyoming.  “Ratepayers and taxpayers should not foot the bill for this project.” Microsoft spokesman Paul Englis   Please log in, or sign up for a new account and purchase a subscription to read or post comments. We have used your information to see if you have a subscription with us, but did not find one. Please use the button below to verify an existing account or to purchase a new subscription. Your current subscription does not provide access to this content. Please use the button below to manage your account. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: Ensure your press release runs prominently on our website and in our E-mail Newsletter. Guaranteed  placement on these platforms is $25. Note: All submissions will go through our editorial approval process before being posted.        Account processing issue - the email address may already exist Would you like to receive our daily news in your inbox? Signup today!  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}