{
    "title": "Nvidia, Meta, Microsoft And Amazon Among Dan Niles' Top Picks For 2024 Amid \nAI Bubble Concerns: 'We Have A Lot ...",
    "date": "3/3/2024",
    "url": "https://www.tradingview.com/news/benzinga:c3a37555b094b:0-nvidia-meta-microsoft-and-amazon-among-dan-niles-top-picks-for-2024-amid-ai-bubble-concerns-we-have-a-lot-more-room-to-go/",
    "text": "Dan Niles, prominent hedge fund manager and Satori Fund founder disclosed his top stock picks for 2024. His choices are Nvidia Corp NVDA, Meta Platforms Inc META, Microsoft Corp MSFT, and Amazon.com Inc AMZN. What Happened: Niles believes that the earnings potential of these companies will drive their stock performance in 2024, reported CNBC on Sunday. Niles pointed out that the recent surge in stock prices for big tech firms was not due to their earnings but rather the Federal Reserve’s policies. He anticipates a shift this year, where earnings will play a more significant role in stock market performance. Despite negative estimate revisions for Apple Inc AAPL, Tesla Inc TSLA, and Alphabet Inc GOOGL, Niles’ four picks continue to see analysts raise forecasts. Analysts have raised EPS expectations for the four stocks by an average of 50% since the end of last year. In contrast, estimates have remained nearly flat for Google, Tesla, and Apple. This trend has resulted in substantial stock price increases for Nvidia, Meta, Microsoft, and Amazon. \"There's no way you can say this is a bubble from a valuation perspective, or from a time perspective, because it took five years for that internet bubble to build, and we're only one year and a quarter into the ‘AI bubble' if you want to call it so,\" Niles added. \"I think we have a lot more room to go.\" See Also: Up By 68.5%, Shiba Inu Rises To New Heights, As Investors Watch Inflows Explode Why It Matters: The rise of Nvidia, Meta, Microsoft, and Amazon is not coincidental. Meta’s investment in Nvidia’s AI chips is set to reshape the tech landscape, making Nvidia a leader in AI chip production. This investment, led by Meta’s Chief Scientist Yann LeCun, highlights the crucial role of GPUs in advancing AI. Furthermore, Nvidia’s stock has recently surpassed Tesla’s as the most popular among retail investors, indicating a significant shift in investor sentiment. This shift is notable as Nvidia’s stock has surged by 60% year-to-date, while Tesla’s has seen an 18% decline. On the other hand, Amazon has seen a different trend, with financial giants making a bearish move on the company. Analysis of Amazon’s options history revealed that 33% of traders were bullish, while 66% showed bearish tendencies. This trend might explain the relatively flat EPS estimates for Amazon compared to the significant increases for the other three companies. Microsoft’s AI technologies are also playing a significant role in the market. Microsoft recently expanded the availability of Copilot to all users, bringing the power of AI to Windows 11 and Windows 10 users. Microsoft’s use of its partnership with OpenAI, using its ChatGPT and Dall-E technologies, has brought generative AI features to Windows users. Read Next: Bitcoin Shines, Dogecoin Sparkles, Dogwifhat Skyrockets: The Week In Retrospect Photo by Pixels Hunter on Shutterstock Engineered by Benzinga Neuro, Edited by Pooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}