{
    "title": "Microsoft Stock Has 17% Upside, According to 1 Wall Street Analyst",
    "date": "3/2/2024",
    "url": "https://www.fool.com/investing/2024/03/02/microsoft-stock-17-upside-wall-street-analyst/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Microsoft (MSFT -0.17%) is getting a lot of attention because it has emerged as a leading player in the artificial intelligence (AI) market. However, the company's advertising opportunity might be underestimated, according to analysts at Barclays. On Wednesday, the firm maintained an \"overweight\" (buy) rating on the shares with a $475 price target, representing about 17% upside from the current share price of $407. Microsoft's Bing search engine is gaining market share from Alphabet's Google. This is translating to growing revenue, but it's just getting started, according to the analysts. Barclays argues that Microsoft could eventually rake in $50 billion in ad revenue across search, LinkedIn, and ad technology, which would represent less than a quarter of the company's annual revenue. By comparison, Google's ad revenue totaled $65 billion last year. Microsoft will need to invest more in distributing its Bing search engine to capture the opportunity, according to Barclays, but Bing is already seeing momentum after releasing new AI features last year. In January, Microsoft said users had created 5 billion images and chats with the new features powered by generative AI. That is a huge increase from the 1 billion chats created through July. AI is fueling growth for Microsoft in more areas than just the Azure enterprise cloud business. Management previously said it is \"reshaping daily search and web habits\" with its AI-powered Copilot feature. That statement suggests it has Google in its crosshairs. If Microsoft continues to gain share of search, it would just provide another growth avenue to boost the stock over the next decade. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. John Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends Barclays Plc and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}