{
    "title": "Caesars Entertainment, Inc. (NASDAQ:CZR) Sees Significant Growth in Short \nInterest",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-czr-options-data-report-2024-03-18/",
    "text": "Caesars Entertainment, Inc. (NASDAQ:CZR - Get Free Report) saw a large growth in short interest in February. As of February 29th, there was short interest totalling 8,670,000 shares, a growth of 13.9% from the February 14th total of 7,610,000 shares. Based on an average trading volume of 3,390,000 shares, the days-to-cover ratio is presently 2.6 days. Hedge funds and other institutional investors have recently bought and sold shares of the company. Vanguard Group Inc. boosted its stake in shares of Caesars Entertainment by 0.6% during the fourth quarter. Vanguard Group Inc. now owns 23,559,890 shares of the company's stock valued at $1,104,488,000 after purchasing an additional 148,034 shares during the period. BlackRock Inc. boosted its stake in shares of Caesars Entertainment by 3.9% during the first quarter. BlackRock Inc. now owns 18,038,618 shares of the company's stock valued at $880,465,000 after purchasing an additional 676,512 shares during the period. Capital World Investors boosted its stake in shares of Caesars Entertainment by 9.1% during the fourth quarter. Capital World Investors now owns 11,024,448 shares of the company's stock valued at $516,826,000 after purchasing an additional 916,282 shares during the period. Point Break Capital Management LLC boosted its stake in shares of Caesars Entertainment by 10.3% during the first quarter. Point Break Capital Management LLC now owns 10,617,833 shares of the company's stock valued at $821,396,000 after purchasing an additional 987,230 shares during the period. Finally, State Street Corp boosted its stake in shares of Caesars Entertainment by 4.4% during the second quarter. State Street Corp now owns 7,883,415 shares of the company's stock valued at $401,818,000 after purchasing an additional 329,604 shares during the period. Hedge funds and other institutional investors own 91.32% of the company's stock. Several analysts have recently weighed in on the stock. JPMorgan Chase & Co. lowered their price objective on shares of Caesars Entertainment from $55.00 to $54.00 and set an \"overweight\" rating for the company in a research note on Tuesday, January 9th. Deutsche Bank Aktiengesellschaft lifted their price target on shares of Caesars Entertainment from $60.00 to $62.00 and gave the company a \"buy\" rating in a research report on Thursday, February 22nd. JMP Securities reissued a \"market outperform\" rating and issued a $65.00 price target on shares of Caesars Entertainment in a research report on Wednesday, February 21st. Stifel Nicolaus reduced their price target on shares of Caesars Entertainment from $70.00 to $67.00 and set a \"buy\" rating for the company in a research report on Thursday, January 18th. Finally, Susquehanna reduced their price target on shares of Caesars Entertainment from $49.00 to $44.00 and set a \"neutral\" rating for the company in a research report on Wednesday, February 21st. Five research analysts have rated the stock with a hold rating and seven have issued a buy rating to the company's stock. Based on data from MarketBeat, Caesars Entertainment currently has an average rating of \"Moderate Buy\" and an average target price of $58.36. View Our Latest Research Report on CZR Shares of CZR traded up $0.66 during midday trading on Monday, hitting $39.83. 2,768,388 shares of the company traded hands, compared to its average volume of 3,283,431. The stock has a 50-day moving average of $43.20 and a 200-day moving average of $45.04. Caesars Entertainment has a one year low of $38.33 and a one year high of $60.27. The firm has a market cap of $8.62 billion, a P/E ratio of 10.97 and a beta of 2.81. The company has a debt-to-equity ratio of 2.59, a current ratio of 0.76 and a quick ratio of 0.74. Caesars Entertainment (NASDAQ:CZR - Get Free Report) last issued its quarterly earnings data on Tuesday, February 20th. The company reported ($0.34) EPS for the quarter, missing the consensus estimate of ($0.03) by ($0.31). Caesars Entertainment had a return on equity of 4.48% and a net margin of 6.82%. The business had revenue of $2.83 billion for the quarter, compared to analysts' expectations of $2.85 billion. During the same period in the previous year, the firm posted ($0.11) EPS. The firm's revenue for the quarter was up .1% compared to the same quarter last year. As a group, sell-side analysts predict that Caesars Entertainment will post 1.11 EPS for the current fiscal year. Caesars Entertainment, Inc operates as a gaming and hospitality company. The company owns, leases, or manages domestic properties in 18 states with slot machines, video lottery terminals and e-tables, and hotel rooms, as well as table games, including poker. It also operates and conducts retail and online sports wagering across 31 jurisdictions in North America and operates iGaming in five jurisdictions in North America; sports betting from our retail and online sportsbooks; and other games, such as keno.See AlsoFive stocks we like better than Caesars EntertainmentDo ETFs Pay Dividends? What You Need to KnowWalmart: Here’s Your Chance to Get in Cheaper in 2024Conference Calls and Individual InvestorsInsider Selling of Amazon Spikes in Q1, but it's Not Time to SellHow to Calculate Retirement Income: MarketBeat’s Calculator2 Deep Value, High Yield Stocks With a Double-Digit Upside Before you consider Caesars Entertainment, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Caesars Entertainment wasn't on the list. While Caesars Entertainment currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here As the AI market heats up, investors who have a vision for artificial intelligence have the potential to see real returns. Learn about the industry as a whole as well as seven companies that are getting work done with the power of AI. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}