{
    "title": "Microsoft to invest £2.5bn in UK to boost AI plans",
    "date": "3/28/2024",
    "url": "https://ca.movies.yahoo.com/microsoft-invest-2-5bn-uk-143004968.html",
    "text": "Microsoft has unveiled plans to invest £2.5 billion over the next three years to expand datacentres for artificial intelligence (AI) across the UK. Prime Minister Rishi Sunak hailed the move as “a turning point for the future of AI infrastructure and development in the UK”. The tech giant said it is committing to more than double the footprint of its UK datacentres. This will involve bringing more than 20,000 advanced graphics processing units (GPUs), which are used for machine learning and the development of AI models, to the UK by 2026. BREAKING NEWS 🚨 £2.5bn investment in UK AI infrastructure by @Microsoft. Powering the discovery of new drugs & tackling global challenges such as climate change by connecting research centres with high performance computing. pic.twitter.com/Td8VimoNSf — HM Treasury (@hmtreasury) November 30, 2023 Microsoft said it plans to expand sites in London and Cardiff, and is also looking at a “potential expansion into northern England”. The US firm said the investment will help with training “more than one million people for the AI economy”, while it also pledged to support AI safety and research efforts alongside the Government and universities. Microsoft vice chairman and president Brad Smith said: “Microsoft is committed as a company to ensuring that the UK as a country has world-leading AI infrastructure, easy access to the skills people need, and broad protections for safety and security.” Mr Sunak said: “The UK started the global conversation on AI earlier this month, and Microsoft’s historic investment is further evidence of the leading role we continue to play in expanding the frontiers of AI to harness its economic and scientific benefits.” Microsoft UK chief executive officer Clare Barclay said: “The pace of change in AI demands action today to build a prosperous future for the UK tomorrow. “Today marks the single largest investment in our more than 40-year history in the UK.” It comes months after Microsoft criticised UK regulators and lobbied the Government earlier this year after its proposed deal to buy computer games giant Activision Blizzard was blocked. However, the Competition and Markets Authority later approved the the case after Microsoft came back with changes. A man suspected of using guns and explosives to hold four people hostage in a Dutch cafe was detained by police on Saturday, after a dramatic hours-long standoff that involved scores of armed police and a remote-controlled robot. WASHINGTON (AP) — As Donald Trump campaigns on promises of mass deportations and pardons for those convicted in the Jan. 6, 2021, riot at the Capitol, his ideas are being met with little pushback and some enthusiasm by a new era of Republicans in Congress. It’s a shift from the first time around when the presumptive Republican presidential nominee encountered early skepticism and, once in a while, the uproar of condemnation. Rather than being dismissed as campaign bluster or Trump speaking his m  Follow the latest updates from St James' Park as the Premier League returns From the outside, Johannesburg does not look like it is doing well. Nearly four in five NASUWT teacher members in England said they do not support moving to a national statutory ballot for industrial action.  Exclusive: Senior officers tried to set up a food bank for recruits as figures reveal scale of police food poverty The siblings, 34, posted several videos on TikTok Friday Investigator footage provided glimpses from inside the Dali cargo ship that collided with the Francis Scott Bridge in Baltimore on Tuesday, March 24, causing it to collapse.The footage, filmed by the National Transport Safety Board (NTSB) on March 28 and released a day later, shows investigators inspecting the damage from inside the container vessel. The NTSB said those aboard downloaded the voyage data from the ship.NTSB chair Jennifer Homendy previously told NBC that the investigation could take up to two years to complete. Credit: NTSB via Storyful  Follow all the live action from the 2024 Boat Race in the blog below With March Madness in full swing, you may have seen a funny AT&T commercial that showcases Kendrick Perkins, Carmelo Anthony, and TJ Ford, players from the 2003 NBA Draft. In partnership with AT&T, Perk took some time out of his hectic schedule to ... Spurs welcome the Hatters to town looking to get back on track  Tesla is the worst S&P 500 stock in 2024 as analysts slash earnings estimates. China EV giant BYD is ramping up a price war. LMPD: Man shot several times in The Highlands area following vehicle crash, argument Inconsistent Blues hope to enjoy home comforts against relegation contenders  Meteorologist Taylor Cox shows calmer wind today, but breezy for tomorrow, then storms on Monday. The Blues look to extend a strong run at Stamford Bridge The enigmatic masked trio from Melbourne hypnotise with a psychedelic fusion of Aussie surf rock and traditional Indian music  \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" As Germany authorises the consumption and cultivation of cannabis from 1 April, the mayor of Strasbourg is calling for the introduction of a local 'experiment' to move away from France's repressive approach to marijuana. According to Mayor Jeanne Barseghian: \"In a shared catchment area, we are going to have two different sets of regulations, almost diametrically opposed, between Germany, which authorises the recreational use of cannabis, and France, which has one of the most repressive sets of l The Emmy nominee tells PEOPLE she and the actor \"have a very lovely friendship\" that feels like \"we've known each other for many lifetimes\" "
}