{
    "title": "Adobe Inc. (NASDAQ:ADBE) Shares Acquired by Brookstone Capital Management",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-adbe-sec-filing-2024-03-22/",
    "text": "Brookstone Capital Management boosted its position in Adobe Inc. (NASDAQ:ADBE - Free Report) by 64.0% in the fourth quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The fund owned 9,682 shares of the software company's stock after buying an additional 3,778 shares during the quarter. Brookstone Capital Management's holdings in Adobe were worth $5,776,000 as of its most recent filing with the Securities and Exchange Commission (SEC). Other large investors have also bought and sold shares of the company. Rockland Trust Co. boosted its stake in Adobe by 4.1% during the third quarter. Rockland Trust Co. now owns 1,106 shares of the software company's stock valued at $564,000 after buying an additional 44 shares during the period. Team Hewins LLC bought a new stake in Adobe during the third quarter worth about $4,141,000. Guinness Asset Management LTD lifted its stake in Adobe by 5.9% during the third quarter. Guinness Asset Management LTD now owns 44,586 shares of the software company's stock worth $22,734,000 after purchasing an additional 2,499 shares during the last quarter. Dynamic Advisor Solutions LLC lifted its stake in Adobe by 23.9% during the third quarter. Dynamic Advisor Solutions LLC now owns 8,992 shares of the software company's stock worth $4,585,000 after purchasing an additional 1,732 shares during the last quarter. Finally, Kranot Hishtalmut Le Morim Tichoniim Havera Menahelet LTD lifted its stake in shares of Adobe by 36.7% in the 3rd quarter. Kranot Hishtalmut Le Morim Tichoniim Havera Menahelet LTD now owns 6,969 shares of the software company's stock valued at $3,544,000 after acquiring an additional 1,871 shares during the last quarter. 80.00% of the stock is owned by hedge funds and other institutional investors. In related news, CAO Mark S. Garfield sold 84 shares of Adobe stock in a transaction that occurred on Wednesday, January 17th. The shares were sold at an average price of $591.99, for a total transaction of $49,727.16. Following the transaction, the chief accounting officer now directly owns 4,055 shares of the company's stock, valued at $2,400,519.45. The sale was disclosed in a filing with the SEC, which is accessible through this link. In other Adobe news, insider David Wadhwani sold 6,099 shares of Adobe stock in a transaction on Wednesday, January 3rd. The shares were sold at an average price of $571.77, for a total value of $3,487,225.23. Following the transaction, the insider now directly owns 7,614 shares of the company's stock, valued at $4,353,456.78. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. Also, CAO Mark S. Garfield sold 84 shares of Adobe stock in a transaction on Wednesday, January 17th. The stock was sold at an average price of $591.99, for a total transaction of $49,727.16. Following the completion of the transaction, the chief accounting officer now directly owns 4,055 shares in the company, valued at $2,400,519.45. The disclosure for this sale can be found here. Insiders have sold a total of 9,162 shares of company stock valued at $5,340,250 over the last ninety days. 0.15% of the stock is owned by company insiders. Shares of Adobe stock traded down $11.73 on Friday, hitting $499.52. 5,410,426 shares of the company traded hands, compared to its average volume of 3,672,711. The stock's 50 day moving average price is $578.91 and its 200-day moving average price is $572.63. The company has a current ratio of 1.05, a quick ratio of 1.34 and a debt-to-equity ratio of 0.14. Adobe Inc. has a 52 week low of $331.89 and a 52 week high of $638.25. The company has a market cap of $226.06 billion, a PE ratio of 47.80, a PEG ratio of 2.81 and a beta of 1.29. Adobe (NASDAQ:ADBE - Get Free Report) last posted its quarterly earnings results on Thursday, March 14th. The software company reported $4.48 earnings per share for the quarter, beating the consensus estimate of $4.38 by $0.10. Adobe had a net margin of 24.08% and a return on equity of 39.12%. The firm had revenue of $5.18 billion during the quarter, compared to the consensus estimate of $5.14 billion. During the same quarter in the previous year, the firm posted $2.97 earnings per share. The company's revenue was up 11.3% on a year-over-year basis. Equities research analysts predict that Adobe Inc. will post 14.57 EPS for the current year. Adobe announced that its board has approved a stock buyback program on Thursday, March 14th that authorizes the company to buyback $25.00 billion in shares. This buyback authorization authorizes the software company to purchase up to 10.8% of its stock through open market purchases. Stock buyback programs are typically a sign that the company's management believes its stock is undervalued. A number of equities research analysts have recently weighed in on ADBE shares. Piper Sandler Companies lowered their target price on Adobe from $705.00 to $700.00 and set an \"overweight\" rating for the company in a research note on Friday, March 15th. Evercore ISI reduced their target price on Adobe from $700.00 to $650.00 and set an \"outperform\" rating on the stock in a report on Friday, March 15th. HSBC cut their price target on Adobe from $557.00 to $511.00 and set a \"hold\" rating on the stock in a research note on Friday, March 15th. JPMorgan Chase & Co. lowered their price objective on Adobe from $600.00 to $570.00 and set a \"neutral\" rating on the stock in a research report on Friday, March 15th. Finally, UBS Group lowered their price objective on Adobe from $600.00 to $540.00 and set a \"neutral\" rating on the stock in a research report on Friday, March 15th. Two analysts have rated the stock with a sell rating, five have assigned a hold rating and twenty-one have issued a buy rating to the company's stock. Based on data from MarketBeat, the company has an average rating of \"Moderate Buy\" and a consensus price target of $620.72. Read Our Latest Report on ADBE Adobe Inc, together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform.Further ReadingFive stocks we like better than Adobe3 Warren Buffett Stocks to Buy NowKB Home: Building on Strong Foundations During Volatile TimesWhat is a buyback in stocks? A comprehensive guide for investorsNike Stock and the 30% Rally That's ExpectedHow to Use High Beta Stocks to Maximize Your Investing ProfitsHeadwinds for Darden Restaurants are an Opportunity For Investors  Before you consider Adobe, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Adobe wasn't on the list. While Adobe currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat's analysts have just released their top five short plays for April 2024. Learn which stocks have the most short interest and how to trade them. Click the link below to see which companies made the list. Marc Chaikin shares insights on AI investing: uncovering picks outside of Nvidia, avoiding pitfalls, and how to make strategic moves. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}