{
    "title": "Microsoft Co. (NASDAQ:MSFT) Position Increased by Affinity Wealth \nManagement LLC",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/microsoft-co-nasdaqmsft-position-increased-by-affinity-wealth-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Affinity Wealth Management LLC lifted its position in shares of  Microsoft Co. (NASDAQ:MSFT – Free Report) by 2.7% in the 4th quarter, Holdings Channel reports. The fund owned 33,338 shares of the software giant’s stock after buying an additional 882 shares during the period. Microsoft comprises  2.6% of Affinity Wealth Management LLC’s investment portfolio, making the stock its 14th biggest holding. Affinity Wealth Management LLC’s holdings in Microsoft were worth $12,537,000 at the end of the most recent quarter. Other institutional investors have also modified their holdings of the company. Cadian Capital Management LP grew its position in shares of  Microsoft by 15.1% during the second quarter. Cadian Capital Management LP now owns 107,000 shares of the software giant’s stock worth $36,438,000 after acquiring an additional 14,000 shares during the last quarter.  Gunderson Capital Management Inc. grew its position in  Microsoft by 0.7% in the 4th quarter. Gunderson Capital Management Inc. now owns 24,887 shares of the software giant’s stock valued at $9,359,000 after buying an additional 185 shares in the last quarter.  C M Bidwell & Associates Ltd. grew its position in  Microsoft by 5.2% in the 2nd quarter. C M Bidwell & Associates Ltd. now owns 5,075 shares of the software giant’s stock valued at $1,728,000 after buying an additional 253 shares in the last quarter.  Geneos Wealth Management Inc. grew its position in  Microsoft by 4.1% in the 3rd quarter. Geneos Wealth Management Inc. now owns 82,267 shares of the software giant’s stock valued at $25,976,000 after buying an additional 3,209 shares in the last quarter.  Finally, HS Management Partners LLC grew its position in  Microsoft by 18.0% in the 3rd quarter. HS Management Partners LLC now owns 298,208 shares of the software giant’s stock valued at $94,159,000 after buying an additional 45,560 shares in the last quarter. Institutional investors own  71.13% of the company’s stock. A number of equities analysts recently issued reports on MSFT shares. Raymond James increased their target price on shares of Microsoft from $400.00 to $450.00 and gave the company an “outperform” rating in a research report on Wednesday, January 31st. Piper Sandler  reiterated an “overweight” rating and issued a $455.00 target price on shares of Microsoft in a research report on Thursday, January 25th. KeyCorp started coverage on shares of Microsoft in a research report on Thursday, March 21st. They issued an “overweight” rating and a $490.00 target price for the company. Macquarie upped their price target on shares of Microsoft from $430.00 to $450.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Finally, Argus upped their price target on shares of Microsoft from $390.00 to $430.00 and gave the company a “buy” rating in a report on Tuesday, December 5th. Four investment analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the stock. According to MarketBeat, Microsoft currently has a consensus rating of “Moderate Buy” and a consensus price target of $423.34. Check Out Our Latest Research Report on Microsoft Shares of MSFT stock opened at $420.72 on Friday. Microsoft Co. has a 12 month low of $275.37 and a 12 month high of $430.82. The company has a quick ratio of 1.20, a current ratio of 1.22 and a debt-to-equity ratio of 0.19. The business’s 50 day moving average is $410.82 and its two-hundred day moving average is $374.31. The company has a market cap of $3.13 trillion, a PE ratio of 38.04, a price-to-earnings-growth ratio of 2.24 and a beta of 0.89. Microsoft (NASDAQ:MSFT – Get Free Report) last announced its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, beating the consensus estimate of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The company had revenue of $62.02 billion for the quarter, compared to the consensus estimate of $61.14 billion. During the same quarter last year, the company posted $2.32 earnings per share. The company’s revenue for the quarter was up 17.6% compared to the same quarter last year.  Equities analysts predict that  Microsoft Co. will post 11.63 EPS for the current year. The business also recently declared a quarterly dividend, which will be paid on Thursday, June 13th. Shareholders of record on Thursday, May 16th will be issued a dividend of $0.75 per share. The ex-dividend date of this dividend is Wednesday, May 15th. This represents a $3.00 annualized dividend and a yield of 0.71%. Microsoft’s dividend payout ratio (DPR) is presently 27.12%. In other news, insider Bradford L. Smith sold 45,000 shares of the firm’s stock in a transaction on Friday, February 2nd. The shares were sold at an average price of $411.78, for a total value of $18,530,100.00. Following the sale, the insider now owns 574,129 shares in the company, valued at $236,414,839.62. The sale was disclosed in a filing with the SEC, which is available at this hyperlink. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of the firm’s stock in a transaction on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total value of $1,950,000.00. Following the sale, the insider now owns 11,677,398 shares in the company, valued at $22,770,926.10. The sale was disclosed in a filing with the SEC, which is available at this hyperlink. Also, insider Bradford L. Smith sold 45,000 shares of the firm’s stock in a transaction on Friday, February 2nd. The stock was sold at an average price of $411.78, for a total transaction of $18,530,100.00. Following the completion of the sale, the insider now owns 574,129 shares in the company, valued at approximately $236,414,839.62. The disclosure for this sale can be found here. Insiders have sold a total of 1,070,258 shares of company stock worth $30,690,456 over the last 90 days. Insiders own  0.03% of the company’s stock. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Capstone Wealth Management Group LLC Decreases Stake in Microsoft Co. (NASDAQ:MSFT) Microsoft Co. (NASDAQ:MSFT) is Asio Capital LLC’s 6th Largest Position "
}