{
    "title": "Microsoft's complicated partnership with OpenAI concerns insiders claiming \nit's become \"a glorified IT department for ...",
    "date": "3/13/2024",
    "url": "https://sg.news.yahoo.com/microsofts-complicated-partnership-openai-concerns-160506289.html",
    "text": "In the past few years, Microsoft has worked closely with OpenAI to further its advances in the generative AI landscape across its products and services, especially after making a multi-billion investment. Microsoft Insiders recently lodged complaints citing that the tech giant is leaning on OpenAI for its AI advances, seemingly turning it into a \"glorified IT department for the hot startup.\" A former Microsoft executive says that the partnership between OpenAI and Microsoft has led to the death of products like Azure Cognitive Search, Azure AI Bot Service, and Kinect DK. While things may seem fine around the Microsoft-OpenAI partnership, Microsoft Insiders recently lodged complaints citing that its AI strategy is too centered on its partnership with OpenAI (via Business Insider). For some, Microsoft has become an overnight \"glorified IT department for the hot startup.\" Business Insider reports that Microsoft's partnership with OpenAI has negatively impacted its AI Platform team which is central to homegrown AI advances and development. However, progress on these front has been stunted with Microsoft inclining more toward OpenAI for most (if not all) of its AI advances. The complicated nature of Microsoft and OpenAI's relationship contributed to the loss of one of the top executives in the company, who said products like Azure Cognitive Search, Azure AI Bot Service, and Kinect DK are practically dead. According to the executive: \"The former Azure AI is basically just tech support for OpenAI. Eric Boyd is effectively maintaining the OpenAI service. It's less of an innovation engine than it once was. Now it's more IT for OpenAI. The beating heart of innovation is elsewhere.\" But in response, Frank Shaw, a Microsoft spokesman indicated that the products and services still exist, it's just that they have been either rebranded or bundled up with other products. While this isn't a good look for Microsoft, the source indicated, \"It's not very innovative, but it's a good business strategy.\" Adding to the complicated relationship between Microsoft and OpenAI, the source disclosed that Microsoft employees work closely with OpenAI staffers to the extent that both have clearance to visit each other's offices and more. Microsoft has undoubtedly placed all its bets on generative AI, especially after plunging a multi-billion dollar investment in the technology, further extending its partnership with OpenAI. Since then, the tech giant has integrated AI across most of its products and services. It's no secret that OpenAI and Microsoft have a rather complicated relationship. In hindsight, it all started when OpenAI's board of directors spontaneously decided to fire CEO Sam Altman, only to reinstate him back to his position a week later. The reasoning behind this decision remains unclear, but it has been pointed out that Altman's leadership skills and lack of communication were among the main issues. The decision to fire Altman was received with a lot of backlash from OpenAI staffers who, in solidarity with their CEO, threatened to quit if he wasn't given back his job, further citing that \"OpenAI is nothing without its people.\" Interestingly, Microsoft remained on the sidelines during the whole OpenAI fiasco. However, the tech giant was reportedly gearing up to absorb hundreds of OpenAI staffers into its advanced AI research team at its LinkedIn offices in San Francisco. The new department was set to run with Sam Altman and OpenAI co-founder Greg Brockman leading its operations. Elon Musk recently moved to court and filed a lawsuit against OpenAI for veering off its initial mission and vision while starting up — to make AI readily accessible for everyone without making any profit from these ventures. Musk has openly shared his strong opinion about AI, citing that we're on the verge of the biggest technology revolution with AI, but there won't be enough electricity by 2025. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\"  Abby Hensel officially tied the knot in 2021, it has been revealed This food habit is linked to a specific type of dementia. \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault.  Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Devastating glide bombs have been a major threat to Ukraine's forces, and they can only be beaten by shooting down planes before they're released.  There is a growing understanding across the Western allies that Ukraine is losing the ground war against Russia, and by summer could face defeat.  Russia is pounding front lines with artillery, rocket and drone fire — and at over five times the rate the Ukrainian army can reply.  Volodymyr Zelensky’s troops are exhausted — after sustaining in some sectors a heavier concentration of incoming artillery than at the Somme in 1916, or the Normandy Bocage after D-Day in 1944. A Russian fighter jet crashed into the sea off the Crimean port of Sevastopol on Thursday, the regional governor has said. The two perpetrators claimed that they were \"dissatisfied\" with Jacky Wu's \"hosting style\"  The post Lian Hup Heng: Underrated atas cafe-style tarts & cake loaves for $3.80, hidden within a hawker centre appeared first on SETHLUI.com. Nordegren has moved on and built a life that focuses on her six kids Premier League ball boys and girls have been ordered to stop throwing the ball back to players during matches, amid concerns that the “multi-ball” system is giving home teams an unfair advantage. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. Shocking CCTV footage captures the moment a drunk driver plows a red sedan into a beauty clinic in the Lopburi province of Thailand, on March 20. The impact injured two staff members and caused significant damage to the clinic and adjacent beauty salon. The driver was found with a blood alcohol level four times the legal limit. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}