{
    "title": "IIT Madras's Pavan Davuluri takes charge of Microsoft Windows, Surface \nteams | Mint",
    "date": "3/26/2024",
    "url": "https://www.livemint.com/companies/people/iit-madrass-pavan-davuluri-takes-charge-of-microsoft-windows-surface-teams-11711519431012.html",
    "text": "Microsoft has made a strategic move by reuniting its Windows and Surface teams under a single leadership, marking a return to a familiar structure within the company's Engineering and Devices organization. This decision comes after a brief separation, during which the Windows team was temporarily aligned with Microsoft's new AI division, as per newswire ANI. The tech giant has appointed Pavan Davuluri, an alumnus of the prestigious IIT Madras, to spearhead the development efforts for both Windows and Surface. Davuluri, who previously oversaw Microsoft's hardware initiatives, will now take on the additional responsibility of leading Windows engineering, the newswire report added. This reshuffle follows the departure of former Windows and Surface chief Panos Panay last September, whose role was initially split between Davuluri and Mikhail Parakhin. Parakhin, who had assumed charge of Windows alongside his existing responsibilities as CEO of Web and Advertising at Microsoft, has now announced his intention to explore other opportunities, likely outside the company, the report further added. The reunion of the Windows and Surface teams is expected to foster increased collaboration and cohesion between Microsoft's hardware and software endeavors. This move has been welcomed by Windows enthusiasts, who anticipate a more seamless integration between the operating system and the company's Surface devices. Over the past year, Pavan Davuluri has played a pivotal role in driving Microsoft's efforts to optimize Windows for Arm-based devices. On March 22, Davuluri took to social media to announce the company's first-ever Surface AI PCs built exclusively for business, showcasing the Surface Pro 10 for Business and Surface Laptop 6 for Business. As Microsoft prepares for its highly anticipated event on May 20, expectations are high for the unveiling of new next-generation AI features and Arm-based Surface hardware. This event is expected to provide further insights into the company's vision for seamlessly integrating Windows and AI capabilities. With the reunification of the Windows and Surface teams, Microsoft aims to streamline its development processes and deliver a more cohesive and innovative experience for its customers across both software and hardware platforms. (With Inputs from ANI) Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}