{
    "title": "StockNews.com Upgrades Madrigal Pharmaceuticals (NASDAQ:MDGL) to \"Sell\"",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-mdgl-upgrade-2024-03-19/",
    "text": "Madrigal Pharmaceuticals (NASDAQ:MDGL - Get Free Report) was upgraded by StockNews.com to a \"sell\" rating in a research note issued to investors on Tuesday. A number of other equities analysts have also recently issued reports on the stock. TD Cowen upped their price objective on shares of Madrigal Pharmaceuticals from $349.00 to $390.00 and gave the stock an \"outperform\" rating in a research report on Friday. Canaccord Genuity Group increased their price objective on shares of Madrigal Pharmaceuticals from $338.00 to $377.00 and gave the stock a \"buy\" rating in a research report on Friday. UBS Group increased their price objective on shares of Madrigal Pharmaceuticals from $337.00 to $410.00 and gave the stock a \"buy\" rating in a research report on Friday. Oppenheimer increased their target price on shares of Madrigal Pharmaceuticals from $320.00 to $375.00 and gave the stock an \"outperform\" rating in a research note on Friday. Finally, B. Riley raised shares of Madrigal Pharmaceuticals from a \"sell\" rating to a \"neutral\" rating and raised their price objective for the company from $155.00 to $270.00 in a research note on Friday. One analyst has rated the stock with a sell rating, one has assigned a hold rating and nine have assigned a buy rating to the company. Based on data from MarketBeat.com, Madrigal Pharmaceuticals has an average rating of \"Moderate Buy\" and an average target price of $369.40. Check Out Our Latest Analysis on MDGLMadrigal Pharmaceuticals Stock Performance NASDAQ MDGL traded down $17.55 during trading on Tuesday, reaching $265.68. The company's stock had a trading volume of 915,038 shares, compared to its average volume of 584,991. The company has a current ratio of 5.38, a quick ratio of 5.38 and a debt-to-equity ratio of 0.28. The firm has a market capitalization of $5.29 billion, a price-to-earnings ratio of -13.32 and a beta of -0.48. Madrigal Pharmaceuticals has a 12 month low of $119.76 and a 12 month high of $322.67. The firm has a 50 day moving average price of $234.25 and a 200 day moving average price of $198.18. Madrigal Pharmaceuticals (NASDAQ:MDGL - Get Free Report) last issued its quarterly earnings results on Wednesday, February 28th. The biopharmaceutical company reported ($5.68) earnings per share for the quarter, missing analysts' consensus estimates of ($5.26) by ($0.42). During the same period in the prior year, the company earned ($4.98) EPS. As a group, equities analysts anticipate that Madrigal Pharmaceuticals will post -21.4 EPS for the current fiscal year. Hedge Funds Weigh In On Madrigal Pharmaceuticals Large investors have recently modified their holdings of the company. Amalgamated Bank lifted its position in Madrigal Pharmaceuticals by 2.8% during the fourth quarter. Amalgamated Bank now owns 2,119 shares of the biopharmaceutical company's stock valued at $490,000 after purchasing an additional 57 shares during the last quarter. Metropolitan Life Insurance Co NY increased its stake in shares of Madrigal Pharmaceuticals by 9.3% in the second quarter. Metropolitan Life Insurance Co NY now owns 744 shares of the biopharmaceutical company's stock worth $172,000 after buying an additional 63 shares during the period. Knights of Columbus Asset Advisors LLC increased its position in Madrigal Pharmaceuticals by 1.7% during the 3rd quarter. Knights of Columbus Asset Advisors LLC now owns 4,309 shares of the biopharmaceutical company's stock valued at $629,000 after purchasing an additional 74 shares during the period. Osaic Holdings Inc. increased its position in Madrigal Pharmaceuticals by 30.1% during the 2nd quarter. Osaic Holdings Inc. now owns 333 shares of the biopharmaceutical company's stock valued at $77,000 after purchasing an additional 77 shares during the period. Finally, E Fund Management Co. Ltd. grew its position in shares of Madrigal Pharmaceuticals by 5.3% in the 2nd quarter. E Fund Management Co. Ltd. now owns 1,683 shares of the biopharmaceutical company's stock worth $389,000 after buying an additional 84 shares during the period. 79.86% of the stock is currently owned by institutional investors. About Madrigal Pharmaceuticals (Get Free Report) Madrigal Pharmaceuticals, Inc, a clinical-stage biopharmaceutical company, focuses on the development of therapeutics for the treatment of non-alcoholic steatohepatitis (NASH) in the United States. Its lead product candidate is resmetirom, a liver-directed thyroid hormone receptor beta agonist, which is in Phase 3 clinical trials for treating NASH.Featured ArticlesFive stocks we like better than Madrigal PharmaceuticalsWhat Is Dividend Yield and How Do You Calculate It?Growing Twice as Fast as Tesla, XPeng is a BuyUptrend Stocks Explained: Learn How to Trade Using Uptrends4 Stocks Building Long-Term Value for Shareholders What is Insider Trading? What You Can Learn from Insider TradingFedEx Stock Has Analysts Upgrading in Bulk, a Sudden DiscountThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Trump’s “Tax Free” Retirement Strategy  (From Gold Safe Exchange) (Ad)Should you invest $1,000 in Madrigal Pharmaceuticals right now?Before you consider Madrigal Pharmaceuticals, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Madrigal Pharmaceuticals wasn't on the list.While Madrigal Pharmaceuticals currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 7 Energy Stocks to Buy and Hold ForeverDo you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Madrigal Pharmaceuticals, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Madrigal Pharmaceuticals wasn't on the list. While Madrigal Pharmaceuticals currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Do you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}