{
    "title": "Microsoft Corp. stock outperforms competitors on strong trading day",
    "date": "3/7/2024",
    "url": "https://www.marketwatch.com/data-news/microsoft-corp-stock-outperforms-competitors-on-strong-trading-day-142e20eb-5ec9542fb4f6",
    "text": "Shares of Microsoft Corp. \n        MSFT,\n        -0.17%\n       rallied 1.75% to $409.14 Thursday, on what proved to be an all-around positive trading session for the stock market, with the S&P 500 Index \n        SPX,\n        +0.11%\n       rising 1.03% to 5,157.36 and the Dow Jones Industrial Average \n        DJIA,\n        +0.12%\n       rising 0.34% to 38,791.35. The stock's rise snapped a three-day losing streak. Microsoft Corp. closed $11.68 below its 52-week high ($420.82), which the company achieved on February 9th. The stock demonstrated a mixed performance when compared to some of its competitors Thursday, as Apple Inc. \n        AAPL,\n        -1.06%\n       fell 0.07% to $169.00, Alphabet Inc. Cl C \n        GOOG,\n        +0.21%\n       rose 2.02% to $135.24, and Alphabet Inc. Cl A \n        GOOGL,\n        +0.04%\n       rose 2.27% to $134.38. Trading volume (18.1 M) remained 4.6 million below its 50-day average volume of 22.7 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. The possibility that U.S. inflation won’t trend much lower from here is raising concerns that Federal Reserve policymakers are mistakenly clinging to prospects for three interest-rate cuts this year and may lose their credibility, which could trigger cross-asset volatility. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}