{
    "title": "tutch Appoints Microsoft Veteran Greg Jones as CEO as it Expands Into the \nU.S.",
    "date": "3/27/2024",
    "url": "https://www.abnnewswire.net/press/en/124509/tutch-Appoints-Microsoft-Veteran-Greg-Jones-as-CEO-as-it-Expands-Into-the-US.html",
    "text": "Distribution of company announcements to the professional platforms, finance portals and syndication of important corporate news to a wide variety of news aggregators and financial news systems.  Jones to Guide the Retail Technology Company as It Enters the New Market and Expands Into New Retail Verticals NEW YORK, UNITED STATES, March 28, 2024 /EINPresswire.com/ -- tutch, the in-store digital platform that gives shoppers a self-service option for discovering every product in a retailers’ ecosystem, today announced the appointment of Greg Jones as Chief Executive Officer (CEO). Jones previously served as Global Director of Retail and Consumer Goods Solutions at Microsoft, and North America Retail and Consumer Goods Lead at Avanade. Jones has spent two decades empowering retailers to use technology to transcend the limitations of their physical footprints. As CEO, he will lead tutch as it scales adoption of its software as a service (SaaS) platform by U.S. brick-and-mortar stores and enters into new industry partnerships. Jones’ career has revolved around introducing new technologies to traditional industries to improve efficiency and profitability. During his tenure at Microsoft, he was responsible for establishing the company’s Travel and Transportation vertical, including forging partnerships with Boeing and SITA. At Avanade, he developed the North America Retail & Consumer Goods Advisory practice, which guides retailers as they leverage AI and technology to digitize core functions. Jones will channel these experiences as the company builds on its track record in Australia, where hundreds of stores currently rely on its platform to sell beyond what’s in the aisles, grow revenue, enhance staff productivity and increase customer loyalty. Retailers across the board are considering new self-service options that enable them to sell more, optimize staff and give customers the same autonomy they have when shopping online. This growing trend toward self-service and digital experiences has carved out a space in the market for tutch, resulting in increased demand from chain stores, malls, big box retailers and others, across apparel, home goods, luxury, speciality, drug stores and more. Using tutch, brick-and-mortar retailers are able to compete with ecommerce storefronts that keep shoppers at home, but don’t let them experience items first-hand like they can in stores. Customers can now benefit from a familiar digital experience in stores, while also touching, feeling and testing out products. For retailers, the technology gets to the core of what makes them profitable: higher sales, streamlined costs and increased efficiency. “Physical stores are still responsible for approximately 87% of all consumer purchases, but their models present many challenges that online platforms simply don’t have,” said Jones. “Issues like high staff turnover, tight margins, dated in-store experiences, space limitations and inventory carrying costs make it difficult to compete with online marketplaces–and even the brands they carry. But all of this creates a huge opportunity for the retailers willing to address these challenges head on. tutch was designed from the ground up to help them do this, and we’re prepared to replicate the success we’ve achieved for retailers in Australia, state-side.” tutch is also enabling retailers to explore net new revenue streams and store formats.  Using tutch, retailers can expand their physical stock through drop-shipped products, offer branded opportunities to brands that want to get close to shoppers at the point of purchase, and even transform brick-and-mortar stores into marketplaces through complementary buying options available through the self-service digital screens. “We built tutch after experiencing firsthand the opportunities that retailers have to optimize their physical store footprints,” said Grant Oayda, founder of tutch. “As we expand our own footprint, we know that Greg’s experience will put us in the best position to expand and open retailers’ eyes to the potential of digital to connect them to customers like never before.” Jones’ retail and technology experience will be invaluable to tutch as it tackles the nuances of the expansive U.S market. His history creating partnerships and facilitating integrations also makes Jones uniquely suited to guide retailers as they evolve beyond traditional store challenges and entertain previously unattainable marketplacing ambitions and ways to connect with shoppers beyond the store floors. About tutchtutch is a technology company, whose in-store digital platform makes it more likely that shoppers will purchase–and spend more. Bridging the gap between online and physical retail, tutch’s solution gives in-store customers a self-service option for easily exploring retailers’ full product catalogs–spanning what’s available in the aisles, online and across their larger marketplace offerings. The software surfaces relevant stock items, custom messaging and a tailored journey based on the products the customer is considering, as well as their location in the store. Created by retailers, for retailers, tutch puts customers in control of their shopping experiences, so retailers can increase in-store revenue and optimize spend. The Microsoft-backed company has operations in the U.S. and Australia. Kieran Powell\ntutch\nemail us here Upstate businessman launches Qroople—the world’s first Real Estate coupon Manila Awakens with \"The Ancient Prodigal,\" a Gripping One-Act Play EBC Financial Group (Cayman) Limited Granted Full Regulatory Licence from the Cayman Islands Monetary Authority (CIMA) Utility Vehicle Market to Perceive Notable CAGR of 10.6% by 2030, Future Trends, Challenges and Opportunity Analysis NGL Introduces NGL Pro: A Subscription for an Enhanced In-App Experience © 2024 ABN Newswire. All Rights reserved. "
}