{
    "title": null,
    "date": "3/10/2024",
    "url": "https://www.americanbankingnews.com/2024/03/10/balentine-llc-acquires-643-shares-of-microsoft-co-nasdaqmsft.html",
    "text": "Posted by ABMN Staff on Mar 10th, 2024 Balentine LLC lifted its holdings in shares of Microsoft Co. (NASDAQ:MSFT – Free Report) by 0.6% in the third quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The institutional investor owned 114,396 shares of the software giant’s stock after acquiring an additional 643 shares during the quarter. Microsoft makes up 1.2% of Balentine LLC’s portfolio, making the stock its 11th biggest position. Balentine LLC’s holdings in Microsoft were worth $36,121,000 as of its most recent SEC filing. A number of other hedge funds and other institutional investors also recently made changes to their positions in the business. Monumental Financial Group Inc. purchased a new stake in Microsoft in the first quarter worth $28,000. Atlantic Private Wealth LLC grew its stake in Microsoft by 534.5% in the second quarter. Atlantic Private Wealth LLC now owns 184 shares of the software giant’s stock worth $63,000 after purchasing an additional 155 shares during the period. Hibernia Wealth Partners LLC purchased a new stake in Microsoft in the third quarter worth $69,000. Iron Horse Wealth Management LLC grew its stake in Microsoft by 89.0% in the third quarter. Iron Horse Wealth Management LLC now owns 223 shares of the software giant’s stock worth $70,000 after purchasing an additional 105 shares during the period. Finally, MayTech Global Investments LLC purchased a new stake in shares of Microsoft in the fourth quarter worth $83,000. Institutional investors own 69.20% of the company’s stock. A number of equities research analysts have recently commented on MSFT shares. Piper Sandler reissued an “overweight” rating and issued a $455.00 target price on shares of Microsoft in a research note on Thursday, January 25th. Mizuho increased their target price on Microsoft from $420.00 to $450.00 and gave the stock a “buy” rating in a research note on Friday, December 15th. China Renaissance started coverage on Microsoft in a research note on Tuesday, December 5th. They issued a “buy” rating and a $466.00 target price on the stock. StockNews.com cut Microsoft from a “buy” rating to a “hold” rating in a research note on Thursday, February 22nd. Finally, Tigress Financial increased their price objective on Microsoft from $433.00 to $475.00 and gave the company a “buy” rating in a research report on Wednesday, November 29th. Four investment analysts have rated the stock with a hold rating and thirty-six have issued a buy rating to the company’s stock. According to MarketBeat.com, the company currently has a consensus rating of “Moderate Buy” and an average target price of $415.00. Read Our Latest Stock Report on MSFT NASDAQ:MSFT opened at $406.22 on Friday. The company has a current ratio of 1.22, a quick ratio of 1.20 and a debt-to-equity ratio of 0.19. Microsoft Co. has a 12-month low of $245.73 and a 12-month high of $420.82. The stock has a 50-day moving average price of $399.55 and a 200 day moving average price of $365.61. The stock has a market capitalization of $3.02 trillion, a P/E ratio of 36.73, a P/E/G ratio of 2.18 and a beta of 0.89. Microsoft (NASDAQ:MSFT – Get Free Report) last released its earnings results on Tuesday, January 30th. The software giant reported $2.93 earnings per share (EPS) for the quarter, topping the consensus estimate of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The firm had revenue of $62.02 billion during the quarter, compared to analysts’ expectations of $61.14 billion. During the same quarter last year, the business posted $2.32 earnings per share. The firm’s revenue was up 17.6% on a year-over-year basis. Equities research analysts forecast that Microsoft Co. will post 11.63 EPS for the current fiscal year. In related news, major shareholder Corp Microsoft sold 1,000,000 shares of the stock in a transaction dated Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the sale, the insider now owns 11,677,398 shares in the company, valued at $22,770,926.10. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through the SEC website. In other Microsoft news, insider Bradford L. Smith sold 3,303 shares of the firm’s stock in a transaction that occurred on Monday, February 5th. The stock was sold at an average price of $406.12, for a total transaction of $1,341,414.36. Following the completion of the transaction, the insider now owns 570,826 shares in the company, valued at approximately $231,823,855.12. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this link. Also, major shareholder Corp Microsoft sold 1,000,000 shares of the firm’s stock in a transaction that occurred on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total value of $1,950,000.00. Following the transaction, the insider now owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 1,048,303 shares of company stock worth $21,821,514. 0.03% of the stock is owned by corporate insiders. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Invesco Ltd. Trims Stock Position in Cadence Bank (NYSE:CADE) Apple Inc. (NASDAQ:AAPL) is Qtron Investments LLC’s Largest Position "
}