{
    "title": "Microsoft is hiring dozens of high paying jobs in Toronto and many are work \nfrom home",
    "date": "3/5/2024",
    "url": "https://www.blogto.com/tech/2024/03/microsoft-toronto-jobs/",
    "text": "Microsoft is hiring dozens of high paying jobs in Toronto and many are work from home  Microsoft is hiring a bunch of high paying, mostly hybrid jobs in Toronto, and they've got me rethinking my career path. With two offices in Toronto contributing to their team of 18,000 worldwide, Microsoft is one of the ultimate places to be for career computer whizzes — and lucky for them, the company is hiring a ton of positions in the city. There are a variety of positions up for grabs, in a range of different departments and salary ranges, from Customer Success Managers to Data Technicians and Marketing Managers. The available positions also have a range of hybrid/remote availability, with some positions allowing for up to 100% remote work, while others require full time in-office. The most junior positions can earn between $48,500 and $109,500, while more senior roles can earn up to $309,500. Most positions require a relevant degree and/or relevant experience in order to secure the job, with most postings requiring an additional four to ten years' work experience in the field, while a handful only require a high school diploma or GED with preferred work experience. You can view the full list of open positions at Microsoft online through their careers page. Fareen Karim   Join the conversation\n\nLoad \n\n comments Someone in Toronto has created a dating app that's basically 'Love is Blind' Man creates viral fake cheating scandal in Toronto to get people to download dating app Microsoft is hiring dozens of high paying jobs in Toronto and many are work from home Here's how bad Canada's mobile data prices are compared to other countries Factory Direct is closing all of its stores and having a giant liquidation sale Thousands of Temu USB adapters recalled in Canada due to electric shock hazard Report shows alarming rise in Canadians using GoFundMe to cover living expenses Rogers is under fire again for telecom market domination in Toronto "
}