{
    "title": "Happy Birthday Steve Ballmer: Former Microsoft CEO’s views on running a \nsuccessful business",
    "date": "3/23/2024",
    "url": "https://www.news9live.com/business/companies/happy-birthday-steve-ballmer-lessons-in-success-and-leadership-from-former-microsoft-ceo-2475770",
    "text": "New Delhi: Steve Ballmer, who succeeded Microsoft founder Bill Gates as the tech giant’s CEO, turns 68 years old today. His net worth is pegged at $126.4 billion by Forbes magazine. Having led Microsoft for 14 years, Ballmer stepped down in 2014 and went on to buy a basketball team, the Los Angeles Clippers for $2 billion. Today, the team is valued upward of $4 billion. Ballmer is a philanthropist who has donated over $3 billion to charity and invested $2 billion into donor-advised funds, according to Forbes. Success takes good ideas, hard work, and luck. Do what you can control — how hard you can work, said Ballmer.\nBallmer, Microsoft’s 30th employee, started as Gates’ assistant. He set up the different departments. From accounts to, HR to sales, Ballmer handled multiple roles.  “I was the only person at Microsoft who knew how to wear a tie,” Ballmer shares as the reason why he joined sales.\nBy the late 1980s, Ballmer knew that Microsoft will be big when Andy Grove of Intel said there will be 100 million computers sold per year. Sometimes it is difficult to explain what you do to your parents. Ballmer’s father remained sceptical about their work despite his starting salary being a comfortable $40,000-50,000 per year, a good package in those days. Ballmer initially dropped out of a business programme at Stanford University to join Microsoft, founded by his former Harvard University batchmate Bill Gates. Ballmer had to bargain with his parents that he would return to business school if Microsoft did not work out for him. Even at that time, his parents asked him “What is software? Who needs it?” Ballmer remains famous for the energy he exhibited on stage during Microsoft launches and annual meetings. He is also one of the world’s richest billionaires. However, Ballmer remains popular for his ownership of the LAl Clippers basketball team, his advocacy for transparency through USAFacts, and his philanthropic activities. This shows us how to remain motivated even after the job ends. Ballmer says it is important to learn how to set back and let others execute. He emphasises the importance setting a culture at the top as a laeader and letting it percolate downwards to let staffers know. Those who disagree with the culture can leave, he says.  "
}