{
    "title": "Microsoft Edge achieves record high desktop browser market share",
    "date": "1/3/2024",
    "url": "https://www.techspot.com/news/101395-microsoft-edge-achieves-record-high-desktop-browser-market.html",
    "text": "Editor's take: StatCounter offered no explanation as to why Safari's market share fell 4.34 percent from November to December, why Edge's share increased 0.67 percent, or why Firefox saw its share grow by 0.93 percent. Perhaps new computers gifted during the holidays running Windows 11 had an impact? We'll have to wait until the next monthly report to see if we are looking at a new trend or a holiday anomaly, but it is worth noting that similar movement was not observed at the end of 2022. Google's Chrome maintained a comfortable lead in the global desktop browser market to close out 2023, but the fight for second place took an interesting turn. According to the latest data from StatCounter, Google finished the year with 65.29 percent of the desktop browser market – an increase of 3.17 percentage points month over month. Microsoft Edge, however, managed to overtake Safari for second place to secure an 11.89 percent share, its highest slice of the pie to date. Apple's desktop browser market share fell to 8.29 percent. Mozilla's Firefox ended 2023 with a 7.61 percent share, while Opera accounted for 3.8 percent worldwide.  Keep in mind that these figures only apply to the desktop browser market. When adding mobile devices, tablets, and consoles to the mix, things start to look a bit different. Chrome still reigns supreme by a wide margin but Safari firmly takes second place with an 18.56 percent share. Edge, meanwhile, falls to just 4.97 percent, narrowly ahead of Firefox at 3.36 percent. Opera brings up the rear with a 2.86 percent share. What browser are you using these days? After moving on from Internet Explorer many moons ago, I found myself in the Firefox camp for years before eventually settling down with Chrome due to Firefox's memory issues. It is far from perfect but I do like some of the newer features to come down the pipe, like the ability to see a page's memory usage when hovering over a tab. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}