{
    "title": null,
    "date": "1/17/2024",
    "url": "https://investorplace.com/2024/01/is-this-the-best-time-to-buy-msft-stock/",
    "text": " Is now the time to continue adding Microsoft to your portfolio? Advertisement Source: Asif Islam / Shutterstock.com Microsoft (NASDAQ:MSFT), often viewed as one of the top tech giants worth buying, continues to outperform. The company has embraced artificial intelligence, with investments in OpenAI and integrated AI into the company’s core products. This has held to impressive results, with MSFT stock reporting $56.5 billion in revenue in the most recent quarter, with more than half this amount coming from its cloud business. Continuously expanding its market share, Microsoft recently surpassed Apple as the world’s most valuable company. It pays a quarterly dividend with a 0.78% yield, making it an attractive addition to retirement portfolios. Microsoft’s shares rose 57%, securing fifth place among high-growth tech stocks. Future growth, fueled by artificial intelligence, is imminent. Microsoft, partnered with OpenAI, has integrated AI into Bing, Teams, and Azure. Access the latest ChatGPT iteration through Bing Chat. Here are more reasons to buy MSFT stock now.. On January 11, Microsoft surpassed Apple (NASDAQ:AAPL) as the world’s most valuable company, marking the first time since 2021. Microsoft’s AI investments, particularly in OpenAI, contributed to its rapid stock rise. Closing 0.5% higher at $2.859 trillion, it briefly reached $2.903 trillion. Apple closed 0.3% lower at $2.886 trillion. The ongoing competition between Microsoft and Apple sees Microsoft’s growth and AI investments as key factors in its favor. Microsoft boosted its cloud business by integrating OpenAI’s tech into its productivity software. In contrast, Apple faced declining demand, especially for iPhones, impacted by weakened Chinese demand and competition from Huawei. Redburn Atlantic downgraded Apple, citing China as a potential drag. Since the start of 2024, three analysts have lowered their Apple ratings. As of the last close, Apple’s shares fell 3.3% in January, while Microsoft rose 1.8%. Both stocks, with high price-to-earnings ratios, are pricier than their 10-year averages. Apple’s forward PE is 28, exceeding its 10-year average of 19. Microsoft, trading at 31 times forward earnings, is above its 10-year average of 24. Apple’s market cap peaked at $3.081 trillion on Dec. 14, ending 2023 with a 48% gain, lower than Microsoft’s 57%. Microsoft has briefly surpassed Apple in valuation multiple times since 2018, notably in 2021 due to COVID-related supply chain concerns. Before NRF 2024: Retail’s Big Show, Microsoft unveiled enhanced generative AI and data solutions for retailers, spanning the shopper journey. With copilot templates on Azure OpenAI Service, retail data solutions in Microsoft Fabric, copilot features in Microsoft Dynamics 365 Customer Insights, and the Retail Media Creative Studio in the Microsoft Retail Media Platform, Microsoft Cloud for Retail provides diverse options to integrate copilot experiences across the entire shopper journey. Microsoft announced a phased roll-out, allowing EU cloud customers to process and store all personal data within the region, aligning with privacy legislation. This follows a similar move by Amazon Web Services in October. The update includes system-generated logs, addressing challenges for large companies managing extensive, distributed data storage across multiple countries to ensure privacy rule compliance. MSFT stock successfully transformed its productivity software into a cloud subscription service, leveraging AI for additional monetization. In the last quarter, the productivity segment generated $18 billion, up 13% year-over-year. Monetizing AI through Azure, Microsoft’s enterprise cloud service, contributed to its No. 2 position in cloud computing, with a 29% year-over-year revenue growth in the September quarter. Management anticipates AI driving $10 billion in annual revenue, marking the company’s fastest business to reach this milestone. On the date of publication, Chris MacDonald has a LONG position in AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/is-this-the-best-time-to-buy-msft-stock/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}