{
    "title": "Biden administration wants cloud providers like Amazon and Microsoft to \ninvestigate and report foreign clients ...",
    "date": "1/29/2024",
    "url": "https://fortune.com/2024/01/29/biden-administration-cloud-providers-amazon-microsoft-investigate-report-foreign-clients-developing-ai-apps-platforms/",
    "text": "The US wants cloud services providers such as Amazon.com Inc. and Microsoft Corp. to actively investigate and call out foreign clients developing artificial intelligence applications on their platforms, escalating a tech conflict between Washington and Beijing. The Biden administration proposal, scheduled for release Monday, requires such firms to reveal foreign customers’ names and IP addresses. Amazon and its peers, which include Alphabet Inc.’s Google, would have to devise a budget for collecting those details and report any suspicious activity, according to draft rule published Sunday. If implemented, Washington could use those requirements to choke off a major avenue through which Chinese firms access the data centers and servers crucial to training and hosting AI. They also place the onus of collecting, storing and analyzing customer data on the cloud services, a burden not unlike strict “know-your-customer” rules that govern the financial industry. US cloud providers have worried that restrictions on their activities with overseas users without comparable measures by allied countries risks disadvantaging American firms. Representatives for Microsoft, Amazon and Google didn’t immediately respond to requests for comment outside normal US hours. A Commerce Department spokesperson referred Bloomberg to Commerce Secretary Gina Raimondo’s comments last week. Raimondo said Friday her team was working to eradicate national security threats posed by AI development, an effort likely to focus on firms from China. Washington, which has already worked to constrain Beijing’s access to the most advanced semiconductors, wants to limit Chinese firms’ ability to develop AI with potential military capabilities. “These models getting in the hands of non-state actors or people that aren’t our allies is very dangerous,” Raimondo said in Washington. President Joe Biden in October directed the Commerce Department to require such disclosures in an effort to detect foreign actors that might use AI to launch what the proposal dubs “malicious cyber-enabled activities.” The US is asking for comments on the proposed rule through April 29 before finalizing the regulation. Commerce said it may provide an exception to the identification rules for the foreign subsidiaries of US cloud providers. It also referred to commenters so far who’ve pushed for the broadest possible definition of a US cloud service, adding it will clarify whether foreign subsidiaries fall under the rules. China’s development of AI and other next-generation technologies is a top concern for the administration, which sees Beijing as its primary global strategic competitor. Washington has tried to rein in China’s advances by restricting chip exports to the country and sanctioning individual Chinese firms, but the country’s tech leaders have managed to make significant breakthroughs despite US curbs. The US in October tightened its controls to capture more chips, equipment and geographies. One key update targeted Chinese-headquartered companies operating in more than 40 countries, an attempt to prevent those firms from using other nations as intermediaries to secure semiconductors they can’t access at home. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}