{
    "title": "History Suggests the Nasdaq Will Surge in 2024: My Top 7 Artificial \nIntelligence (AI) Growth Stocks to Buy Before It Does",
    "date": "1/20/2024",
    "url": "https://www.fool.com/investing/2024/01/20/history-suggests-the-nasdaq-will-surge-in-2024-my/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The macroeconomic challenges of the past couple of years are beginning to fade, and investors are looking to the future. After the Nasdaq Composite plunged in 2022, suffering its worst performance since 2008, the index enjoyed a robust recovery in 2023 and gained 43%. There could be more to come. Since the Nasdaq Composite began trading in 1972, in every year following a market recovery, the tech-heavy index rose again -- and those second-year gains averaged 19%. The economy is the wildcard here, though, and it could yet stumble in 2024. But historical patterns suggest that this could be a good year for investors. Recent developments in the field of artificial intelligence (AI) helped fuel the market's rise last year and will likely drive further gains in 2024. While estimates vary wildly, generative AI is expected to add between $2.6 trillion and $4.4 trillion to the global economy annually over the next few years, according to a study by McKinsey Global Institute. This will result in windfalls for many companies in the field. Here are my top seven AI stocks to buy for 2024 before the Nasdaq reaches new heights. Image source: Getty Images. Nvidia (NVDA 0.12%) is the poster child for AI innovation. Its graphics processing units (GPUs) are already the industry standard chips in a growing number of AI use cases -- including data centers, cloud computing, and machine learning -- and it quickly adapted its processors for the needs of generative AI. Though it has been ramping up production, the AI chip shortage is expected to last until 2025 as demand keeps growing. The specter of competition looms, but thus far, Nvidia has stayed ahead of the competition by spending heavily on research and development. The company's triple-digit percentage year-over-year growth is expected to continue into 2024. Despite its prospects, Nvidia remains remarkably cheap, with a price/earnings-to-growth ratio (PEG ratio) of less than 1 -- the standard for an undervalued stock. Microsoft (MSFT -0.17%) helped jump-start the AI boom when it invested $13 billion in ChatGPT creator OpenAI, shining a spotlight on generative AI. The company's tech peers jumped on the bandwagon, and the AI gold rush began. Microsoft seized the advantage, integrating OpenAI's technology into its Bing search and a broad cross-section of its cloud-based offerings. Its productivity-enhancing AI assistant, Copilot, could generate as much as $100 billion in incremental revenue by 2027, according to some analysts, though estimates vary. This and other AI tools already caused Azure Cloud's growth to outpace rivals in Q3, and Microsoft attributed 3 percentage points of that growth to AI. The stock is selling for 35 times forward earnings, a slight premium to the price-to-earnings ratio of 26 for the S&P 500. Even so, that looks attractive given Microsoft's growth potential. Alphabet (GOOGL 0.04%) (GOOG 0.21%) has long used AI to improve its search results and the relevance of its digital advertising. The company was quick to recognize the potential of generative AI, imbuing many of its Google and Android products with increased functionality and announcing plans to add new AI tools to its search product. Furthermore, as the world's third-largest cloud infrastructure provider, Google Cloud is suited to offer AI systems to its customers. A collaboration between Google and Alphabet's AI research lab, DeepMind, gave birth to Gemini, which the company bills as its \"largest and most capable AI model.\" Google Cloud's Vertex AI offers 130 foundational models that help users build and deploy generative AI apps quickly. Add to that the ongoing rebound in its digital advertising business, and Alphabet's valuation of 27 times earnings seems like a steal. There's a popular narrative that Amazon (AMZN 0.31%) was late to recognize the opportunities in AI, but the company's history tells a different story. Amazon continues to deploy AI to surface relevant products to shoppers, recommend viewing choices on Prime Video, schedule e-commerce deliveries, and predict inventory levels, among other uses. Most recently, Amazon began testing an AI tool designed to answer shoppers' questions about products. Amazon Web Services (AWS) stocks all the most popular generative AI models for its cloud customers on Bedrock AI, and is also deploying its Inferentia and Trainium purpose-built AI chips for accelerating AI on its infrastructure. Now that inflation has slowed markedly, more consumers and businesses are patronizing Amazon, and AI will help boost its fortunes. Image source: Getty Images. Meta Platforms (META -1.68%) also has a long and distinguished history of using AI to its advantage. From identifying and tagging people in photos to surfacing relevant content on its social media platforms, Meta has never been shy about deploying AI systems. Unlike some of its big tech rivals, Meta doesn't have a cloud infrastructure service to peddle its AI wares, but it quickly developed a workaround. After developing its open-source Llama AI model, Meta made it available on all the major cloud services -- for a price. Furthermore, Meta offers a suite of free AI-powered tools to help advertisers succeed. Improving economic conditions will no doubt boost its digital advertising business. And with the stock trading at just 22 times forward earnings, Meta is inexpensive relative to its opportunity. Palantir Technologies (PLTR -6.12%) has two decades of experience building AI-powered data analytics, and was ready to meet the challenge when AI went mainstream. In just months, the company added generative AI models to its portfolio, layering these atop its data analytics tools. The launch of the Palantir Artificial Intelligence Platform (AIP) has generated a lot of excitement. \"Demand for AIP is unlike anything we have seen in the past 20 years,\" said management. When fears of a downturn were higher, businesses scaled back on most nonessential spending, including data analytics and AI services, but now, demand for those services is rebounding, particularly in relation to generative AI. Looking ahead one year, Palantir sports a PEG ratio of less than 1, which helps illustrate how cheap the stock really is. Tesla (TSLA -2.25%) made a splash by bringing electric vehicles (EVs) into the mainstream. In 2023, its Model Y topped the list of the world's best-selling cars by a comfortable margin, the first EV to do so. However, the magnitude of its future prosperity will likely be linked to AI. The company's \"full self-drive\" system has yet to live up to its name, but success on that front would be a boon to shareholders. In Ark Investment Management's Big Ideas 2023 report, the firm estimates that robotaxis could generate $4 trillion in revenue in 2027. With an estimated 2.7 million vehicles on the road collecting data, Tesla could hold an insurmountable technological edge, if it cracks the code on autonomous driving. Some analysts estimate the software is already worth tens of billions of dollars. Finally, 6 times forward sales is a pretty reasonable valuation for an industry leader with a treasure trove of data. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, Palantir Technologies, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, Palantir Technologies, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}