{
    "title": "Better AI Stock in 2024: Microsoft vs. Intel",
    "date": "1/24/2024",
    "url": "https://www.fool.com/investing/2024/01/24/better-ai-stock-in-2024-microsoft-vs-intel/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Editor's note: This article has been corrected. Microsoft does not own any portion of OpenAI; it is entitled to a share of profit distributions. Artificial intelligence (AI) has captivated Wall Street over the last year -- and for good reason. Data from Grand View Research shows the AI market hit nearly $200 billion last year and is projected to expand at a compound annual growth rate of 37% through 2030. That forecast would see it exceed a value of $1 trillion before the end of the decade. Consequently, it's not surprising that firms across the tech sector have restructured their businesses to prioritize AI development, creating dozens of ways to invest in the high-growth sector in the new year. Two attractive options are Microsoft (MSFT -0.17%) and Intel (INTC 0.91%), with one excelling in the software side of AI and the other making promising inroads in the chip sector. These companies have significant potential in AI and likely have much to offer new investors over the long term. So, let's examine whether Microsoft or Intel is the better AI stock in 2024. Microsoft emerged as one of the biggest threats in AI last year with a partnership with ChatGPT developer OpenAI. The partnership gave Microsoft access to some of the most advanced AI models in the industry, making it highly competitive against rivals Amazon and Alphabet. The Windows company has so far used OpenAI's technology to bring AI upgrades across its product lineup. Aspects of ChatGPT have been integrated into Microsoft's search engine Bing; a range of AI tools are now available on its cloud platform Azure; and the company's various Office platforms are offering boosted productivity with the help of AI. It's still early days for Microsoft's venture into AI, but the company's quarterly earnings suggest its investment is paying off. In the first quarter of 2024 (ending September 2023), Microsoft posted 13% year-over-year revenue growth, beating analysts' estimates by nearly $2 billion. Significant gains came from the company's cloud and productivity segments (both hyper focused on AI development), reporting a revenue rise of 19% and 13%, respectively. Moreover, Microsoft hit over $63 billion in free cash flow in 2023, indicating it has the funds to continue investing in AI and flourish in the market over the long term. Intel isn't as far along in its AI expansion as Microsoft, but that could mean it has more growth potential in the coming years. Chip stocks soared last year alongside rising excitement for AI. Nvidia took center stage, getting a headstart in the sector as it snapped up an estimated 90% market share in AI graphics processing units (GPUs), the chips necessary to train and run AI models. However, Intel is gearing up to challenge Nvidia's dominance in AI, which could see earnings soar in 2024. In December, Intel unveiled a range of new AI GPUs called Gaudi3, designed to compete directly with Nvidia's offerings. The tech giant also announced new Core Ultra processors and Xeon server chips, which both include a neural-processing unit meant to run AI programs faster. Intel has had a rough few years, faced with a market downturn that brought steep declines in PC sales. However, its earnings are on the right track. Despite posting a 14% year-over-year dip in revenue in Q3 2023, operating income rose more than 43% to $2 billion. Intel is on a promising growth trajectory and could deliver major gains this year thanks to the launch of its new AI chips. Microsoft and Intel have significant potential in AI, with both companies investing heavily in the market. However, Microsoft's forward price-to-earnings ratio (P/E) of 36 compared to Intel's 25 makes the Windows company far more expensive. Intel's lower figure indicates its stock offers considerably more value. Meanwhile, earnings-per-share (EPS) estimates show Intel may have more stock-growth potential over the next two fiscal years.  Data by YCharts. This chart shows over the next two fiscal years, Microsoft's earnings could hit $15 per share, while Intel's may achieve nearly $3 per share. At first glance, Microsoft looks like a no-brainer. However, multiplying these figures by each company's forward P/E (Microsoft's 36 and Intel's 25) yields stock prices of $540 for Microsoft and $68 for Intel. Considering their current positions, these projections would see Microsoft's stock rise 36% and Intel's 42% over the next two fiscal years. While both figures are impressive, Intel's higher percentage, cheaper stock price, and prominent role in AI make it a more attractive investment this year. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}