{
    "title": "Microsoft launches 'AI Odyssey' to upskill 1 lakh Indian developers",
    "date": "1/8/2024",
    "url": "https://www.fortuneindia.com/enterprise/microsoft-launches-ai-odyssey-to-upskill-1-lakh-indian-developers/115361",
    "text": "Microsoft has launched an initiative called 'AI Odyssey' to upskill 100,000 developers in India with the latest AI technologies and tools. U.S.-based tech major says the programme will help developers acquire relevant skills needed to execute critical projects using AI technologies that align with business goals and outcomes. \"With AI revolutionising the way we work and live, India needs a skilled workforce that can use AI to solve complex problems and create value,\" says Microsoft. AI Odyssey, says Microsoft, will help developers build solutions for India’s growth. \"To participate in the AI Odyssey, developers need to register on aka.ms/AIOdyssey and access the learning modules and resources.\" The company says the month-long programme is open to all AI enthusiasts in India, regardless of experience level or background. It has two levels that participants need to complete by January 31, 2024. The first level educates participants on how to use Azure AI services to create and deploy AI solutions for different scenarios. It will give them access to useful resources, code samples, and guides to master practical AI skills. The second level challenges them to prove their AI skills by completing an online assessment, with interactive lab tasks that earn them Microsoft applied skills credentials. \"Participants completing both the levels of challenges will also stand a chance to win a VIP Pass to attend the Microsoft AI Tour in Bangalore on February 8, 2024, and witness the revolutionary impact of generative AI,\" says Microsoft. Notably, Microsoft's AI Tour showcases how generative AI can enable new forms of creativity, collaboration, and problem-solving. The tour features keynote sessions, demos, and workshops, where developers can learn from Microsoft experts and partners, as well as network with peers. Irina Ghose, managing director, Microsoft India, says AI is the future of innovation and India is leading the way with its tech talent. \"The Microsoft Applied Skills credential will help developers demonstrate their competence and creativity in the most in-demand AI skills and scenarios. We welcome all developers to join us in creating meaningful AI solutions that will contribute to India’s economy.” Microsoft entities in India have over 20,000 employees currently, who are engaged in sales and marketing, research, development, customer support, and industry solutions across 10 Indian cities. Microsoft has committed investments worth $13 billion in US-based AI startup OpenAI whose chatbot ‘ChatGPT’ has gained huge popularity in recent times. The company also offers a bouquet of AI-powered products, including Copilot, GitHub Copilot, Azure AI, Dynamics 365 and broader Microsoft Cloud Services. The company aims to launch around 100 new AI-powered products and services in the coming years. Follow us on Facebook, Twitter, YouTube & Instagram to never miss an update from Fortune India. To buy a copy, visit Amazon. Share the article Your email address will not be published. Required field are marked* X Premium is X's premium subscription service that aims to boost quality conversations by removing ads and offering additional features to improve experience Adani family raises stake in Ambuja Cements by 3.6% to 66.7% The 5G capital expenditure cycle of Reliance Industries is expected to conclude soon. Axis Bank says unauthorised credit card transactions a 'malicious attempt' from certain merchants X Premium is X's premium subscription service that aims to boost quality conversations by removing ads and offering additional features to improve experience Adani family raises stake in Ambuja Cements by 3.6% to 66.7% The 5G capital expenditure cycle of Reliance Industries is expected to conclude soon. Axis Bank says unauthorised credit card transactions a 'malicious attempt' from certain merchants "
}