{
    "title": "Microsoft goes atomic — World's most valuable company just hired a director \nof nuclear development acceleration to ...",
    "date": "1/22/2024",
    "url": "https://www.techradar.com/pro/microsoft-goes-atomic-worlds-most-valuable-company-just-hired-a-director-of-nuclear-development-acceleration-to-help-power-its-very-own-ai-revolution",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Microsoft is looking for new ways to keep its data centers running It's well-known that data centers consume a staggering amount of energy, with about 1-1.5% of all global electricity usage thought to be dedicated to their operation. Tech companies have largely focused on powering these through renewable and sustainable energy sources in an effort to boost their green credentials and address climate change. However, increased energy demand caused by the arrival of new technologies like AI is making the task tricky, as this field alone consumes about four times as much power as servers used for cloud applications. Recognizing the future pressures on its data centers, Microsoft has taken the somewhat controversial step of appointing a Director of Nuclear Development Acceleration. According to McKinsey, the power requirements of US data centers are projected to jump from 17 gigawatts (GW) in 2022 to 35 GW by 2030. Electricity isn't the only concern. GPUs used for AI have higher cooling needs than traditional servers, and Microsoft's water usage in data centers rose by 34% in 2022. This figure is expected to surge as the tech giant further increases its investments in AI. Stepping into this role is Erin Henderson, PhD, MBA, PMP, who brings a wealth of experience from her 13-year tenure at the Tennessee Valley Authority, where she served as the General Manager of Transmission Projects. Henderson will, among other things, devise a global strategy for small modular reactors and microreactors to power Microsoft's data centers. Yes, that’s right, the company really is going nuclear. Writing on LinkedIn about her new post, Henderson said \"I am very excited to share that I've joined Microsoft in a new role, Director of Nuclear Development Acceleration. Microsoft is leading the way in advocating for a clean and sustainable energy future. I am looking forward to contributing to the datacenter R&D team's success.\" Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Data Center Dynamics recently reported Microsoft spent six months collaborating with Terra Praxis, a nonprofit that advocates for transforming old coal plant sites into modern SMR homes. Together the two firms worked on a generative AI model to speed up the lengthy and expensive nuclear regulatory and licensing process, a clear signpost towards Microsoft’s nuclear ambitions. Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. Enterprises must follow five key steps to adopt AI securely The impact of AI and deepfakes on identity verification Here's exactly when to stop drinking caffeine for the best chance of a great night's sleep By Muskaan SaxenaMarch 27, 2024 By Sead FadilpašićMarch 27, 2024 By Jake GreenMarch 27, 2024 By Demi WilliamsMarch 27, 2024 By Sead FadilpašićMarch 27, 2024 By Hamish HectorMarch 27, 2024 By Darren AllanMarch 27, 2024 By Sead FadilpašićMarch 27, 2024 By Demi WilliamsMarch 27, 2024 By Chiara CastroMarch 27, 2024 By Mackenzie FrazierMarch 27, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}