{
    "title": "Business Tech News Roundup: Microsoft Is Changing Your Keyboard",
    "date": "1/7/2024",
    "url": "https://www.forbes.com/sites/quickerbettertech/2024/01/07/business-tech-news-roundup-microsoft-is-changing-your-keyboard/",
    "text": "(Photo by Neil Godwin/PC Gamer Magazine/Future via Getty Images) Here are five things in tech that happened this week and how they affect your business. Did you miss them? 1 – Microsoft is changing the keyboard for the first time in years. New keyboards on Windows computers will now have a special CoPilot key. According to the report “while Windows 11 users can already access Copilot by pressing the Windows key + C, he says the new key shows the value the company is placing on this particular feature and its potential to draw and bind users to all their many products\". (Source: BBC) Why this is important for your business: Microsoft’s first keyboard change in decades will likely affect all PCs running Windows. This shortcut key will help you and your employees call upon CoPilot – Microsoft’s AI tool - to better leverage the AI features both in its operating system and applications like Office 365. 2 – The impact of Meta special ad category on digital advertising. MarTech Cube provides a special deep dive into Meta’s special ad category and according to their column: “the Special Ad Category is designed to address concerns related to housing, employment, and credit opportunities, ensuring a fair and unbiased advertising environment. This category is particularly relevant for advertisers promoting content related to these sensitive topics, and its implementation involves additional restrictions to prevent discriminatory practices.” (Source: MarTech Cube) Why this is important for your business: If your business is in the space of housing, employment or offering credit opportunities and you want to grow it with Meta advertising, this is a critical tool to use so that you can ensure that your ads are fair and unbiased. 3 – LinkedIn ad revenues surge as companies flee X. Ongoing controversies with Elon Musk and the X platform have apparently benefited LinkedIn in the advertising sphere. Big advertisers including IBM, Coca Cola and Comcast, have jumped ship after Musk made news for using antisemitic language in a post. LinkedIn is seeing a surge in advertising numbers – up to 30 percent this year. Advertising analysts have drawn a direct line to the ad decline on X – $400 million less per quarter this year. (Source: PYMNTS) Why this is important for your business: I’m not sure this is great news for businesses. For starters, we don’t need more advertising noise to pollute LinkedIn, which arguably remains the best place for professional engagement among all the social sites. Also, we should be rooting for X/Twitter to thrive because it provides a great alternative to LinkedIn for those businesses that are more suited to the platform – creators, media firms, public relations companies, etc. 4 – These are five pivotal cybersecurity trends for 2024. Tal Mazir of security software and services provider Perception Point detailed five cybersecurity trends to be aware of this year. (Source: Help Net Security) Why this is important for your business: Mazir says that chatbots that appear to be ChatGPT will be used to craft messages from an “authorized’ sender to achieve serious security breaches like accessing funds or other sensitive data. Deepfakes – up 3000 percent – is another tool hackers will continue to use to create counterfeit images or audio to dupe recipients lured by content “virtually indistinguishable” from legitimate data. A third example is the use of SaaS apps to probe and locate weak points in security systems. Mazir’s underlying message is with every remarkable advantage of AI, its equally destructive capacity will be exploited. 5 – Four ways companies can respond and more effectively comply with the SEC's new cybersecurity rules. Speaking of cybersecurity threats, the U.S. Securities and Exchange Commission has ramped up its efforts to counteract these escalating issues. As of this summer new rules were enforced requiring companies to disclose any cybersecurity incidents as well as submitting information detailing their “cybersecurity risk management, strategy, and governance.” (Source: SC Magazine) Why this is important for your business: The advice for companies to keep up with stricter SEC guidelines is to prioritize cybersecurity risks and approach it as any other risk management issue. Also suggested is to establish aggressive metrics to respond to potential threats in a timely manner and to prioritize transparency and make certain due diligence is given when submitting cybersecurity reports to the SEC. Taking a “business centric” approach with Chief Security Officers and communicating with their teams about how to improve security systems, where flaws exist, and what should stay on the company’s radar in terms of threats is also important.  "
}