{
    "title": "Exit Magnificent 7, Enter Troubling 3 Nvidia, Meta, And Microsoft",
    "date": "1/21/2024",
    "url": "https://seekingalpha.com/article/4664013-exit-magnificent-7-enter-troubling-3-nvidia-meta-microsoft",
    "text": "Bet_Noire Bet_Noire From the Magnificent 7 to the Troubling 3. While the S&P 500 rose this past week to a new all-time high, what became clear was that the leadership in this index has contracted further. Gone are the magnificent seven of Tesla (TSLA), Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL) (GOOG), Microsoft (MSFT), Nvidia (NVDA), and Meta (META). Enter the Troubling 3, made up of Microsoft, Meta, and Nvidia. The Troubling Three have given the illusion of a strong equity market, helping to lift the S&P 500 to a fresh all-time high. But digging deeper reveals that the Troubling Three accounts for nearly all of the gains seen in the index this year. Bloomberg Bloomberg The S&P 500 is up 69.98 points this year, or 1.47%. Most of those gains can be attributed to three stocks: Nvidia, Microsoft, and Meta. Nvidia has accounted for 29.3 points, Microsoft has accounted for 20.0 points, and Meta has accounted for 7.8 points. That means that 57.1 points, or 80%, of the roughly 70 points gained in the S&P 500 are from just three stocks. Meanwhile, 2 of the former Magnificent 7 stocks, Tesla has taken 11.95 points away from the S&P 500, and Apple has subtracted 1.7 points from the S&P 500 in 2024. Only 193 stocks in the S&P 500 are up for the year, 308 are down for the year, while two are unchanged. That is why the S&P 500 Equal Weight Index is down 1.26% year to date. Bloomberg Bloomberg What is troubling about the three stocks leading the market higher is that the number of stocks driving the market is contracting. Second, these are the same three stocks noted earlier last week that had seen tremendous amounts of call delta built up over the past several months, and call options expired on Friday, January 19. Nvidia also exhibits signs of a gamma squeeze, with higher call volume, the put-to-call ratio at the low end of the historical range, implied volatility rising and skewed to the calls side, and the stock price rocketing higher. A gamma squeeze is a self-reinforcing action where investors buy out-of-the-money call options, which results in market makers hedging the underlying by buying the shares, pushing the stock higher. So, the more calls being bought, the higher the stock goes. When the demand for the calls increases, the implied volatility increases faster than the puts, pushing skew to the call side. Bloomberg Bloomberg While this can be seen as a sign of bullishness, it can also be seen as a sign of excess because typically, once the call implied volatility gets too high, the process of the gamma squeeze burns out, and that results in the stock dropping significantly. The problem here is that not only is Nvidia amid a gamma squeeze, but it also had a tremendous amount of call delta that expired on Friday. These call delta positions, for the most part, become self-reinforcing because as the stock price goes higher, more hedging needs to take place against these open call positions, which in itself pushes the value of the stock price higher, which in part helps to fuel the gamma squeeze even more. Bloomberg Bloomberg This same dynamic is also visible in Meta, with large amounts of in-the-money call options that expired on Friday, with the same reinforcing delta dynamic and flows that have helped to support the stocks and, more importantly, keep the stock grinding higher. Bloomberg Bloomberg So the problem here is that if the S&P 500 has now become an overall representation of just three stocks and these stocks have been driven higher primarily by options activity and hedging flows, then it is no longer an accurate representation of the entire equity market and also becomes at risk of changes in these options flows, and more importantly vulnerable to a sharp decline if these flows disappear post option expiration starting next week. Additionally, what is also clear is that fixed strike implied volatility for the S&P 500 is on the rise for the February 16 option expiration. So, while there is this appearance that implied volatility is falling, as noted by the decline in the VIX, implied volatility for lower strike prices for the February options expiration. This is a sign that on the S&P 500 index level, there is a demand to buy and own downside protection. Bloomberg Bloomberg While it may seem on the headlines that all is well in the equity market and the stocks can only go higher from here, a breakdown of the actual structure and flows shows that the market is being driven higher by fewer stocks and the reason why the advance-decline on the NYSE, is now below its July peak. StockCharts StockCharts Could the S&P 500 continue to move higher? The S&P 500 itself is no longer a representation of 500 stocks at this point. So yes, that is a risk for S&P 500 index fund investors, but if the hedging flows from this week's options expiration are now behind us and Nvidia's gamma squeeze ends, then the window for a significant pullback is about as wide open as it is going to get. Editor's Note: This article covers one or more microcap stocks. Please be aware of the risks associated with these stocks. TRY READING THE MARKETS AND GET THE FIRST 2-WEEK FREE * *2-week trial not available on Mobile App       This article was written by Mott Capital is managed by Michael Kramer, a former buy-side trader, analyst, and portfolio manager with 30 years of experience tracking market fundamentals. He focuses on long-only macro themes and studies trends and unusual options activities to identify long-term thematic growth opportunities. Since its inception in 2016, the Mott Capital Management portfolio is up 115.4% using the fundamentals and macro trend-based approach to trading. Michael Kramer leads the investing group Reading the Markets, where he helps a devoted following of members to better understand what is driving trading and where the market is likely heading, both the short and long-term. Features of the investing group include: daily written commentary and videos analyzing the driving factors behind price action; general macro trend education to help members make well-informed decisions based on market conditions, interest rates, currency movements and how they all interact; chat for questions and community dialogue; and regular Zoom videos sessions to discuss current ideas and answer questions. The level of access RTM subscribers and the expertise of the source are unprecedented given that the subscription price is a fraction of similar technical coaching and mentoring services. Learn more here. Learn more. Analyst’s Disclosure: I/we have a beneficial long position in the shares of MSFT, AAPL, AMZN, GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Charts used with the permission of Bloomberg Finance L.P. This report contains independent commentary to be used for informational and educational purposes only. Michael Kramer is a member and investment adviser representative with Mott Capital Management. Mr. Kramer is not affiliated with this company and does not serve on the board of any related company that issued this stock. All opinions and analyses presented by Michael Kramer in this analysis or market report are solely Michael Kramer's views. Readers should not treat any opinion, viewpoint, or prediction expressed by Michael Kramer as a specific solicitation or recommendation to buy or sell a particular security or follow a particular strategy. Michael Kramer's analyses are based upon information and independent research that he considers reliable, but neither Michael Kramer nor Mott Capital Management guarantees its completeness or accuracy, and it should not be relied upon as such. Michael Kramer is not under any obligation to update or correct any information presented in his analyses. Mr. Kramer's statements, guidance, and opinions are subject to change without notice. Past performance is not indicative of future results. Neither Michael Kramer nor Mott Capital Management guarantees any specific outcome or profit. You should be aware of the real risk of loss in following any strategy or investment commentary presented in this analysis. Strategies or investments discussed may fluctuate in price or value. Investments or strategies mentioned in this analysis may not be suitable for you. This material does not consider your particular investment objectives, financial situation, or needs and is not intended as a recommendation appropriate for you. You must make an independent decision regarding investments or strategies in this analysis. Upon request, the advisor will provide a list of all recommendations made during the past twelve months. Before acting on information in this analysis, you should consider whether it is suitable for your circumstances and strongly consider seeking advice from your own financial or investment adviser to determine the suitability of any investment. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}