{
    "title": "Microsoft's Xbox to release four titles on external platforms",
    "date": "2/16/2024",
    "url": "https://tribune.com.pk/story/2456657/microsofts-xbox-to-release-four-titles-on-external-platforms",
    "text": "Xbox to release four-video game titles on external platforms following its acquisition of Activision Blizzard Microsoft's Xbox will release four video-game titles on external platforms, gaming CEO Phil Spencer said on a podcast on Thursday, as it looks to tap into a wider base of gamers following its $69 billion acquisition of Activision Blizzard. Although Spencer did not give more details on the titles the company intends to release, he said they have been available to Xbox players for at least a year. He also made it clear that the games coming to other platforms does not include \"Starfield\" or the upcoming \"Indiana Jones\" title. Spencer said games exclusive to one piece of hardware were going to become a smaller part of the industry over the next five to 10 years. The Activision acquisition was a step towards boosting Microsoft's heft in the videogame market to better compete with industry leader Sony, which recently cut its forecast for its PlayStation 5 sales for the year ending March. Microsoft announced last month that it would lay off 1,900 employees at Activision Blizzard and Xbox, a cut that represents about 8% of the overall Microsoft Gaming division. Spencer's comments on game exclusivity come a day after Sony's chief financial officer said on a post-earnings call that the company can improve operating profit by bringing first-party games to other platforms. \"Diablo IV\", the first Activision Blizzard game post-acquisition, will be available to subscribers of Xbox's Game Pass from March 28, according to an Xbox blog. The growth environment for multi-game subscription services, which include Sony's PlayStation Plus and Xbox Game Pass, is expected to slow this year, according to research firm NewZoo. COMMENTS \n\n\n\n\nReplying to \nX\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSaved ! Your comment will be displayed after the approval.\n\n\nError !\n\n\nError! Invalid Email.\n\n\n\nComments are moderated and generally will be posted if they are on-topic and not abusive. \nFor more information, please see our Comments FAQ Comments are moderated and generally will be posted if they are on-topic and not abusive. For more information, please see our Comments FAQ 104 K Is Babar Azam Returning as Pakistan T20 Captain? | Sources Speculate on Leadership Shift Conjoined Twin Abby Hensel Marries U.S. Army Veteran | Abby & Brittany Update Finance Minister's Bold Vision: Private Sector to Lead, Govt to Support Policy Framework Where’s P. Diddy Now? Hip-hop mogul Sean \"Diddy\" Combs Faces Home Raids After Sexual Assault Cases Streamer ‘YourFellowArab’ Kidnapped in Haiti - Lord Miles Shares Insight UN Rapporteur: Decades of Israeli Atrocities in Palestine Exposed! Ben Shapiro's Silence on Candace Owens & Rabbi Shmuley Controversy Sam Bankman-Fried Sentenced: 25 Years for $10 Billion Crypto Fraud Pakistan to Investigate Alleged Judicial Meddling: PM, CJ Meet, Commission Formed Positive Signs: Pakistan's Reserves Inch Up, Rupee Strengthens Against Dollar US Condemns Russia's UN Veto on North Korea Sanctions Renewal Amidst Weapon Transfer Allegations. Laboring patients refused obstetric care at public hospitals ATC sentences May 9 accused to five years in prison Sheryl Crow releases 12th studio album titled ‘Evolution’ Cabinet picks former CJP Jillani to head IHC letter inquiry commission Hailey Bieber’s Instagram Post reignites Selena Gomez feud speculation Massive crane put in place to clear Baltimore bridge debris as crews assess damage Makeup Mastery Revolutionising Runways From Disorder to Tranquillity: The Art of Minimalist Living عام انٹرنیٹ سے 45 لاکھ گُنا تیز انٹرنیٹ ماحول میں تحلیل ہوکر ختم ہوجانے والی پلاسٹک کی نئی قسم ملکی وے کہکشاں کے درمیان موجود بلیک ہول کی نئی تصویر جاری پولر آئس کا پگھلاؤ زمین کی گردش، وقت کی رفتار سست کرنے کا باعث بن رہا ہے، تحقیق ماہرین کا اینڈرائیڈ صارفین کو 28 خطرناک ایپس ڈیلیٹ کرنے کا مشورہ باریک سوئیوں سے بنی وائرس کش سطح تیار Utilize power plants fully, IMF advises Silenced by loved ones: Internet outraged by Maria's murder, likens case to Qandeel Baloch's SC endorses inquiry over judges’ letter Chinese military offers Pakistan help to fight terror Tax exemptions of Rs50b defy IMF Trading with the enemy Power and its discontent Redefining Pakistan’s nuclear deterrence posture Trading with the enemy Should Pakistan, China continue to feed a partner hosting the enemy? Donors don’t care much about air pollution Cross-border militancy and our priorities This material may not be published, broadcast, rewritten,\nredistributed or derived from. Unless otherwise stated, all content is\ncopyrighted © 2024 The Express Tribune. "
}