{
    "title": "Will Super Micro Computer Be Worth More Than Microsoft by 2050?",
    "date": "2/24/2024",
    "url": "https://www.fool.com/investing/2024/02/24/super-micro-computer-worth-more-microsoft-2050/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Super Micro Computer (SMCI -1.30%), also called Supermicro, and Microsoft (MSFT -0.17%) have both profited from the secular expansion of the artificial intelligence (AI) market. Supermicro develops high-end AI servers powered by Nvidia's (NASDAQ: NVDA) top-tier GPUs, while Microsoft weaves OpenAI's generative AI tools into its own cloud-based services. Supermicro went public at $8 per share with a valuation of $229 million in March 2007, but it now trades at about $750 a share with a market cap of $44 billion. That massive rally would have turned a $10,000 investment into more than $940,000. Image source: Getty Images. Supermicro is still a lot smaller than Microsoft, which saw its market cap hit $3 trillion earlier this year, and smaller than its two larger competitors in the server market, Hewlett Packard Enterprise (NYSE: HPE) and Dell Technologies (NYSE: DELL). But if Supermicro continues firing on all cylinders, could it grow into a multi-trillion-dollar AI giant like Microsoft by 2050? Supermicro is the world's third-largest server company with a market share of 5%, according to History-Computer. Dell leads the market with a 19% share, followed by HPE with a 13% share. Grand View Research expects the global server market to grow at a steady compound annual growth rate (CAGR) of 9% from 2023 to 2030. Supermicro differentiates itself from its slower-growth competitors by mainly producing high-performance servers instead of low- to mid-range servers. Its design partnership with Nvidia grants it access to its top-tier GPUs before other server makers, and that competitive edge enabled it to capitalize on the explosive growth of the generative AI market. Supermicro now generates roughly half of its revenue from dedicated AI servers powered by Nvidia's GPUs. Bank of America estimates that Supermicro already controls 10% of the dedicated AI server market -- and it expects its share to rise to 17% within the next three years as the entire niche market expands by 150%. From fiscal 2007 to fiscal 2020 (which ended in June 2020), Supermicro's annual revenue grew at a CAGR of 17%. Its revenue dipped 7% in fiscal 2021 as the pandemic disrupted the global server market, but surged 46% in fiscal 2022 and grew 37% in fiscal 2023 as the AI market's growth accelerated. From fiscal 2023 to fiscal 2026, analysts expect its revenue to continue rising at a CAGR of 42%. Supermicro still doesn't seem expensive right now at 3 times this year's sales. Assuming its price-to-sales ratio holds steady, its market cap could reach $61 billion by fiscal 2026 -- marking a near-40% gain from its current levels. But to reach Microsoft's current market cap of $3 trillion by 2050 with the same price-to-sales ratio, Supermicro would need to generate $1 trillion in revenue. To reach that target, it would need to grow at a 24-year CAGR of 18% from fiscal 2026. That might seem achievable relative to its previous growth rates, but Supermicro could face some unpredictable challenges before 2050. Nvidia could deepen its ties with Dell, HPE, and other server makers to drive the growth of the data center GPU market. The AI market could stall out after the next few economic downturns, and Supermicro could be revalued as a legacy server maker like HPE and Dell -- which both trade at less than 1 time this year's sales -- instead of as a hypergrowth stock. Simply put, Supermicro needs to keep hitting home runs over the next three decades to reach Microsoft's current market cap. But even if Supermicro somehow becomes a $3 trillion stock by 2050, Microsoft would likely be worth a lot more. Supermicro is still a great growth stock, but it's futile to compare a server maker to a diversified software giant like Microsoft -- which owns the world's top PC operating system (Windows), the most popular productivity software suite (Office), and the second-largest public cloud platform (Azure). Supermicro certainly has the potential to become a trillion-dollar stock over the next few decades if it plays its cards right, but I doubt it will ever come close to matching Microsoft's valuations. Bank of America is an advertising partner of The Ascent, a Motley Fool company. Leo Sun has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bank of America, Microsoft, and Nvidia. The Motley Fool recommends Super Micro Computer and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}