{
    "title": "Microsoft Ignores XR Investments in Favour of AI",
    "date": "2/6/2024",
    "url": "https://www.xrtoday.com/mixed-reality/microsoft-ignores-xr-investments-in-favour-of-ai/",
    "text": "Home → Mixed Reality Microsoft avoids HoloLens and Industrial Metaverse talk during its fiscal year 2024 second quarter Published: February 6, 2024 Rory Greener Earnings calls are out, and usually, the rolling soapbox is an opportunity for a business leader to address the good, the bad, and the ugly of a firm’s recent activities and investments. Microsoft recently released information regarding its recent Fiscal Year 2024 Second Quarter earnings call. The call hits all the expected notes, such as genAI. However, interestingly, despite an increased push towards developing XR solutions since mid-2023, Microsft did not mention its MR/spatial applications, HoloLens 2, or its industrial metaverse roadmap. Regarding Mcrosoft’s recent performance, Amy Hood, the EVP and CFO at Microsoft, noted: This quarter, revenue was $62 billion, up 18% and 16% in constant currency. When adjusted for the prior year Q2 charge, operating income increased 25% and 23% in constant currency, and earnings per share was $2.93 – which increased 26% and 23% in constant currency. Results exceeded expectations and we delivered another quarter of double-digit top and bottom-line growth. While Microsoft primarily focuses on providing a broader digital solutions portfolio far more expansive than just immersive solutions, the complete lack of XR in the call is interesting – especially considering that under a year ago, the firm’s investments into XR seemingly dropped in favour of genAI investments only to pick up mid-year. The firm is still deploying its immersive solutions for enterprise end-users worldwide, working with clients such as the US Army, Boeing, and SNC-Lavalin. Moreover, in January, the firm dropped a major Microsoft Mesh update introducing immersive VR meeting features to the popular Teams video conferencing platform. So not all is lost. However, on the hardware side, no new hardware is close to confirmation, even if its devices are still in use. However, again, the HoloLens 2 is dormant. Will this mark the last beats for the device, or is it just a bump in the road? There may be many reasons for XR’s dormancy during Microsoft’s most recent earnings call. Notably, the main reason is the clearly outperforming nature of Microsoft’s genAI and Cloud investments, which are taking centre stage over XR for the leading digital solutions firm. CEO Satya Nadella noted: It was a record quarter, driven by the continued strength of the Microsoft Cloud, which surpassed $33 billion in revenue, up 24%. We’ve moved from talking about AI to applying AI at scale. By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains. The firm sees this success via a new “models as a service,” according to Nadella, that “makes it easy for developers to use LLMs from our partners like Cohere, Meta, and Mistral on Azure without having to manage the underlying infrastructure,” he remarked. Nadella also explained that Microsoft’s Azure AI platforms have roughly 53,000 customers, and “over one-third are new to Azure over the past 12 months.” Nadella added: Overall, we are seeing larger and more strategic Azure deals, with an increase in the number of billion-dollar-plus Azure commitments. Vodafone, for example, will invest $1.5 billion in cloud and AI services over the next 10 years as it works to transform the digital experience of more than 300 million customers worldwide. “We’re also using this AI moment to redefine our role in business applications,” said Nadella. It is clear that the fledging AI landscape is a fruitful one for Mccriosoft, with clear financial benefits for the company, compared to what has been a rocky XR road for Microsoft over the past two years. So, it is understandable that Microsoft may be turning away from XR again despite revving up the engines for what felt like a second wind in the space. Nadella added: On to the future of work. A growing body of evidence makes clear the role AI will play in transforming work. Our own research, as well as external studies, show as much as a 70% improvement in productivity using generative AI for specific work tasks. And, overall, early Copilot for Microsoft 365 users were 29% faster in a series of tasks like searching, writing, and summarizing. Two months in, we’ve seen faster adoption than either our E3 or E5 suites as enterprises like Dentsu, Honda, Pfizer all deploy Copilot to their employees. “In 2024, AI will become a first-class part of every PC,” he also explained. Seemingly, all focus is on AI for Microsoft, which believes its alliance with the leading genAI firm OpenAI is proving incredibly successful. Even in the firm’s gaming part of its earnings call – the most conventional XR use case – Microsoft did not mention XR in any capacity; again, understandably referring to the power of AI in this space also. In closing, Nadella explained: This generation of AI is going to be different. It started with the move from 2.5 to 3 of GPT, and then it’s used inside of developer scenario with GitHub Copilot. And so, yes, I think this is the place where it’s most evolved in terms of its economic benefits or productivity benefits. All this may not put a nail in Microsoft’s XR coffin. The firm has many plates to spin, and XR is just one of many worthwhile investments for the firm. Moreover, with the rise of the Vision Pro, the firm may be reevaluating its stance on XR hardware and software – after all, Microsoft used spatial computing way before Apple. Microsoft also distributes immersive versions of its productivity solutions on Meta and Apple MR headsets, so the firm is still active in XR. However, the depth of its investments may reduce in favour of AI once again. Mixed Reality Tencent Involved in Apple Vision Pro’s China Launch – Reports Mixed Reality Will Apple Debut the Vision Pro In China this Year? Mixed Reality Could Major XR Partnerships Offset High-Risks and Costs? Mixed Reality XR Cloud Streaming to Break Down Enterprise Barriers, says Innoactive Mixed Reality IDC Predicts Surge in AR and VR Headset Shipments Mixed Reality Big XR News from NVIDIA GTC, Apple, LG, and HTC VIVE Share This Post Mixed Reality Tencent Involved in Apple Vision Pro’s China Launch – Reports Mixed Reality Will Apple Debut the Vision Pro In China this Year? Mixed Reality Could Major XR Partnerships Offset High-Risks and Costs? Get our Free Weekly Newsletter, straight to your inbox! Handpicked News, Reviews and Insights delivered to you every week. Tech Industries Trending Topics Featured Brands About More All content © Today Digital 2024 "
}