{
    "title": "Microsoft breaks silence - Business Update due next week",
    "date": "2/5/2024",
    "url": "https://xboxera.com/2024/02/05/microsoft-breaks-silence-business-update-due-next-week/",
    "text": "Following our report regarding Starfield and Microsoft’s 3rd Party plans yesterday, many gamers, and particularly Xbox fans, have been demanding answers from Xbox and Microsoft. Those questions were further amplified when The Verge’s Tom Warren reported similar plans being mulled for Indiana Jones, which was only recently revealed during the Developer_Direct in January. Now we have a tentative timeframe for a detailed response, per a tweet from Phil Spencer today. We're listening and we hear you. We've been planning a business update event for next week, where we look forward to sharing more details with you about our vision for the future of Xbox. Stay tuned. Many may be surprised that it isn’t sooner, but I think the team at Xbox are doing what they have always done, and are listening to the feedback intently. Taking the extra time to do that before delivering this update is crucial, and for many Xbox fans, this will be the final chance for Microsoft to successfully communicate what their new strategy actually is, and why it should be supported. Either way, Microsoft have one hell of an uphill battle ahead.   It’s double or nothing, they can really take advantage of this buzz to clarify the situation, announce that the big exclusions will remain on Xbox, that they will be able to launch small games 1 or 2 years later on multiplatform, some GAAS, announce the next Xbox, announce the next activivision games in the gamepass. And there, what was bad buzz can turn into good buzz, the Xbox brand will be grown, they will sell gamepass, they will sell consoles, they will sell games. Because everyone will talk about it, everyone will know that Indiana Jones, Gears 6, Blade, Fable, etc… will only be released on Xbox / PC / cloud / mobile (which is already not bad, Xbox remains an ecosystem much more open than playstation). It must be clear, without ambiguity, to kill current rumors and kill future false information. On the other hand, if it is to announce that Xbox is going to release everything from the competition day one. It’s over for the Xbox brand, not just the consoles, for the Xbox brand it’s over! They will become a small publisher that no one talks about anymore, it will become the brand that abandoned, the brand will be devalued, the games will be devalued, no one will be there to defend the Xbox brand, they will be prey to trolls and PlayStation players who will criticize the xbox games that are released on their platforms. The Xbox brand exists because there are Xbox players, Xbox sites, mainstream sites that talk about Xbox because it is a publisher AND a console and hardware manufacturer. If tomorrow. If tomorrow, everything is multiplatform, no more consoles, no more hardware, no more branding, no more third-party publishers who make games for Xbox, no more marketing which holds essentially because Xbox has a console. And that will result in fewer games, fewer gamepass subscribers, fewer sales of everything. It will become like Sega, which will fall into oblivion. What Xbox must understand is that having a big community like Xbox players behind you is a strength, a privilege, an opportunity, they must use it to move forward and not go against them, that would be a very serious and irreversible error. Great different outlook on how the new “moves” of XBox can be not so to they’re advantage. I did think the no consoles approach would be great.. From watching “media” of it. Also an entire console history video on YT, “proclaiming” that streaming will be the future (w/ time). XBox heading in that direction w/ the “defeat” from PS is a great move for the future of XBox & gaming. New rumour: New Xboxes would be planned in 2026 including a portable model like the Switch https://twitter.com/IdleSloth84_/status/1754828376697721318 This site uses Akismet to reduce spam. Learn how your comment data is processed. Business Enquiries:     [email protected] XboxEra Privacy Policy\nXboxEra Scoring Policy\nMeet The Team  Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}