{
    "title": null,
    "date": "2/11/2024",
    "url": "https://investorplace.com/2024/02/the-microsoft-money-machine-why-ai-will-help-msft-stock-outperform-in-2024/",
    "text": " According to my MSFT stock forecast, AI and PCs will keep driving revenue Advertisement Source: The Art of Pics / Shutterstock.com My Microsoft (NASDAQ:MSFT) stock forecast considers the company’s recently strong second-quarter results. They show the conglomerate is benefiting from both the AI revolution and the rising demand for PCs. These trends will likely continue to boost MSFT stock. Azure and the PC software business will benefit from AI tools, while rebounding PC sales are also likely boosting the company. Its operating system and software are bundled in most PCs. Finally, given the tremendous abilities of its CEO, Satya Nadella, I have great faith that the firm will perform very well over the long term. Microsoft reported better-than-expected results for its quarter that ended on Dec. 31. Azure revenue jumped 30% versus the same period a year earlier. The sales of its Productivity and Business Processes unit, which features its Windows operating system, climbed 13% year-over-year. Finally, More Personal Computing, which features the firm’s software offerings, jumped 18.6% versus the same period a year earlier. The demand for AI tools added six percentage points onto Azure’s year-over-year revenue growth last quarter. Meanwhile, the firm likely benefited significantly from increased demand for PCs, as its partner, chip maker Intel noted that the revenue of its “division that handles PC chips rose 33% to $8.8 billion in the fourth quarter,” versus the same period a year earlier. On the PC front, Microsoft is likely to benefit from increased interest in AI-powered PCs. As I’ve noted in past columns, such PCs have many more capabilities than computers using solely cloud-based PCs. Meanwhile, MSFT is likely to get a big revenue and profit boost from increased demand for Copilot, its AI-powered assistant that the company has started to market. Indeed, CEO Satya Nadella reported on the company’s earnings call last month that 1 million of the firm’s customers were already using Copilot just several months after its launch. Finally, Azure’s growth is likely to continue to accelerate going forward as its revenue fro mselling AI-powered tools continues to expand. Providing evidence for that assertion, Wedbush analyst Dan Ives, noted that more than 60% of the firm’s current corporate customers will incorporate AI “over the next few years.” Ives believes that MSFT is in the early stages of a major monetization opportunity. Also encouragingly, Nadella compared the AI revolution to the early days of widespread PC adoption in the 1990s. Of course, that turned into one of the hugest trends of modern tech history and produced huge windfalls for Microsoft and MSFT stock. Nadella has proven to be extremely adept at correctly identifying “the next big thing” and adeptly exploiting that. He embraced the Cloud revolution 15 years ago and the AI trend last year. Because of that strong history, I’m convinced that he will enable Microsoft to thrive and deliver very strong growth for many years to come. On the negative side, MSFT stock ,changing hands at a forward price-earnings ratio of 36, is certainly not cheap. Therefore, I don’t think that it will deliver huge returns over the next year or two. Still, I believe that its returns will outpace those of the S&P 500, and it is worth buying for relatively conservative investors who want exposure to Big Tech and the AI Revolution. On the date of publication, Larry Ramer held a long position in INTC. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. Technology, Artificial Intelligence, Cloud, Consumer Discretionary, Retail, Software   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/the-microsoft-money-machine-why-ai-will-help-msft-stock-outperform-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}