{
    "title": "Nvidia tops $2 tn valuation; now Wall Street's third most valuable behind \nMicrosoft, Apple",
    "date": "3/2/2024",
    "url": "https://www.firstpost.com/world/nvidia-tops-2-tn-valuation-now-wall-streets-third-most-valuable-behind-microsoft-apple-13744244.html",
    "text": "With its market capitalization of $2.06 trillion following Friday’s surge, Nvidia is now the third most valuable business on Wall Street, behind Apple and Microsoft, which are valued at $2.77 trillion and $3.09 trillion, respectively After an encouraging report from Dell Technologies, Nvidia’s opens new tab stock market value closed above $2 trillion for the first time on Friday, igniting Wall Street’s AI-fueled rise. After Dell, a retailer of high-end servers equipped with Nvidia chips, provided an optimistic prognosis late on Thursday indicating a spike in orders for its AI-optimized servers, Nvidia’s shares increased by 4%. Dell’s stock shot up as much as 38% to a new high, and it ended the day up 32%. With its market capitalization of $2.06 trillion following Friday’s surge, Nvidia is now the third most valuable business on Wall Street, behind Apple and Microsoft, which are valued at $2.77 trillion and $3.09 trillion, respectively. Super Micro Computer, opens new tab, another company that sells servers made with Nvidia’s chips, jumped 4.5%. Other chipmakers exposed to AI rallied to record highs, with Broadcom, opens new tab and Marvell Technology, opens new tab each up about 8%, while Advanced Micro Devices, opens new tab climbed over 5%. The PHLX chip index, opens new tab rallied 4.3% to its own record high, lifting its 2024 gain to 18%. Nvidia controls about 80% of the high-end AI chip market, with customers including ChatGPT creator OpenAI, Microsoft, opens new tab, Alphabet, opens new tab and Meta Platforms, opens new tab snapping up tight supplies of its components to compete in the fast-emerging generative AI sector. The company has recently become Wall Street’s most traded stock by value, day to day, replacing Tesla, opens new tab. Investors exchanged $36 billion worth of Nvidia’s stock on average over the past 30 sessions, compared to $21 billion a day for Tesla. Trading in Nvidia on Friday reached $38 billion worth of shares. On Feb. 23, the Santa Clara, California-based company added $277 billion in stock market value in just one session, a Wall Street record, after it forecast a roughly threefold surge in quarterly revenue. Nvidia’s stock has now risen 66% in 2024 after more than tripling last year. Last month, its stock market value overtook Amazon, opens new tab and Alphabet. A week ago, Nvidia’s stock market value edged above $2 trillion for the first time before receding by the end of the session. Saudi Aramco, opens new tab has a $2.045 trillion market capitalization, although over 90% of it is closely held by the government of Saudi Arabia and less than 2% of its shares are available for trading by investors, according to LSEG data. Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}