{
    "title": "Microsoft to remove WordPad in upcoming Windows 11 24H2 update",
    "date": "3/27/2024",
    "url": "https://mspoweruser.com/microsoft-to-remove-wordpad-in-upcoming-windows-11-24h2-update/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on March 28, 2024 published on \n\nMarch 28, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Microsoft has announced the removal of WordPad, the basic text editor application, in the forthcoming Windows 11 version 24H2 update, aka this year’s annual feature update and Windows Server 2025. This change is expected to occur sometime later in 2024. [Update – March 2024]: WordPad will be removed from all editions of Windows starting in Windows 11, version 24H2, and Windows Server 2025. If you’re a developer and need information about the affected binaries, see Resources for deprecated features. For editing plain text files (.txt), Microsoft recommends using the built-in Notepad application. On the other hand, for editing rich text documents (.rtf), Microsoft suggests using the paid Microsoft Word application. A free web version of Microsoft Word is also available, but it requires a Microsoft account and internet access. WordPad will remain available on Windows 10 devices until the operating system reaches its end of support in October 2025. More here. Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}