{
    "title": "Meet Pavan Davuluri, IIT Madras graduate, who is now Microsoft Windows boss",
    "date": "3/26/2024",
    "url": "https://newsable.asianetnews.com/business/meet-pavan-davuluri-iit-madras-graduate-who-is-now-microsoft-windows-boss-gcw-sazttc",
    "text": "Davuluri has worked for over 23 years at Microsoft and was involved in its work with Qualcomm and AMD to create processors for Surface.  He is the latest Indian to take on a leadership role at a Big Tech company much like Google's Sundar Pichai and Microsoft's Satya Nadella. An IIT Madras alumnus, Pavan Davuluri was named Microsoft Windows and Surface's new chief, becoming the latest Indian to assume a leadership position at a Big Tech business, following in the footsteps of Microsoft's Satya Nadella and Google's Sundar Pichai. Davuluri takes over from longtime product chief Panos Panay who left the department to join Amazon last year. Mikhail Parakhin was the head of the Windows division, while Davuluri was in charge of the Surface group earlier. He has taken over the Surface and Windows departments following the resignations of Panay and Parakhin. Parakhin took charge of Windows, alongside his existing responsibilities as CEO of Web and Advertising at Microsoft, overseeing products such as Bing, Edge, and Copilot. An internal memo from Rajesh Jha, Microsoft's head of experiences and devices, accessed by The Verge outlined the new hierarchy in the organisation. He said the decision will help the organisation to take a \"holistic approach\" to build its devices and experiences in the \"AI era\". \"We are uniting the Windows Experiences and Windows + Devices teams as a fundamental component of the Experiences + Devices (E+D) division as part of this transition. This will allow us to design silicon, systems, experiences, and gadgets for this AI age across Windows client and cloud in an integrated manner,\" he said. Davuluri has been with Microsoft for over 23 years and was involved in its collaboration with Qualcomm and AMD to develop CPUs for Surface. Microsoft recently appointed DeepMind co-founder Mustafa Suleyman as CEO of a new AI division. With this Mikhail Parakhin's team has been absorbed into the new AI division. This comes as Microsoft is expected to unveil new next-generation AI features and Arm-based Surface hardware soon. TCS begins freshers' hiring! You can apply till April 10; Here's how you can apply Explained: Why is government mulling geo-tagging telecom infrastructure? Ambani and Adani ink 'power' deal; Reliance to buy 26% stake in Mahan Energen Kerala: Gold rate sets record for first time; One sovereign gold crosses Rs 50000 Lok Sabha Polls 2024: INC's DK Suresh files nomination, declares assets worth Rs 1064 crore in real estate Mitchell Starc's struggles in IPL 2024: Former Indian all rounder Irfan Pathan offers advice False promises turn into nightmare for cousins: 2 men from Haryana tortured for refusing to join Russian army Biden reveals World leaders' concerns about Trump winning 2024 Presidential polls at India's G20 summit Why does Imran Khan pay Rs 9 lakh to Karan Johar every month? Should we wash our hair daily? From AI to UPI, what Bill Gates and PM Modi will discuss during interaction in Delhi (WATCH) Bengaluru water crisis: Residents under scrutiny for defying orders on Holi pool parties, rain dance (WATCH) Colours of Holi in Washington DC's Dupont Circle (WATCH) Groundbreaking! India becomes largest gaming market worldwide with 568 million gamers (WATCH) Delhi man stabs woman in Mukherjee Nagar for 'making fun of him'; video viral on social media (WATCH) Follow us on: "
}