{
    "title": "Business News | Gujarat: Microsoft Co-founder Bill Gates Enjoys Regional \nFood in Narmada",
    "date": "3/1/2024",
    "url": "https://www.latestly.com/agency-news/business-news-gujarat-microsoft-co-founder-bill-gates-enjoys-regional-food-in-narmada-5793664.html",
    "text": "Narmada (Gujarat) [India], March 1 (ANI): Microsoft co-founder and philanthropist Bill Gates, who is on a visit to India, enjoyed delicacies of Gujarat in the Narmada district on Friday. Gates is scheduled to attend the pre-wedding festivities of Ananat Ambani and Radhika Merchant in Gujarat's Jamnagar. Also Read | New Species of Green Anaconda Identified in Amazon. Earlier today, he reached the Narmada district of Gujarat where he visited 'Arogya Van' (Herbal garden), popular for its wide range of medicinal plants and health-related landscapes. The co-founder of the tech giant was seen interacting with people. Also Read | Meta Took Down '17.8 Million' Pieces of Bad Content for Facebook and '4.8 Million' for Instagram in January 2024 in India: Report. Meanwhile, a wide range of regional food items ranging from Thepla (Gujarati dish), fritters, laddoo (sweet), lady-finger juice, and Rice 'Kheenchu' (Gujarati dish) were served to him. A day earlier, Gates and Prime Minister Narendra Modi held a dialogue centred around harnessing the power of artificial intelligence (AI) for the greater good of the public. The leaders expressed their shared commitment to sectors that hold the potential to enhance the planet and uplift millions worldwide. \"A wonderful meeting indeed! Always a delight to discuss sectors which will make our planet better and empower millions of people across the globe,\" said Prime Minister Modi in a post on X. The two also discussed DPI, women-led development. Microsoft co-founder Gates also emphasised the lessons learned from India and spreading them across the world. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body) Copyright © Latestly.com All Rights Reserved. "
}