{
    "title": null,
    "date": "3/4/2024",
    "url": "https://windowsreport.com/windows-7-esu/",
    "text": "Follow us Share this article Improve this guide 3 min. read Updated on March 4, 2024 updated on \n\nMarch 4, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more For those of you still using Windows 7, you probably already know that the end of support will be coming on the 14th of January 2020. Your PC will still function normally, but it will become more vulnerable to security threats. This is because the end of support for Windows 7 means you will no longer benefit from: Now, this may not seem all that much of a deal for the general consumer, but for those of you that own business, this also means the end of Windows 7 for Business as well. Thankfully, Microsoft is offering Extended Security Updates, also known as ESUs, but it won’t be free. Extended Security Updates will only be available for an extra 3 years after the official end of life of Windows 7. This means that your Windows 7 will still be able to run at full parameters until January 2023. ESUs will be available for Windows 7 Enterprise and Windows 7 Pro. The price varies based on how long you want to benefit from the ESUs, and what version of Windows 7 you are running. As such, here are some official prices as reported by Microsoft: Windows 7 Enterprise Windows 7 Pro Organizations can get extended support whenever they want during the 3-year period it is available. However, you need to remember that in order to make purchases in the 2nd and 3rd years, you will need to also pay all prior years. This means that paying straight from the 3rd year will end up costing you a total of 175$ per device on Windows Enterprise, and 350$ on Windows 7 Pro. More so, keep in mind that users are charged on a per device basis, and there is no discount for multiple devices. If they have the necessary resources to leverage Windows Virtual Desktop in Azure, they can get free Extended Security Updates for 3 more years. Additionally, Microsoft 10 Business comes with a free upgrade for users with a Windows 7, 8, or 8.1 Pro license on their device. The subscriptions will give you access to cumulative security updates over the next 12 months. Technical assistance will be provided only on a best effort basis, as no bug filing or fixing will be available. We also have a guide on how to download the crucial Windows 7 KB4474419 update, so don’t miss it. If you have any further questions about the Windows 7 ESUs, let us know in the comments section below. RELATED ARTICLES YOU SHOULD CHECK OUT: More about the topics: windows 7 Teodor Nechita Eager to help those in need, Teodor writes articles daily on subjects regarding Windows, Xbox, and all things tech-related.\nWhen not working, you may usually find him either at the gym or taking a stroll in the park, trying to find inspiration for the next articles he may write. Teodor Nechita Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}