{
    "title": "Sunrun Inc. (NASDAQ:RUN) Director Lynn Michelle Jurich Sells 2,836 Shares",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-run-insider-buying-and-selling-2024-03-19/",
    "text": "Sunrun Inc. (NASDAQ:RUN - Get Free Report) Director Lynn Michelle Jurich sold 2,836 shares of the business's stock in a transaction that occurred on Monday, March 18th. The shares were sold at an average price of $10.01, for a total transaction of $28,388.36. Following the completion of the sale, the director now directly owns 1,399,810 shares in the company, valued at approximately $14,012,098.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Lynn Michelle Jurich also recently made the following trade(s): On Wednesday, March 6th, Lynn Michelle Jurich sold 1,269 shares of Sunrun stock. The shares were sold at an average price of $12.12, for a total transaction of $15,380.28. On Thursday, February 29th, Lynn Michelle Jurich sold 4,830 shares of Sunrun stock. The shares were sold at an average price of $12.12, for a total transaction of $58,539.60. Sunrun Trading Up 1.3 % Shares of RUN traded up $0.13 during mid-day trading on Tuesday, reaching $10.39. The company's stock had a trading volume of 10,049,238 shares, compared to its average volume of 14,523,438. The stock has a market cap of $2.28 billion, a PE ratio of -1.39 and a beta of 2.45. The company has a current ratio of 1.26, a quick ratio of 0.96 and a debt-to-equity ratio of 1.68. Sunrun Inc. has a 52 week low of $8.43 and a 52 week high of $23.85. The company's fifty day moving average price is $13.78 and its two-hundred day moving average price is $13.53. Sunrun (NASDAQ:RUN - Get Free Report) last announced its quarterly earnings data on Wednesday, February 21st. The energy company reported ($1.33) earnings per share for the quarter, missing analysts' consensus estimates of ($0.13) by ($1.20). Sunrun had a negative return on equity of 5.58% and a negative net margin of 71.00%. The business had revenue of $516.59 million during the quarter, compared to the consensus estimate of $499.74 million. On average, analysts predict that Sunrun Inc. will post -1.99 earnings per share for the current fiscal year. Institutional Investors Weigh In On Sunrun Hedge funds and other institutional investors have recently added to or reduced their stakes in the company. Barclays PLC raised its holdings in Sunrun by 207.4% during the 2nd quarter. Barclays PLC now owns 1,037,529 shares of the energy company's stock valued at $18,531,000 after buying an additional 699,992 shares during the last quarter. Zweig DiMenna Associates LLC raised its holdings in Sunrun by 64.8% in the 3rd quarter. Zweig DiMenna Associates LLC now owns 206,913 shares of the energy company's stock worth $2,599,000 after purchasing an additional 81,363 shares in the last quarter. Deutsche Bank AG raised its holdings in Sunrun by 112.9% in the 3rd quarter. Deutsche Bank AG now owns 2,226,821 shares of the energy company's stock worth $27,969,000 after purchasing an additional 1,180,823 shares in the last quarter. Jump Financial LLC raised its holdings in Sunrun by 87.8% in the 3rd quarter. Jump Financial LLC now owns 97,123 shares of the energy company's stock worth $1,220,000 after purchasing an additional 45,412 shares in the last quarter. Finally, Vontobel Holding Ltd. raised its holdings in Sunrun by 167.7% in the 3rd quarter. Vontobel Holding Ltd. now owns 276,923 shares of the energy company's stock worth $3,478,000 after purchasing an additional 173,477 shares in the last quarter. 91.69% of the stock is currently owned by institutional investors. Wall Street Analyst Weigh In RUN has been the subject of several recent analyst reports. Jefferies Financial Group initiated coverage on shares of Sunrun in a research note on Friday, December 15th. They set a \"buy\" rating and a $25.00 price objective for the company. Morgan Stanley reduced their price objective on shares of Sunrun from $26.00 to $24.00 and set an \"overweight\" rating for the company in a research note on Friday, December 8th. Oppenheimer reaffirmed an \"outperform\" rating and set a $19.00 price objective on shares of Sunrun in a research note on Thursday, February 22nd. Janney Montgomery Scott cut shares of Sunrun from a \"buy\" rating to a \"neutral\" rating in a research note on Tuesday, February 27th. Finally, BMO Capital Markets boosted their price objective on shares of Sunrun from $18.00 to $20.00 and gave the company a \"market perform\" rating in a research note on Thursday, February 22nd. One research analyst has rated the stock with a sell rating, seven have assigned a hold rating and fourteen have issued a buy rating to the company. Based on data from MarketBeat.com, the stock presently has a consensus rating of \"Moderate Buy\" and a consensus target price of $21.85. View Our Latest Stock Analysis on RUNSunrun Company Profile (Get Free Report) Sunrun Inc designs, develops, installs, sells, owns, and maintains residential solar energy systems in the United States. It also sells solar energy systems and products, such as panels and racking; and solar leads generated to customers. In addition, the company offers battery storage along with solar energy systems; and sells services to commercial developers through multi-family and new homes.Read MoreFive stocks we like better than SunrunThe Role Economic Reports Play in a Successful Investment StrategyGrowing Twice as Fast as Tesla, XPeng is a Buy3 Healthcare Dividend Stocks to Buy4 Stocks Building Long-Term Value for Shareholders Canada Bond Market Holiday: How to Invest and Trade FedEx Stock Has Analysts Upgrading in Bulk, a Sudden DiscountThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Trump’s “Tax Free” Retirement Strategy  (From Gold Safe Exchange) (Ad)Should you invest $1,000 in Sunrun right now?Before you consider Sunrun, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Sunrun wasn't on the list.While Sunrun currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 7 Energy Stocks to Buy and Hold ForeverDo you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Sunrun, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Sunrun wasn't on the list. While Sunrun currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Do you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}