{
    "title": "Deleting complete chat history in Edge Copilot will no longer be painful",
    "date": "3/28/2024",
    "url": "https://mspoweruser.com/deleting-complete-chat-history-in-edge-copilot-will-no-longer-be-painful/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on March 29, 2024 published on \n\nMarch 29, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes A few days ago, Microsoft said it’s confident that Copilot will be profitable in the long run even if it’s struggling right now. That’s why it keeps improving the chatbot across all platforms, including the Microsoft Edge browser. One of the major features for Edge’s Copilot Microsoft was spotted working is making it super easy for users to delete the complete chat history. You can access Copilot from Edge’s sidebar to ask questions, generate images, and resume a chat from the chat history. However, while you can delete an individual chat easily, erasing the complete chat history is painful, especially if you have a lot of it. Deleting different chat records one by one is the only way to delete the complete chat history, which takes a lot of time and effort. However, the good news is Microsoft is fixing this in Edge Copilot. As spotted by famed leaker @Leopeva64, Microsoft Edge will allow users to delete the complete chat history with a couple of clicks instead of deleting each record one at a time. According to a demo posted by the leaker, Microsoft Edge will have a three-dot view setting beside the Plug-ins in the Recent section, and clicking on it will give you the Delete all chat history option. You can now delete your entire chat history with a couple of clicks in Edge Copilot, previously you had to delete the different entries one by one, and the layout of the chat box has changed, now all the buttons appear at the bottom and on the right side:https://t.co/8nGPp3h608 pic.twitter.com/nzJuON9Mrw Deleting all chats at once is currently in the testing phase, so even if you’re running the latest version of Edge, you won’t see it. We haven’t been able to get it working in Edge Canary and Dev, either. This could mean two things: either it’s available for select users or Microsoft is internally testing it and hasn’t rolled it out to Edge Insiders. If you’re using Edge Canary or Dev, do see the option to delete all chat history? Let us know in the comments section below. Joe Rogun Tech Journalist Joe is a Journalist, with years of experience in covering software, primarily Windows and Android. She also loves to share her opinions on diverse tech topics. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Joe Rogun Tech Journalist Joe is a Journalist, with years of experience in covering software, primarily Windows and Android. She loves to share her opinions on diverse tech. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}