{
    "title": "Microsoft may debut its first 'AI PCs' later this month",
    "date": "3/13/2024",
    "url": "https://ca.news.yahoo.com/microsoft-may-debut-its-first-ai-pcs-later-this-month-204522580.html",
    "text": "Microsoft will reveal the Surface Pro 10 and Surface Laptop 6 on March 21, according to a report. This isn't likely to just be a matter of a hardware refresh, however. Microsoft is expected to call these systems its first AI PCs, as Windows Central notes. The devices are set to be equipped with new Intel Core Ultra or Qualcomm Snapdragon X Elite-based processors that feature the latest neural processing units (NPUs) to boost AI capabilities. They're said to approximately match the iPad Pro and MacBook Pro in terms of efficiency and performance. The Surface Pro 10 and Surface Laptop 6 are expected to be among the first machines to support upcoming AI features in Windows 11. Along with on-device Copilot support, these functions are expected to include real-time live captions and translations, upscaling for games, frame rate smoothing, upgraded Windows Studio Effects and something that (at least for the time being) is seemingly called AI Explorer. Windows Central suggests the latter will be the feature that sets AI PCs apart from regular computers. AI Explorer will apparently work across any app and let you search through documents, web pages, images and chats using natural language. It's believed that the feature will create a history of everything you do on your computer and make it searchable. The tool is said to be capable of understanding context and suggesting tasks based on what's on the screen. AI Explorer is also expected to support text-based image editing. According to the report, these AI features are likely to roll out as part of this fall's 24H2 update for Windows 11. As for what else to expect from Microsoft's next laptops, both are said to have all-day battery life. The Surface Pro 10 is slated to include an anti-reflective, HDR-capable OLED screen. Rumors suggest it will have a front-facing ultrawide webcam and an NFC reader. The Surface Laptop 6 is believed to have a more significant redesign compared with its predecessors. Along with thinner bezels and rounded corners, it's expected to have a haptic touchpad, a dedicated key for Copilot and a revamped group of ports. It's also slated to be the first Surface Laptop with an Arm variant (it's worth noting that we had major reservations about the Arm-powered Surface Pro 9). The report suggests that the Intel versions of the Surface Laptop 9 and Surface Pro 10 will ship in April, with the Snapdragon variants to follow in June. AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. Ping Ping Ping A Boston Dynamics SPOT robot that was sent inside a home by Massachusetts state police was shot three times by a person barricaded inside. As the Associated Press reports, the robotics company believes it's the first time one of its robotic dogs has been shot. The remotely-controlled quadruped was deployed earlier this […] Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. Researchers have developed a robot that can anticipate your smile and return it almost instantly. The work, published as a study in the journal Science Robotics, is intended to help human-looking robots act more naturally. Named \"Emo,\" the bot can predict your smile about 840 milliseconds before it actually appears. Then just as the smile […] HONG KONG (AP) — Chinese telecoms gear company Huawei Technologies has reported its profit more than doubled last year as its cloud and digital businesses thrived in spite of U.S. sanctions. The Shenzhen-based company reported a net profit of 87 billion yuan ($12 billion), helped by strong sales and an improved product portfolio. Revenue jumped nearly 10% from a year earlier, to 704.2 billion yuan ($97.4 billion). Huawei’s rotating chairman Ken Hu said the company’s figures were in line with for  (Bloomberg) -- Apple Inc.’s overseas suppliers have ramped up production of the company’s long-anticipated new iPads and a launch is planned for early May, according to people with knowledge of the matter. Most Read from BloombergFed’s Preferred Inflation Metric Cools While Spending ReboundsBank of Russia Sees No Alternative to Yuan for Its ReservesPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said. Spot, a robotic dog created by tech company Boston Dynamics, is being used across the nation to help assist law enforcement in the field. IBKR EventTrader - Trade on where daily CME futures prices will close (Bloomberg) -- Huawei Technologies Co. sustained its run of strong quarterly profit growth, building on the resurgence of its consumer business against Apple Inc.’s iPhone and the rise of its cloud division against incumbent Alibaba Group Holding Ltd.Most Read from BloombergFed’s Preferred Inflation Metric Cools While Spending ReboundsBank of Russia Sees No Alternative to Yuan for Its ReservesPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergFed’s Preferred Inflation Metric Cools While Spending ReboundsBank of Russia Sees No Alternative to Yuan for Its ReservesPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens Chinese state-sponsored hackers are targeting critical infrastructure. Here’s what they’re doing, how the US government is responding and how you can help. ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of The company is among the fastest-growing cybersecurity players based on my peer analysis 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ Caution is needed even with this famous tech behemoth and its fast-growing services business Handout / ReutersKing Charles avoided referring directly to his or Kate Middleton’s recent health travails in a special Easter message broadcast Thursday, but praised those who “extend the hand of friendship” in times of need and overtly extolled “Christian” virtues.The pre-recorded audio message was played at the traditional Maundy Thursday service at which the monarch hands out symbolic alms called “Maundy money” to individuals who have performed “outstanding Christian service.”The king did no Trump's former national security adviser shut down a comparison between the ex-president and Julius Caesar.  TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Victoria’s Secret's wedding-inspired collection includes corsets, bras, thongs and more sexy apparel A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. "
}