{
    "title": null,
    "date": "3/12/2024",
    "url": "https://readwrite.com/microsoft-mocked-after-developer-account-shares-hideous-ai-image/",
    "text": "Graeme Hanna is a full-time, freelance writer with significant experience in online news as well as content writing. Since January 2021, he has contributed as… Sam Shedden is an experienced journalist and editor with over a decade of experience in online news. A seasoned technology writer and content strategist, he… As far as extolling the virtues of artificial intelligence (AI) goes, in tandem with promoting a strong, vibrant brand identity, Microsoft appears to have dropped a masterclass on how not to do it. The US tech giant has been ridiculed after a developer shared what some called a “hideous” AI image, with significant potential to go viral on social media. The Microsoft update from its Windows Develop account on X was intended to detail support information when migrating from UWP to WinUI 3 platforms but it appears something has been lost, in transit perhaps? What's supported when migrating from UWP to WinUI 3 WinUI 3 and the Windows App SDK are new technologies and, when compared to UWP, there are some features that aren't supported. This topic lists which features are supported before you attempt migration.https://t.co/oLF44YayNv pic.twitter.com/2yQ6u9MGxe — Windows Dev Docs (@WindowsDocs) March 11, 2024   An AI image depicted the movement of boxed goods from one large vehicle to another, to represent the named platforms. However,  it is fair to say the reaction online has ranged from amusement to mockery. One Twitter user, @oacoello_ stated, “Microsoft UWP app development is as lazy as this AI image.” Another fired back with “That image is hideous. Don’t use AI for this.” @douglascamata was sharp in his commentary, opining “Running too short in cash to get a human designer to do properly illustrate this? The worst is that MS thought that this would be accepted on the internet without becoming an instant meme and source of mockery.” Then in a rather scathing and succinct critique, @pyke_64 unleashed the rebuke, “If this is a sign of the quality of your upscaling tech for PC, don’t bother.” That is just a selection of the responses on X, alone. Please tell me where I can get those versions of Windows pic.twitter.com/kcXr8doItL — Bronze (@Bronze87415846) March 12, 2024  It may have been intended as an informal or fun image to accompany the developer information, serving a purpose but the impact has been an unwanted one from a brand and PR perspective. Image: @WindowsDocs/X The ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines. Graeme Hanna is a full-time, freelance writer with significant experience in online news as well as content writing. Since January 2021, he has contributed as a football and news writer for several mainstream UK titles including The Glasgow Times, Rangers Review, Manchester Evening News, MyLondon, Give Me Sport, and the Belfast News Letter. Graeme has worked across several briefs including news and feature writing in addition to other significant work experience in professional services. Now a contributing news writer at ReadWrite.com, he is involved with pitching relevant content for publication as well as writing engaging tech news stories. Just in time for the Easter weekend’s activities, World War Z Aftermath is getting a brand-new free monster DLC. The patch adds six unique mutators to Challenge Horde Mode and...   By signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime. Explore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise. Explore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society. Empower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market. REGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website Registered Address: Clickout Media Ltd AA PH, Camilleri Buildings, Oratory Street, Naxxar, NXR 2504 Malta Company Number 103525. All Rights Reserved. "
}