{
    "title": "Why This Magnificent 7 Stock Just Hit An All-Time High",
    "date": "3/15/2024",
    "url": "https://www.valuewalk.com/why-magnificent-7-stock-hit-an-all-time-high/",
    "text": "Home » Stocks Microsoft (NASDAQ:MSFT) stock got a jolt on Thursday after the company announced the launch of a new product to help information technology and security professionals do their jobs better. Microsoft’s Copilot for Security is being touted as the first generative artificial-intelligence (GenAI) solution for the cybersecurity industry. Wall Street analysts are bullish on the launch, seeing this new product as another growth lever within the company’s portfolio of AI-fueled products. Microsoft stock hit an all-time high of $427 per share on Thursday morning but has since dropped back to roughly $417 per share on Friday. Year to date, Microsoft stock is up by about 13%, and it has climbed 52% over the past 12 months. Given the stock’s rapid rise to an all-time high, investors may be wondering if it’s too late to buy shares. Copilot for Security, set to debut Apr. 1, is designed to perform more quickly and accurately in addressing threats, with its capabilities informed by the over 78 trillion security signals processed by Microsoft each day. Experienced security professionals who used the product in its testing phase said it was, on average, 22 times faster and seven times more accurate than their previous systems. In fact, 97% said they wanted to use Copilot for Security the next time they do the same task. The software features a pay-as-you-go licensing model, which is meant to make it more accessible than other products because billing is based on how often it is used. This approach allows users to manage their usage and better control costs based on their needs and budget. Copilot for Security will be rolled out worldwide, as it can process and respond in eight languages and has a multilingual interface for 25 different languages. Several analysts weighed in on the news. In a research note, Wells Fargo (NYSE:WFC) analysts said the pricing model should encourage rapid adoption. They also expect it to add incremental earnings growth to the Azure platform in Microsoft’s fiscal fourth quarter, which ends June 30, and into fiscal 2025. Wells Fargo analysts maintained their Overweight rating on Microsoft and bumped up their price target to $460, which would be 10% higher than the current share price. Mizuho Securities analyst Gregg Moskowitz had a similar take, saying that the pricing model “will provide businesses a low-cost opportunity (initially) to pursue interesting cybersecurity use cases,” according to Investors Business Daily. He maintained his Buy rating and price target of $450 per share. JPMorgan Chase (NYSE:JPM) analyst Mark Murphy sees this GenAI product creating a “paradigm shift” for Microsoft in its security capabilities. He also sees Copilot for Security being a differentiator for the company in the marketplace. Murphy reiterated his Overweight rating and $440 price target for Microsoft. Microsoft’s leadership position in GenAI has largely driven its earnings over the past couple of years, and in the last earnings report, CEO Satya Nadella said the company is just scratching the surface. “We’ve moved from talking about AI to applying AI at scale,” Nadella said in the fiscal-Q2 earnings release on Jan. 30. “By infusing AI across every layer of our tech stack, we’re winning new customers and helping drive new benefits and productivity gains across every sector.” Copilot for Security seems to be an example of that strategy.Typically, when a stock races as high as Microsoft’s has in a span of a little more than a year, it could raise some red flags about its valuation. However, Microsoft is still at a relatively decent valuation at 31 times forward earnings, which is higher than the S&P 500’s average, although Microsoft certainly has more earnings power than the average S&P 500 company. Microsoft stock did drop a bit on Friday after hitting the all-time high on Thursday. It was down 2% on the day to around $417 per share, which is probably not a bad thing. Given the company’s outlook and strength in AI, the analysts’ price targets seem pretty reasonable.  Never Miss A Story! Subscribe to ValueWalk Newsletter. We respect your privacy. Subscribe  Subscribe ValueWalk.com is a highly regarded, non-partisan site – the website provides unique coverage on hedge funds, large asset managers, and value investing. Crypto promotions on this site do not comply with the UK Financial Promotions Regime and is not intended for UK consumers.  "
}