{
    "title": "Parkside Investments LLC Decreases Holdings in Microsoft Co. (NASDAQ:MSFT)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/parkside-investments-llc-decreases-holdings-in-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Parkside Investments LLC lessened its stake in shares of  Microsoft Co. (NASDAQ:MSFT – Free Report) by 5.6% in the fourth quarter, according to its most recent Form 13F filing with the SEC. The fund owned 8,422 shares of the software giant’s stock after selling 500 shares during the period. Parkside Investments LLC’s holdings in Microsoft were worth $3,440,000 as of its most recent SEC filing. A number of other large investors have also added to or reduced their stakes in MSFT. Vanguard Group Inc. boosted its position in  Microsoft by 1.0% during the third quarter. Vanguard Group Inc. now owns 634,238,715 shares of the software giant’s stock worth $147,714,197,000 after purchasing an additional 6,129,708 shares during the period.  State Street Corp boosted its position in  Microsoft by 0.7% during the third quarter. State Street Corp now owns 295,509,547 shares of the software giant’s stock worth $68,824,173,000 after purchasing an additional 1,951,554 shares during the period.  FMR LLC boosted its position in  Microsoft by 2.7% during the third quarter. FMR LLC now owns 215,874,152 shares of the software giant’s stock worth $68,162,263,000 after purchasing an additional 5,762,902 shares during the period.  Price T Rowe Associates Inc. MD boosted its position in  Microsoft by 0.3% during the second quarter. Price T Rowe Associates Inc. MD now owns 195,859,819 shares of the software giant’s stock worth $50,302,677,000 after purchasing an additional 556,020 shares during the period.  Finally, Moneta Group Investment Advisors LLC boosted its position in  Microsoft by 112,158.6% during the fourth quarter. Moneta Group Investment Advisors LLC now owns 150,187,424 shares of the software giant’s stock worth $36,017,948,000 after purchasing an additional 150,053,637 shares during the period. Hedge funds and other institutional investors own  71.13% of the company’s stock. In other Microsoft news, major shareholder Corp Microsoft sold 1,000,000 shares of the business’s stock in a transaction dated Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total value of $1,950,000.00. Following the completion of the transaction, the insider now owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The sale was disclosed in a legal filing with the SEC, which is available through this link. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of the company’s stock in a transaction dated Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the sale, the insider now owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. Also, insider Bradford L. Smith sold 3,303 shares of the company’s stock in a transaction dated Monday, February 5th. The shares were sold at an average price of $406.12, for a total transaction of $1,341,414.36. Following the sale, the insider now directly owns 570,826 shares of the company’s stock, valued at approximately $231,823,855.12. The disclosure for this sale can be found here. In the last 90 days, insiders sold 1,070,258 shares of company stock valued at $30,690,456. 0.03% of the stock is owned by insiders. MSFT has been the topic of several research reports. BMO Capital Markets lifted their price target on shares of Microsoft from $420.00 to $455.00 and gave the stock an “outperform” rating in a research note on Wednesday, January 31st. China Renaissance initiated coverage on shares of Microsoft in a research note on Tuesday, December 5th. They issued a “buy” rating and a $466.00 target price on the stock. Mizuho lifted their target price on shares of Microsoft from $420.00 to $450.00 and gave the stock a “buy” rating in a research note on Friday, December 15th. Jefferies Financial Group  reaffirmed a “buy” rating and issued a $465.00 target price on shares of Microsoft in a research note on Wednesday, March 6th. Finally, Wells Fargo & Company boosted their price objective on shares of Microsoft from $435.00 to $460.00 and gave the company an “overweight” rating in a research report on Wednesday, January 31st. Four research analysts have rated the stock with a hold rating and thirty-six have issued  a buy rating to the company’s stock. According to data from MarketBeat, the company currently has an average rating of “Moderate Buy” and a consensus price target of $423.34. Check Out Our Latest Stock Analysis on Microsoft Shares of Microsoft stock opened at $420.72 on Friday. Microsoft Co. has a 1 year low of $275.37 and a 1 year high of $430.82. The firm’s 50-day moving average is $410.82 and its 200 day moving average is $374.31. The company has a debt-to-equity ratio of 0.19, a current ratio of 1.22 and a quick ratio of 1.20. The stock has a market cap of $3.13 trillion, a price-to-earnings ratio of 38.04, a PEG ratio of 2.24 and a beta of 0.89. Microsoft (NASDAQ:MSFT – Get Free Report) last issued its earnings results on Tuesday, January 30th. The software giant reported $2.93 earnings per share for the quarter, topping analysts’ consensus estimates of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The business had revenue of $62.02 billion during the quarter, compared to analyst estimates of $61.14 billion. During the same quarter in the previous year, the firm earned $2.32 EPS. Microsoft’s revenue was up 17.6% on a year-over-year basis.  Sell-side analysts anticipate that  Microsoft Co. will post 11.63 EPS for the current fiscal year. The firm also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Shareholders of record on Thursday, May 16th will be given a $0.75 dividend. This represents a $3.00 dividend on an annualized basis and a yield of 0.71%. The ex-dividend date of this dividend is Wednesday, May 15th. Microsoft’s dividend payout ratio (DPR) is 27.12%. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. EVgo, Inc. (NYSE:EVGO) Shares Sold by PFG Investments LLC Affinity Wealth Management LLC Buys 394 Shares of Apple Inc. (NASDAQ:AAPL) "
}