{
    "title": "Microsoft and OpenAI forge $100 bn plan for ‘Stargate’ Supercomputer, a \ngame-changer in AI data centers: Report | Mint",
    "date": "3/29/2024",
    "url": "https://www.livemint.com/ai/artificial-intelligence/microsoft-and-openai-forge-100-bn-plan-for-stargate-supercomputer-a-game-changer-in-ai-data-centers-report-11711776000279.html",
    "text": "A collaboration between tech giants Microsoft and OpenAI is reportedly underway, with plans for a groundbreaking data center project that could see the emergence of an artificial intelligence supercomputer named \"Stargate\" by 2028, according to a recent report by The Information. The ambitious venture, which could carry a price tag of up to $100 billion, comes amidst a surge in demand for AI data centers capable of handling increasingly complex tasks driven by the rapid adoption of generative artificial intelligence technology. According to the report, talks about the proposal indicate that Microsoft is poised to lead the funding, a move anticipated to far surpass the expenses linked with present data center operations by a considerable extent. The envisioned supercomputer, slated to be situated in the United States, is anticipated to be the flagship installment in a series of similar projects planned over the next six years, as detailed by The Information. Reportedly, the project's roadmap, as outlined by Altman and Microsoft, encompasses five distinct phases, with \"Stargate\" positioned as the pinnacle achievement in the fifth phase. Preceding this, Microsoft is said to be currently developing a smaller-scale supercomputer slated for release around 2026. A substantial portion of the projected costs for the upcoming phases is attributed to the acquisition of specialized AI chips, an essential component for powering advanced AI capabilities. These chips, according to Nvidia CEO Jensen Huang, can command prices ranging from $30,000 to $40,000. Microsoft's vision for advancing AI capabilities is further underscored by its announcement last year of custom-designed computing chips, complementing its ambitious plans for the new supercomputing initiative, which is envisioned to accommodate chips from various suppliers. Projected expenses for the endeavor could exceed $115 billion, representing a significant increase compared to Microsoft's capital spending on infrastructure in the previous year, as noted by The Information. (With inputs from Reuters) Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}