{
    "title": "FTC Opens Inquiry Into Microsoft, Google, and Amazon, Over OpenAI and \nAnthropic Partnerships",
    "date": "1/25/2024",
    "url": "https://www.investopedia.com/ftc-opens-inquiry-into-microsoft-google-and-amazon-over-openai-and-anthropic-partnerships-8549836",
    "text": " Justin Sullivan / Getty Images The Federal Trade Commission (FTC) launched an inquiry into Google's parent company Alphabet (GOOGL), Amazon (AMZN), Anthropic, Microsoft (MSFT), and OpenAI generative artificial intelligence (GenAI) investments and partnerships on Thursday. The agency, which focuses on protecting consumers and maintaining a competitive market by enforcing antitrust laws, issued orders to the five companies to \"scrutinize corporate partnerships and investments with AI providers to build a better internal understanding of these relationships and their impact on the competitive landscape.\" \"History shows that new technologies can create new markets and healthy competition. As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity,\" FTC Chair Lina M. Khan said, adding that the \"study will shed light on whether investments and partnerships pursued by dominant companies risk distorting innovation and undermining fair competition.\" The FTC said that Alphabet, Amazon, Anthropic, Microsoft, and OpenAI were targeted as the companies are involved in multi-billion-dollar AI-related investments. Microsoft has an ongoing partnership with OpenAI and is the ChatGPT maker's largest stakeholder. The partnership garnered attention from the U.K.'s competition watchdog agency at the end of 2023. Amazon and Google parent Alphabet have similar investments in AI company Anthropic. Wedbush analysts said that Amazon, Google, and Meta (META), which was absent from the FTC inquiry, are \"positioned\" for \"enterprise monetization of generative artificial intelligence.\" The firm has long called Microsoft \"the torch bearer of the global AI Revolution.\" Google. \"Google Announces Expansion of AI Partnership with Anthropic.\" Wedbush Securities. \"Internet 2024 Outlook.\" Wedbush. “Microsoft Holding Shareholder Meeting that Caps a Trophy Case Year.” "
}