{
    "title": "No 'iPhone moment'! Microsoft Bing Search Engine Market Share Barely Budged \nWith ChatGPT Add-On",
    "date": "1/19/2024",
    "url": "https://tech.hindustantimes.com/tech/news/no-iphone-moment-microsoft-bing-search-engine-market-share-barely-budged-with-chatgpt-addon-71705601601096.html",
    "text": "Copyright © HT Media Limited  All rights reserved. When Microsoft Corp. announced it was baking ChatGPT into its Bing search engine last February, bullish analysts declared the move an “iPhone moment” that could upend the search market and chip away at Google's dominance. “The entire search category is now going through a sea change,” Chief Executive Officer Satya Nadella said at the time. “That opportunity comes very few times.” Almost a year later, the sea has yet to change. The new Bing — powered by OpenAI's generative AI technology — dazzled internet users with conversational replies to queries asked in a natural way. But te, according to data analytics firm StatCounter, up less than 1 percentage point since the ChatGPT announcement. We are now on WhatsApp. Click to join. Bing has long struggled for relevance and attracted more mockery than recognition over the years as a serious alternative to Google. Multiple rebrandings and redesigns since its 2009 debut did little to boost Bing's popularity. A month before Microsoft infused the search engine with generative AI, people were spending 33% less time using it than they had 12 months earlier, according to SensorTower. The ChatGPT reboot at least helped reverse those declines. In the second quarter of 2023, US monthly active users more than doubled year over year to 3.1 million, according to a Bloomberg Intelligence analysis of SensorTower mobile app data. Overall, users were spending 84% more time on the search engine, the data show. By year-end, Bing's monthly active users had increased steadily to 4.4 million, according to SensorTower. To build on the momentum, Microsoft has been adding more AI tools to Bing. In October, the company integrated the latest version of OpenAI's image-generating model, DALL-E 3. Visitors can use it to create realistic-looking images with simple text prompts. The offering does nothing to enhance Bing's search abilities. But its addition generated a spike in usage, according to Jordi Ribas, Microsoft's corporate vice president of search and AI. “We noticed an increase in usage by 10 times and that took us by surprise because if you think about it, DALL-E 2 was already quite good,” he said in an interview. “It really made a difference in the engagement and the users that came to our product.” Yusuf Mehdi, Microsoft's consumer chief marketing officer, declined to specify how many active users Bing has. “Look, it's still early days and new behaviors are being built,” he said. “We're still learning new things, but have millions and millions of people using the new tools.” Even as the Bing team adds crowd-pleasers, Google has been racing to develop its own AI tools. In May, it launched an experimental version of its search engine called the “search generative experience,” which delivers conversational responses atop the familiar list of links. Dubbed SGE for short, it's still not widely available. However, Google plans to embed its most powerful large language model, Gemini, into SGE sometime this year. The Alphabet Inc. division also retains considerable advantages. It has more than 90% of the market and is the default search engine on Apple Inc. hardware, including iPhones, giving Google crucial critical mass. The more people who use it, the more the search engine knows and the more Google can use that data to deliver and rank results in a way people find useful. The retooling of search by both technology giants reflects a shared conviction that generative AI will fundamentally change the way people seek and receive answers online. For Microsoft, the shift is an opportunity to propel Bing forward. But the incremental gains so far make clear that buzzy AI features alone probably won't transform it into a formidable search player. “We are at the gold rush moment when it comes to AI and search,” said Shane Greenstein, an economist and professor at Harvard Business School, who has studied the commercialization of the internet. “At the moment, I doubt AI will move the needle because, in search, you need a flywheel: the more searches you have, the better answers are. Google is the only firm who has this dynamic well-established.” Still, Greenstein said Bing, being the underdog, has more latitude to experiment. “Google has to be careful not to hurt its brand and product when it comes to testing new AI tools,” he said. “Bing can afford to take the risk. It has nothing to lose.” Microsoft is also betting that generative AI will change how advertisers allocate their search spending. The current ad model rests on costs-per-click, but AI-powered searches are getting consumers to answers faster and more directly without a litany of blue links, according to marketing chief Mehdi. “We have advertisers telling us they're getting better outcomes as a result of our AI efforts and are deeply interested in how this works,” he said. Samsung vs Apple! Samsung unveiled the Galaxy S24 series with AI features to create dominance in the market. Could it regain the smartphone throne after losing out to Apple in 2023? Check how Samsung is looking to beat Apple here. Samsung Galaxy S24 launched! Samsung's latest flagship smartphones were launched with upgraded features at the Galaxy Unpacked event in California. It will go head-to-head with Apple's iPhone 15. Check out the specs comparison between Samsung Galaxy S24 and iPhone 15. Know how it is different from its top rival here. The \"just right\" robots! As tall as a teddy bear and doped with generative AI, Moxie is capable of interacting with children telling them stories, giving math lessons and performing dance moves with two arms. Want to know more? Read here. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71705601601096 "
}