{
    "title": "Microsoft becomes $3trn company on AI-driven rally",
    "date": "1/24/2024",
    "url": "https://www.telegraph.co.uk/business/2024/01/24/ftse-100-markets-latest-news-germany-gdp-forecast-recession/",
    "text": "Chosen by us to get you up to speed at a glance Microsoft became the second-ever company to exceed a $3 trillion (£2.4 trillion) valuation on Wednesday, after its focus on artificial intelligence (AI) drove an investor rally. The valuation follows Apple hitting the milestone in June last year. Microsoft’s shares rose by more than 1.45pc during trading on Wednesday in New York, on a day when America’s benchmark S&P 500 index also hit a record high. Microsoft, known as one of the “magnificent seven” technology companies that have fueled the growth in US stock indexes over the past year, has concentrated heavily on adding artificial intelligence features to its services. It has become the biggest investor in the highest-profile AI startup, OpenAI, which is behind the ChatGPT chatbot, pumping in $10bn (£7.9bn) at the start of last year. The tie-up helped investors to see Microsoft as ahead in AI compared with younger rivals, such as Google and Facebook owner Meta. Since then, it has announced a string of AI-related innovations to its core products, including adding an AI digital assistant called Copilot to its Edge web browser and its Office software. It also added an AI chatbot to its Bing search engine last February in an attempt to gain traction against Google, but independent analysis suggests that the company has found growing market share to be difficult. The company, which is the second-largest cloud computing provider, has also been developing its own AI-supporting chips as it steps up its fight against Amazon and Google to run artificial intelligence tools on behalf of companies. Sophie Lund-Yates, lead equity analyst at Hargreaves Lansdown, said: “As one of the magnificent seven, Microsoft is a stock market darling. There’s bubbling excitement about the group’s AI tools, broader cloud products, as well as ongoing recognition for its resilient bread and butter software.” But she cautioned that some of Microsoft’s revenue relied upon the number of new computers being sold and “there has been some weakness here”. Microsoft, which was founded in 1975, became the biggest player in software in the 1980s and 1990s after striking a deal with IBM to produce the operating system for its personal computers, which became adopted as the industry standard. However, the software giant has faced increased competition since the start of this century from the rise of software accessed through web browsers, and the popularity of rival operating systems from Google and Apple. Since the start of the year, Microsoft shares have been vying with Apple’s for the mantle of the world’s most-valuable company, with the iPhone maker briefly losing its top ranking to Microsoft earlier this month. Read the latest updates below. Thanks for joining us today. We’ll be back in the morning but, in the meantime, I’ll leave you with the news that UK electricity prices have risen faster than almost any other developed country since 2019. A trial run ‘hallucination’ casts doubt on Rishi Sunak’s artificial intelligence hopes, writes technology journalist Matthew Field: An official government AI chatbot started speaking French during testing, in a setback for a project championed by Rishi Sunak. Civil servants at the Government Digital Service, which is part of the Cabinet Office, admitted efforts to embed ChatGPT into the Gov.uk website had led to the chatbot providing inaccurate answers. Alex Burghart, the minister for implementation, said the chatbot had even started speaking French in some circumstances. He told an event at the Centre for Policy Studies earlier this month: “We got quite a long way with it… and it did some strange things. If you asked questions in a particular way at first it responded in French… which was unexpected.” Plans to build a ChatGPT-style bot into the official Gov.uk website were championed by Prime Minister Rishi Sunak, who said the project could “benefit millions and millions of people every single day”. The Government trialled the tool – Gov.uk Chat – on 1,000 users in a “private pilot”. Continue reading to find out how statisfied the testers were... The FTSE 100 was up 0.656pc today. The biggest riser was Antofagasta, on a day where miners have done well. Its shares rose 5.32pc. Endeavour Mining was not far behind, up 4.36pc. The biggest faller was Haleon, the ex-GSK toothpaste and consumer healthcare products business, down 2.5pc. Smith & Nephew, which makes robots to help surgeons drill in the right places, was down 2.48pc. Meanwhile, in the mid-cap FTSE 250, Diversified Energy Co was up 11.54pc, followed by Tullow Oil, up 10.73pc. Senior, a manufacturing and engineering group, fell 6.67pc, followed by Close Brothers, down 2.99pc. Colombian billionaire Jaime Gilinski Bacal has joined the board of Metro Bank after leading a rescue deal for the struggling UK lender last year. Metro, which is known for its long opening hours and glitzy interiors, secured a £925m funding package in October. The deal allows the challenger bank to continue its plans for expansion while also meeting the amount of capital the regulator required it to keep. Mr Gilinski Bacal increased his stake to 53pc as a result. Metro Bank chairman Robert Sharpe said Mr Gilinski Bacal “brings decades of banking expertise and experience, which will prove invaluable in the next stage of the bank’s journey. “Jaime’s appointment underscores the commitment he has long shown to the bank as a supportive, long-term shareholder.” Hosue prices have nearly stabilised and will soon return to growth, a leading economist has said, while saying that house repossessions should remain low. Samuel Tombs, chief UK economist at Pantheon Macroeconomics, says that house prices will continue to fall during the first quarter of 2024 but will rise by 5pc over the final three quarters to return to their peak from November 2022. The Bank of Canada has kept its key interest rate the same, at 5pc, and warned that the fight against inflation is going to be slow. Its governor, Tiff Macklem, told a press conference today that interest rates needed time to work: Monetary policy is working to relieve price pressures, and we need to stay the course. Inflation is coming down as higher interest rates restrain demand in the economy. But inflation is still too high, and underlying inflationary pressures persist. We need to give these higher rates time to do their work. He added that: All this push and pull on inflation means that further declines in inflation are likely to be gradual and uneven. That suggests the path back to our 2pc target will be slow, and risks remain. The National Audit Office is questioning the sustainability of burning wood sources at Drax power station. Jonathan Leake has the details: Britain’s biggest renewable power station cannot prove it is burning wood from sustainable sources despite receiving billions of pounds in taxpayer handouts, the Government’s audit body has said. The Drax plant in Selby, Yorkshire, receives subsidies to help generate 6pc of Britain’s electricity, which it achieves by burning 8m tonnes of wood a year. Drax has claimed that the wood is sourced sustainably, although the National Audit Office (NAO) has sought to question this: “The Government cannot demonstrate that its current arrangements are adequate to give it confidence that industry is meeting sustainability standards.” Read the full article... America’s benchmarket stock market index, the S&P 500, scaled a fresh record high when it opened today, after Netflix surged on smashing expectations for subscriber growth, while supplier of machines to chipmakers, ASML, had strong earnings which helped drive gains in chip stocks. The index hit an intraday record high for the third time in less than a week, fueling a bull-market run it confirmed on Friday after closing at an all-time high. London-listed mining companies have continued to advance today. Mark Crouch, analyst at investment platform eToro, explained: Mining stocks led the FTSE 100 for a second day in a row on Wednesday, with Fresnillo, Endeavour Mining and Antofagasta all advancing more than 5pc. The move followed news that China’s central bank might bolster its ailing stock market. He added: That turned into reality when the People’s Bank of China announced a 50-basis point cut in the reserve ratio requirement for Chinese banks. When this comes into effect in early February, it should add over a hundred billions of pounds worth of cash to the banking system. There’s an old market adage of ‘buy the rumour, sell the news’, but in this case, the firm news is proving the bigger push. China is a major consumer of metals, and any move designed to stimulate China’s economy is naturally a potential driver of metal demand, which is why we’re seeing such a bullish response in these metal mining stocks. Microsoft became the second-ever company to exceed a $3 trillion valuation today, after its focus on artificial intelligence drove an investor rally. The software giant follows Apple reaching that milestone last summer. Its shares have risen around 1.25pc on the Nasdaq exchange in New York, at a time when US indexes are near record highs. Microsoft has concentrated heavily in artificial intelligence in recent years. It became the biggest investor in OpenAI, the maker of ChatGPT, and has announced a string of AI-related innovations to its core products. It has added an AI digital assistant it calls Copilot to its Edge web browser and Microsoft Office applications. Copilot is also being added to Microsoft keyboards as the company tries to encourage its use. It also added AI features to its Bing search engine in an attempt to gain traction against Google. Microsoft is one of the so-called Magnificent Seven businesses that fuelled gains in American share indexes last year, along with other companies investing in AI technologies such as chipmaker Nvidia and car company Tesla. Sophie Lund-Yates, lead equity analyst at Hargreaves Lansdown, said: As one of the Magnificent Seven, Microsoft is a stock market darling. There’s bubbling excitement about the group’s AI tools, broader cloud products, as well as ongoing recognition for its resilient bread and butter software. But she added: The likes of Word and Excel do rely, to a certain extent, on the number of new laptops and computers being sold around the world, and there has been some weakness here. I’m heading off now but your latest updates will keep coming here from Alex Singleton. Before I go, Netflix shares surged after the streaming giant reported its best quarter of growth since the pandemic. The company signed up 13.1m new customers in the final three months of 2023, exceeding Wall Street’s estimate of 8.9m and beating projections in every region of the world. The stock rose as much as 14pc to $559 in New York, the biggest gain since October. Former Tottenham Hotspur owner Joe Lewis intends to plead guilty to US criminal charges over insider trading, his lawyer has said at a hearing in Manhattan federal court. The 86-year-old was charged last year with giving lucrative, and illegal, trading tips to staff on his superyacht, private jet pilots and girlfriends. Lewis founded the investment firm Tavistock Group and is worth $6.2 billion, according to Forbes. He has been allowed to remain free on a $300m bond secured by his yacht, named the Aviva, and private aircraft. Germany is tumbling towards recession as Greece enjoys a mini economic boom, in a reversal of fortunes from the crisis that pitted Berlin against Athens a decade ago. Our deputy economics editor Tim Wallace has the latest: Top economists have downgraded their forecast for German growth as a closely-watched private sector survey pointed to a continued contraction in the country’s economy. By contrast, the International Monetary Fund has upgraded its forecast for growth in Greece this year as it said the “outlook has improved notably”. Economists at Germany’s esteemed Ifo Institute slashed forecasts for the country’s prospects, warning it will grow by only 0.7pc this year, not the 0.9pc predicted just a month ago. Read how, by contrast, the Greek economy is buoyant. The benchmark stock index in the US hit a new record high as trading began on Wall Street in a rally fuelling by excitement over AI. The S&P 500 gained 0.6pc at the opening bell to reach a 4,893.23 amid clamour to buy chip stocks. The Dow Jones Industrial Average was 0.4pc higher at 38,044.99 while the tech-heavy Nasdaq Composite rose 0.7pc to 15,527.54. Oil prices have edged upwards amid events in the Red Sea and efforts by China to stimulate its economy. Global benchmark Brent crept higher by 0.5pc towards $80 a barrel, while US-produced West Texas Intermediate has gained 0.8pc to nearly $75. Oil has traded in a narrow range this month as the turmoil in the Middle East was countered by expectations of increasing supplies from producers outside of the Opec cartel, such as the United States. Prices have ticked higher as China said it would force banks to lend more of their reserves in an effort to revive its struggling economy. Tata Steel has returned to profit, its latest results show days after it announced it would be cutting about 2,800 jobs at its Port Talbot plant in Wales. The Indian group’s profits reached 5.13bn rupees (£48.4m) for the final three months of last year, compared to a loss of 22.2bn rupees (£209.3m) a year earlier. Revenues declined 3.1pc during the quarter to 553.1bn rupees from a year earlier, with its European business notching a 13pc drop. Tata Steel’s production in Europe fell 15pc in the three months to December from a year earlier, while deliveries slid 6.8pc. Unions last week threatened to walk out of Britain’s largest steelworks over jobs cuts announced as part of net zero plans to close its blast furnaces. Tata on Friday said that about 2,500 jobs will be lost within the next 18 months. The Government remains committed to a six-day a week postal service, No 10 has said. It comes after communications regulator Ofcom said set out reforms for the Royal Mail to allow it to make savings, including cutting its letter delivery service from six days to five, or even three, a week. Asked about the proposals made in an Ofcom report, the Prime Minister’s official spokesman said the Government would “engage with” the watchdog’s suggestions, including by taking part in a consultation on future service levels. “We will consider any proposals in the round, beyond what we have set out about the importance of Saturday deliveries and the need to provide certainty to many businesses that rely on them,” he added. Asked whether there were any concerns the Royal Mail could collapse without service reforms, the spokesman said: “I don’t think that is the choice before us.” Pressed on whether the Government remained committed to a six-day per week service, Rishi Sunak’s spokesman replied: “Yes.” Tesla has told suppliers it wants to start production of a new mass market electric vehicle codenamed “Redwood” in mid-2025, according to reports. Tesla chief executive Elon Musk has long whetted fans’ and investors’ appetites for affordable electric vehicles and self-driving robotaxis that are expected to be made on next-generation, cheaper electric car platforms. Those models, including an entry-level $25,000 (£19,600) car, would allow it to compete with cheaper gasoline-powered cars and a growing number of inexpensive EVs, such as those made by China’s BYD. BYD overtook Tesla as the world’s top EV maker in the final quarter of 2023. Musk had first promised to build a $25,000 car in 2020, a plan he later shelved and then revived. Tesla’s cheapest offering, the Model 3 sedan, currently has a starting price of £39,000. Musk said last year he was concerned about the impact of high interest rates on consumer demand for big-ticket items like cars. Tesla sent “requests for quotes,” or invitation for bids for the “Redwood” model, to suppliers last year, and forecast weekly production volume of 10,000 vehicles, sources told Reuters. Drivers of electric cars are being asked to pay more than twice as much for insurance as those who own petrol-fuelled models, data has revealed. Our special correspondent Matt Oliver has the latest: The typical insurance premium for electric vehicles (EVs) has increased to £1,344, a rise of 50pc compared with a year earlier, according to UK broker Howden Group. That is double the cost of cover for combustion engine cars, which Howden blames on a higher cost of repairs for electric models. Insurance premiums for all types of cars surged last year but the rise for EVs was bigger both proportionally and in real terms, the company said. Read on for details. Apple has pushed back the launch date for its long-rumoured electric vehicle and scaled back its self-driving features as the iPhone maker struggles with the shift from gadgets to cars. Our senior technology reporter Matthew Field has the details: The Californian tech giant has delayed its internal target to launch a car from 2026 to 2028, according to Bloomberg. The vehicle will also have fewer advanced autonomous driving capabilities than first hoped. The revisions come as Apple finds the push into cars more challenging than it initially hoped. Known internally as Project Titan, Apple has been working on the secretive electric car project since 2014. The company has spent hundreds of millions of dollars on development, according to reports, but is yet to come up with a prototype. Its internal team has also gone through multiple restructurings and leadership changes. Read how the $3 trillion company has now downgraded its ambitions for the car’s self-driving capabilities at launch. Bank of America has sent “letters of education” to workers threatening disciplinary action unless they meet in-office requirements. The US investment bank reportedly sent letters to employees who had been avoiding their desks despite “requests and reminders” to meet its workplace guidelines. Bank of America has now warned its investment bankers they will could be punished for failing to work in the office as required. One letter shared online by a Bank of America employee said: “Failure to follow the workplace excellence expectations applicable to your role within two weeks of the date of this notification may result in further disciplinary action.”The North Carolina-based bank has been sending “letters of education” raising attendance concerns since last Autumn, the Financial Times reported.Bank of America is the latest lender to crackdown on the pandemic-induced shift to remote working. Bank of America was contacted for comment. US stock markets are on track to climb at the opening bell after Netflix surged following its largest-ever fourth-quarter subscriber growth. Netflix jumped 10.1pc in premarket trading after the streaming giant’s fourth-quarter subscriber additions blew past estimates on a strong slate of shows including the final season of “The Crown” and David Fincher’s film “The Killer.” On Tuesday, the S&P 500 closed at a record high for the third day, extending a bull-market run it had confirmed on Friday. Tesla results are due after the market closes on Wednesday and chipmaker Intel’s on Thursday. US chip stocks including Nvidia, Advanced Micro Devices, Intel and Marvell Technology gained between 1.1pc and 2.5pc following European chip-making equipment maker ASML’s fourth-quarter earnings, which delivered its best-ever quarterly orders. In premarket trading, the Dow Jones Industrial Average was up 0.2pc, the S&P 500 had gained 0.4pc and the Nasdaq 100 was up 0.7pc. The Government cannot prove that biomass fuel is sustainably sourced, a National Audit Office (NAO) report has found, throwing the future of the Drax power station into doubt. Ministers and their advisers at the Climate Change Committee (CCC) consider biomass to be a low-carbon source of energy if 70pc of it is produced following a strict set of sustainability criteria. Generators, the largest of which in the UK is Drax, have said they are meeting sustainability goals, which include proving that the wood used to make biomass fuel has not contributed to further deforestation and the destruction of nature. The NAO said the Government had not tested whether such practices were taking place. It comes just a week after the Energy Secretary approved plans for a carbon capture unit to be retrofitted to Drax which supplies 3-4pc of UK electricity. Gareth Davies, head of the NAO, said: If biomass is going to play a key role in the transition to net zero, the government needs to be confident that the industry is meeting high sustainability standards. Government must review the assurance arrangements for these schemes, including ensuring that it has provided adequate resources to give it assurance over the billions of pounds involved. A Drax spokesman said: “The NAO acknowledges the important role that sustainably sourced biomass has to play in addressing the climate crisis and displacing fossil fuels in the production of dispatchable electricity. “It’s essential that sustainability reporting and criteria are robust and fit for purpose. This was also recognised in the Government’s biomass strategy published last year, which outlined a review which has already begun.” A Department for Energy Security and Net Zero spokesman said: “We welcome the NAO’s report, which found no evidence of firms not complying with our stringent sustainability criteria, which are in line with internationally recognised standards. “As set out in the Biomass Strategy, we will be consulting later this year on how we can go further than our peers. “Biomass will provide a key role in a more secure, clean energy sector. It delivered around 9pc of the UK’s total energy supply in 2022, with generators only legally receiving subsidies if they prove they have complied with our strict rules. “The Climate Change Committee has acknowledged that achieving net zero is dependent on solutions like bioenergy with carbon capture and storage, which will help offset emissions from other industries.” Wholesale gas prices have moved higher after plunging to a six-month low amid high stock levels and mild winter weather. Europe’s benchmark contract has gained 1.8pc today to push toward €28 per megawatt hour, but remains close to the €26.78 level hit on Monday, which was its weakest price since July. Demand for gas remains subdued as the eurozone economy risks falling into recession, while fuller-than-usual storage levels and warm temperatures for the time of year are also suppressing consumption. The chief executive office of Ofcom has said that the regulator needs to “restore... trust and confidence in Royal Mail.” Dame Melanie Dawes told LBC: What’s happening at the moment is that Royal Mail aren’t delivering and that’s why we fined them just before Christmas, we fined them over five and a half million pounds, which is a lot for a company that’s loss-making. What the public say is that when they buy a stamp they want to know that the letter they’re sending is going to arrive on time. A lot of people are saying that actually, they’d rather have a less frequent and slightly slower service but one that happens as they expect. I think we do need to restore our trust and confidence in Royal Mail... they haven’t been delivering over the last few years. She added that services run by Royal Mail have become “more and more expensive” to deliver. The pound has risen after economists warned latest survey data indicates that interest rates could remain higher for longer amid concerns over inflation. Sterling has gained 0.6pc against the dollar to move towards $1.28 and has risen 0.1pc versus the euro, which is worth 85p. It comes after PMI figures showed the private sector is growing at its fastest pace in seven months in Britain just as manufacturers are being hit by rising costs caused by the shipping crisis in the Red Sea. The FTSE 100 rose as it was buoyed by China-exposed stocks following measures taken by the nation’s central bank to support the world’s second-largest economy. Miners Anglo American, Antofagasta and Glencore climbed between 2.1pc and 3.3pc after China’s central bank governor said it will cut the amount of cash that banks must hold as reserves from February 5, bolstering efforts to shore up a fragile economic recovery. Asia-exposed insurer Prudential rose 1.4pc, while luxury firm Burberry added 2.3pc. The exporter-heavy FTSE 100 edged up 0.2pc, while domestically oriented FTSE 250 index added 0.8pc after PMI data showed British services businesses saw another uptick in growth this month. EasyJet advanced 4.5pc after the airline operator forecast a smaller first-half loss and strong summer bookings despite a writedown of about £40m due to the conflict in the Middle East. Endeavour Mining jumped 6.7pc and Centamin added 6.4pc after Liberum upgraded their shares to “buy,” saying gold equities will shine this year amid global war and trade tensions if Donald Trump is re-elected as the US president. Staying with precious metal miners, Fresnillo climbed 5.6pc and Hochschild Mining added 7.9pc. Services inflation will not fall as quickly as hoped this year, economists fear, after a closely-watched survey indicated the British private sector was growing at its fastest pace in seven months. Ashley Webb, UK economist at Capital Economics, said the increase in PMI data from 52.1 in December to 52.5 in January “suggests that the economy has improved”. However, he warned “price pressures remain high” amid the shipping disruptions in the Red Sea. He said: Overall, despite the economy stagnating, the stickiness of price pressures gives us a bit less confidence that services CPI inflation will return to its long-run average of 3.5pc towards the end of this year. These data will add to the Bank of England’s unease about inflation persistence. As a result, the Bank will probably continue to push back against the prospect of near-term interest rate cuts next week. The crisis in the Red Sea risks “reigniting inflation” as British manufacturers face rising shipping costs just as business activity ramps up, according to economists. Private sector companies recorded the steepest rise in input costs since August last year, according to the closely-watched S&P Global Flash UK purchasing managers’ index (PMI). The survey, which showed growth in Britain’s dominant services sector hit an eight-month high, indicated there were “widespread reports of higher freight costs” in the wake of the Red Sea crisis. Global shipping delays also meant that suppliers’ delivery times lengthened for the first time in 12 months and to the greatest extent since September 2022. Chris Williamson, chief business economist at S&P Global, said: The surprising strength of growth in January, which has exceeded forecasts, may deter the Bank of England from cutting interest rates as soon as many are expecting, especially as supply disruptions in the Red Sea are reigniting inflation in the manufacturing sector. Supply delays have spiked higher as shipping is re-routed around the Cape of Good Hope, the longer journey times lifting factory costs at a time of still-elevated price pressures in the service sector. Inflation is therefore indicated to remain stubbornly higher in the 3pc to 4pc range in the near future. Private sector activity in Britain grew at its fastest pace in seven months at the start of this year, a closely-watched survey showed, in a sign the UK may have avoided a recession. The S&P Global Flash Composite UK purchasing managers index (PMI) hit 52.5 in January, which was the third consecutive month above the 50 mark separating growth from contraction. However, private sector firms recorded the steepest rise in input costs since August, driven by renewed costpressures in the manufacturing sector, as bosses reported higher freight costs in the wake of the Red Sea crisis. Chris Williamson, chief business economist at S&P Global, said it had been a “promising start to the year,” adding: The survey data point to the economy growing at a quarterly rate of 0.2pc after a flat fourth quarter, therefore skirting recession and showing signs of renewed momentum. Businesses have also become more optimistic about the year ahead, with confidence rebounding to its highest since last May. Business activity and confidence are being in part driven by hopes of faster economic growth in 2024, in turn linked to the prospect of falling inflation and commensurately lower interest rates. Red Sea shipping delays are feeding through to higher #manufacturing prices in the UK, which could worry policymakers at the Bank of England about another kick higher in #inflation #BOE #GBP pic.twitter.com/J0i5AC1QAT Private sector companies in the eurozone have endured their eighth straight month of decline, a closely-watched survey showed, and signalled a warning about potential disruptions from the Red Sea. The HCOB Flash Eurozone purchasing managers’ index (PMI) rose from 47.6 in December to 47.9 in January, which was its least severe contraction in six months but still below the 50 mark separating growth from contraction. It also showed disruptions to shipping in the Red Sea caused supply chains to lengthen for the first time in a year. Dr Cyrus de la Rubia, chief economist at Hamburg Commercial Bank, said: The persistent attacks by Houthi rebels on commercial vessels navigating the Red Sea are exerting discernible impacts onsupply chains. The PMI index for delivery times has witnessed a notable dip, slipping below the 50 mark. Nevertheless, various industry reports indicate that businesses are not caught off guard like they have been previously, having learned from past disruptions. Goldman Sachs warned that European stocks on the Continent could be hit hard by a Trump presidency, writes Szu Ping Chan. The Wall Street investment bank said German stocks - particularly the DAX and MDAX markets - were the most exposed to the prospect of tariffs on exports to the US. Around 15pc of US imports come from Europe. A note to Goldman clients said: In terms of a Republican/Trump presidency, we would expect higher risks around both an increase in tariffs on Europe and a reduction in US funding/support for Ukraine; we see the most vulnerable as: DAX, MDAX and cyclical sectors with a high-degree of correlation to world trade (Industrials, Chemicals, Autos). That said, the focus on industrial policy on both sides of the Atlantic should provide an offset for industrial stocks. The Federation of Small Businesses (FSB) warned that cutting the six-day delivery service by the Royal Mail could “cause real disruption to our economy”. FSB policy chairwoman Tina McKenzie said: Trading essential services for short-term savings is a slippery slope that may compromise the trust small businesses place in Royal Mail. Considering that 25pc of them rely on the postal service, these proposals could cause real disruption to our economy. It’s understandable that the overall number of mail volumes has fallen in recent years, but the number of small businesses relying on it has not. The answer, therefore, lies in modernising a service designed in the 1970s to fit the needs and expectations of today’s culture in a sensible way, that doesn’t leave small firms feeling short-changed. The FTSE 100 could be boosted by another Trump presidency, according to Goldman Sachs, as the former president looks on track to win the Republican nomination. The Wall Street giant said Britain’s flagship stock market was one of the “least exposed” to developments in global trade, leaving it less vulnerable to a 10pc blanket tariff on US imports that has been proposed by the Republican presidential frontrunner. Sharon Bell, European strategist at Goldman, added that Republican control of the White House would make it more likely that they will “also control the Congressional agenda”. Goldman’s foreign exchange analysts believe a united government “would most likely allow for greater spending—steeper curves, higher real yields and a stronger dollar. A stronger dollar, all else equal, is good for European companies with US exposure, many of which are on the FTSE 100. In a note to clients, it said “defensive” markets like the Footsie and Swiss stock exchange, which included more companies with stable dividends and steady growth such as utilities, would be more resilient. Goldman added: “For FTSE 100 companies, roughly half of dividends are paid in dollars. Moreover, greater fiscal expansion may add to US growth (although there is some prospect of higher rates offsetting a portion of this).” The downturn in Germany’s private sector deepened at the start of this year as business activity fell for a seventh straight month in January, according to a closely-watched survey. The HCOB Flash Germany purchasing managers’ index (PMI) showed activity slipped from December’s reading of 47.4 to 47.1 as its dominant manufacturing sector remained in recession. A figure below 50 indicates a contraction. Dr. Cyrus de la Rubia, chief economist at Hamburg Commercial Bank, said: Germany has faced a sluggish start to the new year. Services activity has not only declined for the fourth consecutive month but has also accelerated in its downturn. Manufacturing, remaining in recessionary territory for the 19th straight month, has displayed a somewhat softened downturn, as reflected in the steadily rising PMI index since August of last year. He added that the data indicated “a continuation of the recession into the current quarter”. Flash #PMI for #Germany remained firmly in contraction territory in January, hints at recession persisting into Q1 https://t.co/luctlRVMz7 pic.twitter.com/lGHgRPjz2M China said it would next month cut the amount banks must hold in reserve in order to boost lending, state media reported, as officials look to reignite stuttering growth. The decision comes with the world’s second-largest economy facing multiple headwinds, including a prolonged crisis in the property sector, sluggish domestic consumption and weakening foreign demand. “People’s Bank of China Governor Pan Gongsheng said at a press conference of the State Council Information Office on January 24 that the reserve requirement ratio (RRR) will be lowered by 0.5 percentage points on February 5,” state broadcaster CCTV reported. The move will provide “one trillion yuan (£110bn) of liquidity to the market”, it added. China last cut its RRR in September, by 0.25 percentage points to around 7.4pc. Zhiwei Zhang, President and Chief Economist at Pinpoint Asset Management, told AFP the latest decision is “another step in the right direction, but monetary policy by itself is not enough to boost economic momentum”. Ebay has announced it will cut 1,000 jobs as it joins the series of tech giants that have reduced staff levels after the pandemic boom. The e-commerce stalwart said the reduction would amount to about 9pc of staff, while it would also reduce its work for outside contracts amid a “challenging macroeconomic environment”. In a statement sent to staff, the company said it needs to be “more nimble” and that “overall headcount and expenses have outpaced the growth of our business”. The announcement marks the second round of job reductions at eBay in a year. The online marketplace in February 2023 said it would cut about 500 employees, or about 4pc of its workforce. Google announced earlier this year it was axing hundreds of jobs while Games developer Unity announced plans to reduce 25pc of staff, a move that hits 1,800 employees. eBay shares gained about 4pc in after-hours trading in New York following the announcement. The stock has declined 13% in the past 12 months. The boss of Abrdn, one of the City’s largest fund managers, has said staff will still be paid bonuses despite plans to axe about 500 jobs. Our reporter Michael Bow has the latest: Chief executive Stephen Bird acknowledged that it may seem “a bit counter intuitive” that Abrdn will still pay bonuses despite cutting jobs as it tries to slash its costs by about £150m per year. He said: It’s important to recognise that although the investment world is difficult at the moment, it’s important to recognise performing colleagues. In the numbers we are announcing they include provisions for properly paying those colleagues who are delivering for clients, of which there are many. Across the industry bonuses are down. Mr Bird saw his bonus cut by 62.4pc in 2022 as investors pulled their money from the fund manager. Germany’s economic woes come as train drivers walked out in what is poised to be the country’s longest-ever rail strike. The strike, which began at 2am, is set to last until Monday evening. Is the fourth round of industrial action in the GDL union’s dispute with state-owned Deutsche Bahn and comes just two weeks after a previous strike ground national rail traffic to a near halt for three days. A spokesman for the national rail operator spoke of renewed “massive restrictions” across the country. Drivers in rail freight are holding a simultaneous strike. GDL leader Claus Weselsky told broadcaster ARD that he was ready to compromise in the dispute over pay and working hours, but said Deutsche Bahn’s offers did not go far enough. He said: “We have to strike longer and harder because the railway management is resistant to advice.” The FTSE 100 has risen at the open in the wake of fresh record highs for the S&P 500 on Wall Street. The UK’s benchmark index has gained 0.6pc to 7,533.10 while the midcap FTSE 250 was flat at 19,078.22. The Communication Workers Union (CWU) said a three-day delivery service would “destroy” Royal Mail. CWU general secretary Dave Ward said: We are not resistant to change, but we will not sign up to a three-day universal service obligation, which would destroy Royal Mail as we know and would impact on thousands of jobs. Royal Mail has the biggest fleet in the country, a presence in every community, and boasts and unrivalled infrastructure. This is the bedrock that a serious growth agenda, and the future of the company, can be built. The union claimed Ofcom had produced the report without asking for input from frontline workers or their union. Mr Ward added: “The CWU will not stand for that. We will now launch an extensive engagement exercise and produce our own report on the future of Royal Mail, taking on board the views of our members and customers.” Postal affairs minister Kevin Hollinrake said that Government was committed to a six-day service from the Royal Mail. He told Times Radio: “The Prime Minister been very clear on this, six-day delivery is really important for many people in this country, many of our citizens, but also for many of our businesses.” Questioned over whether the six-day model for letters remained sustainable, Mr Hollinrake said: Royal Mail made significant profits in previous years. They’ve had a couple of difficult years not least because of some of the industrial action they’ve been subjected to. But nevertheless we are keen to see Royal Mail become more efficient. He added: “I believe the Royal Mail can build a sustainable model. But that sustainable model must be based on a-six day service.” Investment giant Abrdn has warned that it will cut around 500 jobs as it tries to slash its costs by approximately £150m per year. The business said that most of its savings would be from “non-staff costs”, but that it would remove management layers and expects the savings “to result in the reduction of approximately 500 roles.” Chief executive Stephen Bird said: Market conditions have remained challenging for our mix of business. The board and I are committed to taking these significant cost actions now to restore our core Investments business to a more acceptable level of profitability. The boss of Wetherspoon has criticised the impact of the rising minimum wage, which he said has put pub owners at a disadvantage to supermarkets. The pub group’s chairman Sir Tim Martin said pubs were being forced to increase the price of a pint, which typically costs about £4.50, by 13.5p to cover extra costs of staff, which are covered by about 30pc of sales. Meanwhile, supermarkets only need to increase the price of a pint by 1p as the cost of a pint is lower at £1 and labour costs only make up 10pc of the sale price, he said. The minimum wage, officially called the National Living Wage, will increase to £11.44 per hour for workers over 21 from April. Sir Tim said: “The inevitable consequence is that increased labour costs raise the differential in prices between the hospitality industry and supermarkets.” His comments came as JD Wetherspoon reported higher sales in the last 25 weeks, lifted by strong demand for its drinks and food during the festive season. The group reported a 10.1pc growth in like-for-like sales, while the last 12 weeks, which included the Christmas holidays, witnessed an 11.1pc jump from a year earlier. EasyJet said it reduced its losses before tax in the final three months of 2023 to £126m, down from £133m a year earlier. Passenger numbers over that period increased by 14pc, which the airline said came despite it suffering a “direct impact of £40m” due to the Hamas-Israel conflict. It has paused flying to Israel and Jordan, alongside a softening of demand for trips to Egypt. Chief executive Johan Lundgren said: We delivered an improved performance in the quarter which is testament to the strength of demand for our brand and network. The popularity of easyJet holidays also continues to grow, with 48pc more customers in the period. We see positive booking momentum for summer 2024 with travel remaining a priority for consumers. Flight and holidays bookings took off strongly during the traditional busy turn of year sales period, as customers opted to secure their summer holidays to firm favourites like Spain and Portugal alongside destinations further afield like Greece and Turkey. Ofcom chief executive Dame Melanie Dawes said that changes to the postal system could be required as the number of letters being sent each year has halved since 2011, while people are getting many more parcels than they used to. She said: Postal workers are part of the fabric of our society and are critical to communities up and down the country. But we’re sending half as many letters as we did in 2011, and receiving many more parcels. The universal service hasn’t changed since then, it’s getting out of date and will become unsustainable if we don’t take action. So we’ve set out options for reform so there can be a national discussion about the future of universal post. In the meantime, we’re making sure prices will remain affordable by capping the price of second class stamps. Regulator Ofcom has said cutting Royal Mail’s six-day a week letter deliveries to five days or three are among options that could be considered as it warned the universal postal service risks becoming “unsustainable” without reform. Ofcom said that the two “primary options” for letter deliveries include changes to the number of days that letters are delivered a week. That could mean that letters are only delivered to households and businesses five, or even three times per week. The Government would have to change the law for this to happen. This could save Royal Mail between £100m and £650m, the regulator said. The other option is to make changes to slow down letter deliveries, meaning that it would take three or more days for most letters to arrive, although next-day deliveries would still be available when required. This could save the company £150m to £650m. Thanks for joining me. Germany’s economy will grow less than expected this year, a closely-watched report has suggested, as the eurozone economy teeters on the brink of recession. Europe’s largest economy will expand by only 0.7pc in 2024, according to the Ifo Institute, down from 0.9pc growth in GDP it predicted in December. It comes after Germany’s highest court blocked Olaf Scholz’s plan to spend €60bn (£52.4bn) of emergency borrowing on green initiatives. The climate spending package was found to be in breach of the country’s debt laws in November, forcing the chancellor to overhaul his budget. Germany’s economy shrank by 0.3pc last year after it was hit by higher interest rates and elevated energy costs, with its finance minister Christian Lindner admitting in Davos this month that the country had become the “tired man” of Europe. Meanwhile, the eurozone is on the brink of recession after data indicated business activity shrank in the fourth quarter, which follows a  0.1pc contraction in the third quarter of 2023. Ifo head of forecasts Timo Wollmershäuser said: “Now that the German parliament’s budget committee has agreed on the federal budget, we estimate that it passed additional savings of just under €19bn. “Companies and households will carry a greater burden or receive less relief, and government spending will be cut. “That means the overall scope is roughly in line with what we estimated in our risk scenario for 2024 in December. The economic impact is also likely to be of a corresponding magnitude.” 1) Hinkley Point C cost jumps as project delayed again | Nuclear power station hit by inflation and delays in blow to Government’s net zero plans 2) Xi plots emergency intervention to shore up China’s crumbling stock market | The Chinese president is under pressure to restore investor confidence amid an economic downturn 3) Sober Gen Z leave Treasury facing ‘sin tax’ blackhole, warns OBR chief | Decline in alcohol and cigarette consumption risks putting pressure on public finances 4) Netflix strikes $5bn streaming deal with WWE in major push into live events | Streaming giant is exploring new avenues of growth amid a slowdown in the industry 5) Jeremy Warner: Trump 2.0 threatens economic disaster if the sugar rush ends | Decline in alcohol and cigarette consumption risks putting pressure on public finances Asian shares were mixed after Japan reported its exports jumped nearly 10pc in December, though shares in Tokyo fell nearly 1pc. Tokyo stocks closed lower as investors digested the Bank of Japan’s decision to maintain its long-standing ultra-loose policies. The benchmark Nikkei 225 index lost 0.8pc, or 291.09 points, to end at 36,226.48, while the broader Topix index fell 0.5pc, or 12.85 points, to 2,529.22. Japan’s exports grew nearly 3pc in 2023 while imports fell 7pc, leaving a trade deficit of 9.2 trillion yen, preliminary customs data showed, a sharp drop from the 20.3 trillion yen deficit reported the year before. In South Korea, the Kospi fell 0.4pc, to 2,468.61. Hong Kong’s Hang Seng climbed 0.8pc to 15,476.85, helped by gains in technology companies like e-commerce giant Alibaba, which surged 4.3pc. The Shanghai Composite index slipped 0.2pc to 2,766.79. The benchmark American share index, the S&P 500, climbed to another record Tuesday as the earnings reporting season for big US companies picked up the pace. The index rose 0.3pc to 4,864.60. The Nasdaq Composite index, skewed towards technology companies, also climbed, up 0.4pc, reaching 15,425.94. But the Dow Jones Industrial Average of 30 top US companies fell 0.3pc, a day after topping 38,000 for the first time. It finished at 37,905.45. The yield on 10-year US Treasury bonds rose to 4.14pc from 4.11pc late on Monday, although it remains well below its 5pc level last October. "
}