{
    "title": "CES 2024: Hong Kong start-ups attract interest from Microsoft, Best Buy \namid overseas push",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/ces-2024-hong-kong-start-093000578.html",
    "text": "Microsoft and Best Buy expressed interest in Hong Kong start-ups at CES 2024, after the city's pavilion at the world's largest consumer electronics show saw the most interest there in years. Last Tuesday, the first day of the trade show in Las Vegas, Microsoft CEO Satya Nadella swung by the Tech Hong Kong pavilion to chat with AI Guided, a company that makes a belt with haptic feedback for obstacle detection, helping to guide the blind. \"Microsoft really supports accessibility technology,\" said Steve Kong, co-founder and chief technology officer of AI Guided. \"The dream of our company is that in three to five years ... visually impaired people can have some hands-free experience to navigate the world.\" Do you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. AI Guided is one of 20 Hong Kong-based companies exhibiting with the city's start-up pavilion this year, a big improvement over the eight that exhibited last year because of the last-minute lifting of Covid-19 restrictions. Even leading up to the show, Hong Kong Science and Technology Park (HKSTP) said 40 companies applied to exhibit in the Eureka Park start-up area, a marked improvement over previous years, according to H L Yiu, corporate development officer for HKSTP, which runs the pavilion. \"We had to make some selection of companies that have more of a mature level of readiness in terms of being ready to sell,\" Yiu said in an interview. \"We really mean to help them get new business.\" With limited space, HKSTP focused on picking companies that were closer to having products ready to go, or even already in the market, with the goal of picking up business deals at CES. For some, that could pan out in a big way. Invisible & Innovation Technology, aka Invisible Tech, which builds speakers into furniture, said it has received interest from Best Buy. A representative from the largest electronics retail chain in the US told Invisible Tech that it had not seen other products like its cabinet with an embedded speaker in the base, according to the start-up's co-founder Patrick Lee. Invisible & Innovation Technology makes cabinets with embedded speakers, which are partially made of recycled materials. Photo: Matt Haldane alt=Invisible & Innovation Technology makes cabinets with embedded speakers, which are partially made of recycled materials. Photo: Matt Haldane> \"Best Buy always wants to source something new,\" said Lee. \"Furniture is a very traditional thing that [has not had] much disruptive design or link with technology.\" Invisible Tech also uses recycled materials in some parts of its products. Henry Cheung, the company's other co-founder, said the company wants to \"help Hong Kong fulfil its carbon neutral mission\". The city aims to be carbon neutral by 2050. The Hong Kong pavilion at this year's CES, which concluded on Friday, featured a variety of start-ups that make products ranging from the quirky to the practical. XOXO Beverages already has its cocktail-making machine in about 10 bars and restaurants in Hong Kong, but it has not expanded to home use yet. Co-founder Peter Yau said CES was the best show the company has been to. \"People from all around the world come by and are very interested in the product,\" Yau said. \"[We got] a lot of contacts, and we're looking to see what we can do after [the show] with those guys.\" Two of the participating companies, Sitan Semiconductor International and Raysolve Technology, make micro-LED displays, something that has become more important amid rising interest in augmented reality glasses. Sitan was started at the Hong Kong University of Science and Technology, and the company said its tech has already found its way into products from big brands like TCL, Huawei Technologies, Oppo and Meizu - although not all of these products have been released. XOXO Beverages has made a machine that will automatically mix cocktails to specifications inputted through an app. SCMP / Matt Haldane alt=XOXO Beverages has made a machine that will automatically mix cocktails to specifications inputted through an app. SCMP / Matt Haldane> For most of the start-ups, though, CES was about getting leads and looking for ways to expand beyond their home market. Getting the attention of a tech giant like Microsoft is one way to achieve that. Asked about the prospects of Microsoft investing, AI Guided's Kong said, \"I hope so ... I will still have another discussion with them, so we'll see.\" This kind of attention also may help the Hong Kong government justify its efforts to turn the city into a tech hub, which has had mixed results in a city better known as a regional financial hub. \"From a tech area standpoint, I think the opportunity to come to Hong Kong is surging,\" said HKSTP's Yiu. \"The number of start-ups that we nurture every year is an increasing trend.\" This article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2024 South China Morning Post Publishers Ltd. All rights reserved. Copyright (c) 2024. South China Morning Post Publishers Ltd. All rights reserved. Related Quotes "
}