{
    "title": "Tech hub, Microsoft deal and more fill the plate for WEDC CEO Hughes • \nWisconsin Examiner",
    "date": "1/3/2024",
    "url": "https://wisconsinexaminer.com/2024/01/03/tech-hub-microsoft-deal-and-more-fill-the-plate-for-wedc-ceo-hughes/",
    "text": "Wisconsin Economic Development Corp. CEO Missy Hughes (second from left) speaks with participants of the WEDC’s Main Street Bounceback program in West Bend in December. (Photo courtesy of WEDC) At the Wisconsin Economic Development Corp., CEO Missy Hughes looks back on 2023 as a significant year for the state’s business community — at home and on the world stage. In a late December interview, Hughes rattled off some big hits for the state. One is the federal government greenlighting the next phase for an ambitious proposal to establish a biohealth tech hub in Wisconsin. Another is a new and promising future for the highly touted, perennially doubted Foxconn site in Southeastern Wisconsin. Hughes isn’t shy in her enthusiasm for the biohealth tech hub and its focus on “personalized medicine” — tailoring diagnosis and treatment of illness to a patient’s distinctive genetic characteristics. “It’s going to transform health care,” she declares. Doctors treating a patient with a tumor won’t have to throw “the kitchen sink at this tumor,” Hughes says. Instead, they’ll be able “to give the most effective treatment the most directly, with as little damage to the rest of the healthy body as possible and get you back to work, get you back to your family, as quickly as possible. It’s really, honestly, going to be game-changing.” The federal CHIPS and Science Act passed in 2022 authorized and provided funding for the tech hubs. But Hughes says the state was only able to take part because of groundwork laid well before by the participants. The biohealth tech hub project brings together faculty from the University of Wisconsin and Madison and Milwaukee technical colleges, health technology businesses, and economic and workforce development agencies. Universities conduct research, businesses develop technologies that make use of those findings and health care providers then put those technologies to the test. “That work is already happening,” says Hughes. “With the designation of the tech hub, we’re able to expand on that.” It brings together “a whole bunch of different skill sets that we already have in Wisconsin” — artificial intelligence, research into gene functions, drug development and advanced manufacturing. Wisconsin’s was one of 31 tech hub projects that the federal government designated in October for initial funding, with the prospect of larger federal investments to come. Just getting this far gives Wisconsin additional allure for everyone from academics looking to relocate to employers eying the state, Hughes says. In March, Microsoft announced a $1 billion investment to establish a data center on a 315-acre site in the Racine County village of Mount Pleasant — part of the land originally developed for Foxconn. In November Microsoft announced it was expanding its footprint there with the purchase of another 1,030 acres. The Foxconn project that began under previous administrations in Madison and Washington, D.C., and never approached the original promise sold in 2017 by then-Gov. Scott Walker and President Donald Trump: a $10 billion high-tech flat screen manufacturing complex employing 13,000 people. Critics were skeptical from the start, especially at the $3 billion in potential tax credits that the Legislature and Walker promised the company, and questioned the $700 million that Mount Pleasant spent on infrastructure development. Tony Evers ran for governor criticizing the project as a massive boondoggle. Foxconn’s actual operational plans changed repeatedly, leading WEDC to disqualify the company’s tax credit applications. Midway through Evers’ first term, WEDC and Hughes renegotiated the tax credits, which for the first time enabled the company to actually qualify for them, but at much lower cost to the state than the original credits would have cost if the company had ever qualified for them. The April 2021 renegotiation was “right-sizing for what Foxconn is prepared to do in the marketplace,” Hughes says — putting it on the same level as other companies that WEDC has rewarded with tax credits for job creation. Having employed about 1,000 people over the course of its history in the state, “it’s a good company to have here in Wisconsin,” she says of Foxconn. “But they’re just like any of our other companies at this point.” Reworking the deal was important to ensure an eventual return on the money sunk into developing the site. “The way that I looked at it was, it would be a shame for all of the infrastructure investment that happened to go to waste,” Hughes recalls. And as it became clear that the company would only use about a third of the redeveloped land, WEDC “very aggressively went out … doing everything we could” to market the remaining vacant land, Hughes says. Microsoft showed interest with a $500 million investment initially, later doubling that and then adding to it. “We were very involved with having conversations” with the company, she says. Lawmakers and Evers included a sales tax exemption for data centers in the 2023-25 state budget — a further incentive for Microsoft. Milwaukee 7, the economic development organization that covers seven southeast Wisconsin counties, handled “the nitty gritty work of working through the new development agreement and the purchase and sale of the land with Microsoft and Foxconn, Hughes says. “A blue-chip company like Microsoft is the best outcome that we could have hoped for, and worked for,” she says. While working with large business enterprises occupies much of WEDC’s agenda, the agency has continued to dig more deeply into small business support. Emblematic of that side of the operation is the Main Street Bounceback program, now completing its second year of providing expansion grants of up to $10,000 each to 9,500 small businesses around Wisconsin. Small business development is an important part of WEDC’s mission, Hughes says, because small businesses such as retailers and service providers help bring character, life and value to the communities where they thrive. In Prairie du Chien, Main Street is bouncing back  “Having communities where folks want to live and go downtown and spend time with each other is incredibly important,” Hughes says. “At WEDC we like to say we can walk and chew gum at the same time, so we can focus on our small businesses and our large businesses.” The Bounceback program gave the participating businesses opportunities to expand, perhaps renovate or move into new space and to increase their value without owners having to drain their own savings. Small businesses “often become large businesses if we give them enough support,” she adds. “Supporting small businesses, along with the tens of millions of dollars that we give to large businesses every year in the form of tax credits, is a way of evening things out.” In the coming weeks, WEDC expects to announce the first investments to be made by the Wisconsin Investment Fund, a venture capital project. The Wisconsin Investment Fund is being seeded with a federal grant — $50 million from U.S. Treasury  State Small Business Credit Initiative. The Evers administration had sought $75 million in the state budget for venture capital, but the budget committee’s Republican majority removed that request. “We had a lot of conversations with the Legislature about how other Midwest states — Michigan, Minnesota — are really digging in and investing in economic development,” Hughes says, “and I would have liked to have seen more willingness to really invest and think about the future with regard to economic development from our Legislature.” Nevertheless, she considers the investment fund one of WEDC’s big priorities for the new year. “Access capital is going to be incredibly important — whether it’s our small businesses, our mainstream businesses, but also our startups or entrepreneurs who need significant capital to bring their product to market, or to develop their software or their medical device,” Hughes says. Hughes is also looking to other opportunities afforded by the federal government. The 2022 Inflation Reduction Act included a number of provisions aimed at addressing climate change, including funding for the state green innovation bank. “The governor has told WEDC we’re responsible for that,” Hughes says. Working with a commission that Evers established in June, WEDC will be looking at projects “all around the state that help businesses become more sustainable, Wisconsinites choose renewable energy.” GET THE MORNING HEADLINES DELIVERED TO YOUR INBOX There are also bank federal tax credits to reward cleaner energy choices in the legislation, and WEDC will dig into “how can we help our communities and our businesses” make use of those incentives, she adds. “A lot of the recent federal funding is ‘get it while you can and be first in line,’” says Hughes. “We want to make sure that for those opportunities, our businesses and our communities are up at the front of the line.” Hughes says she’s also been glad to have an opportunity in the last year “to get back on the road and travel internationally,” helping Wisconsin businesses make new connections around the world. “I think it’s incredibly important for Wisconsin businesses to realize that they’re part of a global marketplace and that there are opportunities in Asia, there’s opportunities in Africa, there’s opportunities in Europe — and not only grabbing those opportunities, but also just having that understanding that there are markets to expand to and places to sell your goods that are different and interesting, and pursuing them,” she says. Exports are increasing, Hughes observes “And I think that’s going to continue to create opportunities for Wisconsin businesses.” by Erik Gunn, Wisconsin Examiner January 3, 2024 by Erik Gunn, Wisconsin Examiner January 3, 2024 At the Wisconsin Economic Development Corp., CEO Missy Hughes looks back on 2023 as a significant year for the state’s business community — at home and on the world stage. In a late December interview, Hughes rattled off some big hits for the state. One is the federal government greenlighting the next phase for an ambitious proposal to establish a biohealth tech hub in Wisconsin. Another is a new and promising future for the highly touted, perennially doubted Foxconn site in Southeastern Wisconsin. Hughes isn’t shy in her enthusiasm for the biohealth tech hub and its focus on “personalized medicine” — tailoring diagnosis and treatment of illness to a patient’s distinctive genetic characteristics. “It’s going to transform health care,” she declares. Doctors treating a patient with a tumor won’t have to throw “the kitchen sink at this tumor,” Hughes says. Instead, they’ll be able “to give the most effective treatment the most directly, with as little damage to the rest of the healthy body as possible and get you back to work, get you back to your family, as quickly as possible. It’s really, honestly, going to be game-changing.” The federal CHIPS and Science Act passed in 2022 authorized and provided funding for the tech hubs. But Hughes says the state was only able to take part because of groundwork laid well before by the participants. The biohealth tech hub project brings together faculty from the University of Wisconsin and Madison and Milwaukee technical colleges, health technology businesses, and economic and workforce development agencies. Universities conduct research, businesses develop technologies that make use of those findings and health care providers then put those technologies to the test. “That work is already happening,” says Hughes. “With the designation of the tech hub, we’re able to expand on that.” It brings together “a whole bunch of different skill sets that we already have in Wisconsin” — artificial intelligence, research into gene functions, drug development and advanced manufacturing. Wisconsin’s was one of 31 tech hub projects that the federal government designated in October for initial funding, with the prospect of larger federal investments to come. Just getting this far gives Wisconsin additional allure for everyone from academics looking to relocate to employers eying the state, Hughes says. In March, Microsoft announced a $1 billion investment to establish a data center on a 315-acre site in the Racine County village of Mount Pleasant — part of the land originally developed for Foxconn. In November Microsoft announced it was expanding its footprint there with the purchase of another 1,030 acres. The Foxconn project that began under previous administrations in Madison and Washington, D.C., and never approached the original promise sold in 2017 by then-Gov. Scott Walker and President Donald Trump: a $10 billion high-tech flat screen manufacturing complex employing 13,000 people. Critics were skeptical from the start, especially at the $3 billion in potential tax credits that the Legislature and Walker promised the company, and questioned the $700 million that Mount Pleasant spent on infrastructure development. Tony Evers ran for governor criticizing the project as a massive boondoggle. Foxconn’s actual operational plans changed repeatedly, leading WEDC to disqualify the company’s tax credit applications. Midway through Evers’ first term, WEDC and Hughes renegotiated the tax credits, which for the first time enabled the company to actually qualify for them, but at much lower cost to the state than the original credits would have cost if the company had ever qualified for them. The April 2021 renegotiation was “right-sizing for what Foxconn is prepared to do in the marketplace,” Hughes says — putting it on the same level as other companies that WEDC has rewarded with tax credits for job creation. Having employed about 1,000 people over the course of its history in the state, “it’s a good company to have here in Wisconsin,” she says of Foxconn. “But they’re just like any of our other companies at this point.” Reworking the deal was important to ensure an eventual return on the money sunk into developing the site. “The way that I looked at it was, it would be a shame for all of the infrastructure investment that happened to go to waste,” Hughes recalls. And as it became clear that the company would only use about a third of the redeveloped land, WEDC “very aggressively went out … doing everything we could” to market the remaining vacant land, Hughes says. Microsoft showed interest with a $500 million investment initially, later doubling that and then adding to it. “We were very involved with having conversations” with the company, she says. Lawmakers and Evers included a sales tax exemption for data centers in the 2023-25 state budget — a further incentive for Microsoft. Milwaukee 7, the economic development organization that covers seven southeast Wisconsin counties, handled “the nitty gritty work of working through the new development agreement and the purchase and sale of the land with Microsoft and Foxconn, Hughes says. “A blue-chip company like Microsoft is the best outcome that we could have hoped for, and worked for,” she says. While working with large business enterprises occupies much of WEDC’s agenda, the agency has continued to dig more deeply into small business support. Emblematic of that side of the operation is the Main Street Bounceback program, now completing its second year of providing expansion grants of up to $10,000 each to 9,500 small businesses around Wisconsin. Small business development is an important part of WEDC’s mission, Hughes says, because small businesses such as retailers and service providers help bring character, life and value to the communities where they thrive. In Prairie du Chien, Main Street is bouncing back  “Having communities where folks want to live and go downtown and spend time with each other is incredibly important,” Hughes says. “At WEDC we like to say we can walk and chew gum at the same time, so we can focus on our small businesses and our large businesses.” The Bounceback program gave the participating businesses opportunities to expand, perhaps renovate or move into new space and to increase their value without owners having to drain their own savings. Small businesses “often become large businesses if we give them enough support,” she adds. “Supporting small businesses, along with the tens of millions of dollars that we give to large businesses every year in the form of tax credits, is a way of evening things out.” In the coming weeks, WEDC expects to announce the first investments to be made by the Wisconsin Investment Fund, a venture capital project. The Wisconsin Investment Fund is being seeded with a federal grant — $50 million from U.S. Treasury  State Small Business Credit Initiative. The Evers administration had sought $75 million in the state budget for venture capital, but the budget committee’s Republican majority removed that request. “We had a lot of conversations with the Legislature about how other Midwest states — Michigan, Minnesota — are really digging in and investing in economic development,” Hughes says, “and I would have liked to have seen more willingness to really invest and think about the future with regard to economic development from our Legislature.” Nevertheless, she considers the investment fund one of WEDC’s big priorities for the new year. “Access capital is going to be incredibly important — whether it’s our small businesses, our mainstream businesses, but also our startups or entrepreneurs who need significant capital to bring their product to market, or to develop their software or their medical device,” Hughes says. Hughes is also looking to other opportunities afforded by the federal government. The 2022 Inflation Reduction Act included a number of provisions aimed at addressing climate change, including funding for the state green innovation bank. “The governor has told WEDC we’re responsible for that,” Hughes says. Working with a commission that Evers established in June, WEDC will be looking at projects “all around the state that help businesses become more sustainable, Wisconsinites choose renewable energy.” GET THE MORNING HEADLINES DELIVERED TO YOUR INBOX There are also bank federal tax credits to reward cleaner energy choices in the legislation, and WEDC will dig into “how can we help our communities and our businesses” make use of those incentives, she adds. “A lot of the recent federal funding is ‘get it while you can and be first in line,’” says Hughes. “We want to make sure that for those opportunities, our businesses and our communities are up at the front of the line.” Hughes says she’s also been glad to have an opportunity in the last year “to get back on the road and travel internationally,” helping Wisconsin businesses make new connections around the world. “I think it’s incredibly important for Wisconsin businesses to realize that they’re part of a global marketplace and that there are opportunities in Asia, there’s opportunities in Africa, there’s opportunities in Europe — and not only grabbing those opportunities, but also just having that understanding that there are markets to expand to and places to sell your goods that are different and interesting, and pursuing them,” she says. Exports are increasing, Hughes observes “And I think that’s going to continue to create opportunities for Wisconsin businesses.” Wisconsin Examiner is part of States Newsroom, a nonprofit news network supported by grants and a coalition of donors as a 501c(3) public charity. Wisconsin Examiner maintains editorial independence. Contact Editor Ruth Conniff for questions: info@wisconsinexaminer.com. Follow Wisconsin Examiner on Facebook and Twitter. Our stories may be republished online or in print under Creative Commons license CC BY-NC-ND 4.0. We ask that you edit only for style or to shorten, provide proper attribution and link to our web site. AP and Getty images may not be republished. Please see our republishing guidelines for use of any other photos and graphics. Deputy Editor Erik Gunn reports and writes on work and the economy, health policy and related subjects, for the Wisconsin Examiner. He spent 24 years as a freelance writer for Milwaukee Magazine, Isthmus, The Progressive, BNA Inc., and other publications, winning awards for investigative reporting, feature writing, beat coverage, business writing, and commentary. Wisconsin Examiner is part of States Newsroom, the nation’s largest state-focused nonprofit news organization. DEMOCRACY TOOLKIT © Wisconsin Examiner, 2024 In Wisconsin’s great progressive tradition, we aim to hold the powerful accountable to the people, follow the money, and dig out the truth. Although we give you the inside scoop, we are not a publication for “insiders.” Instead, we cover the way politics and government affect citizens of the state. We’re part of States Newsroom, the nation’s largest state-focused nonprofit news organization. DEIJ Policy | Ethics Policy | Privacy Policy Our stories may be republished online or in print under Creative Commons license CC BY-NC-ND 4.0. We ask that you edit only for style or to shorten, provide proper attribution and link to our website. "
}