{
    "title": "Purpose Investments announces the expansion of its Yield Shares suite with \nthe launch of NVIDIA and Microsoft Yield ...",
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/news/purpose-investments-announces-expansion-yield-120000731.html",
    "text": "Investors now have a new way to invest in NVIDIA and Microsoft that combines attractive monthly income with long-term growth potential TORONTO, Jan. 18, 2024 (GLOBE NEWSWIRE) -- Purpose Investments Inc. (“Purpose Investments”) is excited to announce the addition of two new single-stock ETFs to its Yield Shares by Purpose (“Yield Shares”) suite: the Microsoft (MSFT) Yield Shares Purpose ETF and the NVIDIA (NVDA) Yield Shares Purpose ETF. This expansion comes as the existing Purpose Yield Shares lineup recently celebrated its one-year anniversary with strong adoption from investors. These new yield-focused single-stock ETFs offer targeted exposure to Microsoft and NVIDIA and will commence trading today on Cboe Canada Inc. The Microsoft and NVIDIA Yield Shares ETFs are designed to cater to the growing investor demand for monthly income while offering investors an opportunity to capitalize on the long-term growth potential of these leading global technology companies. These Yield Shares hold the underlying stock (described in the table below), employ a covered call strategy, and use moderate leverage (targeted at a maximum of 25% of the net asset value) to earn premium income – offering investors a unique blend of growth and income. Investments in Yield Shares are denominated in Canadian dollars that hedge the U.S. dollar, minimizing currency risk for investors. The Yield Shares suite is a complementary tool for investors to customize their single-name exposures and delivers a differentiated risk-return profile from their favourite stocks. “We’re in the midst of the next technological revolution with AI, and Microsoft and NVIDIA are at the forefront of this movement,” says Vlad Tasevski, Head of Asset Management. “With these new Yield Shares, we are thrilled to offer Canadian investors a way to gain complementary exposure to leading technology names while receiving enhanced* monthly distributions.” Today, Purpose is launching units of the following two Yield Shares (the “Funds”): ETF Name ETF Ticker Distribution Frequency Underlying Stock Exposure Microsoft (MSFT) Yield Shares Purpose ETF MSFY Monthly Microsoft Corporation NVIDIA (NVDA) Yield Shares Purpose ETF YNVD Monthly NVIDIA Corporation Key Benefits: Monthly Distribution Yield: Investors can earn an enhanced monthly yield from their individual stock exposure in excess of any dividends declared on the underlying stock where applicable. Growth Potential: Investors can participate in the long-term growth potential of Microsoft and NVIDIA – companies at the forefront of technological innovation. Investment in U.S. Companies Denominated in Canadian Dollars: Canadian investors can gain exposure to individual U.S. stocks through an investment denominated in Canadian dollars that hedges the U.S. dollar exposure. Reduced Volatility: The options strategy aims to provide a cushion against a decline in stock prices. Tax Efficiency: The yield generated by the covered call strategy will be tax efficient in the form of capital gains. Yield Shares are designed to deliver a distribution yield that exceeds the dividends payable on the underlying stock. This is achieved by implementing covered call options strategies to earn enhanced monthly yields on some of the world’s most coveted companies. Yield Shares offer investors a distinct risk-return profile compared with direct investment in the underlying stocks and serve as a versatile tool for portfolio customization. Purpose Investments is also excited to announce the initial January 2024 distributions for the Funds: ETF Name ETF Ticker Distribution (per unit)** Record Date Payment Date Microsoft (MSFT) Yield Shares Purpose ETF MSFY $0.1000 January 26, 2024 February 7, 2024 NVIDIA (NVDA) Yield Shares Purpose ETF YNVD $0.1700 January 26, 2024 February 7, 2024 **Distributions may vary and are subject to Purpose’s discretion. The ex-distribution date for the initial January 2024 distribution will be January 25, 2024. These new Yield Shares are the latest additions to the Yield Shares by Purpose suite, which also includes the following: ETF Name ETF Ticker Underlying Stock Exposure Tesla (TSLA) Yield Shares Purpose ETF YTSL Tesla Inc. Amazon (AMZN) Yield Shares Purpose ETF YAMZ Amazon.com, Inc. Apple (AAPL) Yield Shares Purpose ETF APLY Apple Inc. Alphabet (GOOGL) Yield Shares Purpose ETF YGOG Alphabet Inc. Berkshire Hathaway (BRK) Yield Shares Purpose ETF BRKY Berkshire Hathaway Inc. “These new offerings are more than just investment products; they represent our belief in Yield Shares as a distinct asset class of investments, uniquely positioned to assist investors in achieving their diverse financial goals and complement their existing holdings,” says Tasevski. “This commitment underscores Purpose Investments’ dedication to adapting and growing in line with evolving investor needs and the ever-changing market landscape.” About Purpose Investments Purpose Investments is an asset management company with over $19 billion in assets under management. Purpose Investments has an unrelenting focus on client-centric innovation and offers a range of managed and quantitative investment products. Purpose Investments is led by well-known entrepreneur Som Seif and is a division of Purpose Unlimited, an independent technology-driven financial services company. For further information, please contact:Keera Hartkeera.hart@kaiserpartners.com905-580-1257 *Yield Shares provide “enhanced” or higher yields in the form of additional monthly distributions compared with the underlying common stock, which pays a relatively lower or no distribution yield. Commissions, trailing commissions, management fees and expenses all may be associated with investment fund investments. Please read the prospectus and other disclosure documents before investing. There can be no assurance that the full amount of your investment in a fund will be returned to you. If the securities are purchased or sold on a stock exchange, you may pay more or receive less than the current net asset value. Investment funds are not guaranteed, their values change frequently, and past performance may not be repeated. Fund distribution levels and frequencies are not guaranteed and may vary at the Purpose Investment’s sole discretion. Certain statements in this document may be forward-looking. Forward-looking statements (“FLS”) are statements that are predictive in nature, depend on or refer to future events or conditions, or include words such as “may,” “will,” “should,” “could,” “expect,” “anticipate,” “intend,” “plan,” “believe,” “estimate” or other similar expressions. Statements that look forward in time or include anything other than historical information are subject to risks and uncertainties, and actual results, actions or events could differ materially from those set forth in the FLS. FLS are not guarantees of future performance and are, by their nature, based on numerous assumptions. Although the FLS contained in this document are based upon what Purpose Investments believes to be reasonable assumptions, Purpose Investments cannot assure that actual results will be consistent with these FLS. The reader is cautioned to consider the FLS carefully and not to place undue reliance on the FLS. Unless required by applicable law, it is not undertaken, and specifically disclaimed, that there is any intention or obligation to update or revise FLS, whether as a result of new information, future events or otherwise.  "
}