{
    "title": null,
    "date": "1/5/2024",
    "url": "https://www.cmcmarkets.com/en-au/opto/microsoft-updates-keyboard-zuck-sells-shares-gm-misses-ev-target",
    "text": "5 Top Stories By OPTO  05 Jan 2024, 03:20 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. An artificial intelligence (AI) key for certain Microsoft [MSFT] keyboards will be unveiled at the CES technology conference. The key, which will activate Microsoft’s AI Copilot, marks the first keyboard change since the Windows/Start key was added in 1994. Elsewhere, Intel [INTC] has appointed Justin Hotard, previously of Hewlett Packard [HPE], to lead its key data centre and AI division. Samsung [SSNLF] is also putting AI front and centre, with a teaser for the 17 January launch of its Galaxy S24 smartphone promising that “Galaxy AI is coming”. Bloomberg predicts that AI capabilities could displace camera and display improvements for smartphone models in 2024. Meanwhile, South Korea attracted a record $18.8bn of foreign direct investment during 2023, thanks to growing confidence in its technology sector. General Motors [GM] met just half of its electric vehicle (EV) delivery target last year, reported Bloomberg, with just 14,000 of the 75,000 delivered featuring the company’s new Ultium batteries. GM is offering $7,500 lease incentives on EVs that lost a tax credit earlier this week; Ford [F] is likewise discounting some EV models, but hiking the price of other models by $10,000. Bloomberg reported that Mark Zuckerberg  CEO of Meta Platforms [META], sold shares in the company in every session in the months of November and December. Following Meta’s 194% gains for the year, the 1.3 million shares sold had a total value of approximately $428m. The sales marked Zuckerberg’s first sale of shares for two years prior to the period in question. Read the story of Zuckerberg’s vision for the metaverse here. The Financial Times reported that a cottage industry of lawyers helping small businesses regain access to Amazon’s [AMZN] marketplace has emerged, following the e-commerce giant’s crackdown on independent merchants. ByteDance’s TikTok hopes to grow its US business tenfold to $17.5bn this year, Bloomberg reported, threatening Amazon’s market share. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles 5 Top Stories AI On Trial; BlackBerry Beat; Hyundai Accelerates Pivot This week, 11 nonfiction authors joined a lawsuit in the US, accusing OpenAI and Microsoft of using their books to train the models behind ChatGPT. 21 Dec 2023 5 Top Stories Alibaba Surprise; EU EV Numbers; Toyota Commits to Reform CEO Eddie Wu is to replace Trudy Dai as the head of the division that runs its e-commerce platforms, Tmall and Taobao. 20 Dec 2023 5 Top Stories Apple Pauses Sales; Alphabet Acts on Accusations; TSMC Leadership Change Alphabet is to pay $700m and change up its Google Play policies, in order to resolve antitrust complaints brought by more than 30 US states. 19 Dec 2023 5 Top Stories EV Movers and Shakers; Paytm Drops 30%; IBM AI Deal Canada is set to announce that all new cars must be zero-emissions by 2035, while Volkswagen-owned Audi is trimming its ambitious electric vehicle rollout plans. 18 Dec 2023 © 2024 CMC Markets Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Chi-X (Chi-X Australia), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Terms and Conditions, Product Disclosure Statement ('PDS') and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Our Financial Services Guide contains details of our fees and charges. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. "
}