{
    "title": null,
    "date": "1/17/2024",
    "url": "https://itweb.africa/content/xA9POvNEGlBqo4J8",
    "text": "Vodafone and Microsoft launched a 10-year strategic agreement this week, which they hope will harness their respective strengths to provide scalable digital platforms to more than 300 million enterprises, public sector organisations, and consumers in Europe and Africa. The companies have identified five key areas of collaboration, namely: Generative AI, scaling IoT, Africa’s digital acceleration, enterprise growth, and cloud transformation. Vodafone will invest $1.5 billion over the next 10 years in cloud and customer-focused AI services created in cooperation with Microsoft. Additionally, Microsoft will use Vodafone’s fixed and mobile communication services. Microsoft also plans to invest in Vodafone’s managed IoT connection technology, which is set to become a separate, standalone business by April. The new firm, which is a joint venture by the two companies, is expected to attract new partners and clients, boosting development in apps and expanding the platform to link more gadgets, automobiles, and machines, says the companies in a joint statement. “The digital services developed by the new cooperation will leverage the latest generative AI technology to provide a highly customised and distinctive consumer experience across numerous channels. They will be developed on fair and ethical privacy and security regulations within Vodafone’s existing framework for responsible AI,” noted the statement. The companies will also work together on Vodafone's customer experience with generative AI, scale up Vodafone's managed IoT connectivity platform, develop new digital and financial services for businesses, particularly SMEs in Europe and Africa, and overhaul Vodafone’s global data centre cloud strategy. Margherita Della Valle, chief executive, Vodafone Group, said: “This unique strategic partnership with Microsoft will accelerate the digital transformation of our business customers, particularly small and medium-sized companies, and step up the quality of customer experience for consumers. “This new generation of AI will unlock massive new opportunities for every organisation and every industry around the world,” said Satya Nadella, chairman and CEO, Microsoft. “We are delighted that together with Vodafone we will apply the latest cloud and AI technology to enhance the customer experience of hundreds of millions of people and businesses across Africa and Europe, build new products and services, and accelerate the company’s transition to the cloud.” ITWeb proudly displays the “FAIR” stamp of the Press Council of\n                        South Africa, indicating our commitment to adhere\n                        to the Code of Ethics for Print and online media which prescribes that our reportage is truthful,\n                        accurate\n                        and fair. Should you wish to lodge a complaint about our news coverage, please lodge a complaint on the\n                        Press Council’s website, www.presscouncil.org.za\n                        or email the complaint to enquiries@ombudsman.org.za.\n                        Contact the Press Council on 011 4843612. "
}