{
    "title": "Windows 11 24H2 Update: Every New Feature Explained",
    "date": "2/20/2024",
    "url": "https://fossbytes.com/windows-11-24h2-update-features-explained/",
    "text": "While Microsoft recently confirmed that Windows 12 won’t launch this year, the company is actively working on a significant overhaul of Windows 11, known as version 24H2. It is scheduled to roll out in September or October 2024. Here’s everything you need to know about it. Before delving into the features, it’s crucial to note that Windows 11 24H2 could introduce a new requirement for CPUs to support the ‘POPCNT’ instruction (Population Count). This may pose challenges for older CPUs, like the Intel Core 2 Duo. As Microsoft’s strategic investment in OpenAI appears to have paid off, the company is tirelessly integrating generative AI into all its services. As part of these efforts, Microsoft is set to launch a new feature called Automatic Super Resolution, using the onboard Neural Processing Unit (NPU) to upscale resolution in supported games. But you might wonder, doesn’t Nvidia’s DLSS achieve the same thing? The answer is no. DLSS utilizes GPU cores to upscale content, whereas Microsoft’s implementation uses the NPU. Other new AI features include: With image generation tools like DALL-E becoming mainstream, there’s a high demand for AI wallpapers, as users can generate the exact look they want. Microsoft is experimenting with AI wallpapers designed to create a sense of depth on the desktop by using the ‘parallax effect’ and tracking cursor movement on the screen. Similar to Samsung’s implementation, Microsoft is working to introduce an AI Cowriter to the Notepad app. This will allow users to rewrite content, alter formatting, adjust tone, and manipulate paragraph length using AI. Additionally, the company is adding a new ‘Explain with Copilot’ option, which creates a well-defined summary of the content. Voice Clarity, as the name suggests, is a feature that suppresses background noises during video calls. While this feature has been available on Surface devices for some time, its reliance on NPU hardware has made it challenging for the company to implement it on other devices. However, with the Windows 11 24H2 update, Microsoft plans to roll out the Voice Clarity feature to all Windows devices. Windows already boasts the best snap layout system, and Microsoft is taking it to the next level with AI. The new update ensures that these layouts intelligently adapt based on the content being displayed. With every new Windows update, Microsoft enhances the File Explorer. The upcoming update introduces the ability to create 7zip and TAR compressed archive files, complementing the existing support for ZIP files. Moreover, PNG files will offer improved utility, allowing users to view and edit metadata, add descriptions, assign star ratings, and include keywords directly in the properties dialog. In addition to File Explorer enhancements, the Quick Settings panel will now allow users to scroll through all available quick settings on their PC While Windows already includes a battery saver, Microsoft is introducing a new ‘Energy Saver’ mode for both laptops and desktops. This mode optimizes energy consumption by reducing system performance. Desktop users will also now have a visual indicator in the system tray, similar to the battery life indicator on laptops. Furthermore, users can configure lid and power button controls, as well as set specific hibernation times. If you want to experience these features before anyone else, you can install the Windows 11 Insider Preview Build 26052. However, it is important to note that the software might contain some bugs and glitches. Hisan is a high school graduate with a passion for technology. His quest for tech began in 2018 when he was searching for a new phone to buy. He is now pursuing a degree in computer science with a focus on Data Science at university. In addition to his interest in technology, Hisan also enjoys sports such as table tennis and cricket. He recently discovered a love for writing and is excited to share his insights and knowledge on the latest tech trends. Some of the most popular games you should play right now. Read More 12 Most Popular Video Games In 2021 You Can Play Right Away Short Bytes: Apple Inc. has been the most valuable company, and they had more revenue than… Read More 20 Surprising Facts About Apple That You Probably Didn’t Know Microsoft office Alternatives Exist and You Should Know Them too! Read More 8 Best Alternatives To Microsoft Office Suite — 2022 Edition Just Microsoft things, Jensen. Read More Microsoft’s Ex-UI Chief Is “Shocked” At The State Of Windows’ Start Menu Didn’t anyone tell you not to bring a banana to a gunfight? Read More 5 Resident Evil Village Mods You Need To Try Right Away Know how to officially get Android apps on Windows 11. Read More How To Setup And Run Android Apps On Windows 11 © 2024 Fossbytes Media "
}