{
    "title": "Microsoft expands Copilot's security reach for businesses and schools in \nthe next weeks",
    "date": "2/13/2024",
    "url": "https://mspoweruser.com/microsoft-expands-copilots-security-reach-for-businesses-and-schools-in-the-next-weeks/",
    "text": "Follow us Share this article Improve this guide The feature will arrive \"at no additional cost\" 2 min. read Published on February 13, 2024 published on \n\nFebruary 13, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft has recently announced that it is significantly expanding access to enhanced security features in its AI assistant Copilot for businesses and schools “at no additional cost.” The Redmond company says that the feature is available for free for subscribers of popular plans like Office 365 E3 and Microsoft 365 Business Basicm, as long as you access it with your Entra ID. This will be effective starting late February this year. They also have plans to gradually extend commercial data protection in Copilot to all Entra ID users. The company will then provide updates and resources through the Microsoft 365 admin center to help organizations prepare for this expansion. Redmond’s own cyber hunters, the Defender Experts team, are already reaping the rewards of Copilot for Security. Analysts report faster script analysis and team leaders see potential for career growth and learning opportunities for junior members.analysts. “Over the last few months, we’ve brought commercial data protection in Copilot to more places so that workers, faculty, and students can easily access it whenever they need it,” the company now said. Microsoft’s recent focus on AI appears to be paying off, with the company reporting strong financial results in the latest quarter. Revenue reached $62 billion, and net income was $21.9 billion. CEO Satya Nadella attributes this success to integrating AI across their technology, attracting new customers and boosting productivity across industries. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}