{
    "title": "Elon Musk buys new Windows Laptop, he is so unhappy with it that he is \ntweeting at Microsoft",
    "date": "2/26/2024",
    "url": "https://www.indiatoday.in/technology/news/story/elon-musk-buys-new-windows-laptop-he-is-so-unhappy-with-it-that-he-is-tweeting-at-microsoft-2507144-2024-02-26",
    "text": "Listen to Story Update: Annoyed with his Windows laptop, Musk reached out to Microsoft chief Satya Nadella, asking him to fix his problem. The Tesla chief, in a tweet, wrote that he doesn't want to be a \"pest\" but Nadella must allow new Windows users to continue without creating a Windows account. Musk also elaborated how Microsoft doesn't let people sign up with work accounts and that he \"only has work email addresses.\" The Microsoft boss, on the other hand, hasn't responded to Musk yet. Original story follows: If you have been following Elon Musk on X (earlier called Twitter), you would know that he is quite active on the social media platform. Be it announcing important updates relating to his several companies, responding to trolls (or being one, at times), indulging in banters with his employees or expressing his views about certain things, Musk always has something to say. And his recent tweet is all about a Windows laptop that Musk isn't having the best time with. The X boss is, in fact, so frustrated with his purchase that he decided to call out Microsoft in a tweet. So, what exactly is Musk having a problem with? Windows' requirement to create a Microsoft account in order to use it. In a tweet, Musk shared how he bought a new laptop and that he can't access it without creating a Microsoft account. The tech mogul elaborated that he doesn't wish to \"give Microsoft AI the access to his computer\" and thus, doesn't want to set up a Microsoft account. \"Just bought a new PC laptop and it won’t let me use it unless I create a Microsoft account, which also means giving their AI access to my computer! This is messed up. There used to be an option to skip signing into or creating a Microsoft account. Are you seeing this too?,\" he wrote. Interestingly, X's community notes feature mentioned in Musk's tweet that it is possible to set-up the latest version of Windows without a Microsoft account. However, Musk, in another tweet, noted that Community Notes wasn't functioning properly as the option of setting up Windows without creating a Microsoft account doesn't exist anymore. \"Community Notes is failing here. This option no longer exists,\" he wrote. Several of Musk's followers have responded to his tweet. While some are telling him that there are ways to get around this problem, others are simply asking him to \"buy Microsoft.\" This isn't the first time that Musk has had a problem with Microsoft. Last year, the tech mogul had accused the company of \"controlling OpenAI.\" Microsoft has invested billions in the ChatGPT parent company and Musk, in a tweet, said that OpenAI was no longer what he intended it to be and has turned into a 'maximum-profit company effectively controlled by Microsoft'. \"OpenAI was created as an open source (which is why I named it “Open” AI), non-profit company to serve as a counterweight to Google, but now it has become a closed source, maximum-profit company effectively controlled by Microsoft. Not what I intended at all,\" he wrote. For the unversed, Elon Musk was one of the founders of OpenAI. Musk resigned from OpenAI in 2018 and no longer has a stake in the company. Published By: Divyanshi SharmaPublished On: Feb 26, 2024ALSO READ |  Elon Musk slams Microsoft for controlling ChatGPT's parent company, says OpenAI was never about profitsALSO READ |  Nvidia CEO rings alarm on IT jobs, says with AI no one will require Java or C to do coding "
}