{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.macaubusiness.com/askey-and-asus-enhance-smart-manufacturing-with-microsoft-azure-private-5g-core-integration/",
    "text": "TAIPEI, Feb. 27, 2024 /PRNewswire/ — In a new collaboration, Askey and ASUS proudly announce a robust stride in smart manufacturing, driven by the seamless integration of Microsoft Azure Private 5G Core. This achievement represents a leap into Industry 4.0, where efficiency, secure connectivity, and intelligence converge reshape the landscape of manufacturing processes. “Askey brings forth a new era of 5G enterprise private network solution and services – efficient, stable, and cost-effective. Tailored to connect a myriad of IoT devices, our networks facilitate the collection of big data for analysis, driving the creation of intelligent applications. This empowerment enables enterprises to supercharge their operational efficiency, slash TCO costs, and inject fresh vigor into digital transformation initiatives. Microsoft and Askey’s collaboration makes ASUS’s digitalization process faster and better,” said Robert Lin, CEO of Askey. Winson Lu, Director of Integrated Solution Product Division at ASUS AIoT Business Group, emphasizes the critical role of cross-sector collaboration in the Industry 4.0 era. He points out that no single company can independently develop all the necessary technologies and professional knowledge. Using the Shulin factory as an exemplar, Lu delineates how smart manufacturing systems encompass operational technology (OT), communications technology (CT), and information technology (IT). Askey leads the 5G communication products on the CT layer, Microsoft provides cloud-based solutions for the core network, and ASUS integrates these technologies with manufacturing systems, connecting smart devices and applications through Azure. “We are working with Askey to help customers get improvements in first-pass yield, pass rates, and cost reduction in quality inspection with the Askey 5G Private Network Solution and the ASUS Smart Manufacturing Applications”, said Shawn Hakl, Vice President, Product Management, Microsoft Azure for Operators. Azure Private 5G Core, offering simplicity, scalability, and secure deployment, enables private 5G core networks on an Azure Arc–managed edge platform within Azure private multi-access edge compute (MEC). This facilitates rapid deployment and connection for diverse indoor and outdoor use cases, allowing centralized management of private 5G networks across multiple sites. Askey, a Taiwan-based manufacturer with a global footprint in the United States, EMEA, and Asia, has developed an end-to-end 5G Private Network Wireless Solution. This includes an innovative full-stack private 5G radio solution leveraging 5G indoor/outdoor small cells and CPEs. The Askey 5G Private Network Solution ensures secure IoT connections and conscious factory operation technologies, driving heightened productivity and efficiency.  About AskeyEstablished in 1989, Askey Computer Corp. specializes in crafting solutions and ecosystems for those aspiring to thrive in Smart Connected environments. Askey has consistently been the preferred carrier-grade solution partner for communications providers, major telecom operators, and consumer product providers worldwide. To explore further, please visit: https://www.askey.com/.  View original content to download multimedia:https://www.prnewswire.com/apac/news-releases/askey-and-asus-enhance-smart-manufacturing-with-microsoft-azure-private-5g-core-integration-302071513.html SOURCE Askey Computer Corp  "
}