{
    "title": "Could This Be Another Big Year for the Biggest Company in the World? 2 Key \nFactors Propelling Microsoft in 2024",
    "date": "2/22/2024",
    "url": "https://markets.businessinsider.com/news/etf/could-this-be-another-big-year-for-the-biggest-company-in-the-world-2-key-factors-propelling-microsoft-in-2024-1033094554",
    "text": "Microsoft is leading the pack in artificial intelligence after its early investment in OpenAI. The creator of ChatGPT, whose name is synonymous with the technology itself, is by far the most successful player in generative AI. In fact, ChatGPT holds the title of the most quickly adopted technology in history, reaching 100 million active users within just two months of its public launch. Microsoft began its relationship with the generative AI pioneer in 2019 with a cool $1 billion. The move drew relatively little attention at the time – the startup market was red hot and AI had yet to come into its own – but five years on, the investment has proven to be a game changer. OpenAI’s technology is powering Microsoft’s newest product, Copilot. The AI assistant is already a success; the company says 40% of Fortune 100 companies subscribed to its early access program and its GitHub version boasts over 1 million paid users. Microsoft has big plans for Copilot, rolling out tools across industries, from education to finance, and built to scale from individuals to entire organizations. Copilot is likely to be a true winner for the company and a far cry from its previously failed attempts at digital assistants. Does anyone remember Clippy? The real genius in Microsoft’s partnership with Open AI is in the magic that happens behind the scenes. ChatGPT and other Large Language Models (LLMs) require massive amounts of processing power to operate. As part of Microsoft's deal with OpenAI all of the intensive backend processing for ChatGPT is handled by Azure, Microsoft's cloud service. That means as OpenAI scales, so too does Microsoft’s bottom line.  The company has invested heavily in building Azure into the premium cloud service for Artificial Intelligence – it's working. Azure enjoyed a 30% bump in revenue over the last quarter. AWS, Amazon’s cloud service, has long been the undisputed king, but its market share is shrinking relative to Azure, largely driven by the advent of AI. In the last 5 years, Azure has grown 50% relative to AWS. Microsoft CFO, Amy Hood, illustrated the growth from AI in the company’s last earnings call, “6 points of revenue growth in the Azure and cloud services division came from AI in the latest period, up from 3 points the prior quarter”. For traders who believe in the bull case and wish to maximize their view, leveraged ETFs can be an excellent option, ETFs like those offered by Direxion. The innovative fund manager offers two plays on MSFT, one for bulls and one for bears.  The Direxion Daily MSFT Bull 1.5X Shares (NYSE:MSFU) seeks daily investment results, before fees and expenses, of 150% of the daily performance of the common stock of Microsoft Corporation (NASDAQ:MSFT). The Direxion Daily MSFT Bear 1X Shares (NYSE:MSFD) seeks daily investment results, before fees and expenses, of 100% of the inverse (or opposite) of the daily performance of Microsoft Corporation. Photo by Christina @ wocintechchat.com on Unsplash. Indices Commodities Currencies Stocks "
}