{
    "title": "Microsoft Copilot: Will 2024 be its year?",
    "date": "2/12/2024",
    "url": "https://www.siliconrepublic.com/machines/bearingpoint-microsoft-copilot-ai-chatbot",
    "text": "by Colin Ryan 12 Feb 2024 Image: © monticellllo/Stock.adobe.com BearingPoint’s Phillip Fitzpatrick and Stephen Redmond discuss the capabilities of Microsoft’s AI digital assistant, Copilot.  The explosion of interest and investment in AI recently has had a significant impact on nearly every facet of society. Companies in virtually every sector are continously competing to develop and build upon their own AI products and services, with a particular focus present in the world of Big Tech. One particular company that has launched full force into the AI scene is Microsoft. The tech giant has placed a considerable amount of attention and effort into its AI offerings, boosted by its partnership with AI powerhouse OpenAI, as well as investing heavily in the sector. This AI focus appears to be paying off for Microsoft, as it recently became the second company ever to briefly reach the $3trn valuation, a feat that previously had only been achieved by Apple. Last September, Microsoft revealed its AI assistant, Microsoft Copilot, an AI chatbot for everyday use that brings all of the company’s AI offerings under one umbrella brand. Since its reveal, Copilot has received numerous updates and upgrades, such as being infused with OpenAI’s ChatGPT-4 Turbo model and the Dall-E 3 image generator, as well as the reveal of a premium version of the chatbot. Microsoft also announced the addition of a Copilot key on Windows 11 PCs, which will reportedly begin appearing this year. But how does Copilot fit into the broad spectrum of digital assistants and chatbots? According to Phillip Fitzpatrick, director of Microsoft Services at BearingPoint Ireland, Copilot has “jumped the curve” of what digital assistants are capable of. “It is so far beyond the simple command interfaces that we have got used to – and frustrated with – that is just can’t be categorised with them,” says Fitzpatrick. “It is helping me quickly summarise long documents in Word, draft emails in Outlook, analyse data in Excel and generate PowerPoints to help me share the stories of what I have discovered.” A common concern around the use of AI chatbots and assistants – particularly in a corporate setting – is the level of understanding that this technology has in terms of context and user intent, with distinct worries about hallucinations. Fitzpatrick says that these hallucinations can be avoided when the AI has enough context, and that Copilot is consistently aware of users’ corporate context through the use of Microsoft Graph, a service that securely connects data across the Microsoft 365 landscape. “Microsoft Graph creates a Semantic Index across your documents on OneDrive , your company’s documents in SharePoint, your Teams channels and across your Outlook content,” explains Fitzpatrick. “This means that no matter what area of Microsoft 365 you are working in, Copilot knows the context you are in and can determine the nuance of the message. “As an example, if I ask Microsoft 365 Chat to ‘summarise recent emails from Gary’, it already has a good idea [of] who Gary is because it knows that there is a Gary who I frequently correspond with.” Fitzpatrick also emphasises the importance of extensibility. “For example, Microsoft are enabling connectivity to other systems, so companies will be able to bring data into the Semantic Index from third-party products such as Jira or ServiceNow.” With the increased focus on development and deployment in the AI chatbot scene, we also wanted to find out what trends are directly impacting this innovation. “We have already seen that the new generation of generative AI chatbots are surpassing the simple command or two-word query ability of their limited predecessors,” says Stephen Redmond, a director and head of the data analytics and AI team at BearingPoint Ireland. “This is enabled by the natural language processing (NLP) abilities of the underlying large language models (LLMs) such as GPT-4. I think that 2024 will be the year of the Copilot!” Redmond predicts that every system used in a work environment will utilise a digital assistant that answers questions and performs in-context tasks to improve productivity. He says that through the presence of constantly improving LLMs and enhanced dialogue management techniques, these assistants will become more conversational, resulting in quicker answers and ultimately benefit the user’s productivity. “Improvements that we will see emerging in the dialogue management will be the additional ability to handle multiple topics, switch between different modes of interaction and provide feedback and guidance to the user,” says Redmond. “Modes of interaction for users will include seamless switching between voice, text and images. “What will be really interesting to observe is what happens as the interaction extends to other models using APIs – bots talking to bots, with intelligent orchestration!” Redmond also believes that there will be a “whole new set of thinking” around user experience in terms of these chatbots and assistants, such as the way people use this tech and how it can be designed to seamlessly integrate into various contexts. “People often think in complex ways, and as we get more comfortable with this new generation of chatbots then we will expect them to handle more complex queries – without us having to learn to be prompt engineers!” One can’t discuss this emerging tech without discussing the various ethical concerns that arise with its integration. Redmond stresses that privacy and compliance with existing regulations are important and “should go without saying in the design of any modern technology”, and that AI-specific issues such as transparency, fairness and accountability are “going to be key”. “Any time that someone is engaging with a chatbot, it should be transparent to the user that it is an AI that they are dealing with,” says Redmond, adding that the AI should be able to disclose information such as its identity, purpose and capabilities to a user on request. “The bot should never pretend to be human or try and deceive the user,” he says. “This also goes to the topic of respecting human dignity. The AI chatbot has got to respect the autonomy, rights and values of the person using the system, and should not manipulate, coerce or exploit them in any way.” Redmond says that fairness in AI is a “critical topic” and that efforts need to be made to avoid discrimination and bias being perpetrated by a chatbot, which has occurred in the past. “From an accountability perspective, chatbots should obviously always follow the laws, regulations and ethical standards that apply, including the new EU AI Act and any other laws that may come from other jurisdictions. And they should also be subject to monitoring, evaluation and feedback.” Find out how emerging tech trends are transforming tomorrow with our new podcast, Future Human: The Series. Listen now on Spotify, on Apple or wherever you get your podcasts. In-Depth:\n                            AI & Analytics Week,                 More on BearingPoint Related:\n                    Brand Insights,             AI,             Microsoft,             working life,             Microsoft 365,             data,             BearingPoint Colin Ryan is a copywriter/copyeditor at Silicon Republic editorial@siliconrepublic.com 6 Mar 2024 7 Feb 2024 22 Jan 2024 16 Feb 2024 16 Feb 2024 9 Dec 2023 19 hours ago 20 hours ago 21 hours ago 21 hours ago 23 hours ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago 2 days ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}