{
    "title": "Microsoft plans to provide AI skills to 2 million workers in India by 2025",
    "date": "2/9/2024",
    "url": "https://www.gizchina.com/2024/02/09/microsoft-ai-skills-training-india/",
    "text": "Earlier this week, at the Microsoft CEO Connection event held in Mumbai, India, Microsoft CEO Satya Nadella announced that the company plans to serve as many as two million people in India by 2025.  This ambitious plan involves training 2 million people in India with AI skills by 2025. The initiative, named ADVANTA(I)GE INDIA, is part of Microsoft’s broader Skills for Jobs program and is aligned with the company’s responsible AI principles. The goal is to accelerate India’s AI transformation and empower its workforce for the jobs of the future. The program will focus on upskilling people in smaller cities and rural areas to bridge the gap in AI capabilities. It will also aim to expand AI fluency nationwide for inclusive growth.  Microsoft says that it wants to aid India’s transformation into an AI-first nation. Nadella also highlighted how Microsoft Copilot, an AI tool can increase organizational productivity by streamlining work. He added that research shows early adopters of Copilot for Microsoft 365 are now ” up to 29% faster on a range of tasks,” including but not limited to writing and summarizing content. Nadella mentioned that some organizations in India are already leveraging AI capabilities to improve productivity. In addition to accelerating innovation and improving efficiency, integrating AI into an organization’s workflow can also increase benefits. Microsoft’s ADVANTA(I)GE INDIA initiative comprises three main components: 1. Partnerships for Training: Microsoft will partner with the national government and 10 states to train 500,000 students at rural higher education institutions. The company has also collaborated with India’s Ministry of Skill Development and Entrepreneurship for this initiative. 2. In-Depth AI Training: The program will provide in-depth AI training for 100,000 young women and technical skills training for 100,000 government officers. This training will be delivered through partnerships with government, nonprofits, and businesses across India. 3. Awareness and Summit: Microsoft will raise awareness about responsible AI and AI-related jobs for 400,000 students and help 250,000 government officers understand generative AI better. Also, the company will convene a summit for 2,500 nonprofits to leverage AI in their work, through a collaboration with LinkedIn.  The initiative is a significant step towards democratizing access to AI skills, to propel India into a promising era of AI fluency and empower citizens across the country with the right skills to thrive in the age of AI. Microsoft’s President of Microsoft India & South Asia stated, “India has a huge opportunity to be a global leader in AI, and creating AI fluency at scale is a critical step in that journey.” Microsoft’s renewed vigour to prepare the Indian AI workforce is inclusive across social class, gender, and income levels. The company aims to bridge the gap in AI capabilities, especially in Tier-2 and Tier-3 cities, by providing training and resources to individuals in smaller cities and rural areas. Smt. Trishaljit Sethi, Director General (Training), Ministry of Skill Development & Entrepreneurship “In the years ahead, AI innovation will play a pivotal role in shaping our future, and we at the Directorate General of Training, Ministry of Skill Development & Entrepreneurship, stay dedicated to realizing the potential of the AI era for India, in partnership with Microsoft and others … This commitment involves equipping the youth with skills through training in tools that redefine how people work, connect, address real-world challenges, and live. Our institutions like ITIs, NSTIs, and our skilling platform are driving the skilling mission for the youth. Our commitment extends to advancing India’s digital future by empowering a substantial workforce across the length and breadth of the country, ensuring that key sectors in India become AI-first and AI-ready.” Puneet Chandok, president of Microsoft India & South Asia “The ADVANTA(I)GE INDIA initiative is a significant step towards democratizing access to AI skills across the nation and reflects Microsoft’s deep commitment to enabling inclusive growth with technology … India has a huge opportunity to be a global leader in AI, and creating AI fluency at scale is a critical step in that journey. This initiative aims to propel India into a promising era of AI fluency, empowering citizens across India with the right skills to thrive in the age of AI.” Ameya Vanjari, COO, Tata STRIVE, said “Given the rising need for professionals in AI and security skills and the shortage of skilled talent especially in AI domain, building a diverse and inclusive talent pool is an imperative for organizations. Tata Strive is glad to partner with Microsoft in this skilling journey, training students and connecting them to job opportunities or internships, enabling growth opportunities for young women and girls. We are excited to help strengthen the ecosystem through sustained skilling efforts to bridge the skills gap, providing organizations with industry-ready talent.”  Microsoft’s initiative to provide AI skills to 2 million workers in India by 2025 is a significant step towards empowering the Indian workforce for the future. The company aims to accelerate India’s AI transformation and create a more AI-fluent nation. It will do this by focusing on inclusive training and partnerships with the government, nonprofits, and businesses. Efe Udin is a seasoned tech writer with over seven years of experience. He covers a wide range of topics in the tech industry from industry politics to mobile phone performance. From mobile phones to tablets, Efe has also kept a keen eye on the latest advancements and trends. He provides insightful analysis and reviews to inform and educate readers. Efe is very passionate about tech and covers interesting stories as well as offers solutions where possible. Efe Udin, a government tech policy expert is a seasoned tech writer with over seven years of tech writing experience. Efe's true passion lies in exploring the intersection of technology, politics, and brand feuds.\n\r\nWith an astute understanding of the power dynamics and competitive landscape within the tech world, Efe delves into the intricacies of how technology influences political discourse and how brand rivalries shape the industry.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}