{
    "title": "Surface Hub 2S now gets free migration to Microsoft Teams Rooms on Windows",
    "date": "2/28/2024",
    "url": "https://mspoweruser.com/surface-hub-2s-now-gets-free-migration-to-microsoft-teams-rooms-on-windows/",
    "text": "Follow us Share this article Improve this guide Microsoft launched Surface Hub 2S back in 2019 2 min. read Published on February 28, 2024 published on \n\nFebruary 28, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft announced today the availability of a free and straightforward migration for Surface Hub 2S devices to Microsoft Teams Rooms on Windows. Initially launched back in 2019, this brings the latest collaboration features and functionalities enjoyed by recently-launched Surface Hub 3 users to the previous generation device. Since Surface Hub 2S now runs the same Teams Rooms on the Windows software platform as Surface Hub 3, you can download the Migration Launcher app from the Microsoft Store. The migration is designed for both small businesses and large enterprises, with options for manual and remote deployment using Microsoft Intune. You can also choose to migrate now to experience the Teams Rooms features or wait for future support of Windows Autopilot and Auto-login of Teams Rooms for a fully automated end-to-end transition. But it still comes with a few limitations. While migration does bring software upgrades, some advanced features like Smart Rotation and Intelligent Audio are exclusive to Surface Hub 3 hardware. First-generation Surface Hubs and Surface Hub 2S devices running Windows 10/11 Pro or Enterprise are also not eligible for this migration. Surface Hub 3, which was launched back in September last year during the Surface event, comes in 50-inch and 85-inch variants. It’s well powered by AI: you get tools like Cloud IntelliFrame and Copilot in Whiteboard, besides Smart AV, Smart Rotation, and more. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}