{
    "title": "Key Apple Hire Departs Microsoft's AI And Mixed Reality Division, Report \nSays - Microsoft (NASDAQ:MSFT)",
    "date": "2/7/2024",
    "url": "https://www.benzinga.com/news/24/02/36978390/key-apple-hire-departs-microsofts-ai-and-mixed-reality-division-report-says",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Rubén Caballero, the former Apple Inc. AAPL executive who was hired by Microsoft Corp. MSFT in 2020 to lead the device engineering for mixed reality and AI, has reportedly left the company. What Happened: Insiders informed that while Caballero’s departure from Microsoft was not officially announced, he is no longer listed in the company’s internal directory, nor has he been seen at the office or on Teams chats, as per a Business Insider report on Tuesday. However, his LinkedIn profile still indicates his role at Microsoft as “present.” Microsoft did not immediately respond to Benzinga's request for comment. See Also: Arm Holdings Expected To Report Strong Earnings On Back Of Android Demand, While Apple Supplier Faces Risks Amid China Slowdown Caballero, who previously served as Apple’s president of engineering, was hired by Microsoft to work on devices such as HoloLens in the company’s mixed reality and AI organization. He was also appointed as a technical advisor to hardware startup Humane. Microsoft has reportedly canceled several hardware projects to focus more on artificial intelligence. Why It Matters: Caballero’s departure comes at a time when Microsoft is making significant strides in the fields of mixed reality and AI. This move could potentially impact the company’s future direction in these areas. Microsoft’s increased focus on AI aligns with a broader industry trend. There has been a noticeable surge in demand for major AI projects, with use cases expanding in 2024. This suggests that AI is becoming an increasingly important aspect of the tech industry. Furthermore, Microsoft’s recent emphasis on robotics to improve its data center operations indicates a broader commitment to technological innovation. Caballero’s departure could prompt a reevaluation of the company’s strategy in these areas. Read Next: Meta To Boost Employee Bonuses After Mark Zuckerberg’s Company Witnesses Record-Breaking Quarter: Report Image via Shutterstock Engineered by\n        Benzinga Neuro, Edited by\n        \n\n              Pooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the\n        extensive Benzinga Ecosystem, including native data, APIs, and more to\n        create comprehensive and timely stories for you.\n        Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}