{
    "title": null,
    "date": "3/10/2024",
    "url": "https://www.americanbankingnews.com/2024/03/10/microsoft-co-nasdaqmsft-shares-sold-by-second-half-financial-partners-llc.html",
    "text": "Posted by ABMN Staff on Mar 10th, 2024 Second Half Financial Partners LLC trimmed its position in shares of Microsoft Co. (NASDAQ:MSFT – Free Report) by 92.1% in the third quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission. The institutional investor owned 1,016 shares of the software giant’s stock after selling 11,851 shares during the period. Second Half Financial Partners LLC’s holdings in Microsoft were worth $321,000 at the end of the most recent reporting period. A number of other large investors have also added to or reduced their stakes in MSFT. Monumental Financial Group Inc. bought a new position in Microsoft during the 1st quarter valued at $28,000. Atlantic Private Wealth LLC boosted its stake in Microsoft by 534.5% during the 2nd quarter. Atlantic Private Wealth LLC now owns 184 shares of the software giant’s stock valued at $63,000 after acquiring an additional 155 shares during the last quarter. Infrastructure Capital Advisors LLC bought a new position in Microsoft during the 2nd quarter valued at $601,000. Hibernia Wealth Partners LLC bought a new position in shares of Microsoft in the 3rd quarter worth about $69,000. Finally, Iron Horse Wealth Management LLC lifted its position in shares of Microsoft by 89.0% in the 3rd quarter. Iron Horse Wealth Management LLC now owns 223 shares of the software giant’s stock worth $70,000 after buying an additional 105 shares during the last quarter. 69.20% of the stock is owned by institutional investors and hedge funds. In other Microsoft news, major shareholder Corp Microsoft sold 1,000,000 shares of the firm’s stock in a transaction dated Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total value of $1,950,000.00. Following the completion of the transaction, the insider now directly owns 11,677,398 shares in the company, valued at $22,770,926.10. The sale was disclosed in a filing with the SEC, which is accessible through this link. In related news, insider Bradford L. Smith sold 45,000 shares of the firm’s stock in a transaction that occurred on Friday, February 2nd. The shares were sold at an average price of $411.78, for a total transaction of $18,530,100.00. Following the completion of the sale, the insider now directly owns 574,129 shares in the company, valued at $236,414,839.62. The transaction was disclosed in a filing with the SEC, which is accessible through the SEC website. Also, major shareholder Corp Microsoft sold 1,000,000 shares of Microsoft stock in a transaction that occurred on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the sale, the insider now owns 11,677,398 shares of the company’s stock, valued at $22,770,926.10. The disclosure for this sale can be found here. Insiders sold a total of 1,048,303 shares of company stock worth $21,821,514 over the last ninety days. 0.03% of the stock is currently owned by company insiders. A number of research analysts have recently issued reports on MSFT shares. Royal Bank of Canada raised their price target on shares of Microsoft from $415.00 to $450.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. BMO Capital Markets raised their price target on shares of Microsoft from $420.00 to $455.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Macquarie raised their price target on shares of Microsoft from $430.00 to $450.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Tigress Financial raised their price target on shares of Microsoft from $433.00 to $475.00 and gave the stock a “buy” rating in a research report on Wednesday, November 29th. Finally, Raymond James raised their price target on shares of Microsoft from $400.00 to $450.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Four equities research analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the stock. Based on data from MarketBeat.com, Microsoft has a consensus rating of “Moderate Buy” and a consensus price target of $415.00. Check Out Our Latest Stock Analysis on MSFT Shares of MSFT opened at $406.22 on Friday. The firm’s 50 day moving average is $399.55 and its 200-day moving average is $365.61. The stock has a market capitalization of $3.02 trillion, a P/E ratio of 36.73, a P/E/G ratio of 2.18 and a beta of 0.89. The company has a debt-to-equity ratio of 0.19, a current ratio of 1.22 and a quick ratio of 1.20. Microsoft Co. has a 12-month low of $245.73 and a 12-month high of $420.82. Microsoft (NASDAQ:MSFT – Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 earnings per share (EPS) for the quarter, topping the consensus estimate of $2.76 by $0.17. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. The company had revenue of $62.02 billion for the quarter, compared to analysts’ expectations of $61.14 billion. During the same quarter in the previous year, the company posted $2.32 EPS. The business’s revenue was up 17.6% compared to the same quarter last year. Equities research analysts anticipate that Microsoft Co. will post 11.63 EPS for the current fiscal year. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Envestnet Asset Management Inc. Increases Stock Holdings in UMB Financial Co. (NASDAQ:UMBF) Lantheus Alpha Therapy, Llc Buys 60,431,039 Shares of Perspective Therapeutics, Inc. (NYSEAMERICAN:CATX) Stock "
}