{
    "title": "MICROSOFT CORP Trade Ideas — TURQUOISE:MSFTN — TradingView",
    "date": "3/24/2024",
    "url": "https://www.tradingview.com/symbols/TURQUOISE-MSFTN/ideas/page-65/",
    "text": "MSFT just broke the cloud on the daily chart. \n\n2,330 MSFT 8 APR 22 300 CALL @ 11.98 were just bought for $2.8 million. \n\nI will swing this for a few days. Microsoft  - Short Term - We look to Buy at 303.35 (stop at 296.56) \n\nWe look to buy dips. Previous resistance, now becomes support at 300.00. Trading has been mixed and volatile. The bias is still for higher levels and we look for any dips to be limited. \n\nOur profit targets will be 325.34 and 336.10 \n\n Resistance:  320.00 / 340.00 / 350.00\n Support:  300.00 /... MSFT is finishing up a W-3. It may open slightly higher tomorrow morning and reach the 1.618 fibonacci extension, but the sell-off will definitely start tomorrow. I will be selling covered calls against my shares to protect against downside. Also, bearish divergences evident in MACD and RSI. Hello ladies and gentlemen, according to my graphical analysis Of MICROSOFT , there is a high probability  the market will go down those  coming weeks. $MSFT room towards upside after break of resistance since Jan 6, on Mar 18. Retest of resistance to indicate new support Mar 21... and retest and hold of 200ma on 4h chart. Stochastics bottoming out crossing back up for confirmation. Taking otm option plays 2w out 📈 When looking at a combination of indicators on the 15-minutes chart that best represents Microsoft's recent volatility, A kind of resistance line was found. When examining the minimum threshold for MACD and RSI, it shows strong support at the $271 level. Using the red line as a stepping stone, stock prices are currently active around the yellow line at the $288. MSFT Key levels, Analysis & Targets\n\nTime frame D1 Bullish Divergences in MACD Indicator\n,Price to Fibonacci = 61.8% - 88.7% Hey folks, happy Wednesday!\n\nMicrosoft seems to be forming a head and shoulders pattern on the weekly chart. It might be a good time to set up a short position with a stop loss right above the resistance line. strong momentum upwards after a long down trend . watch out for a pullback but in general it a good signal to buy Strat play 3/25 305c\nSetup: 2-1-2 bullish continuation\n\nTheoretical gain: 1.30 -> 1.80 first time\n1.50 -> 3.10 second time\n\nI wasn't able to get this one and I didn't enter on the re-trigger. It's hard to enter when it's the first few seconds of the morning. Weekly breakout to the upside on Microsoft. Buying shares in the tech sector in companies that have built a base and are displaying relative strength among market sympathies. Hello everyone, Microsoft stock analysis\nI find it an important resistance area (308.50 -310.47), by breaking it we find it at higher levels\n317.69\n330.42\n348.81\n399.02\n  But if he does not succeed in breaking it, we will find him and touch the next levels\n280.43\n267.26\n214.48 $MSFT\n\nPlayed upside on this one last week from $290 for a 10 point move. Expecting some cool down before the next leg higher.\n\n📈$302 | $305, $310, $315\n📉$288 | $285, $280, $275 quite the ugly chart on MSFT, this was the most realistic look i could get on it.\n\ncould easily push back to ATH if the indices continue to push up Good time to buy Microsoft as it just now broke out of the descending Wedge.  Long term it's a good bet anyway, plus through June it should continue an uptrend if it runs as long as the descending wedge did. MSFT hrly long\nbuystop @ 290.92\nTP #1 @ 294.76 75% wr\nTP #2 @ 300.79 54.44% wr\nSL @ swing low 275.54 15.91% hr\n\nWR and HR determined from past trades on this stock, on this timeframe.\n\nMore trades like this on my profile and on Bifrost Trades. 50 day moving average is probably next level of resistance. Bullish Bat Strong POTENTIAL REVERSAL ZONE \nPrice need to follow GREEN TREND LINE and hit Target 1 & 2 ,  else if Price BREAKS RED TREND LINE is EXIT \nPOTENTIAL BUY Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}