{
    "title": "Copilot gets its own key on Microsoft's new Surface devices",
    "date": "3/27/2024",
    "url": "https://au.news.yahoo.com/copilot-gets-own-key-microsoft-160035860.html",
    "text": "We’re still a month or so out from Build, but Microsoft is doing a bit of a trial run this week in the form of an online-only event. What’s been billed as a Windows event is, predictably, focused on AI efforts, with Copilot taking the wheel. A pair of refreshes to the Surface line announced at the event are, predictably, putting the software giant’s chatbot front and center. The new Surface Pro 10 for Business and Surface Laptop 6 for Business both sport a devoted Copilot key wedged between the Alt key and arrows. In a post published this morning, Surface general manager Nancie Gaskill writes, “The new Copilot key on Surface Laptop 6 makes accessing the power of AI even easier, with a quick button press to invoke Copilot in Windows to help customers to plan their day, find a document using natural text, analyze a website and more with commercial data protection built in.” Image Credits: Microsoft The key is the core of what the company is referring to as “the first Surface PCs optimized for AI.” Certainly, building Copilot directly into its keyboards marks a level of commitment for what is still a new project, with MS having only launched Copilot for Microsoft 365 a year ago this month. And I’m not going to spoil the mood by pointing out that Cortana keys were also a thing at one point. The systems arrive just under four months into what a handful of highly paid branding executives have deemed the “AI PC.” That and the “AI smartphones” like the Samsung Galaxy S24 are fairly meaningless labels. Intel has spent the last several months pushing “the AI PC powered by Intel,” while Apple recently declared M3 MacBook Airs “the best consumer laptops for AI.” While such language ultimately matters very little to the consumer at the end of the day, “optimized for AI” strikes a healthy balance of riding the new trend without overpromising. At the end of the day, a Copilot key is simply a physical shortcut that surfaces one particular service. It is, however, a commitment of sorts, given that space is at an ultra premium on a laptop/tablet keyboard. Image Credits: Microsoft As far as out-of-the-box Copilot functionality, Microsoft is highlighting things like handwriting analysis for OneNote. That the key has been added to a pair of business-focused devices highlights how much the company is considering Copilot an important enterprise play. The Surface Laptop 6 for Business sports an Intel Core Ultra 5 or 7 processor, coupled with the Intel Boost NPY (neural processing unit), 8–64GB of RAM and up to 1TB of storage. The display comes in 13.5- and 15-inch touchscreen varieties, which sport a stated 18.5 and 19 hours of battery life, respectively. The Surface Pro 10 for Business sports a 13-inch touchscreen, powered by either the Intel Core Ultra 5 or 7 and the Intel AI Boost NPU. (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergFed’s Preferred Inflation Metric Cools While Spending ReboundsBank of Russia Sees No Alternative to Yuan for Its ReservesPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  This update would represent Apple's first overhaul to that lineup since 2018. Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. This food habit is linked to a specific type of dementia. The dreaded pest also displaces wildlife and can blind pets. Find out more. 'We love a girly that shreds,' one fan said of the very 'Barbie' moment. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago The not-so-happy campers were stunned by the unexpected guest at their beachside campsite. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more. The person who wrote on the road has been called a \"top bloke\" by motorists. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. ‘I guess turning 29 isn’t so bad,’ the ‘American Idol’ alum joked. King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation "
}