{
    "title": "Almost 600 Microsoft Activision Workers Form Union - Employment & Business \nNews",
    "date": "3/11/2024",
    "url": "https://www.whatjobs.com/news/usa/us-business-news/almost-600-microsoft-activision-workers-form-a-union/",
    "text": "Let us find your next team member  and discover a world of talent Let us find your next team member and discover a world of talent Business News Uniqlo Offers Staff 7 Percent Pay Rise Careers Career Advice for 40-Year-Olds: Midlife Career Shifts Home  »  Business News • US business news   »   Almost 600 Microsoft Activision Workers Form Union https://www.whatjobs.com/news/usa/us-business-news/almost-600-microsoft-activision-workers-form-a-union By Nithya Bose in Business News, posted March 11, 2024 Almost 600 Microsoft Activision Workers Form A Union Around 600 employees at Activision Publishing, owned by Microsoft, are joining the largest video game workers' union in the US, as announced by the Communications Workers of America. Microsoft recognized the move after the finalization of the vote count. The union comprises quality assurance workers responsible for identifying bugs and glitches in Activision's games. Of these workers, 390 voted in favor of the union, with only eight dissenting, while about 200 did not vote. This unionization effort comes on the heels of Microsoft's acquisition of Activision Blizzard for $69 billion in October. Spotlight 10 Products That Saved Companies Business News Microsoft Moves To Dismiss Parts Of New York Times’ Lawsuit Bizarre Lawsuits Microsoft Lawyers Got Heavy On Teenager Over Website Microsoft agreed to a groundbreaking pact with the CWA to gain regulatory approval for the deal, promising neutrality towards unionization efforts. This agreement ensured that management would not dissuade or influence employees' decisions regarding unionization. It facilitated the smooth organization of the workers without fear of retaliation. The formation of this union marks the first of its kind at Activision, following the agreement with Microsoft. The union aims to negotiate better pay, job security, and advancement opportunities for quality assurance testers, who are among the lower-paid roles in the gaming industry. Utilizing an expedited process bypassing the need for a National Labor Relations Board election, workers showed their union support through signing authorization cards or confidential online voting, verified by third-party arbiter Fred Horowitz. Microsoft expressed its intention to maintain a positive labor-management relationship post-vote. Need Career Advice? Get employment skills advice at all levels of your career This effort aligns with ongoing organizing activities within Activision, catalyzed by a 2021 employee walkout protesting workplace sexual misconduct allegations. The focus has since shifted towards broader labor rights and unionization issues, aided by the CWA. This unionization at Activision follows a similar successful initiative at ZeniMax Media, another Microsoft-owned game studio. Around 300 workers voted to unionize earlier at the company using the expedited process. The CWA now represents over 1,000 video game workers at Microsoft. It signifies a growing trend of labor organizations in the tech and gaming sectors amid industry-wide layoffs and cost-cutting measures. Follow us on X, LinkedIn, and Facebook Crime and Fraud The Biggest Business Frauds Of The 1980s Crime and Fraud Comptroller Stole £53 Million To Fund Lavish Lifestyle And Breed Horses Dangerous Jobs How Alaskan Crab Fisherman Face Hypothermia And Terrifying Weather © 2023 WHATJOBS? a registered trademark of WhatDigital (Holdings) Ltd "
}