{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.techradar.com/pro/newly-discovered-microsoft-z1000-ssd-baffles-experts-no-worlds-most-valuable-company-wont-start-selling-ssds-anytime-soon-but-may-well-be-tinkering-with-data-center-storage-as-it-did-with-cpu",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. 2TB and perhaps even 4TB versions of Microsoft SSD could exist A newly-discovered, Microsoft-branded SSD suggests the tech giant may be – or has been at least - exploring new ways to optimize its data center storage. The leaked images of a Microsoft Z1000 SSD show a 1TB NVMe M.2 drive, apparently boasting sequential read speeds of up to 2,400MB/s and write speeds of 1,800MB/s. The Z1000 SSD, originally revealed by @yuuki_ans on X, is made up of a mix of components from various companies, including Toshiba NAND flash chips, Micron's DDR4 RAM cache, and a controller from CNEX Labs, a company best known for its work with data center hyperscalers.  Back in 2018, CNEX Labs closed a $23 million Series D funding round led by Dell Technologies Capital which also included Microsoft’s venture fund M12. This money was partially used to fund a proprietary, advanced CNX-2670 controller that delivered  550,000 IOPS, a 25% performance increase over previously available M.2 form-factor SSDs at the time. The CNEX Labs controller in the leaked photos is CNX-2670AA-0821. The SSD has a capacity of 960GB made up of four 256GB Toshiba BiCS4 96-layer eTLC chips and features a 1GB DDR4 RAM cache made by Micron to boost performance. The leaked \"engineering sample\", produced on May 18, 2020 when much of the world was in Covid lockdowns, suggests the drive is part of a broader portfolio of SSD models. Its design allows for the addition of more DRAM and capacitors, hinting at larger versions. As Tom’s Hardware notes \"several unused solder pads are on both sides of the PCB, presumably for additional capacitors. This implies that there may be larger versions of the Z1000 with 2TB and perhaps even 4TB of room, given that more capacity would require more DRAM and capacitors to ensure data protection.\" Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! This isn't the first time Microsoft has experimented with hardware design for its data centers, having recently revealed its own-brand silicon hardware in order to help further the development and use of AI in businesses. SSD：\nMicrosoft Z1000 960GB\nM.2 22110 NVMe 1.2\n主控(Control)：\nCNEXLabs\nCNX-2670AA-CB2T(19y6w)\n缓存(Cache)：\nMicron（D9VPP）\nDDR4 1GB MT40A1G8SA-075:E\n颗粒(NAND)：\nToshiba 3D eTLC - 256GB\nTH58LJT1V24BA8H（bics4 96L） https://t.co/pJegEYzsph pic.twitter.com/ifgxTDiiJMMarch 9, 2024 Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. 'Wean itself off Nvidia': Samsung signs $750 million agreement with South Korea's largest online platform — Naver wants to replace Nvidia's super expensive AI GPU with the more affordable Mach-1 chip SMBs believe AI is going to give them the edge when it comes to success Apple tipped to launch new iPads in May By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By James IdeMarch 28, 2024 By Mackenzie FrazierMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Craig HaleMarch 28, 2024 By Darren AllanMarch 28, 2024 By Nigel PowellMarch 28, 2024 By Steve ClarkMarch 28, 2024 By Jody BaileyMarch 28, 2024 By Craig HaleMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}