{
    "title": "Google Isn't Alone in Facing Problems With AI-Generated Images. Microsoft \nIs, Too.",
    "date": "3/17/2024",
    "url": "https://finance.yahoo.com/news/google-isnt-alone-facing-problems-130000475.html?prefer_reader_view=1&prefer_safari=1",
    "text": "The chatbot wars have arrived, and there are plenty of companies vying to dominate the space. Microsoft (NASDAQ: MSFT) has invested $13 billion into OpenAI, the maker of ChatGPT. The tech company has been bolstering its Bing browser and Office applications with artificial intelligence (AI) capabilities in an effort to win over more customers and generate an early lead. Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG), through its Google segment, has long been a rival of Microsoft, and it has been trying to keep up, launching its chatbot Bard last year, which ended up morphing into Gemini this year. Google's rollout hasn't exactly been smooth, however, as the company has now fumbled multiple times with its AI, the latest problem being that it is generating inaccurate images. But Microsoft hasn't exactly been unscathed in this period of early growth, either. It, too, might have problems with its AI, particularly with its image generator. An engineer at Microsoft, Shane Jones, says he has been testing the company's AI image generator via Copilot Designer, which uses OpenAI technology. And he has been so concerned with the images that the company's AI image generator created that he has sent a letter to the company's board and alerted the Federal Trade Commission. He said he believes it runs afoul of the company's AI responsibility principles, claiming that it created controversial images, including ones that were violent, sexual, involved underage drinking, and which also appeared to violate copyright laws. AI-image generators can create virtually anything out of just text inputs. The concept involves a user entering some text and the AI then creating an image based on that. But with the technology in its early stages, it appears that not enough safeguards and restrictions have been put into place to prevent a wide range of potentially disturbing images from being generated. And Jones is also concerned that there isn't a way to easily report and rectify these issues. The public is likely more aware of the well-publicized issues relating Google's AI chatbot Gemini. The issues have been concerning enough that the company decided to pull the AI image generator last month, with the promise of relaunching it after addressing the issues. Critics have accused Gemini of getting images wrong, especially when it comes to generating pictures of historical figures where the race, ethnicity, and gender might not appear to be accurate. CEO Sundar Pichai admits that the AI needs to be fixed, but also reminds users that the technology is in its early stages. \"No AI is perfect, especially at this emerging stage of the industry's development, but we know the bar is high for us,\" Pichai said. Unfortunately, this is not new territory for Google. Last year, in Bard's first public appearance, it made a factual mistake in a promotional video. It might be tempting to assume that after two blunders, Google's chatbot isn't going to catch up to OpenAI and Microsoft. But AI chatbots are likely to go through multiple iterations and enhancements over the years, and trying to declare a winner at this point would be premature at best. Although Microsoft has the early advantage thanks to its investment in OpenAI, by no means does that guarantee success for the company. And the concerns relating to its AI image-generating capabilities are a reminder that investors and consumers should expect bumps along the way, particularly when it comes to new products and services. Investors are clearly more willing to pay a premium for Microsoft's stock than they are for Alphabet's, with the former trading at 37 times its trailing earnings and the latter trading at just 24. Alphabet's AI has struggled out of the gate, and that's likely a big reason why its valuation is lower than Microsoft's. Alphabet, however, still has a strong business, which generated $74 billion in profit last year on revenue of more than $307 billion. With solid assets such as YouTube and Google Search, AI can enhance those products even further. Investors should be careful not to assume that Alphabet can't recover from this recent bad press. Microsoft might be the more polished AI stock to buy right now, but Alphabet could end up being the better investment. It has a lower valuation and is a bit of an underdog right now, so the bar is set fairly low. And with a good track record for innovation and growing its business, Alphabet could make for an underrated AI stock to own for the long haul. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 11, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. David Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Google Isn't Alone in Facing Problems With AI-Generated Images. Microsoft Is, Too. was originally published by The Motley Fool Related Quotes "
}