{
    "title": "Microsoft Co. (NASDAQ:MSFT) Stake Decreased by First Hawaiian Bank",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-msft-sec-filing-2024-03-21/",
    "text": "First Hawaiian Bank decreased its holdings in shares of Microsoft Co. (NASDAQ:MSFT - Free Report) by 3.4% during the fourth quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission. The institutional investor owned 89,317 shares of the software giant's stock after selling 3,152 shares during the quarter. Microsoft accounts for approximately 1.1% of First Hawaiian Bank's holdings, making the stock its 10th biggest position. First Hawaiian Bank's holdings in Microsoft were worth $33,587,000 at the end of the most recent quarter. Other institutional investors and hedge funds have also modified their holdings of the company. Moneta Group Investment Advisors LLC grew its stake in Microsoft by 112,158.6% in the fourth quarter. Moneta Group Investment Advisors LLC now owns 150,187,424 shares of the software giant's stock valued at $36,017,948,000 after purchasing an additional 150,053,637 shares in the last quarter. Norges Bank purchased a new position in Microsoft in the fourth quarter valued at about $20,700,525,000. Aaron Wealth Advisors LLC grew its stake in Microsoft by 35,465.9% in the first quarter. Aaron Wealth Advisors LLC now owns 20,611,140 shares of the software giant's stock valued at $66,852,000 after purchasing an additional 20,553,188 shares in the last quarter. Morgan Stanley grew its stake in Microsoft by 14.0% in the fourth quarter. Morgan Stanley now owns 119,417,954 shares of the software giant's stock valued at $28,638,815,000 after purchasing an additional 14,652,150 shares in the last quarter. Finally, Osaic Holdings Inc. grew its stake in Microsoft by 348.6% in the second quarter. Osaic Holdings Inc. now owns 11,998,927 shares of the software giant's stock valued at $894,426,000 after purchasing an additional 9,324,182 shares in the last quarter. Hedge funds and other institutional investors own 69.20% of the company's stock. Shares of MSFT stock traded up $4.14 during trading hours on Thursday, hitting $429.37. The company had a trading volume of 21,278,135 shares, compared to its average volume of 23,358,912. Microsoft Co. has a 12 month low of $272.05 and a 12 month high of $430.82. The firm has a market capitalization of $3.19 trillion, a price-to-earnings ratio of 38.82, a PEG ratio of 2.24 and a beta of 0.89. The firm's fifty day moving average is $406.63 and its 200 day moving average is $370.73. The company has a debt-to-equity ratio of 0.19, a quick ratio of 1.20 and a current ratio of 1.22. Microsoft (NASDAQ:MSFT - Get Free Report) last released its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, topping analysts' consensus estimates of $2.76 by $0.17. The business had revenue of $62.02 billion for the quarter, compared to analyst estimates of $61.14 billion. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. Microsoft's revenue for the quarter was up 17.6% on a year-over-year basis. During the same period in the prior year, the company earned $2.32 EPS. On average, sell-side analysts predict that Microsoft Co. will post 11.63 EPS for the current fiscal year. The firm also recently declared a quarterly dividend, which will be paid on Thursday, June 13th. Investors of record on Thursday, May 16th will be given a dividend of $0.75 per share. The ex-dividend date is Wednesday, May 15th. This represents a $3.00 dividend on an annualized basis and a yield of 0.70%. Microsoft's dividend payout ratio (DPR) is presently 27.12%. A number of research analysts have commented on the company. StockNews.com downgraded Microsoft from a \"buy\" rating to a \"hold\" rating in a research note on Thursday, February 22nd. DA Davidson reaffirmed a \"buy\" rating and issued a $500.00 price target on shares of Microsoft in a research report on Friday, March 15th. Raymond James boosted their price target on Microsoft from $400.00 to $450.00 and gave the stock an \"outperform\" rating in a research report on Wednesday, January 31st. Wells Fargo & Company boosted their price target on Microsoft from $435.00 to $460.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, January 31st. Finally, Barclays boosted their price target on Microsoft from $421.00 to $475.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, January 31st. Four analysts have rated the stock with a hold rating and thirty-six have issued a buy rating to the company's stock. Based on data from MarketBeat.com, the stock has a consensus rating of \"Moderate Buy\" and an average price target of $417.37. View Our Latest Analysis on MSFT In other Microsoft news, EVP Kathleen T. Hogan sold 21,955 shares of the company's stock in a transaction on Monday, March 11th. The stock was sold at an average price of $403.96, for a total transaction of $8,868,941.80. Following the transaction, the executive vice president now owns 159,764 shares of the company's stock, valued at approximately $64,538,265.44. The transaction was disclosed in a document filed with the SEC, which can be accessed through this link. In other Microsoft news, EVP Kathleen T. Hogan sold 21,955 shares of the company's stock in a transaction on Monday, March 11th. The stock was sold at an average price of $403.96, for a total transaction of $8,868,941.80. Following the transaction, the executive vice president now owns 159,764 shares of the company's stock, valued at approximately $64,538,265.44. The transaction was disclosed in a document filed with the SEC, which can be accessed through this link. Also, insider Bradford L. Smith sold 45,000 shares of the company's stock in a transaction on Friday, February 2nd. The stock was sold at an average price of $411.78, for a total value of $18,530,100.00. Following the transaction, the insider now directly owns 574,129 shares in the company, valued at approximately $236,414,839.62. The disclosure for this sale can be found here. Insiders have sold a total of 1,070,258 shares of company stock worth $30,690,456 in the last three months. Insiders own 0.03% of the company's stock. Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.Recommended StoriesFive stocks we like better than MicrosoftWhat is a Dividend King? Google and Meta Circling the Market on a TikTok Ban RallyWhy Invest in 5G? How to Invest in 5G Stocks  Intuitive Machines: Charting a Course Among the StarsBest Stocks Under $5.00KB Home’s Stock Price Can Move Higher, Here’s Why  Before you consider Microsoft, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Microsoft wasn't on the list. While Microsoft currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. Microsoft's stock price is pulling back following the Q4 results, suggesting a top is in play, but investors should not be so quick to shed their shares. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}