{
    "title": "The Morning After: Did Microsoft just neg Activision Blizzard?",
    "date": "3/20/2024",
    "url": "https://ca.movies.yahoo.com/movies/the-morning-after-did-microsoft-just-neg-blizzard-activision-111644248.html",
    "text": "In a recent filing, Microsoft told New Zealand’s Commerce Commission that Activision Blizzard produces no “must-have” games. Weird thing to say when the company plans to spend $68.7 billion to buy the gaming giant behind Call of Duty, Overwatch, Diablo, World of Warcraft and plenty more. In the document, Microsoft said: “There is nothing unique about the video games developed and published by Activision Blizzard that is a ‘must have’ for rival PC and console video game distributors that give rise to a foreclosure concern.” Attempting to downplay the importance of Call of Duty is just one of the ways Microsoft has tried to placate regulators. In February, the company pledged it would continue to make the franchise available on PlayStation consoles beyond any existing agreements between Sony and Activision. — Mat Smith Nearly 600 more TV writers call for Netflix, Apple to detail abortion safety policies Sega Genesis Mini 2 stock will be extremely limited in the US Apple's 10.2-inch iPad is back on sale for $300 at Amazon Solo Stove's Fire Pit 2.0 fixes the original's biggest flaw Chromecast with Google TV is on sale for $40 once again Sony is retiring the PlayStation 5's Accolades feature because people aren't nice An e-bike- and scooter-sharing startup co-founded by Olympian Usain Bolt appears to have stopped operations. Bolt Mobility offered bikes in five cities, including Portland, Burlington, Vermont and Richmond in California, and others. \"We learned a couple of weeks ago (from them) that Bolt is ceasing operations,\" a transportation planner in Chittenden County, Vermont, told TechCrunch. \"They’ve vanished, leaving equipment behind and emails and calls unanswered.” Continue reading. Apple famously bragged it’ll never invade your privacy to serve ads, but it does have an ad business on its App Store and elsewhere. The company is now expanding that business by adding a new ad slot to its Today homepage tab and on individual app pages. The company says these new ad slots will adhere to Apple's policies on privacy and transparency, by not offering personalized ads to users under 18, never using sensitive data and avoiding hyper-targeting. Continue reading. Microsoft’s console strategy is unique. Someone with a nine-year-old Xbox One has access to an almost-identical library of games as the owner of a brand-new Xbox Series X. That makes it difficult to maintain meaningfully different lists for its various consoles — at least for now. But while next-gen exclusives may be few and far between, there are a lot of gamers who simply haven’t experienced much of what Microsoft has had to offer since the mid-'10s. It’s in that frame of mind that we approach this list, now updated: What games would we recommend to someone picking up an Xbox today? Expect more updated guides to the best games throughout the week. Continue reading. It's not only Twitter trying to force Elon Musk to buy the company for $44 billion. An investor filed a proposed class action lawsuit to try stopping Musk from backing out of the deal. Luigi Crispo's suit accuses Musk of breach of contract and breach of fiduciary duty to Twitter's shareholders. Musk last month claimed the company made “false and misleading representations,” and that it misrepresented the number of bots and fake accounts on its platform. Crispo concurred with Twitter's claims that Musk is using false claims about bots and spam to wriggle out of the deal without a valid legal standing. Continue reading. It’s 2022 and Spotify is adding the most basic of functions to its iOS and Android apps: dedicated play and shuffle buttons on playlists and album pages. Until now, tapping the button on most playlists started playback, shuffled. This vanilla playback ‘feature,’ however, will only be available to Spotify Premium subscribers. Continue reading. TikTok’s parent company, ByteDance, has filed a trademark application with the US Patent and Trademark Office for \"TikTok Music.\" The service would let users \"purchase, play, share, download music, songs, albums, lyrics... live stream audio and video... edit and upload photographs as the cover of playlists... [and] comment on music, songs and albums.\" Continue reading. A man suspected of using guns and explosives to hold four people hostage in a Dutch cafe was detained by police on Saturday, after a dramatic hours-long standoff that involved scores of armed police and a remote-controlled robot. WASHINGTON (AP) — As Donald Trump campaigns on promises of mass deportations and pardons for those convicted in the Jan. 6, 2021, riot at the Capitol, his ideas are being met with little pushback and some enthusiasm by a new era of Republicans in Congress. It’s a shift from the first time around when the presumptive Republican presidential nominee encountered early skepticism and, once in a while, the uproar of condemnation. Rather than being dismissed as campaign bluster or Trump speaking his m  Follow the latest updates from St James' Park as the Premier League returns Nearly four in five NASUWT teacher members in England said they do not support moving to a national statutory ballot for industrial action. From the outside, Johannesburg does not look like it is doing well. Thanks to the attention it’s getting on TikTok and Instagram, stores around the world are selling out of this lean muscle builder. But, before you... Exclusive: Senior officers tried to set up a food bank for recruits as figures reveal scale of police food poverty The siblings, 34, posted several videos on TikTok Friday Investigator footage provided glimpses from inside the Dali cargo ship that collided with the Francis Scott Bridge in Baltimore on Tuesday, March 24, causing it to collapse.The footage, filmed by the National Transport Safety Board (NTSB) on March 28 and released a day later, shows investigators inspecting the damage from inside the container vessel. The NTSB said those aboard downloaded the voyage data from the ship.NTSB chair Jennifer Homendy previously told NBC that the investigation could take up to two years to complete. Credit: NTSB via Storyful  With March Madness in full swing, you may have seen a funny AT&T commercial that showcases Kendrick Perkins, Carmelo Anthony, and TJ Ford, players from the 2003 NBA Draft. In partnership with AT&T, Perk took some time out of his hectic schedule to ... Follow all the live action from the 2024 Boat Race in the blog below Spurs welcome the Hatters to town looking to get back on track  Tesla is the worst S&P 500 stock in 2024 as analysts slash earnings estimates. China EV giant BYD is ramping up a price war. LMPD: Man shot several times in The Highlands area following vehicle crash, argument Inconsistent Blues hope to enjoy home comforts against relegation contenders  Meteorologist Taylor Cox shows calmer wind today, but breezy for tomorrow, then storms on Monday. The Blues look to extend a strong run at Stamford Bridge The enigmatic masked trio from Melbourne hypnotise with a psychedelic fusion of Aussie surf rock and traditional Indian music  \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" As Germany authorises the consumption and cultivation of cannabis from 1 April, the mayor of Strasbourg is calling for the introduction of a local 'experiment' to move away from France's repressive approach to marijuana. According to Mayor Jeanne Barseghian: \"In a shared catchment area, we are going to have two different sets of regulations, almost diametrically opposed, between Germany, which authorises the recreational use of cannabis, and France, which has one of the most repressive sets of l The Emmy nominee tells PEOPLE she and the actor \"have a very lovely friendship\" that feels like \"we've known each other for many lifetimes\" "
}