{
    "title": "Is Microsoft Too Big To Fail in AI?",
    "date": "3/15/2024",
    "url": "https://www.spiceworks.com/tech/artificial-intelligence/articles/is-microsoft-too-big-to-fail-in-ai/",
    "text": "After reorienting Microsoft to cloud computing services, making it the second-largest player in the sector, its CEO Satya Nadella engaged in the hot pursuit of artificial intelligence. Microsoft’s investment of billions of dollars in OpenAI has paid off so far and has helped it leapfrog ahead of the competition. With nearly inexhaustible resources at hand, Spiceworks News & Insights explores whether Microsoft is indeed too big to fail in AI.  Amid the OpenAI upheaval in November 2023, when co-founder and CEO Sam Altman was fired and rehired, Microsoft CEO Satya Nadella sat down with Kara Swisher for a podcast interview to share his two cents on the episode and how AI is permeating across organizations. “We were very confident in our own ability,” Nadella said, referring to Microsoft’s presence in AI. “We have all the IP rights and all the capability. I mean, look, if tomorrow OpenAI disappeared, I don’t want any customer of ours to be worried about it, quite honestly, because we have all of the rights to continue the innovation, not just to serve the products.” “But we can go and just do what we were doing in partnership, ourselves, and so we have the people, we have the compute, we have the data, we have everything.“ Nadella is referring to Microsoft’s long-term agreements with OpenAI for full access to the code, model weights, etc. The Redmond-based tech behemoth also provides the enormous computing power and infrastructure to develop and improve AI models. So Microsoft is indeed below OpenAI, above OpenAI, and around OpenAI, as Nadella said during the podcast. Microsoft’s $13 billion investment in OpenAI and the resultant integration of generative AI into its portfolio of products and services is also one of the most significant factors behind its stock surging to $3 trillion. However, consider a scenario where OpenAI did not bring Altman back, and the company, considered one of the most advanced, was left in disarray. Nadella’s comments that Microsoft can simply pick up where OpenAI could leave off then evoke skepticism, considering the expertise needed in developing AI tools and products is a cost-intensive process. Still, the argument can be made that 90% of OpenAI employees were ready to join Microsoft after Altman’s ouster. That’s approximately 700 OpenAI employees versed in the company’s operations and the reason behind its success, prepared to make a switch. Except, those employees weren’t joining Microsoft; they were following Altman to Microsoft. “Sam chose Microsoft once, Sam chose Microsoft twice, and someone’s gotta think about why,” Nadella added. Although human talent is the biggest asset for any development initiative, AI products, especially those from OpenAI, are based on the transformer—the deep learning technology developed by  Google that is available to everyone. The indispensable feature of OpenAI and its prowess is this: OpenAI’s multiple iterations of the generative pre-trained transformers (GPT), currently at GPT-4 with GPT-5 in development, are progressively larger than the previous generation. Each GPT is trained on even larger training sets. Meanwhile, the company has documented its observation of expanding capabilities as the models were scaled and, as noted earlier, the ability to deliver inexhaustible computing for training. Essentially, OpenAI isn’t dwelling on an undisclosed technology. Transformers are known. It’s just that OpenAI, and by extension, Microsoft, is leaps and bounds ahead when it comes to obtaining the training data, using it to train models, and forming a product. That has rattled many AI aspirers, including Tesla and SpaceX CEO Elon Musk, who has sued OpenAI. OpenAI and other AI companies are also facing resistance from publishers over the use of data for AI training. However, OpenAI is steadily signing content licensing deals with other publishers to ensure it can access training data. Beyond The Associated Press, Axel Springer, and Shutterstock, the company recently signed deals with Le Monde and Prisa Media. Roger Grimes, data-driven defense evangelist at KnowBe4, told Spiceworks, “Historically, Microsoft’s most competitive problem has been arriving too late in participating with a new technology paradigm. They almost got into the Internet too late… but recovered.” “They did get into the mobile device and mobile phone market too late and didn’t realize the importance of quickly building an app ecosystem. They got into enterprise chat apps late but have recovered with MS Teams. Microsoft has a fairly good record of doing well, if not dominating the industry, once they enter it.” See More: Between Concern and Hope: Sir Tim Berners-Lee Reflects on the Web’s Past and What Lies Ahead “We love the partnership, but we’re not single-threaded,” Nadella said during the podcast. Even as Musk accuses OpenAI of providing exclusive AI model licensing deals to Microsoft and calling the latter the sole benefactor, Redmond is already making strides by investing in the France-based Mistral AI. Microsoft recently invested $16.3 million in Mistral AI, a company co-founded by former DeepMind (Google’s AI research venture) and Meta employees. Earlier in March 2024, Mistral AI launched the Mistral Large, the company’s latest flagship model that it claims is second only to GPT-4 based on the Massive Multitask Language Understanding (MMLU) benchmark. Microsoft’s investment in Europe’s premier AI company seems pragmatic. It diversifies Microsoft’s AI position, primarily associated with OpenAI and GPT model series, and adds a bit of internal competition, which is currently dominated by an array of OpenAI models. During an investor call in October 2023, Nadella said that over 18,000 organizations use the Azure AI services. Crowdbotics founder and CEO Anand Kulkarni told Spiceworks News & Insights over email, “Microsoft has decades of experience (nearly fifty years, in fact) with not putting all its eggs in one basket. It is also quite savvy when it comes to making investments that pay off over many, many years. This investment proves that it is committed to being a leader in AI and willing to invest bullishly where others have been too timid.” “It also shows the company’s commitment and drive for longevity in AI and likely lays the groundwork for global strength, and Microsoft has been sharing its plans for a model garden. Access to Mistral’s models strengthens this position. This is definitely a strategic investment, and time will tell how the organization folds it into its offering.” Besides, there are talks of transparency and communication issues in OpenAI with Altman as its head, but the company also knows he is untouchable for now. Also, Microsoft still owns a 49% stake in OpenAI, having invested approximately $13 billion. Besides, ChatGPT powers Copilot(s), so that’s not going anywhere. “I think Sam is brilliant,” noted Microsoft president Brad Smith. “But just as the printing press quickly evolved beyond Gutenberg, AI is quickly evolving beyond any single individual.” Mistral AI’s advances attracted $415 million in funding by December 2023 at a valuation of $2 billion. As the second-largest cloud provider, Microsoft is privy to the AI companies’ prowess, placing it in a relatively excellent position to judge investment decisions. When asked if Microsoft is likely to make more investments in AI companies and AI R&D, Kulkarni quipped, “Is the sky blue? Of course, Microsoft will keep making more investments in the AI ecosystem. Satya has been strategic and methodical about putting Microsoft back into the driver’s seat in the tech industry. There is zero reason to think Microsoft will take its foot off the gas pedal now. The world of AI is advancing too quickly for anyone to think they can rest on their laurels – as evidenced by the fumbling by some former leaders in this space.” Grimes added, “Microsoft buys dozens of companies each year to improve their own offerings. From now on, many of the companies and technologies they buy will be AI-enabled.” Microsoft’s AI push also encompasses the development of AI data centers globally. So far, Microsoft has announced: During a recent visit to India, Nadella also announced AI upskilling for two million Indians under the Skills for Jobs program. This is necessary, considering executives said that 40% of their workforce will have to reskill while adopting AI and automation between 2023-2026. Kulkarni noted, “There are huge skill gaps in AI. There aren’t enough AI scientists to build the next generation of models; there aren’t enough developers who understand how to exploit AI in their apps, and there aren’t enough workers who understand how to use AI to transform their jobs positively. And that’s just the beginning.” “What we see, though, is Microsoft (and the rest of the industry, for that matter) already investing in bridging these gaps, either directly or through their partners. It will be important for Microsoft to partner with organizations that can fill any skills gaps.” Microsoft routinely tussles with Apple as the biggest tech company in the world by market capitalization, an ode to the two companies’ history. However, Microsoft’s strong presence in AI gives it an edge over Apple, especially now that it has made a minority investment in Mistral AI. The European Union’s AI Act is the first-of-its-kind AI regulation that accommodates certain exemptions for companies such as Mistral AI, which carries the beacon of hope for European AI’s competitiveness with Silicon Valley. However, lawmakers argue that European companies’ ability to compete was diluted by Microsoft’s investment in Mistral AI, which will convert to equity in its next funding round. Still, Grimes is hopeful of Microsoft’s influence. “As a major provider of products and services across Europe, yes, Microsoft will try to influence AI regulations there in a way that keeps the AI ecosystem healthy so that it can grow and prosper. They will likely be invited to participate in commenting on and shaping future AI policies.” “This makes perfect sense since they are also one of the biggest providers of AI in the world today. Today’s regulators and politicians are eager to listen to industry leaders when it comes to shaping new policies, especially on technologies they themselves don’t really understand,” Grimes said. Kulkarni agrees. He said, “Microsoft will likely stay true to its publicized beliefs regarding international code. It will encourage any regulations to build upon work already done at the OECD, encourage cross-border safety and compliance by fostering innovation and access, and give regulated AI developers a way to vouch for the security of these systems compared to globally recognized norms.” Influence it shall have, nonetheless. The EU is also opening the European AI Office, which will operate under the powers bestowed by the AI Act. See More: AI Hallucinations and their Impact on Enterprise LLM Adoption Microsoft is grabbing attention with its full-throttle approach to achieving AI dominance. Musk’s lawsuit may be against OpenAI, but court proceedings can open up Microsoft’s investment in OpenAI to scrutiny. The San Francisco-based company was a non-profit that changed its corporate structure a few months before receiving $1 billion in the secondary market from Microsoft. OpenAI is now valued at ~$80 billion. Further, Microsoft defines AI as a complex, nine-tiered sector. The company maintains a presence in some of these areas. The Tech Stack for AI Source: Microsoft While Microsoft is solid in distribution through Azure, in applications through its development experience and vast product base, and in data centers, it is already facing the ire in Europe over foundation models. European lawmakers are calling for a closer review of Microsoft’s strategic partnership with Mistral AI and the availability of the latter’s models on Azure. Additionally, OpenAI’s deals with publishers may ease the data licensing headache, but it still has to deal with The New York Times and a dozen other writers for the use of training data, copyright infringement, etc. However, experts believe Microsoft’s use of training data, whether public or non-public, is a concern. On being asked if Microsoft’s use of non-public data proves to be an Achilles heel, Kulkarni said, “Because this is a fast-moving, nuanced topic, I can’t speak to any one company’s exposure. However,” he adds, “Microsoft has a multi-decade track record of savvily hedging its bets. One business unit’s exposure is another business unit’s opportunity. I think it’s far too early for anyone to make pronouncements about Achilles Heels.” Moreover, “It will be up to regulators and politicians to decide what data an individual AI can use,” Grimes said. Until then, “Microsoft’s AIs will use public data when it can and private data when it can. It will have the benefits of both.” “We’re far too early in the life cycle of this technology for any one company to be in a position of ‘too big to fail.’ The rate of innovation is just too high right now. That being said, what Microsoft has done to put itself in its current leadership position is invest more and earlier than anyone else. It’s remarkable to see how skillfully they’ve positioned themselves for leadership in this market.” – Anand Kulkarni, founder and CEO of Crowdbotics. “Microsoft isn’t too big to fail with AI, but with this technology, they seem well prepared to use and profit. I wouldn’t bet against Microsoft in its use of AI.” – Roger Grimes, data-driven defense evangelist at KnowBe4. How will Microsoft’s AI presence look a decade from now? Share with us on LinkedInOpens a new window , XOpens a new window , or FacebookOpens a new window . We’d love to hear from you! Image source: Shutterstock  Asst. Editor, Spiceworks Ziff Davis © Copyright 2006 - 2024 Spiceworks Inc. "
}