{
    "title": "Insider Selling: Cryoport, Inc. (NASDAQ:CYRX) CFO Sells 1,035 Shares of \nStock",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-cyrx-insider-buying-and-selling-2024-03-19/",
    "text": "Cryoport, Inc. (NASDAQ:CYRX - Get Free Report) CFO Robert Stefanovich sold 1,035 shares of the stock in a transaction on Friday, March 15th. The shares were sold at an average price of $15.43, for a total value of $15,970.05. Following the sale, the chief financial officer now owns 123,662 shares in the company, valued at approximately $1,908,104.66. The transaction was disclosed in a filing with the SEC, which is accessible through the SEC website. Robert Stefanovich also recently made the following trade(s): On Monday, March 11th, Robert Stefanovich sold 1,119 shares of Cryoport stock. The stock was sold at an average price of $16.35, for a total value of $18,295.65. Cryoport Stock Up 10.1 % CYRX stock traded up $1.52 during trading on Tuesday, reaching $16.54. 935,738 shares of the company traded hands, compared to its average volume of 439,652. Cryoport, Inc. has a 12 month low of $9.00 and a 12 month high of $24.30. The business has a 50 day simple moving average of $15.62 and a 200 day simple moving average of $14.21. The company has a market capitalization of $810.13 million, a price-to-earnings ratio of -7.45 and a beta of 1.61. The company has a debt-to-equity ratio of 0.82, a quick ratio of 11.16 and a current ratio of 11.73. Institutional Investors Weigh In On Cryoport A number of institutional investors have recently added to or reduced their stakes in CYRX. Nordea Investment Management AB purchased a new stake in Cryoport in the third quarter valued at about $1,153,000. Connor Clark & Lunn Investment Management Ltd. raised its stake in Cryoport by 285.9% in the third quarter. Connor Clark & Lunn Investment Management Ltd. now owns 77,409 shares of the company's stock valued at $1,061,000 after buying an additional 57,348 shares during the last quarter. Assenagon Asset Management S.A. purchased a new stake in Cryoport in the third quarter valued at about $3,250,000. WCM Investment Management LLC raised its stake in Cryoport by 2.0% in the third quarter. WCM Investment Management LLC now owns 299,984 shares of the company's stock valued at $4,113,000 after buying an additional 5,839 shares during the last quarter. Finally, Bank of Montreal Can purchased a new stake in Cryoport in the second quarter valued at about $282,000. Institutional investors own 92.90% of the company's stock. Analyst Ratings Changes A number of analysts have weighed in on the company. UBS Group increased their target price on Cryoport from $14.50 to $17.00 and gave the stock a \"neutral\" rating in a research note on Friday. Stephens reiterated an \"equal weight\" rating and issued a $17.00 target price on shares of Cryoport in a research note on Wednesday, March 13th. Finally, Needham & Company LLC reduced their target price on Cryoport from $19.00 to $18.00 and set a \"buy\" rating on the stock in a research note on Wednesday, March 13th. Five equities research analysts have rated the stock with a hold rating and one has issued a buy rating to the company's stock. According to MarketBeat, the stock presently has an average rating of \"Hold\" and a consensus target price of $18.29. View Our Latest Stock Report on CryoportAbout Cryoport (Get Free Report) Cryoport, Inc provides temperature-controlled supply chain solutions in biopharma/pharma, animal health, and human reproductive medicine markets in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments: Global Logistics Solutions and Global Bioservices. The company offers Cryoport Express Shippers; Cryoport ELITE -80°C Gene Therapy Shipper; Cryoport ELITE Cryosphere Shipper; Cryoport consulting services, including physical, thermal, and shipping qualifications of shipping systems and/or packaging to developing custom packaging solutions; and Cryoport bioservices, such as controlled temperature storage, fulfilment, kit production, secondary packaging, labelling of therapeutic products, and GMP raw materials storage services.Further ReadingFive stocks we like better than CryoportUtilities Stocks Explained – How and Why to Invest in UtilitiesGrowing Twice as Fast as Tesla, XPeng is a BuyWhat Are Trending Stocks? Trending Stocks Explained4 Stocks Building Long-Term Value for Shareholders Earnings Per Share Calculator: How to Calculate EPSFedEx Stock Has Analysts Upgrading in Bulk, a Sudden DiscountThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Trump’s “Tax Free” Retirement Strategy  (From Gold Safe Exchange) (Ad)Should you invest $1,000 in Cryoport right now?Before you consider Cryoport, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Cryoport wasn't on the list.While Cryoport currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 7 Stocks to Buy And Hold ForeverClick the link below and we'll send you MarketBeat's list of seven stocks and why their long-term outlooks are very promising. Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Cryoport, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Cryoport wasn't on the list. While Cryoport currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of seven stocks and why their long-term outlooks are very promising. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}