{
    "title": "2 No-Brainer Stocks I'd Add to the \"Magnificent Seven\"",
    "date": "3/13/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT/pressreleases/24758464/2-no-brainer-stocks-id-add-to-the-magnificent-seven/",
    "text": "It's difficult to find a group of companies that have performed better than the \"Magnificent Seven\" in the past decade. This clique includes the following market leaders: Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. These companies have achieved outsize returns partly due to being pioneers, leaders, and innovators in their respective industries and delivering consistently strong financial results. Though the Magnificent Seven stocks are a rare breed, some other corporations on the market would fit right into the fold and are most certainly worth investing in. If I had to create a \"Magnificent Nine,\" here are two stocks that would be prime candidates to join the existing seven: Eli Lilly(NYSE: LLY) and Netflix(NASDAQ: NFLX).  GOOGL Total Return Level data by YCharts Eli Lilly would be right at home among the Magnificent Seven in terms of stock market performance. Only Nvidia has performed better than the drugmaker in the past decade. The company has achieved strong returns largely due to its dominance in the market for diabetes drugs. For much of the past 10 years, Trulicity, a medicine for type 2 diabetes first approved in the U.S. in 2014, was Eli Lilly's most important growth driver. Now, Eli Lilly has a new crown jewel: the clinical compound known as tirzepatide, marketed as either Mounjaro in treating diabetes or Zepbound in obesity. Tirzepatide arrived on the market in 2022, and sales have been growing rapidly. It generated more than $5 billion in revenue in 2023, its first full year on the market. Some say it could hit annual peak sales of $25 billion on the back of a fast-growing anti-obesity drug market. Eli Lilly has been a leader in diabetes care for decades where arguably the only drugmaker that has been able to keep up is Novo Nordisk. That's one more reason Eli Lilly belongs in a \"Magnificent Nine.\" Turning to the company's financial results, Eli Lilly's revenue and earnings have been excellent -- and that won't likely stop anytime soon. Analysts predict that, on average, Eli Lilly's earnings per share (EPS) will increase by 50.7% per year for the next five years.  LLY Revenue (Quarterly) data by YCharts Tirzepatide will play an important role here, but Eli Lilly's lineup is much broader than this one medicine. The drugmaker earned approval for some brand-new drugs last year, including cancer therapy Jaypirca and ulcerative colitis medicine Omvoh. This year, it could launch donanemab, a medicine for Alzheimer's disease. In short, the company's overall prospects are rock-solid. Then, there is Eli Lilly's excellent dividend record. Over the past 10 years, the pharmaceutical giant has increased its payouts by 165%, which rivals Microsoft, the best dividend stock among the Magnificent Seven. That's just one more reason why Eli Lilly is a table-pounding buy. Like several members of the Magnificent Seven, Netflix faced severe headwinds between 2021 and 2022. And like those same members of the Magnificent Seven, Netflix has bounced over the past year. The streaming specialist's stock performance in the past decade would be more or less middle of the pack within this group. True, a lot has changed in 10 years for Netflix. It faces more competition than ever, with brand-new streaming platforms popping up left and right. However, having been the pioneer, Netflix remains one of the undisputed leaders in streaming. As of December, Netflix accounted for 8% of television viewing time in the U.S. Only Alphabet's YouTube did better in the streaming world at 9%, and that's not quite an apples-to-apples comparison. YouTube for the most part features independently created videos, not the kinds of shows and movies people go on Netflix to watch. Regardless, Netflix is undoubtedly near the top of the industry, where plenty of white space remains. In the U.S., one of the most penetrated markets, streaming made up just 36% of total television viewing time. That should keep increasing while other regions play catch-up. How long will the shift take? It might be a while. In the meantime, Netflix should continue delivering excellent financial results, just like it has in the past.  NFLX Revenue (Quarterly) data by YCharts Here's one reason why: Netflix arguably benefits from the network effect. It uses the data it collects from viewers and their habits to craft its content creation strategy. The more viewers there are on its platforms, the more valuable it becomes. That's a big reason why Netflix's productions have been massively successful, whether in viewership or awards. Netflix's master plan will continue working even with more competition, as the company has shown in recent years. The stock should still massively reward shareholders over the long run, making it a great Magnificent Nine candidate. Should you invest $1,000 in Eli Lilly right now? Before you buy stock in Eli Lilly, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Eli Lilly wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Prosper Junior Bakiny has positions in Amazon and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Netflix, Nvidia, and Tesla. The Motley Fool recommends Novo Nordisk and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}