{
    "title": null,
    "date": "3/4/2024",
    "url": "https://windowsreport.com/the-latest-edge-update-is-no-longer-available-as-microsoft-pulled-it-out/",
    "text": "Follow us Share this article Latest news The current Edge version is 122.0.2365.66. 2 min. read Published on March 4, 2024 published on \n\nMarch 4, 2024 Share this article Read the affiliate disclosure page to find out how can you help Windows Report effortlessly and without spending any money. Read more Microsoft released the Edge 122.0.2365.63 version to its browser, but following its release, multiple users reported that the update caused the browser to crash when accessing websites. Some users quickly found a solution to the issue, and it seems disabling a security option within Edge would make it work again properly. However, not many users managed to actually try to implement this solution, because the Redmond-based tech giant quickly pulled the Edge 122.0.2365.63 version out, and the stable version went back to the 122.0.2365.59 version. On Friday afternoon, however, Microsoft released the 122.0.2365.66, which effectively fixes the Out of Memory issue seen in the 122.0.2365.63 version. The issue affected both Windows 11, and Windows 10 devices, and Reddit users have been complaining about it since early February. The strange thing is that all of these users had well-equipped systems so the lack of RAM power, or CPU was not the problem. However, according to the one that found a fix for the problem, the latest updates to Edge somehow bugged its Enhanced Web Protection feature, and the updates caused it to run into conflicts with the browser. The solution was found by an Edge user, Nails89, and it was posted on the official Microsoft Edge forums, explaining: Hi, I don’t know if this will help but the security of the browser is causing this issue with the new update…To fix this issue, Go to “Settings>Privacy, search and services,” scroll down to the “Security” section and then turn off “Enhance your security on the web.” setting. This is what helped me, hope it helps you too… Cheers! Disabling the option would fix the issue entirely, but it would leave users at risk, as the Enhance your security on the web capability is recommended to be enabled when browsing the Internet on Microsoft Edge. However, the latest update entirely fixes the bug without having to turn this option off. More about the topics: microsoft, microsoft edge Flavius Floare Tech Journalist Flavius is a writer and a media content producer with a particular interest in technology, gaming, media, film and storytelling.\nHe's always curious and ready to take on everything new in the tech world, covering Microsoft's products on a daily basis. The passion for gaming and hardware feeds his journalistic approach, making him a great researcher and news writer that's always ready to bring you the bleeding edge! Flavius Floare Tech Journalist Flavius is a writer and a media content producer with a particular interest in technology, gaming, media, film and storytelling. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}