{
    "title": "Microsoft Bing is set to step down amid AI push",
    "date": "3/26/2024",
    "url": "https://www.lankatimes.com/microsoft-bing-is-set-to-step-down-amid-ai-push/",
    "text": "Complete Lanka News World president Microsoft Bing    The search engine and advertising business are said to be leaving this role. Mikhail Parakhin    Departure – Topic of Monday (March 25) Bloomberg News a report    – It comes a week after the tech giant named a co-founder of DeepMind Mustafa Suleiman    To head Microsoft's consumer artificial intelligence (AI) efforts, to whom Parakhin reports. Parakhin, who previously served as CEO of advertising and web services, will report to Chief Technology Officer Kevin Scott as he seeks a new role, Microsoft told Bloomberg.  However, the report notes that it is not clear whether Parakhin will exit the company or take up a new position within Microsoft. Microsoft Advertise recruitment    Solomon last week.  He was heading a startup called Inflection, where most of that company's employees moved with him.  Inflection developed the Pi chatbot, which is designed to mimic the human concept of emotions and act — in the company's words — as a “gentle, supportive companion.” The Bloomberg report said that this move put the spotlight on Microsoft's CEO Satya Nadella    He is impatient with the company's artificial intelligence project, citing two sources familiar with his thinking. Last year, the company integrated artificial intelligence into projects such as Windows, Office and search engine Bing, and released digital assistants as part of its Copilot brand.  However, Bing still lags behind Google in the search space, while other products are still a work in progress, the report said. As covered here last week, Microsoft is Among the “giants”    In the race for artificial intelligence, after investing $13 billion in it OpenAInewly With a value of 80 billion dollars. “Microsoft's massive investment is one reason why OpenAI is now seen as so valuable,” PYMNTS wrote.  “In addition to OpenAI, Microsoft is investing $2.1 billion in another AI company, Mistral, based in France.” Elsewhere in the AI ​​space, PYMNTS recently examined a proposed deal between two other tech giants — Apple and Google — that would see the latter Integrate Gemini AI    Engine in iPhone. “Apple's largest moat, the App Store, Apple Services, and its nearly 2 billion loyal, affluent customers, will lead them to invest in AI for developer tools to develop apps, app content, and the category that… It has eluded Apple forever“Search,” Michael Jaconi, CEO of AI marketing technology company buttonHe said in an interview with PYMNTS. “Apple's $18 billion paycheck from Google is great, but no one is monetizing AI search today, so why not have that future when so much of the current search market already starts with you.” “Freelance web ninja. Wannabe communicator. Amateur tv aficionado. Twitter practitioner. Extreme music evangelist. Internet fanatic.” Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ "
}