{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.caledonianrecord.com/news/national/microsoft-engineer-sounds-alarm-on-ai-image-generator-to-us-officials-and-companys-board/article_cea60ac4-f15b-5a95-9441-5b38fe5ff740.html",
    "text": "Mostly cloudy early, then sunshine for the afternoon. High 42F. Winds WNW at 10 to 20 mph.. Partly cloudy early followed by cloudy skies overnight. Low 28F. Winds W at 5 to 10 mph. Updated: March 30, 2024 @ 8:30 am   FILE - A Copilot page showing the incorporation of AI technology is shown in London, Tuesday, Feb. 13, 2024. A Microsoft engineer is sounding an alarm Wednesday, March 6, 2024, about offensive and harmful imagery he says is too easily made by the company’s artificial intelligence image-generator tool. A Microsoft engineer is sounding alarms about offensive and harmful imagery he says is too easily made by the company's artificial intelligence image-generator tool, sending letters on Wednesday to U.S. regulators and the tech giant's board of directors urging them to take action. Shane Jones told The Associated Press that he considers himself a whistleblower and that he also met last month with U.S. Senate staffers to share his concerns. Javascript is required for you to be able to read premium content. Please enable it in your browser settings. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.      Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Success! An email has been sent to  with a link to confirm list signup. Error! There was an error processing your request. Today's top headlines from the Caledonian-Record. Breaking News alerts from The Caledonian-Record news team. The latest business news from the Northeast Kingdom, North Country and beyond. Recent Advertisements from our partners. Stories we think you'll like - Editor's Picks from The Caledonian-Record The most read stories of the week from www.caledonianrecord.com. A subscription opens up access to all our online content, including: our interactive E-Edition, a full archive of modern stories, exclusive and expanded online offerings, photo galleries from Caledonian-Record journalists, video reports from our media partners, extensive international, national and regional reporting by the Associated Press, and a wide variety of feature content. We're always interested in hearing about news in our community. Let us know what's going on! Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Account processing issue - the email address may already exist Today's top headlines from the Caledonian-Record. Breaking News alerts from The Caledonian-Record news team. The latest business news from the Northeast Kingdom, North Country and beyond. Recent Advertisements from our partners.  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}