{
    "title": "Stability AI founder's jokes about Satya Nadella's influence have a dark \ntruth to them",
    "date": "3/25/2024",
    "url": "https://ca.news.yahoo.com/stability-ai-founders-jokes-satya-115713823.html",
    "text": "Stability AI's Emad Mostaque stepped down as CEO to \"pursue decentralized AI.\" The founder of the Stability Diffusion maker seemed to joke on X that he was set to join Microsoft. His quip that Satya Nadella is \"above, below and around\" AI firms expose a reality of the sector. They say an element of truth lies behind every joke — and Emad Mostaque's recent wisecrack about Satya Nadella inadvertently underlines a reality of the AI sector. The Stability AI founder made light of his departure last week as CEO by kidding that he'd succumbed to the power of Microsoft. He posted a photo on X on Tuesday in what appeared to be a video call with Satya Nadella. He wrote: \"He is above, below and around us. In Satya we trust (because at this rate we'll kinda have to)\". pic.twitter.com/bAoPCMil3w — Emad acc/acc (@EMostaque) March 26, 2024 Mostaque later said that he was \"just messing\" and that he's doing his \"own thing(s)\" after leaving the creator of text-to-image generator Stable Diffusion, which he previously said was to \"pursue decentralized AI.\" But Mostaque's quip that Nadella has AI firms surrounded has some truth to it. After all Microsoft recently hired Mustafa Suleyman and some of the Inflection AI team, which some regard as a strategic consolidation of top AI talent. Mostaque's comments that Nadella is \"above, below and around us\" is a play on the Microsoft CEO's remarks about OpenAI in a November interview, which recently resurfaced in Elon Musk's lawsuit against Sam Altman and the ChatGPT maker. The comments took on new meaning last week as Nadella appointed Suleyman as the CEO of Microsoft AI. Mostaque, the British-Bangladeshi founder of the $1 billion startup, also praised Nadella as an \"amazing leader\" and said he was the greatest of all time (GOAT) by posting a goat emoji. He added: \"Microsoft is also one of the leading open source companies globally & there are great teams in Microsoft Research like the wizard & phi teams pumping out great models.\" Microsoft is playing a key role in shaping the future of the industry through its partnerships with OpenAI and French firm Mistral AI as Big Tech players vie for dominance in the AI race. The transfer of expertise to Microsoft through Nadella's hiring of Inflection's key personnel could be described as a \"quiet takeover\" and shows that AI power is consolidating. Microsoft appears to have laid out a new blueprint for Big Tech to avoid the scrutiny of antitrust regulators. Or as Gavin Baker, managing partner of investment firm Atreides Management, put it on X: \"If the Microsoft/Inflection deal stands, then this is the roadmap for every large tech company to make acquisitions.\" Microsoft didn't immediately respond to a request for comment from Business Insider. Read the original article on Business Insider Welcome to Startups WeeklySign up here to get it in your inbox every Friday.  There's not that much news from me this week, but I've been doing a ton of prep for TechCrunch Early Stage taking place in Boston on April 25.  Stability AI bids adieu to its founder and chief executive, Emad Mostaque, who's decided to chase the decentralized AI dream, leaving the unicorn startup without a permanent CEO. AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada.  Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call. Ping Ping Ping A Boston Dynamics SPOT robot that was sent inside a home by Massachusetts state police was shot three times by a person barricaded inside. As the Associated Press reports, the robotics company believes it's the first time one of its robotic dogs has been shot. The remotely-controlled quadruped was deployed earlier this […] While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become.  Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said. Spot, a robotic dog created by tech company Boston Dynamics, is being used across the nation to help assist law enforcement in the field. (Bloomberg) -- Huawei Technologies Co. sustained its run of strong quarterly profit growth, building on the resurgence of its consumer business against Apple Inc.’s iPhone and the rise of its cloud division against incumbent Alibaba Group Holding Ltd.Most Read from BloombergFed’s Preferred Inflation Metric Cools While Spending ReboundsBank of Russia Sees No Alternative to Yuan for Its ReservesPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the  (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergFed’s Preferred Inflation Metric Cools While Spending ReboundsBank of Russia Sees No Alternative to Yuan for Its ReservesPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of  The company is among the fastest-growing cybersecurity players based on my peer analysis Caution is needed even with this famous tech behemoth and its fast-growing services business This food habit is linked to a specific type of dementia.  \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Trump's former national security adviser shut down a comparison between the ex-president and Julius Caesar.  Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Seven reportedly cost $20 million "
}