{
    "title": "Microsoft appoints Pavan Davuluri as Windows and Surface head",
    "date": "3/29/2024",
    "url": "https://www.fonearena.com/blog/420458/microsoft-pavan-davuluri-windows-surface-head.html",
    "text": "Fone Arena The Mobile Blog  Microsoft has undergone a major organizational change several months after the departure of Panos Panay, former Chief Product Officer of Windows and Surface devices. Now, the company has integrated its Windows Experiences and Windows + Devices teams as a core part of the Experiences + Devices (E+D) division.  IIT Madras alumni Pavan Davuluri, who has been with Microsoft for more than 23 years, will lead the team and report to Rajesh Jha, Executive Vice President of Experiences & Devices at Microsoft. This team will work closely with Microsoft’s newly formed AI team led by recently hired Mustafa Suleyman, the co-founder of Google DeepMind. The company hopes that this change will bring a holistic approach to building silicon, systems, experiences, and devices that span Windows clients and the cloud for this AI era. Pavan has extensive experience with engineering Surface devices and is expected to bring a new dimension to the Surface line-up with new AI experiences. Lately, Microsoft has been investing heavily in AI and working closely with silicon manufacturers to boost AI on PCs by offering AI-integrated experiences through Windows and its Office products. These internal changes should boost the company’s current efforts. In an internal memo, Rajesh Jha said: I want to share an update on the Windows and Web Experiences (WWE) team following last week’s announcement and the creation of the Microsoft AI organization. Mikhail Parakhin has decided to explore new roles. Satya and I are grateful for Mikhail’s contributions and leadership and want to thank him for all he has done to help Microsoft lead in the new AI wave. He will report to Kevin Scott while supporting the WWE transition. As part of this change, we are bringing together the Windows Experiences and Windows + Devices teams as a core part of the Experiences + Devices (E+D) division. This will enable us to take a holistic approach to building silicon, systems, experiences, and devices that span Windows client and cloud for this AI era. Pavan Davuluri will lead this team and continue to report to me. Shilpa Ranganathan and Jeff Johnson and their teams will report directly to Pavan. The Windows team will continue to work closely with the Microsoft AI team on AI, silicon, and experiences. The Web Experiences team will report into Mustafa in the new Microsoft AI organization. We are excited for this team to help Microsoft AI achieve its bold ambition to build world-class consumer AI products. And I very much look forward to closely partnering with Mustafa and the team as we bring our AI products, including Copilot, to the breadth of our E+D products and services. "
}