{
    "title": "Nasdaq 100 closes on record-high propelled by tech",
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/video/nasdaq-100-closes-record-high-222837109.html",
    "text": "The Nasdaq 100 (^NDX) hit a record high on Thursday as stocks rebounded, led by notable tech performances like Microsoft (MSFT) and NVIDIA (NVDA). Yahoo Finance Market Reporter Jared Blikre takes a closer look at the stock and sector actions. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim JOSH LIPTON: Stocks turning things around, finishing the day higher thanks to big tech. Jared Blikre is here with a look at today's comeback. Jared. JARED BLIKRE: Thought I'd start with the record highs, and we've got a lot here. Microsoft up over 1%. Nvidia to a record closing high. That's up 1.88%. Visa, whether you classify it as fin or tech or fintech, nevertheless, that's at a record high, up half a percent. And just really a broad swath of industries represented from Costco to MasterCard. We also see T-Mobile, so telecom. Looking at staples, financials, chip stocks, a pretty broad swath here. Even O'Reilly Auto Parts up about 2.36%. And let's take a look at the sector action. I was talking in the last hour about the dominance of tech, not only last year but this year, and guess what? Today it is up about 2%, and it's followed by industrials and communication services. Now, industrials a little bit newer to the mix. We saw it really come into its own in November, December of last year. But the bottom line is all three of these sectors are outperforming, and what's lagging is telling because those are the defensive sectors. So that's actually bullish. Take a look at utilities down 1%. Real estate, that's down 2/3 of a percent. Staples, even energy slightly defensive. Health care arguably defensive. All of those in the red today. And let's just cycle through some heat maps to see where we stand at the end of the day. So here's the NASDAQ 100. Apple you're going to notice here. Apple is not on top anymore. It used to sit there for years and years. It is now second to Microsoft. So Apple up 3%. Nice to see those gains but still second to Microsoft in terms of market cap. Alphabet and Nvidia and Amazon each up more than 1%. Meta up more than 2%. But Tesla-- Tesla has not been able to catch a break this year, down 1.7%. That's down about 15%, 16% for the year. And let's take a look at energy. This is one of the sectors that was lagging. You can see kind of a mixed board here. The American majors in the red while some of the European majors in the green. Just for example, Exxon down 2/10 of a percent. Shell up half a percent. But when we take a look at China, that's been one of the real sore spots over the last month. Just talking with the prior guest about potential investments in China. Not looking the best today. We've got Pinduoduo down just slightly but Alibaba down another 1%. And if we take a look at the year-to-date losses, that's when we really see some dark red, guys. So all in all, tech doing well in the US but not necessarily in China. Related Quotes "
}