{
    "title": null,
    "date": "1/5/2024",
    "url": "https://markets.businessinsider.com/news/stocks/apple-microsoft-most-valuable-companies-stock-market-analysis-big-tech-2024-1",
    "text": "       Microsoft is just $100 billion in market capitalization away from stealing Apple's crown as America's most valuable company for the first time in over two years. The Redmond, WA-based tech giant was worth $2.73 trillion at Thursday's closing bell, according to data from Refinitiv. In comparison, Apple was valued at $2.83 trillion. Neither stock has enjoyed a stellar start to 2024, but Apple has had to endure a downgrade by UK bank Barclays on Tuesday that wiped out more than $100 billion in market cap in a single day. Analysts trimmed their price target for Apple shares from $161 to $160 and warned about sluggish hardware sales, including signs of \"lackluster\" demand for the iPhone 15 in China. While the Tim Cook-led behemoth has kicked off 2024 with a 6% skid, Microsoft has dropped 2%. Investors' belief that the Federal Reserve might take more time than previously expected to start slashing interest rates has weighed on it and other \"Magnificent Seven\" tech stocks. The gap in valuation between the two companies is now the narrowest it's been since November 21, 2021, according to data from FactSet. Microsoft held the title of the US's most valuable company for a brief period between October and November that year. Several analysts have flagged a potential global economic slowdown as a threat to Apple, with consumers likely to spend less on big-ticket items like iPhones and Macs. It's also facing increased competition in China from Huawei, which launched its Mate 60 Pro smartphone there with wild success in August. \"Once again Chinese competition is a factor, but as high interest rates do the job they were designed to do and consumers continue to think carefully about big-ticket purchases, tech like iPhones are the ultimate nice-to-have that many potential customers may end up putting off buying until their budgets are less constrained,\" AJ Bell's head of financial analysis, Danni Hewson, said Tuesday. Meanwhile, Wall Street has tended to take a bullish stance on Microsoft due to its close ties with the ChatGPT maker OpenAI and strong sales growth for its Azure cloud-computing division, which also helped it to outperform its rival Alphabet in 2023. Read next Indices Commodities Currencies Stocks Jump to "
}