{
    "title": "Earnings Preview: What To Expect From Microsoft Results",
    "date": "1/30/2024",
    "url": "https://www.forbes.com/sites/adamsarhan/2024/01/30/earnings-preview-what-to-expect-from-microsoft-results/",
    "text": "NEW YORK, NY - MARCH 13: A signage of Microsoft is seen on March 13, 2020 in New York City. ... [+] Co-founder and former CEO of Microsoft Bill Gates steps down from Microsoft board to spend more time on the Bill and Melinda Gates Foundation. (Photo by Jeenah Moon/Getty Images) Microsoft\nMSFT\n Inc. is scheduled to report earnings after Tuesday’s close. The stock just hit a record high of $413.05/share and is currently trading near that level. The stock is prone to big moves after reporting earnings and can easily gap up if the numbers are strong. Conversely, if the numbers disappoint, the stock can easily gap down. To help you prepare, here is what the Street is expecting: The company is expected to report a gain of $2.76/share on $61.03 billion in revenue. Meanwhile, the so-called Whisper number is a gain of $2.91/share. The Whisper number is the Street's unofficial view on earnings. Click on the chart to join MarketSmith Microsoft has benefited greatly from the recent boom in artificial intelligence and other tech friendly trends. Earnings have grown nicely in the last several years. Meanwhile, the return on equity (ROE) has been near 40% in each of the past four quarters. That is very impressive considering how large the company is. Meanwhile, the price to earnings (P/E) ratio is 39 which is higher than the S&P 500. Technically, the stock is in a strong uptrend and just hit a fresh all time high. In the short-term the stock is extended and due to pullback. Stepping back, the stock hit a low in November 2022 $213.43 and is up over 90% since then. That is a massive rally and this can easily become a case of buy the rumor and sell the news. Meaning, the stock had a big run ahead of the news of a strong earnings and then sells off after the news (strong earnings) are released. That doesn’t have to happen but something that can easily happen if the stock falls after reporting earnings. Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.  From where I sit, the most important trait I look for during earnings season is how the market and a specific company reacts to the news. Remember, always keep your losses small and never argue with the tape.     Disclaimer: The stock has been featured in my FindLeadingStocks.com report.  "
}