{
    "title": "Microsoft Mesh is generally available in Microsoft Teams",
    "date": "1/24/2024",
    "url": "https://www.microsoft.com/en-us/microsoft-365/blog/2024/01/24/bring-virtual-connections-to-life-with-microsoft-mesh-now-generally-available-in-microsoft-teams/",
    "text": "The way we work has changed, but the secret to a thriving workplace has not. Deep human connections are required to increase engagement, stimulate performance, and retain talent. Organizations foster connection through key moments like new employee onboarding, town halls, brainstorming sessions, team socials, and networking events. However, when these activities are hosted remotely, they are less effective at building personal connections that people and organizations need to thrive. According to Microsoft’s Work Trend Index report, 43 percent of leaders say relationship building is the greatest challenge in remote and hybrid work.1 To support hybrid work and geographically distributed organizations, we created Microsoft Mesh. Mesh powers 3D immersive experiences using next-generation technology that help virtual connections feel more like face-to-face interactions. Mesh is available on PC and Meta Quest VR devices.2 Today, customers like Takeda, Accenture, bp, and Mercy Ships are already benefiting from Mesh. Connect like never before with Microsoft Mesh, a new 3D immersive experience. Starting today, enjoy the benefits of deeper connection from right within Microsoft Teams, the smart place to work for hundreds of millions of people. Mesh in Teams elevates engagement in Teams meetings with ready-made 3D immersive spaces crafted to suit your needs, whether it’s a team social gathering, brainstorming session, or a round-table discussion. Design an avatar to represent yourself and include everyone in the conversation. Host multiple, simultaneous small-group discussions with spatial audio, which enables productive side conversations during brainstorming, like in the physical world. This lessens the cognitive load and boosts the effectiveness of discussions. Use the same Teams features you love from within a 3D space, like accessing shared content for collaboration, communicating with Teams chat, and using live reactions to express yourself. Our customers are realizing the value of Mesh in Teams already. Takeda, a global pharmaceutical company, celebrated a milestone with their global team in a waterfront lake house. Mesh in Teams offered an exciting and sustainable way for everyone in their team to take part in a special team success. Leo Barella, Takeda’s Chief Technology Officer, explains that “the world of work continues to evolve at a rapid pace, but the importance of human connection has never gone away. Lunchtime conversations, hallway catch-ups, coffee chats—they often hold the key to both workplace success and employee happiness. Mesh for Teams has proven a game-changer for us; our hybrid meetings are more collaborative and immersive, and also a lot more fun. We are a people-first organization, and we want every employee to feel a true sense of belonging and togetherness—from day one, wherever they are in the world. Mesh is helping us achieve that.” Getting started is easy. When you’re in a meeting in new Teams from your PC, simply select the “immersive space (3D)” option from the View menu. Find out more about Mesh in Teams and get started. Organizations can also host larger events with custom, immersive experiences tailored to their needs with Microsoft Mesh. With the no-code editor, start with a set of ready-made immersive spaces and customize the space by adding visual elements like banners featuring your organization’s logo, videos showcasing your product, presentation content, and more. Effortlessly orchestrate these visual elements so they fit right into the flow of your event with our easy-to-use event organizer tools. Take it a step further and harness the power of Unity with the Mesh toolkit to create your own custom interactive experiences, including venues for all hands meetings, onboarding, simulations, or training. With the no-code editor and Mesh toolkit to craft custom experiences, the opportunities are endless. Learn more about enabling Mesh for your organization and see the Mesh toolkit and our developer journey. At the forefront of innovative workspaces are our customers, including Takeda, Accenture, bp, and Mercy Ships. While each organization has built distinctly different spaces for onboarding, training, hosting large events, and running simulations, the benefits they’ve accrued are similar. Immersive experiences in Mesh create highly engaged, productive distributed teams while also reducing travel and real estate costs. Before Takeda scaled these benefits of authentic connection to everyday meetings and smaller team interactions like the team celebration discussed earlier, they built several specialized spaces to serve as awe-inspiring introductions to this new technology. Their journey began when they sought a cost-effective way to help their geo-diverse workforce connect and further their common cultural understanding. Takeda built a custom solution designed to cultivate engagement, bolster commitment to their corporate philosophy, and accelerate product innovation: the Hirameki Garden. The garden, created in Microsoft Mesh, serves as a virtual venue for large, company-wide events like town halls and all hands meetings. Employees gather from all over the world to celebrate major organizational milestones and learn directly from their top leaders, in a space that was specifically designed to represent their corporate values. Leo Barella shares that “the future of work is no longer simply an abstract concept—it’s already here and it’s transforming the employee experience. Microsoft Mesh empowers us to create custom virtual experiences that perfectly capture the spaces that represent our operating model, corporate philosophy, and values. Employees all over the world—regardless of their location or role type – can participate in a virtual world that brings the company to life in an engaging and meaningful way and helps them feel an authentic sense of connection. When it comes to the potential use cases and benefits, we’re only really scratching the tip of the iceberg.” Takeda has crafted several other virtual spaces in addition to the Hirameki Garden, including a gallery showcasing patient stories and their history of innovation in their industry. This space grounds employees in the organization’s purpose and promotes genuine empathy for their customers. Accenture, one of the largest consulting firms in the world, needed to scale their onboarding program to accommodate their growing global workforce in a cost-effective and sustainable way. In 2021, they partnered with Microsoft to design a solution that maintains authentic connection, promotes cultural understanding, and encourages unity across their organization. To date, Accenture has welcomed more than 300,000 new hires from around the world at One Accenture Park, a virtual campus created in Microsoft Mesh. Each new-hire cohort is invited to ride the virtual monorail to different educational exhibits, expert talks in auditoriums, and events in gathering spaces to meet their colleagues and learn about key skills to be successful in their new roles. Ellyn Shook, Accenture’s Chief Leadership & Human Resources Officer, explains that their re-imagined onboarding experience “enables new joiners to discover our culture, core values and how Accenture drives value for our clients, people, and communities. All in a collaborative, immersive way that transcends space and place. This, coupled with key in-person experiences, deepens human connection like never before. Bp, a global energy company, was interested in scaling specialized physical meeting spaces, called Highly Immersive Visualization Environments (HIVEs), that allow experts to comprehend and collaborate on complex issues in a way that wouldn’t be possible with traditional tools. A physical space of this caliber requires significant financial investment to build and maintain, and travel investment to accommodate in-person expert participation. So, bp partnered with Microsoft to design and pilot a cutting-edge, collaborative environment using Microsoft Mesh to connect their global teams more effectively and safely from anywhere in the world via a lower cost and lower carbon digital solution. Soon, experts will be able to come together virtually in HIVEs to monitor wind turbines in a remote location or troubleshoot equipment repairs using digital twins without ever leaving their office. Roger Rohatgi, Vice President and Global Head of Design for bp, shares that “highly immersive visualization environments open the path to a more digital and collaborative future for bp. By partnering with Microsoft Mesh, we are able to explore how to use advanced technology for faster, more informed, and safer decision making as we pursue our ambition to become an integrated energy company.” Mercy Ships, an international charity that utilizes hospital ships to provide free surgical care and education to in-need communities in Africa, is comprised of predominantly volunteer-led crews with a turnover rate as high as 350%. And their 3,000-person crew is physically distributed, representing more than 60 nations. These circumstances called for more efficient training practices that remained effective and accessible to everyone, meaning they couldn’t require any special equipment beyond a PC and a network connection. With the support of Dell Technologies and Link To VR, Mercy Ships built the Global Mercy, a digital replica of one of their hospital ships, in Microsoft Mesh. This will allow their organization to educate volunteers, staff, and prospective donors on the culture and operations of the organization before ever boarding the physical ship. Remote access provided over PC or VR headset offers a truly immersive experience while significantly reducing travel costs and time commitments. More efficient training practices means more time spent maximizing the healthcare services provided to these communities in need. Dave Shwadlenak, Vice President of Information Services at Mercy Ships, adds that their organization is “excited by the prospect of using the Global Mercy digital twin in Mesh. It allows our volunteers, who travel to our vessels from around the world, to experience our ships virtually before they physically arrive, which enhances their onboarding experience. This technology also offers a virtual experience to our donors who might not otherwise be able to travel to our ships, allowing them to see the tremendous work on our vessels and to connect with our mission in a more personal way. As you can see, we’re very pleased because it provides another means by which we can share how Mercy Ships is bringing hope and healing.” These are just a few of the customers transforming work with Microsoft Mesh. We are excited to learn how your organization leverages this new technology. Mesh experiences are generally available today. Thank you for being part of the journey with us! 1Hybrid Work Is Just Work. Are We Doing It Wrong? Microsoft Work Trend Index. September 22, 2022. 2Microsoft Mesh will be available in the Meta Quest app store on January 25, 2024. 3Customers with the following licenses have access to Mesh in Teams. Teams Essentials, Microsoft 365 Business Basic, Microsoft 365 Business Standard, Microsoft 365 Business Premium, Microsoft 365 E3/E5, and Office 365 E1/E3/E5. 4Mesh trial requires an active Microsoft 365 or Teams business plan.  Help people and teams do their best work with the apps and experiences they rely on every day to connect, collaborate, and get work done from anywhere. "
}