{
    "title": "Microsoft's transformative rise to $3 Trillion: Dave Lee",
    "date": "1/29/2024",
    "url": "https://www.biznews.com/global-investing/2024/01/29/microsofts-transformative-rise-3-trillion-decade-dave-lee",
    "text": "  In a transformative decade under Satya Nadella, Microsoft’s ascent to the $3 trillion club reflects a remarkable turnaround. From a humble iPad encounter to now challenging Apple, Nadella’s strategic shift prioritised flexibility, embracing a software-as-a-service model. Diversifying beyond Windows, Microsoft’s revenue is spread across Azure, Office 365, Xbox, LinkedIn, and AI. Breaking free from the Windows-centric approach has allowed Microsoft to explore diverse technologies, making it a true “jack of all trades,” proving the adage: “A jack of all trades is a master of none, but oftentimes better than a master of one.” Sign up for your early morning brew of the BizNews Insider to keep you up to speed with the content that matters. The newsletter will land in your inbox at 5:30am weekdays. Register here. By Dave Lee The first time I met Satya Nadella, I committed what I thought was a cringeworthy faux pas. It was summer 2015, and he was just over a year into his role as Microsoft Inc.’s chief executive officer, and the value of the company that day stood at about $370 billion. ___STEADY_PAYWALL___ “Is that an iPad?” he asked, on camera, as I pulled out the device so I could have my questions at hand. On reflection, it was really no big deal. But as a still somewhat junior reporter, I was worried I was rubbing his face in it. The success of the iPad had blown all of Microsoft’s tablet efforts out of the water. And the iPhone, of course, had made mincemeat of Windows Phone. Nadella’s predecessor, Steve Ballmer, had not been quick enough to grasp the mobile revolution — “there’s no chance that the iPhone is going to get any significant market share,” he said — and had left Microsoft weak. What a difference a decade of Nadella makes. This week, Microsoft joined the $3 trillion club — which so far has only two members, the other being Apple Inc., which first hit the milestone two years ago. The two titans are very much toe-to-toe now — and products like the iPad, it turned out, were part of Microsoft’s resurgence. Before becoming CEO, Nadella had risen through Microsoft’s ranks to build its then-fledgling cloud business. It helped him see into the future. Once in the top job, rather than obsessing on protecting the lucrative Windows business at all costs, Nadella knew it was more important to let bygones be bygones and just put its products wherever it could, shifting to the software-as-a-service model — where revenue comes from recurring subscriptions — that would become the industry norm. Nadella told me that day in 2015 that he didn’t care what device people were using or what operating system. As long as they were accessing Microsoft products somehow, that would be the way ahead. This freedom allowed Nadella to set about greatly diversifying Microsoft’s business. Apple’s reliance on a single popular device, the iPhone, is a persistent investor concern. The smartphone accounted for 52% of the company’s total hardware sales in its most recent reported quarter, and Apple’s Services segment — which includes things like the App Store, Apple Music and Apple Care — would suffer tremendously if iPhone use were to fall. Others in the so-called Magnificent Seven of tech stocks suffer from their own overreliances: 98.5% of Meta Platforms Inc.’s revenue comes from selling targeted ads, while ads displayed on Google searches alone account for 57% of Alphabet Inc.’s. Nvidia Corp.’s soaring valuation currently rests almost entirely on its ability to manufacture enough of its H100 GPU. Read more: 🔒 $250k Land Rover triggers Tata Motors’ quiet revolution: Chris Bryant In Microsoft’s latest reported quarter, the July-September period last year, no single product or service commanded more than 40% of its $56.5 billion in total revenue. The biggest slice came from its Azure cloud business, which generated $23 billion. Office 365 made $13.1 billion; Windows $5.6 billion. LinkedIn, the professional network acquired by Nadella in 2016, brought in $3.9 billion. The company’s Xbox gaming division brought in $3.9 billion — and will be greatly boosted by the completion of the $69 billion deal to acquire Activision Blizzard Inc., helping it regain ground in its rivalry against Sony, particularly as the video game business switches to a more subscription-based model, just as software did. This all before the realization of the extreme potential of artificial intelligence, where Microsoft has a clear leadership position thanks to its $10 billion investment in OpenAI. Direct revenue might be slow in coming, and computing costs will weigh heavy, but AI will boost just about every part of Microsoft’s portfolio — and through its cloud business it stands to benefit when other companies turn to Microsoft for help utilizing AI, too. Releasing Microsoft from its Windows ball-and-chain has meant Nadella can afford to have a cloud business smaller than Amazon’s, an advertising business smaller than Alphabet’s and Meta’s, and a hardware business certainly much smaller than Apple’s. It means Microsoft can afford to experiment with wild new technologies — like its faltering HoloLens — without investors piling on the pressure for it to be the company’s grand vision of the future, like Apple’s Vision Pro. Microsoft’s $3 trillion valuation comes from being a jack of all trades, as they say, though many people neglect to use the full saying. “A jack of all trades is a master of none,” it goes, “but oftentimes better than a master of one.” Read also: © 2024 Bloomberg L.P. Listen to the story of Cyril Ramaphosa's rise to presidential power, narrated by our very own Alec Hogg. Narration by Alec Hogg BizNews © 2024 BizNews, Inc. | The Rational PerspectiveTerms & ConditionsComments Policy "
}