{
    "title": "Woman gets job offer from Microsoft after 30 attempts but quits within one \nyear, here is why",
    "date": "1/8/2024",
    "url": "https://www.indiatoday.in/technology/news/story/woman-gets-job-offer-from-microsoft-after-30-attempts-quits-as-company-did-not-allow-her-to-grow-2485818-2024-01-08",
    "text": "Listen to Story Satya Nadella-led Microsoft is considered to be one of the best places to work at. The company has thousands of employees across the globe and is often making headlines for a number of reasons. Last year, Microsoft dominated the news world when it announced 10,000 job cuts. A lot of employees had come forward back then and talked about their layoff experiences. While some shared how they received the lay-off mail at odd hours, others expressed how they were handed the pink slip despite being one of the top performers at the company. And now, a former Microsoft employee has come forward to talk about her experience at the company and how she quit her job in a year, even though it took her 30 attempts to land an offer. Microsoft employee gets offer after 30 attempts According to a Moneycontrol report, the 24-year-old woman learnt how to code all by herself and landed a job with Microsoft. In a tweet, she shared how she got a job with the company after 30 attempts and urged others to apply to their dream jobs. \"I applied to Microsoft 30+ times, and when I got hired, I was one among the 25 from the pool of 11000 applicants (It was off-campus hiring through a hackathon). I believe in - Send that DM. Apply to that job. Take the road not taken. Worst case? I fail. Soak it all in. Be sad. Realise the mistakes and bounce back,\" she wrote. However, speaking to Moneycontrol, she said that after working with Microsoft for a year, she realised that this wasn't what she wanted to do and quit her job. She wanted to grow in her career faster than what the company's culture permitted, she told the publication. With that being said, the woman said that she is open to coming back to working for the organisation again.Microsoft layoffs Microsoft, in January 2023, had announced laying off 10,000 employees. CEO Satya Nadella, in an email to employees announcing the layoffs, wrote that the company is letting go of employees because of \"macroeconomic conditions and changing customer priorities.\" Months later, an additional 276 employees were laid off. The departments that were impacted included customer service, support, and sales. 66 of the fired employees were working remotely, as per the report. Talking about the layoffs, a spokesperson told CNBC, \"Organisational and workforce adjustments are a necessary and regular part of managing our business. We will continue to prioritise and invest in strategic growth areas for our future and in support of our customers and partners.\"Published By: Divyanshi SharmaPublished On: Jan 8, 2024ALSO READ |  Microsoft employee gets fired after 14 years of service, calls it the beginning of a new eraALSO READ |  Microsoft may soon remove this 28-year-old WordPad from computers: Here is everything we know "
}