{
    "title": "Massive layoffs at Microsoft as 1,900 jobs terminated, including at newly \nacquired Activision",
    "date": "1/26/2024",
    "url": "https://www.firstpost.com/tech/massive-layoffs-at-microsoft-as-1900-jobs-terminated-including-at-newly-acquired-activision-13657312.html",
    "text": "Microsoft is the latest tech company to lay people off en masse. The tech giant, is set to lay off 1900 people form its gaming divisions, including from Activision Blizzard which it had acquired only recently Microsoft is set to lay off 1,900 employees within its video-game divisions, a move that includes Activision Blizzard, as per a report by Bloomberg. Microsoft had only recently acquired Activision for $69 billion in a deal that concluded late last year. In an internal email reviewed by Bloomberg, Phil Spencer, Microsoft’s gaming chief, disclosed that these layoffs constitute approximately 8 per cent of the company’s 22,000 gaming workforce. The Verge initially reported this development, noting that other gaming companies, such as Riot Games, have also implemented significant workforce reductions. Phil Spencer emphasized in the email, “Together, we’ve set priorities, identified areas of overlap, and ensured that we’re all aligned on the best opportunities for growth.” As part of the restructuring, Blizzard Entertainment is undergoing substantial changes, including the cancellation of a survival game codenamed Odyssey. Additionally, the company is parting ways with President Mike Ybarra and Chief Design Officer Allen Adham, who is also the co-founder of Blizzard Entertainment. In a communication to staff, Microsoft Studios President Matt Booty announced Ybarra’s departure, stating that Ybarra “has decided to leave the company.” Ybarra, who had previously expressed a long-term commitment to Blizzard, confirmed his departure in a post on X, mentioning, “Having already spent 20+ years at Microsoft and with the acquisition of Activision Blizzard behind us, it’s time for me to (once again) become Blizzard’s biggest fan from the outside.” These workforce adjustments occur just three months after Microsoft’s finalization of the Activision Blizzard acquisition. Rob Kostich, Activision Publishing chief, explained in an email to staff reviewed by Bloomberg that the cuts were implemented “to reset and re-align our resources for the future.” Notably, more than 60 tech companies, including giants like Amazon.com and Google parent Alphabet, have collectively laid off nearly 11,000 employees in the tech industry this year, according to Layoffs.fyi, a platform tracking job cuts in the tech sector. Microsoft is scheduled to report its quarterly earnings on January 30. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}