{
    "title": "EU to review Microsoft’s investment in OpenAI",
    "date": "1/9/2024",
    "url": "https://www.computerworld.com/article/3712181/eu-to-review-microsofts-investment-in-openai.html",
    "text": "By Sascha Brodsky Computerworld | The European Union is investigating whether Microsoft's investment in OpenAI amounts to a concealed merger amid efforts to regulate the rapidly advancing generative AI (genAI) sector. The European Commission, serving as the EU's executive branch, said Tuesday it is starting a competition inquiry into the markets of virtual worlds and genAI; the goal is to focus on the current level of competitiveness and the role law might play in shaping these fields. “The European Commission will carefully review all input received through the calls for contributions. Following that review, the Commission may organize a workshop in the second quarter of 2024 to bring together all different perspectives emerging from the contributions and continue this reflection,” it said in a statement. The EU is calling for feedback from interested stakeholders and set a deadline for submissions of March 11. The commission noted that with more than $7.9 billion invested in AI in the EU in 2023, raising the value of the region's \"virtual worlds\" market to $12 billion, rapid growth is likely to influence business competition significantly. \"Virtual worlds and generative AI are rapidly developing,\" said Margrethe Vestager, EU Commission executive vice president in charge of competition policy. \"It is fundamental that these new markets stay competitive, and that nothing stands in the way of businesses growing and providing the best and most innovative products to consumers Even so, the EU's efforts might not affect genAI development, said Gal Ringel, the CEO of Mine, a data privacy firm developing solutions for emerging AI regulations. “OpenAI has grown so large and influential over the past year that even a ruling against the company now would only prove a temporary roadblock, as the company would surely find ample investment if it needed to pursue that route,” he said. The inquiry follows a period of disruption at OpenAI in late November when the board unexpectedly decided to remove founder and CEO Sam Altman. In response, Microsoft, an investor in OpenAI, promptly announced it would employ Altman. A few days later, Altman was back in place at OpenAI. The turmoil comes as genAI platforms and tools come under increasing regulatory scrutiny due to safety and monopoly concerns. In December, the UK's Competition and Markets Authority announced it is gathering opinions to determine whether the collaboration between Microsoft and OpenAI should be treated as an effective merger. That move could precede a full-scale investigation. Various nations have moved to try and put guardrails around the fast-evolving technology. During the inaugural session of the AI safety summit last year, 28 countries endorsed a pledge to collaborate on research in AI safety. The United States is focusing on AI safety standards via an executive order signed by President Joseph R. Biden Jr. And China has enacted specific legislation to regulate genAI. OpenAI is also facing questions over its use of copyrighted material. The New York Times sued OpenAI and Microsoft last month, accusing the companies of infringing on its copyrights by using millions of its articles to train genAI models. But the US is far less likely than the EU to attempt to regulate OpenAI or AI development in a “meaningful way,” Ringel said. “With the country being unable to pass a federal data protection law, it seems unlikely they could pass comprehensive AI regulation during an election year.” Microsoft and OpenAI did not immediately respond to requests for comment. Copyright © 2024 IDG Communications, Inc. Copyright © 2024 IDG Communications, Inc. "
}