{
    "title": "11 Stocks That Will Make You Rich in 5-10 Years",
    "date": "1/21/2024",
    "url": "https://finance.yahoo.com/news/11-stocks-rich-5-10-120121544.html",
    "text": "In this article, we will take a detailed look at the 11 Stocks That Will Make You Rich in 5-10 Years. For a quick overview of such stocks, read our article 5 Stocks That Will Make You Rich in 5-10 Years. Can investing in stocks make you rich? This question is rarely posed anymore since data has overwhelmingly proved that investing in the stock markets is one of the best ways to increase your wealth over time. A report in October 2023 by the Wall Street Journal talked about the rise of \"mini-millionaires\" and how the average wealth of American families was increasing, citing data from the Federal Reserve. Mini-millionaires usually make about $150,000 and $250,000 a year. The report said between 2019 and 2022 families in the 80th to 90th percentile of the income distribution saw the biggest rise in their incomes as their median wealth increased by about 69% from 2019 through 2022, adjusted for inflation. The report said that over 90% of these families reported owning stocks, either directly or indirectly. Needless to say, investing in the stock market is full of crevices. You can't expect to get rich investing in low-quality stocks and random companies with no value. Investing in stocks to become rich involves patience, wise choices and sticking to traditional investing principles. Legendary value investor Seth Klarman had in 2000 foreseen the changing trends in the stock market where investors were becoming impatient, expecting to make money without paying attention to the actual fundamentals of companies. But Klarman at the time had also predicted the return of traditional methods of evaluating companies before investing. In his letter to investors Klarman had said: \"If Paul Harvey's serialized radio program \"The Rest of the Story\" were applied to Wall Street, it would describe the sad denouement of many such \"story\" stocks. The unraveling of the virtuous circle of growth is not pretty, with earnings shortfalls, plunging share prices, employees with under-water options jumping ship, overzealous shareholders receiving margin calls, accounting chicanery exposed, lawsuits filed, and, to come full circle, the final insult of deletion from the relevant major market index. At this time, attractive valuation is not considered a good story. A slow growth or no growth company trading at one half or one third of its underlying value attracts no important constituency of investors. I sometimes joke about the new market valuation rules of thumb: stocks that fail to meet earnings expectations all seem to trade at 10 times reduced earnings, while formerly profitable companies that report losses all seem to trade at five dollars per share. Many investors avoid these stocks precisely because others are staying away. Why would those kind of stocks ever go up, they wonder. Even those of us with value investing in our DNA generally prefer situations with catalysts for the realization of underlying value. Over time, this will change. At some unknowable future point, the undervaluation of small capitalization stocks lacking exciting growth characteristics will become so gaping that investors will once again be attracted. The point of investing, after all, is not to have a great story to tell; the point of investing is to make money with limited risk. At some point, investors will drop their Pulitzer prize winning story stocks and revisit their attention on the old classics, stocks that make you money because their undervaluation creates a compelling imbalance between risk and return.\" Seth Klarman of Baupost Group Methodology For this article we scoured various analyst reports and interviews to pick 11 stocks that experts believe can make one rich in the next 5-10 years. Number of Hedge Fund Investors: 16 ChargePoint Holdings Inc (NYSE:CHPT) is one of the stocks that can make one rich in the next few years according to Wall Street analysts. Oppenheimer analyst Colin Rusch last year set a $27 price target on the stock. ChargePoint Holdings Inc (NYSE:CHPT) was trading at $2.11 as of January 4. Here is why the analyst likes the stock: “Of note, in our view, is that the company’s substantial product development cycle is slowing and management continues to expect material operating leverage as R&D spend moderates. Second, demand continues to be robust as EV sales grow in multiple geographies driving charging infrastructure buildout. Third, the company is well capitalized as it drives toward positive adjusted EBITDA in F2Y4 and manages working capital needs for growth. We remain constructive on shares as we anticipate the company will enjoy both top-line growth and margin expansion in coming quarters.” In addition to CHPT, investors are also piling into high quality names like Microsoft Corp (NASDAQ:MSFT), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Number of Hedge Fund Investors: 20 Biopharma company Tarsus Pharmaceuticals Inc (NASDAQ:TARS) ranks 10th in our list of the stocks that will make you rich in the next five to ten years. The average price target for the stock over the next one year is $43.25. Oppenheimer analyst Francois Brisebois, who also has a $43 price target on the stock, explained his bullish thesis on Tarsus Pharmaceuticals Inc (NASDAQ:TARS) in the following words, according to TipRanks: “Commercially led by eye care veteran CCO Mottiwala (ex-VP Marketing Allergan Eye Care), TARS is well-positioned to develop a new category, eyelid health. We are particularly encouraged by market research revealing an intent to prescribe for demodex blepharitis (DB) of 93%. As awareness grows, our conviction in TP-03’s market potential is reinforced. Additionally, we believe TP-03 could benefit from key differences between DB and dry eye disease (DED) markets. Finally, although we currently don’t value TARS’ pipeline, we believe it should not be dismissed and see multiple opportunities for growth and monetization.” Number of Hedge Fund Investors: 37 Utility company AES Corp (NYSE:AES) ranks 9th in our list of the best stocks that will make you rich in the next 5 to 10 years according to Wall Street analysts. Sarat Sethi, DCLA managing partner, believes the stock AES Corp (NYSE:AES) has strong earnings growth potential for the next three to five years. The analyst also praised the stock’s dividend yield. Massif Capital made the following comment about The AES Corporation (NYSE:AES) in its Q3 2023 investor letter: “Given interest rates’ elevated state, it is perhaps unsurprising that our utility exposure has fared poorly for us this year. We should have hedged the exposure sooner with a Utility ETF short, but we did not do that until the third quarter, after much of the damage was already done. As noted above, our Utility exposure is second only to our materials exposure in terms of negative impact on the portfolio across both the third quarter and the YTD periods. This is primarily driven by our investment in The AES Corporation (NYSE:AES), which was down roughly 26% in the third quarter and 47% YTD. Our other utility exposure is up for the year, including our short position, which, as noted, was put on in the third quarter, and it is probably something we should have had on the books for the entire year. We attribute, for right or wrong, the entirety of the sell-off in AES to the interest rate environment. Chart overlays are always tricky, so one should not read too much into them, but as a quick sense check of the claim, if one inverts the move-in rates for a generic 10-year US government bond and overlay it with AES stock price YTD, you get the following:..” (Click here to read the full text) Number of Hedge Fund Investors: 68 Sarat Sethi of DCLA managing partner likes Comcast Corporation (NASDAQ:CMCSA) as a stock to buy and hold for the next few years because of its strong cash flow, growing dividend and a “very strong management team.” As of the end of the third quarter of 2023, 68 hedge funds tracked by Insider Monkey had stakes in Comcast Corporation (NASDAQ:CMCSA). The most significant stake ($1.42 billion) in Comcast Corporation (NASDAQ:CMCSA) is owned by Jean-Marie Eveillard’s First Eagle Investment Management. ClearBridge Large Cap Value Strategy made the following comment about Comcast Corporation (NASDAQ:CMCSA) in its Q3 2023 investor letter: “Long-term holdings Charter and Comcast Corporation (NASDAQ:CMCSA) delivered strong second-quarter results relative to expectations; their stable recurring revenue streams and undemanding valuations were rewarded in the current environment. Cable multiples compressed over the past 24 months on fears of heightened competition in their core broadband business from fixed wireless and fiber providers. While fiber remains a competitive alternative to cable broadband over the long term, high upfront investments and a materially higher cost of capital are resulting in slower buildouts than previously expected. Fixed wireless also continues to gain traction, particularly in rural markets, but share gains also appear to be moderating. At the same time, both Comcast and Charter are expanding their footprints into rural and adjacent markets while gaining wireless market share, leveraging their mobile virtual network operator agreements with Verizon. We think both cable companies are well-positioned to continue to grow while generating substantial free cash flows. We added to Comcast during the quarter.” Number of Hedge Fund Investors: 73 Freeport-McMoRan Inc (NYSE:FCX) is one of the stocks that has the potential to gain a lot in value over the next few years, according to Sarat Sethi, DCLA managing partner. The analyst said while talking to CNBC that Freeport-McMoRan Inc (NYSE:FCX) is set to gain on the back of an increase in demand for EVs and copper. As of the end of the third quarter of 2023, 73 hedge funds tracked by Insider Monkey had stakes in the company. Like FCX, hedge funds are loading up on Microsoft Corp (NASDAQ:MSFT), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA). Number of Hedge Fund Investors: 81 Tesla Inc (NASDAQ:TSLA) is perhaps one of the most divisive stocks out there, with some analysts saying the stock will fall while others saying the stock would skyrocket. Cathie Wood of ARK Invest believes Tesla Inc (NASDAQ:TSLA) could hit $2000 by 2027. Wedbush's Dan Ives, who is also a notable Tesla Inc (NASDAQ:TSLA) bull, recently said in a program on CNBC that there are signs that demand for Tesla Inc (NASDAQ:TSLA) vehicles remains strong. He said that it’s important to differentiate between demand trends in the broader EV industry and demand for Tesla Inc (NASDAQ:TSLA) vehicles. In addition to Tesla, Microsoft Corp (NASDAQ:MSFT), Amazon.com Inc (NASDAQ:AMZN) and NVIDIA Corp (NASDAQ:NVDA) are among the top stocks hedge funds and Wall Street analysts are buying. Here is what White Brook Capital has to say about Tesla, Inc. (NASDAQ:TSLA) in its Q3 2023 investor letter: “The magnificent seven, that underpin the S&P 500 performance, which includes Tesla, Inc. (NASDAQ:TSLA), now comprise almost 30% of the market capitalization of the S&P500. At least three of the seven stocks have heightened downside risk and suffer from already high penetration, weakening end markets, competitive risk, and lofty valuation. They have been remarkably resilient to increased interest rates and the potential for slowing growth. Small and midcap stocks, on the other hand, have been systemically penalized by fears of recession and continue to price that eventuality even as significantly better outcomes have become more probable. Today, it’s relatively easy to find attractive investments in this segment.”  Click to continue reading and see the 5 Stocks That Will Make You Rich in 5-10 Years.  Suggested Articles: 13 Best Get Rich Quick Stocks To Buy 13 Cash-Rich Small Cap Stocks To Invest In 15 Stocks That Will Make You Rich in 5 Years According to ChatGPT, Disclosure. None. 11 Stocks That Will Make You Rich in 5-10 Years was initially published on Insider Monkey. Related Quotes "
}