{
    "title": "Bengaluru techie bags a job at Microsoft after applying over 30 times, \nquits in a year",
    "date": "1/7/2024",
    "url": "https://www.moneycontrol.com/news/trends/bengaluru-techie-bags-a-job-at-microsoft-after-applying-over-30-times-quits-in-a-year-12009941.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now It took Haimantika Mitra more than 30 attempts to finally bag a job with her dream company -- Microsoft. The 24-year-old, who taught herself how to code with help from a self-learn skills programme run by the tech giant said it was one of the milestone moments in her life. She, however, quit a year on. Speaking to Moneycontrol, Mitra said that after working with the company for about a year, she realised that she wanted to work in a different role and grow faster than Microsoft's workplace culture permitted. So she quit and took up a desired position in a different company but she has not ruled out working for Microsoft again in the future. Mitra -- who hails from Siliguri and is currently based in Bengaluru -- was introduced to the Microsoft community during Covid and during her interactions with members that included engineers and other senior professionals, she felt herself being drawn to the company. \"The first technical group that I was active in was the Microsoft Student Ambassador community and I really started falling in love with Microsoft tools. Being a part of the community allowed me to interact with engineers and senior professionals and that's when I began to like the work culture of the company. Slowly, I realised that it was my dream company and I had to work with them,\" she told Moneycontrol. But there were multiple hurdles. Mitra graduated from Siliguri, a small town in West Bengal, where job opportunities were limited. Not one to give up, she kept looking out for openings that Microsoft put up on its website and kept applying for varying roles. \"I applied more than 30 times and got rejected. But I kept trying,\" she said, adding that she applied for roles in software development, technical consultant, and even internships.I applied to Microsoft 30+ times, and when I got hired, I was one among the 25 from the pool of 11000 applicants (It was off-campus hiring through a hackathon). I believe in - Send that DM. Apply to that job. Take the road not taken. Worst case? I fail.Soak it all in. Be sad.… https://t.co/3YQemnJ2Yj — Haimantika Mitra (@HaimantikaM) January 4, 2024 When nothing worked, a hackathon caught her eye. \"In December 202o, I came to know of a country-wide hackathon that was being organised and Microsoft was supposed to hire support engineers from among the participants,\" Mitra said, adding that she immediately applied for it and was shortlisted from among 11,000 applicants. She did not make it to the final round of the hackathon but impressed with her performance, Microsoft recruiters agreed to interview her, and after two rounds, she was selected as an intern. \"I started my internship in April 2021 and after three months there were two more rounds of interviews before I was finally accepted as a full-time employee,\" Mitra said. She was hired as a support engineer and although Mitra enjoyed her time at Microsoft, the role wasn't exactly what she wanted. \"I love Microsoft, but my role there was of a support engineer -- it wasn't exactly what I wanted to do in life.\" So she collaborated with other teams and interviewed for other roles but couldn't bag any in India, and due to company policies, she could not take up any position in other countries. \"I realised that I had to continue in this role for a few years and only then would I be considered for other and more desirable positions at Microsoft. I, however, wanted a faster pace and felt that if I spent two-to-three years as a support engineer only, I would have lost my relevance in the industry. That's why I had to quit.\" Mitra is currently working with another tech company in Bengaluru, but her loyalty to Microsoft continues. \"I would love to return to the company in the future if a suitable position opens up. Not right now, but definitely someday,\" she said. Read more: Bengaluru techie applies for aviation job, loses Rs 13.5 lakh to man posing as recruiter Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}