{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.fool.com/investing/2024/01/17/is-microsoft-the-best-dow-jones-stock-to-buy-right/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Unlike other indexes, the Dow Jones Industrial index (DJINDICES:^DJI) is an invite-only club. It includes 30 of the largest U.S. companies, but there are a few kickers that make for an odd index. First, just because you're large doesn't mean you're included. In fact, the third through ninth largest companies in the U.S. aren't in the Dow. However, Microsoft (MSFT -0.17%) is included in the Dow and is currently vying in a day-to-day battle with Apple to become the world's largest company. But is Microsoft the best stock to buy in the Dow? Let's find out. Unlike the Nasdaq-100 index, the Dow is filled with companies many might consider boring, like IBM, Coca-Cola, Intel, and Walgreens Boots Alliance. In fact, the Dow has significantly underperformed its peers (the Nasdaq-100 and S&P 500) for some time due to the exclusion of some of the biggest tech companies.  ^SPXTR data by YCharts Microsoft has been a member of the Dow Jones since 1999, but its strong performance has only come recently. Microsoft's stock was essentially flat from its inclusion in 1999 to the start of 2015.  MSFT data by YCharts However, if you bought the stock at the start of 2015, you're up over 700% (an eight-bagger). This success came from Microsoft naming Satya Nadella CEO in February 2014, when he initiated Microsoft's focus on cloud computing. This helped Microsoft substantially grow, and its cloud computing division, Microsoft Azure, continues to be one of the best reasons to invest in the stock today. However, Microsoft is also considered a strong AI investment. Microsoft is rolling out its Copilot product, which gives users a generative AI program to assist them with daily tasks. This can be used to write emails, create complicated formulas in Excel, or provide programmers with the code they need in GitHub. This relatively new product could be a massive revenue growth driver if it catches on. With a $30 per user per month price tag, it isn't cheap. But if it can make employees more efficient, it may be a bargain add-on. Regardless, few companies in the Dow can say they are more innovative than Microsoft. But is the stock a buy? Microsoft's business has been executing at a high level for a while, and the future also looks strong. As a result, the stock has garnered a hefty premium.  MSFT PE Ratio data by YCharts If you discount a period in 2018 when earnings were artificially inflated, Microsoft's stock has not traded at these levels in recent history. That's some cause for concern, as 35 times forward earnings is quite expensive. Although Microsoft grew revenue a respectable 13% in Q1 of FY 2024 (ending Sept. 30, 2023), that growth isn't associated with trading in the mid-30s price-to-earnings ratio range. There is a lot of froth in the market caused by AI expectations and investor enthusiasm about whether the Federal Reserve can pull off a soft landing. That's what's driving these high stock prices, and it could spell trouble for some if the results aren't as expected. As a result, I don't think Microsoft is a top stock to buy in the Dow. Some businesses are growing faster (or as fast) and trading at a much cheaper valuation than Microsoft (like Visa and American Express), making them more attractive than Microsoft. Microsoft isn't a bad business; the stock is just very expensive for its current business state. American Express is an advertising partner of The Ascent, a Motley Fool company. Keithen Drury has positions in Visa. The Motley Fool has positions in and recommends Apple, Microsoft, and Visa. The Motley Fool recommends Intel and International Business Machines and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2024 $47.50 calls on Coca-Cola, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}