{
    "title": "Microsoft's OpenAI Bet Pays Off, Becomes Second Company After Apple To \nCross $3-Trillion Market Value",
    "date": "1/25/2024",
    "url": "https://news.abplive.com/technology/microsoft-market-cap-usd-3-trillion-openai-bet-pays-off-becomes-second-company-after-apple-to-cross-1659297",
    "text": "In a significant market development on Wednesday, Microsoft achieved a milestone by surpassing the $3 trillion valuation mark for the first time. The tech giant secured its position as the second most valuable company globally, trailing just behind Apple. Throughout the year, Microsoft and Apple have engaged in a competitive battle for the top spot as the most capitalised stock on Wall Street. In January, the software giant briefly dethroned the iPhone maker, experiencing a momentary leadership shift. During the latest surge, Microsoft shares reached a historic peak of $405.63, reflecting a 1.7 per cent increase. This surge propelled the company's market capitalisation above the $3 trillion threshold. However, by the closing bell, the stock retreated to $402.56, resulting in a valuation of $2.99 trillion—just shy of the crucial $403.65 mark required to maintain the $3 trillion status. Contrastingly, Apple's shares relinquished some of their earlier gains, concluding with a 0.35 per cent decline at $194.50. Despite the dip, Apple retained its status as a $3 trillion company, according to data from LSEG. Microsoft's strategic positioning in the market dominance race within the realm of generative artificial intelligence (AI) is notably underscored by its investment in OpenAI, the creator of ChatGPT. This move positions Microsoft as a frontrunner alongside other tech giants such as Google owner Alphabet, Amazon.com, Oracle, and Meta Platforms, the parent company of Facebook. Leveraging OpenAI's technology, Microsoft has introduced updated versions of its flagship productivity software and revamped its Bing search engine. These advancements are poised to enhance Microsoft's competitiveness, especially in comparison to Google's dominant search offering. ALSO READ: Microsoft Launches Copilot Pro, AI-Powered Features Arrive In Office Earlier this month, Microsoft unveiled Copilot Pro, an advanced subscription variant of its Copilot service. This premium model aims to enhance document creation, email analysis, and presentation development by offering exclusive access to AI-powered functionalities embedded within Office applications. Copilot Pro not only grants users the ability to utilise the latest OpenAI models but also empowers them to construct their personalised Copilot GPT. An interesting departure from previous requirements, organisations are no longer bound by a minimum seat threshold to access these services. Microsoft, in a blog post released on Monday, also disclosed the widespread availability of the Copilot app for both iOS and Android devices. This move signals a significant stride towards facilitating a more seamless and efficient user experience across various platforms. "
}