{
    "title": "Microsoft CEO says he's comfortable with OpenAI's non-profit board after \nSam Altman turmoil",
    "date": "1/16/2024",
    "url": "https://www.foxbusiness.com/technology/microsoft-ceo-says-hes-comfortable-openais-non-profit-board-after-sam-altman-turmoil",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Wall Street Alliance Group partner Aadil Zaman and Peapack Private Wealth Management managing principal David Dietze react to Sam Altman returning to OpenAI five days after his firing on Making Money. Microsoft CEO Satya Nadella said Tuesday that he has no issue with the governance structure of its artificial intelligence partner OpenAI two months after its non-profit board temporarily ousted CEO Sam Altman two months ago. OpenAI’s non-profit board forced out Altman as CEO over an alleged communication breakdown between him and board members in a surprise move that spurred a crisis at the startup behind ChatGPT. After employees revolted and threatened to resign and Microsoft moved to hire Altman and other executives, the two sides reached a compromise that restored Altman as OpenAI’s CEO. \"I’m comfortable. I have no issues with any structure,\" Nadella said at a Bloomberg News event on the sidelines of the World Economic Forum’s annual meeting in Davos. Microsoft is a key partner and financial backer of OpenAI, having invested billions of dollars in the firm. MICROSOFT LAUNCHES SUBSCRIPTION-BASED CHATBOT, AI COPILOT PRO FOR $20 A MONTH Microsoft CEO Satya Nadella said Tuesday that he's comfortable with OpenAI's non-profit board and has no issues with any structure for the AI startup. (Mark Kauzlarich/Bloomberg via Getty Images / Getty Images) As part of Altman’s return, only one of the OpenAI non-profit board’s four prior members remained in their role. Quora CEO Adam D’Angelo was the lone holdover, while Bret Taylor and Larry Summers joined the board. At a separate Bloomberg event in Davos on Tuesday, Altman said that OpenAI is working to fill out the board’s membership and that once that process is completed, the new look board of directors will consider potential changes to OpenAI’s governance structure, including the non-profit board that oversees its operations. \"I expect us to make a lot of progress on that in the coming months. And then after that, the new board will take a look at the governance structure,\" he explained. \"We’ll look at it from all angles.\" WHAT IS ARTIFICIAL INTELLIGENCE (AI)? Nadella said that the partnership between Microsoft and OpenAI helps protect competition. (Jonathan Raa/NurPhoto via Getty Images / Getty Images) In the wake of the turmoil, Microsoft secured a non-voting observer position on OpenAI’s board. The relationship between Microsoft and OpenAI has reportedly attracted scrutiny from regulators in Europe and Britain, in addition to the U.S. Reuters reported citing a person briefed on the terms of the agreement between the two tech companies that it guarantees Microsoft will receive large chunks of the startup’s profits depending on whether certain conditions are met. GET FOX BUSINESS ON THE GO BY CLICKING HERE Nadella said that the fact Microsoft doesn’t fully own OpenAI distinguishes their deal in a way that promotes competition. \"Partnerships is one avenue of, in fact, having competition,\" he said. Reuters contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}