{
    "title": "Governing AI: A blueprint for the UK",
    "date": "2/15/2024",
    "url": "https://news.microsoft.com/en-gb/2024/02/15/governing-ai-blueprint-for-uk/",
    "text": "February 15, 2024\t\t\t\n\t\t\t | Clare Barclay, Chief Executive Officer, Microsoft UK Today we launch Governing AI: A Blueprint for the UK. Artificial intelligence is a vital technology that will define our future, it has the potential to solve society’s biggest challenges, revolutionise the way we work and – in line with our mission – can help every person and every organisation on the planet achieve more. As one of the most digitally advanced economies in the world, the UK is well placed to lead the way in AI development and deployment. The home of innovative businesses, research institutions and world leading universities, the UK is quick to adopt emerging technologies and use them to solve real world challenges. For example, AI is helping improve patient care and experiences across the National Health Service, monitor puffin and salmon populations in Scotland, and accelerate clinical research. At Microsoft, we are optimistic about what AI can do for people, industry and society. We are acutely aware that when you create technologies with the ability to change the world, you must do so responsibly. For that reason, we have invested to make sure that our AI systems are responsible by design. To guide our work, we have established a set of core principles: fairness, reliability and safety, privacy and security, inclusiveness, transparency and accountability. We’ve put those principles into practice by developing and implementing our Responsible AI Standard and related tools like our Impact Assessment. And we also share our learnings externally, including our Standard and Impact Assessment template, to contribute to broader societal conversations about AI. We are not the only ones considering how to democratise access to new technologies and minimise any risks that emerge as we deploy them. Governments around the world want to reap the benefits of AI and do so in a responsible way. They know that there isn’t a single country, business or individual that has all the answers. “We have a set of core principles: fairness, reliability and safety, privacy and security, inclusiveness, transparency and accountability.” Creating the right regulatory framework starts with asking the right questions: about fairness, bias, inclusion, privacy and we need a wide range of voices in the room to do that. As such, we applaud the UK Government’s decision to host the first ever global summit on AI safety in November 2023, and we were delighted to sign up to the White House commitments and provide an update on our policies alongside the summit. Working together, we can set out the international ‘rules of the road’ on how to develop and deploy AI technologies safely. Technology has the potential to change people’s lives for the better, and the era of AI – the latest in a long line of innovations from the railway to the internet – is no exception to this. The challenge will be to harness AI to deliver greater prosperity across the UK so that its benefits are shared by all. Only by working together, pooling cross-sector and cross-societal expertise, will we be able to realise the promise of AI. More detail is included in this blueprint, as well as information about some of the critical steps that go into building, using, and deploying AI technologies, from manufacturing and education, to sustainability and protecting elections. Read and download the full report – Governing AI: A blueprint for the UK Follow us: Share this page: "
}