{
    "title": "Last chance: Get Microsoft Office for PC or Mac for $30 right now",
    "date": "2/4/2024",
    "url": "https://www.zdnet.com/article/get-microsoft-office-for-pc-or-mac-for-30-right-now/",
    "text": "Most Popular 'ZDNET Recommends': What exactly does it mean? ZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing. When you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews.  Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers. ZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors  thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form. Whether you're setting up your new laptop or using a machine you've had for years, access to Microsoft Office is a necessity for many of us to get things done. And right now, you can buy a lifetime license to the 2019 version of either Microsoft Office Home & Business or Microsoft Office Professional Plus, both for just $30 -- a discount of 86%. The only big difference between Office 2019 and later versions is the lack of the latest version of Microsoft Teams. But if you're only looking for Word, PowerPoint, and Excel, this is a great deal -- especially for $30. The Home & Business version includes Word, Excel, PowerPoint, Excel, Outlook, OneNote, and Teams Classic. The Professional Plus version includes those (except for Teams Classic) as well as Publisher and Access. One thing to note: While StackSocial offers \"lifetime\" access to Office, it is possible that Microsoft could end the license. But these Office deals have been running for over a year, and the license for Office 2021 that I bought through it for my personal MacBook over a year ago is still working. You also won't get the benefits of the latest Microsoft Office 365 subscription -- but you won't have to pay a $70 yearly fee to access Office apps, either. This deal could end any time, so buy your Microsoft Office 2019 Home & Business or Microsoft Office Professional Plus 2019 license now to take advantage of this low price. "
}