{
    "title": "Microsoft CEO Nadella: GitHub Code Pilot tool is company's most mature \nGenAI product",
    "date": "2/1/2024",
    "url": "https://www.crn.com.au/news/microsoft-ceo-nadella-github-code-pilot-tool-is-companys-most-mature-genai-product-604688",
    "text": "Microsoft Chairman and CEO Satya Nadella suggested an end to a prolonged period of new-business slowdown and longer “optimisation cycles” by customers that increased tech spending during the height of the global pandemic while telling analysts he is starting to see generative artificial intelligence become “standard issue” for some customers, particularly when it comes to coders. On Tuesday’s quarterly earnings call for the Redmond, Wash.-based tech company–Microsoft’s second fiscal quarter ended Dec. 31–Nadella said that two months into Microsoft 365 Copilot’s general availability period, adoption has been “much faster” compared with other product suites including E3 and E5. He attributed that growth to AI’s ease of adoption: “It shows up in your apps, you click on it … and it becomes a daily habit,” he said. “It reminds me a little bit of … PC adoption” Nadella said. “It first starts off with few people having access. There are many companies that are doing standard issue. So just like PCs became standard issue, at some point after PCs being adopted by early adopters I think that’s the cycle that at least we expect.” He pointed to Microsoft’s GitHub Copilot code generation tool as the most mature GenAI product at Microsoft, saying that its necessity for programmers is akin to spelling and grammar checks in Microsoft Word. “This is the place where it’s most evolved in terms of its economic benefits or productivity benefits,” Nadella told analysts on the call. “We see it inside of Microsoft. We see it in all the case studies. … It is the one place where it’s become a standard issue for any developer. … It’s like if you take away spell check for Word, I'll be unemployable.” As for the trend of customers slowing down spending on new tech workloads and projects to focus on getting the most out of existing spend—a trend that saw mass layoffs at Microsoft itself and other tech vendors and solution providers—Nadella suggested a return to normality. “That period of massive—I’ll call it ‘optimisation only, and no new workloads start’–that I think has ended at this point,” Nadella said. “So what you’re seeing is much more of that continuous cycle by customers, both when it comes to AI or whether it comes to the traditional workloads.” Microsoft CFO Amy Hood appeared to echo Nadella’s comments. “Whether you use the word ‘lapping’ [for] these optimisation comparables, or the comparables easing—it’s all sort of the same thing—that we're getting to that point in H2 [Microsoft’s second half of its fiscal year], that’s absolutely true,” Hood said. “We like to talk about the contribution of AI specifically for the reasons Satya talked about. This is starting to be the application of AI at scale. And we want to be able to show people this is how that’s going to look.” Microsoft has about 400,000 channel partners worldwide, according to the CRN US 2023 Channel Chiefs. Microsoft’s lift of the 300-minimum-seat requirement for M365 Copilot—an adjustment that could open Copilot access to more solution providers and more solution provider customers—was meant to appeal to customers who “want to do a land with a smaller group, see the productivity gains and then expand,” Hood said. “Being able to lift some of the seat requirements that we did earlier this month is really going to allow customers to be able to use that approach,” she said. Nadella said that two months into Microsoft 365 Copilot’s general availability, adoption has been “much faster” compared with other product suites including E3 and E5. Nadella shared a series of product growth highlights to show more use of AI and cloud offerings from the vendor. Those highlights included: Nadella suggested that so far, the main use of AI has been summarisation, including summarising Teams meetings during the meeting or even after it, plus summarising Word documents, emails and other content. “Summarisation has become a big deal,” he said. Drafting content, chats and actions with AI are other common uses so far, he said. He compared the changes in work and workflow with Copilot as akin to the changes after people started using Microsoft Excel and email. “Anytime you want to start something, that blank page thing goes away and you start by prompting and drafting,” Nadella said. “Chat, to me, the most powerful feature is now you have the most important database in your company, which happens to be the database of your documents and communications, is now queriable by natural language in a powerful way. … Actions, one of the most used things is, here is a Word document, go create a PowerPoint. So those are the [things] that are also beginning.” As for early AI revenue and use cases, Nadella said that Microsoft’s Azure AI revenue is mostly from customer inferencing—the process of running live data through a trained AI model to make a prediction or solve a task. And even after customers build an AI workload, they will continue to optimize the workload over time, Nadella said. Nadella repeated his opinion that AI will “have a very foundational impact” on computer architecture. “Everything from power, power density to the data center design to what used to be the accelerator, now is sort of the main CPU, so to speak, or the main compute unit,” Nadella said. “And the network, the memory architecture, all of it.” He said that AI is also “redefining what … the cloud looks like both at the infrastructure level and the app model.” Hood said that Copilot revenue will show up in Microsoft’s average revenue per user (ARPU) measure rather than in seat growth. She highlighted positive activity in moving customers to more expensive product suites, which partners play a role in. “Seat growth, as we talk about, is primarily from at this point small, medium-sized businesses, and really frontline worker scenarios,” she said. “A very separate thing is being able to add ARPU. And traditionally, and again this quarter, that’s come over time from E3, and from E5. And we’re continuing to see very healthy suite momentum and … very good renewal. … You’re going to see Copilot revenue will land there as ARPU. That won’t show as seat growth. So you’ll have E3, E5 transitions, Copilot, all show up in ARPU over time.” When asked if he is looking at changing pricing for GitHub Copilot, Nadella said that he still finds Microsoft’s ARPU measure low. “Even though we’ve had a lot of success, it's not like we are a high-priced ARPU company,” he said. “I think what you’re going to start finding is—whether it’s Sales Copilot or Service Copilot or GitHub Copilot or Security Copilot—they're going to fundamentally capture some of the value they drive in terms of the productivity of the Opex. … Then even the horizontal Copilot … The Office 365 or Microsoft 365 level, even there, you can make the same argument.\" \"Whatever ARPU we may have with E5, now you can see incrementally as a percentage of the Opex, how much will you pay for a Copilot to give you more time savings, for example.” Nadella said that “all up, I do see this as a new vector for us in what I call the next phase of knowledge work and frontline work. … I never thought of the tools business as fundamentally participating in the operating expenses of a company’s spend on, let’s say, development activity. And now you’re seeing that transition. It is just not tools. It’s about the productivity of your dev team.” When asked about how Microsoft is investing so much into AI without a larger hit to margins, Hood pointed to consistent investing across the technology stack and said that Microsoft hasn’t needed to add a “material number of people to the workforce.” “Think about it as building that consistency without needing to add a lot of resources to do that,” Hood said. “It’s been a real pivot of our entire investment infrastructure to be working on this work. And I think that’s important because it means you’re shifting to an AI-first position, not just in the language we use, but in what people are working on day to day. That does, obviously, create a leverage opportunity.” On chip and data center supply, Hood said the vendor feels “really good about where we have been in terms of adding capacity.” Microsoft has built its own capacity and worked with third parties. “You started to see the acceleration in our capital expense starting almost a year ago, and you’ve seen it scale through that process,” she said. “And that is going toward, as we talked about, servers and also new data center footprints to be able to meet what we see as this demand and, really, changing demand as we look forward. … Looking forward, you’ll tend to see … accelerated capital expense to continue to be able to add capacity in the coming quarters given what we see in terms of pipeline.” Nadella also shared some product highlights showing the growth in Microsoft’s cloud, communications and security businesses Microsoft Cloud revenue for the quarter was US$33.7 billion, up 22 per cent year over year ignoring foreign exchange. Microsoft saw US$62 billion in revenue during the quarter, a 16 per cent increase year over year ignoring foreign exchange. Hood cited “strong execution by our sales teams and partners” for share gains in the quarter. Commercial bookings grew 9 per cent ignoring foreign exchange. Commercial remaining performance obligation (CRPO) increased 16 per cent to US$222 billion. About 45 per cent will be recognised in revenue in the next 12 months, up 15 per cent year over year, she said. The vendor’s operating income was US$27 billion, up 33 per cent. Net income was US$21.9 billion, up 33 per cent. The productivity and business processes segment, which includes Office Commercial, Office Consumer, LinkedIn and Dynamics, brought in US$19.2 billion for the quarter, up 12 per cent ignoring foreign exchange. Office Commercial products and cloud services revenue increased 13 per cent year over year. Office 365 Commercial revenue grew 16 per cent. Office Consumer products and cloud services revenue increased 4 per cent. And Microsoft 365 Consumer subscribers grew to 78.4 million, up 16 per cent year over year. Dynamics products and cloud services revenue increased 19 per cent year over year. Dynamics 365 revenue grew 24 per cent year over year. Microsoft’s “intelligent cloud” segment, which includes Azure, SQL Server, Windows Server, Visual Studio, Nuance, GitHub, enterprise and partner services, Microsoft Partner Network, and learning, brought in US$25.9 billion for the quarter, up 19 per cent ignoring foreign exchange rates. Server products and cloud services revenue increased 20 per cent year over year. Azure and other cloud services revenue grew 28 per cent, with 6 points of growth from AI services. “Both AI and non-AI Azure services drove our outperformance,” she said. The per-user business the Enterprise Mobility and Security installed base grew 11 per cent to more than 268 million seats. Microsoft’s “more personal computing” segment, which includes Windows OEM, devices, Xbox content and news advertising, brought in US$16.9 billion for the quarter, an increase of 18 per cent ignoring foreign exchange. Windows revenue grew 9 per cent year over year. Windows OEM revenue grew 11 per cent. Windows Commercial products and cloud services revenue grew 7 per cent. Devices revenue decreased 10 per cent. Hood said that “PC market volumes continued to stabilise at pre-pandemic levels.” Microsoft’s cash flow from operations was US$18.9 billion, up to 69 per cent and driven by strong cloud billings and collections, Hood said. Free cash flow was US$9.1 billion, up 86 per cent year over year. Microsoft’s stock traded at about US$408 a share after hours, about the same as before market close. Microsoft Cloud gross margin percentage should decrease about 1 point year over year in the third fiscal quarter, Hood said. Third-quarter cloud gross margin percentage will be about flat. Capital expenditures should “increase materially on a sequential basis, driven by investments in our cloud and AI infrastructure,” Hood said. Microsoft expects the productivity and business processes segment to see revenue of US$19.3 billion to US$19.6 billion, growth between 10 and 12 per cent year over year. Office 365 revenue growth should be about 15 per cent. The on-premises business should decline in the low 20s. Office consumer revenue should grow in the mid to high single digits. Dynamics revenue should grow in the midteens. The intelligent cloud segment should bring in revenue between US$26 billion and US$26.3 billion, up 18 per cent to 19 per cent year over year. Azure revenue growth should be stable. On-premises server business revenue should grow in the low to mid single digits. Enterprise and partner services revenue should decline about 10 per cent due to “a high prior year comparable for enterprise support services.” The more personal computing segment should see revenue of US$14.7 billion to US$15.1 billion, growth between 11 per cent and 14 per cent. Windows OEM revenue should see flat growth “as PC market unit volumes continue at pre-pandemic levels,” Hood said. Windows commercial products and cloud services revenue should grow in the midteens. Devices revenue should decline in the low double digits because Microsoft continues “to focus on our higher-margin premium products,” Hood said. "
}