{
    "title": "AI hype around ‘Magnificent 7’ stocks is latest example of ‘big market \ndelusion’",
    "date": "2/2/2024",
    "url": "https://www.marketwatch.com/story/ai-fever-fuels-big-market-delusion-that-could-leave-investors-holding-the-bag-243bc1a7",
    "text": "It’s time for tech earnings — and that means a lot of talk about the future of artificial intelligence and all the money it will make companies and their investors in the years and decades to come. It’s the sort of thing that leads to nicknames like the “Magnificent Seven,” which was popularized last year to describe the megacap tech giants — Nvidia Corp. \n        NVDA,\n        +0.12%,\n       Apple Inc. \n        AAPL,\n        -1.06%,\n       Microsoft Corp. \n        MSFT,\n        -0.17%,\n       Tesla Inc. \n        TSLA,\n        -2.25%,\n       Facebook parent Meta Platforms Inc. \n        META,\n        -1.68%\n       and Google parent Alphabet Inc. \n        GOOG,\n        +0.21%\nGOOGL,\n        +0.04%. See: Is it a bubble? ‘Magnificent 7’ market cap now equals the GDP of 11 major world cities. It’s also when expectations can become untethered from reality. Investors should beware of falling prey to the “big market delusion,” Rob Arnott, founder of quant-focused Research Affiliates, the smart beta pioneer, told MarketWatch in an interview. The term was coined by professors Brad Cornell of UCLA and Aswath Damadoran of New York University to describe a scenario in which a big, new market is taking shape around an innovation. In a 2019 paper, the pair examined how the “big market promise” affects business formation and financing, focusing on how overconfidence on the part of entrepreneurs and their financiers, including venture capitalists and public equity, creates a “collective overpricing of companies in alleged big markets.” Arnott, who co-wrote a subsequent paper with Cornell examining the phenomenon in the context of electric vehicles, said the delusion, in part, holds that the dominant players in the early stages of a new market will remain the dominant players. It also assumes that the transformation promised by the innovation will happen fast. Related: Meta just joined Nvidia and Microsoft in elite subset of the ‘Magnificent Seven’ Investors have seen this movie before. Look back to the tech bubble at the turn of the century. Qualcomm Inc. \n        QCOM,\n        +0.10%\n       shares soared nearly 27-fold in 1999, Arnott recalled. Why? “It was the narrative that these people produce the plumbing of the internet and they’re going to be huge; they have a moat; there’s nobody that can enter their business easily; they have a huge head start and it doesn’t matter what you pay because they’re going to be huge,” Arnott said. So how did that work out? Qualcomm’s profits have grown 60-fold in the last 24 years, and yet if you put $100 into Qualcomm in 2000, you would have waited 18 years to get back into the black, he said. Qualcomm delivered a cumulative return of around 224% between 2000 and 2023, according to FactSet, versus 411% for the S&P 500 \n        SPX. The exact same narrative is now being spun around AI. And that narrative is partly correct, Arnott said, in that AI will likely be transformative, as was the internet. What’s incorrect is the notion that it will happen fast and that the dominant players of today will be dominant in five or ten years. He offered up another example — the Palm Pilot. It was spun off as Palm Inc. from 3com in 2000 and briefly had a market cap that exceeded that of General Motors. Then a few years later BlackBerry came along and ate Palm Pilot’s lunch, only to be upstaged itself by the Apple \n        AAPL,\n        -1.06%\n       iPhone. “Big disrupters get disrupted,” he said. So if the narrative around AI — that it’s going to transform the economy — is true, how do investors overcome their delusions about the current players? Every technological revolution has seen benefits flow far more to customers and users than to the innovators themselves, Arnott argued. “So one way to play this would be to pose the question: what industries are likely to enjoy the greatest productivity boost from AI and will there be consolidation in those industries allowing them to see much greater profit margins.” That’s likely a smarter way to play the AI boom then banking on the current industry leaders, he said. Meanwhile, investors hyped up about the so-called Magnificent Seven companies believed to be poised to reap big windfalls from AI might want to rewatch the 1960 Western from which the cohort gets its name As Arnott notes, four of the seven are dead at the end of the movie. Read: Push for AI sovereignty will see growth of tech sectors in ‘every single country’ worldwide, Nvidia CEO Jensen Huang says Stunning first quarters aren’t that unusual for the seemingly unstoppable AI chip maker. William Watts is MarketWatch markets editor. In addition to managing markets coverage, he writes about stocks, bonds, currencies and commodities, including oil. He also writes about global macro issues and trading strategies. During his time at MarketWatch, Watts has served in key roles in the Frankfurt, London, New York and Washington, D.C., newsrooms. William Watts is MarketWatch markets editor. In addition to managing markets coverage, he writes about stocks, bonds, currencies and commodities, including oil. He also writes about global macro issues and trading strategies. During his time at MarketWatch, Watts has served in key roles in the Frankfurt, London, New York and Washington, D.C., newsrooms. Visit a quote page and your recently viewed tickers will be displayed here. "
}