{
    "title": "Microsoft inks deal with France’s Mistral AI, an OpenAI rival that has its \nown chatbot",
    "date": "2/28/2024",
    "url": "https://www.dtnext.in/technology/microsoft-inks-deal-with-frances-mistral-ai-an-openai-rival-that-has-its-own-chatbot-770811",
    "text": "MORE Representative Image (IANS) WASHINGTON: Microsoft announced an artificial intelligence partnership Monday with the French startup Mistral AI that could lessen the software giant’s reliance on ChatGPT-maker OpenAI for supplying the next wave of chatbots and other generative AI products. Mistral AI emerged less than a year ago but is already what Microsoft described Monday as an “innovator and trailblazer” at the vanguard of building more efficient and cost-effective AI systems. Microsoft and Mistral didn’t disclose the financial terms of the deal, though Microsoft said it involves a small investment in the Paris-based startup. That suggests it is far smaller than Microsoft’s investment of billions of dollars into OpenAI, a years-long relationship that has attracted the scrutiny of antitrust regulators in the U.S. and Europe. Mistral on Monday released a public test version of its own chatbot, called Le Chat, that apparently was flooded with so much interest that a company executive said it was temporarily unavailable for part of the day. The company also announced its newest large language model, Mistral Large, which it claims is in the same league as competitors such as OpenAI’s GPT-4, Anthropic’s Claude 2 and Google’s Gemini Pro and will be available on Microsoft’s Azure cloud computing platform. Mistral has also previously said it is teaming up with other big cloud providers including Amazon and Google. Mistral made a big splash by attracting big amounts of investor funding to give it a multibillion-dollar valuation just months after it was founded last spring. It was started by three French former researchers from Google and Meta: CEO Arthur Mensch, Chief Scientist Guillaume Lample and Chief Technology Officer Timothee Lacroix. It has advertised an “open-source” approach to developing AI that involves publicly releasing key components of some AI systems, in contrast to companies such as OpenAI that closely guard them. But Mistral Large, the new flagship model, won’t be open, according to the company’s website. Mistral didn’t respond to requests for comment Monday. When the European Union last fall was drafting the final version of its Artificial Intelligence Act, a comprehensive set of AI regulations, Mistral pushed back against efforts to impose restrictions on foundation models that power generative AI systems. Mensch took to social media to say the EU’s proposals for a two-tier system would discourage innovative newcomers.  © Copyright  | Powered by Hocalwire "
}