{
    "title": "Recurrent attracts Microsoft as off-taker for Louisiana solar project",
    "date": "2/7/2024",
    "url": "https://renewablesnow.com/news/recurrent-attracts-microsoft-as-off-taker-for-louisiana-solar-project-847872/",
    "text": "Utility-scale solar and energy storage firm Recurrent Energy LLC, a unit of Canadian Solar Inc (NASDAQ:CSIQ), has attracted Microsoft Corp (NASDAQ:MSFT) as an off-taker for a 127-MW DC solar site in Louisiana and secured financing for the project. Apart from having the technology giant signed up for the entire output and renewable energy credits of the future plant, Recurrent has also closed USD 160 million (EUR 148.9m) in project financing to advance work on the plant that is already under construction, according to a statement published Tuesday. Subscribe for Renewables Now's Corporate PPA Newsletter here for free! The Bayou Galion solar farm is expected to become operational this autumn. The facility is located in Morehouse Parish in Northeast Louisiana. The engineering, procurement and construction (EPC) job was assigned to Primoris Renewables Energy Inc. Recurrent, acting as an owner and operator of the site, started developing the project in 2018. It obtained approval from local authorities in May 2022 and kicked off construction work in December 2023. The project financing was arranged by Mitsubishi UFJ Financial Group Inc (MUFG). (USD 1 = EUR 0.931) Leeward, Microsoft strike PPAs for 400 MW of Texas solar Walmart commits to almost 1 GW of fresh clean energy in US EDPR NA, Volt, Microsoft partner for 110-MW solar project in Illinois Primergy secures Microsoft as off-taker of 408-MW solar park in Texas Dairy firm Saputo unveils wind VPPA with Capital Power in Alberta Enefit to enable solar power supply to Toms Group in Poland Topics Country Industry Marta is an M&A and IPO specialist with years of experience covering energy deals in the US and EU. Renewables Now is an independent one-stop shop for business news and market intelligence for the global renewable energy industry. Learn more.. Gain unlimited access to know the latest in renewable energy. "
}