{
    "title": "Microsoft Azure breach exposes critical user data in large-scale cyberattack",
    "date": "2/18/2024",
    "url": "https://www.businessupturn.com/technology/cyber-security/microsoft-azure-breach-exposes-critical-user-data-in-large-scale-cyberattack/",
    "text": "Business Upturn - News | Nation | World | External Affairs | Business | Money | Culture | Tech | Sports | Updates | Breaking Microsoft Azure suffers a major security breach, compromising hundreds of accounts, including executives. Phishing emails and cloud account takeover techniques were used to steal data, potentially for financial gain. Microsoft’s cloud service, Microsoft Azure, suffered a significant security breach exposing sensitive user data of hundreds of accounts, including those belonging to high-level executives. This attack, described as the largest in Azure’s history, highlights the evolving sophistication of cybercriminals and the ever-present threat to online security. Proofpoint, a cybersecurity company, identified the attack as utilizing a campaign previously detected in November 2023. This campaign employed a potent combination of phishing emails and cloud account takeover (CTO) techniques. Phishing emails, often disguised with seemingly innocuous anchor text like “View document,” contained malicious links redirecting users to fraudulent websites designed to harvest login credentials. Once obtained, these credentials were used to access sensitive data within OfficeHome and Microsoft 365 applications. Advertisement The meticulous planning behind the attack is evident in the targeted selection of victims. While both mid-level and senior employees were compromised, positions like sales directors, account managers, and CEOs were prioritized. This strategic approach allowed attackers to infiltrate various organizational levels, potentially granting access to a wider range of confidential information. Furthermore, the attackers employed sophisticated tactics to maintain control after compromising accounts. By deploying their own multifactor authentication (MFA) methods, such as adding alternate mobile numbers or setting up fraudulent authentication apps, they effectively prevented legitimate users from regaining access. Additionally, attackers meticulously removed any trace of their activity, further complicating detection and mitigation efforts. The primary motives behind this cyberattack are suspected to be data theft and financial fraud. While the exact perpetrators remain unidentified, initial investigations suggest potential involvement from actors based in Russia and Nigeria, based on the utilization of local fixed-line ISPs within those regions. Microsoft, currently conducting a thorough investigation into the incident, is actively notifying affected customers and taking steps to address vulnerabilities exploited in the attack. Eesha Chakraborty is a third year Mass Comm and Journalism student. Passionate about media, demonstrating strong communication and currently a news writer intern at BusinessUpturn.com Deepfakes on the rise: Cybersecurity experts warn of increased video call scams in… Chinese cyberspies deploy new malware in Ivanti VPN attacks Fake hostage site used in Israeli cyberattack US and India collaborate on first-ever cyber security initiative  What's happening Chicago Fire: Joselyn Hudon joins the cast post exit of Kara… Invasion season 3: Apple series round off casting with… Manisha Rani FINALLY explains why she unfollowed Elvish… Love Island: Ariana Madix replaces Sarah Hyland as host for… Selena Gomez to take up on apron in her Restaurant spinoff… Grey’s Anatomy star Alex Landi joins cast of Korean… Here’s why Anil Kapoor is not on talking terms with… Oppenheimer director Christopher Nolan to receive knighthood… "
}