{
    "title": "Itron Enterprise Edition Meter Data Management Now Available in the \nMicrosoft Azure Marketplace",
    "date": "2/13/2024",
    "url": "https://finance.yahoo.com/news/itron-enterprise-edition-meter-data-134500349.html",
    "text": "Microsoft Azure Customers Worldwide Now Have Access to Itron Enterprise Edition Meter Data Management LIBERTY LAKE, Wash., February 13, 2024--(BUSINESS WIRE)--Itron, Inc. (NASDAQ: ITRI), which is innovating the way utilities and cities manage energy and water, announced the availability of Itron Enterprise Edition (IEE) Meter Data Management (MDM) in the Microsoft Azure Marketplace, an online store that provides applications and services for use on Azure and simplifies the buying process for customers. Utilities can now more easily take advantage of the productive and trusted Azure cloud platform to host Itron’s market-leading data management product. IEE MDM provides utilities with a leading, future-proof solution for hosting data from its smart electric meters as well as other endpoints and sensors. Further benefits of IEE MDM including: Real-time data collection: Near real-time data is securely collected and available to the utility and end customer. With real-time data, both utilities and customers benefit from an enhanced customer experience and confidence in the quality and accuracy of the data they are viewing. IEE MDM stores and manages support of millions of electric meters in one centralized location leading to increased quality of data. Meter data quality and validation: IEE MDM uses rigorous calculations to supply accurate billing information to meet business operation needs, scaling to meet the needs of utilities both large and small. Built-in reporting and analytics: Quickly analyzes terabytes of information to find operational anomalies. Turns those analytics into actionable insights with advanced reporting options. Enhanced operational efficiencies: Reduced field costs through on-demand reading capabilities and two-way remote connect and disconnect. Improved customer satisfaction: Customers can access timely data information to help speed up and resolve customer issues quickly, helping to create streamlined energy-saving efforts. \"At Itron, we are committed to providing utilities with tools and resources they need to securely collect, store and manage near-real time data, resulting in higher data quality. With IEE MDM, customers can access timely data to drive critical business operations and analytic outcomes,\" said Don Reeves, senior vice president of Outcomes at Itron. \"IEE MDM is one of the most deployed meter data management systems in the world and we are thrilled to expand access to the data management solution in the Microsoft Azure Marketplace.\" \"Through Microsoft Azure Marketplace, customers around the world can easily find, buy, and deploy partner solutions they can trust, all certified and optimized to run on Azure,\" said Jake Zborowski, General Manager, Microsoft Azure Platform at Microsoft Corp. \"We’re happy to welcome Itron IEE MDM to the growing Azure Marketplace ecosystem.\" The Azure Marketplace is an online market for buying and selling cloud solutions certified to run on Azure. The Azure Marketplace helps connect companies seeking innovative, cloud-based solutions with partners who have developed solutions that are ready to use. About Itron Itron enables utilities and cities to safely, securely and reliably deliver critical infrastructure solutions to communities in more than 100 countries. Our portfolio of smart networks, software, services, meters and sensors helps our customers better manage electricity, gas and water resources for the people they serve. By working with our customers to ensure their success, we help improve the quality of life, ensure the safety and promote the well-being of millions of people around the globe. Itron is dedicated to creating a more resourceful world. Join us: www.itron.com. Itron® is a registered trademark of Itron, Inc. All third-party trademarks are property of their respective owners and any usage herein does not suggest or imply any relationship between Itron and the third party unless expressly stated. Additional Resources LinkedIn: www.linkedin.com/company/itroninc Twitter: https://twitter.com/ItronInc Newsroom: www.itron.com/company/newsroom Blog: https://blogs.itron.com  View source version on businesswire.com: https://www.businesswire.com/news/home/20240213070718/en/ Contacts Itron, Inc. Alison MallahanSenior Manager, Corporate Communications509-891-3802PR@Itron.com David MeansDirector, Investor Relations737-242-8448Investors@itron.com Related Quotes "
}