{
    "title": "Robotics startup Figure raises $675 million from Microsoft, Nvidia, other \nbig techs",
    "date": "2/29/2024",
    "url": "https://wkzo.com/2024/02/29/robotics-startup-figure-raises-675-million-from-microsoft-nvidia-other-big-techs/",
    "text": "(Reuters) –     Robotics startup Figure said on Thursday it had raised $675 million in an early-stage funding from investors including Nvidia, Microsoft and Amazon.com founder Jeff Bezos at a valuation of $2.6 billion. Sunnyvale, California-based Figure also signed a collaboration with OpenAI to develop generative artificial intelligence for its humanoid robots. The launch of ChatGPT by OpenAI has sparked interests in AI, with companies investing million of dollars to cash in on the trend. Other companies involved in this external round includes OpenAI Startup Fund, Amazon Industrial Innovation Fund, Parkway Venture Capital, Intel Capital, Align Ventures, and ARK Invest. “We’ve always planned to come back to robotics and we see a path with Figure to explore what humanoid robots can achieve when powered by highly capable multimodal models,” said Peter Welinder, vice president of product and partnerships at OpenAI. Bloomberg had first reported the news last week and said that Bezos had committed $100 million through his firm Explore Investments LLC and Microsoft is investing $95 million, while Nvidia and an Amazon-affiliated fund are each providing $50 million. The new capital will be used to accelerate commercial deployments efforts, Figure said, adding that it “will leverage Microsoft Azure for AI infrastructure, training, and storage.” Last month, Figure signed a partnership with BMW Manufacturing to deploy its humanoid robots in the car maker’s facility in the United States. Figure had raised $70 million from investors led by Parkway Venture Capital in its first external round last year. The private fundraising environment has been muted so far despite venture firms signing big checks for some AI start-ups. Last year, $170.6 billion was invested across venture capital deals in the United States, nearly 30% lower than the prior year, according to data from PitchBook. (Reporting by Harshita Mary Varghese in Bengaluru; Additional reporting by Niket Nishant; Editing by Maju Samuel) You must be logged in to post a comment. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}