{
    "title": "MSFT Stock Gave Reasons To Hold. Earnings Were Our Reason To Sell.",
    "date": "2/9/2024",
    "url": "https://www.investors.com/research/swing-trading/microsoft-msft-stock-swing-trade/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     With the market giving fewer chances for entries, we were a little hesitant to take our profits as quickly on Microsoft. Microsoft (MSFT) overtook Apple (AAPL) to become the most valuable company in the world with a market cap over $3 trillion. And with the biggest gains coming from the biggest companies, we couldn't ignore the swing trading opportunity in MSFT stock. Here's why we bought it and why we were a little slower to sell it on the way up. After nearly a 25% move from its September bottom, Microsoft put in a near-term peak at the end of November (1). But it didn't give up much ground after that. Instead it formed a flat base over the next few weeks with a depth of just 6%. That pause allowed the 50-day moving average line to catch up to Microsoft's price as it just grazed the line in the brief pullback that started the year (2). Once Microsoft cleared the near-term resistance, we added it to SwingTrader (3). A slight flaw was a lagging relative strength line. But since the base formed while the market had a strong December, it was forgivable. Thomas Carr (aka Dr. Stoxx) gets philosophical in this week's podcast as he searches for \"the truth\" in the stock market. When Microsoft took out its November peak, we locked in one third of the position with a 2.5% gain (4). Normally we continue to take off a third at a time as a stock progresses but we've slowed that down in this rally. Given how hard it is to sometimes get that exposure back as stocks get extended, we've been letting more and more stocks run. That was an easy call with Microsoft as it found support at its short-term 5-day moving average line on its climb higher (5). So why did we eventually sell? The day Microsoft was due to report earnings, it crossed 410 then started to lose steam (6). The reality is as a general swing trading rule, we don't hold through earnings. The big moves and binary nature of earnings reactions make them problematic for keeping losses small and taking gains quickly. So the stock was due to come off anyway. The reversal just made the decision easier. After Microsoft announced earnings, the stock came down below its 5- and 10-day lines as it dropped 2.7% and closed at its lows (7). The beat on earnings didn't excite investors as much as the weaker-than-expected guidance concerned them. Admittedly, given the recent gains, it wasn't a difficult hold as a position trade. But as a swing trade, the short-term average line breaches would have most likely just gotten us a worse price. But the stock isn't really broken which makes it worth keeping on the radar. It held above its 21-day moving average line and just this week set up to take out its all-time highs (8). Missing out on earnings moves has been a challenge of this rally but we aren't prevented from taking advantage of another potential move in Microsoft. More details on past trades are accessible to subscribers and trialists to SwingTrader. Free trials are available. Follow Nielsen on X, formerly known as Twitter, at @IBD_JNielsen. YOU MAY ALSO LIKE: Swing Trading Strategy Basics History In \"The Stock Trader's Almanac\" Is Laying Out A Bullish Case Being On The Right Side Of Market Breadth Mark Minervini Gives His Outlook For 2024 MarketSmith: Research, Charts, Data And Coaching All In One Place 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}