{
    "title": null,
    "date": "2/11/2024",
    "url": "https://www.indiaherald.com/Technology/Read/994677497/Tech-Titans-Microsoft-Surpasses-Apple",
    "text": "Microsoft's market capitalization surged to $3.125 trillion, surpassing Apple's $2.916 trillion, making it the first American company to achieve a $3.1 trillion market cap. This milestone was reached as Microsoft's shares soared, closing at $420.55 on Friday. The previous record was held by Apple, which achieved a market cap of $3.09 trillion in July. Microsoft's robust performance is attributed to its substantial profits in the field of Artificial Intelligence (AI), particularly from its collaboration with Open AI.  The partnership with Open AI has proven highly beneficial for both microsoft and Apple. The widespread popularity of Open AI's Chat GPT has generated significant enthusiasm for AI applications, prompting increased investments in microsoft stocks. Microsoft's stock has witnessed an impressive growth of nearly 60% over the last 12 months.  Microsoft CEO satya Nadella, who recently completed his 10th year at the helm, emphasized the company's transition from discussing AI to actively implementing it. He highlighted the tangible benefits derived from gaining new customers through AI initiatives. Nadella's strategic focus on cloud computing and artificial intelligence has steered microsoft in a new direction, contributing to its remarkable success in the tech industry. Since assuming leadership in 2014, Nadella has played a pivotal role in reshaping Microsoft's trajectory and driving innovation in emerging technologies. Empowering 140+ Indians within and abroad with entertainment, infotainment, credible, independent, issue based journalism oriented latest updates on politics, movies.\n\nIndia Herald Group of Publishers P LIMITED is MediaTech division of prestigious Kotii Group of Technological Ventures R&D P LIMITED, Which is core purposed to be empowering 760+ crore people across 230+ countries of this wonderful world.\n\n\nIndia Herald Group of Publishers P LIMITED is New Generation Online Media Group, which brings wealthy knowledge of information from PRINT media and Candid yet Fluid presentation from electronic media together into digital media space for our users.\n \nWith the help of dedicated journalists team of about 450+ years experience; India Herald Group of Publishers Private LIMITED is the first and only true digital online publishing media groups to have such a dedicated team. Dream of empowering over 1300 million Indians across the world to stay connected with their mother land [from Web, Phone, Tablet and other Smart devices] multiplies India Herald Group of Publishers Private LIMITED team energy to bring the best into all our media initiatives such as https://www.indiaherald.com "
}