{
    "title": "Better Tech Stock: Microsoft vs. Apple",
    "date": "2/22/2024",
    "url": "https://www.fool.com/investing/2024/02/22/better-tech-stock-microsoft-vs-apple/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Wall Street is particularly bullish about tech stocks now. Excitement about budding markets like artificial intelligence (AI) and easing inflation sent the Nasdaq-100 Technology Sector index up 47% since last February. As the world's two most valuable companies and leaders in tech, Microsoft (MSFT -0.17%) and Apple (AAPL -1.06%) have seen their shares rise 54% and 18% during the period. These companies are some of the most attractive ways to invest in the industry, with one a king in productivity software and the other leading the consumer tech market. Microsoft and Apple have long histories of delivering consistent stock growth, and that looks unlikely to change. Over the last year, Microsoft emerged as one of the biggest names in AI. Meanwhile, Apple is home to a highly profitable services business and is gaining market share in the virtual reality/augmented reality (VR/AR) industry. So, let's examine these businesses and determine whether Microsoft or Apple is the better tech stock this February. In January, Microsoft overtook Apple as the world's most valuable company, with its market cap at just over $3 trillion. The company is a tech behemoth with positions in multiple areas of the industry, leading in productivity software, game consoles, cloud computing, and operating systems. Its diverse business model allows it to profit from tailwinds across tech, making its stock an exceptionally reliable option. Since 2019, Microsoft's annual revenue climbed 68%, with operating income up 106%. Additionally, its free cash flow jumped 76% to $67 billion. The company has significant cash reserves, allowing it to keep investing in its business and retain its prominent role in tech. Microsoft became a leader in AI after sinking billions into ChatGPT developer OpenAI. The partnership granted Microsoft access to some of the sector's most advanced AI models, which it used to carve out a lucrative position in the budding industry. The AI market is projected to expand at a compound annual growth rate (CAGR) of 37% through 2030, which would see it hit nearly $2 trillion before the end of the decade. Meanwhile, Microsoft used OpenAI's technology to introduce AI features across its product lineup. In 2023, Microsoft added new AI tools to its Azure cloud platform, integrated aspects of ChatGPT into its Bing search engine, and boosted productivity in its Office software suite with the help of AI. Apple hasn't had it as easy as Microsoft in the last year. In 2023, macroeconomic headwinds caught up with the company, leading to four consecutive quarters of revenue declines. The streak was finally broken in Apple's latest quarter, with revenue rising 2% year over year to $120 billion in the first quarter of 2024. The company beat Wall Street forecasts by more than $1 billion. However, outperforming estimates wasn't enough to quell investor concern over its iPhone business, with its stock down nearly 6% year to date. Smartphone sales rose 6% in Q1 2024, yet fell 13% in China. The country has increased restrictions on the iPhone, threatening business from Apple's third-largest market. As a result, it's promising that the company is expanding its product lineup and prioritizing digital markets like services to lean less on iPhone sales over the long term. The company released the Vision Pro, its first VR/AR headset, earlier this year. Launching at $3,499, the new device created significant hype for the technology. If the company employs a similar pricing strategy to that used with past products and brings down the cost with subsequent generations, an investment in Apple could be an investment in the future leader of the VR/AR market. The VR market alone is expected to grow at a CAGR of 31% until at least 2030. It could be smart to invest in the tech giant at the very start of its journey into the industry. Alongside free cash flow that hit $107 billion last year, Apple has the funds to overcome current headwinds and keep investing in high-growth areas of tech. Microsoft and Apple have exciting long-term outlooks, with opportunities to profit from multiple subsectors of tech. However, Microsoft's more significant priority on digital markets like cloud computing and AI makes it less vulnerable to macroeconomic headwinds and potentially the more reliable buy. Meanwhile, earnings-per-share estimates indicate Microsoft has more growth potential than Apple in the near term.  Data by YCharts Microsoft's earnings could hit just under $16 per share, while Apple's may reach nearly $8 per share in the next two fiscal years. Multiplying those figures by the companies' forward price-to-earnings ratios (Microsoft's 35 and Apple's 28) yields a stock price of $546 for Microsoft and $218 for Apple. Looking at their current positions, these projections would see Microsoft's stock rise by 35% and Apple's increase by 20% by fiscal 2026. If these projections are correct, Microsoft has significantly more room to run and is the better tech stock to buy this month. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}