{
    "title": "Microsoft workers demand it drop $480 million U.S. Army contract",
    "date": "3/27/2024",
    "url": "https://ca.style.yahoo.com/style/microsoft-workers-demand-drop-480-million-u-army-015019203--finance.html",
    "text": "We've rounded up the best deals from Amazon, Walmart, Best Buy, Coach Outlet & more. By Paresh Dave SAN FRANCISCO (Reuters) - Some Microsoft Corp employees on Friday demanded that the company cancel a $480 million (368 million pounds) hardware contract to supply the U.S. Army, with 94 workers signing a petition calling on the company to stop developing \"any and all weapons technologies.\" The organising effort, described to Reuters by three Microsoft workers, offers the latest example in the last year of tech employees protesting cooperation with governments on emerging technologies. Microsoft won a contract in November to supply the Army with at least 2,500 prototypes of augmented reality headsets, which digitally display contextual information in front of a user's eyes. The government has said the devices would be used on the battlefield and in training to improve soldiers \"lethality, mobility and situational awareness.\" In the petition to Microsoft executives, posted on Twitter, the workers said they \"did not sign up to develop weapons, and we demand a say in how our work is used.\" They called on the company to develop \"a public-facing acceptable use policy\" for its technology and an external review board to publicly enforce it. Microsoft said in a statement that it always appreciates employee feedback. It also referred to an October blog post by its president, Brad Smith, in which he said the company remained committed to assisting the military and would advocate for laws to ensure responsible use of new technologies. The U.S. Army did not provide immediate comment. Shares of Microsoft fell 7 cents to $110.90 after hours on Friday. Though many governments want to draw upon the expertise of the biggest U.S. tech companies, employee resistance has added a new challenge to already complicated relationships. Worker pushback led Alphabet Inc last year to announce it would not renew a Pentagon contract in which its artificial intelligence technology is used to analyse drone imagery. In other cases, employee criticism has invited greater public scrutiny to deals, such as $10 billion cloud computing contract yet to be awarded and various contracts with U.S. Immigration and Customs Enforcement. One Microsoft worker, speaking on condition of anonymity, said it was unclear whether any of the lead petitioners' work was part of the Army contract. Another said several organizers work in the company's cloud computing division, which is competing with rivals Google Cloud and Amazon Web Services to gain more government work. Microsoft is expected unveil updates to HoloLens, its headset for businesses and governments, during an event at the Mobile World Congress industry conference in Barcelona on Sunday. (Reporting by Paresh Dave; Editing by Richard Chang and Cynthia Osterman) \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th  This food habit is linked to a specific type of dementia. \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. 護脊承托，透氣舒適，免費送貨，100%退款保證 Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... Seven reportedly cost $20 million Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story.  \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. They soft-launched their relationship at the supermodel's cookbook event in Miami.  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The \"Late Night\" comedian brutally summed up the former president's media company.  Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha Meghan Markle is reportedly anxious about returning to England with Prince Harry in May for the 10-year anniversary of the Invictus Games. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. "
}