{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.kenyans.co.ke/news/98680-kenyan-woman-narrates-journey-homelessness-career-microsoft",
    "text": "Like many Kenyans living abroad, Joanne is a good example of a case of ‘from grass to grace’ following her life spanning from working in a warehouse in the Dandora area in Nairobi to earning six figures in big corporate companies in the United States. Born and raised in Kenya, Joanne, in search of greener pastures, moved to the US at a tender age, where she thrived and created her dream life for herself and her family. Narrating the challenges experienced while working in Kenya, Joanne recalled having to quit her job at a warehouse in Dandora, citing hardships and mental exhaustion. Following her resignation, Joanne was left homeless as she could not afford to rent a house, which forced her to sleep on couches for months, moving from one friend’s house to another. “I was homeless, so I was moving from house to house. It’s people’s couches so you can’t stay for long, you can only stay for some time. The struggle was real,” she stated. Joanne then decided to move to the United States and start a life. Her efforts were however deterred after her visa application was rejected several times by the Embassy. Upon successfully getting all the requirements in place, she relocated to America. Like any other foreigner, she struggles with cultural adaptation and finding a job to sustain herself, forcing her to live with friends. Finally, things took a better turn after a friend invited her to attend the National Black MBA Conference in Philadelphia, USA. “She was like, there is a career fair that is happening in Philadephia, it’s the National MBA conference, and I need you to go,” she stated. “When I got there I was shocked to see Havard, Yale and other top schools on people’s badges, and I’m looking at my tag shaking my head. I see all these companies on display, from Microsoft to Apple, and there to recruit,” she added. Marking the beginning of her successful journey, Joanne was lucky to receive five offers from Microsoft to Apple, among other companies. “They flew me out to Houston Texas, put me in one of the most expensive hotels, showed me around the campus, and I was like, wow, I want to work here,” she recalled after landing a job at ExxonMobil. She later moved to work for Microsoft Corporation. "
}