{
    "title": "Microsoft report says UK is not prepared for the age of AI — barely any \nbusinesses are 'resilient' to cybercrime",
    "date": "3/17/2024",
    "url": "https://www.techradar.com/pro/microsoft-report-says-uk-is-not-prepared-for-the-age-of-ai-barely-any-businesses-are-resilient-to-cybercrime",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. UK has a long but promising road towards becoming an 'AI superpower', Microsoft report says New research has found that 87% of UK businesses are unprepared for the age of AI due to their vulnerability to cyberattacks. A report from Microsoft found just 13% of UK businesses can be described as ‘resilient’ to cybercrime, putting over three quarters of firms at a higher risk of crippling and costly ransomware attacks. Investments made into integrating AI into cyber defences could contribute £52 billion back into the UK economy due to the increased resilience AI can provide. The UK has some significant hurdles to overcome if the government is to meet its commitment to become a ‘global AI superpower’ within 10 years, as the Department for Digital, Culture, Media & Sport intends. Microsoft's research found thousands of businesses in the UK could be susceptible to a devastating cyberattack, with 48% ranked as ‘vulnerable’ while a further 39% are ranked as ‘at high risk’. Therefore, businesses need to do more to integrate AI into their cyber defences in order to ‘fight fire with fire’, as hackers increasingly turn to AI in order to boost both the quality and quantity of their attacks. The research was conducted by Dr Chris Brauer of the University of London in collaboration with Microsoft, and surveyed over 1,000 cybersecurity experts, employees, and senior leaders of private and public sector organisations. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Britain currently sits at the top in the global rankings of cybersecurity, but much more needs to be done to secure businesses, and the potential £52 billion annual dividend that could massively benefit the UK economy. In order to get there though, 69% of those surveyed believe that in order to become an ‘AI superpower’, Britain also needs to bolster its defenses to meet this goal. Effectively, an AI superpower must also be a cybersecurity superpower. “Cyber criminals, some armed with the resources of a nation state, are ‘tooling up’ with AI to increase the sophistication and intensity of their attacks,” said Paul Kelly, Director of the Security Business Group at Microsoft UK. “This research outlines 52 billion reasons for organisational leaders to ‘fight fire with fire’.” “The same AI technologies can help leaders better secure their organisation and tip the balance back in their favour. AI has the potential to make your business and data more secure, but also, if a cyberattack were to occur, to lessen the impact on your bottom line.” Alongside the research, the report also provides five opportunities for the UK to meet the goal of becoming both an AI and cybersecurity superpower: Benedict Collins is a Staff Writer at TechRadar Pro covering privacy and security. Before settling into journalism he worked as a Livestream Production Manager, covering games in the National Ice Hockey League for 5 years and contributing heavily to the advancement of livestreaming within the league. Benedict is mainly focused on security issues such as phishing, malware, and cyber criminal activity, but he also likes to draw on his knowledge of geopolitics and international relations to understand the motives and consequences of state-sponsored cyber attacks.  He has a MA in Security, Intelligence and Diplomacy, alongside a BA in Politics with Journalism, both from the University of Buckingham. His masters dissertation, titled 'Arms sales as a foreign policy tool,' argues that the export of weapon systems has been an integral part of the diplomatic toolkit used by the US, Russia and China since 1945. Benedict has also written about NATO's role in the era of hybrid warfare, the influence of interest groups on US foreign policy, and how reputational insecurity can contribute to the misuse of intelligence.  Outside of work Ben follows many sports; most notably ice hockey and rugby. When not running or climbing, Ben can most often be found deep in the shrubbery of a pub garden. 'Wean itself off Nvidia': Samsung signs $750 million agreement with South Korea's largest online platform — Naver wants to replace Nvidia's super expensive AI GPU with the more affordable Mach-1 chip SMBs believe AI is going to give them the edge when it comes to success Gemini Nano will indeed roll out to Pixel 8 despite claims of \"hardware limitations\" By Sead FadilpašićMarch 28, 2024 By James IdeMarch 28, 2024 By Mackenzie FrazierMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Craig HaleMarch 28, 2024 By Darren AllanMarch 28, 2024 By Nigel PowellMarch 28, 2024 By Steve ClarkMarch 28, 2024 By Jody BaileyMarch 28, 2024 By Craig HaleMarch 28, 2024 By Benedict CollinsMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}