{
    "title": "Microsoft, OpenAI partner on $100 billion Stargate AI supercomputer project",
    "date": "3/29/2024",
    "url": "https://www.firstpost.com/world/microsoft-and-openai-partner-on-100-billion-stargate-ai-supercomputer-project-13754269.html",
    "text": "Sources familiar with private discussions surrounding the proposal have revealed that Microsoft is likely to spearhead the project’s financing. The anticipated cost highlights the ambitious nature of the endeavor Microsoft and OpenAI have announced plans for a groundbreaking data center initiative, anticipated to cost up to $100 billion. The project includes the development of an artificial intelligence supercomputer named “Stargate,” slated for launch in 2028, as reported by The Information. OpenAI has yet to provide a comment regarding the project. The surge in demand for AI data centers, driven by the rapid adoption of generative artificial intelligence technology, underscores the need for infrastructure capable of handling advanced tasks beyond the capacities of conventional data centers. Sources familiar with private discussions surrounding the proposal have revealed that Microsoft is likely to spearhead the project’s financing. The anticipated cost, which surpasses that of many existing data centers by a factor of 100, underscores the ambitious nature of the endeavor, according to insiders cited by The Information. The envisioned supercomputer, to be situated in the United States, represents the flagship of a series of ambitious ventures planned by the collaborative efforts of Microsoft and OpenAI over the next six years, the report details. While The Information attributes the estimated $100 billion cost to sources close to discussions with Sam Altman, as well as individuals privy to Microsoft’s initial cost assessments, the identities of these sources remain undisclosed. Altman and Microsoft have spread the supercomputers across five phases, with Stargate as the fifth phase. Microsoft is working on a smaller, fourth-phase supercomputer for OpenAI to be launched around 2026, according to the report. Microsoft and OpenAI are in the middle of the third phase of the five-phase plan, with a significant portion of the cost for the next two phases involving acquiring the needed AI chips, the report said. AI chips are often sold at high prices. Chip company Nvidia CEO Jensen Huang told CNBC earlier in March that the latest “Blackwell” B200 artificial intelligence chip will be priced between $30,000 and $40,000. Microsoft had also announced a duo of custom-designed computing chips in November last year. The report said the new project would be designed to work with chips from different suppliers. “We are always planning for the next generation of infrastructure innovations needed to continue pushing the frontier of AI capability,” a Microsoft spokesperson said in an emailed statement to Reuters. The spokesperson did not comment directly on the report about the planned launch of the Stargate supercomputer. Expenses for the plan could exceed $115 billion, more than triple Microsoft’s expenditure last year on capital spending for servers, buildings and other equipment, the report stated. With inputs from Reuters Find us on YouTube Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}