{
    "title": "Deutsche Bank AG Purchases 228,102 Shares of ICL Group Ltd (NYSE:ICL)",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-icl-sec-filing-2024-03-21/",
    "text": "Deutsche Bank AG raised its stake in shares of ICL Group Ltd (NYSE:ICL - Free Report) by 15.0% in the third quarter, according to the company in its most recent disclosure with the SEC. The firm owned 1,745,596 shares of the basic materials company's stock after acquiring an additional 228,102 shares during the quarter. Deutsche Bank AG owned approximately 0.14% of ICL Group worth $9,688,000 as of its most recent filing with the SEC. A number of other hedge funds and other institutional investors also recently made changes to their positions in ICL. Advisor Group Holdings Inc. raised its holdings in shares of ICL Group by 1,091.3% in the first quarter. Advisor Group Holdings Inc. now owns 3,002 shares of the basic materials company's stock valued at $36,000 after buying an additional 2,750 shares during the last quarter. Ronald Blue Trust Inc. raised its holdings in ICL Group by 82.4% during the 3rd quarter. Ronald Blue Trust Inc. now owns 7,661 shares of the basic materials company's stock worth $42,000 after purchasing an additional 3,460 shares during the last quarter. Lazard Asset Management LLC bought a new stake in ICL Group during the 4th quarter worth about $58,000. AXQ Capital LP bought a new stake in ICL Group during the 2nd quarter worth about $61,000. Finally, Two Sigma Securities LLC bought a new stake in ICL Group during the 2nd quarter worth about $61,000. 14.54% of the stock is owned by institutional investors. Several analysts have weighed in on the company. Barclays boosted their price objective on ICL Group from $4.00 to $4.50 and gave the stock an \"underweight\" rating in a report on Friday, March 1st. TheStreet cut ICL Group from a \"b-\" rating to a \"c+\" rating in a report on Tuesday, January 2nd. One investment analyst has rated the stock with a sell rating, two have assigned a hold rating and one has issued a buy rating to the company. According to MarketBeat, ICL Group presently has a consensus rating of \"Hold\" and an average target price of $5.75. Check Out Our Latest Stock Report on ICL Shares of ICL Group stock traded up $0.12 during trading on Thursday, hitting $5.39. 1,012,705 shares of the company were exchanged, compared to its average volume of 936,964. The firm has a market capitalization of $7.08 billion, a P/E ratio of 10.56, a price-to-earnings-growth ratio of 9.03 and a beta of 1.22. ICL Group Ltd has a 1-year low of $4.30 and a 1-year high of $7.05. The firm's fifty day moving average price is $4.87 and its 200 day moving average price is $5.09. The company has a debt-to-equity ratio of 0.30, a current ratio of 1.53 and a quick ratio of 0.88. The business also recently announced a quarterly dividend, which will be paid on Tuesday, March 26th. Stockholders of record on Thursday, March 14th will be given a dividend of $0.0476 per share. This is a positive change from ICL Group's previous quarterly dividend of $0.04. This represents a $0.19 annualized dividend and a dividend yield of 3.54%. The ex-dividend date is Wednesday, March 13th. ICL Group's payout ratio is presently 37.26%. ICL Group Ltd, together with its subsidiaries, operates as a specialty minerals and chemicals company worldwide. It operates in four segments: Industrial Products, Potash, Phosphate Solutions, and Growing Solutions. The Industrial Products segment produces bromine out of a solution that is a by-product of the potash production process, as well as bromine-based compounds; produces various grades of potash, salt, magnesium chloride, and magnesia products; and produces and markets phosphorous-based flame retardants and other phosphorus-based products.Featured ArticlesFive stocks we like better than ICL GroupWhy Are Stock Sectors Important to Successful Investing?Google and Meta Circling the Market on a TikTok Ban RallyTrading Stocks: RSI and Why it's UsefulIntuitive Machines: Charting a Course Among the Stars10 Best Airline Stocks to BuyKB Home’s Stock Price Can Move Higher, Here’s Why  Before you consider ICL Group, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and ICL Group wasn't on the list. While ICL Group currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering when you'll finally be able to invest in SpaceX, StarLink, or The Boring Company? Click the link below to learn when Elon Musk will let these companies finally IPO. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}