{
    "title": "Microsoft confirms Surface and Windows AI presentation — on March 21",
    "date": "3/7/2024",
    "url": "https://itc.ua/en/news/microsoft-confirms-surface-and-windows-ai-presentation-on-march-21/",
    "text": "Home - News - Microsoft confirms Surface and Windows AI presentation — on March 21 Yurii Oros News writer  Microsoft has announced an online presentation of Surface, Windows, and Copilot that will take place in two weeks. The event New era of work will take place on March 21. It is aimed at Microsoft business customers and will feature new devices Surface Pro 10 and Surface Laptop 6 for business, as we reported earlier this week, with a focus on the upcoming AI improvements in Windows 11. The commercial versions of Surface Pro 10 and Surface Laptop 6 will differ in minor specifications. Microsoft will also offer consumers an OLED display on the Surface Pro 10, which the company is expected to reveal later this spring, reports The Verge. The new Surface Laptop 6 could be the most interesting device yet, thanks to a new design that reportedly includes thinner display bezels, rounded corners, a haptic touchpad, and two USB-C and one USB-A ports. Microsoft is rumored to be shipping Intel Core Ultra and Snapdragon X Elite-based Surface models, with the Intel-based models expected in April and the Arm —-based models in June. Microsoft’s March event page reads: Moving to a new era with Copilot\nHere’s the latest on how to scale AI in your environment with Copilot, Windows, and Surface.  Microsoft is also working on a new AI Explorer for Windows 11, which should be a more advanced version of the AI assistant. It may be announced on March 21. X Twitter allows adult communities OpenAI has introduced Voice Engine, a model of voice generation based on the — pattern, which turns out to have already been heard by mass users Down with piracy. Ukraine joins WIPO ALERT and launches blacklist of infringing websites Huawei earned $97.48 billion in revenue and $12.05 billion in profit as the business recovers from 2019 US sanctions XDefiant delays – leaders from The Boys Club created a toxic team atmosphere and development crises Server support SEO partner Spelling error report The following text will be sent to our editors: "
}