{
    "title": "Acme United Co. Declares Quarterly Dividend of $0.15 (NYSE:ACU)",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-acu-dividend-announcement-2024-03-18/",
    "text": "Acme United Co. (NYSE:ACU - Get Free Report) announced a quarterly dividend on Monday, March 18th, Wall Street Journal reports. Investors of record on Thursday, March 28th will be paid a dividend of 0.15 per share on Friday, April 19th. This represents a $0.60 annualized dividend and a dividend yield of 1.51%. The ex-dividend date is Wednesday, March 27th. Acme United has raised its dividend payment by an average of 5.3% annually over the last three years and has increased its dividend every year for the last 2 years. Shares of Acme United stock traded down $1.90 on Monday, hitting $39.86. 25,085 shares of the company's stock traded hands, compared to its average volume of 24,660. The company has a fifty day moving average of $45.82 and a two-hundred day moving average of $38.14. The company has a market capitalization of $145.49 million, a price-to-earnings ratio of 8.50 and a beta of 0.74. The company has a debt-to-equity ratio of 0.24, a current ratio of 3.54 and a quick ratio of 1.41. Acme United has a one year low of $22.50 and a one year high of $50.99. Acme United (NYSE:ACU - Get Free Report) last announced its quarterly earnings results on Friday, March 1st. The company reported $0.40 earnings per share (EPS) for the quarter, missing the consensus estimate of $0.55 by ($0.15). The firm had revenue of $41.94 million during the quarter. Acme United had a return on equity of 9.38% and a net margin of 9.29%. Separately, TheStreet raised Acme United from a \"c+\" rating to a \"b\" rating in a research report on Wednesday, February 14th. Read Our Latest Analysis on Acme United A number of large investors have recently made changes to their positions in ACU. Acadian Asset Management LLC boosted its stake in Acme United by 7.5% during the first quarter. Acadian Asset Management LLC now owns 19,874 shares of the company's stock valued at $669,000 after buying an additional 1,381 shares during the period. State Street Corp boosted its stake in Acme United by 16.6% during the first quarter. State Street Corp now owns 8,195 shares of the company's stock valued at $278,000 after buying an additional 1,165 shares during the period. Envestnet Asset Management Inc. bought a new stake in Acme United during the second quarter valued at $205,000. UBS Group AG purchased a new stake in Acme United during the third quarter valued at about $34,000. Finally, Dimensional Fund Advisors LP raised its position in Acme United by 0.9% during the third quarter. Dimensional Fund Advisors LP now owns 178,953 shares of the company's stock valued at $4,119,000 after purchasing an additional 1,637 shares in the last quarter. 61.68% of the stock is owned by institutional investors. Acme United Corporation supplies first aid and safety, cutting, sharpening, and measuring products to the school, home, office, hardware, sporting goods, and industrial markets in the United States, Canada, Europe, and internationally. The company offers scissors, shears, knives, rulers, pencil sharpeners, paper trimmers, safety cutters, lettering products, glue guns, and other craft products under the Westcott brand name; and cutting tools under the Clauss brand.Featured StoriesFive stocks we like better than Acme UnitedInvesting in Commodities: What Are They? How to Invest in ThemWalmart: Here’s Your Chance to Get in Cheaper in 2024How to Use the MarketBeat Excel Dividend CalculatorInsider Selling of Amazon Spikes in Q1, but it's Not Time to SellLow PE Growth Stocks: Unlocking Investment Opportunities2 Deep Value, High Yield Stocks With a Double-Digit Upside  Before you consider Acme United, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Acme United wasn't on the list. While Acme United currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of seven stocks and why their long-term outlooks are very promising. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}