{
    "title": "Climate Fund Managers and Microsoft invest $18 million in Konexa to launch \nNigeria?s first private renewable energy ...",
    "date": "3/11/2024",
    "url": "https://www.renewableenergymagazine.com/miscellaneous/climate-fund-managers-and-microsoft-invest-18-20240311",
    "text": "The investment has been made by climate-centric blended finance fund manager Climate Fund Managers (CFM) and Microsoft’s Climate Innovation Fund. Nigeria Breweries aims to supply 100 percent green energy for two of its breweries. Konexa is one of the few companies to have been awarded a private energy trading license in Nigeria. The license, which was awarded by the NERC (Nigerian Energy Regulatory Commission) in June 2022 allows Konexa to source renewable power from IPPs, transport it across the national grid and sell it to private clients at a competitive price. Transactions will be facilitated via a new electricity trading platform, enhancing energy reliability and sustainability for off-takers and contributing to the overall resilience and efficiency of the national grid. The investment will help to establish the trading platform and facilitate the transmission of renewable energy from the 30 MW Gurara Hydro Power Plant in Kaduna State, Northern Nigeria, to two of Nigerian Breweries’ Kaduna facilities. Currently off-grid and powered by fossil fuels, both breweries will transition to receiving 100 percent of their electricity needs from the hydro energy source, operated by North South Power Company Limited. The investment by CFM and Microsoft’s Climate Innovation Fund will support the construction of facilities and the deployment of a Battery Energy Storage Solution (BESS) to connect Nigerian Breweries PLC into the grid supplied by renewable energy from the Gurara Plant. With an annual supply of 20.5 GWh, the Project will displace 8,104 tons of CO2 equivalent emissions per year, the equivalent of taking 1,800 cars off the road. CFM invested via its Climate Investor One (CIO) fund; an EU-supported blended finance facility focused on renewable energy infrastructure in emerging markets. The funding, which was facilitated via CIO’s Construction Equity Fund, was provided by the European Commission. CIO’s Development Fund, in which the European Commission is an investor, provided development funding. CFM supported on the technical, financial and ESG aspects of the project development; helping to achieve financial close within just 14 months. “We are honoured to have been awarded one of the first trading licenses for renewable energy in Nigeria and to be launching our trading platform with the invaluable support of CFM and Microsoft’s Climate Innovation Fund” said Pradeep Pursnani, CEO of Konexa. “CFM’s expertise in developing, financing and structuring renewable energy infrastructure has been instrumental in shaping the project's success, and Microsoft's commitment to innovation aligns seamlessly with our vision. The platform will enable us to integrate sustainable energy sources into the grid while helping decarbonize the hard-to-abate commercial and industrial sector.” Darron Johnson, Regional Head of Investments Africa at CFM added that, historically, Nigeria has suffered from under-investment in its grid infrastructure, particularly when it comes to the distribution grid. “Konexa’s trading platform will play a pivotal role in bridging this gap by efficiently connecting third party, and, in future, its own renewable energy generation to C&I customers, helping them achieve reliable, cost-effective and sustainable energy independence while strengthening and enhancing the sustainability of the national grid” said Mr Johnson. Through Konexa’s community development programme, two villages in the Kudana region have been connected to electricity. The villages of Chikaji Gwari and Chikaji Tsakiya, which have a population of around 1,200 received 200 new connections and the introduction of solar appliances, facilitated by a financing scheme. Additionally, a savings scheme was established to improve asset ownership and credit access. A program including training initiatives for farming and women's income-generating activities will help to diversify the community’s earnings beyond agriculture. CFM previously invested in Konexa’s project to transition drone company Zipline’s Kaduna State operations to 100 percent solar power; with funding also provided by the European Commission via CIO. For additional information: Konexa Climate Fund Managers (CFM) "
}