{
    "title": "Allianz Technology Trust (LON:ATT) Sets New 52-Week High at $271.25",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/lon-att-52-week-high-2024-03-19/",
    "text": "Allianz Technology Trust (LON:ATT - Get Free Report)'s share price hit a new 52-week high on Tuesday . The stock traded as high as GBX 271.25 ($3.45) and last traded at GBX 340 ($4.33), with a volume of 1062121 shares. The stock had previously closed at GBX 343.50 ($4.37). The company has a market cap of £1.17 billion, a price-to-earnings ratio of 320.75 and a beta of 0.59. The stock has a 50 day simple moving average of GBX 330.40 and a two-hundred day simple moving average of GBX 293.74. In other news, insider Neeta Patel bought 5,137 shares of the firm's stock in a transaction that occurred on Tuesday, January 16th. The shares were purchased at an average price of GBX 302 ($3.84) per share, with a total value of £15,513.74 ($19,750.15). In related news, insider Ekaterina (Katya) Thomson purchased 5,000 shares of Allianz Technology Trust stock in a transaction on Friday, January 26th. The shares were bought at an average price of GBX 322 ($4.10) per share, with a total value of £16,100 ($20,496.50). Also, insider Neeta Patel acquired 5,137 shares of Allianz Technology Trust stock in a transaction dated Tuesday, January 16th. The stock was purchased at an average price of GBX 302 ($3.84) per share, for a total transaction of £15,513.74 ($19,750.15). Over the last three months, insiders have acquired 13,486 shares of company stock worth $4,156,027. Insiders own 2.01% of the company's stock. Allianz Technology Trust PLC is a closed-ended equity mutual fund launched and managed by Allianz Global Investors GmbH. The fund invests in the public equity markets across the globe. It invests in stocks of companies operating in the technology, media, and telecoms sector. The fund invests in stocks of mid-cap and large-cap companies.Recommended StoriesFive stocks we like better than Allianz Technology TrustPros And Cons Of Monthly Dividend StocksGrowing Twice as Fast as Tesla, XPeng is a BuyHow to Invest in Insurance Companies: A Guide 4 Stocks Building Long-Term Value for Shareholders Most Volatile Stocks, What Investors Need to KnowFedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount Before you consider Allianz Technology Trust, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Allianz Technology Trust wasn't on the list. While Allianz Technology Trust currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Do you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}