{
    "title": "Microsoft cloud, on-premise price hikes could boost revenue: Wells Fargo",
    "date": "3/13/2024",
    "url": "https://seekingalpha.com/news/4078819-microsoft-rolls-out-global-price-hikes-for-cloud-on-premise-products",
    "text": "David Ramos/Getty Images News Microsoft (NASDAQ:MSFT) last month started price hikes for its cloud and on-premise products in global markets, with a couple more in the months ahead, which could lead to incremental revenue gains for the software giant, Wells Fargo said. \"We see a modest 1 to 2 percentage point tailwind to as-reported Microsoft Cloud revenue growth in FY25/FY26 (assuming these regions make up 10-15% of revenue), particularly given outsized impact to Japan, MSFT's third-largest geo,\" said Wells Fargo equity analyst Michael Turrin in a note. The costs of Microsoft Cloud services increased by 6% to 12% in India, Korea, Norway, Sweden and Taiwan on Feb. 1. On April 1, Japan will see an increase of 20% on both cloud and on-premise products, while Chinese customers will experience a 7% jump on cloud starting May 1. \"This ensures that customers across different geographies and currencies will encounter consistent pricing, reflecting the exchange rate of the local currency to the U.S. dollar,\" Microsoft said in a December statement. More price fluctuations appear likely in the years ahead. \"Microsoft will continue to assess pricing in local currency as part of a regular twice-a-year cadence, taking into consideration currency fluctuations relative to the USD,\" Microsoft added. Also, Microsoft's Azure continues to gain market share. It grew the fastest among hyperscalers to 34% of market share during its fiscal second-quarter, compared to 30% three years prior. \"Though not updating its Azure outlook for 4Q, we expect 4Q results remain stable or accelerate from 3Q levels, given greater-than-expected AI contributions and easing compares heading into FQ4,\" Turrin added. Wells Fargo maintains its Overweight rating and a $460 price target on Microsoft. Microsoft crept up less than 1% during pre-market trading Wednesday. Microsoft has a BUY rating from Seeking Alpha analysts and a STRONG BUY rating from Wall Street analysts. It has a HOLD rating from Seeking Alpha's quant system, which routinely beats the market. "
}