{
    "title": "Microsoft (MSFT) Surpasses Market Returns: Some Facts Worth Knowing",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/microsoft-msft-surpasses-market-returns-224520523.html",
    "text": "Microsoft (MSFT) closed the most recent trading day at $374.51, moving +1.84% from the previous trading session. This move outpaced the S&P 500's daily gain of 1.41%. On the other hand, the Dow registered a gain of 0.58%, and the technology-centric Nasdaq increased by 2.2%. Coming into today, shares of the software maker had lost 1.73% in the past month. In that same time, the Computer and Technology sector gained 1.37%, while the S&P 500 gained 2.9%. The investment community will be paying close attention to the earnings performance of Microsoft in its upcoming release. The company is forecasted to report an EPS of $2.75, showcasing a 18.53% upward movement from the corresponding quarter of the prior year. At the same time, our most recent consensus estimate is projecting a revenue of $61.03 billion, reflecting a 15.71% rise from the equivalent quarter last year. Regarding the entire year, the Zacks Consensus Estimates forecast earnings of $11.14 per share and revenue of $242.41 billion, indicating changes of +13.56% and +16.77%, respectively, compared to the previous year. Furthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Microsoft. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.12% increase. Microsoft is currently sporting a Zacks Rank of #2 (Buy). In terms of valuation, Microsoft is presently being traded at a Forward P/E ratio of 33.01. This represents a premium compared to its industry's average Forward P/E of 30.69. It is also worth noting that MSFT currently has a PEG ratio of 2.14. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Computer - Software industry had an average PEG ratio of 2.27 as trading concluded yesterday. The Computer - Software industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 170, this industry ranks in the bottom 33% of all industries, numbering over 250. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Make sure to utilize Zacks.com to follow all of these stock-moving metrics, and more, in the coming trading sessions. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}