{
    "title": "Microsoft posts 23% net income growth in Q4",
    "date": "1/23/2024",
    "url": "https://www.ig.com/sg/news-and-trade-ideas/microsoft-s-strategic-wins--fy23-q4-marked-by-strong-cloud-and-c-240124",
    "text": "CFDs are leveraged products. CFD trading may not be suitable for everyone and can result in losses that exceed your deposits, so please ensure that you fully understand the risks involved. \n CFDs are leveraged products. CFD trading may not be suitable for everyone and can result in losses that exceed your deposits, so please ensure that you fully understand the risks involved. View more search results Discover how Microsoft's strategic focus on cloud services and AI technology has propelled a significant 20% increase in net income and an 18% rise in operating income in FY23 Q4. Microsoft Corp is scheduled to report its fiscal Q2 2024 results on Wednesday, 31 January at 5am (GMT+8), after the market closes. Wall Street's expectations for the upcoming results are as follows: Investors cheered Microsoft's first-quarter results, reported in late October, as it beat Wall Street's estimates and promised future product offerings infused with AI. \"With copilots, we are making the age of AI real for people and businesses everywhere,\" said Satya Nadella, Chairman and Chief Executive Officer of Microsoft. \"We are rapidly infusing AI across every layer of the tech stack and for every role and business process to drive productivity gains for our customers.\" Within the details, Microsoft reported the following highlights.  During Q1, Microsoft experienced a notable acceleration in its Azure cloud revenue growth, marking a significant shift after two years of slowing momentum. This uptick has captured the attention of analysts who anticipate a continuation of this trend in the upcoming Q2 Earnings Report. Additionally, there's a growing interest in the performance of the Microsoft 365 CoPilot AI add-on, which was launched last year and is available on a subscription basis. Despite its innovative approach, the add-on has so far received mixed reviews. Microsoft's recent completion of the $68.7 billion acquisition of video game publisher Activision Blizzard is set to influence Q2 earnings. This acquisition, finalised in mid-October, is expected to be a topic of discussion by Microsoft executives, particularly in regards to its impact on the financial guidance for Q3. Another point of interest is the management's perspective on the recent developments at OpenAI, along with their viewpoints on the current structure of the OpenAI board, which has been the subject of much discussion. Building on an almost 57% gain in 2023, Microsoft's share price has surged over 6% in the opening weeks of 2024, as investors began the new year with renewed enthusiasm for tech stocks that offer exposure to AI. The chart of Microsoft's share price is a textbook example of a market in an uptrend, putting in place a sequence of higher highs and higher lows punctuated by corrective and orderly pullbacks. The RSI is now pushing into overbought territory, which offers hope that a pullback may not be too far away, providing an opportunity to buy Microsoft shares at better levels. Near-term horizontal support comes in at $380/378 and below that at around $360, coming from July highs/ December lows. Medium-term support is strong in the $350/335 area, coming from the uptrend drawn from January 2023's $219.35 low and the 200-day moving average at $337.00. To note, a sustained break below $335 would negate the uptrend and warn that a deeper pullback is underway.  IGA, may distribute information/research produced by its respective foreign affiliates within the IG Group of companies pursuant to an arrangement under Regulation 32C of the Financial Advisers Regulations. Where the research is distributed in Singapore to a person who is not an Accredited Investor, Expert Investor or an Institutional Investor, IGA accepts legal responsibility for the contents of the report to such persons only to the extent required by law. Singapore recipients should contact IGA at 6390 5118 for matters arising from, or in connection with the information distributed.\n\nThe information/research herein is prepared by IG Asia Pte Ltd (IGA) and its foreign affiliated companies (collectively known as the IG Group) and is intended for general circulation only. It does not take into account the specific investment objectives, financial situation, or particular needs of any particular person. You should take into account your specific investment objectives, financial situation, and particular needs before making a commitment to trade, including seeking advice from an independent financial adviser regarding the suitability of the investment, under a separate engagement, as you deem fit.\n\nNo representation or warranty is given as to the accuracy or completeness of this information. Consequently, any person acting on it does so entirely at their own risk. Please see important Research Disclaimer. Please also note that the information does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. Any views and opinions expressed may be changed without an update. Discover and learn how the range of markets you can trade on with IG Academy's online course – ‘Introducing the financial markets’. Try out what you’ve learned in this shares strategy article risk-free in your demo account. Put the lessons in this article to use in a live account – upgrading is quick and easy. Put your new knowledge into practice. Log in to your account now. See more forex live prices See more shares live prices Prices above are subject to our  website terms and agreements. Prices are indicative only. All shares prices are delayed by at least 15 mins. See more indices live prices Prices above are subject to our  website terms and agreements. Prices are indicative only. All shares prices are delayed by at least 20 mins.  Get the week’s momentum report sent directly to your inbox every Monday for FREE. The Week Ahead gives you a full calendar of upcoming key events to monitor in the coming week, as well as commentary and insight from our expert analysts on the major indices to watch.  For more info on how we might use your data, see our privacy notice and access policy and privacy webpage. Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Forex Indices Shares Other markets Premium services Our charges and margins About IG Marketing Partnership Web platform Mobile trading MetaTrader 4 ProRealTime Compare features News and trade ideas Economic calendar Momentum Report Market data New client: +65 6390 5133 or accountopening@ig.com.sg Clients: Help and support WhatsApp: Click here IG | Sitemap | Terms and agreements | Privacy | Security | IG Community | Refer a friend | Cookies Follow us online: Disclaimer: All forms of investments carry risks and trading CFDs may not be suitable for everyone. CFDs are leveraged instruments and can result in losses that exceed deposits, so please ensure that you fully understand, and are aware of, the risks and costs involved. Refer to the Risk Disclosure Statement and Risk Fact Sheet. IG Asia Pte Ltd (Co.Reg.No. 200510021K) is regulated by the Monetary Authority of Singapore and holds a capital markets services licence for dealing in capital markets products that are over-the-counter derivatives contracts and is an exempt financial adviser. IG provides an execution-only service. The information in this advertisement does not contain (and should not be construed as containing) investment advice or an investment recommendation, or an offer of or solicitation for a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. You should consider your specific investment objectives, financial situation or particular needs before making a commitment to trade, including seeking advice from an independent financial adviser regarding the suitability of the investment, under a separate engagement, as you deem fit. The information on this site is not directed at residents of the United States or Belgium and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. This advertisement has not been reviewed by the Monetary Authority of Singapore. Careers | Marketing partnership "
}