{
    "title": "Vodafone to invest $1.5bn in new Microsoft partnership",
    "date": "1/16/2024",
    "url": "https://www.voxmarkets.co.uk/articles/vodafone-to-invest-1-5bn-in-new-microsoft-partnership-f2b9920/",
    "text": " (Sharecast News) - Vodafone Group Plc (VOD) Follow | VOD has signed a 10-year strategic partnership with American software giant Microsoft which will see the UK-listed telecoms group invest $1.5bn over the next decade.The deal will \"bring generative AI, digital services and the cloud to more than 300 million businesses and consumers\", Vodafone said in a statement on Tuesday. In return, Microsoft will use Vodafone's fixed and mobile connectivity services, and invest in its managed internet of things connectivity platform, which will become a separate, standalone business by April 2024. Vodafone will Microsoft's Azure OpenAI to increase customer satisfaction across all digital touchpoints, including its digital assistant TOBi. The AI capabilities of Microsoft Copilot will also be used by the Vodafone workforce to boost productivity. It will also use the partnership to further scale its M-Pesa division in Africa through to offer more digital services to the SME market, housing it on Azure to enable the launch of new cloud-native applications. Meanwhile, Vodafone will distribute Microsoft services like Azure and Microsoft Teams to its business customers across Europe, and accelerate its cloud plans through modernising data centres using Azure. Vodafone chief executive Margherita Della Valle said the deal marks \"a bold commitment to the digital future of Europe and Africa\". She said: \"This unique strategic partnership with Microsoft will accelerate the digital transformation of our business customers, particularly small and medium-sized companies, and step up the quality of customer experience for consumers.\" The information, investment views and recommendations in this article are provided for general information purposes only. Nothing in this article should be construed as a solicitation to buy or sell any financial product relating to any companies under discussion or to engage in or refrain from doing so or engaging in any other transaction. Any opinions or comments are made to the best of the knowledge and belief of the writer but no responsibility is accepted for actions based on such opinions or comments. Vox Markets may receive payment from companies mentioned for enhanced profiling or publication presence. The writer may or may not hold investments in the companies under discussion. (Sharecast News) - London's equity markets closed higher on Thursday ahead of the Easter break, despite lingering concerns over the UK's recessionary status in the latter part of last year. Gym Group has accompanied confirmation of FY23 profit resilience and continued buoyancy (like-for-like revenue up 12% in the first two months of 2024) with a clear commitment ‘to accelerate, not reinvent the wheel.’ Stock markets seem to rally no matter what is thrown at them this week. The S&P 500 is a mere 0.28% away from rising by 10% in Q1. A roundup of today's small cap news from broker Hybridan, including Journeo, Microlise & Quiz. On today's Easter stock picking fest, I was delighted to speak to accomplished investor John Hugham of Vox Markets Genedrive reports strong revenue growth, narrowed operating loss, and significant operational progress for its lead assets MT-RNR1 and CYP2C19. Nanoco yesterday released its half year results to 31 January 2024 (‘the Period’). Very much in line with expectations, these following confirmation of the Group’s Final Litigation proceeds earlier this month along with a proposal to shortly return up to £33m to Shareholders (the ‘Return of Value’, abbreviated remaining timetable below). Loungers is an award winning, uniquely positioned all day café-bar group that has grown revenues an impressive 22.5% CAGR FY16-FY23. Comprising of Lounges, Cosy Club and Brightside, the 257-site group still has huge scope to grow towards its conservative ambition of over 650 sites. Strix Group reported a 35.2% jump in revenue in its 2023 results on Wednesday, to £144.6m, accompanied by an increase in gross profit to £;57.2m, up 37.7%. Infrastructure investment company International Public Partnerships reported full-year dividend growth of 5% in its full-year results on Thursday, to 8.13p per share, in line with the increased dividend target it had set earlier. Vox Markets Limited is registered in England with the Company Registration number 09172648,  VAT registration number 196920664. Registered address: The Hawthorns, 6 North Road, Cardiff, United Kingdom, CF10 3DU "
}