{
    "title": "Microsoft, Amazon, Google investments in AI draw questions from FTC",
    "date": "1/26/2024",
    "url": "https://qz.com/microsoft-amazon-google-ai-investments-ftc-1851202060",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters It was only a matter of time before the US Federal Trade Commission (FTC), which regulates competition, decided to investigate big tech’s partnerships with AI companies. The agency is looking specifically at three separate multi-billion-dollar investments, including Microsoft and OpenAI, Amazon and Anthropic, and Google and Anthropic. “History shows that new technologies can create new markets and healthy competition. As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity,” Lina Khan, the FTC chair, said in a statement Thursday. “Our study will shed light on whether investments and partnerships pursued by dominant companies risk distorting innovation and undermining fair competition.” The FTC is seeking information on specific investments or partnerships, including agreements and the strategic rationale behind them; the practical implications of specific partnerships; analysis of the transactions’ competitive impact; competition for AI inputs and resources; and information provided to any other government entity. Sidelining the venture capitalists who typically back startups, the partnerships provide generative AI developers access to tech giants’ resources such as expensive GPUs and cloud computing to train and run advanced AI models. On the other hand, startups provide big tech companies a “land grab to secure their position” in market share and the ability to showcase their own products—for example, Microsoft and copilots. The agency said companies will have 45 days from the date they receive the order to respond. None of the companies mentioned outright own the AI startups, though Microsoft and OpenAI’s partnership comes closest to that. Microsoft owns a 49% stake in the latter, giving the Seattle-based tech giant access to OpenAI’s technology. M&A has proven difficult given greater antitrust scrutiny, so these companies find ways to work with startups rather than buy them outright, Brendan Burke, an analyst at PitchBook, previously told Quartz. Last year saw a flurry of new AI deals: Microsoft invested $10 billion into OpenAI, bringing its total investment to $13 billion, while Google poured $2 billion into OpenAI’s rival Anthropic. Meanwhile, Amazon agreed to commit up to $4 billion in Anthropic. Thanks to the partnership with OpenAI, Microsoft has remained a leader in the AI space, helping propel the company’s market cap to the $3 trillion club. “If Microsoft’s relationship with OpenAI was severed or OpenAI disappeared, then it would set them back,” Gil Luria, DA Davidson analyst, said in an interview with Yahoo Finance in December. Across the pond, the UK’s Competitive and Markets Authority (CMA) said in December it was gathering information on Microsoft and OpenAI to decide whether their partnership threatens competition in the UK, which is home to Google’s DeepMind. At that time—hoping it would resonate with antitrust regulators—Microsoft wanted to make clear that it didn’t own a stake. “Microsoft does not own any portion of OpenAI and is simply entitled to share of profit distributions,” Frank Shaw, the company’s chief communications officer, noted in a statement. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}