{
    "title": "Expanding Copilot for Microsoft 365 to businesses of all sizes",
    "date": "1/15/2024",
    "url": "https://www.microsoft.com/en-us/microsoft-365/blog/2024/01/15/expanding-copilot-for-microsoft-365-to-businesses-of-all-sizes/",
    "text": "Our vision for Microsoft Copilot is to bring the power of generative AI to everyone across work and life. Customers like Visa, BP, Honda, and Pfizer, and partners like Accenture, KPMG, and PwC are already using Copilot to transform the way they work, and 40% of the Fortune 100 participated in the Copilot Early Access Program. We are updating our Microsoft Copilot product line-up with a new Copilot Pro subscription for individuals; expanding Copilot for Microsoft 365 availability to small and medium-sized businesses; and announcing no seat minimum for commercial plans—making Copilot generally available to individuals, enterprises, and everyone in between. Read on for all the details. Copilot for Microsoft 365 enables users to enhance their creativity, productivity, and skills. Take the power of AI on the go with the copilot app First, we are announcing an update to our Copilot product line-up: Copilot Pro—a new Copilot subscription for individuals priced at $20 per individual per month. Copilot Pro has foundational capabilities in a single experience that runs across your devices and understands your context on the web, on your PC, across your apps, and soon on your phone to bring the right skills to you when you need them. And it has web grounding, so it always has access to the latest information. When you’re signed into Copilot with your Microsoft Entra ID, you get commercial data protection for free—which means chat data isn’t saved, Microsoft has no eyes-on access, and your data isn’t used to train the models. Copilot Pro provides priority access to the very latest models—starting with OpenAI’s GPT-4 Turbo. You’ll have access to GPT-4 Turbo during peak times for faster performance and, coming soon, the ability to toggle between models to optimize your experience how you choose. Microsoft 365 Personal and Family subscribers can use Copilot in Word, Excel (currently in Preview and English only), PowerPoint, Outlook, OneNote on PC, and soon on Mac and iPad. It includes enhanced AI image creation with Designer (formerly Bing Image Creator) for faster, more detailed image quality as well as landscape image format. And Copilot Pro gives you the ability to build your own Copilot GPT—a pre-customized Copilot tailored for a specific topic—in our new Copilot GPT Builder (coming soon) with just a simple set of prompts. Microsoft Copilot Studio While Copilot Pro is our best experience for individuals, Copilot for Microsoft 365 is our best experience for organizations. Copilot for Microsoft 365 gives you the same priority access to the very latest models. You get Copilot in Word, Excel, PowerPoint, Outlook, OneNote, and Microsoft Teams—combined with your universe of data in the Microsoft Graph. It has enterprise-grade data protection which means it inherits your existing Microsoft 365 security, privacy, identity, and compliance policies. And it also includes Copilot Studio, so organizations can customize Copilot for Microsoft 365 and build their own custom copilots and plugins as well as manage and secure their customizations and standalone copilots with the right access, data, user controls, and analytics. Here’s a summary of the updated Copilot product line-up: The Copilot system To empower every organization to become AI-powered, we are making three changes. First, we are removing the 300-seat purchase minimum for Copilot for Microsoft 365 commercial plans. Second, we are removing the Microsoft 365 prerequisite for Copilot—so now, Office 365 E3 and E5 customers are eligible to purchase. We’re also extending Semantic Index for Copilot to Office 365 users with a paid Copilot license. Semantic Index works with the Copilot System and the Microsoft Graph to create a sophisticated map of all the data and content in your organization—enabling Microsoft 365 Copilot to deliver personalized, relevant, and actionable responses. Third, we are excited to announce that Copilot for Microsoft 365 is now generally available for small and medium-sized businesses—from solopreneurs running and launching their first business to 300-person fast-growing startups. If you are using either Microsoft 365 Business Standard or Microsoft 365 Business Premium, you can now purchase Copilot for Microsoft 365 for $30 per user per month.1 Small and medium-sized businesses are the heart of every community and the lifeblood of local economies. They have an outsized impact on the world and markets they support—in the United States, this category accounts for 99.9% of business and employs nearly half of the workforce.2 These businesses stand to gain the most from this era of generative AI—and Copilot is uniquely suited to meet their needs. Small and medium-sized business owners report that communicating with customers takes up most of their time (66%), with managing budgets (50%) and administrative tasks (48%) not far behind.3 Copilot for Microsoft 365 can help reduce this daily grind, giving business owners valuable time back to focus on what matters most: growing their business. And with the Microsoft Copilot Copyright Commitment, small business owners can trust that they are working with a reliable partner. Small and medium-sized business customers that have Microsoft 365 Business Standard or Business Premium can learn how to purchase Copilot for Microsoft 365 via our website or by contacting a partner. We have been learning alongside small and medium-sized business customers in our Copilot Early Access Program. Here’s what they’re saying about how Copilot for Microsoft 365 is already transforming their work. “I love that it’s in our environment. It’s able to cross-pollinate and gather information from all of the data we’ve got in Microsoft 365. As a business owner, that’s really important to me because it keeps our people working inside our systems.” “I do believe that there isn’t a single job position in the company that won’t benefit in some way from Copilot being available to them.” “Copilot accurately summarizes the call and meeting notes in minutes. That’s not just faster, it means callers can add more value to the discussion rather than just take notes.” Commercial customers—including small and medium-sized businesses—can now purchase Copilot for Microsoft 365 through our network Cloud Solution Provider partners (CSPs). This means Copilot for Microsoft 365 is now available across all our sales channels. CSPs have served as trusted advisors to their customers, unlocking profitability for businesses and expanding their own capabilities. Learn more about Cloud Solution Provider partners. These announcements come just one month after we announced that we are making Copilot for Microsoft 365 generally available to education customers with Microsoft 365 A3 or A5 faculty, and we’re expanding that to include Office 365 A3 or A5 faculty with no seat minimum. While education licenses are not yet included in the CSP expansion announced today, we will share updates in the coming months. It’s all part of our vision to empower everyone—from individuals to global enterprises—for an AI-powered world. Learn more about Microsoft Copilot and visit the Copilot for Work site for actionable guidance on how you can start transforming work with Copilot today. Learn more about how Copilot for Microsoft 365 for small and medium-sized businesses, including next steps licensing and technical requirements, and get familiar with Copilot capabilities. Visit WorkLab for critical research and insights on how generative AI is transforming work. Copilot helps you achieve things like never before using the power of AI. 1Copilot for Microsoft 365 may not be available for all markets and languages. To purchase, enterprise customers must have a license for Microsoft 365 E3 or E5 or Office 365 E3 or E5, and business customers must have a license for Microsoft 365 Business Standard or Business Premium. Copilot is currently supported in the following languages: English (US, GB, AU, CA, IN), Spanish (ES, MX), Japanese, French (FR, CA), German, Portuguese (BR), Italian, and Chinese Simplified. We plan to support the following languages (in alphabetical order) over the first half of 2024: Arabic, Chinese Traditional, Czech, Danish, Dutch, Finnish, Hebrew, Hungarian, Korean, Norwegian, Polish, Portuguese (PT), Russian, Swedish, Thai, Turkish, and Ukrainian. 2U.S. Small Business Administration. (2023). Frequently Asked Questions. 3Wakefield Research. (2023). Microsoft study: Small businesses intrigued by AI and the opportunities it brings. Help people and teams do their best work with the apps and experiences they rely on every day to connect, collaborate, and get work done from anywhere. "
}