{
    "title": "Microsoft completed its unlikely glow-up in 2023",
    "date": "1/1/2024",
    "url": "https://www.businessinsider.com/microsoft-glowup-ai-activision-blizzard-openai-chatgpt-2023-10",
    "text": "       A decade ago Microsoft was a company on its knees. Steve Ballmer, anointed Bill Gates' successor in 2000, was heading out the door after a failed tenure as CEO. It marked a period where Microsoft had been falling to Earth while rivals Apple and Google came to defy gravity. For a tech firm that once reigned as the world's most valuable company, the period was an embarrassment — and not just because of the bizarre antics it was forced to put up with from its departing leader. Microsoft had become a company whose attraction depended heavily on its storied past; success in the future was not a given. All those worries seem to be behind the company. In 2023, Microsoft bet big on AI, strategic decisions by leadership boosted its position,  and the company landed blockbuster deals. This is how Microsoft completed its glow-up. Since replacing Ballmer in 2014, Microsoft CEO Satya Nadella has carefully helped the company rebuild itself to deliver a series of knockout blows to the competition. For one, Microsoft is arguably the most influential power broker in AI. In January 2023, it emerged that Microsoft was placing a huge multibillion-dollar bet on ChatGPT developer OpenAI, giving it a stake in the company that stoked fresh euphoria about AI. That bet seems to be paying off on several fronts. OpenAI has become something of a cash cow, with the Silicon Valley company generating revenue at a rate of around $1.3 billion per year, its CEO Sam Altman told staff, as reported by The Information in October. Related stories OpenAI's revenue was just $28 million last year, making the introduction of a subscription tier for its Microsoft-cloud-driven chatbot a decisively lucrative move. Nadella even played a significant role in helping Altman get reinstated as OpenAI CEO after the board fired him in November. The shift in focus to AI has also helped Microsoft revamp its own suite of products. The company introduced Copilot, a new vision of its tools described as \"an everyday AI companion,\" which stays with a Microsoft user across multiple devices. Nadella describes it as a \"single unified experience centered around you.\" The company has recently proven to be deft at dealmaking again, too. It received approval from the UK's antitrust regulator to complete the $69 billion acquisition of video game company Activision Blizzard, giving it a clear path to complete the biggest deal in its history. Microsoft faced difficulties in completing the deal, including being forced to offer concessions that lessened it. Despite the headaches, the company restructured the deal to keep all parties happy. The UK's Competition and Markets Authority described the resubmitted deal as a \"gamechanger,\" while Microsoft gained oversight of franchises such as \"Call of Duty,\" which generate billions of dollars in sales. Though Microsoft's market capitalization hit almost $2.6 trillion in 2023, the company does, of course, face challenges. Sky News and others reported that the IRS said Microsoft owed the US Treasury $28.9 billion in back taxes, plus penalties and interest. In a blog addressing the issue at the time, Microsoft said it had changed its corporate structure and practices since the years covered by the IRS audit. As such, it believed the case was no longer relevant to its present practices and planned to appeal against the findings. Meanwhile, when it comes to AI-related challenges, Nadella said during his testimony in the US Justice Department's antitrust case against Google that even AI wasn't enough to help Microsoft's search engine Bing compete meaningfully against Google Search. Putting everything into AI could also be a risky strategy if users begin to treat tools like ChatGPT as something to tread cautiously around. This is particularly notable, given chatbots' habits of generating inaccuracies and made-up information. These are thorny challenges that are not to be underestimated. But by and large, 2023 was a remarkable year for Microsoft. Read next Jump to "
}