{
    "title": "Buy Amazon on cash flow, skip Microsoft on AI competition",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/video/amazon-possesses-6-digital-monetization-211926132.html",
    "text": "In the latest installment of Yahoo Finance's Good Buy or Goodbye, Jared Blikre is joined by Constellation Research Founder and Principal Analyst R \"Ray\" Wang to review Magnificent Seven tech stock components Amazon (AMZN) and Microsoft (MSFT). Wang explains his bullish case for Amazon is enhanced by the diversity of the online retailer's digital stream of income and its venturing into AI. \"They've done $200 billion of investments and capital. that means the free cash flow has been really bad, but we're now on the other end of that,\" Wang says. \"When we look at that, you're going to see the ability for them to actually put that free cash flow to use, not just in profits, acquisitions, reinvestment...\" Wang is bearish on Microsoft, saying goodbye to the tech stock on tightening competition in the AI development landscape — especially from Google (GOOG, GOOGL) — and its valuations. Click here to watch more of Good Buy or Goodbye or you can watch this full episode of Yahoo Finance Live here. Editor's note: This article was written by Luke Carberry Mogan. [MUSIC PLAYING] JARED BLIKRE: It is a big noisy universe of stocks out there. Welcome to Good Buy or Goodbye. Our goal, to help cut through that noise and navigate the best moves for your portfolio. Today, we're diving into the Magnificent Seven. And while the mega-cap effect powered last year's returns for markets, with a new year comes a new perspective. So what's the best way to play it now? I am here with Ray Wang. He is the Constellation Research founder and principal analyst. And Ray, your buy is on Amazon. First of all, give that away. And then you have a couple of reasons to support your claim. What is your bullish case here? RAY WANG: Yeah, my bull case is because the run up isn't in on Amazon. But we're looking at Amazon versus Microsoft. And when you think about what's going on here, right, Amazon has been doing amazing. And the first one is really they're done making the investment, right? They've done $200 billion of investments in capital. That means the free cash flow has been really bad, but we're now on the other end of that. And when we look at that, you're going to see the ability for them to actually put that free cash flow to use. Not just online profits, acquisitions, reinvestment, but more importantly, you're going to see that in profits. JARED BLIKRE: All right-- RAY WANG: And you're going to see that in the-- JARED BLIKRE: I want to hold it right there because I actually have a chart of free cash flow. This is the actual in cyan here versus the estimate this goes back to 2014, so about 10 years. You can see the estimates got a little bit out of touch with reality, came down. They met reality, it went below. And now it's off to the moon. So this is kind of what you're talking about here. RAY WANG: Exactly and that's where we're going to see a lot of those gains. JARED BLIKRE: OK, great. We also have, as another potential risk here-- or excuse me, another potential bullish risk, most diversified streams of digital monetization. So they're finally going down that path of monetizing more in different ways. Can you tell us how? RAY WANG: Well, so here's the beauty of it, right? It's ads, goods, search, services, memberships, and subscriptions. Well, think about it, the number three player in ads is Amazon out of nowhere. Five years ago, you wouldn't be talking about Amazon in ads. And of course, we know they're in goods, they're in memberships, subscriptions, and services, and they've done a killer job there. They're the only one of the Magnificent Seven that have all six of those digital monetization models. JARED BLIKRE: All right, and we're also taking a look-- you are-- at AI. And you're just coming from CES. We'll talk about that in another segment, but AI is the thing over the last year. Automation not priced into the base case. How does-- how does that work for Amazon? RAY WANG: And so here's the interesting point, all the AI that we tend to think about with NVIDIA, with Microsoft, with Google, actually Amazon has a lot of it. Not just in AWS, but they're putting it to use in commerce. And if you've ever seen one of their warehouses, there's a lot going on in the background with automation. That is actually going to give them more leverage than most people are seeing right now. JARED BLIKRE: Yeah, easy to forget how big they are in logistics. Anyway, we got to go to some of the risks here and one of those is regulatory. We've heard the DOJ and antitrust concerns kind of coming up in recent years. What about that front? RAY WANG: I'm worried about DOJ. If we have the same administration going into the next election out of 2025, there's going to be huge regulatory issues coming out of FTC, DOJ. If we have a change in leadership, then I would take that risk off the table. Right now, I'm betting that the risk off the table, it's like a 50/50. Nobody knows where it's going to head. JARED BLIKRE: Yeah, I'd say pretty fair with that. We don't know where that's going to go. We got to talk about Microsoft here, one stock to avoid. Are we saying goodbye here? RAY WANG: I'm saying goodbye only because the run up has already been there. For a lot of people, they've invested in Microsoft, it's been an amazing ride. Satya is an amazing CEO. But here's some of the challenges, right? One of them right now is when you think about it, massive competition in AI. Microsoft started a war with Google last January that they thought they were going to win because they thought they caught Google flat footed. The answer is Google kicked back and they kicked back really hard. JARED BLIKRE: All right, and we're also taking a look at valuation. You just said pretty much that they run up. They got a lot of price increase last year. Do you think that's it for them? RAY WANG: No, there's still a little bit more. And they may be the most valuable company in the world for another five, six months, but at that point the question is, what's next? And every investor asks, will they be able to deliver on what's next? JARED BLIKRE: All right, and then quality complaints. Where is that coming from? RAY WANG: If you've been on a Teams call recently, you know how shoddy that is. If you're asking for more capacity in the Western region, customers are not getting compute capacity. They've done such a good job selling, now they've got to actually focus on delivery. JARED BLIKRE: All right, now how do we turn this into the bull case? It looks like monetization is part of the deal with respect to AI. RAY WANG: You know, ChatGPT, OpenAI, all those capabilities, you know, that's where Microsoft is winning. Copilots applications, being able to do it in an office. Every person that codes is using it, especially when you're looking at GitHub, they're getting the benefits of that and that speed. And that's for-- that's the bull case. JARED BLIKRE: All right, so you're telling us here you want to buy Amazon as AI and automation not yet priced into the base case for the stock and then more free cash flows is on the horizon. And on the other side, you're saying avoid Microsoft amid steep AI competition and the run up in valuation already played out on the AI monetization front. Ray Wang, thank you. Stick around, we're going to be hitting more on some of these tech themes and rivalries on the other side of the break. But that's going to do it for the latest installment of Good Buy or Goodbye. Look out for new episodes three times a week at 3:30 PM, Eastern. Related Quotes "
}