{
    "title": "Microsoft's first-in-three-decades 'key' change is a tangible symbol of CEO \nSatya Nadella's AI vision",
    "date": "1/4/2024",
    "url": "https://fortune.com/2024/01/04/microsoft-windows-keyboard-copilot/",
    "text": "Hi there, it’s Rachyl Jones with the tech team. The first major change in three decades is coming to Windows computer keyboards. In the coming days and weeks, Windows 11 PCs from Microsoft and its partners will include a physical Copilot button that activates the company’s artificial intelligence assistant, the company said in a blog post on Thursday. The new key—which sports an icon that looks a bit like a folded piece of origami—means users can summon AI features with a quick tap of the button instead of clicking through the taskbar on-screen. “AI will be seamlessly woven into Windows from the system, to the silicon, to the hardware,” Yusuf Mehdi, Microsoft’s consumer chief marketing officer, said in the blog post. “This will not only simplify people’s computing experience but also amplify it, making 2024 the year of the AI PC.” Whether the key will make any material difference in PC sales is unclear, but the move underscores Microsoft’s investment in Copilot as the future of how consumers interact with computers. Built on ChatGPT technology—which Microsoft has played a key role in funding—Copilot began as a feature for Bing and Edge in February 2023. It has since become available throughout Windows 11 and Microsoft 365 products for both business and personal use, marketing as “your everyday AI companion.” The most recent significant change to Microsoft’s keyboards was nearly 30 years ago when it added the Windows button to launch the “Start” menu. Depending on the product, the new Copilot key will either stand in the place of the Menu key or the right Control key, CNBC reported. Larger computers will have enough keyboard space for both the Copilot button and the right Control key, according to CNBC. While Microsoft Windows remains the dominant PC operating system globally, the company’s Surface computers (which will integrate the new key) have failed to reach more than a few percentage points of market share. Any Windows PC maker, including industry leaders Lenovo, Dell, and HP, can offer keyboards with the new Copilot button of course. But the Copilot button will give Microsoft one more way to tout the AI capabilities of its Surface computers. At a presentation for journalists and industry professionals in September, Microsoft Surface marketing director Adrienne Brewbaker ran a live demonstration comparing the speed of a Surface PC against Apple’s MacBook Pro. In the presentation, the Microsoft product rendered GPUs, graphic processing units essential to run generative AI, twice as fast. And while Bloomberg has reported Apple is working on its own large language model, the closest product Apple has at the moment is Siri (which does not have a special button on MacBooks). With that, here are more of today’s top tech stories. Rachyl Jones Want to send thoughts or suggestions to Data Sheet? Drop a line here. American-made chips. The Biden administration will award $162 million in federal grants to Microchip Technology, an Arizona-based semiconductor company, the New York Times reports. The grant is the second of its kind from the U.S. government in recent months under a new program to ensure American companies have a stable supply of chips. The funds will support the production of cars, airplanes, medical devices, and military products. TikTok’s U.S. shopping plans. TikTok, the social platform owned by Chinese company ByteDance, intends to grow its U.S. e-commerce business tenfold to as much as $17.5 billion in 2024, Bloomberg reports, citing people familiar with internal conversations. Such growth could alarm online shopping giants like Amazon and Chinese behemoths Shein and Temu, which are all popular among American shoppers. In a statement to Bloomberg, TikTok said the figure is inaccurate. New money in an old search industry. Jeff Bezos has invested in Perplexity, an AI startup that could threaten Google’s empire by changing the way people search the internet. In addition to the Amazon founder, investors in the $70 million round include IVP, Databricks Ventures, ex-Twitter executive Elad Gil, Shopify chief Tobi Lutke, and Nvidia. The round values Perplexity at $520 million, according to TechCrunch. “This is not a static, point-in-time picture. The ecosystem contains thousands of companies, and they’ll continue to adapt and optimize over time.” —Google vice president Anthony Chavez said in an interview with the Wall Street Journal, responding to claims from advertisers that Google has not done enough to prepare them for the elimination of cookies, which help marketers target and track customers. On Thursday, Google will start restricting cookies on Chrome with the goal of eliminating all cookies by the end of 2024. Huawei’s homegrown operating system, launched after the company was put on a U.S. blacklist, may soon overtake Apple’s iOS in China, by Lionel Lim Big Tech’s new year stock slump has erased a staggering $370 billion and put its 2003 rally in reverse, by Carmen Reinicke and Ryan Vlastelica I advised the EU on its landmark AI Act. Here’s how it got preempted by the U.S. and U.K., why it almost got derailed by ChatGPT, and how it will shape regulation in 2024, by David Haber SpaceX workers who criticized CEO Elon Musk for being a ‘distraction and embarrassment’ were illegally fired in retaliation, NLRB alleges, by Josh Eidelson, Loren Grush, and Bloomberg Gavin Newsom tackles a $68 billion deficit for the world’s fifth largest economy, the AI explosion and the Hollywood implosion, by Tran Nguyen, Adam Beam, and the Associated Press What news is worth. OpenAI, the company behind the large language model ChatGPT, offered some publishers as little as between $1 million to $5 million per year to license news articles and train its artificial intelligence models, The Information reports. While that might make a difference for small publishers, that’s a measly amount for bigger news sites, given the effect AI could have on the news industry. The news comes just days after the New York Times filed a lawsuit against Microsoft and OpenAI for copyright infringement, claiming the companies copied tens of thousands of its articles without permission to train their AI models, as Jeremy Kahn wrote about in Fortune’s Eye on AI newsletter. This is the web version of Data Sheet, a daily newsletter on the business of tech. Sign up to get it delivered free to your inbox. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}