{
    "title": "16 Most Widely Held Stocks by Individuals",
    "date": "1/13/2024",
    "url": "https://finance.yahoo.com/news/16-most-widely-held-stocks-203143195.html",
    "text": "In this article, we will take a detailed look at the 16 Most Widely Held Stocks by Individuals. For a quick overview of such stocks, read our article 5 Most Widely Held Stocks by Individuals. Latest data shows that more and more Americans are investing in stocks, a trend that started during the COVID-19 pandemic days. In December, a Wall Street Journal report cited data from the Federal Reserve's survey of consumer finances which said that about 58% of U.S. households owned stocks in 2022, up from 53% in 2019. This was the highest household stock-ownership rate recorded in the survey that is conducted after every three years. This data shows that the rise of individual investors seen after the pandemic was not a temporary trend. As millions of Americans received stimulus checks during the pandemic days, they turned to retail investing platforms like Robinhood and other investing apps to pile into stocks. That trend is still going on despite the massive decline in stocks seen in 2022 following the inflation storm and rate hikes. Methodology For this article, we used Robinhood Investor Index (which shows the most popular stocks on the investing platform Robinhood), some research reports and screeners highlighting the most popular stocks among individual investors to find out 16 most widely held stocks among individual investors. Some top names in the list include Microsoft Corp (NASDAQ:MSFT), Amazon.com Inc (NASDAQ:AMZN) and Meta Platforms Inc (NASDAQ:META). Photo by Chris Liverani on Unsplash Number of Hedge Fund Investors: 1 Sphere 3D Corp (NASDAQ:ANY) is one of the most popular stocks among individual investors, according to Fintel Retail Ownership stock screener. The carbon neutral bitcoin mining company Sphere 3D Corp (NASDAQ:ANY) said it mined 73.5 bitcoins in December, higher than 71.7 bitcoins mined in November and 17.9 bitcoins in the year-ago month. Number of Hedge Fund Investors: 9 Many data platforms tracking retail investor activity show GameStop Corp (NYSE:GME) continues to be one of the most widely held stocks by individual investors. GameStop Corp (NYSE:GME) has fallen from its glory days when it skyrocketed thanks to the short squeeze launched by retail investors on Reddit. The stock has lost about 14% in value over the past one year. Last month GameStop Corp (NYSE:GME) posted third quarter results. Adjusted EPS in the period came in at $0.00, beating estimates by $0.08. Revenue in the quarter fell 9.2% year over year to $1.08 billion, missing estimates by $100 million. In addition to stocks like GameStop, individual investors are also buying mega-cap tech stocks like Microsoft Corp (NASDAQ:MSFT), Amazon.com Inc (NASDAQ:AMZN) and Meta Platforms Inc (NASDAQ:META). Number of Hedge Fund Investors: 18 AMC Entertainment Holdings Inc (NYSE:AMC) ranks 14th in our list of the stocks widely held by individual investors. In November, the entertainment company AMC Entertainment Holdings Inc (NYSE:AMC) posted strong third quarter results thanks to Barbie and Oppenheimer. Adjusted EPS in the quarter came in at -$0.09, beating estimates by $0.16. Revenue in the period jumped 45.2% year over year to $1.41 billion, beating estimates by $150 million. Number of Hedge Fund Investors: 18 Chinese EV company Nio Inc - ADR (NYSE:NIO) ranks 13th in our list of the stocks widely held by individuals. According to data from Robinhood, Nio Inc - ADR (NYSE:NIO) is amongst the most popular stocks on the platform. Earlier this month, BofA Securities downgraded the stock to Neutral. BofA said lack of new models in the first half of 2024 will affect company sales. Number of Hedge Fund Investors: 43 Ford Motor Co (NYSE:F) is one of the most popular stocks among retail investors. Hedge fund sentiment for the automaker also inched up in the third quarter of 2023, as 43 hedge funds tracked by Insider Monkey reported having stakes in Ford Motor Co (NYSE:F), up from 40 hedge funds in the previous quarter. Ford Motor Co (NYSE:F) sold 25,937 electric cars in the fourth quarter of 2023, which was up 24% on a YoY basis. Number of Hedge Fund Investors: 50 Invesco QQQ ETF tracks the NASDAQ-100 index and gives investors exposure to some of the top technology and growth stocks. Over the past few years it has become one of the most famous ETFs among individual investors. Number of Hedge Fund Investors: 81 Tesla Inc (NASDAQ:TSLA) remains one of the most favorite stocks of individual investors. During the fourth quarter of 2023, Tesla Inc (NASDAQ:TSLA) produced 494,989 vehicles and delivered over 484,507 vehicles, beating estimates of 483,000 deliveries. As of the end of the third quarter of 2023, 81 hedge funds out of the 910 funds tracked by Insider Monkey had stakes in Tesla Inc (NASDAQ:TSLA). The most notable stakeholder of Tesla Inc (NASDAQ:TSLA) was Catherine D. Wood's ARK Investment Management which owns a stake worth over $1 billion. Here is what White Brook Capital has to say about Tesla, Inc. (NASDAQ:TSLA) in its Q3 2023 investor letter: \"The magnificent seven, that underpin the S&P 500 performance, which includes Tesla, Inc. (NASDAQ:TSLA), now comprise almost 30% of the market capitalization of the S&P500. At least three of the seven stocks have heightened downside risk and suffer from already high penetration, weakening end markets, competitive risk, and lofty valuation. They have been remarkably resilient to increased interest rates and the potential for slowing growth. Small and midcap stocks, on the other hand, have been systemically penalized by fears of recession and continue to price that eventuality even as significantly better outcomes have become more probable. Today, it's relatively easy to find attractive investments in this segment.\" Number of Hedge Fund Investors: 82 There has been an increase in popularity of broader market ETFs and index funds among individual investors especially after the inflation storm and rate hikes. SPDR S&P 500 ETF Trust (NYSE:SPY) is among the most held ETFs by individual investors. Number of Hedge Fund Investors: 89 According to Robinhood index tracker, Walt Disney Co (NYSE:DIS) is one of the most popular stocks on the Robinhood platform. Walt Disney Co (NYSE:DIS) has been seeing a lot of activity in the hedge fund space as it prepares to enter a battle with Nelson Peltz of Trian Partners. Peltz is seeking two board seats at Walt Disney Co (NYSE:DIS). Activist hedge fund Blackwells Capital will nominate three directors to Walt Disney Co’s (NYSE:DIS) board in support of Disney CEO Bob Iger. Walt Disney Co (NYSE:DIS) and ValueAct Capital Management recently entered an agreement according to which Walt Disney Co (NYSE:DIS) will provide information to the investment firm and consult with ValueAct on strategic matters, including through meetings with the Walt Disney Co (NYSE:DIS) Board and management. Madison Sustainable Equity Fund made the following comment about The Walt Disney Company (NYSE:DIS) in its Q3 2023 investor letter: \"During the quarter, we sold our positions in Bristol-Myers Squibb and The Walt Disney Company (NYSE:DIS).  The Walt Disney Company is facing a difficult and uncertain transition in its core media business assets including the ESPN business and other linear media assets. These media assets are cash generative but face secular decline as consumers are cutting their expensive cable subscriptions and moving to alternative streaming options. This has resulted in a decline in operating profits for the media division. The media business has long-term fixed costs related to its sports broadcasting agreement with multiple sports leagues which will further pressure profits during this transition.\" Number of Hedge Fund Investors: 110 Advanced Micro Devices Inc. (NASDAQ:AMD) has made a comeback against NVIDIA Corp (NASDAQ:NVDA) by launching new chips for AI and the company plans to continue to up its AI game. Wells Fargo analysts led by Aaron Rakers earlier this month said in a note that they like Advanced Micro Devices Inc. (NASDAQ:AMD) and NVIDIA Corp (NASDAQ:NVDA) at the current levels as they believe the semiconductor industry is set for a rebound. Artisan Global Opportunities Fund made the following comment about Advanced Micro Devices, Inc. (NASDAQ:AMD) in its Q2 2023 investor letter: \"Among our top contributors were Advanced Micro Devices, Inc. (NASDAQ:AMD), NU Holdings and Netflix. AMD's data center CPUs are used in the cloud service provider (CSP) servers. In addition to the broader secular tailwind from cloud adoption, the company has a performance and pricing advantage over Intel, which we believe will enable it to continue capturing market share. However, the recent stock price rally was due to growing excitement around the company's AI exposure. It will launch its new MI300 graphics processing unit (GPU) chip later this year to compete against the dominant market leader NVIDIA. Similar to its approach that won market share from Intel within the CPU market, AMD's product will aim to provide similar performance at a more attractive price. AMD is already working with Microsoft and Meta, while Amazon publicly stated that it is evaluating AMD's inferencing chips. Using assumptions around the total GPU market size, potential market share gains and price points, our research indicates this could be a $20 billion opportunity for AMD. That would nearly double its revenue. While the company has not historically missed many deadlines, there is execution risk as it works to manufacture and distribute these complex chips at scale, which, combined with an elevated valuation after the stock's strong performance run, led us to trim the position.\" Number of Hedge Fund Investors: 180 NVIDIA Corp (NASDAQ:NVDA) has seen a huge rise in popularity among retail and institutional investors amid the AI boom. NVIDIA Corp (NASDAQ:NVDA) shares have gained about 234% over the past one year, with many analysts repeatedly saying there’s a lot more room to run for the stock because of a burgeoning demand for AI chips. In addition to Nvidia, hedge funds and retail investors are piling into Microsoft Corp (NASDAQ:MSFT), Amazon.com Inc (NASDAQ:AMZN) and Meta Platforms Inc (NASDAQ:META). In its fourth quarter 2023 investor letter, ClearBridge Large Cap Growth Strategy stated the following regarding NVIDIA Corporation (NASDAQ:NVDA): \"Much of that differential can be attributed to the performance of the Magnificent Seven (Alphabet, Amazon.com, Apple, Meta Platforms, Microsoft, Nvidia and Tesla), a basket of mega cap growth stocks that accounted for 47.8% of the benchmark return for the quarter and 65.4% for 2023. The ClearBridge Large Cap Growth Strategy maintains exposure to six of the seven stocks, with overweights in Amazon.com, Meta and NVIDIA Corporation (NASDAQ:NVDA). Those three stocks, as well as Microsoft, were among the leading contributors to Strategy performance for the quarter. Microsoft and Nvidia continued to be supported by strong execution and leadership positions in the implementation of generative artificial intelligence (AI). These are high-quality, cash flow generative businesses that we will continue to own, actively adjusting our positioning sizes based on risk/reward and portfolio construction priorities. With Nvidia shares more than tripling in 2023, we opportunistically took profits throughout the year, an approach that continued in the fourth quarter with additional trims that brought the position down to 6% of overall assets. Active management of our mega cap exposure contributed to the Strategy outperforming the benchmark both in the fourth quarter and through the narrow leadership market of 2023. We also attribute these improved results to solid stock picking, being opportunistic in adding to or initiating new positions in growth companies at or near the bottom of their earnings cycle, and maintaining a commitment to diversification across our three buckets of growth: select, stable and cyclical.\"  Click to continue reading and see 16 Most Widely Held Stocks by Individuals.  Suggested Articles: 13 Most Promising Tech Stocks According to Analysts 11 Most Promising Hydrogen and Fuel Cell Stocks According to Analysts 16 Most Promising Dividend Stocks According to Analysts Disclosure. None. 16 Most Widely Held Stocks by Individuals was initially published on Insider Monkey. Related Quotes "
}