{
    "title": null,
    "date": "1/2/2024",
    "url": "https://www.theverge.com/2024/1/2/24022293/microsoft-activision-blizzard-cma-tough-fair-comments-brad-smith",
    "text": "By  Tom Warren, a senior editor covering Microsoft, PC gaming, console, and tech. He founded WinRumors, a site dedicated to Microsoft news, before joining The Verge in 2012. Microsoft president Brad Smith wasn’t happy with the UK’s Competition and Markets Authority (CMA) last year after the regulator blocked Microsoft’s giant Activision Blizzard deal. Now that Microsoft has restructured its deal and won approval in the UK, Smith has kinder words for the CMA, describing the regulator as “tough and fair” in an interview with BBC Radio 4’s Today program. Smith originally criticized the CMA and said confidence in the UK had been “severely shaken” after the regulator moved to block Microsoft’s $68.7 billion deal in April last year. He called it the “darkest day” for Microsoft in its four decades of working in Britain and went a step further, saying “the European Union is a more attractive place to start a business” than the UK. “I certainly learned a lot personally,” admitted Smith on Radio 4 yesterday. “I wouldn’t step back necessarily from all of the concerns I raised when I talked way back in April, but I might choose slightly different words to make my point.” The CMA forced Microsoft to restructure its Activision Blizzard deal, giving up key cloud gaming rights in the UK and many other markets worldwide. “The CMA held to a tough standard and I respect that. In my view it was tough and fair,” added Smith. “It pushed Microsoft to change the acquisition that we had proposed for Activision Blizzard, to spin out certain rights that the CMA was concerned about with respect to cloud gaming.” While Smith has had a change of heart over his criticism of the CMA, the regulator was less than impressed with Microsoft’s tactics. “Businesses and their advisors should be in no doubt that the tactics employed by Microsoft are no way to engage with the CMA,” warned CMA CEO Sarah Cardell in October. “Microsoft had the chance to restructure during our initial investigation but instead continued to insist on a package of measures that we told them simply wouldn’t work. Dragging out proceedings in this way only wastes time and money.” Microsoft’s concession to the CMA allowed the deal to close in October, following months of regulatory scrutiny worldwide. The Federal Trade Commission is still pursuing its case against Microsoft’s deal in the US, with a decision on an appeal over the FTC v. Microsoft case expected from the Ninth Circuit Court of Appeals soon. The FTC is also still pursuing a separate administrative case against Microsoft’s deal that’s set to commence shortly after the appeal decision unless the FTC abandons its case entirely. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}