{
    "title": "Nvidia's boom and Intel's big plans show how AI has turbocharged chipmaking",
    "date": "2/22/2024",
    "url": "https://www.axios.com/2024/02/22/intel-nvidia-ai-chips-manufacturing",
    "text": "Illustration: Shoshana Gordon/Axios AI makers' desperate need for millions of powerful chips took center stage on Wednesday as the world's most valuable chipmaker, Nvidia, reported another quarter of massive revenue growth and longtime leader Intel reported progress on reinvigorating its manufacturing operation. Why it matters: Nvidia's fortunes have soared along with demand for its  chips to train and run AI systems — but the rest of the semiconductor industry stands to get a major boost from AI, too. Driving the news: Intel, which once reserved nearly all its chipmaking capacity for its own processors, is in the midst of a pricy gamble to transform itself into a credible contract-manufacturing rival to Taiwan-based TSMC, which makes chips for firms that design them — like Nvidia. Meanwhile, Nvidia reported another blowout quarter, with revenue more than tripling from a year ago — to more than $22 billion — and per-share earnings up 765%. Nvidia said that U.S. chip export controls directed at limiting China's access to advanced tech had minimal impact on its business. OpenAI CEO Sam Altman, who showed up at the Intel event, is reportedly seeking trillions of dollars for a major new chip production effort that could take years to reach the marketplace. What they're saying: The rise of generative AI has Intel CEO Pat Gelsinger feeling pretty good about his decision to double down on manufacturing. Estimates that the chip industry would grow to $1 trillion a year, once seen as aggressive, now look like they might be way too conservative, Gelsinger said. The typically cyclical industry was famously short on supply during the early days of the pandemic, when car production lines had to be halted due to a lack of semiconductors. The big picture: The surging chip demand comes amid an effort to diversify an industry whose manufacturing has become highly concentrated in Taiwan and Korea, where nearly all of the most advanced chips are currently made. Between the lines: Intel trotted out an intriguing mix of rivals-turned-partners including executives from Arm, Broadcom and MediaTek. Yes, but: It's unlikely that generative AI's growth will be linear and without ups and downs. \"Will Gen AI go through some other AI winters? Probably,\" Gelsinger said. Of note: AI is driving the demand, but it's also helping speed at least part of the process of making chips. "
}