{
    "title": "Microsoft thinks it might have made a breakthrough on its cloud monopoly \ncase",
    "date": "2/8/2024",
    "url": "https://www.techradar.com/pro/microsoft-thinks-it-might-have-made-a-breakthrough-on-its-cloud-monopoly-case",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Could Microsoft and CISPE be about to reach a deal? Microsoft has entered discussions with the Cloud Infrastructure Services Providers in Europe (CISPE) to address its ongoing antitrust case in Europe. The case relates to the company’s unfair dominance of the cloud market, which is reported to have been boosted by technical and financial limitations, causing customers to be locked into Microsoft’s own services. According to Reuters, Microsoft’s approach to resolving the issue could see the company avoid a full-on EU investigation, which could result in fines, mandates, and significant reputational damages. CISPE, which represents 26 EU cloud providers, including Amazon (but not Google), filed the complaint with the European Commission late in 2022, alleging that Redmond’s licensing terms were harming competition in the EU. In a statement, CISPE confirmed: “Today, CISPE confirms that it has opened discussions with Microsoft aimed at resolving ongoing issues related to unfair software licensing for cloud infrastructure providers and their customers in Europe.” Discussions are in the early stages, but both parties are actively exploring potential resolutions. CISPE noted that “substantive progress” must be made within the first three months of 2024, alluding to the fact that the added pressure on Microsoft may see the company reach an agreement before an EU investigation goes ahead. Microsoft has racked up $1.7 billion in antitrust fines over the past decade, and that’s just within the European Union. The company has been seen to mellow in recent years, taking a more accommodating approach to avoid further penalties. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! At the same time, other companies have also started to improve interoperability, likely due to mounting pressure within the EU for a more competitive landscape. A Microsoft spokesperson told TechRadar Pro in an email: \"We continue to work constructively with CISPE to resolve concerns raised by European cloud providers.\" A CISPE spokesperson shared a press release with us, including the following statement: \"As the foundation for discussions, CISPE has reiterated that any remedies and resolution must apply across the sector and to be accessible to all cloud customers in Europe. Furthermore, any agreements will be made public, subject to scrutiny and monitoring by third parties.\" With several years’ experience freelancing in tech and automotive circles, Craig’s specific interests lie in technology that is designed to better our lives, including AI and ML, productivity aids, and smart fitness. He is also passionate about cars and the decarbonisation of personal transportation. As an avid bargain-hunter, you can be sure that any deal Craig finds is top value! DNA storage is coming, it's just a matter of when not if — SNIA quietly unveils first specifications for storing bytes in DNA medium, an important first step towards almost ultra-cheap, limitless storage An ancient Linux flaw might be opening up users to dangerous cyberattacks Canonical announces Snap Store crackdown after crypto scam apps overload By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Lance UlanoffMarch 29, 2024 By Craig HaleMarch 29, 2024 By Craig HaleMarch 29, 2024 By Rowan DaviesMarch 29, 2024 By Chris NortonMarch 29, 2024 By David NieldMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}