{
    "title": "How Microsoft's Artificial Intelligence (AI) Rebranding Expands Its Market \nPotential",
    "date": "2/20/2024",
    "url": "https://www.fool.com/investing/2024/02/20/how-microsofts-artificial-intelligence-ai-rebrandi/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Whether in the news media or earnings reports, artificial intelligence (AI) technology is infiltrating every major company's brand identity. This trend makes sense when considering predictions that the AI market could hit $2.5 trillion by 2032. But can too many AI-branded products confuse consumers and limit adoption? It appears Microsoft (MSFT -0.17%) may have the answer. Though the tech titan recently became the world's biggest company by market cap, it appears to have plenty of room to grow thanks to AI. That's because Microsoft, through investing over $10 billion in OpenAI, has rapidly expanded its AI product portfolio. It started in February 2023 with Bing AI, powered by OpenAI's GPT-4 large language model. This approach aimed to provide users with a custom search engine experience. Through integrating AI into its search engine, Microsoft improved functionality while testing consumer preferences. Bing AI was then tailored to provide search result summaries and offer users a more succinct but informative experience. A little over a month later, Microsoft began offering Copilot AI as part of its Office 365 software suite. Yet this marketing angle seemed confusing, because Microsoft also provides Azure OpenAI as a business-focused system. This means throughout much of 2023, Microsoft offered three different AI platforms with overlapping user bases, all of which are exclusively powered by OpenAI's GPT-4 language model variants. Now, you may be asking, what's the problem with a variety of products? More offerings generally means more revenue, but the issue isn't the variety; it's the lack of a unified AI presence to attract casual users and expand the technology beyond business applications. For example, OpenAI's ChatGPT currently captures 60% of casual AI use. As ChatGPT continues to gain popularity, consumers will tend to trust it more than other AI models due to word of mouth. This is similar to how Alphabet's Google revolutionized searching and browsing in the 2000s. Google first released its search engine in 1998, and it took Microsoft eight years to respond with its search engine, LiveSearch. This engine ultimately became Bing, but by 2008, when Microsoft rebranded, it was already too late, and Google dominated the market. The same year, Google released the Chrome browser, which grew exponentially in market share and decimated Microsoft's Internet Explorer user base. These moves led to incredible share-price growth since Alphabet's IPO in 2004. The good news for Microsoft is that it is entitled to share of OpenAI profit distributions. Thus, at least in the short term, the tech giant loses nothing if OpenAI wins big and its products don't. (Plus, Microsoft is doing lots of co-branded work with OpenAI, including offering OpenAI tools on Azure.) Many current technologies may be replaced by AI in the coming years, drastically reshaping how we use software. Google's search engine may even become obsolete if people prefer using AI to answer their questions. As such, Microsoft has an opportunity to overcome its past of losing consumers to its competitors, but only if it offers the best and most efficient AI experience. To accomplish this strategy, Microsoft has already begun to unify its AI models under one brand, with Bing AI becoming part of Copilot. By transitioning toward marketing its AI services under one model, the company may be able to command more attention for its products. Microsoft also has an ace up its sleeve for making Copilot a household name. Thanks to Microsoft's iron grip on the day-to-day software almost all working professionals have on their computers, its AI already has a gargantuan user base, whether the users know it or not. Over 1.2 billion people utilize Office 365 for daily tasks. This puts Microsoft's newly branded Copilot AI in front of their eyes every day. By having this special business relationship with the platform, users may become more accustomed to using Copilot outside of the office. An advantage of this scale also allows Microsoft to tap into these user databases to train its AI models, resulting in more rapid iteration and introduction of new features. Between Microsoft's user databases and OpenAI's language models, the partnership can begin to offer more than just a subscription-based service to use a generic AI platform. Instead, Microsoft will be able to develop models tailored to the needs of individual enterprise customers. For the average consumer, Microsoft could potentially apply the same strategy and make personal assistants truly fit the person using them. Such a product could go on to sap revenue from Google's search engine, because individuals might prefer using their custom AI rather than go looking for an answer from Google. For reference, Google made $175 billion in 2023 from search revenue. Microsoft doesn't have to win a ton of share there to make a huge impact on its $228 billion top line. If Microsoft plays its AI cards right and continuously specializes the features its AI products offer, its revenue could skyrocket, propelled forward by a unified experience. The days of \"Googling\" something might be coming to an end as the days of \"Copiloting\" arrive. This benefits Microsoft and its investors, because it seems the new king of tech has nowhere to go but up. Viktor Zarev has no position in any stocks mentioned. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}