{
    "title": "Stock market today: S&P 500 hits record high after jobs report, tech \nearnings thrill investors",
    "date": "2/2/2024",
    "url": "https://finance.yahoo.com/news/stock-market-today-sp-500-hits-record-high-after-jobs-report-tech-earnings-thrill-investors-143400775.html",
    "text": "Stocks closed the week with a warm embrace Friday after a thunderous January jobs report and a triumphant series of market-moving earnings. The S&P 500 (^GSPC) rose 1.1%, reaching a record high. The Dow Jones Industrial Average (^DJI) climbed 0.4% or more than 100 points, while the tech-heavy Nasdaq Composite (^IXIC) gained 1.7%. A momentous week boosted investor sentiment. As Yahoo Finance's Josh Schafer reports, Friday's highlight was the jobs report, which blew past Wall Street expectations as the economy added 353,000 jobs in January. The unemployment rate was unchanged at 3.7%. The labor market has remained resilient in the face of a rate-hiking campaign from the Federal Reserve, but other data this week had shown signs of softening. Friday's jobs report could once again shift expectations on the Fed's rate path, especially as Fed Chair Jerome Powell suggested that a strong labor market is actually a good sign. Investor bets now place a high probability that the first rate cut from the central bank won't arrive until May. Meanwhile, the S&P 500 and Nasdaq were still basking in the glow of strong earnings reports from tech giants Amazon (AMZN) and Meta (META) on Thursday. As Yahoo Finance's Hamza Shaban writes, they delivered the goods where Microsoft (MSFT) and Alphabet (GOOGL, GOOG) had fallen short earlier in the week. Meta surged more than 20%, while Amazon popped near 8%. Apple (AAPL) also looks to have disappointed, despite an earnings beat, following warning signs from its China business. Apple fell 0.5% at the closing bell. Robust earnings from several tech giants and a better-than-expected jobs report powered the market to a winning finish Friday as Wall Street quickly looked past bumps from earlier in the week. The S&P 500 (^GSPC) rose 1.1%, reaching a record high. The Dow Jones Industrial Average (^DJI) climbed 0.4% or more than 100 points, while the tech-heavy Nasdaq Composite (^IXIC) gained 1.7%. Investors will have the first full week of February to recalibrate after the Federal Reserve reiterated once again that lower interest rates likely will not arrive until later this year. A stronger-than-expected jobs report that surprised Wall Street means the central bank is even more likely to delay potential rate cuts. Meanwhile, fresh readings on mortgage applications and consumer credit will offer a window into the housing market and debt loads as market observers weigh more data that points to a promising start to 2024, even as warnings of a slowdown remain. Next week also brings major earnings news from the worlds of media and tech and from an array of top consumer brands that are scheduled to post their quarterly reports. McDonalds (MCD) and Palantir (PLTR) are scheduled to kick off another major week for earnings on Monday. They are followed by Spotify (SPOT), Disney (DIS), and PepsiCo (PEP). Yahoo Finance's Brent Sanchez has a graphical breakdown of what to watch next week: Federal Reserve Chair Jerome Powell threw cold water on investor hopes that the central bank would cut interest rates in March. But that's not necessarily a bad thing for stocks closely tied to the housing market. In theory, a delay in rate cuts would mean mortgage rates won’t soften as quickly as the market is expecting, which could consequently keep more homebuyers on the sidelines. But one analyst still has a positive outlook for homebuilder stocks this year. “You see mortgage applications starting to move higher ... while we're not gonna have a rate cut in March, it is still highly likely we will have lower rates in 2024,” Matthew Bartolini, head of SPDR Americas research at State Street Global Advisors, told Yahoo Finance in an interview. He added: “People have jobs ... they spend, spending is higher, and what do they spend on? Housing, right? And we continue to see strength in the housing market, both from new home sales, but also [on] durable goods ... That's really what homebuilders are.” The SPDR S&P Homebuilders ETF (XHB) is up about 1% so far this year, compared to the S&P's (^GSPC) 4% gain. The years of cost efficiency have come home to Big Tech. But instead of executives touting their efficiency to eke through tough quarters, it’s shareholders applying the pressure for perfection. Even investors who have been showered by gains from Big Tech are looking for more. Primed by towering expectations of an AI-fueled transformation and of narratives of relentless growth, the market is applying the same cutthroat logic of more with less. Alphabet (GOOG, GOOGL) and Microsoft (MSFT) were on the receiving end of the squeeze this week. The pair surpassed analyst expectations, but investors fixated on the perceived weak points, collectively pining for outstanding results to justify holding expensive stocks. But blockbuster earnings from Meta (META) and Amazon (AMZN) delivered the goods on Thursday, offering strong outlooks for the months ahead, and in CEO Mark Zuckerberg's case, introducing a sweetener: a new dividend. Investors have launched the stock price up more than 20%, setting the company up for the biggest single-day market cap gain in history. The split paths for Big Tech his week highlight the unforgiving judgment of investors accustomed to abundance. Doing merely great isn't going to cut it. The blowout January jobs report had many eye-popping numbers that surprised investors, including a significant uptick in wage growth. Wages increased 0.6% on a monthly basis and 4.5% over last year; economists had expected wages to rise 0.3% over last month and 4.1% over last year. Typically, this has been viewed as a bad sign in the fight against inflation, as rising wages could push consumers to accept higher prices. But Renaissance Macro's head of economic research Neil Dutta points out that wage bump came alongside a decrease in hours worked, which fell to 34.1 from 34.3 in the month prior. \"If I take the data at face value, I see total hours worked down, the economy expanding, which implies growth in labor productivity and low unit labor costs,\" Dutta wrote in a note to clients on Friday. \"It’s a good backdrop for corporate earnings.\" Carson Group chief market strategist Ryan Detrick pointed out a similar theory on wage growth and productivity recently in volume two of the Yahoo Finance Chartboook. Detrick points out that productivity picked up pace in the second and third quarters of 2023 and that could offset inflationary pressures from wage growth. \"This matters because the Fed hates to see higher wages, but when productivity is strong, this can allow for higher wages but inflation remains checked,\" Detrick told Yahoo Finance. \"It also opens the door for the Fed to cut rates as inflation is no longer a major issue.\" He added: \"We saw a similar scenario take place in the mid-'90s. ... Take note, the mid to late '90s was a great time for our economy and for investors.\" Here are some of the stocks leading Yahoo Finance’s trending tickers page during afternoon trading on Friday: Meta (META): Shares of the social media platform rocketed Friday afternoon after CEO Mark Zuckerberg touted a blockbuster quarter that also came with a new dividend and a $50 billion boost to its stock buyback program. The company is on pace to add more than $200 billion to its market cap, which would be a stock market record, according to Bloomberg data. Meta shares were trading around $475 on Friday; at its lows in 2022, the stock fell to as low as $90. Chevron (CVX): The oil giant rose 2.8% after posted earnings that were better than expected. Chevron recorded adjusted earnings of $3.45 per share, topping consensus estimates by $0.23. The company also posted record annual worldwide and US production. ExxonMobil (XOM) also beat expectations with shares rising 0.6% higher. Nvidia (NVDA): Shares of the AI hardware supplier rose nearly 5% in afternoon trading as Meta's surge lifted up several other AI darlings. This week AI expansion was a major topic during the earnings calls of the tech giants, drawing further investor interest to the company that is poised for expansion as customers deepen investments in AI software and hardware. Amazon (AMZN): The e-commerce behemoth also enjoyed a standout quarter. Investors drove the stock up 6% Friday after the company reported fourth quarter results that topped expectations on both the top and bottom lines. The upper range of Amazon's outlook for the current quarter also topped expectations. Amazon grew its ads business more than 25%. Apple (AAPL): Shares of the iPhone maker fell 1.6% despite posting better-than-expected earnings in its first quarter Thursday. But sales in China, one of its most important markets, fell year over year. Stocks pushed ahead Friday afternoon, riding the momentum of a winning January jobs report and muscular earnings from Big Tech's major players. The S&P 500 (^GSPC) rose 0.8%. The Dow Jones Industrial Average (^DJI) climbed just over the flatline, reversing earlier losses, while the tech-heavy Nasdaq Composite (^IXIC) gained almost 1.3%, powered by robust earnings. Apple CEO Tim Cook appears to be ditching a rhetorical strategy of playing coy with AI and is now joining his tech industry peers in building excitement for coming AI initiatives. “We’ve got some things that we are incredibly excited about that we will be [showing] later this year,” Cook said during the company's earnings call Thursday. \"I think there is a huge opportunity for Apple with gen. AI and AI,\" he later added, as Yahoo Finance's Dan Howley reported. Where other tech giants have scrambled to get in on the AI buzz — releasing products, announcing new ventures, and simply reciting the words \"AI\" dozens of times on earnings calls — Cook has taken a more subtle approach. In fact, during calls last year, Cook has explained that AI is already integrated into the Apple consumer experience, but instead of hyping new technologies, Apple instead focuses on the customer benefit. He has even said that Apple tends to unveil new technologies only when they are ready for users, in remarks that seemed gently critical of the recent excitement oozing from other tech execs. Meanwhile, Big Tech siblings Microsoft (MSFT), Google (GOOG, GOOGL), Meta (META), and Amazon (AMZN) have played up their AI efforts, much to the delight of Wall Street. Cook's new tone will likely be a welcome message to market watchers who have been waiting for Apple to get in on the action surrounding generative AI. As analysts at Needham wrote in a note on Friday, \"We believe companies that use GenAI to cut costs and accelerate new product launches will replace those that don't. Which is AAPL?\" What a day in markets on Friday. The January jobs report crushed estimates. The S&P 500 is on pace for a record close. And the surge in shares of Meta Platforms (META) has the stock on pace for the biggest single-day market cap gain in history. According to data from Bloomberg, Meta's more than 20% rally on Friday has the company on pace to see its market cap rise by over $200 billion. Apple (AAPL) and Amazon (AMZN) previously set a high-water mark, gaining more than $190 billion in market value in November and February 2022, respectively. Meta's earnings report last night was not only a clean \"beat and raise,\" but also saw the company announce two huge shareholder return initiatives — a $50 billion stock buyback authorization and a $0.50-per-share quarterly dividend. Additionally, the company proved to Wall Street some pretty immediate returns from its \"Year of Efficiency\" push in 2023. Net income at Meta rose 69% last year to $39.1 billion, while its head count fell 22%. And CEO Mark Zuckerberg told analysts on Thursday he hopes to continue running Meta along these lines in the years ahead. \"I sort of expect that for the next period of time going forward, even beyond 2024, my operating assumption is that we will also try to keep [head count increases] relatively minimal because I think that, until we reach a point where we're just really underwater on our ability to execute, I kind of want to keep things lean because I think that's the right thing for us to do culturally,\" Zuckerberg said. Chevron (CVX) and ExxonMobil (XOM) shares were trading higher on Friday after the oil giants posted earnings that were better than expected, though down as expected from their blockbuster prior year results. An increase in crude output helped offset the impact of lower oil and gas prices on profits in the fourth quarter of 2023. Chevron posted adjusted earnings of $3.45 per share, topping consensus estimates by $0.23. The company posted record annual worldwide and US production. ExxonMobil delivered adjusted earnings per share of $2.48, beating expectations by $0.26. The oil giant increased Guyana and Permian production by 18%, and achieved record annual refinery throughput. \"[ExxonMobil] enters 2024 in a strong financial position,\" said Peter McNally, global sector lead for industrials, materials, and energy at Third Bridge. Chevron shares rose more than 3% on Friday at 11:00 a.m. Eastern, while ExxonMobil gained 0.7%. Here are some of the stocks leading Yahoo Finance’s trending tickers page during morning trading on Friday: Meta (META): Shares of the social media platform surged Friday morning, after CEO Mark Zuckerberg touted a blockbuster quarter. In a surprise move the company also announced a new dividend, paying $0.50 per share to investors for the first time. The tech giant also boosted its stock buyback program by $50 billion. Amazon (AMZN): The e-commerce behemoth also enjoyed a standout quarter. Investors drove the stock up 6% Friday after the company reported fourth quarter results that topped expectations on both the top and bottom lines. The upper range of Amazon's outlook for the current quarter also topped expectations. Amazon grew its ads business more than 25%. Apple (AAPL): Shares of the iPhone maker fell 1.6% despite posting better-than-expected earnings in its first quarter Thursday. But sales in China, one of its most important markets, fell year-over-year. AbbVie (ABBV): The pharmaceutical company rose nearly 3% Friday morning after surpassing revenue expectations for its fiscal fourth quarter. The company also raised its sales outlook for two of its biggest immunology drugs. Wall Street hesitated during morning trading on Friday, with the major indexes little changed. Investors digested a blockbuster jobs report that nearly doubled expected figures while parsing standout earnings from Tech giants Meta (META) and Amazon (AMZN). The S&P 500 (^GSPC) rose 0.1%. The Dow Jones Industrial Average (^DJI) slipped 0.4%, or 150 points, while the tech-heavy Nasdaq Composite (^IXIC) gained 0.5%. Back in 2022, total US employment topped pre-COVID levels, marking one of the quickest rises from trough to peak of any post-recession rebound. On Friday, the news got even better. Joseph Politano, who writes the Apricitas Economics newsletter, noted on X that every major sector of the US economy has now fully recovered from losses seen during the pandemic. With 11,000 jobs added to the Leisure & Hospitality sector in January, the final piece of this recovery puzzle was put into place. The US economy added 353,000 nonfarm payroll jobs in January, almost double the 185,000 expected by economists and exceeding the upwardly revised December figures that showed there were 333,000 jobs added to the economy in the final month of 2023. Wages also topped estimates, with average hourly earnings rising 0.6% over last month and 4.6% over last year. Revisions to November and December's jobs reports brought the number of new roles created during those months up by 126,000. And the benchmark revisions — which some had thought could bring a notable downward skew to last year's job gains — were modest, showing there were 187,000 fewer jobs added to the economy throughout the year than previously announced. After Powell on Wednesday suggested a rate cut in March was not the Federal Reserve's base case, Friday's data makes it seem even more unlikely that view gets changed over the next six weeks. Good Friday morning! We are nearing the end of a jam-packed week for markets and the economy with one final main event: the January jobs report. Yahoo Finance's Josh Schafer will have all the numbers and reaction starting at 8:30 a.m. ET. Also in focus will be the aftermath of the last significant round of Big Tech earnings this quarter. The tech-heavy Nasdaq was set to pop more than 1% as Meta and Amazon surged. But Apple was setting up for a decline after warning about its China business. "
}