{
    "title": "Microsoft Negotiates with European Cloud Providers to Avert EU Antitrust \nAction - Microsoft (NASDAQ:MSFT)",
    "date": "2/7/2024",
    "url": "https://www.benzinga.com/government/24/02/36987709/microsoft-negotiates-with-european-cloud-providers-to-avert-eu-antitrust-action",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Microsoft Corp MSFT is currently negotiating with the Cloud Infrastructure Services Providers in Europe (CISPE) to address a complaint lodged with the European Union regarding the tech giant’s cloud computing licensing practices. This move aims to preempt a potential in-depth EU investigation, which could result in fines and a mandate for Microsoft to alter its business operations. CISPE, comprising Amazon.Com Inc AMZN and 26 smaller cloud providers across the EU, initiated the complaint in late 2022, accusing Microsoft of implementing contractual terms that detrimentally impact the European cloud computing environment, Reuters reports. The contention stems from Microsoft’s licensing adjustments made in mid-2022, prompted by complaints from competitors in Germany, Italy, Denmark, and France to the EU’s competition authority. Notably, the revisions excluded Amazon, Alphabet Inc GOOG GOOGL Google, Alibaba Group Holding Limited BABA, and Microsoft’s cloud services. CISPE’s discussion with Microsoft seeks to rectify issues surrounding what it deems unfair software licensing that adversely affects cloud infrastructure providers and their clientele within Europe. The European Commission has acknowledged receiving multiple complaints against Microsoft, particularly concerning its Azure cloud computing platform. The CISPE emphasizes the importance of making considerable progress by the first quarter of 2024. Meanwhile, the EU scrutinizes Microsoft’s $13 billion investment in OpenAI. The regulator had also flagged complaints against Microsoft Teams. Over the past decade, Microsoft has paid €1.6 billion in EU antitrust penalties but has recently adopted a more conciliatory stance towards regulatory engagements. Price Actions: Microsoft shares traded higher by 1.42% at $411.22 on the last check Wednesday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo by Rainer Stropek via Flickr © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}