{
    "title": "Microsoft could block the installation of Windows 11 24H2 on old PCs",
    "date": "2/13/2024",
    "url": "https://www.gizchina.com/2024/02/13/windows-11-hardware-requirements/",
    "text": "For users pushing the boundaries of compatibility, running Windows 11 on unsupported hardware might soon become a distant memory. Microsoft’s next major update, Windows 11 24H2, slated for later this year, reportedly introduces a new hurdle: the POPCNT instruction requirement. This potentially cuts off a swathe of older machines from receiving the upgrade, particularly impacting businesses with extensive existing hardware infrastructure. Previously, bypassing the minimum requirements for Windows 11, including the TPM 2.0 chip, wasn’t too difficult. Tools like Rufus allowed installation even on incompatible systems. However, the 24H2 update appears to be changing the game. The POPCNT instruction, short for “population count,” allows efficient counting of set bits in a computer word. While seemingly innocuous, Microsoft reportedly now utilizes POPCNT in core system files across the kernel and drivers. Without this instruction, booting might be impossible. The good news? Only “very” old machines are affected. Processors supporting either SSE4.2 or SSE4a instruction sets, introduced around 15 years ago, can handle POPCNT. This excludes very dated CPUs like Intel Core 2 Duo and earlier AMD processors. However, for businesses clinging to reliable but aging workstations, this presents a challenge. So HUGE discovery found in Windows 11 Version 24H2, since build 25905.A CPU with the instruction \"POPCNT\" IS NOW REQUIRED!There are various system files requiring the POPCNT CPU instruction, from the Windows 11 kernel to the USB XHCI drivers. Without POPCNT, it doesn't boot! pic.twitter.com/vCWYvzfu6k — Bob Pony (@TheBobPony) February 11, 2024  Windows 11 24H2: Impact on Businesses with Older Hardware The Windows 11 24H2 update’s POPCNT requirement throws a wrench into upgrade plans for businesses heavily reliant on older hardware. Replacing entire fleets of computers can be a significant financial burden, disrupting workflows and productivity. While individual users might shrug and stick with the supported Windows 11 23H2 version until its 2025 end-of-life, businesses face more complex decisions.  Alternatives and Considerations: Businesses facing the 24H2 incompatibility dilemma have several options: Conclusion: The Windows 11 24H2 update’s POPCNT requirement presents a challenge for businesses with older hardware. Carefully weighing the costs, security implications, and potential performance gains is crucial before making a decision. Exploring alternative solutions and planning upgrade strategies are essential to navigate this update smoothly and minimize disruption. I'm the ANDROID & CUSTOM ROMs EXPERT of GizChina for the past 5 years. With an unwavering passion for all things tech and a love for exploring the limitless possibilities of Android devices, I'm thrilled to be part of this incredible community.     GizChina Follow @gizchina  Accredited technology blog dedicated to providing breaking news, expert reviews and original content related to mobile tech and EV industry, smartphones, gadgets and IoT. Keep up to date with the latest Android phone news and reviews on our social media channels: "
}