{
    "title": "Slack AI is finally here. It can do pretty much all things Copilot does on \nMicrosoft Teams",
    "date": "2/14/2024",
    "url": "https://mspoweruser.com/slack-ai-is-finally-here-it-can-do-pretty-much-all-things-copilot-does-on-microsoft-teams/",
    "text": "Follow us Share this article Improve this guide The feature is currently rolling out for Enterprise users in English. 2 min. read Published on February 14, 2024 published on \n\nFebruary 14, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Slack, a popular work-friendly communication platform, is now joining the AI hype train. Slack AI has finally dropped, and from the look of it, Copilot on Microsoft Teams may be getting a new competitor in town. The AI, as described by the company, can deliver answers that you search for, recap channels by generating key highlights, and create summaries for long threads to help you catch up – just like on Teams and even a thread summarizer on Outlook. And it looks promising, too, as seen in its demo. If you’re working on a project and you’re out of the loop with the conversation, you can simply type “What is project x,” and then Slack AI will search through the channel’s conversation and pull out a simplified answer. As for the thread summarizer feature, an AI button will appear in the top right corner, allowing you to summarize unread messages, messages from the past week, or custom date ranges. But it’s not free. Slack AI is currently rolling out for Enterprise users as a paid add-on and it’s only available in English. Supports for other languages and other plans will be announced in the future. Copilot for Microsoft Teams, on the other hand, also does not come for free. It’s included in the Copilot for Microsoft 365 plan, which costs $30 per user per month. This plan grants access to the AI features not only in Teams but also in other applications like Word and Excel. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Currently reporting news on Microsoft-related products, tech, and AI on Windows Report and MSPowerUser.\nGot a tip? Send it to [email protected]. Rafly Gilang Tech Reporter Rafly is a reporter with years of journalistic experience, ranging from technology, business, social, and culture. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}