{
    "title": null,
    "date": "2/11/2024",
    "url": "https://mspoweruser.com/you-can-soon-customize-your-organizations-look-on-edge-for-business/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on February 11, 2024 published on \n\nFebruary 11, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft offers organizations more control over the look and feel of Microsoft Edge for Business with a new customization feature on their Microsoft 365 roadmap. Announced on February 9th, 2024, the “Customize organization branding in Edge for Business” update allows administrators to integrate their organization’s branding assets directly into the browser. Administrators can now enable and configure branding on the profile-related UI for profiles signed in with an Entra ID (formerly Azure Active Directory) account. This includes adding the organization’s name to the profile pill and the name, logo, and brand color to the profile flyout. Additionally, they can overlay the Edge for Business taskbar icon with the organization’s logo, creating a more visually distinct experience. These visual enhancements solve a common pain point for users juggling multiple profiles and browser windows. By readily identifying which profile belongs to their work organization, users can navigate more efficiently and avoid potential confusion. The Microsoft Edge management service offers administrators a streamlined experience for managing branding assets. They can now control, preview, and customize these elements with ease. Specific policies like OrganizationColor, OrganizationLogo, OrganizationLogoOnAppIcon, and OrganizationName provide granular control over the branding implementation. This update is scheduled for a global rollout starting in March 2024. Organizations interested in implementing this feature can find more information about the feature ID (383013) and specific details on the Microsoft 365 roadmap. More about the topics: Edge for Business Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}