{
    "title": "Microsoft takes stake in French AI startup Mistral to push its multilingual \nmodels",
    "date": "2/26/2024",
    "url": "https://sifted.eu/articles/mistral-microsoft-multilingual-model",
    "text": "Startup Europe.\nGrown up reporting. Backed by © 2024 Sifted EU Ltd. All Rights Reserved. News February 26, 2024 Daphné Leprince-Ringuet and Tim Smith 2 min read Paris-based GenAI startup Mistral has today announced a strategic distribution partnership with Microsoft, as it launches its new “multilingual flagship model”, Mistral Large. The deal sees Microsoft take a small stake in the French startup, Sifted understands, and will mean that Mistral’s AI models will be available on the US tech giant’s cloud computing platform Azure. Mistral is now the second company to forge a distribution deal with Microsoft, which has invested more than $13bn in US startup OpenAI. Announcing the news, Mistral cofounder and CEO Arthur Mensch said that the company is ”very proud to announce the availability of Mistral Large on Azure AI,” and that “Microsoft's trust in our model is a step forward in our journey to put frontier AI in everyone's hands”. The move represents some validation of Mistral’s strategy to provide a European alternative to powerful AI models developed in the US, by showing a strong commercial appetite for AI built to be multilingual from the ground up. According to the company, Mistral Large — a large-language model that can power generative AI technologies like chatbots — is fluent in five languages: French, English, German, Spanish and Italian. OpenAI’s ChatGPT can take prompts in languages other than English, but researchers have found that although the system is good at translating into English, it doesn’t perform as strongly when asked to translate English into other languages. Mistral says that based on “commonly used benchmarks” its new model is the “world's second-ranking model available through an API alongside GPT-4”. The Paris-based company, which was created in June last year by former Google AI and Meta employees, has made waves in recent months, raising just under €500m since launching. It is one of Europe’s best-funded startups in the space. It is considered by some as one of Europe’s strongest competitors to OpenAI and became a prominent critic of the EU’s AI Act, which it said risked putting Europe even further behind in the global AI race. The partnership with Microsoft comes as European governments stress the need to develop “sovereign” AI technologies that can compete against English-speaking models developed in the US. Editor's pick Interview Zenly's founder is back with amo — and this time he's not looking for buyers Interview Pirate Bay’s Peter Sunde: “No one does tech for good — especially not in fintech” Analysis How PhotoRoom became France’s hot young GenAI thing Daphné Leprince-Ringuet Daphné Leprince-Ringuet is a reporter for Sifted based in Paris and covering French tech. You can find her on X and LinkedIn Tim Smith Tim Smith is news editor at Sifted. He covers deeptech and AI, and produces  Startup Europe — The Sifted Podcast . Follow him on  X  and  LinkedIn Recommended Inside the Scottish tech ecosystem Sifted takes a look at the Scottish tech ecosystem and how collaboration is at the heart of its success Sponsored by: EIE Meet five startups using AI for good AI will change the world – we spoke to five finalists of Microsoft’s Entrepreneurship for Positive Impact Cup to find out how they are managing its risks and rewards Sponsored by: Microsoft Entrepreneurship for Positive Impact Chips off the old block Bristol has a long lineage of semiconductor startups — and it is starting to disrupt the UK's 'Golden Triangle' Kai Nicol-Schwarz Backed by © 2024 Sifted EU Ltd. All Rights Reserved. "
}