{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.rfi.fr/en/science-and-technology/20240227-france-s-mistral-ai-signs-partnership-with-microsoft",
    "text": "Microsoft says it has sealed a \"multi-year partnership\" that would allow French company Mistral AI to use its platforms including Azure AI, which enables businesses to build apps using AI. Issued on: 27/02/2024 - 14:56 The US firm, which has already ploughed billions into ChatGPT maker OpenAI, called Mistral \"an innovator and trailblazer\" in a statement on Monday. The deal comes just weeks after US authorities began to investigate whether Microsoft's reported $13 billion investment in OpenAI broke antitrust laws. The deal is one of three partnerships between big tech companies and AI startups being scrutinised by the Federal Trade Commission (FTC). The firm has denied any wrongdoing and has not stopped its forays into a sector that has so far been defined in the public's imagination by OpenAI. The Silicon Valley company has developed software that enables users to generate text, pictures and video from simple requests – with results generally regarded as superior to its competitors. Mistral, formed last year by ex-Google and Meta researchers, is a rare European player in a field dominated by US firms. The French company, which has already raised almost €500 million ($540 million), confirmed the partnership with Microsoft on Monday. \"We are thrilled to embark on this partnership with Microsoft,\" said Mistral boss Arthur Mensch. He said it would help propel his company's products to customers across the world. Some investors valued Mistral at more than $2.0 billion in December, leading to frenzied speculation about it becoming a future European tech champion. The firm, which has so far focused on back-end development for business clients, announced its first chatbot on Monday, which it dubbed \"Le Chat\". \"Le Chat is natively multilingual and offers a pedagogical and fun way to explore Mistral AI's technology,\" the firm said in a statement in English. The company said it would let some of its customers test the bot before releasing it more widely. Mistral also announced upgrades to its existing language models – the term used by AI firms to refer to the programs they develop with the help of public data. Among European AI firms, only Germany's Aleph Alpha brought in as much funding as Mistral last year. (with AFP) Daily newsletterReceive essential international news every morning Keep up to date with international news by downloading the RFI app © 2024 Copyright RFI - All rights reserved. RFI is not responsible for the content of external websites. Audience ratings certified by ACPM.ACPM The content you requested does not exist or is not available anymore. "
}