{
    "title": "Am I missing out if I don't buy Microsoft stock?",
    "date": "2/15/2024",
    "url": "https://www.fool.co.uk/2024/02/15/am-i-missing-out-if-i-dont-buy-microsoft-stock/",
    "text": "Microsoft stock is 13% overvalued, according to an expert analysis. Despite its AI head start and impressive growth rates, I’m not buying the stock. Image source: Getty Images When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. Microsoft (NASDAQ:MSFT) stock has soared by 50% in the last year, largely buoyed by the buzz around its OpenAI division. The advent of ChatGPT seems to have given Microsoft a golden ticket, packaging AI technology into a subscription-based model. This is no small feat in an industry where many are still stuck in the conceptual phase, offering little beyond buzzwords and pie-in-the-sky AI dreams. But does this make Microsoft a must-buy for my portfolio? Here’s why I don’t think so. A recent analysis by New York University professor of finance and equity valuation Aswath Damodaran pegs Microsoft as the second-most overvalued stock among the so-called Magnificent Seven tech giants. According to the ‘Dean of Valuation’, Microsoft was 14% overvalued as of 9 February. The Magnificent Seven collectively added a staggering $5.1trn to their market cap in 2023, accounting for over 60% of the S&P 500’s total return that year. The latest quarterly earnings report for Q4 2024 underscores Microsoft’s robust performance. The company posted an 18% increase in revenue to $62bn and a 33% jump in net income to $21.9bn. These figures are impressive, reflecting strong execution and the successful integration of Activision Blizzard into its portfolio. Such achievements highlight Microsoft’s strategic prowess. Particularly impressive has been the company’s ability to leverage AI across its technology stack, securing new customers and driving productivity gains across sectors. Microsoft Cloud’s revenue alone surged to $33.7bn, up 24% year-over-year. There’s no denying Microsoft is a ‘wonderful company’, as legendary investor Warren Buffett might put it. But is it trading at a ‘fair price’? With a price-to-earnings (P/E) ratio of 36, significantly higher than its five-year average of 31, the market’s enthusiasm for Microsoft’s growth prospects seems to have reached fever pitch. Source: Simply Wall Street historical P/E data The company’s market cap has ballooned by 280% over the past five years to $3trn. Going forwards, there are natural limits to how quickly it can continue to expand due to its already ginormous size. Moreover, the broader tech landscape is fraught with competition and regulatory challenges. Although Microsoft’s recent performance and strategic investments in AI and cloud computing are exciting, the current hype and valuation raise questions about the sustainability of its stock price growth. The attraction of Microsoft’s success story must be balanced against the realities of its valuation and growth potential. Personally, I’d rather look at less hyped-up areas of the global stock market for undervalued gems. Currently, I’m focusing on the FTSE 100 for basement-bargain deals on growth and dividend stocks.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Mark Tovey has no position in any of the shares mentioned. The Motley Fool UK has recommended Microsoft. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 30 March, 2024 |\n        Charlie Keough This Fool has targeted these two cheap FTSE 100 stocks as shrewd buys in April. Here, he explains why he… Read more » 30 March, 2024 |\n        Christopher Ruane Christopher Ruane explains a handful of techniques employed by Warren Buffett when finding shares to buy that he hopes could… Read more » 30 March, 2024 |\n        Ben McPoland This investor takes a look at how much he'd need to invest in Tesco stock to aim for a four-digit… Read more » 30 March, 2024 |\n        Mark Rogers We believe the UK small-cap market offers a myriad of opportunities across a wide range of different businesses and industries. Read more » 30 March, 2024 |\n        Alan Oscroft The Vodafone share price has lost half its value in the past five years. I think it might be on… Read more » 30 March, 2024 |\n        Charlie Keough This Fool plans to start generating passive income for his retirement today. With a £10,000 lump sum, here's how he'd… Read more » 30 March, 2024 |\n        Christopher Ruane Our writer identifies a well-known FTSE 100 firm with an 8% dividend yield he’s been eyeing as an addition for… Read more » 30 March, 2024 |\n        Stephen Wright Lloyds shares are up 13% over the last month. But Stephen Wright thinks the bank’s returns on equity mean it… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. Tax Year Ends 5 April 2024 Shelter up to £20,000 from the Taxman this tax year in a Stocks and Shares ISA, and you’ll pay no UK income tax or capital gains on potential profits! We’ve made it easy to compare Stocks and Shares ISAs, so you can find an account that’s a great fit for your needs. Whether you’re shopping for a trading account with all the whistles and bells, or seeking a simple, ready-made portfolio solution, we’ve got it covered. Investments involve various risks, and you may get back less than you put in. Tax benefits depend on individual circumstances and tax rules, which could change. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}