{
    "title": "Microsoft is holding a Surface and Windows AI event on March 21",
    "date": "3/7/2024",
    "url": "https://au.news.yahoo.com/microsoft-announces-a-surface-and-windows-ai-event-for-march-21-130447407.html",
    "text": "Microsoft has announced that it's holding an event on March 21 that will focus on its upcoming generative AI devices and features. The event entitled \"Advancing the new era of work with Copilot\" will start at 9AM Pacific/12PM Eastern time that date. Microsoft promises to unveil \"the latest in scaling AI in your environment with Copilot, Windows and Surface,\" but it has shared no other details on what its announcements could be. As Windows Central had previously reported, the company is expected to launch the Surface Pro 10 and Surface Laptop 6 on March 21. They're apparently slated to be Microsoft's first AI PCs that will be equipped with the new Intel Core Ultra or Qualcomm Snapdragon X Elite processors. Both models have neural processing units (NPUs) that boost AI capabilities, which is why the upcoming Surfaces will most likely be the first to support the new AI features coming to Windows 11. Those new AI features could include real-time live captions and translations, upscaling for games and frame rate smoothing. Microsoft is also reportedly working on a feature called AI Explorer that will give users a way to conduct searches across apps, documents, web pages, images and chats using natural language. Windows Central said AI Explorer might have the capability to understand context and suggest actions based on what's on the screen. It could also create a history of the tasks a user does on their computer to make them searchable later on. We'll know for sure if Microsoft truly is launching new Surface devices and new AI features a couple of weeks from now — we will, of course, keep you updated on what the company reveals. (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergFed’s Preferred Inflation Metric Cools While Spending ReboundsBank of Russia Sees No Alternative to Yuan for Its ReservesPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  This update would represent Apple's first overhaul to that lineup since 2018.  Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. This food habit is linked to a specific type of dementia. IBKR EventTrader - A new, straightforward way to trade CME futures markets The dreaded pest also displaces wildlife and can blind pets. Find out more. Harry Enten ran the numbers on Trump's dismal fundraising so far. 'We love a girly that shreds,' one fan said of the very 'Barbie' moment.  The actress is soaking up every moment of 'paradise.' Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... King Edward VIII’s proposal to Wallis Simpson marked a constitutional crisis in Britain almost 90 years ago The former president’s son hemmed and hawed before eventually working in a Biden slam. The not-so-happy campers were stunned by the unexpected guest at their beachside campsite.  Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. The person who wrote on the road has been called a \"top bloke\" by motorists. If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. ‘I guess turning 29 isn’t so bad,’ the ‘American Idol’ alum joked. King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service "
}