{
    "title": "Microsoft (NASDAQ:MSFT) Trading 0.3% Higher After Analyst Upgrade",
    "date": "3/26/2024",
    "url": "https://www.defenseworld.net/2024/03/27/microsoft-nasdaqmsft-trading-0-3-higher-after-analyst-upgrade.html",
    "text": "Posted by Defense World Staff on Mar 27th, 2024 Microsoft Co. (NASDAQ:MSFT – Get Free Report)’s share price traded up 0.3% on Tuesday after Wedbush raised their price target on the stock from $475.00 to $500.00. Wedbush currently has an outperform rating on the stock. Microsoft traded as high as $425.99 and last traded at $424.12. 3,333,448 shares changed hands during trading, a decline of 85% from the average session volume of 22,826,586 shares. The stock had previously closed at $422.86. A number of other equities research analysts have also commented on MSFT. KeyCorp initiated coverage on Microsoft in a research report on Thursday, March 21st. They issued an “overweight” rating and a $490.00 target price on the stock. China Renaissance began coverage on Microsoft in a research report on Tuesday, December 5th. They set a “buy” rating and a $466.00 price target on the stock. BMO Capital Markets boosted their price objective on Microsoft from $420.00 to $455.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Royal Bank of Canada raised their target price on Microsoft from $415.00 to $450.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. Finally, Tigress Financial boosted their price target on Microsoft from $433.00 to $475.00 and gave the company a “buy” rating in a report on Wednesday, November 29th. Four research analysts have rated the stock with a hold rating and thirty-six have issued  a buy rating to the stock. According to data from MarketBeat, the company currently has an average rating of “Moderate Buy” and a consensus target price of $423.34. View Our Latest Research Report on Microsoft In other news, EVP Kathleen T. Hogan sold 21,955 shares of the company’s stock in a transaction on Monday, March 11th. The stock was sold at an average price of $403.96, for a total value of $8,868,941.80. Following the transaction, the executive vice president now owns 159,764 shares of the company’s stock, valued at approximately $64,538,265.44. The sale was disclosed in a filing with the SEC, which is accessible through the SEC website. In related news, insider Bradford L. Smith sold 45,000 shares of Microsoft stock in a transaction that occurred on Friday, February 2nd. The shares were sold at an average price of $411.78, for a total value of $18,530,100.00. Following the completion of the sale, the insider now owns 574,129 shares in the company, valued at approximately $236,414,839.62. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, EVP Kathleen T. Hogan sold 21,955 shares of the company’s stock in a transaction on Monday, March 11th. The stock was sold at an average price of $403.96, for a total value of $8,868,941.80. Following the transaction, the executive vice president now owns 159,764 shares in the company, valued at $64,538,265.44. The disclosure for this sale can be found here. Insiders sold a total of 1,070,258 shares of company stock valued at $30,690,456 over the last quarter. 0.03% of the stock is owned by insiders. Institutional investors and hedge funds have recently modified their holdings of the company. DGS Capital Management LLC lifted its holdings in  Microsoft by 19.9% during the 1st quarter. DGS Capital Management LLC now owns 14,342 shares of the software giant’s stock worth $4,422,000 after buying an additional 2,383 shares in the last quarter.  IFM Investors Pty Ltd boosted its holdings in  Microsoft by 20.8% in the first quarter. IFM Investors Pty Ltd now owns 1,138,469 shares of the software giant’s stock valued at $351,001,000 after purchasing an additional 196,338 shares during the period.  Altus Wealth Group LLC increased its holdings in  Microsoft by 1.2% during the 1st quarter. Altus Wealth Group LLC now owns 12,712 shares of the software giant’s stock worth $3,919,000 after purchasing an additional 152 shares during the period.  Powell Investment Advisors LLC raised its position in  Microsoft by 16.2% in the 1st quarter. Powell Investment Advisors LLC now owns 2,578 shares of the software giant’s stock valued at $795,000 after purchasing an additional 359 shares in the last quarter.  Finally, Onyx Bridge Wealth Group LLC boosted its stake in shares of  Microsoft by 8.2% in the 1st quarter. Onyx Bridge Wealth Group LLC now owns 6,782 shares of the software giant’s stock valued at $1,921,000 after buying an additional 512 shares during the period. Hedge funds and other institutional investors own  71.13% of the company’s stock. The stock has a 50-day moving average price of $409.02 and a 200 day moving average price of $373.03. The company has a quick ratio of 1.20, a current ratio of 1.22 and a debt-to-equity ratio of 0.19. The firm has a market capitalization of $3.13 trillion, a price-to-earnings ratio of 38.12, a P/E/G ratio of 2.28 and a beta of 0.89. Microsoft (NASDAQ:MSFT – Get Free Report) last posted its earnings results on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, beating the consensus estimate of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The firm had revenue of $62.02 billion for the quarter, compared to analyst estimates of $61.14 billion. During the same quarter in the prior year, the company posted $2.32 earnings per share. Microsoft’s revenue for the quarter was up 17.6% compared to the same quarter last year.  On average, analysts forecast that  Microsoft Co. will post 11.63 EPS for the current year. The business also recently disclosed a quarterly dividend, which will be paid on Thursday, June 13th. Stockholders of record on Thursday, May 16th will be given a dividend of $0.75 per share. The ex-dividend date of this dividend is Wednesday, May 15th. This represents a $3.00 annualized dividend and a dividend yield of 0.71%. Microsoft’s dividend payout ratio  is presently 27.12%. (Get Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Stoke Therapeutics (NASDAQ:STOK) Shares Gap Up  After Analyst Upgrade Amazon.com (NASDAQ:AMZN) Stock Price Down 0.1% on Insider Selling "
}