{
    "title": "Rockland Trust Co. Sells 21,375 Shares of American International Group, \nInc. (NYSE:AIG)",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-aig-sec-filing-2024-03-21/",
    "text": "Rockland Trust Co. decreased its holdings in shares of American International Group, Inc. (NYSE:AIG - Free Report) by 17.1% in the fourth quarter, according to its most recent 13F filing with the Securities and Exchange Commission (SEC). The fund owned 103,813 shares of the insurance provider's stock after selling 21,375 shares during the period. Rockland Trust Co.'s holdings in American International Group were worth $7,033,000 at the end of the most recent reporting period. A number of other hedge funds and other institutional investors have also bought and sold shares of the business. OFI Invest Asset Management bought a new position in shares of American International Group in the 3rd quarter worth approximately $26,000. Headlands Technologies LLC purchased a new position in shares of American International Group in the 3rd quarter worth $32,000. CNB Bank purchased a new position in shares of American International Group in the 3rd quarter worth $42,000. SouthState Corp boosted its stake in shares of American International Group by 41.7% in the 3rd quarter. SouthState Corp now owns 737 shares of the insurance provider's stock worth $45,000 after buying an additional 217 shares during the last quarter. Finally, Macroview Investment Management LLC boosted its stake in shares of American International Group by 48,800.0% in the 3rd quarter. Macroview Investment Management LLC now owns 978 shares of the insurance provider's stock worth $59,000 after buying an additional 976 shares during the last quarter. Institutional investors own 88.57% of the company's stock. AIG traded up $0.67 on Thursday, hitting $77.41. The company had a trading volume of 3,839,902 shares, compared to its average volume of 4,065,567. The company has a market cap of $52.71 billion, a PE ratio of 15.51, a PEG ratio of 1.06 and a beta of 1.02. American International Group, Inc. has a 12-month low of $45.66 and a 12-month high of $77.48. The company has a quick ratio of 0.31, a current ratio of 0.31 and a debt-to-equity ratio of 0.44. The business's fifty day simple moving average is $70.96 and its 200 day simple moving average is $66.12. American International Group (NYSE:AIG - Get Free Report) last announced its quarterly earnings results on Wednesday, February 14th. The insurance provider reported $1.79 earnings per share (EPS) for the quarter, beating analysts' consensus estimates of $1.59 by $0.20. The firm had revenue of $1.00 million during the quarter, compared to analyst estimates of $11.61 billion. American International Group had a return on equity of 10.68% and a net margin of 7.78%. American International Group's quarterly revenue was up .0% on a year-over-year basis. During the same quarter in the previous year, the business earned $1.36 earnings per share. Equities research analysts expect that American International Group, Inc. will post 7.11 EPS for the current year. The firm also recently disclosed a quarterly dividend, which will be paid on Thursday, March 28th. Investors of record on Thursday, March 14th will be paid a $0.36 dividend. This represents a $1.44 dividend on an annualized basis and a yield of 1.86%. The ex-dividend date of this dividend is Wednesday, March 13th. American International Group's dividend payout ratio (DPR) is 28.86%. In other American International Group news, Director John C. Inglis purchased 659 shares of American International Group stock in a transaction dated Thursday, March 14th. The shares were acquired at an average cost of $75.39 per share, with a total value of $49,682.01. Following the completion of the transaction, the director now owns 659 shares in the company, valued at approximately $49,682.01. The transaction was disclosed in a filing with the SEC, which is available at this link. In other news, Director John C. Inglis bought 659 shares of the business's stock in a transaction that occurred on Thursday, March 14th. The shares were purchased at an average cost of $75.39 per share, with a total value of $49,682.01. Following the transaction, the director now directly owns 659 shares in the company, valued at $49,682.01. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this link. Also, CEO Peter Zaffino sold 333,000 shares of the company's stock in a transaction on Friday, March 15th. The shares were sold at an average price of $75.87, for a total value of $25,264,710.00. Following the completion of the transaction, the chief executive officer now directly owns 505,420 shares in the company, valued at $38,346,215.40. The disclosure for this sale can be found here. Insiders own 0.49% of the company's stock. A number of equities analysts have recently issued reports on the company. Bank of America downgraded American International Group from a \"buy\" rating to a \"neutral\" rating and raised their price target for the stock from $75.00 to $77.00 in a research note on Tuesday, February 20th. Royal Bank of Canada lifted their target price on American International Group from $76.00 to $80.00 and gave the company an \"outperform\" rating in a research report on Thursday, February 15th. BMO Capital Markets lowered their target price on American International Group from $83.00 to $81.00 and set an \"outperform\" rating on the stock in a research report on Thursday, February 15th. UBS Group lifted their target price on American International Group from $83.00 to $84.00 and gave the company a \"buy\" rating in a research report on Thursday, February 22nd. Finally, HSBC began coverage on American International Group in a research report on Thursday, December 28th. They set a \"buy\" rating and a $86.00 target price on the stock. Eight research analysts have rated the stock with a hold rating and nine have issued a buy rating to the stock. Based on data from MarketBeat.com, American International Group has an average rating of \"Moderate Buy\" and an average target price of $74.06. Get Our Latest Report on American International Group American International Group, Inc offers insurance products for commercial, institutional, and individual customers in North America and internationally. It operates through three segments: General Insurance, Life and Retirement, and Other Operations. The General Insurance segment provides commercial and industrial property insurance, including business interruption and package insurance that cover exposure to made and natural disasters; general liability, environmental, commercial automobile liability, workers' compensation, excess casualty, and crisis management insurance products; and professional liability insurance.Further ReadingFive stocks we like better than American International GroupBest Stocks Under $10.00 Google and Meta Circling the Market on a TikTok Ban RallyThe 3 Best Retail Stocks to Shop for in AugustIntuitive Machines: Charting a Course Among the StarsStock Dividend Cuts Happen Are You Ready?KB Home’s Stock Price Can Move Higher, Here’s Why  Before you consider American International Group, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and American International Group wasn't on the list. While American International Group currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Growth stocks offer a lot of bang for your buck, and we've got the next upcoming superstars to strongly consider for your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}