{
    "title": "Xbox on the Go: Microsoft Tests Portable Powerhouse to Challenge Rivals",
    "date": "3/27/2024",
    "url": "https://www.financial-world.org/news/news/games/25476/xbox-on-the-go-microsoft-tests-portable-powerhouse-to-challenge-rivals/",
    "text": "According to a report by Microsoft reporter Jez Corden on the Xbox Two Podcast, Microsoft is testing portable Xbox prototypes behind closed doors The portable console market has been on a meteoric rise since the triumphant arrival of the Nintendo Switch in 2017. The momentum has further escalated in recent years with the advent of gaming laptops such as the Steam Deck. Now, after years of whispers and rumors, it looks like Microsoft is finally getting into the portable Xbox fray. The concept of a portable Xbox has stuck around since the days when the PSP ruled school playgrounds. With the resurgence of portable gaming, Microsoft seems to be taking this idea seriously. According to Jez Corden, Microsoft's respected reporter on the Xbox Two Podcast, the company is currently testing prototypes for the portable Xbox behind closed doors. These prototypes are reportedly codenamed \"Keystone\" and are said to be \"fully native,\" indicating that Microsoft isn't aiming for a cloud-only device. Instead, they envision a system that can run powerful titles like Halo, Forza, and Starfield directly on the hardware. This is not uncharted territory for Microsoft. The company is known for constantly experimenting with new hardware concepts, many of which never see the light of day. One recent public example was the Xbox Keystone, which appeared ready for production before Microsoft pulled the plug. It is also possible that these prototypes serve an internal purpose, helping to develop new software features optimized for portable experiences. Additionally, Microsoft has confirmed their desire to modify Windows to work better on touch-capable portable devices. The potential arrival of the portable Xbox brings a fascinating twist to the ever-evolving gaming landscape. With established players like Nintendo and the growing power of Steam Deck, competition is fierce. The success of Microsoft's entry depends on several factors. Will it boast high-end hardware that can rival its console counterparts? Can it offer a robust library of native games to satisfy gamers on the go? Most importantly, will it provide a seamless and enjoyable experience that stands out in a crowded market? Although Microsoft has been trying a lot lately to catch up with the competition, a failure in the case of a portable console would certainly deepen the gaming crisis that the company has been experiencing for the past few years. But it is also an opportunity, and we will see if Microsoft will know how to use it. "
}