{
    "title": "Options Technology Achieves Microsoft Cloud Security Specialization, \nSolidifying Commitment to Excellence in ...",
    "date": "3/13/2024",
    "url": "https://siliconcanals.com/news/business-wire/options-technology-achieves-microsoft-cloud-security-specialization-solidifying-commitment-to-excellence-in-security-solutions/",
    "text": "NEW YORK–(BUSINESS WIRE)–Options Technology (Options), a leading provider of cloud-enabled managed services to the global financial sector, proudly announces its achievement of the Microsoft Cloud Security Specialization. This prestigious designation is the next step in Options’ journey towards excellence in security solutions, building on the solution designations secured in 2023 and Gold Competencies obtained in 2021 and 2022.  The Microsoft Cloud Security Specialization recognizes Options’ expertise and proficiency in implementing and managing security solutions built on Microsoft technology. This specialization covers a comprehensive range of technologies, including Azure Arc, Defender EDR, Defender for Identity, Azure Sentinel, Conditional Access, and Azure DevOps. Marlena Efstratopoulou, Chief Information Security Officer at Options, commented, “Achieving the Microsoft Cloud Security Specialization is a testament to our dedication to staying at the forefront of security innovation. These technologies are redefining the landscape of security, enabling us to provide our clients with cutting-edge solutions that effectively safeguard their assets and data.” Danny Moore, President, and CEO of Options, added, “We are incredibly proud of our team’s achievement in attaining the Microsoft Cloud Security Specialization. It reflects our unwavering commitment to excellence and our relentless pursuit of delivering best-in-class security solutions for our clients. By designing, building, and operating Microsoft-based solutions for global financial sector firms, we are one step closer to realizing our vision of being the best in the world.” With the Microsoft Cloud Security Specialization, Options continues to demonstrate its leadership in providing secure, reliable, and innovative solutions tailored to the unique needs of financial institutions worldwide.  Today’s news comes as the latest in a series of exciting developments for Options Technology, including its recent Three –Day Microsoft Copilot Workshop held in Belfast, its 13th consecutive year of SOC compliance and its promotion of Marlena Efstratopoulou to Chief Information Security Officer (CISO). Options Technology: Options Technology (Options) is a financial technology company at the forefront of banking and trading infrastructure. We serve clients globally with offices in New York, London, Belfast, Cambridge, Chicago, Hong Kong, Tokyo, Singapore, Paris, and Auckland. At Options, our services are woven into the hottest trends in global technology, including high-performance Networking, Cloud, Security, and AI (Artificial Intelligence). Contacts For media inquiries, please contact:\nNiall McAleer, [email protected] march No Events april 09aprAll DayAWS Summit Amsterdam Gear up for AWS Summit Amsterdam 2024 — an event where you’ll explore how the cloud accelerates innovation for businesses of all sizes. Enhance your AWS platform skills through various Gear up for AWS Summit Amsterdam 2024 — an event where you’ll explore how the cloud accelerates innovation for businesses of all sizes. Enhance your AWS platform skills through various interactive sessions, and broaden your horizons with expert talks and workshops. Elevate your startup journey by connecting with experts and peers in our exclusive Startup Loft space. Gain insights from lightning topics, explore impressive demos, take advantage of the opportunity to ask technical questions at our Ask the Expert bar, and more. Connect with industry leaders and immerse yourself in technical brilliance. Secure your spot by registering now! more CalendarGoogleCal All Day (Tuesday)(GMT+02:00) RAI Amsterdam Europaplein 24, 1078 GZ Amsterdam, Netherlands Learn More 16aprAll Day180100 Conference Europe 202415% discount Zero One Hundred Conferences organises events for private equity and venture capital professionals worldwide, connecting 250-1000 senior-level participants, including general and limited partners from diverse sectors like family  Zero One Hundred Conferences organises events for private equity and venture capital professionals worldwide, connecting 250-1000 senior-level participants, including general and limited partners from diverse sectors like family offices, high net worth individuals, and corporations.   The event’s curated guest list includes institutional LPs such as Abrdn, Access Capital Partners, Adams Street Partners, AlpInvest Partners, Alpha Associates, Arcano, Banca d’Italia, Coller Capital, EIF, IMAS Foundation, Isomer Capital, Moravia Capital Investments, PGB Pensioendiensten, Pensioenfonds Rail&OV, Quilvest Capital Partners, SwanCap Partners, Yielco Investments.   Additionally, individual LPs like Asia Capital Advisor, Beamonte Investments, Corecam Capital, Felman Family Office, Haflo, MJ & Cie, Portero Capital Family Office, Saber Capital, The Valkin Group, The Li Family Office, Top Tier Access bring a diverse perspective to the event.   Unlock networking opportunities with 1-on-1 networking sessions and a dedicated platform for scheduling meetings and connecting on LinkedIn. For a more personal touch, join the exclusive side events, transcending surface-level interactions. Past highlights include a cocktail masterclass, a gala dinner on a historic boat, secret garden networking, and boat-based wine and cheese tastings.   Gain valuable insights into the current landscape from senior decision-makers through panel discussions, keynote presentations, workshops, and more. The event’s speakers share on-stage and off-stage perspectives derived from their extensive experience.     The event offers three ticket categories (see below) to ensure the conference serves its target audience. Please review the eligibility criteria before registering: 1. Limited Partner Pass (Complimentary):To qualify for a complimentary pass, you must actively invest in PE/VC funds and represent one of the following organisations: a pension fund, insurance company, sovereign wealth fund, private wealth manager, secondary LP, fund of funds, foundation, endowment, trust, banking institution, family office or corporate investment division. Please note that all LP ticket applications will be reviewed for eligibility! 2. General Partner Pass (Paid):This ticket is reserved for fund managers actively investing in companies. 3. Service Providers & Others (Paid):This ticket is available for all companies and individuals not eligible for the LP or GP categories, for instance, accounting firms, accelerators, auditors, business angels, business development companies, commercial banks, crowdfunding platforms, financing advisory firms, fund administrators, incubators, investment banks, law firms, management consultants, placement agents, placement banks, recruiting firms, software providers, startups, target firms, valuation firms etc.     Paul van Vlissingenstraat 24, 1096 BK Amsterdam, Netherlands     Use code SIL15EUR for a 15% discount.   more CalendarGoogleCal april 16 (Tuesday) - 18 (Thursday)(GMT+02:00) Silicon Canals © 2014-2023 | Design: Bright Idiots. Images: Depositphotos Silicon Canals © 2014-2023 | Design: Bright Idiots. Images: Depositphotos "
}