{
    "title": null,
    "date": "3/16/2024",
    "url": "https://tech.co/news/microsoft-fully-remote-jobs-march",
    "text": "Remote work became all the rage during the pandemic. While the working world has returned to a sense of normalcy, lots of companies continue to offer remote work as an option, so millions of workers are still spending more time at home than in the office – or not commuting in at all. The trend shows very few signs of letting up, either. In 2024, the planet's biggest tech companies are opening up hundreds of new remote jobs in offices all across the globe – and industry giants Microsoft and Google are leading the way. In this guide, we’ve compiled the best remote jobs currently open at Microsoft in March 2024, explained some of the pros and cons of working remotely, and some of the benefits and perks on offer from Microsoft. Verifying Get the latest tech news, straight to your inbox Stay informed on the top business tech stories with Tech.co's weekly highlights reel. By signing up to receive our newsletter, you agree to our Privacy Policy. You can unsubscribe at any time. We’ve leafed through the Microsoft careers portal for job listings with the tag “up to 100% work from home”. There are currently 1320 jobs available with this as an option, and here are some of the most exciting opportunities: Much like in-office work, there are advantages and disadvantages to working remotely. And, if you’ve never had a remote job before, it’s good to be aware of these before you start hunting. Perhaps the biggest, most direct advantage of working from home is being able to skip out on the commute. In 2023, it was confirmed that the average US remote worker says 55 minutes a day avoiding the dreaded journey into the office. Along with clawing some time back each working day, remote workers often highlight the added flexibility that working from home brings is one of it biggest advantages. You'll probably feel this benefit most if you have children  – and you'll save significantly on childcare costs while you're at it. Remote working arrangements also make it possible for young people to travel the world while maintaining a steady job – a class of workers now referred to as digital nomads. 🔎 Want to browse the web privately? 🌎 Or appear as if you're in another country?Get a huge 86% off Surfshark with this special tech.co offer. There are some disadvantages though. One recent study suggested that remote workers are more likely to be overlooked for promotions, and anyone who’s participated in a disjointed team Zoom call will know that there’s nothing quite like face-to-face meetings. Big tech companies are notorious for providing endless streams of work perks and benefits, but Microsoft really pushes the envelope in this regard. The company will “give you time away to focus on the people who matter most with leave for new parents and family caregiver leave, adoption assistance, parenting classes, and family support programs” the company explains on their website, “as well as subsidized and discounted childcare and back-up care for children, adults, and elders.” The company also hands out bonuses to employees regularly and awards new hires with stock as soon as they join. On company review portal Glassdoor, which compiles ratings from former and current employees of businesses, Microsoft's current score is 4.4/5 – a little higher than Apple’s 4.2/5. A good employee is a good employee, whether they’re working in an office, or remotely – but that hasn't stopped managers and business owners questioning how productive their staff are when they’re away from the office. If you’re interviewing for a fully remote role, it’s always good to emphasize that you can work independently and autonomously. If you can provide examples of times when you’ve done this, that'll make you an even stronger candidate for a remote role. In a nutshell, people hiring into remote roles want self-motivated go-getters who don’t need to have their hand held through tasks, and are comfortable problem solving on their own. Being a good remote employee is all about taking responsibility and initiative. If you think you have what it takes, head over to the Microsoft careers page and start applying today. Verifying Get the latest tech news, straight to your inbox Stay informed on the top business tech stories with Tech.co's weekly highlights reel. By signing up to receive our newsletter, you agree to our Privacy Policy. You can unsubscribe at any time. We're sorry this article didn't help you today – we welcome feedback, so if there's any way you feel we could improve our content, please email us at contact@tech.co Customers believe that Copilot doesn't match up to ChatGPT... Currently, the beta is available to a select number of... A new study found that the cost of commuting and the low... Some remote jobs aren't quite as flexible as they seem, but... "
}