{
    "title": null,
    "date": "3/12/2024",
    "url": "https://www.zacks.com/stock/news/2239149/3-stocks-to-watch-as-videogame-sales-make-steady-rebound",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Ritujay Ghosh\n                    March 12, 2024 MSFT Quick QuoteMSFT EA Quick QuoteEA LNW Quick QuoteLNW Better trading starts here. You follow Analyst Blog - edit You follow Ritujay Ghosh - edit Ritujay Ghosh Analyst Blog The U.S. videogame industry has been trying to stage a rebound that saw sales rise in 2023, and the momentum continues this year. Cooling inflation and easing price pressure are helping consumers spend more on discretionary items lately, giving a boost to videogame sales. According to a report from the Entertainment Software Association and Circana, spending on videogames in the United States totaled $57.2 billion in 2023, up from $56.6 billion in 2022. This included sales across all categories including physical and digital full-game, downloadable content, portable PC, subscription spending across consoles and virtual reality platforms. Spending on content totaled $48 billion last year, up from $47.5 billion in 2022. This was primarily driven by a 13% jump in digital download spending across console games. Hardware sales were steady, totaling $6.6 billion in 2023, while accessories sales rose 4% to $2.6 billion from $2.5 billion in 2022. Videogame sales hit record highs during the peak of the pandemic, as consumers invested more in indoor entertainment. However, the situation changed fast once the pandemic-led restrictions were lifted and the economy reopened. Options for outdoor entertainment were back. This saw videogame sales decline in 2021, and take a turn for the worse in 2022 as inflationary pressures started hitting consumer spending. The Federal Reserve adopted a strict monetary tightening campaign and hiked interest rates by 525 basis points since March 2022. Higher prices made consumers cut down on spending on discretionary goods. Also, a dearth of good title releases in 2022 further impacted sales. However, inflation started easing from its peak of 9.1% in June 2022 and is now hovering around 3.1%. Easing prices have been helping people spend more freely. Also, last year saw a spate of new title releases, which started attracting gamers to the market. The industry is poised to grow in the near term as the Federal Reserve gears up to start rate cuts this year, which will further ease price pressures. Microsoft Corporation (MSFT Quick QuoteMSFT  -  Free Report)     is one of the leading videogame makers and manufacturers of hardware and accessories. MSFT has been expanding its footprint in the industry and is a pioneer in consoles. For the current year, Microsoft’s expected earnings growth rate is 18.6%. The Zacks Consensus Estimate for current-year earnings has improved 4.4% over the past 60 days. MSFT has a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Light & Wonder, Inc. (LNW Quick QuoteLNW  -  Free Report)     is a leading developer of technology-based products and services and associated content for the gaming, social and digital gaming industries globally. LNW operates under three operating segments — Gaming, SciPlay and iGaming. Light & Wonder’s expected earnings growth rate for the current year is 113.7%. The Zacks Consensus Estimate for current-year earnings has improved 6.3% over the past 60 days. LNW presently carries a Zacks Rank 3 (Hold). Electronic Arts (EA Quick QuoteEA  -  Free Report)     is a leading developer, marketer, publisher and distributor of interactive games (video game software and content). EA distributes gaming content and services through multiple distribution channels as well as directly to consumers (online and wirelessly) through its online portals. EA’s games can be played on video consoles, personal computers, mobile devices, tablets and electronic readers. Electronic Arts’ expected earnings growth rate for the current year is 29.7%. The Zacks Consensus Estimate for current-year earnings has improved 0.8% over the past 60 days. Currently, EA holds a Zacks Rank 3. Microsoft Corporation (MSFT) - $25 value - yours FREE >> Electronic Arts Inc. (EA) - $25 value - yours FREE >> Light & Wonder, Inc. (LNW) - $25 value - yours FREE >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}