{
    "title": "Security National Financial (NASDAQ:SNFCA) Cut to Buy at StockNews.com",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-snfca-downgrade-2024-03-18/",
    "text": "Security National Financial (NASDAQ:SNFCA - Get Free Report) was downgraded by stock analysts at StockNews.com from a \"strong-buy\" rating to a \"buy\" rating in a note issued to investors on Monday.Get SNFCA alerts:Sign UpSecurity National Financial Stock Down 7.7 % Shares of NASDAQ:SNFCA traded down $0.64 during midday trading on Monday, reaching $7.66. 63,453 shares of the company were exchanged, compared to its average volume of 26,703. The firm has a market cap of $176.03 million, a PE ratio of 5.32 and a beta of 0.92. Security National Financial has a fifty-two week low of $5.62 and a fifty-two week high of $9.75. The stock has a fifty day simple moving average of $8.14 and a two-hundred day simple moving average of $8.09. Hedge Funds Weigh In On Security National Financial Hedge funds have recently modified their holdings of the stock. BlackRock Inc. boosted its holdings in shares of Security National Financial by 2.2% in the 1st quarter. BlackRock Inc. now owns 118,016 shares of the credit services provider's stock valued at $1,180,000 after buying an additional 2,555 shares during the last quarter. Dimensional Fund Advisors LP grew its position in shares of Security National Financial by 1.1% in the 1st quarter. Dimensional Fund Advisors LP now owns 319,425 shares of the credit services provider's stock valued at $3,195,000 after acquiring an additional 3,601 shares during the period. State Street Corp raised its holdings in shares of Security National Financial by 11.1% in the 1st quarter. State Street Corp now owns 43,145 shares of the credit services provider's stock valued at $431,000 after purchasing an additional 4,294 shares during the period. Citadel Advisors LLC acquired a new stake in Security National Financial in the 3rd quarter valued at about $100,000. Finally, Susquehanna International Group LLP acquired a new position in Security National Financial during the fourth quarter worth approximately $190,000. Institutional investors own 34.86% of the company's stock. Security National Financial Company Profile (Get Free Report) Security National Financial Corporation engages in the life insurance, cemetery and mortuary, and mortgage businesses. The company's Life Insurance segment is involved in selling and servicing lines of life insurance, annuity products, and accident and health insurance. It offers various life insurance products, including funeral plans and interest-sensitive life insurance, as well as other traditional life, accident, and health insurance products; annuity products comprising single and flexible premium deferred annuities, and immediate annuities; and diver's accident policies.See AlsoFive stocks we like better than Security National FinancialIndustrial Products Stocks Investing Walmart: Here’s Your Chance to Get in Cheaper in 2024How Investors Can Find the Best Cheap Dividend StocksInsider Selling of Amazon Spikes in Q1, but it's Not Time to Sell3 Must-Buy Warren Buffett Stocks for Volatile Times2 Deep Value, High Yield Stocks With a Double-Digit Upside This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Security National Financial, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Security National Financial wasn't on the list. While Security National Financial currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering what the next stocks will be that hit it big, with solid fundamentals? Click the link below to learn more about how your portfolio could bloom. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}