{
    "title": "Microsoft is bringing together Surface and Windows under single team again",
    "date": "3/25/2024",
    "url": "https://mspoweruser.com/mikhail-parakhin-who-earlier-revealed-that-sora-will-come-to-copilot-might-leave-microsoft/",
    "text": "Follow us Share this article Improve this guide 2 min. read Published on March 26, 2024 published on \n\nMarch 26, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Microsoft is reorganizing its Windows and Surface teams under a single leader, Pavan Davuluri, in a move that is a “holistic approach” to building silicon, systems, experiences, and devices for the AI era. The changes come after Panos Panay’s surprise departure to Amazon last year, which had split the Windows and Surface groups under two different leaders In an internal memo obtained by The Verge, Rajesh Jha, Microsoft’s head of experiences and devices, announced that both Windows and Surface will now fall under Davuluri’s responsibility, as Parakhin “has decided to explore new roles.” Personally, I am gutted by this move. Mikhail Parakhin is a very active person on the internet, sharing insightful information all the time; I hope we get something similar from Davuluri or maybe his team. The reorganization comes just days after former Inflection AI CEO Mustafa Suleyman joined Microsoft as the CEO of a new AI team that will handle the company’s consumer-facing AI products like Copilot, Bing, and Edge. According to Jha’s memo, the Windows team will work together with the Microsoft AI team on AI, silicon, and experiences, but there could be potential overlaps as the AI team now looks after Edge, a key part of the Windows experience. Davuluri, who has worked at Microsoft for over 23 years and was deeply involved in the company’s work with Qualcomm and AMD to create custom Surface processors, will report directly to Jha. Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}