{
    "title": "Orgel Wealth Management LLC Cuts Stock Position in Microsoft Co. \n(NASDAQ:MSFT)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/orgel-wealth-management-llc-cuts-stock-position-in-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Orgel Wealth Management LLC lessened its holdings in  Microsoft Co. (NASDAQ:MSFT – Free Report) by 2.8% during the fourth quarter, HoldingsChannel.com reports. The fund owned 6,704 shares of the software giant’s stock after selling 195 shares during the quarter. Orgel Wealth Management LLC’s holdings in Microsoft were worth $2,521,000 at the end of the most recent quarter. A number of other hedge funds have also made changes to their positions in the business. Affinity Wealth Management LLC grew its holdings in  Microsoft by 2.7% during the 4th quarter. Affinity Wealth Management LLC now owns 33,338 shares of the software giant’s stock valued at $12,537,000 after purchasing an additional 882 shares in the last quarter.  17 Capital Partners LLC acquired a new stake in  Microsoft during the 4th quarter valued at $3,850,000.  Joule Financial LLC acquired a new stake in  Microsoft during the 4th quarter valued at $1,592,000.  Avity Investment Management Inc. grew its holdings in  Microsoft by 3.9% during the 4th quarter. Avity Investment Management Inc. now owns 121,715 shares of the software giant’s stock valued at $45,770,000 after purchasing an additional 4,604 shares in the last quarter.  Finally, Talbot Financial LLC grew its holdings in  Microsoft by 2.1% during the 4th quarter. Talbot Financial LLC now owns 204,758 shares of the software giant’s stock valued at $76,997,000 after purchasing an additional 4,164 shares in the last quarter. Hedge funds and other institutional investors own  71.13% of the company’s stock. MSFT has been the subject of a number of recent analyst reports. China Renaissance initiated coverage on shares of Microsoft in a report on Tuesday, December 5th. They set a “buy” rating and a $466.00 price target for the company. Jefferies Financial Group  reaffirmed a “buy” rating and set a $465.00 price target on shares of Microsoft in a report on Wednesday, March 6th. KeyCorp assumed coverage on shares of Microsoft in a report on Thursday, March 21st. They set an “overweight” rating and a $490.00 price objective for the company. Truist Financial  reissued a “buy” rating and set a $600.00 price objective on shares of Microsoft in a report on Monday, March 25th. Finally, Barclays raised their price objective on shares of Microsoft from $421.00 to $475.00 and gave the stock an “overweight” rating in a report on Wednesday, January 31st. Four research analysts have rated the stock with a hold rating and thirty-six have given a buy rating to the company’s stock. According to MarketBeat.com, Microsoft  has an average rating of “Moderate Buy” and an average price target of $423.34. Read Our Latest Research Report on MSFT MSFT stock opened at $420.72 on Friday. Microsoft Co. has a 52 week low of $275.37 and a 52 week high of $430.82. The company has a market capitalization of $3.13 trillion, a price-to-earnings ratio of 38.04, a price-to-earnings-growth ratio of 2.24 and a beta of 0.89. The firm’s 50-day moving average is $410.82 and its two-hundred day moving average is $374.31. The company has a current ratio of 1.22, a quick ratio of 1.20 and a debt-to-equity ratio of 0.19. Microsoft (NASDAQ:MSFT – Get Free Report) last released its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, topping analysts’ consensus estimates of $2.76 by $0.17. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. The company had revenue of $62.02 billion for the quarter, compared to the consensus estimate of $61.14 billion. During the same period in the previous year, the firm earned $2.32 EPS. Microsoft’s revenue was up 17.6% on a year-over-year basis.  On average, analysts forecast that  Microsoft Co. will post 11.63 earnings per share for the current fiscal year. The business also recently declared a quarterly dividend, which will be paid on Thursday, June 13th. Shareholders of record on Thursday, May 16th will be given a dividend of $0.75 per share. The ex-dividend date of this dividend is Wednesday, May 15th. This represents a $3.00 dividend on an annualized basis and a dividend yield of 0.71%. Microsoft’s dividend payout ratio (DPR) is 27.12%. In other news, EVP Kathleen T. Hogan sold 21,955 shares of Microsoft stock in a transaction that occurred on Monday, March 11th. The shares were sold at an average price of $403.96, for a total value of $8,868,941.80. Following the transaction, the executive vice president now owns 159,764 shares of the company’s stock, valued at approximately $64,538,265.44. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. In other news, EVP Kathleen T. Hogan sold 21,955 shares of Microsoft stock in a transaction that occurred on Monday, March 11th. The shares were sold at an average price of $403.96, for a total value of $8,868,941.80. Following the transaction, the executive vice president now owns 159,764 shares of the company’s stock, valued at approximately $64,538,265.44. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, major shareholder Corp Microsoft sold 1,000,000 shares of Microsoft stock in a transaction that occurred on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total transaction of $1,950,000.00. Following the completion of the transaction, the insider now directly owns 11,677,398 shares in the company, valued at approximately $22,770,926.10. The disclosure for this sale can be found here. In the last three months, insiders have sold 1,070,258 shares of company stock worth $30,690,456. 0.03% of the stock is owned by corporate insiders. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Microsoft Co. (NASDAQ:MSFT) Position Increased by Affinity Wealth Management LLC Microsoft Co. (NASDAQ:MSFT) Stake Decreased by Galvin Gaustad & Stein LLC "
}