{
    "title": "AI regs, innovation must move at 'same speed': Microsoft Pres.",
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/video/ai-regs-innovation-must-move-180504648.html",
    "text": "The generative AI boom has continued to run markets and conversations, whereas the future of AI regulation is still unclear. Speaking with Yahoo Finance's Julie Hyman and Brian Sozzi World Economic Forum in Davos, Switzerland, Microsoft (MSFT) Vice Chair President Brad Smith discusses the company's plans to expand its AI capabilities, calling generative AI \"the defining technology of our lifetime, certainly this decade without question.\" While acknowledging \"there's always a risk of technology being overhyped,\" Smith believes generative AI is truly \"transformational,\" with the power to fundamentally reshape workflows and daily lives for businesses and consumers. By augmenting Microsoft products with AI tools like Copilot, Smith notes the tech giant's aim is to make products \"more useful for people.\" Asked about rapid AI advancement, Smith doesn't think it's progressing too quickly, but stresses the need to move forward with \"with safety and innovation at the same speed\" through collaborative governance. \"Of course, there's a risk that in some ways regulation will go too far, there always is,\" Smith says. However, given social media's unchecked rise previously, he argues \"we don't want to do that a second time\" with AI. It's all part of Yahoo Finance's exclusive coverage from the World Economic Forum in Davos, Switzerland, where our team will speak to top decision-makers as well as preeminent leaders in business, finance, and politics about the world’s most pressing issues and priorities for the coming year. Watch this full episode of Yahoo Finance Live here. Editor's note: This article was written by Angel Smith. [AUDIO LOGO] BRIAN SOZZI: All right, team Smith, Seana Smith, Brad Smith. Here with another Smith, Brad Smith. That is Microsoft vice chair and president. Good to see you. Thanks for coming on with us. We've talked to almost 40 CEOs this week. And at least half of them told us they're using Microsoft Copilot. And I've been trying to keep track to the extent I could. We know Copilot, what's next for Microsoft on the AI front? BRAD SMITH: Well, first of all, I think what we're doing is bringing Copilots to more products. We're continuing to add features and functionality to each of the Copilots that we have, making them more useful for people. And then you'll see new iterations of our AI technology and more to come. And let me just say, stay tuned, watch this space. JULIE HYMAN: We talked to someone this week who said, this is the first time at two consecutive Davos that it's been really the same theme dominating, and that's generative AI. Generative AI, specifically, although AI more generally is everywhere. Is it too much or we put too many expectations on this technology that's going to change everything? BRAD SMITH: Well, I do think that there is always a risk of technology being overhyped. That's the history of the tech sector. In this instance, I think this is one technology that will live up to the impact that people expect, which is to say, it will be greatly transformational for organizations, for businesses, for countries, for society. I do think one has to worry a little bit that people can get so exuberant that they lose sight of everything else that is important in the world. And we need to recognize, this is a phenomenon that will unfold over a decade at least. But that said, it is quite possibly the defining technology of our lifetime, certainly this decade, I think, without question. BRIAN SOZZI: Is it Microsoft's race to lose? BRAD SMITH: I think it's a number of companies race to win. And I think one of those potential winners is certainly Microsoft, Microsoft in partnership with OpenAI. We feel very good about the momentum we have, we feel great about the work that OpenAI is doing. And I think you captured what's so important. We're creating applications like our Copilots that I think are delivering real value to people. I use it, get feedback from others. I guess we still have half the CEOs that we have to reach that we haven't yet. But people are finding that it makes me, for example, more creative. It makes me more productive. If I hit a block, I turn to it and I then find there's some new inspiration idea that breaks through. And more importantly and broadly, whether it's material science or molecular biology, drug discovery, healthcare, in all very specific areas, I think people are seeing that this is something that can make not just them more productive, but provide real solutions to problems that many people every day worry about. JULIE HYMAN: You mentioned OpenAI. And of course, there was the drama around OpenAI and Sam Altman last year that seemed at least in part from what we can understand, seemed at least in part to be over how quickly we should be moving and how carefully we need to be moving when it comes to generative AI. Are we moving too fast? BRAD SMITH: I don't think that the technology is moving too fast. I think we all have work to make sure that whether you're in government or a business or a nonprofit, we're moving forward what I call safety and innovation at the same speed. And I think we should look back at 2023 as a year when the technology race forward. And interestingly, so did the safety architecture. I mean, I feel very good about what OpenAI has been doing, what Microsoft has been doing, and others as well. It's not just us. But interestingly, governments are moving faster to put guardrails in place first on a voluntary basis then through laws and regulation. Then we have seen in the history of digital technology. And while people tend to focus on Europe and the AI Act, the United States with these White House commitments or executive order, they look for differences, and there are some. I think what we sometimes miss is there's a lot of similarity. Fundamentally, what governments are saying is that they want this technology to bring new opportunities. But they really do want to make sure it's safe, it's secure, that people's rights continue to be protected. And that's got to be right. And so we have to find ways to work together. And I take a lot of optimism from the fact that I think, in fact, we are and we're doing it at a rapid pace. BRIAN SOZZI: I was talking to the co-founder of Salesforce, Marc Benioff, and he had choice words to say about the lack of regulation for social media companies. Immediately got me thinking, well, will regulators come out and over regulate AI and just squash innovation? Do you worry about that? BRAD SMITH: Well, in a sense, one should worry about everything and you can worry about doing too much, you can worry about doing too little. And it's probably good because that increases the probability of getting it right. But what you heard from Mark is really what you hear from many people in governments around the world. They say, we let social media go forward without putting any laws in place. We don't want to do that a second time. And they're not. They're not going to. That is, I think, something that is very clear around the world. Of course, there's a risk that in some ways regulation will go too far, there always is. That's why I think it's so important that there be broad conversations, including at a place like Davos where you see people from government, people from civil society, nonprofits, people from tech all sitting down together. And there are sometimes some pretty vibrant debates spirited even. But there's starting to emerge, I think, some convergence. And I think that's encouraging. JULIE HYMAN: Finally, on a different topic. I want to ask you about something that's going on at one of your competitors right now. Google CEO Sundar Pichai telling the workforce there that there could be more job cuts coming this year. How are you thinking about the right size of the workforce at Microsoft and where those workers are deployed? BRAD SMITH: Well, I think when we look at Microsoft, broadly speaking, we would say that the number of employees that we have today is about the right number. That's the number that we're likely to have as we look to the future. And it doesn't mean that every job stays exactly where it is or the function. That's part of any organization and certainly any business. But we're not sitting here today where we were a year ago. A year ago, we were saying, gee, we had too many people, we had to downsize. We went from about 230,000 to 220,000. Today, we're very focused on capital investment, a huge data center AI infrastructure expansion on a global basis. But that doesn't mean we're going to have fewer people, it does mean that we're not going to be growing people jobs quite the way we were before. This is a capital intensive industry now, especially at the infrastructure level for AI. It's a different industry than it was before. JULIE HYMAN: So just to put a fine point on it, it sounds like you're not looking at large scale job cuts any time soon from Microsoft. BRAD SMITH: Yeah. Related Quotes "
}