{
    "title": "Microsoft Becomes the Second Company To Surpass the $3 Trillion Mark",
    "date": "1/24/2024",
    "url": "https://retailwire.com/microsoft-becomes-second-company-to-surpass-3-trillion-mark/",
    "text": "Logout Photo by Turag Photography on Unsplash January 24, 2024 Dennis Limmer Microsoft recently joined an elite league of tech companies by becoming the second company to achieve a $3 trillion market cap. This milestone was reached due to a surge in the company’s stock, motivated by the ascension of artificial intelligence (AI) in the tech scene. The company’s market value has now surpassed the entire GDP of France and is just shy of matching that of the United Kingdom. Specifically, Microsoft’s stock rose by nearly 1.5% to approximately $405 per share on Wednesday afternoon, pushing the market cap past the $3 trillion hurdle. The only other member of this elite club is Apple. Investors have been keen on Microsoft shares, which have increased more than 7% since the beginning of the year following a 40% jump last year. A significant chunk of this success is attributed to the surge in interest and investment in AI technology, perceived as a key growth driver for the company. In 2023, Microsoft’s CEO, Satya Nadella, made a strategic multibillion-dollar investment in AI. This included commercializing AI tools like ChatGPT before any competition could, thus strengthening Microsoft’s positioning in the AI landscape. Another crucial move by Nadella was to strengthen the bond with OpenAI, the creators of ChatGPT, during a significant restructuring at OpenAI. Apple had been leading the tech market for most of the past decade, but Microsoft pulled ahead, even if temporarily, to become the most valuable publicly traded company earlier in January. Microsoft is a member of the “Magnificent 7,” a term coined for seven significant stocks, including Apple, Nvidia, Amazon, Alphabet, Meta, and Tesla. These seven stocks have been instrumental in uplifting markets to new heights recently. Microsoft on its own makes up 7.3% of the S&P 500, and collectively, these seven companies boast a market cap larger than any country’s entire stock market, excluding the United States. Analysts from Bespoke Investment Group reported that Nvidia and Microsoft were responsible for about 75% of the S&P 500’s gain this year. Analysts at Morgan Stanley believe that Microsoft’s investment in AI is likely to strengthen further, moving their stock price target from $415 to $450. Similarly, Bank of America analysts have also moved their target to $450 per share, predicting promising growth for the Washington-based company this quarter. Recent News In a bid to beat rival platforms like Instagram and TikTok, YouTube has revealed that numerous creators are now monetizing their short videos on the platform and earning a sizable paycheck. Read More A Creator on YouTube Earns $20,000 a Month to Make 1-Minute VideosContinue As the battle to bring the most cost-effective electric vehicles to the market heats up, the Chinese smartphone company Xiaomi announced that its first electric car will go on sale for significantly less than Tesla’s Model 3. Read More Xiaomi Unveils EV $4K Cheaper Than Tesla’s Model 3Continue SpaceX CEO Elon Musk has proposed an ambitious plan to make travel to Mars affordable for the masses. Musk envisions a ticket price of $100,000, believing it could be achievable for most individuals through hard work and saving. Read More SpaceX’s ‘Affordable’ Journey to MarsContinue Kroger, the grocery chain, has announced the closure of three spoke facilities in its e-commerce operations in Texas and Florida. This decision marks a strategic shift for the company in its efforts to streamline operations and enhance efficiency. Read More Kroger Shuts Down E-Commerce Spoke Facilities in Texas and FloridaContinue Retail industry’s premier source for news, analysis, and discussion. © 2023 RetailWire · Privacy Policy · Community Guidelines · Sitemap Username or Email Address Password Remember Me  Lost your password? Don't have an account yet? Sign up "
}