{
    "title": "10 Top Rated Blue Chip Stocks Wall Street Analysts Are In Love With: \nJanuary 2024",
    "date": "1/21/2024",
    "url": "https://finance.yahoo.com/news/10-top-rated-blue-chip-214643275.html",
    "text": "In this piece, we will take a look at the ten top rated blue chip stocks Wall Street analysts are in love with in January 2024. If you want to skip our latest stock market coverage and want to take a look at the top five stocks in this list, then you can read 5 Top Rated Blue Chip Stocks Wall Street Analysts Are In Love With: January 2024. With 2024 officially in full flow, the stock markets are performing well. The NASDAQ 100 index is trading at all-time high level, and the S&P 500 joined it on January 19th when it touched 4,804 and crossed its previous all-time high reading of 4,796 recorded two years ago. The market as a whole appears to be entering 2024 with cautious optimism. Throughout 2023, investors battled with the Federal Reserve and economic data to time their bets and decipher Mr. Market's moves. Now, investors are trying to figure out whether the Federal Reserve's optimism through its interest rate hiking cycle in 2023 will prove warranted. The economy is performing well, in an interesting conundrum. While economic growth is always welcomed by the market, this time around, it accompanies concerns that perhaps a robust economy will also mean that the Fed feels comfortable keeping interest rates higher for longer. Throughout the interest rate hiking cycle, and especially last year, the Fed has maintained that a soft landing for the U.S. economy might be on the horizon. What this means is that while interest rate increases will slow down growth, there won't be a recession.  Should this be the case, then the pain for consumers in the form of job losses can be mitigated. Yet, even if the economy doesn't tip into recession, the system is already under stress from high interest rates. The start of the year has marked earnings reports from banks, and the consensus on that front is that while interest income is at all time high levels, bank deposit costs are also growing much faster than belt tightening managers would like. Some of the offending banks on this list are M&T Bank Corporation (NYSE:MTB), Discover Financial Services (NYSE:DFS), and KeyCorp (NYSE:KEY). Discovery, known for its digital banking services that provide branch less banking and loans, saw its net income plummet to $388 million during the fourth quarter from a sizeable year ago figure of $1 billion. At the core of this massive drop was an uncertain lending environment due to high rates. This forced Discovery to allocate more funds to risky loans in its portfolio, which ended up affecting the income statement. M&T and KeyCorp bother suffered from higher deposit costs. These led M&T to report a 6% drop in its net interest income, with KeyCorp's NII plummeting by a sizeable 24%. Shifting from banks, technology stocks are off to a good start this year. One of the most widely talked about technology industries in the world is the semiconductor industry, and January saw a lot of optimism from the world's largest contract chip manufacturer, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM). TSMC reported its fourth quarter of 2023 earnings, and at the accompanying analyst call, the firm's management expressed confidence that it could capture the market for A.I. chips. TSMC's CEO Dr. C.C. Wei shared at the firm's fourth quarter of 2023 earnings call: No matter which approach is taken, AI technology is evolving to use more complex AI models as the amount of computation required for training and inference is increasing. As a result, AI models need to be supported by more powerful semiconductor hardware, which requires use of the most advanced semiconductor process technologies. Thus, the value of TSMC technology position is increasing, and we are all well positioned to capture the major portion of the market in terms of semiconductor component in AI. To address insatiable AI-related demand for energy-efficient computing power, customers rely on TSMC to provide the most leading edge process technology at scale with a dependable and predictable cadence of technology offering. TSMC's optimism about A.I. coupled with Super Micro Computer, Inc. (NASDAQ:SMCI) raising its second quarter of fiscal 2024 guidance by a cool $700 million is proving beneficial to technology stocks and the semiconductor sector. The Philadelphia Semiconductor Index is up by a healthy 5.8% over the past five days, mirroring the performance of broader stock indexes. Amidst this cautiously optimistic environment that's seeing investors eager to not miss out on potential future trends, we thought to take a look at some top rated blue chip stocks that Wall Street analysts are in love with. Some stocks that Wall Street analysts love that might catch your eye are Alphabet Inc. (NASDAQ:GOOG), Amazon.com, Inc. (NASDAQ:AMZN), and Microsoft Corporation (NASDAQ:MSFT). A robotic process automation system in a modern datacenter. Our Methodology To make our list of the stocks that Wall Street analysts are in love with, we ranked all U.S. based companies with market capitalization greater than $50 billion and more than $5 billion in annual revenue by their average analyst share ratings. Naturally, the companies with the highest average ratings are also those that Wall Street analysts think are great. The lower the score, the higher rated the stock is by Wall Street analysts. For these stocks we have also mentioned hedge fund sentiment. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator. Number of Hedge Fund Investors In Q3 2023: 81 Average Analyst Share Rating: 1.9 Humana Inc. (NYSE:HUM) is an American healthcare plan and coverage provider headquartered in Louisville, Kentucky. It marks a strong start to our list of the stocks that Wall Street analysts love as its shares are rated Strong Buy on average and it has also beaten analyst EPS estimates in all four of its latest quarters. Insider Monkey's Q3 2023 survey covering 910 hedge funds revealed that 81 had bought a stake in Humana Inc. (NYSE:HUM). Ken Griffin's Citadel Investment Group was the firm's biggest investor as it owned 1.5 million shares that are worth $773 million. Along with Amazon.com, Inc. (NASDAQ:AMZN), Alphabet Inc. (NASDAQ:GOOG), and Microsoft Corporation (NASDAQ:MSFT), Humana Inc. (NYSE:HUM) is a top rated stock that Wall Street analysts love. Number of Hedge Fund Investors In Q3 2023: 62 Average Analyst Share Rating: 1.9 ConocoPhillips (NYSE:COP) is an American diversified oil and gas company headquartered in Texas. January 2024 is proving to be a crucial month for the firm as its claims against a Venezuelan oil company's share sale were accepted by an American court. By the end of last year's third quarter, 62 out of the 910 hedge funds profiled by Insider Monkey were the firm's shareholders. ConocoPhillips (NYSE:COP)'s largest shareholder among these is Natixis Global Asset Management's Harris Associates due to its $1.6 billion stake. Number of Hedge Fund Investors In Q3 2023: 79 Average Analyst Share Rating: 1.9 T-Mobile US, Inc. (NASDAQ:TMUS) is an American telecommunications carrier. After having teamed up with SpaceX to provide direct to cellular coverage, its deal scored a win this month after SpaceX announced successful tests of the technology. Insider Monkey's September quarter of 2023 survey covering 910 hedge funds revealed that 79 had invested in T-Mobile US, Inc. (NASDAQ:TMUS). Out of these, the firm's biggest investor is Warren Buffett's Berkshire Hathaway as it owns $734 million worth of shares. Number of Hedge Fund Investors In Q3 2023: 85 Average Analyst Share Rating: 1.9 Merck & Co., Inc. (NYSE:MRK) is one of the biggest healthcare companies in the world. Despite its heft, more than three quarters of its shares are owned by institutional investors. This lends the stock stability but leaves it vulnerable to sudden upswings and downswings. By the end of 2023's third quarter, 85 out of the 910 hedge funds surveyed by Insider Monkey were the firm's shareholders. Merck & Co., Inc. (NYSE:MRK)'s largest shareholder among these is Ken Fisher's Fisher Asset Management due to its $1.3 billion investment. Number of Hedge Fund Investors In Q3 2023: 83 Average Analyst Share Rating: 1.8 Elevance Health, Inc. (NYSE:ELV) provides health insurance and other associated products to consumers in America. The firm expanded its business portfolio in January 2024 when it made an interesting acquisition of a specialty pharmacy that provides infusions to customers. 83 out of the 910 hedge funds covered by Insider Monkey's research had invested in Elevance Health, Inc. (NYSE:ELV) during Q3 2023. Jean-Marie Eveillard's First Eagle Investment Management was the biggest stakeholder, owning 1.7 million shares that are worth $776 million. Elevance Health, Inc. (NYSE:ELV), Alphabet Inc. (NASDAQ:GOOG), Amazon.com, Inc. (NASDAQ:AMZN), and Microsoft Corporation (NASDAQ:MSFT) are some top rated stocks that Wall Street analysts love.  Click here to continue reading and check out 5 Top Rated Blue Chip Stocks Wall Street Analysts Are In Love With: January 2024.  Suggested articles: 10 Dividend Aristocrats That Slashed Their Dividends 13 Most Advanced Countries in Space Exploration 10 Best Long-Term Tech Stocks To Buy Disclosure: None. 10 Top Rated Blue Chip Stocks Wall Street Analysts Are In Love With: January 2024 is originally published on Insider Monkey. Related Quotes "
}