{
    "title": "Microsoft, Qcells strike massive supply deal for US-made solar panels",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/microsoft-qcells-strike-massive-supply-103533525.html",
    "text": "By Nichola Groom (Reuters) - South Korea's Qcells on Monday said it will supply Microsoft with 12 gigawatts of American-made solar panels through 2032 in what the companies called one of the largest ever deals of its kind. The agreement locks in substantial and stable demand for panels Qcells will make at its new $2.5 billion Georgia factory. For Microsoft, which was seeking a reliable panel provider to reduce supply chain risks, the deal will help reach its goal of powering its operations with 100% renewable energy by 2025. \"How do we really make sure that we can meet those goals in this kind of an environment, as we see others coming in and doing the same thing?\" Bobby Hollis, Microsoft's vice president for energy, said in an interview. \"We have to really undertake things in a very strategic and thoughtful way.\" The two companies first agreed to a 2.5-gigawatt contract a year ago. Through this expanded agreement, Microsoft will increase its total commitment to 12 GW, enough to power about 1.8 million homes, the companies said. Qcells said the collaboration with Microsoft will help it establish a solar supply chain in the United States to compete with China. The company will produce silicon ingots, wafers and cells, as well as the modules themselves. Currently, most panels assembled in the United States use components made in Asia, where prices have dropped sharply in the last year. Incentives in President Joe Biden's Inflation Reduction Act seek to bolster U.S. production of clean energy components to reduce that reliance on overseas-produced goods. \"We are the only ones that are really building up the full supply chain. And this is thanks to the partnership that we're having with Microsoft,\" Jihyun Kim, an executive vice president at Qcells, a division of Hanwha Solutions Corp. (Reporting by Nichola Groom; Editing by Bill Berkrot) Related Quotes "
}