{
    "title": "3 Best Tech Sector ETFs to Own for 2024",
    "date": "1/13/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/IXHC/pressreleases/23324028/3-best-tech-sector-etfs-to-own-for-2024/",
    "text": "Some of the largest companies in the world, including Amazon (AMZN), Apple (AAPL), Meta Platforms (META), Microsoft (MSFT), and Nvidia (NVDA), are part of the technology sector. These tech stocks have generated game-changing wealth for shareholders over the last two decades. But identifying long-term winners is quite a challenging task, as just a handful of stocks tend to drive the majority of broad-market returns over time. So, it may be preferable to invest in exchange-traded funds (ETFs) that offer diversification at a relatively low cost. Investing in low-cost ETFs can provide exposure to several companies, reducing your overall risk profile in the process. When many investors think of tech ETFs, the first that comes to mind might be the Invesco QQQ Trust (QQQ), which is based on the Nasdaq-100 Index ($IUXX). However, while QQQ's top components include the familiar tech giants mentioned above, it's not a pure-play tech ETF; by definition, the Nasdaq-100 is comprised of the largest non-financial companies listed on the Nasdaq, which means names such as Costco (COST) and Pepsi (PEP) are also featured prominently. That said, here are three focused tech ETFs investors can own in 2024. Note that not all of these funds boast the same daily volume or assets under management as QQQ - but for investors with a long-term horizon, these smaller, more targeted funds are worth considering. With $58.75 billion in assets under management, the Vanguard Information Technology Index Fund (VGT) is among the largest tech ETFs in the U.S. This ETF primarily focuses on U.S. stocks and is top-heavy. For instance, the top three holdings account for nearly half of the fund's weight. The ETF allocates the majority of its assets to blue-chip giants such as Apple, Microsoft, Nvidia, Broadcom (AVGO), and Adobe (ADBE), making it relatively less volatile compared to some other tech funds. However, VGT also offers more exposure to smaller companies versus the comparable S&P 500 Technology Sector SPDR (XLK) - including penny stock Soundhound AI(SOUN), cryptocurrency-related names like Microstrategy (MSTR) and Riot Platforms (RIOT), and software stock MongoDB(MDB). In the last 52 weeks, VGT has gained 44%, while QQQ is about 46.6% higher, and XLK is up just over 47%. With an expense ratio of 0.10%, VGT also offers a dividend yield of 0.67%. For investors seeking out focused exposure to chip stocks, there's the Invesco PHLX Semiconductor ETF (SOXQ), a market-cap-weighted index of the 30 largest U.S.-listed companies in the semiconductor sector. These companies manufacture memory chips, integrated circuits, microprocessors, and other equipment.  To be part of the ETF, the company should be valued at more than $100 million by market cap. With $186 million in assets under management, SOXQ offers a similar theme and composition to the much larger iShares Semiconductor ETF (SOXX), but with a lower expense ratio of 0.19%. SOXQ also offers a higher yield than SOXX, at 0.89%. The top holdings of the ETF include Advanced Micro Devices (AMD), Broadcom, Nvidia, Intel (INTC), and Qualcomm (QCOM), which together account for roughly 41% of the fund's weight. SOXQ is up 45.1% over the past year. Cloud computing remains another major growth story on Wall Street, the Fidelity Cloud Computing ETF (FCLD) tracks companies providing products and services enabling the usage of cloud computing. With only $54.97 million in assets under management, FCLD is smaller than the equal-weighted First Trust Cloud Computing ETF (SKYY), but it also has a smaller expense ratio than SKYY at just 0.39%. Plus, unlike SKYY, FCLD offers a modest dividend yield of 0.17%. FCLD is weighted by market cap, and the top five holdings are Intuit (INTU), Salesforce (CRM), ServiceNow (NOW), Microsoft, and Oracle(ORCL). Over the past 52 weeks, FCLD shares have rallied 44%. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}