{
    "title": null,
    "date": "1/2/2024",
    "url": "https://www.fool.com/investing/2024/01/02/the-new-york-times-just-sued-microsoft-and-openai/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Microsoft (MSFT -0.17%) and OpenAI opened up a brave new world with the launch of ChatGPT late last year. The advent of generative AI technologies could disrupt a wide range of industries, but it's also prompted thorny questions about how this new technology should be regulated and what's fair game for training these new large language models, which develop their intelligence from content on the internet. That particular issue is at the heart of a new multibillion-dollar lawsuit that could shake up Silicon Valley as The New York Times (NYT -1.93%) is suing Microsoft and OpenAI, alleging that they violated its use of the copyright to its articles. The so-called paper of record filed the lawsuit last Wednesday in Federal District Court in Manhattan, claiming that the generative AI pioneers are responsible for \"billions of dollars in statutory and actual damages\" for the \"unlawful copying and use of the Times' uniquely valuable works.\" The complaint also demands that OpenAI and Microsoft destroy the models that used the Times' content. Image source: Getty Images. The 69-page complaint from the Times makes a variety of allegations, including that some responses from ChatGPT lift passages from the Times' content verbatim. ChatGPT also offers users a way to circumvent the Times' paywall for some of its articles as any user can simply ask Chat GPT to type out the Times' articles. The Times accuses ChatGPT of reproducing its articles with \"hallucinations,\" or falsely attributing material to the Times that didn't come from it. Altogether, the complaints portray ChatGPT as a library of Times content that can be accessed directly or indirectly for free without the permission of The New York Times. The Times isn't the first publisher to make such a complaint. Getty Images, for example, sued an AI company for unauthorized use of its visual materials, and a group of authors including Jonathan Franzen and John Grisham have sued AI platforms for using their work as well. The battle lines are familiar to anyone who has followed this debate previously. Tech companies have a history of enriching themselves on the backs of publishers from the early days of music-file sharing to battles over what news content should be allowed on social-media feeds or how videos on YouTube get monetized. Throughout the conflict, the media industry and traditional publishers have largely come out on the losing end. In the Times' complaint, the subtext is nearly as important as the actual lawsuit. The point the Times is making is that its content is valuable enough that it was specifically chosen to help train large language models like ChatGPT. In fact, in Common Crawl, a database designed to be a \"copy of the internet,\" the Times is the third most-cited source behind a database of U.S. patent filings and Wikipedia. In other words, the value of the Times' content extends well beyond the value of its business, which currently has a market cap of $8 billion. Its reporting sets the agenda for much of the rest of the news industry, and its content influences public policy and corporate decision-making. At this stage, it's impossible to say what the outcome of the Times' complaint might be, but investors should be watching the developments closely. Considering the billions of dollars flowing into AI models and the multitrillion-dollar market caps of sponsors like Microsoft, there seems to be both a rich target in suing the profiteers of AI and clear business value in the Times' content for use in AI models. The New York Times stock rose nearly 3% on Wednesday when the complaint was filed and tacked on another 2.4% on Thursday, a sign investors think this could be a winning move for the newspaper publisher. If the Times can find a way to tap into the massive generative AI market, it could represent a valuable new revenue stream for the leading news organization. Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Microsoft and New York Times. The Motley Fool recommends the following options: short January 2024 $45 calls on New York Times. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}