{
    "title": "Microsoft Envision AI Connection Hong Kong 2024: Leading in the Era of AI – \nMicrosoft News Center Hong Kong",
    "date": "1/10/2024",
    "url": "https://news.microsoft.com/en-hk/2024/01/10/microsoft-envision-ai-connection-hong-kong-2024-leading-in-the-era-of-ai/",
    "text": "January 10, 2024\t\t\t\n\t\t\t | Microsoft Hong Kong January 10, 2024, Hong Kong – Microsoft Hong Kong today hosted its annual flagship event, Microsoft Envision AI Connection, to celebrate the new year of AI innovation ahead. Under the theme ‘Leading in the Era of AI’, Microsoft spotlighted four solution areas, including Modern Workplace, Azure AI, Security and Business Applications. It also introduced a variety of new use cases showing how Microsoft enables businesses of all sizes to unlock new opportunities across different industries. AI is a rapidly growing field that is transforming the way businesses operate. Referring to an IDC survey data, 71% of businesses in Hong Kong are currently using AI tools in their organizations. The survey also found that every US$1 invested in AI yields an average return of US$3.20 in Hong Kong. Microsoft’s AI services have been at the forefront of this transformation and has gained tremendous and positive responses from customers. According to Microsoft’s latest Work Trend Index, 70% of early Copilot users said they were more productive, and 68% said it improved the quality of their work, which underscores the productivity gains with Copilot. Reinforcing AI and Copilot experience to enterprises Zoning in on the following four trends shaping the future of technology, Microsoft brought together global and local industry leaders and partners to explore how they elevate their business operations, innovate, and grow with Microsoft’s cutting-edge AI solutions. Modern workplace – the AI-powered organization With a focus on making every organization and its employees working smarter, Microsoft last year unveiled Copilot for Microsoft 365, your daily AI-powered assistant. By combining the immense capabilities of large language models (LLM) like GPT-4 with proprietary data from Microsoft Graph, Microsoft 365 applications, and the web, the groundbreaking innovation empowers employees to work in much more collaborative and productive way. Early adopters in Hong Kong, including Cathay and FWD Group shared their success stories at the event, highlighting how Copilot for Microsoft 365 has become their employees’ best companion, helping them stay competitive in the new era of AI. The introduction of Copilot for Microsoft 365 marks a significant step forward for the workplace, underscoring Microsoft’s commitment to revolutionizing the employees’ working experience. Put Azure AI to work – today’s leading types of intelligent apps Microsoft also recognizes the importance of leveraging Azure AI to drive innovation in the era of AI. Data plays a central role in this digital transformation journey, and organizations should ensure it is readily accessible to those who need it. Microsoft showcased the Azure OpenAI Service, an enterprise-grade generative AI platform that offers end-to-end security, compliance, and privacy policies. It serves as a trusted foundation for every organization and industry, and even for those highly regulated industries like the financial services industry (FSI), enabling them to implement AI technologies safely and efficiently. Leading FSI companies such as AIA, FWD Group and HSBC engaged in thought-provoking dialogue, highlighting how they leverage the power of AI to enhance knowledge mining, internal policy discovery, and ultimately to improve customer centricity in the future within secure and compliant environments. On a global scale, the adoption of Azure OpenAI Service has been nothing short of extraordinary, with over 18,000 customers currently benefiting from its features. The service has garnered immense popularity and acclaim, with customer numbers nearly tripling between May and July 2023. The new security landscape: protecting end-to-end for the era of AI With the rise of more complicated cybersecurity threats and the global shortage of skilled security professionals, the adoption of generative AI solutions has become a necessity for organizational safety. Microsoft Security Copilot helps security teams identify vulnerabilities with greater efficacy and stay ahead of today’s cybersecurity threats, with the largest repository of threat intelligence analyzing 65 trillion signals daily. Microsoft partner and customers such as Amidas Hong Kong, A.S. Watson Group and QNET shared their insights into the evolving trends in cyberattacks and the role of AI in supporting organizations to detect, react, and prevent threats. Their experience sheds light on the powerful impact of AI-driven security measures in safeguarding sensitive information and maintaining operational resilience. Leveraging the potential of AI-based protections in its security offerings, Microsoft remains at the forefront of developing advanced security solutions to combat emerging threats and protect organizations from mutating cybersecurity risks. The AI-powered business for every role and function Microsoft is revolutionizing business productivity with AI-powered solutions for every role and function. In the Business Trends survey, over 80% of workers expressed a desire for tools and solutions that enhance agility, automate daily tasks and make information more accessible. With advanced AI capabilities, Microsoft’s Copilot in Dynamics 365 and Copilot in Power Platform are transforming business operations across different functional roles and enabling them to refine marketing strategies and enhance employee experience. In a short timeframe since the introduction of Copilot capabilities in Microsoft Dynamics 365 and Power Platform, employees from more than 63,000 organizations worldwide have had the opportunity to experience some of the AI-assisted features firsthand. Organizations such as Continental, New World Development, PwC and The University of Hong Kong share their insights towards how AI can strengthen their data-driven decisions, automate processes in different functional roles and build customized applications with low code, and elevate user experience. Their adoption of Microsoft’s solutions paves the way for an AI-driven transformation journey. Cally Chan, General Manager of Microsoft Hong Kong and Macau, said, “As a trailblazer in the IT industry, Microsoft is at the forefront of AI-driven improvement. We recently announced a wide range of innovations, including the extension of the Copilot family for every role in the organization. At today’s event, we have been thrilled to engage in inspirational dialogue and hear the success stories of our forward-thinking partners and customers who are harnessing the full potential of AI with Microsoft’s rounded solutions. Our strong partnerships will give way to new horizons of innovation, efficiency and growth, propelling businesses into a future where AI is the catalyst for unprecedented success.” “Today’s organizations need more comprehensive and unified tools to build the next wave of generative AI-based applications,” said Victor Chong, Head of Enterprise Commercial, Microsoft Hong Kong. “We are pushing the boundaries of AI innovation and making it easier for customers to deploy AI at scale across their business. For example, Azure AI Studio and Copilot Studio are two of the amazing tools that helps organizations to build, test, and deploy AI innovations or custom copilots. We are proud to see Microsoft’s AI solutions becoming the trusted choice for our customers in transforming processes, optimizing operations, and driving growth.” Facilitating an exchange of insights into AI adoption Microsoft Envision AI Connection Hong Kong 2024 gathered over 600 C-suite representatives, business leaders and IT professionals from a range of industries including FSI, property, telecom, healthcare, professional services and academic sectors. To facilitate the exchange of experiences and insights into how AI solutions can transform business, we hosted a series of activities, including: In these immersive sessions, Microsoft’s partners and customers took the stage to share their remarkable success stories. They discussed how innovative AI technologies have helped them seize new opportunities, accelerate secure journeys to the cloud, power business decisions with data insight, and enhance automation. Driving innovation in Hong Kong Throughout the years, Microsoft has remained steadfast in its commitment to fostering innovation and propelling economic growth in Hong Kong. AI is creating unparalleled opportunities for businesses of every size and across every industry. We are seeing our customers embrace AI services to drive innovation, increase productivity and resolve problems. As a leading technology provider, we want our customers to use our generative AI services in confidence, that is why Microsoft has three AI Customer Commitment to assist them on their safe, secure and responsible AI journey. We share our learning about developing and deploying AI responsibly, create an AI Assurance Program and support you as you implement your own AI systems responsibly. With these approaches, we aim to enhance the city’s fintech and economic development, as well as its Smart City initiatives to maintain Hong Kong’s status as a world-class international financial center and I&T hub.  ### About Microsoft Microsoft (Nasdaq “MSFT” @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more. Follow us: Share this page: "
}