{
    "title": "Optimizing Microsoft's SAP Environment with Microsoft Azure",
    "date": "1/16/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/optimizing-microsofts-sap-environment-with-microsoft-azure/",
    "text": "How Microsoft does IT Jan 16, 2024\t\t\t\t\t  |  Inside Track staff At Microsoft, we use SAP enterprise resource management software to run our mission-critical business functions like finance and human resources. In an on-premises model, physical computing resources are costly and may go unused. But by moving our SAP systems to Microsoft Azure, we avoid maintaining unused resources—we scale our systems up and down for current and short-term needs. By doing this, we’ve fine-tuned our capacity management processes for lower costs, and more agility, scalability, and flexibility. Like many enterprises, our company uses SAP—the enterprise resource planning (ERP) software solution—to run most of our business operations. We’re running SAP on Microsoft Azure, the preferred platform for SAP and the optimal platform for digital transformation. We’ve optimized our SAP on Microsoft Azure environment to gain business and operational benefits that make our SAP instance agile, efficient, and able to grow and change with our business needs. Optimizing our Microsoft Azure environment has allowed us to: As of 2018, Microsoft’s instance of SAP is 100 percent migrated to Microsoft Azure. By optimizing SAP on Azure, we’re positioning our SAP environment to grow and change with our business needs. Additionally, we’re positioned to lead our digital transformation and empower everyone in our organization to achieve more. Azure makes SAP better. [Discover how we’re protecting Microsoft’s SAP workload with Microsoft Sentinel. | Learn how Microsoft moved its SAP workload to the cloud. | Find out how we’re transforming how we monitor our SAP instance with Microsoft Azure.] Each SAP system or app in our overall SAP landscape uses servers and hardware, computing resources (like CPU and memory), and storage resources. Each system also has separate environments, like sandbox and production. The resources required to run SAP can be costly in an on-premises model, where you have physical or virtualized servers that often go unused. Consider a typical on-premises system. The IT industry often sizes on-premises servers and storage infrastructure for the next three to five years, based on the expected maximum utilization and workload during the life span of an asset. But often, the full capacity of the hardware isn’t used outside of peak periods—or isn’t needed at all. Maintaining these on-premises systems is costly. With Microsoft Azure, we avoid infrastructure underutilization and overprovisioning. We quickly and easily scale up and scale down our SAP systems for current and short-term needs, not for maximum load over the next three to five years. By managing capacity and sizing our SAP systems on Microsoft Azure, we’ve experienced improvements in several areas: Optimizing involves calculating our hardware requirements like CPU resources, storage space, memory, input/output (I/O), and network bandwidth. When we optimize, we size for today. We assess our infrastructure, resources, and costs, and then size our systems as small as possible. We also ensure that sufficient space to run business processes without causing performance issues during expected events like product releases or quarterly financial reporting. This capability provides us with the ability to optimize our storage and computing power, giving us flexibility and on-demand agility. Sizing is an ongoing task because your load, business requirements, and behavior patterns can change at any time. The following are some considerations and tips, based on the process that we use: We used two common strategies for sizing SAP systems, each in a different way and at different points in the optimization process. We used the SAP Quick Sizer at the start of our optimization process because it had a simple, web-based interface and it allowed us to prepare our sizing strategies from the start. We used reference sizing later, after we determined some context around our virtual-machine sizing and could provide virtual machines in Microsoft Azure for reference. If you don’t yet have systems or workloads in Microsoft Azure, start with SAP Quick Sizer—it’s an online app that guides you on sizing requirements, based on your business needs. Quick Sizer is helpful for capacity and budget planning. The app has a questionnaire where you indicate the number of SAP users, how many transactions you expect, and other details. The SAP system recommends a number for the SAP Application Performance Standard (SAPS), a measurement of processing requirements that you need, such as for a database server. If the recommended number is 80,000, you need to leverage servers with SAPS that add up to 80,000. You can find more information about SAPS for Azure virtual machines in SAP Note #1928533 SAP Applications on Azure: Supported Products and Azure VM types (SAP logon required). You should keep a few considerations in mind when you’re using SAP Quick Sizer. There can be customization and variations of SAP systems, depending on business processes, which could change system behavior. Or you might have capabilities enabled for new SAP deployments or custom code for which no Quick Sizer exists. Also, in the past, hardware vendors guided customers on the servers that they needed and how to install them. With Azure, customers make their own decisions—for example, how to grow storage as data volume grows, or how to adjust CPU compute resources. After systems are live in Microsoft Azure, reference sizing is the recommended method. With this approach, you need to look at the performance of systems you’ve already moved to Azure that have a similar load to the systems that you want to move. This comparison helps you estimate your sizing requirements accurately. For example, if you have an on-premises system that you want to move to Microsoft Azure, and it’s three times larger than one of the systems that you already have on Azure, adjust the sizing based on systems you’ve already deployed in Azure, and then deploy the new system. If it turns out that your estimate wasn’t accurate, it’s much easier and quicker to adjust CPU and memory resources in Microsoft Azure than on-premises, by switching to a different virtual machine size. Adjusting the database on-premises is more difficult because you might need to buy servers with more CPU and memory. For on-premises, you must look at what you have, add a buffer, and consider the additional load that you’ll have in the next few years. When we integrate SAP with Windows Server and SQL Server, our main considerations are cost of ownership and low complexity. When you plan your integration and reference architecture, make sure that the technical landscape is easy and cost effective. With business-critical systems, it’s difficult to scale when you have an architecture whose maintenance requires highly skilled individuals, or when there are emergencies where you need business continuity. For easy administration and operations, we use the same app design in all SAP production systems. We only adjust VM sizes and numbers based on the system-specific requirements. Also, to avoid issues for customers who run SAP workloads on Azure, Microsoft certifies only certain Microsoft Azure VM types. These VMs must meet memory, CPU, and ratio requirements, and they must support defined throughputs. To learn more about Azure VM types certified for SAP, review SAP certifications and configurations running on Microsoft Azure. The graphic below shows the Microsoft SAP ERP/ECC production system in Microsoft Azure. By moving to Azure, we’ve gained agility and scalability on the SAP Application layer. We can scale the SAP Application layer up and down by increasing and decreasing the size and number of the VMs. The design and architecture have high-availability measures against single points of failure. So, if we need to update Windows Server or Microsoft SQL Server, perform infrastructure maintenance, or make other system changes, it doesn’t require much, if any, downtime. We implement infrastructure in Azure for our production systems with standard SAP, SQL Server, SAP HANA, Windows Server, and SUSE Linux high-availability features. To ensure high availability, we are leveraging Microsoft Azure Availability Zones: We distribute our VMs in multiple zones. The graphic above includes an example of how we use Azure Availability Zones. If a problem arises in one zone, the system is still available. All single points of failure are secured with clustering: Windows Server Failover Cluster for the Windows operating system and Pacemaker cluster for SUSE Linux. For databases, we use SQL Server Always On and SAP HANA System Replication (HSR). The databases are configured for a synchronous commit on both local HA nodes (no data loss occurs, and automatic failover is possible) and an asynchronous commit to the remote disaster recovery node. If an issue arises with the main database server, SAP will automatically reconnect to the local high availability node. Because we can use the secondary database, we can upgrade software and SQL Server, roll back to previous releases, and do automatic failovers with no or minimal risk. For scalability and high availability of the SAP application layer, multiple SAP app server instances are assigned to SAP redundancy features such as logon groups and batch server groups. Those app server instances are configured on different Microsoft Azure virtual machines to ensure high availability. SAP automatically dispatches the workload to multiple app-server instances per the group definitions. If an app server instance isn’t available, business processes can still run via other SAP app server instances that are part of the same group. The scale-out logic of SAP app server instances is also used for rolling maintenance. We remove one virtual machine, and the SAP app server instances running on it, from the SAP system without affecting production. After we finish our work, we add back the virtual machine, and the SAP system automatically uses the instances again. If high load occurs and we need to scale out, we add additional virtual machines to our SAP systems. To ensure that VM costs are managed, we’ve established new policies for nonproduction SAP systems: Default setting for a system is that’s unavailable. Users can start systems on demand by using a snooze application build on top of Microsoft Power Apps. The system will be available for 12 hours and then automatically shut down again unless the availability time was extended. Additionally, systems that are used regularly are assigned to a fixed availability schedule. For example, the schedule might be: Systems will be shut down Friday evening and started again on Monday morning without user interaction. In the event that the system is needed over the weekend, users can start the system by using the snooze application. Moving SAP systems to Microsoft Azure enabled easy integration with various Microsoft Azure Monitor services for enhanced telemetry and monitoring. We approached telemetry by using a multilayer concept: 1) SAP Business Process layer, 2) SAP Application Foundational layer, 3) SAP Infrastructure layer, and 4) SAP Surrounding API layer. Microsoft Azure Log Analytics offers many standard metrics for the SAP Infrastructure layer, and it’s easy to integrate with SAP to collect custom metrics from the Application Foundational layer. Implementing telemetry for the SAP business process and API layers is relatively challenging because doing so requires custom development. We use tools in the ABAP SDK to integrate and export data from SAP to Microsoft Azure Monitor Application Insights. Learn more about end-to-end telemetry for SAP on Microsoft Azure and find out additional information about how Microsoft’s internal SAP workload has received a telemetry boost from Microsoft Azure. We keep learning and iterating as we optimize SAP for Microsoft Azure in our environment. Here are some important lessons that we’ve learned: We’re excited about the decreased costs and increased agility that we’ve experienced so far in optimizing SAP for Microsoft Azure. In the future, we plan to share more lessons that we learn as we move forward with post-migration improvements. For information on designing a migration initiative, review Strategies for migrating SAP systems to Microsoft Azure. Our future plans include:  Tags: Microsoft Azure, SAP, security Mar 29, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tAngela Gamba The use of business applications in Microsoft Teams has become a strategic advantage for many organizations, as they can accelerate the digital transformation of all business areas, generating a high demand for the Information Technology (IT) team to make these applications available. While use of apps for Microsoft Teams can be daunting for IT Teams... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Our core system for managing our external workforce was showing its age in an increasingly demanding modern workplace environment—we needed to simplify our external staff management. Here at Microsoft, our large and diverse external, non-FTE workforce plays a vital role in our success. For us, external staff includes contractors, consultants, freelancers, and business guests who... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Microsoft runs on Microsoft technology. We are the proving ground for our products and when we say that software is enterprise-ready this means that we have already built it for and run it at scale in our own enterprise. We are in the business of building the future of technology. And more often than not,... Mar 25, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tInside Track staff Next-generation connectivity is enabling us to transform our internal enterprise network here at Microsoft. Deploying a more agile, secure, and effective network environment across Microsoft is empowering our employees to thrive in our new hybrid world. This article describes how we’re implementing this new network strategy, including goals, action areas, expected results, and a brief... [Editor’s note: This story on how Microsoft moved its SAP workload to the cloud has been updated with new details and updated terminology. A new SAP on Microsoft Azure video has been added below. This content was written to highlight a particular event or moment in time. Although that moment has passed, we’re republishing it...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more This content has been archived, and while it was correct at time of publication, it may no longer be accurate or reflect the current situation at Microsoft. Editor’s note: This story has been updated with new details and updated terminology. A new SAP on Microsoft Azure video also has been added below. Microsoft expected that...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more For any large enterprise like Microsoft, monitoring threats to infrastructure and applications developing and maintaining an always-on Security Information and Event Management (SIEM) solution like Microsoft Sentinel that’s equipped to ward off threats isn’t only a weighty task but also a truly challenging undertaking. The threat landscape is constantly evolving, and data breaches—originating from outside...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}