{
    "title": "Is It Too Late to Buy Microsoft Stock?",
    "date": "2/25/2024",
    "url": "https://www.fool.com/investing/2024/02/25/is-it-too-late-to-buy-microsoft-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Microsoft (MSFT -0.17%) has had an epic run over the past year, driven higher by a broader market rebound and a major recovery in the technology sector. Shares of the productivity software and cloud computing specialist have gained 63% over the past year, more than twice the 27% gains of the S&P 500. To kick off 2024, Microsoft's market cap has soared above $3 trillion, making it the most valuable company in the world (as of this writing). What makes this all the more remarkable is that much of the gains were the result of Microsoft's decision to embrace generative artificial intelligence (AI) early on. Yet some investors are leery of joining the rally that has come so far so fast -- especially given the increased volatility that seemingly comes with AI stocks. What does this mean for investors who sat out Microsoft's current sprint higher? Should they buy now in hopes of additional gains or ignore the stock because of its somewhat pricey valuation? Let's see what the evidence reveals. Image source: Getty Images. It's hard to deny the impact of AI thus far, as many of the world's biggest companies are jumping in with both feet. There's no way to know for sure how far AI could go, but it's clear there's a massive opportunity for businesses with the know-how and resources to deploy it -- and Microsoft is leading the charge. Soon after taking a hefty stake in ChatGPT parent OpenAI, Microsoft stunned the tech world with the debut of Copilot -- a suite of AI assistants deeply integrated into Microsoft Office products and designed to make users more productive. Copilot can summarize emails and draft responses in Outlook, create presentations from existing data in PowerPoint, quickly create pivot tables in Excel, and draft, edit, and review documents in Word. Beyond Office, there are Copilots designed for developers, sales departments, medical professionals, cybersecurity, and much more. Furthermore, the uptick in productivity noted by users has been dramatic. It's still early days, but the estimates are staggering. CFO Amy Hood said, \"The next-generation AI business will be the fastest-growing $10 billion business in our history.\" Dan Loeb, founder of hedge fund Third Point, estimates that Copilot could \"increase [Microsoft's] revenue by as much as $25 billion or more.\" Evercore ISI analyst Kirk Materne is even more bullish, suggesting that generative AI could generate incremental revenue of $100 billion for Microsoft by 2027. Let's not forget Microsoft Azure, its cloud computing business. Being the world's second-largest cloud infrastructure provider puts Microsoft in the perfect position to sell cloud-based AI services to its users. During its fiscal 2024 second quarter (ended Dec. 31), Azure grew 30% year over year, outpacing both Amazon Web Services (AWS) and Alphabet's Google Cloud, which grew 13% and 26%, respectively. Microsoft noted Azure's growth included \"six points of growth from AI services.\" Once upon a time, Microsoft's more personal computing segment represented roughly one-third of the company's revenue. However, the segment has fallen on hard times over the past couple of years due to an unprecedented slump in PC sales. It looks like the worst has passed, as the worldwide PC market returned to growth in the final quarter of 2023, inching up 3% year over year, according to technology analyst firm Canalys. The improving economy is expected to spark a refresh cycle that begins gradually in 2024 and kicks off in earnest in 2025. This could, in turn, boost Microsoft's fortunes and return the PC segment to its former glory. It wasn't very long ago that Microsoft stock was a screaming buy, but its feverish growth over the past year has increased its valuation. The stock is currently selling for 35 times forward earnings, compared to the price-to-earnings (P/E) ratio of roughly 28 for the S&P 500. While that might seem pricey to some, I'd suggest it's remarkably reasonable, given the company's growth prospects. It deserves a slight premium. Given the multiple ways Microsoft can profit from the AI revolution and other catalysts that could fuel its growth, I'd argue it's not too late to buy Microsoft. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet, Amazon, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}