{
    "title": "Seven Things We Learned Deploying Microsoft Sales Copilot at Microsoft",
    "date": "2/6/2024",
    "url": "https://www.microsoft.com/insidetrack/blog/seven-things-we-learned-deploying-microsoft-sales-copilot-at-microsoft/",
    "text": "How Microsoft does IT Feb 6, 2024\t\t\t\t\t  |  Lukas Velush We’ve entered the age of AI, and our salespeople are reaping the benefits here at Microsoft. Thanks to Microsoft Copilot for Sales, their days are more efficient, their communication is more streamlined, and their interactions with essential sales tools don’t require them to interrupt their flow of work. Since we launched the tool internally here at Microsoft, we’ve learned a few best practices for deploying it easily and making full use of its features. This post shares some of our learnings so you can take advantage of our experience when you activate Microsoft Copilot for Sales at your organization. Everything we’ve done in terms of our Dynamics 365 sales platform aims to give time back to sellers so they can invest it into customers. With AI and copilots, our technology is doing even more to help us reach that goal. — Alexandra Jones, senior business program and change manager, Microsoft Digital [See how we’re simplifying our sales with AI-powered Microsoft Copilot for Sales. Get insights from our Lori Lamkin and Nathalie D’Hers on the power of Microsoft Copilot for Sales. Explore getting the most out of generative AI at Microsoft with good governance.] Microsoft Copilot for Sales maximizes productivity with an AI assistant specifically designed for sellers. Like our other AI-powered tools, it increases productivity and efficiency by providing intelligent digital assistance within Microsoft Teams and Outlook. The added value of Microsoft Copilot for Sales is working with Dynamics 365 or Salesforce to access, use, and input customer relationship management (CRM) data. As a result, it eliminates distracting tasks that eat away at their time and get in the way of what they do best—building relationships and solving problems. “Everything we’ve done in terms of our Dynamics 365 sales platform aims to give time back to sellers so they can invest it into customers,” says Alexandra Jones, senior business program and change manager in Microsoft Digital, the company’s IT organization. “With AI and copilots, our technology is doing even more to help us reach that goal.” For sellers trying to do their jobs, it’s all about that flow of information within the flow of action. — Kerry Barrass, director of business programs, Microsoft Customer and Partner Solutions The sweet spot exists at the intersection of AI-enabled intelligence and CRM integration into the spaces where salespeople operate every day. Within Microsoft Teams, Copilot for Sales delivers real-time call insights, AI-generated meeting summaries, post-call analyses and action items, and more. In Microsoft Outlook, its abilities include crafting contextual email responses, summarizing lengthy threads, and creating Teams Collaboration Spaces associated with accounts and opportunities. Across both workspaces, Microsoft Copilot for Sales makes it easier to create, update, or view CRM contacts, opportunities, and other data associated with sales accounts. That mitigates the need for sellers to migrate to a different tool as they conduct the essential business of using or updating their CRM. “For sellers trying to do their jobs, it’s all about that flow of information within the flow of action,” says Kerry Barrass, director of business programs within Microsoft Customer and Partner Solutions. “While the conversation is fresh, the tool distills information down into consumable chunks and actionable items.” Those features come in handy because sales are complex and require strong coordination across large teams. One of our typical sales accounts involves anywhere from 20 to 50 individual employees, each with a vital role to play. As a result, it’s extremely difficult to get everyone on a call or piece together the narrative underlying email threads. “When I get copied into an email thread, I used to need a knowledge transfer meeting to get up to speed,” says Emilio Reyes Le Blanc, a technology specialist in Microsoft Sales. “This technology means I can just open an email thread, have Copilot generate a summary, and contextualize my existing relationships from the integrated pane within Outlook.” Taken together, these features deliver greater contextual understanding, more efficient workflows, and higher data fidelity within our CRM systems. One day, a magic button popped up in my Outlook and I got a prompt to try Copilot for Sales, so I taught myself to use it. One of the beautiful things about this tool is that its time to value is extraordinary. — Emilio Reyes Le Blanc, technology specialist, Microsoft Sales Deploying Microsoft Copilot for Sales has provided us with some helpful insights. Sellers have an eye for value, and when they saw what Microsoft Copilot for Sales could do, it generated a lot of excitement. The tool’s intuitive features mean that, from a user perspective, it isn’t a complicated solution. As a result, we’ve experienced a substantial organic boost to adoption. “One day, a magic button popped up in my Outlook and I got a prompt to try Copilot for Sales, so I taught myself to use it,” Reyes Le Blanc says. “One of the beautiful things about this tool is that its time to value is extraordinary.” When you’re deploying Microsoft Copilot for Sales to your own sellers, focus on visibility first. When the excitement takes hold, it will boost adoption among your self-motivated salespeople. Encourage that uptake to score some early champions. Not everyone is a self-driven early adopter—and that’s perfectly alright! Effective change management starts with understanding your audience and the complexities of your sales environment. We recommend building hero scenarios for each user persona by taking a granular look at their challenges, sales processes, and day-to-day work. Dig into their role descriptions and documentation and ask what they’re trying to accomplish. From there, you can piece together your enablement materials based on what provides value. Consider different learning formats and modalities as well. “You want to make readiness consumable and provide options,” Jones says. “Some people want to show up to a demo session, and some people want to watch a video on their own time, so it’s important to offer a variety of pathways to adoption.” Multimodality that includes courses, demos, written documentation, and more will help your readiness efforts reach the most people with the most impact. It’s always important to engage your leaders. That includes both organizational leadership and product champions. “Advocates and champions are always important, not just for leading from the front,” Barrass says. “You also get more candid feedback by empowering these people to be part of pilot groups.” Naturally, enthusiastic executive sponsorship is essential, especially with new technology. Not only do leaders provide direction and encouragement for their organizations, but they can also choose to give people space to allocate time and prioritize learning. Cultivate those sponsorships early and actively. Microsoft Copilot for Sales sits on top of our existing data repositories, so it engages with that data in the same way as any other connected tool. It’s less about the solution and more about having a robust infrastructure of administrative policies and technologies safeguarding your organization. — Alexandra Jones, senior business program and change manager, Microsoft Digital The same goes for employee champions. By running internal pilots targeting key user scenarios, you’ll ensure you receive early feedback to guide product development and a core of users who can help lead adoption across your organization. Your organization might be cautious about how AI tools interact with their data repositories, so deploying Microsoft Copilot for Sales is a good opportunity to review your data-loss prevention setup. By ensuring your policies are up to date, you can prevent accidental data loss or exposure. “Microsoft Copilot for Sales sits on top of our existing data repositories, so it engages with that data in the same way as any other connected tool,” Jones says. “It’s less about the solution and more about having a robust infrastructure of administrative policies and technologies safeguarding your organization.” It will be essential to initiate reviews within several key disciplines. Those include HR, legal, security, and the IT team responsible for maintaining and protecting your data estate. Within your sales teams themselves, administrators may have concerns about access. If that’s the case, encourage them to conduct a thorough security and role review. Guide those conversations using Microsoft Copilot for Sales product documentation. For sellers themselves, building trust in a new technology takes time. People might need to work up the confidence to try more intensive or involved features, especially if they’re reticent about AI technology. “Just start with two or three features that are really going to appeal to people,” Jones says. “Encourage sellers to ask what works best for their role.” We suggest salespeople start small with meeting and email summarization capabilities. They might not be ready to trust email drafting tools just yet, but when they see how the intelligence works through summarization, they’ll understand how Microsoft Copilot for Sales engages with information. After sellers have built up their understanding and confidence around how this tool engages with data, they can experiment with different features that apply to their work. Anyone in sales operations will tell you that high data fidelity in your CRM is crucial. Leadership needs to know their institutional data is resilient. Accuracy and completeness ensure up-to-date contact data along with a comprehensive view of relationships across internal and external teams. All this information helps sales managers make effective decisions, generate accurate forecasts, and properly understand attrition. In other words, the business value of CRM data management is enormous. It’s also prone to disarray because it formerly required salespeople to switch over to the CRM and input information. Microsoft Copilot for Sales changes all that. “Historically, the way for this to work is you would write the email, then go to a different window, find the account record, go to the contacts list, create a new one, put in all of the contact’s information, and save it,” Reyes Le Blanc says. “But here, I can do all that in one fell swoop.” If you’re a seller, get used to creating and updating CRM contacts from within Microsoft Teams and Outlook using Microsoft Copilot for Sales. This feature eliminates the need to re-enter information directly into the CRM and builds healthy habits around data fidelity. That flow of information works the other way as well. Be sure to use the contact card feature to view summaries of customer information from within Microsoft Outlook and Teams. That ensures you’re working with the most up-to-date data directly from your CRM. Prompt creation will become increasingly important as AI tools mature, so it’s worth honing those skills using Microsoft Copilot for Sales’s email drafting feature. A simple rule to remember is that the more you put in, the more you get out. “If you have specifics off the bat, like you know you want to schedule a meeting or there are a few key points to express, include those in your prompt,” Jones says. “Be succinct and save your own time, because that’s what the technology is for.” Prompting is just like any other practice. The more you work at it, the easier it becomes. Microsoft salespeople have already seen amazing success, and we’re just getting started. Within our sales organization, 12.5K out of 35K sales roles are Microsoft Copilot for Sales monthly active users—more than a third of the workforce. For a technology in its first year, that’s remarkable progress. As a seller, I can’t imagine working without artificial intelligence. — Emilio Reyes Le Blanc, technology specialist, Microsoft Sales Reyes Le Blanc estimates that he’s saving two hours each month creating contacts in Dynamics 365 and five hours a month reviewing emails. With over 6 million seller emails sent in our first quarter of this fiscal year, the potential for email time savings alone is enormous. He also finds his meeting notes much more accurate now that Microsoft Copilot for Sales has his back, especially when it comes to long lists of technologies or technical requirements. It’s the ideal tool for gathering details via the meeting review feature and performing keyword or conversational analyses. “This is a way to do more with less,” Reyes Le Blanc says. “As a seller, I can’t imagine working without artificial intelligence.” Considering our average salesperson participates in 17 meetings per week, those efficiencies really add up. As new features and integrations come into play, Microsoft Copilot for Sales’s horizons will only widen. Start using AI to streamline your selling experience with Microsoft Copilot for Sales.  Want more information? Email us and include a link to this story and we’ll get back to you. Please share your feedback with us—take our survey and let us know what kind of content is most useful to you. Tags: AI and Machine Learning, digital transformation, Dynamics 365, Microsoft 365 Mar 29, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tAngela Gamba The use of business applications in Microsoft Teams has become a strategic advantage for many organizations, as they can accelerate the digital transformation of all business areas, generating a high demand for the Information Technology (IT) team to make these applications available. While use of apps for Microsoft Teams can be daunting for IT Teams... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Our core system for managing our external workforce was showing its age in an increasingly demanding modern workplace environment—we needed to simplify our external staff management. Here at Microsoft, our large and diverse external, non-FTE workforce plays a vital role in our success. For us, external staff includes contractors, consultants, freelancers, and business guests who... Mar 27, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLukas Velush Microsoft runs on Microsoft technology. We are the proving ground for our products and when we say that software is enterprise-ready this means that we have already built it for and run it at scale in our own enterprise. We are in the business of building the future of technology. And more often than not,... Mar 25, 2024\t\t\t\t\t\t  |  \n\t\t\t\t\t\t\n\t\t\t\t\t\t\tInside Track staff Next-generation connectivity is enabling us to transform our internal enterprise network here at Microsoft. Deploying a more agile, secure, and effective network environment across Microsoft is empowering our employees to thrive in our new hybrid world. This article describes how we’re implementing this new network strategy, including goals, action areas, expected results, and a brief... If you’re on a sales team, you know that there are all kinds of distracting tasks that eat away at your time and get in the way of what you do best—building relationships with and solving problems for customers. There’s no doubt that modern salespeople need to rely on too many tools and services to...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more Join me, Lori Lamkin, and my esteemed colleague Nathalie D’Hers, as we take you on an extraordinary journey through the development, deployment, and continuous improvement of Microsoft Sales Copilot. As the Corporate Vice President (CVP) of Dynamics 365 Customer Experiences, I bring extensive leadership experience and strategic vision to guide the product team responsible for...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more As an organization, we immediately saw that advanced AI was going to create opportunities for our employees to increase their reach and impact. We knew we needed to move quickly to help them get ready for the moment. Our response? We assembled an ambitious data and AI curriculum through Microsoft Viva Learning that draws from...\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tRead more "
}