{
    "title": "Microsoft, Google ride AI wave as revenues surge",
    "date": "2/1/2024",
    "url": "https://www.postguam.com/news/national/microsoft-google-ride-ai-wave-as-revenues-surge/article_7887eacf-946b-5038-a5cc-866abca00cac.html",
    "text": "  Microsoft CEO Satya Nadella moved the fastest and furthest into the AI space, investing massively in ChatGPT-maker OpenAI and pushing AI across products while others chose to move more carefully Microsoft and Google delivered solid corporate earnings on Tuesday as the tech giants said demand for artificial intelligence services stoked revenue. The tech titans have made big bets on generative AI, with their cloud computing divisions seeing a boost in demand as clients seek the hefty -- and more expensive - computing power that drives the technology. Microsoft has moved the fastest and furthest into the AI space, investing in ChatGPT-maker OpenAI and pushing AI across products while others chose to move more carefully. The company said sales leaped to $62 billion for the October to December period, up 18 percent year-on-year and above the $61.1 billion projected by analysts. The AI revolution has helped propel Microsoft past Apple as the world's biggest company by market capitalization at more than three trillion dollars in value. The company's share price is up a staggering 70 percent from a year ago. \"We've moved from talking about AI to applying AI at scale,\" said Satya Nadella, chairman and CEO of Microsoft. Crucially, revenue for Microsoft's Azure cloud services jumped by 30 percent in the period, driven by the bigger computing needs that come with the adoption of AI. Overall, Microsoft's cloud services sales were up by 24 percent, the company said. \"By infusing AI across every layer of our tech stack, we're winning new customers and helping drive new benefits and productivity gains across every sector,\" Nadella said. Google also credited AI for boosting its profit in the same quarter. Alphabet reported a profit of $20.7 billion on revenue of $86.3 billion, with strong contributions from video-sharing platform YouTube and its cloud computing unit. Still mainly driven by ads, full-year revenue at Google reached $307.4 billion, up 8.7 percent from the previous 12 months. Ads brought in a total of $65.5 billion in the quarter, compared with $59 billion in the same period the prior year. While better than last year, this was lower than some market expectations and Google's share price was sharply lower in after hours trading on Wall Street. But sales in Google’s cloud-computing business climbed 26 percent, supporting the company's argument that it too is a major AI provider. Google trails Microsoft and Amazon's AWS, which are the world's top providers of cloud computing services. The search engine juggernaut has for years discreetly developed AI powers but was caught off guard when OpenAI in late 2022 released ChatGPT and teamed up with Microsoft to make its capabilities available to users worldwide. Alphabet Chief Executive Sundar Pichai told an analyst call that his company's newly developed Gemini AI model would deliver new capabilities across all products for the company. Matching moves by Microsoft with its office tools, Google has already infused its Google search engine as well as GMail and other tools with AI’s powers. gc-arp/bgs Originally published on doc.afp.com, part of the BLOX Digital Content Exchange.  Poll results are published every Monday in The Guam Daily Post.    Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}