{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.siliconrepublic.com/machines/microsoft-mistral-ai-deal-large-language-model-openai-azure",
    "text": "by Vish Gain 27 Feb 2024 Image: © JeanLuc Ichard/Stock.adobe.com Mistral – which was only launched in May last year – hit unicorn status in December after securing €385m. Now, it has unveiled its most advanced LLM yet. French AI company Mistral is the latest start-up to be backed by Microsoft after the software giant invested billions in OpenAI last year. As part of the deal, the value of which has not been disclosed, Mistral will provide commercial language models on Microsoft’s Azure cloud computing platform. “The AI industry is undergoing a significant transformation with growing interest in more efficient and cost-effective models, emblematic of a broader trend in technological advancement. In the vanguard is Mistral AI, an innovator and trailblazer,” wrote Eric Boyd, Corporate VP of Azure AI at Microsoft, in a blogpost. “Their commitment to fostering the open-source community and achieving exceptional performance aligns harmoniously with Microsoft’s commitment to develop trustworthy, scalable and responsible AI solutions.” This comes as the Paris-based start-up released its latest and most advanced language mode, Mistral Large, yesterday (26 February). Mistral said the new text-generation model has “top tier” reasoning capabilities and can be used for complex multilingual reasoning tasks such as including text understanding, transformation and code generation. We're announcing a multi-year partnership with @MistralAI, as we build on our commitment to offer customers the best choice of open and foundation models on Azure. https://t.co/k1L7lfFeES — Satya Nadella (@satyanadella) February 26, 2024  The company claims Mistral Large performs strongly on commonly used benchmarks, making it the world’s second-ranked model generally available through an API after OpenAI GPT-4. As well as English, the AI model is capable of processing native-level French, Spanish, German and Italian. “With Azure’s cutting-edge AI infrastructure, we are reaching a new milestone in our expansion propelling our innovative research and practical applications to new customers everywhere,” said Mistral CEO Arthur Mensch. “Together, we are committed to driving impactful progress in the AI industry and delivering unparalleled value to our customers and partners globally.” As part of the partnership, Microsoft and Mistral AI will explore collaboration around training purpose-specific models for select customers, including the European public sector. In December, Mistral – which was only launched in May last year – hit unicorn status after securing €385m in a round backed by Andreessen Horowitz (A16z), Nvidia and Salesforce. At the time, the start-up was valued at around $2bn. It was started by former researchers at Google’s Deepmind and Meta, and is focused on creating open-source large language models to compete with the likes of OpenAI and Google. Find out how emerging tech trends are transforming tomorrow with our new podcast, Future Human: The Series. Listen now on Spotify, on Apple or wherever you get your podcasts. Related:\n                    funding and investment,             AI,             France,             Microsoft Vish Gain is a journalist with Silicon Republic editorial@siliconrepublic.com 20 Feb 2024 1 Mar 2024 15 Feb 2024 16 Jan 2024 11 Dec 2023 11 Dec 2023 4 hours ago 5 hours ago 5 hours ago 6 hours ago 7 hours ago 9 hours ago 9 hours ago 10 hours ago 11 hours ago 11 hours ago 12 hours ago 12 hours ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago 1 day ago All content copyright 2002-2024 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Website by Square1.io "
}