{
    "title": "Microsoft buys 300 acres in Becker, Minnesota - DCD",
    "date": "2/15/2024",
    "url": "https://www.datacenterdynamics.com/en/news/microsoft-buys-300-acres-in-becker-minnesota/",
    "text": "Company also gains planning approval for two data centers in Iowa Microsoft has acquired hundreds of acres of land in Becker, Minnesota, from Xcel Energy. The tech giant has also been given the green light for two more data centers at one of its campuses in Des Moines, Iowa. Citing a recent real estate filing, BizJournal reports Microsoft purchased nearly 300 acres of land from the energy firm for $17.7 million. The seller was identified as United Power and Land Co., a company affiliated with Xcel, in a deal that closed on February 12. Xcel has confirmed the sale and Microsoft’s plans for a data center, but further details about the scope of the project weren’t shared. Xcel has previously been involved in two potential data center projects in Becker, where the company operates the Sherburne County Generating Station (also known as Sherco). Google had been in talks to develop the $600 million site near the Sherco power plant since 2017, but backed out of the project in late 2022. The company is also working with ‘Elk River Technologies’ on another 348-acre data center project near the power plant. The company behind Elk River has not been revealed. Kevin Coss, an Xcel spokesperson, confirmed to BJ that the Microsoft site was distinct from both the Google and Elk River sites. An Xcel statement added: \"We are pleased that the sale of the land has been completed and the effort to bring a data center to Becker is moving one step forward. The data center will bring investment and jobs to the area, providing the economic development the community has been seeking.\" Microsoft is yet to comment on the sale. The Minneapolis-based utility plans to close three big coal-fired generators at Sherco by 2030. First built in 1976, the coal-powered plant has a capacity of up to 2,238MW and is the largest power plant in the state. The site was initially constructed by Northern States Power Company (NSP), now a subsidiary of Xcel Energy. The company is reportedly planning a solar farm to replace the existing plant. Google was first reported as looking at building a $600 million data center on land next to the power plant in 2019; the search giant plans to build a 375,000-square-foot data center on roughly 300 acres of land owned by Xcel. However, Xcel said in December 2022 that the electric service agreement had been terminated and work on the project had ended. Xcel is also working with Meta on a separate data center project outside Minneapolis. In Iowa, the West Des Moines planning and zoning commission has approved site plans for two new data centers at its Ginger East campus. Business Record reports the two 245,000 sq ft buildings will be the third and fourth data centers built on the 124-acre campus. The site, located at 1475 S.E. Maffitt Lake Road can hold up to five data centers. The plans will now go before the City Council. Microsoft has a major presence around Des Moines, with multiple campuses in operation or development. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}