{
    "title": "Gaming giant Activision was already planning ‘significant’ layoffs: \nMicrosoft",
    "date": "2/8/2024",
    "url": "https://www.socialnews.xyz/2024/02/08/gaming-giant-activision-was-already-planning-significant-layoffs-microsoft/",
    "text": "Home » Science/Tech » Gaming giant Activision was already planning ‘significant’ layoffs: Microsoft Posted By: Gopi\nFebruary 8, 2024  San Francisco, Feb 9 (SocialNews.XYZ) Microsoft has revealed that Activision Blizzard, which it acquired recently for $68.7 billion, was already planning to slash a significant number of jobs before the acquisition. The tech giant is laying off at least 1,900 employees at gaming company Activision Blizzard as well as at Xbox.  In a response to the US Federal Trade Commission (FTC), the company said that consistent with broader trends in the gaming industry, “Activision was already planning on eliminating a significant number of jobs while still operating as an independent company.” “The recent announcement thus cannot be attributed fully to the merger,” said Microsoft. The FTC is still appealing a district court’s decision not to block Microsoft’s Activision Blizzard acquisition. “In continuing its opposition to the deal, the FTC ignores the reality that the deal itself has substantially changed. Since the FTC lost in court last July, Microsoft was required by the UK competition authority to restructure the acquisition globally and therefore did not acquire the cloud streaming rights to Activision Blizzard games in the United States,” a Microsoft spokesperson said on the FTC filing. “Additionally, Sony and Microsoft signed a binding agreement to keep Call of Duty on PlayStation on even better terms than Sony had before,” added the company spokesperson, reports The Verge. The latest job cuts will affect around 8 per cent of the overall Microsoft gaming division that has some 22,000 employees. “We have made the painful decision to reduce the size of our gaming workforce by approximately 1900 roles out of the 22,000 people on our team,” Microsoft Gaming CEO Phil Spencer had said in an internal memo. Activision Blizzard President Mike Ybarra has also left the company. “I want to thank everyone who is impacted today for their meaningful contributions to their teams, to Blizzard, and to players’ lives. It’s an incredibly hard day and my energy and support will be focused on all those amazing individuals impacted – this is in no way a reflection on your amazing work,” Ybarra posted on X. Microsoft completed its $68.7 billion acquisition of Activision Blizzard in October last year, after a long battle with regulators in the UK and the US. Source: IANS Gopi Adusumilli is a Programmer. He is the editor of SocialNews.XYZ and President of AGK Fire Inc. \nHe enjoys designing websites, developing mobile applications and publishing news articles on current events from various authenticated news sources.\nWhen it comes to writing he likes to write about current world politics and Indian Movies. His future plans include developing SocialNews.XYZ into a News website that has no bias or judgment towards any.\n\nHe can be reached at gopi@socialnews.xyzMail | Web | Twitter Gopi Adusumilli is a Programmer. He is the editor of SocialNews.XYZ and President of AGK Fire Inc. He enjoys designing websites, developing mobile applications and publishing news articles on current events from various authenticated news sources. When it comes to writing he likes to write about current world politics and Indian Movies. His future plans include developing SocialNews.XYZ into a News website that has no bias or judgment towards any. He can be reached at gopi@socialnews.xyz    Copyright 2024 | AGK FIRE INC|\nTerms of Service / Privacy Policy | Contact Us "
}