{
    "title": "ANSYS (ANSS) Q4 Earnings Beat Estimates, Revenues Up Y/Y",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/news/ansys-anss-q4-earnings-beat-132800581.html",
    "text": "ANSYS Inc ANSS reported fourth-quarter 2023 earnings of $3.94 per share, beating the Zacks Consensus Estimate by 6.5%. The bottom line improved 27.5% year over year.Non-GAAP revenues of $805.1 million topped the Zacks Consensus Estimate by 1.7%. The top line rose 16% (up 15% at constant currency or cc) year over year.For 2023, the company reported revenues of $2.27 billion, up 9.5% year over year. Non-GAAP earnings came in at $8.80 compared with $7.99 in 2022.In January 2024, Ansys and Synopsys officially announced their entry into a definitive agreement, paving the way for the latter to acquire ANSS. The terms of the agreement outline that ANSS’ shareholders will receive $197 in cash, along with 0.3450 shares of Synopsys common stock for each Ansys share.This deal, valued at approximately $35 billion, reflects an implied per-share consideration of $390.19 and represents a premium of about 29% over Ansys' closing stock price on Dec 21, 2023. ANSS’ shareholders are likely to own approximately 16.5% of the combined company (on a pro-forma basis). The deal is anticipated to close in the first half of 2025, subjected to approval by Ansys shareholders, regulatory approvals and customary closing conditions.Given the pending acquisition, the company will no longer provide financial outlook. ANSYS, Inc. price-consensus-eps-surprise-chart | ANSYS, Inc. Quote Subscription lease revenues (49.6% of non-GAAP revenues) were up 22.4% at cc to $399.6 million. Perpetual licenses revenues (12.8%) rose 14.8% year over year at cc to $102.7 million.Maintenance revenues (35.2%) climbed 7% at cc to $283.1 million. Service revenues (2.4%) were up 3.7% at cc year over year to $19.7 million.Direct and indirect channels contributed 74.5% and 25.5%, respectively, to non-GAAP revenues.ACV grew 16.8% year over year (up 16% at cc) to $955.2 million.On a geographic basis, the Americas, EMEA (comprising Germany, the U.K. and other EMEA) and the Asia-Pacific (Japan and Other Asia-Pacific) contributed 51%, 29.4% and 19.6% to non-GAAP revenues, respectively.Non-GAAP revenues from the Americas were up 14.3% at cc to $410.7 million. EMEA revenues were up 14.4% at cc to $236.9 million. Revenues from the Asia-Pacific increased 18.4% at cc to $157.6 million.Deferred revenues and backlogs were $1,472.6 million, up 3.9% year over year. Non-GAAP gross margin was up 30 basis points (bps) on a year-over-year basis to 94.3%.Total operating expenses gained 7.9% year over year to $402.1 million due to higher research and development, and selling, general and administrative expenses.Non-GAAP operating margin expanded 500 bps on a year-over-year basis to 53%. As of Dec 31, 2023, cash and short-term investments amounted to $860.4 million compared with $639.5 million as of Sep 30, 2023.As of Dec 31, 2023, the company’s long-term debt was $753.9 million compared with $753.8 million as of Sep 30, 2023.In the quarter under review, cash from operations came in at $232.7 million compared with $174 million in the prior-year quarter.Zacks RankANSYS currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks worth consideration in the broader technology space are Manhattan Associates MANH, Watts Water Technologies WTS and Microsoft MSFT. While Manhattan Associates sports a Zacks Rank #1 (Strong Buy), Watts Water and Microsoft carry a Zacks Rank of 2 (Buy) each, at present. You can see the complete list of today’s Zacks #1 Rank stocks here. The Zacks Consensus Estimate for MANH’s 2024 EPS has increased 3.6% in the past 60 days to $3.76. Manhattan Associates’ earnings beat the Zacks Consensus Estimate in each of the last four quarters, the average surprise being 27.6%. Shares of MANH have surged 66.9% in the past year.The Zacks Consensus Estimate for Watts Water’s 2024 EPS has improved 11 cents to $8.44 in the past 60 days. The long-term earnings growth rate is pegged at 7.8%. Shares of WTS have jumped 13.3% in the past year.The Zacks Consensus Estimate for Microsoft’s fiscal 2024 EPS is pegged at $11.63, indicating growth of 18.6% from the year-ago levels. Microsoft’s earnings beat the Zacks Consensus Estimate in each of the last four quarters, the average surprise being 8.8%. The long-term earnings growth rate is pegged at 16.2%. MSFT has gained 57.9% in the past year. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report Manhattan Associates, Inc. (MANH) : Free Stock Analysis Report Watts Water Technologies, Inc. (WTS) : Free Stock Analysis Report ANSYS, Inc. (ANSS) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}