{
    "title": "Microsoft debuts AI-powered Copilot for Finance as it continues \ncompany-wide AI push",
    "date": "2/29/2024",
    "url": "https://finance.yahoo.com/news/microsoft-debuts-ai-powered-copilot-for-finance-as-it-continues-company-wide-ai-push-040029184.html",
    "text": "Microsoft (MSFT) continues to roll out more generative AI capabilities across its software offerings with the debut of its Copilot for Finance. The company says the AI service, which is launching as a public preview, will make it easier for workers to sort data and find errors in financial reports. Microsoft has been adding its generative AI-powered Copilots to a slew of its business offerings ranging from Copilot for Microsoft 365 and Copilot for Sales to Copilot for Service. That’s in addition to the company’s Copilot in Windows 11, which is built into all Windows 11 PCs running the latest software updates. Microsoft’s Copilot for Finance, the company says, can provide real-time insights into corporate finance data, cutting down on the rigamarole of having to enter and search through seemingly endless rows and columns in Excel. The tech giant says its latest Copilot can also streamline audits, detect data variances, and help users generate PowerPoint presentations and emails based on available financial information using natural language prompts. The Windows maker isn’t revealing pricing for Copilot for Finance, but the service includes the company’s Copilot for Microsoft 365, which adds generative AI capabilities to the Microsoft 365 productivity suite. That platform traditionally costs $30 per user per month. Microsoft is putting an enormous amount of effort into ensuring it has a Copilot for each of its productivity platforms as it races to out-innovate rivals, including Google (GOOG, GOOGL) and Salesforce (CRM). Both of those companies, as well as a slew of other smaller firms, are also building generative AI services for their enterprise products to prove to customers that they’re on the bleeding edge of today’s hottest tech trend. Last week, Google debuted its Gemini Business, a $20-per-month add-on for its Gemini for Workspace productivity suite. The company also offers Gemini Enterprise, a $30-per-month add-on for Gemini for Workspace with enhanced features for meeting summaries and transcriptions. The push to bring generative AI tools to more enterprise-friendly services comes as Microsoft and its rivals seek to further monetize their enormous investments in generative AI technologies in recent years. Microsoft has already invested billions of dollars in ChatGPT developer OpenAI and is lined up to invest billions more throughout the next decade. On Tuesday, the company also disclosed it is working with OpenAI rival Mistral and will begin offering that firm’s AI models via its Azure cloud platform. In its most recent earnings report, Microsoft revealed that AI services contributed 6 percentage points of growth to Azure revenue, up from 3% in the prior quarter. Shares of the tech juggernaut are up 63% over the last 12 months. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that could impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}