{
    "title": "Up Nearly 70% Since The Beginning Of 2023, Where Is Microsoft Stock Headed?",
    "date": "2/5/2024",
    "url": "https://www.forbes.com/sites/greatspeculations/2024/02/05/up-nearly-70-since-the-beginning-of-2023-where-is-microsoft-stock-headed/",
    "text": "BARCELONA, SPAIN - JANUARY 30: A logo sits illuminated outside the Microsoft booth at ISE 2024 on ... [+] January 30, 2024 in Barcelona, Spain. This year the 20th edition of Integrated Systems Europe (ISE) is being held, the sixth in Barcelona. The hall occupies the entire surface of the Fira Gran Via exhibition center with 82,000 square meters, 30% more than last year. This year there are 1,340 exhibitors and more than 90,000 visitors are expected to attend. (Photo by Cesc Maymo/Getty Images) Microsoft’s stock (NASDAQ: MSFT) has gained nearly 70% since the start of 2023 as compared to the ~30% rise in the S&P500 index over the same period. At its current price of just above $400 per share, it is trading 4% below its fair value of $419 – Trefis’ estimate for Microsoft’s valuation. Amid the current financial backdrop, MSFT stock has seen extremely strong gains of 80% from levels of $220 in early January 2021 to around $400 now, vs. an increase of about 30% for the S&P 500 over this roughly 3-year period. However, the increase in MSFT stock has been far from consistent. Returns for the stock were 52% in 2021, -28% in 2022, and 57% in 2023. In comparison, returns for the S&P 500 have been 27% in 2021, -19% in 2022, and 24% in 2023 - indicating that MSFT underperformed the S&P in 2022. In fact, consistently beating the S&P 500 - in good times and bad - has been difficult over recent years for individual stocks; for other heavyweights in the Information Technology sector including AAPL, NVDA, and AVGO, and even for the megacap stars GOOG, TSLA, and AMZN. In contrast, the Trefis High Quality Portfolio, with a collection of 30 stocks, has outperformed the S&P 500 each year over the same period. Why is that? As a group, HQ Portfolio stocks provided better returns with less risk versus the benchmark index; less of a roller-coaster ride as evident in HQ Portfolio performance metrics. Given the current uncertain macroeconomic environment with high oil prices and elevated interest rates, could MSFT face a similar situation as it did in 2022 and underperform the S&P over the next 12 months - or will it see a strong jump? The company surpassed the street estimates in the second quarter of FY2024 (FY July-June), posting an 18% y-o-y increase in net revenues to $62 billion. It was due to a 13% y-o-y growth in productivity & business processes, a 20% rise in the intelligent cloud, and a 19% improvement in the more personal computing segments. While the productivity & business processes were mainly up due to growth in Office 365 commercial revenues, intelligent cloud benefited from Microsoft\nMSFT\n\nMSFT\n Azure and more personal computing from gaming-related income (Xbox content and services). On the cost front, the total expenses as a % of revenues decreased in the quarter. Overall, it resulted in a 31% y-o-y jump in the net income to $21.9 billion. The top-line rose by 15% y-o-y to $118.5 billion in the first six months of FY 2024. It was because of higher revenues in each of the three segments – productivity & business process, intelligent cloud, and more personal computing. Further, the operating expenses as a % of revenues witnessed a favorable drop. Altogether, the net income grew 30% y-o-y to $44.2 billion. Moving forward, we expect the same momentum to continue in Q3. Overall, Microsoft revenues are estimated to touch $242.5 billion in FY2024. Additionally, MSFT’s net income margin is likely to see a slight improvement in the year. It will likely result in a net income of $84.7 billion and an annual GAAP EPS of $11.43. This coupled with a P/E multiple of just below 37x points to a valuation of $419. MSFT Return Compared With Trefis Reinforced Portfolio Invest with Trefis Market Beating Portfolios See all Trefis Price Estimates  "
}