{
    "title": "Microsoft's app store intentions, new hardware and an Xbox Cloud Gaming app \non iOS?",
    "date": "2/16/2024",
    "url": "https://www.pocketgamer.biz/feature/83444/microsofts-app-store-intentions-new-hardware-and-xbox-cloud-gaming-on-ios/",
    "text": "Forgot password? Password Reset\nTo reset your pass, please enter your email below and submit. Your new password will then be emailed to you.\nYou can change this pass at any time on the \"edit profile\" link when logged in.\n\n\n\nEmail\n\n\n\n\n\n\n\nGot your password? To reset your pass, please enter your email below and submit. Your new password will then be emailed to you. You can change this pass at any time on the \"edit profile\" link when logged in. Got your password? Lisboa, Portugal Istanbul, Turkey London, UK Dubai, United Arab Emirates Berlin, Germany Tallinn, Estonia Tel Aviv, Israel Barcelona, Spain Dubai, United Arab Emirates Helsinki, Finland Lisboa, Portugal Istanbul, Turkey London, UK Berlin, Germany Tallinn, Estonia Tel Aviv, Israel Barcelona, Spain Istanbul, Turkey Total Active App (currently available for download): 5,556,538 Total Inactive Apps (no longer available for download): 213,633 Total Apps Seen in US App Store: 5,770,171 Number of Active Publishers in the US App Store: 1,706,043 Most Popular Categories Last night on the Xbox business update blog and podcast, Microsoft gaming boss Phil Spencer, Xbox president Sarah Bond and head of Xbox game studios Matt Booty spelled out the state of play for Xbox, teasing new hardware, confirming those cross-platform rumours but dodging Xbox mobile app store chat… Fortunately The Verge were able to tackle Spencer on the spicey subject after the event. So is Microsoft planning it's own Xbox-branded alternative app store? “There are three sides to it. There’s regulatory work to actually open up the ability to install another store on an Android or an iPhone, which isn’t done yet. We’re actively engaged in the Digital Markets Act, and the work that has to happen to make that possible,\" explained Spencer. \"Then there’s us actually building the store. We have some history there from having our own mobile store in the past. So we know how to go get that work done.\" “There’s a lot of excitement there for alternative storefronts on mobile devices that can offer better economics and are more, let’s say, ‘gamer first’ because it’s going to be an Xbox store that we would go put there. We’re able to drive engagement to that store because we’re now one of the biggest mobile publishers with Candy Crush, Call of Duty mobile, Diablo Immortal, and Minecraft. So we can actually use those games to help drive engagement to our store, which can benefit third parties as well.” And will Xbox Cloud Gaming proper be coming to iOS any time soon, thanks to the European DMA pressure? “There’s not room for us to monetize Xbox Cloud Gaming on iOS. I think the proposal that Apple put forward doesn’t go far enough to open up. We will continue to work with regulators, and Apple and Google, to create a space for alternative storefronts. I think alternative ways for people to buy things creates goodness for consumers and creators. I think the largest platform for gamers, which is mobile, should have the same,\" Spencer stated. Stumbling steps into multi-platform publishing The main event for most watchers last night however was the pre-event gossip of Microsoft abandoning Xbox exclusives and bringing Xbox games to other formats. Halo on PlayStation? Surely not… But it does make sense. With the increasing prominence of mobile and PC, the necessity for such exclusives is looking increasingly dated. Today’s gamers (and content consumers in general) expect to be able to access what they want, where they want. Place your property off in some distant walled garden and the chances are that the mainstream won’t even notice that it's there. Thus, rather than locking in a game in order to drive hardware sales, limiting a game's potential audience to owners of a single piece of hardware, starts to look like a bad move. And with Microsoft on the back foot as regards units sold, securing such Triple-A games from developers and publishers willing to walk away from PlayStation or Switch dollars has grown increasingly hard. However, on the night - perhaps scared of fan-boy retaliation - Microsoft’s wall-breaking moves were markedly less dramatic than everyone had predicted. “I do believe that exclusive games - games that are exclusive to a single piece of hardware - are going to be a smaller and smaller part of the games industry,” admitted Spencer. “That’s not some great insight. If you look at the last ten years and what the biggest games are today it’s a natural place. Whether that’s one console and PC, multiple consoles, mobile and PC, you see big games landing on multiple platforms, and we want to be a great platform for creators who are trying to realise that potential.” So which Xbox exclusives are making the jump to owners of Sony and Nintendo consoles? That’s when things got a little hazy… While the team WERE able to confirm that there would be four such games coming to other formats - former Xbox only games previously only available on Xbox - they weren’t able (or ready) to name them… Draw your own conclusions. Perhaps the ink wasn’t dry on the contracts. Perhaps the makers of these games didn’t want Xbox to blow their cover just yet. Perhaps Microsoft were seeking to calm the Xbox loyal, worried that they’d spent years backing the wrong horse. But after weeks of speculation the potentially explosive ‘moment’ became something of a damp squib non-announcement. “Not Starfield or Indiana Jones” Spencer did however confirm in direct questioning that the four titles are “not Starfield or Indiana Jones” - two games that were hotly tipped to be getting the multi-platform treatment before last night's event. Instead the four games are all “over a year old and have been on Xbox for a while.” “Two of them are community driven games and moving to other platforms will give us the opportunity to invest in them - it’s more players to play with. And two are smaller games that were never really meant to be platform exclusives. As they’ve fulfilled their potential on Xbox and PC we see an opportunity to utilise the other platforms,” explained Spencer. [Spoiler alert: Rumours place those four titles as being Hi-Fi Rush, Pentiment, Sea of Thieves and Grounded.] And - perhaps most tellingly - Spencer was keen to nix any notion of floodgates opening any time soon. “If you’re on those other consoles, please don’t take this as an indication that everything is coming. Because it’s not.” Likewise head of Xbox game studios Matt Booty was keen to highlight that “[Xbox] Game Pass will only be available on Xbox,” ending rumours of Microsoft’s intentions to get out of the hardware business, at least for one more generation or two, with the advent of “cross play and cross save” and “co-operation” being the key message of the night. Speaking of hardware… And new hardware? The rumours of an Xbox handheld won’t go away and Spencer did little to scotch that. While acknowledging that there will be new Xbox “options” coming this holiday season on the podcast, Spencer told The Verge “I’m a big fan of handhelds… but nothing to announce. What keeps people from playing certain hours? Well there’s some sleep, school, and kind of normal life, but some of it is just access. Do I have access to the games that I want to play right now? Obviously we’re kind of learning from what Nintendo has done over the years with Switch, they’ve been fantastic with that. So when I look at Steam Deck and the ROG and my Legion Go, I’m a big fan of that space.” It certainly wouldn’t be too much of a stretch to imagine Xbox taking a leaf out of PlayStation’s Portal curio… But rather focussing on remote play from your console, how about giving the unit some brains and making a portable Game Pass player? So fear not Xbox fans. Whatever they do next, rest assured it’ll involve hardware, it’ll play your existing game library or subscription and it’ll be coming down your chimney this Christmas. And if you're on mobile? Looks like Xbox is working harder than ever to let you play too. Daniel Griffiths is a veteran journalist who has worked on some of the biggest entertainment media brands in the world. He's interviewed countless big names, and covered countless new releases in the fields of videogames, music, movies, tech, gadgets, home improvement, self build, interiors and garden design. Yup, he said garden design… He’s the ex-Editor of PSM2, PSM3, GamesMaster and Future Music, ex-Deputy Editor of The Official PlayStation Magazine and ex-Group Editor-in-Chief of Electronic Musician, Guitarist, Guitar World, Rhythm, Computer Music and more. He hates talking about himself. Dubai, United Arab Emirates Helsinki, Finland Lisboa, Portugal Istanbul, Turkey London, UK "
}