{
    "title": "Microsoft tells European regulators Google has an edge in generative AI",
    "date": "3/17/2024",
    "url": "https://www.foxbusiness.com/technology/microsoft-tells-european-regulators-google-has-edge-generative-ai",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Simpler Trading VP of Options Danielle Shay gives investors the best three ways to trade Big Tech earnings on Making Money. Tech giant Microsoft told European antitrust regulators that rival Google has a competitive edge in generative artificial intelligence (AI) due to its trove of data and AI-optimized chips. Microsoft's comments were in response to a consultation launched by the European Commission in January on the level of competition between tech companies in generative AI. Generative AI tools like OpenAI's ChatGPT and Google's Gemini can produce human-like content in response to written prompts, but have triggered concerns about misinformation and intellectual property violations. \"Today, only one company – Google – is vertically integrated in a manner that provides it with strength and independence at every AI layer from chips to a thriving mobile app store. Everyone must rely on partnerships to innovate and compete,\" Microsoft said in its report to the Commission. EUROPEAN LAWMAKERS PASS AI ACT, WORLD'S FIRST COMPREHENSIVE AI LAW Microsoft told EU antitrust regulators that Google has a competitive edge in generative AI. ((Photo by Toby Scott/SOPA Images/LightRocket via Getty Images) / Getty Images) Microsoft explained that Google's AI semiconductors will give it a competitive advantage for years to come and that its large sets of proprietary data from Google Search Index and YouTube enabled it to train large language models that power Gemini. \"YouTube provides an unparalleled set of video content; it hosts an estimated 14 billion videos. Google has access to such content; but other AI developers do not,\" Microsoft wrote. IS GOOGLE TOO BROKEN TO BE FIXED? INVESTORS 'DEEPLY FRUSTRATED AND ANGRY,' FORMER INSIDER WARNS Microsoft says big tech firms partnering with startups can help prevent anti-competitive vertical integration. (Photo by Cesc Maymo/Getty Images / Getty Images) It also said that AI-powered voice assistants like the Google Assistant and Apple's Siri give those companies an edge, writing that they're \"well-positioned to evolve and leverage their respective existing voice assistants into leadership positions in generative AI. New entrants and competitors of Google and Apple will not enjoy the same advantages.\" Google pushed back on Microsoft's report with a spokesperson telling Reuters that, \"We hope the Commission's study will shine a light on companies that don't offer the openness of Google Cloud or have a long history of locking-in customers – and who are bringing that same approach to AI services.\" WHAT IS ARTIFICIAL INTELLIGENCE (AI)? Google pushed back on Microsoft's report, saying EU regulators should look at companies that lock customers into contracts and don't offer open cloud services. (Photo by Tayfun Coskun/Anadolu Agency via Getty Images / Getty Images) Microsoft's investment of more than $10 billion in OpenAI is under scrutiny by antitrust regulators in the European Union, and the company sought to tamp down regulatory concerns about such partnerships between tech giants and start-ups. It noted Anthropic receiving investment from Google and Amazon, as well as Salesforce and Nvidia investing in Cohere, plus Microsoft's investment in French firm Mistral. GET FOX BUSINESS ON THE GO BY CLICKING HERE \"All of these startups relied on different forms of investments and partnerships that enabled them to enter and expand in the space,\" Microsoft wrote. \"Encouraging pro-competitive partnerships in the AI space is an effective way to prevent companies from becoming vertically integrated in a manner that would result in an anti-competitive advantage.\" Reuters contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}