{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.windowscentral.com/microsoft/microsoft-makes-a-megadeal-with-a-french-ai-startup",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Microsoft recently got into a new multiyear deal with Mistral AI, but what does this mean for OpenAI which is currently under investigation by the Securities and Exchange Commission (SEC). Microsoft is undoubtedly placing all its bets on AI this year following its recent $16 million multiyear deal with French AI company, Mistral. According to Microsoft: \"Today, we are announcing a multiyear partnership between Microsoft and Mistral AI, a recognized leader in generative artificial intelligence. Both companies are fueled by a steadfast dedication to innovation and practical applications, bridging the gap between pioneering research and real-world solutions.\" Mistral AI ventured into the AI landscape recently and is already making waves and gaining traction for its advances in the sector. Microsoft's deal with Mistral AI took place while OpenAI CEO Sam Altman was under scrutiny by the Securities and Exchange Commission (SEC) (via The New York Times). The Commission is looking into Sam Altman following last year's OpenAI fiasco. The board of directors indicated that they had initially decided to oust Altman from his position because they no longer had faith in his leadership skills. They also indicated that Altman wasn't \"consistently candid in his communications with the board.\" This was an unpopular move among OpenAI staffers who threatened to resign if the board of directors didn't reinstate Sam Altman as CEO. They further indicated that \"OpenAI is nothing without its people.\" Microsoft was quiet throughout these proceedings, though it was reported that it had set up an Advanced AI unit in its San Francisco offices which was ready to absorb all the employees resigning from OpenAI. As you might already know, Microsoft is one of OpenAI's largest investors with a 49% stake. The tech giant's $16 million investment into Mistral AI will be converted into equity during the company's next funding round. The French AI company is quite similar to OpenAI as it also features an AI-powered chatbot like ChatGPT dubbed Le Chat.  While it may be impossible to answer this question directly, Microsoft is knee-deep in its relationship with OpenAI having integrated the startup's technology across most of its products and services, not forgetting its multi-billion dollar investment into the company's technology that extended the partnership further. All the latest news, reviews, and guides for Windows and Xbox diehards. Still, OpenAI has been under the spotlight for the past few months for the wrong reasons. Even Elon Musk, who happens to be one of the startup's early investors and co-founder filed a lawsuit against OpenAI and CEO Sam Altman for abandoning the company's core mission and choosing to go the for-profit way. With all the heat coming down on OpenAI, Microsoft managing and spreading its investments into other companies isn't entirely a bad idea. It could also mean that Microsoft is simply expanding its AI portfolio and the companies it chooses to work with. Kevin Okemwa is a seasoned tech journalist based in Nairobi, Kenya with lots of experience covering the latest trends and developments in the industry. With a passion for innovation and a keen eye for detail, he has written for leading publications such as OnMSFT, MakeUseOf, and Windows Report, providing insightful analysis and breaking news on everything revolving around the Microsoft ecosystem. While AFK and not busy following the ever-emerging trends in tech, you can find him exploring the world or listening to music. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}