{
    "title": "Microsoft's AI Gold Rush: Boom or Bubble Waiting to Burst?",
    "date": "3/7/2024",
    "url": "https://www.tradingview.com/news/investorplace:a942539a9094b:0-microsoft-s-ai-gold-rush-boom-or-bubble-waiting-to-burst/",
    "text": "Microsoft MSFT is the world’s most valuable company. It’s a fact that I’m sure MSFT stock investors love. But does it deserve to be? Compare it to Apple AAPL, which it passed in market cap recently, and you can see it’s a momentum play. Applehad sales of $383 billion last year. Microsoft’swere $211 billion. Apple reported $96 billion of that revenue as net income. MSFT stock reported $72 billion. What makes the difference is that Apple revenues were higher in 2022 than 2023. Microsoft’s grew about 8%. Microsoft should continue that growth this year. Apple’s revenues are now expected to decline. The AI Sweet Spot MSFT stock is in the Generative Artificial Intelligence (GenAI) sweet spot. It controls OpenAI, and its Co-Pilot is already drawing enormous revenue. AI is driving today’s stock market. That should mean 14% growth according to analysts. We’re talking about $257 billion in fiscal 2025 revenue (Microsoft’s fiscal year starts in July), against $225 billion expected for 2024. Profit growth is also expected to be 14%. If you’re buying Microsoft stock today, you consider those estimates low. Microsoft’s Azure cloud is taking market share from AmazonAMZN. Microsoft has successfully tied Generative AI to its software suite. This is in contrast to the situation at Alphabet GOOG, where search and AI are competing for resources. MSFT stock has also, so far, dodged some of the antitrust problemsthat now bedevil Google. Thank its own antitrust history, where it lost over a decade of progress to consent decrees. The Cloud Czar built by CEO Satya Nadella is a complete reinvention of the company, a process Microsoft’s rivals have barely begun. Remember, the company built by Bill Gates was based on software packed in boxes and installed by users. Rising Costs Life isn’t all gravy at Microsoft these days. Getting the cost balance right between cloud and programming is a challenge. This is illustrated by what’s happening now in my hometown of Atlanta. Microsoft just bought land to expand its data center southwest of the city. At the same time, it has stalled the development of a planned office complex near downtown and the city wants its land back. The blowback may include higher taxes. Microsoft put $22.7 billioninto capital spending during the first two quarters of this year. It’s on pace to blow away last year’s record capital spending of $31.9 billion. That’s why Microsoft laid off 1,900 gaming employeesrecently. It laid off over 10,000people last year. It’s raising prices wherever it can. For every two programmers it lets go, Microsoft may only be able to afford one GenAI programmer. The average programmer in the U.S. today is earning about $29 per hour, or $60,000 per year. If they’re working on Generative AI, the pay can be twice that. The Bottom Line Even the Kings of AI face hard choices, between investing in people and investing in things. Microsoft is doing big business in AI tools and cloud capacity. Not all of it is being done in cash. Much of the money it has put into OpenAI and, more recently, into Mistral, is in the form of Azure credits. These decisions limit the benefits Microsoft will get from GenAI applications, even while they raise the hackles of antitrust authorities. Those concerns are serious. Microsoft’s attempt to sidestep European regulators, separating its Teams and Office suites, failed to satisfy them. Europe is looking into its security software and even the OpenAI deal. That doesn’t mean you should sell your Microsoft stock. But the current Price to Earnings (PE) multiple of over 36, and a yield of under .75%, means it’s fully valued. You’re bumping against a ceiling, and that ceiling isn’t rising fast enough to keep future downdrafts away. I’d wait for those downdrafts before buying more. As of this writing, Dana Blankenhorn had LONG positions in MSFT, AAPL, GOOGL, and AMZN. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Write him at danablankenhorn@gmail.com, tweet him at @danablankenhorn, or subscribe to his free Substack newsletter. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on Mastodon or subscribe to his Substack. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}