{
    "title": "Vanguard Group Inc. Acquires 2,484,554 Shares of Ovintiv Inc. (NYSE:OVV)",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-ovv-sec-filing-2024-03-19/",
    "text": "Vanguard Group Inc. boosted its holdings in Ovintiv Inc. (NYSE:OVV - Free Report) by 10.1% during the third quarter, according to the company in its most recent Form 13F filing with the Securities & Exchange Commission. The firm owned 27,029,983 shares of the company's stock after acquiring an additional 2,484,554 shares during the quarter. Vanguard Group Inc. owned 9.90% of Ovintiv worth $1,285,816,000 at the end of the most recent quarter. Other institutional investors and hedge funds have also added to or reduced their stakes in the company. Xponance Inc. grew its stake in shares of Ovintiv by 0.6% during the third quarter. Xponance Inc. now owns 41,823 shares of the company's stock valued at $1,990,000 after purchasing an additional 240 shares during the last quarter. LPL Financial LLC lifted its holdings in Ovintiv by 0.3% in the third quarter. LPL Financial LLC now owns 89,668 shares of the company's stock valued at $4,265,000 after buying an additional 261 shares during the period. US Bancorp DE lifted its holdings in Ovintiv by 3.2% in the second quarter. US Bancorp DE now owns 9,332 shares of the company's stock valued at $355,000 after buying an additional 286 shares during the period. Signaturefd LLC lifted its holdings in Ovintiv by 1.7% in the third quarter. Signaturefd LLC now owns 19,093 shares of the company's stock valued at $908,000 after buying an additional 317 shares during the period. Finally, Washington Trust Bank lifted its holdings in Ovintiv by 6.3% in the third quarter. Washington Trust Bank now owns 5,721 shares of the company's stock valued at $272,000 after buying an additional 340 shares during the period. Institutional investors own 98.30% of the company's stock. Shares of NYSE:OVV traded up $0.43 during midday trading on Tuesday, hitting $51.03. The stock had a trading volume of 4,030,760 shares, compared to its average volume of 3,234,183. The company's 50-day moving average price is $44.89 and its 200-day moving average price is $45.46. The company has a market capitalization of $13.75 billion, a P/E ratio of 6.47, a price-to-earnings-growth ratio of 2.51 and a beta of 2.66. The company has a quick ratio of 0.60, a current ratio of 0.60 and a debt-to-equity ratio of 0.53. Ovintiv Inc. has a fifty-two week low of $32.07 and a fifty-two week high of $51.91. The business also recently declared a quarterly dividend, which will be paid on Thursday, March 28th. Investors of record on Friday, March 15th will be issued a dividend of $0.30 per share. This represents a $1.20 annualized dividend and a dividend yield of 2.35%. The ex-dividend date of this dividend is Thursday, March 14th. Ovintiv's dividend payout ratio (DPR) is presently 15.21%. In other news, EVP Renee Ellen Zemljak sold 76,264 shares of the business's stock in a transaction that occurred on Thursday, March 14th. The shares were sold at an average price of $50.96, for a total value of $3,886,413.44. Following the transaction, the executive vice president now owns 23,672 shares in the company, valued at approximately $1,206,325.12. The sale was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through the SEC website. In related news, EVP Renee Ellen Zemljak sold 76,264 shares of the business's stock in a transaction on Thursday, March 14th. The shares were sold at an average price of $50.96, for a total transaction of $3,886,413.44. Following the transaction, the executive vice president now owns 23,672 shares in the company, valued at approximately $1,206,325.12. The transaction was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. Also, EVP Rachel Maureen Moore sold 9,300 shares of the company's stock in a transaction on Friday, March 1st. The stock was sold at an average price of $50.65, for a total transaction of $471,045.00. Following the transaction, the executive vice president now owns 52,557 shares in the company, valued at approximately $2,662,012.05. The disclosure for this sale can be found here. Insiders have sold 91,564 shares of company stock valued at $4,660,818 in the last ninety days. 0.91% of the stock is currently owned by insiders. Several equities analysts recently weighed in on the stock. Mizuho cut their price objective on shares of Ovintiv from $67.00 to $59.00 in a report on Wednesday, January 3rd. Royal Bank of Canada increased their target price on shares of Ovintiv from $48.00 to $49.00 and gave the stock a \"sector perform\" rating in a report on Thursday, February 29th. UBS Group lowered their price objective on shares of Ovintiv from $63.00 to $57.00 and set a \"buy\" rating for the company in a research report on Thursday, December 14th. Scotiabank lowered their price objective on shares of Ovintiv from $53.00 to $50.00 and set an \"outperform\" rating for the company in a research report on Tuesday, January 16th. Finally, National Bankshares lowered their price objective on shares of Ovintiv from $69.00 to $53.00 and set an \"outperform\" rating for the company in a research report on Wednesday, January 10th. Five analysts have rated the stock with a hold rating and eight have assigned a buy rating to the company. According to data from MarketBeat.com, the stock has a consensus rating of \"Moderate Buy\" and an average target price of $53.87. Check Out Our Latest Research Report on OVV Ovintiv Inc, together with its subsidiaries, explores, develops, produces, and markets natural gas, oil, and natural gas liquids in the United States and Canada. The company operates through USA Operations, Canadian Operations, and Market Optimization segments. Its principal assets include Permian in west Texas and Anadarko in west-central Oklahoma; and Montney in northeast British Columbia and northwest Alberta.Featured ArticlesFive stocks we like better than OvintivThe How and Why of Investing in Biotech StocksGrowing Twice as Fast as Tesla, XPeng is a BuyThe Role Economic Reports Play in a Successful Investment Strategy4 Stocks Building Long-Term Value for Shareholders How to Invest in the Best Canadian Stocks FedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount  Before you consider Ovintiv, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Ovintiv wasn't on the list. While Ovintiv currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}