{
    "title": null,
    "date": "3/16/2024",
    "url": "https://www.fool.com/investing/2024/03/16/magnificent-seven-stock-pays-most-dividends/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Many income investors focus mainly on a company's track record for making and raising dividend payments, and the dividend yield. But if you've been wondering which companies pay the most dividends, you've come to the right place. The top candidates would be large companies with high yields, but the two companies with the highest dividend expenses are actually Microsoft (MSFT -0.17%) and Apple (AAPL -1.06%) -- both \"Magnificent Seven\" stocks. Here's a look at the 10 U.S.-based companies with the largest dividend expenses, why Microsoft leads the group, and why Microsoft is worth buying now. Image source: Getty Images. Other than ExxonMobil and Bank of America, the 10 U.S. companies with the largest dividend expenses are all in the Dow Jones Industrial Average, which is known for having industry-leading companies as its components.  MSFT Total Dividends Paid (TTM) data by YCharts. If you follow the purple line in the chart, you'll see that Microsoft's dividend payment has increased significantly, especially recently. In fact, it has nearly doubled over the last six years. For fiscal 2024, Microsoft increased its dividend by more than 10%. Because it is such a large company, each 5% increase in the dividend translates to around $1 billion more in dividend expenses. Meanwhile, Apple has made bare minimum dividend raises of 1 cent per share per year for the last few years. Apple prefers to return money to shareholders via stock buybacks rather than with dividends. Microsoft has a below-average yield of just 0.7% -- but that's still the most of any Magnificent Seven stock, even when factoring in Meta Platforms' new dividend. Microsoft has made sizable dividend hikes, but its stock price growth has well outpaced that dividend growth rate, which has resulted in a shrinking yield over time. Over the last decade, management has nearly tripled the dividend, yet the yield has fallen from more than 2.5% to 0.7% simply because of the stock's monster 900% gain over that time.  MSFT data by YCharts. If you're looking to build passive income streams for the long haul, then a company's ability and willingness to raise its dividend will prove more important than its current yield. Microsoft stands out because it can afford to raise its dividend regularly, buy back stock, fund its operations, invest in research and development, and still maintain a balance sheet with more cash than debt. Essentially, Microsoft can do it all. It's better to view its dividend as a cherry on top of its investment thesis instead of looking at it in isolation. There are three basic ways a company can reward its shareholders -- capital gains, dividends, and stock repurchases. When considering whether to invest in a stock, it's important to understand which of those levers the company is most focused on pulling. For many companies, it's all about capital gains. Amazon and Tesla, for example, fit in that category: They don't pay dividends and have large stock-based compensation programs, which increase their outstanding share counts and dilute their existing shareholders. For a stodgy dividend-payer like Procter & Gamble, dividends and buybacks are arguably a bigger part of the investment thesis than potential share price gains. Although P&G can still surprise to the upside -- the stock is up by more than 9% year to date and is beating the S&P 500. Then there are the rare companies that both have plenty of room to grow and also reward their shareholders with buybacks and dividends. Microsoft is in this elite category. Over the last five years, the company has reduced its share count by 3%, raised its dividend by 63%, and its stock price is up by more than 255%. It has delivered the trifecta for shareholders. Microsoft stands out as one of the most well-rounded buys in the stock market right now because it is a relatively low-risk but high potential-reward company. With such high cash flow and a strong balance sheet, Microsoft can afford to make mistakes, fund acquisitions, try something new, and take risks at times when many other companies lack the capital or market position to do so. Microsoft also has a clear path toward monetizing artificial intelligence (AI). It has multiple high-margin business units that are related but still diversified. Microsoft Copilot is an AI assistant that works across multiple applications, among them the Microsoft 365 programs and GitHub. On Microsoft's fiscal 2024 second-quarter earnings call, management went into detail about the many ways that Copilot is helping its customers save time and drive efficiency, and it's contributing to the bottom line. Even if Copilot hits a snag and its impact on growth across all these products turns out to be limited, it's not the company's only AI play. There's also Azure AI for Microsoft's Intelligent Cloud segment, which serves a completely different industry than Copilot targets. In sum, Microsoft's AI aspirations don't hinge on a single product or idea. AI is already boosting the company's profitability and contributing to growth, and there's no reason to believe that trend will slow down anytime soon. Expect that to produce a snowball effect. Microsoft could choose to accelerate its share price growth, return capital to shareholders through larger buybacks, or raise its dividend at a faster rate. Investors stand to benefit no matter which lever Microsoft chooses to pull. The only issue with Microsoft is its valuation. It trades at a 36.8 price-to-earnings (P/E) ratio, which is well above its historical average and the S&P 500's 27.8 average P/E ratio. The stock isn't cheap, which shows that investors already have high expectations for Microsoft. Don't expect Microsoft's valuation expansion to continue. The gains will have to be driven by earnings, which isn't a bad thing. It just means some of the \"easy money\" has already been made. The good news is that Microsoft has a multidecade runway for growing earnings and rewarding its shareholders. Even with the stock's expensive price tag, Microsoft stands out as one of the safer ways to invest in AI and collect some passive income in the process. JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Bank of America is an advertising partner of The Ascent, a Motley Fool company. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, Bank of America, Chevron, Home Depot, JPMorgan Chase, Microsoft, and Tesla. The Motley Fool recommends Johnson & Johnson and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}