{
    "title": "Microsoft Stock: A 36.1% Profit Margin Capitalized At 34x (NASDAQ:MSFT)",
    "date": "3/1/2024",
    "url": "https://seekingalpha.com/article/4675289-microsoft-stock-36-1-percent-profit-margin-capitalized-at-34x",
    "text": "David Becker David Becker The following segment was excerpted from this fund letter. Microsoft enjoyed a phenomenal ten years to 2021, the stock compounding by 32.0%. Sales grew 9.9% annually, margins grew from 31.1% to 35.5% and investors bid the stock up from a bargain basement single-digit 9.7x earnings to 38.5x. Multiple expansion alone contributed 14.7% per annum to return.  The business had gone through the doldrums following the tech bubble. Revenue growth slowed while margins and multiples both contracted. By 2015 half of profits were being paid as dividends. The share count peaked in 2004 at almost 1 1 billion outstanding and now resides 33% lower. During the ten years to 2021 the company retired 10.5% of shares, contributing 1.1% to annual return. Like the other Magnificents, Microsoft's shares tanked in 2022 and reverted back up last year, returning 6.7% annually over the two years. More than all of the stock's positive return came from ongoing strong sales growth, which grew by nearly a quarter over the two years, adding 10.9% to annual return. Offsetting gains in revenues was a contraction in Microsoft's P/E from 38.5x to 34.0x, harming return by 6.0% a year. The dividend payout is back to roughly 25% of annual profit, but like Apple (AAPL) and its high price, a tiny earnings yield also means a tiny dividend yield, which averaged 1.0%. Also, like Apple, repurchasing shares at high prices, even with large portions of operating cash flow, doesn't dent the share count by much - Microsoft's shrank by only 0.5% a year, not adding much to return. Unlike Apple, Microsoft has found a use for big money outside dividends and share repurchases. Azure, Microsoft's cloud business, is a beast and absorbing a mountain of capital which for now is extremely profitable. It's a great example of a management team knowing where to spend its money and how to reinvent itself at the same time. Why buy shares at a 3% earnings yield or why send profits out as dividends if the next data center or R&D spent on software produces incredible returns? From an investment and future return standpoint, how much more than sales growth can be expected when a 36.1 % profit margin is capitalized at 34x? Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}