{
    "title": "Microsoft and OpenAI plan $100 billion supercomputer: report",
    "date": "3/29/2024",
    "url": "https://www.businessinsider.com/microsoft-openai-plan-100-billion-supercomputer-stargate-artificial-intelligence-report-2024-3",
    "text": "       Microsoft and OpenAI are planning an unprecedented supercomputer that uses millions of specialized server chips and could cost up to $100 billion, The Information reported this week. The US-based supercomputer, known as \"Stargate,\" would be the centerpiece of a five-phase plan focused on a series of supercomputer installations the companies plan to build in the next six years, the outlet reported. Stargate, which would be phase 5 of the plan, could launch as soon as 2028, people involved in the proposal told The Information. Executives at both companies have already drawn up plans for the data center project, which would power OpenAI's artificial intelligence, according to the outlet. A spokesperson for Microsoft declined to comment directly on the report but highlighted the company's demonstrated ability to build pioneering AI infrastructure. \"We are always planning for the next generation of infrastructure innovations needed to continue pushing the frontier of AI capability,\" a representative for the company told Business Insider. OpenAI did not immediately respond to a request for comment from BI. Related stories Microsoft, which has already committed more than $13 billion to OpenAI, would likely provide funding for Stargate, per the report. OpenAI currently uses Microsoft data centers to power its generative AI system ChatGPT in exchange for Microsoft having exclusive rights to resell OpenAI's technology to its own customers. Microsoft insiders told Business Insider earlier this month that the company's strategy has increasingly focused on its work with OpenAI, leading some to worry that Microsoft is essentially becoming an IT department for the startup. The supercomputer could be 100 times more expensive than the largest data centers currently in operation, per the report. The project signals the massive amount of money likely to be poured into the industry as artificial intelligence continues to evolve in the coming years. Stargate also has the potential to far exceed the computing power currently supplied by Microsoft to OpenAI from its data centers around the country but would require at least several gigawatts of power to do so, The Information reported, Microsoft's involvement in the project, however, hinges on OpenAI fulfilling its promise to boost its AI's capabilities, a source told the outlet. The quest to obtain the necessary server chips is the primary factor driving Stargate's hefty price tag, according to the report. Finding enough energy sources to power the project could also pose challenges, and the two companies have talked about possibly using alternative power sources like nuclear energy, sources said. The demand for AI chips has reached a fever pitch, allowing a select few companies — primarily Nvidia — to control the market. Altman has expressed frustration with the \"brutal\" situation and signaled earlier this year that he wants to make his own. The chip dilemna is just one of several details that still need to be ironed out with regard to Stargate. People familiar with the project told The Information that Microsoft needs to figure out how to put more GPUs into a single rack than it currently does in order to boost the chips' performance. The company also needs to find a way to prevent the chips from overheating, according to the report. It's not clear where Stargate would be located or whether it would be built in just one data center or several nearby centers, The Information reported. Axel Springer, Business Insider's parent company, has a global deal to allow OpenAI to train its models on its media brands' reporting. Read next Jump to "
}