{
    "title": "Insider Selling: MSP Recovery, Inc. (NASDAQ:LIFW) Major Shareholder Sells \n41,937 Shares of Stock",
    "date": "3/18/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-lifw-insider-buying-and-selling-2024-03-18/",
    "text": "MSP Recovery, Inc. (NASDAQ:LIFW - Get Free Report) major shareholder Cano Health, Inc. sold 41,937 shares of the business's stock in a transaction dated Monday, March 18th. The shares were sold at an average price of $0.79, for a total value of $33,130.23. Following the completion of the sale, the insider now directly owns 2,308,360 shares of the company's stock, valued at $1,823,604.40. The sale was disclosed in a legal filing with the SEC, which is available through this link. Large shareholders that own 10% or more of a company's shares are required to disclose their transactions with the SEC. Cano Health, Inc. also recently made the following trade(s): On Friday, March 15th, Cano Health, Inc. sold 44,305 shares of MSP Recovery stock. The shares were sold at an average price of $0.78, for a total value of $34,557.90. On Wednesday, March 13th, Cano Health, Inc. sold 41,584 shares of MSP Recovery stock. The shares were sold at an average price of $0.84, for a total value of $34,930.56. On Monday, March 11th, Cano Health, Inc. sold 36,964 shares of MSP Recovery stock. The shares were sold at an average price of $0.94, for a total value of $34,746.16. On Friday, March 8th, Cano Health, Inc. sold 22,694 shares of MSP Recovery stock. The shares were sold at an average price of $0.96, for a total value of $21,786.24. On Wednesday, March 6th, Cano Health, Inc. sold 133,518 shares of MSP Recovery stock. The shares were sold at an average price of $1.02, for a total value of $136,188.36. On Monday, March 4th, Cano Health, Inc. sold 774,400 shares of MSP Recovery stock. The stock was sold at an average price of $1.23, for a total value of $952,512.00. On Friday, March 1st, Cano Health, Inc. sold 532,691 shares of MSP Recovery stock. The shares were sold at an average price of $1.04, for a total value of $553,998.64. On Wednesday, February 28th, Cano Health, Inc. sold 36,841 shares of MSP Recovery stock. The shares were sold at an average price of $0.82, for a total value of $30,209.62. On Monday, February 26th, Cano Health, Inc. sold 22,664 shares of MSP Recovery stock. The stock was sold at an average price of $0.81, for a total value of $18,357.84. On Thursday, February 22nd, Cano Health, Inc. sold 31,658 shares of MSP Recovery stock. The stock was sold at an average price of $0.82, for a total value of $25,959.56. MSP Recovery Stock Up 3.3 % Shares of LIFW traded up $0.03 during mid-day trading on Monday, hitting $0.79. 280,700 shares of the company traded hands, compared to its average volume of 991,402. The company has a quick ratio of 0.54, a current ratio of 0.54 and a debt-to-equity ratio of 0.39. The stock has a 50-day moving average price of $0.88 and a two-hundred day moving average price of $1.40. MSP Recovery, Inc. has a 1 year low of $0.72 and a 1 year high of $25.75. Hedge Funds Weigh In On MSP Recovery A number of institutional investors have recently bought and sold shares of the stock. Vanguard Group Inc. lifted its stake in MSP Recovery by 36.1% in the 3rd quarter. Vanguard Group Inc. now owns 6,369,728 shares of the company's stock worth $1,368,000 after purchasing an additional 1,690,836 shares in the last quarter. Palantir Technologies Inc. raised its holdings in shares of MSP Recovery by 317.5% in the 3rd quarter. Palantir Technologies Inc. now owns 9,038,838 shares of the company's stock valued at $1,989,000 after purchasing an additional 6,873,651 shares in the last quarter. Pin Oak Investment Advisors Inc. bought a new stake in MSP Recovery during the 2nd quarter valued at $149,000. Cantor Fitzgerald L. P. purchased a new position in MSP Recovery in the second quarter valued at about $319,000. Finally, Marshall Wace LLP purchased a new position in shares of MSP Recovery in the 2nd quarter worth approximately $208,000. 6.15% of the stock is owned by institutional investors. About MSP Recovery (Get Free Report) MSP Recovery, Inc, doing business as LifeWallet, operates as a healthcare recoveries and data analytics company in the United States and Puerto Rico. The company offers claims recovery services, including services to related parties or third parties to assist entities with pursuit of claims recovery rights.See AlsoFive stocks we like better than MSP RecoveryDividend Tax CalculatorWalmart: Here’s Your Chance to Get in Cheaper in 2024The Role Economic Reports Play in a Successful Investment StrategyInsider Selling of Amazon Spikes in Q1, but it's Not Time to SellHow to invest in blue chip stocks2 Deep Value, High Yield Stocks With a Double-Digit UpsideThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Trump’s “Tax Free” Retirement Strategy  (From Gold Safe Exchange) (Ad)Should you invest $1,000 in MSP Recovery right now?Before you consider MSP Recovery, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and MSP Recovery wasn't on the list.While MSP Recovery currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here Ten Starter Stocks For Beginners to Buy NowJust getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider MSP Recovery, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and MSP Recovery wasn't on the list. While MSP Recovery currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}