{
    "title": "32,771 Shares in APi Group Co. (NYSE:APG) Bought by Redhawk Wealth Advisors \nInc.",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-apg-sec-filing-2024-03-21/",
    "text": "Redhawk Wealth Advisors Inc. acquired a new position in APi Group Co. (NYSE:APG - Free Report) during the 4th quarter, according to the company in its most recent Form 13F filing with the Securities & Exchange Commission. The fund acquired 32,771 shares of the company's stock, valued at approximately $1,134,000. Several other institutional investors also recently modified their holdings of the business. Findlay Park Partners LLP raised its holdings in shares of APi Group by 225.7% during the third quarter. Findlay Park Partners LLP now owns 3,832,820 shares of the company's stock valued at $99,385,000 after purchasing an additional 2,656,158 shares during the period. Norges Bank acquired a new position in shares of APi Group during the fourth quarter valued at about $34,300,000. Progeny 3 Inc. raised its holdings in shares of APi Group by 313.5% during the second quarter. Progeny 3 Inc. now owns 1,611,360 shares of the company's stock valued at $43,926,000 after purchasing an additional 1,221,690 shares during the period. Prudential Financial Inc. raised its holdings in shares of APi Group by 6,301.4% during the first quarter. Prudential Financial Inc. now owns 880,510 shares of the company's stock valued at $18,517,000 after purchasing an additional 866,755 shares during the period. Finally, JPMorgan Chase & Co. raised its holdings in shares of APi Group by 227.7% during the second quarter. JPMorgan Chase & Co. now owns 1,122,136 shares of the company's stock valued at $30,589,000 after purchasing an additional 779,663 shares during the period. Institutional investors own 83.44% of the company's stock. Analyst Upgrades and Downgrades A number of equities research analysts recently weighed in on the stock. JPMorgan Chase & Co. upped their target price on shares of APi Group from $31.00 to $35.00 and gave the stock a \"neutral\" rating in a report on Wednesday, March 6th. Barclays increased their target price on shares of APi Group from $37.00 to $44.00 and gave the stock an \"overweight\" rating in a research note on Thursday, February 29th. UBS Group increased their target price on shares of APi Group from $40.00 to $48.00 and gave the stock a \"buy\" rating in a research note on Tuesday, March 5th. Citigroup raised their price objective on shares of APi Group from $36.00 to $43.00 and gave the company a \"buy\" rating in a research report on Monday, March 4th. Finally, Jefferies Financial Group initiated coverage on shares of APi Group in a research report on Friday, March 15th. They issued a \"buy\" rating and a $48.00 target price on the stock. Two analysts have rated the stock with a hold rating and five have issued a buy rating to the stock. Based on data from MarketBeat, the stock currently has a consensus rating of \"Moderate Buy\" and a consensus price target of $40.43. Get Our Latest Stock Report on APi GroupAPi Group Trading Up 1.9 % APG stock traded up $0.71 during trading on Thursday, hitting $39.00. The company had a trading volume of 956,042 shares, compared to its average volume of 1,527,304. The firm has a market capitalization of $10.19 billion, a P/E ratio of -51.32, a PEG ratio of 1.14 and a beta of 1.63. APi Group Co. has a 52-week low of $20.43 and a 52-week high of $39.94. The company has a 50 day simple moving average of $34.86 and a 200-day simple moving average of $30.86. The company has a quick ratio of 1.35, a current ratio of 1.43 and a debt-to-equity ratio of 1.12. APi Group (NYSE:APG - Get Free Report) last posted its earnings results on Wednesday, February 28th. The company reported $0.44 EPS for the quarter, beating analysts' consensus estimates of $0.43 by $0.01. The business had revenue of $1.76 billion for the quarter, compared to the consensus estimate of $1.76 billion. APi Group had a net margin of 2.21% and a return on equity of 20.24%. The company's revenue for the quarter was up 3.3% on a year-over-year basis. During the same quarter last year, the firm posted $0.36 EPS. As a group, research analysts forecast that APi Group Co. will post 1.86 earnings per share for the current fiscal year. Insider Transactions at APi Group In related news, CFO Kevin Krumm sold 5,585 shares of APi Group stock in a transaction that occurred on Tuesday, February 27th. The shares were sold at an average price of $35.72, for a total value of $199,496.20. Following the completion of the sale, the chief financial officer now directly owns 34,180 shares in the company, valued at approximately $1,220,909.60. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC website. In other APi Group news, CFO Kevin Krumm sold 5,585 shares of APi Group stock in a transaction that occurred on Tuesday, February 27th. The shares were sold at an average price of $35.72, for a total transaction of $199,496.20. Following the completion of the sale, the chief financial officer now directly owns 34,180 shares in the company, valued at approximately $1,220,909.60. The sale was disclosed in a document filed with the SEC, which is accessible through this hyperlink. Also, Director James E. Lillie sold 125,000 shares of APi Group stock in a transaction that occurred on Monday, March 4th. The shares were sold at an average price of $38.38, for a total transaction of $4,797,500.00. Following the sale, the director now owns 5,455,411 shares of the company's stock, valued at $209,378,674.18. The disclosure for this sale can be found here. Insiders own 16.40% of the company's stock. APi Group Company Profile (Free Report) APi Group Corporation provides safety and specialty services worldwide. It operates through Safety Services and Specialty Services segments. The Safety Services segment offers solutions focusing on end-to-end integrated occupancy systems, such as fire protection services; heating, ventilation, and air conditioning solutions; and entry systems, which include the design, installation, inspection, and service of these integrated systems.Featured StoriesFive stocks we like better than APi GroupWhere to Find Earnings Call TranscriptsGoogle and Meta Circling the Market on a TikTok Ban RallyHow to Invest in Blue Chip StocksIntuitive Machines: Charting a Course Among the StarsESG Stocks, What Investors Should KnowKB Home’s Stock Price Can Move Higher, Here’s WhyThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ I tried to warn you  (From Porter & Company) (Ad)Should you invest $1,000 in APi Group right now?Before you consider APi Group, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and APi Group wasn't on the list.While APi Group currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 7 AI Stocks to Invest In: An Introduction to AI Investing For Self-Directed InvestorsAs the AI market heats up, investors who have a vision for artificial intelligence have the potential to see real returns. Learn about the industry as a whole as well as seven companies that are getting work done with the power of AI.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider APi Group, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and APi Group wasn't on the list. While APi Group currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here As the AI market heats up, investors who have a vision for artificial intelligence have the potential to see real returns. Learn about the industry as a whole as well as seven companies that are getting work done with the power of AI. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}