{
    "title": null,
    "date": "3/10/2024",
    "url": "https://www.newsnationnow.com/cybersecurity/microsoft-russian-hackers/",
    "text": "NewsNation Reuters (Reuters) – Microsoft MSFT.O said on Friday that hackers linked to Russia’s foreign intelligence were trying again to break into its systems, using data stolen from corporate emails in January to gain new access to the tech giant whose products are widely used across the U.S. national security establishment. The disclosure alarmed some analysts who cited concerns about safety of systems and services at Microsoft, one of the world’s largest software makers which provides digital services and infrastructure to the U.S. government. Analysts have expressed worries about national security risks. Microsoft has said a Russian state-sponsored group called Midnight Blizzard, or Nobelium, is behind the intrusions. The Russian embassy in Washington did not immediately respond to a request for comment on Microsoft’s statement, and has also not responded to Microsoft’s previous statements about Midnight Blizzard activity. Microsoft disclosed the breach in January, saying the hackers had tried breaking into corporate email accounts including those of senior company leaders as well as cybersecurity, legal, and other functions. “In recent weeks, we have seen evidence that Midnight Blizzard is using information initially exfiltrated from our corporate email systems to gain, or attempt to gain, unauthorized access,” the tech firm said in a new blog. Given Microsoft’s vast customer network, it is not surprising it is being targeted, said Jerome Segura, principal threat researcher at the cybersecurity firm Malwarebytes’ Threatdown Labs. He added it was unnerving that the attack was still underway despite Microsoft’s efforts to thwart access. “That one of the largest software vendors is itself kind of learning things as they go is a little bit scary,” Segura said. “You don’t have the reassurance that if you’re a customer, that there isn’t something bigger going on.” The attacks are also a testament to how aggressive the hackers are, he added. Among the data the hackers stole was access to source code repositories and internal systems, Microsoft said. The company owns GitHub, a public repository of software code for various applications, said Malwarebytes’ Segura. “This is the kind of thing that we’re really worried about,” Segura said. “The attacker would want to use (Microsoft’s) secrets to get into production environments, and then compromise software and put backdoors and things like that.” Previously, Microsoft said the hackers had broken into staff emails by using a dormant account through a “password spray” attack — using the same password on multiple accounts until they break into one. Such attacks increased as much as tenfold in Midnight Blizzard’s latest attempts, compared the January breach, Microsoft said in its blog. “This seems like it’s something very targeted, and if (the hackers) are that deep inside Microsoft, and Microsoft hasn’t been able to get them out in two months, then there’s a huge concern,” said Adam Meyers, a senior vice president at the cybersecurity firm Crowdstrike, who tracks nation-state hacking. ‘SECRETS OF DIFFERENT TYPES’ Midnight Blizzard is known to target governments, diplomatic entities, and non-governmental organizations, according to various analysts who track the group. In its January statement Microsoft said Midnight Blizzard was probably targeting it because the company has done robust research unraveling the hacking group’s operations. Microsoft’s threat intelligence team has been investigating and sharing research on Nobelium since at least 2021, when the group was found to be behind the SolarWinds cyberattack that compromised a raft of U.S. government agencies. The persistent attempts to breach Microsoft are a sign of “sustained, significant commitment of the threat actor’s resources, coordination, and focus,” the company said on Friday. “It is apparent that Midnight Blizzard is attempting to use secrets of different types it has found,” it added. “Some of these secrets were shared between customers and Microsoft in email, and as we discover them in our exfiltrated email, we have been and are reaching out to these customers to assist them in taking mitigating measures.” Microsoft did not name affected customers. (Reporting by Zeba Siddiqui in San Francisco and Akash Sriram in Bengaluru; Editing by Shilpi Majumdar, Chizu Nomiyama and David Gregorio) Copyright 2024 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. WASHINGTON (AP) — Many Americans are in a sour mood about the economy for one main reason: Prices feel too high. Maybe they’re not rising as fast as they had been, but average prices are still painfully above where they were three years ago. And they’re mostly heading higher still. Consider a 2-liter bottle of […] DALLAS (AP) — Kyle Filipowski and Duke got pushed around again in the NCAA Tournament. This time, the Blue Devils responded to set up a Tobacco Road showdown in Big D for a spot in the Final Four. The 7-foot sophomore center had 16 points and nine rebounds, Jeremy Roach scored all 14 of his […] DETROIT (AP) — Dalton Knecht was all over the court, jumping into passing lanes for steals, shooting 3-pointers, driving and dishing to set up teammates for shots. He wasn’t alone. Tennessee, with its relentless defense from logo to rim and unselfish offense, was too much for Creighton. Knecht had 24 points, six rebounds, five assists […] DALLAS (AP) — DJ Horne blew kisses to the crowd and blew off the notion of North Carolina State as a Cinderella. As for their opportunity to create a replay of 1983, yeah, the Wolfpack are aware. Horne scored 19 points and N.C. State kept its magical NCAA Tournament run alive, beating Marquette 67-58 on […] DALLAS (AP) — Jamal Shead buried his head in his arms at his locker as reporters shuffled away from their postgame interview with the Houston point guard. The top-seeded Cougars had just lost to Duke 54-51 in the Sweet 16 on Friday night, with Shead missing the final 26 minutes after the All-American sprained his […] DES MOINES, Iowa (AP) — Lawmakers in more than a dozen states have proposed legislation to allow spiritual chaplains in public schools, a move that proponents say will ease a youth mental health crisis, bolster staff retention and offer spiritual care to students who can’t afford or access religious schools. Conservatives also argue religious foundations […] PORTLAND, Ore. (AP) — Unrattled by Stanford’s halftime lead, North Carolina State answered with a big third quarter and shut down All-American Cameron Brink for a spot in the Elite Eight. Aziaha James had 29 points and the third-seeded Wolfpack outscored the No. 2 Cardinal 28-10 in the third quarter and went on to win […] ANCHORAGE, Alaska (AP) — Lucy Pitka McCormick’s relatives cooked salmon, moose, beaver and muskrat over an earthen firepit on the banks of the Chena River, just outside Fairbanks, as they honored her life. They whipped whitefish, blueberries and lard into a traditional Alaska Native dessert, and dolloped servings onto a paper plate, setting it in […] DETROIT (AP) — They leaned on him. They jawed at him. One time, they slapped him right across the forehead. None of it came close to stopping Purdue’s big man, Zach Edey, and now he and the Boilermakers are one win away from the Final Four. The 7-foot-4 Edey withstood all the abuse Gonzaga could […] "
}