{
    "title": "Business News | IIT Madras Alumni Pavan Davuluri to Lead Microsoft Windows \nand Surface Teams",
    "date": "3/26/2024",
    "url": "https://www.technologyforyou.org/business-news-iit-madras-alumni-pavan-davuluri-to-lead-microsoft-windows-and-surface-teams/",
    "text": "New Delhi [India], March 27 (ANI): Microsoft has internally merged the Windows and Surface teams once again, appointing IIT Madras alumni Pavan Davuluri to lead development on both fronts. According to Windows Central- a news site that tracks developments at Microsoft, the decision comes after a brief separation, during which Windows briefly fell under Microsoft’s new AI organisation. Also Read | Ram Charan Birthday: Most Stylish Pics of the ‘RRR’ Actor to Check Out. The reunion of Windows and Surface teams marks a return to a familiar structure within Microsoft’s Engineering and Devices organisation, headed by Rajesh Jha. Pavan Davuluri, previously overseeing Microsoft’s hardware endeavours, will now take the helm of Windows engineering as well. Also Read | IPL 2024: SRH v MI Overall Head-to-Head; When and Where To Watch to Free Live Streaming Online. The reshuffle follows the departure of ex-Windows and Surface chief Panos Panay last September, whose role was effectively split between Davuluri and Mikhail Parakhin. Parakhin took charge of Windows, alongside his existing responsibilities as CEO of Web and Advertising at Microsoft, overseeing products such as Bing, Edge, and Copilot. However, recent developments within Microsoft, including the appointment of DeepMind co-founder Mustafa Suleyman as CEO of a new AI division, prompted a re-evaluation of team structures. With Parakhin’s team absorbed into the new AI division, he has announced his intention to explore other roles, likely outside the company. As a result, Windows is now realigned under Rajesh Jha’s leadership, ensuring that development is overseen by the same individual who guides Surface development. This move is welcomed by Windows enthusiasts, as it promises increased collaboration and cohesion between Microsoft’s hardware and software endeavours. Over the past year, Pavan Davuluri has been instrumental in driving Microsoft’s efforts to optimize Windows for Arm-based devices. On March 22, Davuluri posted on X “Today, we announced our first ever #Surface AI PCs built exclusively for business: Surface Pro 10 for Business and Surface Laptop 6 for Business! I’m incredibly proud of the team for the work they did to bring these devices and experiences to life for our customers #Copilot.” Anticipation is building for May 20, when Microsoft is expected to unveil new next-generation AI features and Arm-based Surface hardware, offering further insights into the company’s vision for Windows and AI integration. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body) Source Link Save my name, email, and website in this browser for the next time I comment.  "
}