{
    "title": "Microsoft's ComScore Numbers Have Been Altered To Mask A Huge Traffic \nCollapse",
    "date": "3/28/2024",
    "url": "https://ca.movies.yahoo.com/movies/microsoft-comscore-numbers-altered-mask-165900310.html",
    "text": "Business Insider Microsoft execs Terry Myerson and Qi Lu both want control of the default Internet Explorer homepage. Microsoft redesigned its MSN web portal, the default Internet Explorer homepage on the 400 million new Windows PCs that are sold each year, in September. In recent weeks, sources have told Business Insider that the redesign had a drastic negative effect on visitor numbers not only to MSN itself but also Microsoft’s search engine Bing (MSN used to send users to Bing results when they clicked on article headlines.) The first verifiable evidence of our sources’ claims was due to be revealed in this month report from research company comScore, which would have usually published separate worldwide traffic figures for Bing and MSN. The theory was MSN traffic was massively down following the redesign and that Bing was being severely hurt by one of the changes, which saw MSN curate more stories from news sites. The issue was that it was seeing people click through direct to competitor websites, rather than through to a Bing search as it had done previously. But this month, Microsoft has asked comScore to bundle all its web products — Bing, Skype, Outlook and so on — under one \"MSN\" banner, the research company confirmed to Business Insider. So now it is extremely difficult to quantify exactly how badly the MSN redesign hit Microsoft. ComScore is one of the most trusted sources of web traffic data around and the majority of major publishers use the company's reports to sell their advertising and size themselves up versus competitors. A Microsoft spokeswoman told Business Insider: \"We have updated MSN's hierarchical definition in comScore to align with the comScore definition of a Portal. MSN numbers now also include page view stats for content, mail, instant messaging, search, communications, photo sharing etc., in an effort to be more comparable to other portal competitors.\" MSN’s newly organized total unique worldwide visitor figure for October was 677 million, according to comScore. In September, without the added help of other properties like Bing and Skype, MSN’s unique worldwide visitors totaled 380 million. No longer is it possible to compare apples with apples with the comScore data on MSN. ComScore does, however, still provide separate Bing data (this is also the same data that is bundled in to that total MSN figure.) Bing's worldwide unique visitors dropped from 271 million in September to 267 million in October, according to comScore. The October figure was, however, up on the 258 million uniques reported in August. Separate US-only data from Compete, a Millward Brown Digital company, appears to show the drop-off in visitor numbers following MSN's redesign more starkly. Look how the uniques fell from September (when the redesign launched) to October. Millward Brown The same pattern follows for Bing.com Millward Brown One source close to Microsoft told Business Insider: “The reasons [for changing how MSN’s visitor numbers are reported by comScore] are obvious, that is for sure…MSN is down 20% to 60% on page views depending on the country…rumors persist that they will shut it down.” “Shuttering MSN would be fairly simple for Microsoft. Bing already has a news section and is already programming news on [its] homepage. [Bing] also has links to Microsoft’s other services. So it can serve as the consumer default homepage for Microsoft. “With the fall in page views and click through rates on MSN, Bing is actually a better option for Microsoft strategically to gain any search share. So it makes sense to send all of that default traffic to Bing instead of MSN. This is the key reason MSN has struggled for so long. Microsoft really doesn't care about that business.” Microsoft The new MSN as it appeared in September 2014. Separate sources have previously told Business Insider there is a showdown of sorts between three powerful Microsoft executives: Terry Myerson, the man in charge of Windows, Derrick Connell, who runs Bing, and Qi Lu, the man in charge of most of Microsoft’s consumer online services, which includes MSN and also Bing. The fight is about who gets to control the default home page of Internet Explorer. All three want to claim the home page as a lucrative marketing spot for their own divisions. Microsoft told Business Insider last month that Bing and MSN are performing well and that the newly redesigned MSN is a success, referencing older US-only comScore data for October. In a statement the company said: “As the most recent [US] market share data indicates, Bing and MSN both continue to grow. We are seeing a great response to the new MSN, which we just rebuilt to combine content from the world’s leading media outlets along with easy access to tools such as Office Online, Skype and Bing. Similarly, we’re pleased to see Bing gaining traction both as a standalone search engine and as the intelligence platform powering experiences inside and outside of Microsoft, including Cortana on Windows Phone, Siri and Spotlight from Apple.” Last month Microsoft fired a huge chunk of its global advertising sales team. Our source tells us that the majority of people responsible for monetizing MSN were part of that round of layoffs, as well as many MSN editorial staff. More From Business Insider Microsoft’s ComScore Numbers Have Been Changed To Hide A Massive Traffic Collapse The Sun Has Doubled The Number Of Its Paying Subscribers Online See The Blatantly Sexist Ad Sony PlayStation Has Quickly Pulled A man suspected of using guns and explosives to hold four people hostage in a Dutch cafe was detained by police on Saturday, after a dramatic hours-long standoff that involved scores of armed police and a remote-controlled robot. WASHINGTON (AP) — As Donald Trump campaigns on promises of mass deportations and pardons for those convicted in the Jan. 6, 2021, riot at the Capitol, his ideas are being met with little pushback and some enthusiasm by a new era of Republicans in Congress. It’s a shift from the first time around when the presumptive Republican presidential nominee encountered early skepticism and, once in a while, the uproar of condemnation. Rather than being dismissed as campaign bluster or Trump speaking his m Thanks to the attention it’s getting on TikTok and Instagram, stores around the world are selling out of this lean muscle builder. But, before you... Follow the latest updates from St James' Park as the Premier League returns Nearly four in five NASUWT teacher members in England said they do not support moving to a national statutory ballot for industrial action. From the outside, Johannesburg does not look like it is doing well.  Exclusive: Senior officers tried to set up a food bank for recruits as figures reveal scale of police food poverty The siblings, 34, posted several videos on TikTok Friday Investigator footage provided glimpses from inside the Dali cargo ship that collided with the Francis Scott Bridge in Baltimore on Tuesday, March 24, causing it to collapse.The footage, filmed by the National Transport Safety Board (NTSB) on March 28 and released a day later, shows investigators inspecting the damage from inside the container vessel. The NTSB said those aboard downloaded the voyage data from the ship.NTSB chair Jennifer Homendy previously told NBC that the investigation could take up to two years to complete. Credit: NTSB via Storyful  Follow all the live action from the 2024 Boat Race in the blog below With March Madness in full swing, you may have seen a funny AT&T commercial that showcases Kendrick Perkins, Carmelo Anthony, and TJ Ford, players from the 2003 NBA Draft. In partnership with AT&T, Perk took some time out of his hectic schedule to ... Spurs welcome the Hatters to town looking to get back on track  Tesla is the worst S&P 500 stock in 2024 as analysts slash earnings estimates. China EV giant BYD is ramping up a price war. LMPD: Man shot several times in The Highlands area following vehicle crash, argument Inconsistent Blues hope to enjoy home comforts against relegation contenders  Meteorologist Taylor Cox shows calmer wind today, but breezy for tomorrow, then storms on Monday. The Blues look to extend a strong run at Stamford Bridge The enigmatic masked trio from Melbourne hypnotise with a psychedelic fusion of Aussie surf rock and traditional Indian music He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" As Germany authorises the consumption and cultivation of cannabis from 1 April, the mayor of Strasbourg is calling for the introduction of a local 'experiment' to move away from France's repressive approach to marijuana. According to Mayor Jeanne Barseghian: \"In a shared catchment area, we are going to have two different sets of regulations, almost diametrically opposed, between Germany, which authorises the recreational use of cannabis, and France, which has one of the most repressive sets of l The Emmy nominee tells PEOPLE she and the actor \"have a very lovely friendship\" that feels like \"we've known each other for many lifetimes\" "
}