{
    "title": "Adobe launches Gen AI tools; partners Microsoft",
    "date": "3/27/2024",
    "url": "https://www.financialexpress.com/life/technology-adobe-launches-gen-ai-tools-partners-microsoft-3438692/",
    "text": "The Financial Express Adobe on Wednesday announced a suite of software products having generative artificial intelligence (Gen AI) capabilities for enterprises. The company launched Adobe GenStudio, which is a new Gen AI-first offering that will allow marketing teams to quickly plan, create, manage, activate and measure on-brand content. Besides, the company launched add-on features to its already existing family of generative AI models Adobe Firefly and unveiled Journey Optimizer for better customer engagement, among other innovations. The new tools will help Adobe to increase the take up of its experience cloud business, which is a platform for delivering, measuring and personalising customer experiences, and is used by 11,000 customers globally across industries, with support from 4,500 global ecosystem members. Adobe also announced its partnership with Microsoft basis which it will bring Adobe Experience Cloud workflows and insights to Microsoft Copilot for Microsoft 365 applications. This will help marketers manage everyday work in tools such as Outlook, Microsoft Teams and Word and help them to develop creative briefs, create content, manage content approvals, deliver experiences and more, it said in a release. “World over, businesses are prioritising their digital investments to improve marketing agility and customer engagement, while driving growth and profitability. Adobe products are playing an essential role in driving the digital economy,” said Prativa Mohapatra, vice-president & managing director at Adobe India. In addition, Adobe also announced an integrated set of applications under its Adobe Experience Platform, which enables brands to activate customer data across various enterprise systems. The applications include AI assistant for automation of tasks, outcomes, and answering technical questions; federated audience composition for data management flexibility; and real-time customer data platform collaboration. “Generative AI enables a fundamental shift in the relationship between brands and their customers, creating a transformative moment for business leaders to drive profitable growth while delivering new digital experiences,” said Anil Chakravarthy, president, digital experience business at Adobe. “The ability to personalise every interaction has become the key growth driver in Customer Experience Management for enterprises around the world, and Adobe is leading the way in making this a reality with powerful generative AI deeply integrated into existing workflows,” he added. With regard to Adobe-Microsoft partnership, the companies will address challenges of marketers that involve switching between different applications. According to a recent survey conducted by Microsoft, 43% of marketing and communications professionals reported that having to switch between digital applications and programs was disruptive to their creativity. Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   "
}