{
    "title": "Microsoft Bing Chief leaves position after Suleyman is named AI leader - \nTHE BHARAT EXPRESS NEWS",
    "date": "3/25/2024",
    "url": "https://thebharatexpressnews.com/microsoft-bing-chief-leaves-position-after-suleyman-is-named-ai-leader/",
    "text": " (Bloomberg) — Microsoft Corp.’s Mikhail Parakhin, head of the company’s Bing search and advertising business, will step down from those roles and look for a new one, a week after software giant Mustafa Suleyman oversees work at the field of consumer artificial intelligence and asked Parakhin to report to him. Most read from Bloomberg Parakhin, who served as CEO of advertising and web services, will report to Chief Technology Officer Kevin Scott as he searches for his next role, Microsoft said.  Parakhin also oversaw some parts of the company’s Windows software business.  That work will shift to Pavan Davuluri, who oversaw the hardware and the rest of Windows.  Davuluri will now run all Windows and Surface hardware and report to Executive Vice President Rajesh Jha, who announced the changes in an employee email on Monday. Jha’s email and a spokesperson did not specify whether Parakhin was likely to leave Microsoft or take on a new role within the company. Parakhin’s departure from a core part of the company’s consumer AI products marks the first shift following CEO Satya Nadella’s move last week to appoint Suleyman, co-founder of AI researcher DeepMind, to head a unified push in space. The move illustrated Nadella’s impatience with his team’s efforts, two people familiar with his thinking said last week.  Over the past year, Microsoft has built AI into the Bing search engine, Windows, Office and other products, creating several digital assistants under the Copilot brand.  Still, Bing has made few gains against search market leader Google, and other products are still being developed. The Verge previously reported on the management changes. Most read from Bloomberg Businessweek ©2024 BloombergLP Save my name, email, and website in this browser for the next time I comment.   Δ "
}