{
    "title": "Microsoft is adding an AI button to PC keyboards, their first major change \nin 30 years",
    "date": "1/4/2024",
    "url": "https://finance.yahoo.com/news/microsoft-is-adding-an-ai-button-to-pc-keyboards-their-first-major-change-in-30-years-080109907.html",
    "text": "Microsoft (MSFT) is doubling down on its commitment to AI with the introduction of a new keyboard key dedicated specifically to the company’s Windows Copilot. The first update to the Windows PC keyboard in almost 30 years, the Copilot key will be available on laptops and desktop keyboards from Microsoft’s OEM partners beginning in February. According to Microsoft corporate vice president and consumer chief marketing officer Yusuf Mehdi, pressing the key will bring up Copilot, allowing you to search for content on the web, as well as for your own content and for general PC features via the app’s generative AI functionality. The idea is for Copilot to function as a kind of smart assistant that you can pull up at any time. While Microsoft didn’t announce any specific partners that will launch with the Copilot key, it said that companies should begin unveiling desktops and laptops equipped with the feature in the coming days. We’ll also get an up-close look at the capability at CES 2024, which kicks off Jan. 9. By getting its hardware partners to add a Copilot key to their laptops and desktops, Microsoft is showing that it believes generative AI is inextricable from the future of personal computing. The last time Microsoft added a new keyboard key was when it debuted the Windows key in 1994. Microsoft spent much of 2023 making a series of AI announcements ranging from the debut of its Bing chatbot and Edge browser to its Copilot for Microsoft 365. CEO Satya Nadella has said that advancements in AI will impact nearly every part of the company’s business. Semiconductor giants are also getting in on the AI movement. AMD (AMD), Intel (INTC), and Qualcomm (QCOM) have each debuted their own AI PC chips with dedicated neural processors designed to handle AI-specific tasks such as running generative AI applications. How much consumers will benefit from those chips, though, is still up in the air. Even Intel doesn’t know exactly what kinds of apps developers will eventually cook up that rely on or take advantage of neural processors. The AI PC movement comes at a time when the PC market is expected to return to growth for the first time since 2021, according to Goldman Sachs Equity Research analyst Michael Ng. “In our view, global PC shipments in 2024 will be driven by the beginning of a refresh cycle as pandemic-purchased devices start to reach four years of age & new AI-capable PCs come to market (later in 2024) in what we view as the first technological shift in personal computing since the widespread adoption of smartphones/tablets,” Ng wrote in a note on Tuesday. The expected resurgence in PC sales follows years of declines after an explosion of growth at the onset of the pandemic. At that time, consumers and businesses, eager to get their hands on PCs to work and play, purchased new laptops and desktops in droves. As those systems age, however, consumers will begin buying up newer PCs, which will help drive AI PC adoption. And that will inevitably help Microsoft, as well as Intel, AMD, and Qualcomm’s bottom lines. Read more coverage from CES 2024: Nvidia debuts RTX 40 Super chips to power gaming and AI efforts at CES 2024 AMD debuts AI-focused Ryzen 8000G desktop chips at CES 2024 Microsoft is adding an AI button to PC keyboards, their first major change in 30 years From AI to flying cars, here’s what to expect at CES 2024 Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}