{
    "title": "Satya Nadella says Microsoft and OpenAI have a “pro-competition \npartnership” – regulators aren't so sure",
    "date": "1/19/2024",
    "url": "https://www.itpro.com/business/policy-and-legislation/satya-nadella-says-microsoft-and-openai-have-a-pro-competition-partnership-regulators-arent-so-sure",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. The relationship between Microsoft and OpenAI is beneficial to the broader AI industry, according to Satya Nadella, despite lingering doubts among regulators on both sides of the Atlantic Microsoft CEO Satya Nadella has defended the company’s close relationship with OpenAI amid growing scrutiny from regulators over the nature of the ties between the two companies. Speaking at the World Economic Forum (WEF) in Davos this week, Nadella told Bloomberg the alliance between the tech giants is a “pro-competition partnership” which has enabled both companies to deliver impactful results for customers. Microsoft’s initial investment in OpenAI in 2019 was a “highly risky bet”, he said, but one that has proven beneficial for the broader market place so far. “When we made these investments and backed OpenAI, went all-in on a particular form of compute that led to all these breakthroughs, we wouldn’t have had what we had, and more importantly the incumbents would’ve been the winners,” he said.  Generative AI has been the secret sauce for Microsoft as its market cap surpasses AppleNew Microsoft Copilot updates target individual users, small businesses with ‘Pro’ subscription tier and cheaper pricing From Nadella’s perspective, the partnership with OpenAI has enabled the tech giant to compete more effectively with major industry players who also have a vested interest in driving AI innovation. Microsoft faces stiff competition in the generative AI space from other tech giants, such as AWS, and Google, both of which have invested heavily in their own range of generative AI tools and services over the last year. OpenAI, however, appears to be the key differentiator for Microsoft, Nadella suggested. Receive our latest news, industry updates, featured resources and more. Sign up today to receive our FREE report on AI cyber crime & security - newly updated for 2023. “If we want competition in AI against players who are vertically integrated, I think partnerships is one avenue of, in fact, having competition,” he said. Regulators in the UK, US, and European Union may contest that statement, however. In recent weeks, the relationship between Microsoft and OpenAI has been subject to intense regulatory scrutiny, with the UK’s Competition and Markets Authority (CMA) launching a preliminary investigation into the tie between the firms. Just days later, the Federal Trade Commission (FTC) launched its own probe. On January 9, European regulators also signaled their intention to begin an examination of the relationship aimed at “checking whether Microsoft’s investment in OpenAI might be reviewable under the EU Merger regulation”. All three probes represent the preliminary stage of any potential future antitrust investigation, with regulators inviting industry stakeholders to voice their views and concerns over competition. Nadella admitted that the nature of this relationship was always likely to draw regulatory scrutiny, but appeared confident that the company’s position on the matter is secure. “I’m sure regulators will look at this and say, is this a pro-competition partnership or not? And to me, it’s a no-brainer.”  Discover how hyperscale cloud service providers bring a wealth of value to their customers\n\nDOWNLOAD NOW To date, Microsoft has invested billions in OpenAI, injecting upwards of $13 billion in supporting the firm. Around $10 billion of that was invested in 2023 alone. The tech giant also holds a 49% stake in OpenAI’s for-profit arm. It’s this aspect of the relationship that has prompted much concern from regulators. OpenAI was rocked by a week of chaos in late November after chief executive Sam Altman was ousted in a surprise boardroom coup. Days of disruption followed which saw Altman join Microsoft, then make a triumphant return to the company. Microsoft has a vested interest in ensuring its poster child and leading partner in the generative AI space remains stable, and this has resulted in some changes at the firm.  Why AI could be a legal nightmare for years to come Since the November chaos, Microsoft has been granted a non-voting seat on the OpenAI board. This has rung alarm bells for regulators, with the CMA specifically highlighting this as a key concern. “There have recently been a number of developments in the governance of OpenAI, some of which involved Microsoft,” the CMA said in a statement at the time. Nadella told Bloomberg that recent disruption hasn’t prompted the same concerns at the tech giant, despite the fact reports suggested he was “furious” at the incident last year. “I’m comfortable,” he said. “I have no issues with any structure. What we just want is good stability. I’m not even interested in a board seat…we definitely don’t have control. We just want to have a good commercial partnership. “What I would like is good governance and real stability, that’s it.” Ross Kelly is ITPro's News & Analysis Editor, responsible for leading the brand's news output and in-depth reporting on the latest stories from across the business technology landscape. Ross was previously a Staff Writer, during which time he developed a keen interest in cyber security, business leadership, and emerging technologies. He graduated from Edinburgh Napier University in 2016 with a BA (Hons) in Journalism, and joined ITPro in 2022 after four years working in technology conference research. For news pitches, you can contact Ross at ross.kelly@futurenet.com, or on Twitter and LinkedIn. IT professionals are the new guardians of ethical tech – but which global model should you follow? Companies face hefty penalties for product hype as the SEC toughens up on ‘AI washing’ Why Python is the programming language of choice for AI developers By Steve RangerMarch 26, 2024 By Solomon KlappholzMarch 26, 2024 By George FitzmauriceMarch 26, 2024 By Emma WoollacottMarch 26, 2024 By Solomon KlappholzMarch 25, 2024 By George FitzmauriceMarch 25, 2024 By Daniel ToddMarch 25, 2024 By George FitzmauriceMarch 23, 2024 By Ross KellyMarch 22, 2024 By Solomon KlappholzMarch 22, 2024 By Solomon KlappholzMarch 22, 2024 Posted Posted Posted Posted IT Pro is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}