{
    "title": "Microsoft Rises Like A Phoenix From The Ashes (NASDAQ:MSFT)",
    "date": "1/21/2024",
    "url": "https://seekingalpha.com/article/4663991-microsoft-rises-like-a-phoenix-from-the-ashes",
    "text": "koyu/iStock via Getty Images koyu/iStock via Getty Images Back when I was in college from 2008 through 2013, the common consensus amongst those who understood the operations of Microsoft Corporation (NASDAQ:MSFT) was that the company was a behemoth of a bygone era. After the Dot-Com bubble burst, its market capitalization remained stuck in a fairly narrow range for well over a decade. But in the past eight or nine years, the company has revived remarkably like a phoenix from the ashes. Latching on to new growth opportunities, the business has seen its market capitalization explode higher. And at just over $2.96 trillion, it is currently the largest publicly traded company on the planet, just behind consumer tech giant Apple Inc. (AAPL). Given this massive upswing that the company has seen in recent years, investors might very well be worried that shares are overpriced just like they were back in the late 1990s. This might prove especially true, in their minds, if the predictions of rapid growth associated with the advent of quality AI prove to fall short. But when you really look at the data and what is driving the company higher, I would argue that while there is definitely an opportunity for AI to supercharge the company's growth moving forward, it does not necessarily need to be successful in its AI initiatives to be a solid prospect for long term investors who want a high-quality business at a decent price. In the past year or so, the only articles that I have written regarding Microsoft have been focused on the company's journey to absorb video game giant Activision Blizzard, the most recent here visible here. Even most of my efforts there centered around how shareholders of Activision Blizzard would be set to benefit. But the fact of the matter is that Microsoft offers a lot outside of its video game initiatives. To be clear, my goal with this article is not to dig down into each of its operating segments. Odds are, you already know a good amount about the business from that perspective. But a brief refresher might not be such a bad idea. Operationally speaking, Microsoft has three different segments. The first of these is the Productivity and Business Processes segment, which focuses on a variety of offerings such as its ownership over LinkedIn, its Microsoft 365 consumer subscriptions, its Office 365 subscriptions, and more. Next in line, we have the More Personal Computing segment, which consists of a variety of odds and ends, such as Windows, its gaming initiatives, and various devices such as the Surface. Certain services such as Microsoft News and Bing are also included under this umbrella. And lastly, there is the Intelligent Cloud part of the company, which involves the firm's public, private, and hybrid server products and cloud services. Most notably, this involves Azure, which is the primary competitor of Amazon.com Inc.'s (AMZN) AWS. There has been a tremendous amount of excitement regarding the role that AI could play in boosting the financial performance of Microsoft moving forward. And management has been very active in incorporating AI into its business. For instance, when it comes to Azure, the company makes it easier for developers and other parties to utilize advanced models for the purpose of achieving optimized AI functionality. Customers are even able to integrate their AI programs into other solutions for the purpose of creating apps and various services. On top of this, there are other examples, such as the company's ownership interest in OpenAI, the creator of ChatGPT. Last year, the firm invested $10 billion into OpenAI. This followed a $1 billion investment that the firm had made into the same company back in 2019. The company also has an AI 'companion' called Copilot that it makes available for its customers. Last year, after seeing continued robust results, I changed my rating on Palantir Technologies Inc. (PLTR) from a 'sell' to a 'hold', acknowledging that the company had 'broken my resolve'. In one of the earlier bearish articles that I had written about the firm, I acknowledged just how large AI could ultimately be, not only for it, but for everyone across the globe. It was estimated, for instance, that AI could contribute up to $15.7 trillion to the global economy by 2030. I have no doubt that Microsoft will also be a beneficiary of this expansion. However, I think that the value it receives will come less from things like its OpenAI investments and Copilot and more from 'owning' an ecosystem that facilitates AI innovation and grows from it. Author - SEC EDGAR Data Author - SEC EDGAR Data Nobody truly knows what kind of upside this might have for the company. But even if we just bank on the current picture continuing, the end result for shareholders should be quite positive. Look at revenue, for instance, over the past few years. From 2021 through 2023, revenue for the company expanded from $168.09 billion to $211.92 billion. For the first quarter of 2024, revenue of $56.52 billion beat out the $50.12 billion the company reported in the same quarter of the 2023 fiscal year. And as you can see in the chart above, profits have followed revenue higher the entire way. Author - SEC EDGAR Data Author - SEC EDGAR Data As I mentioned earlier, however, there are multiple sets of operations that make up Microsoft. For instance, the More Personal Computer segment of the business has not done particularly well. Revenue remained more or less flat from 2021 through 2023. And for the first quarter of 2024, sales came in only 2.5% higher than what they were one earlier. All of the company's growth, meanwhile, has come from its other two segments. But the most notable of these has been the Intelligent Cloud business. This is the part of the company that I would imagine will benefit the most from AI growth, irrespective of who the winner in models happens to be. This is because the cloud makes AI far easier, not only to set up and manage, but also to monetize. And as the owner of one of the two largest cloud platforms on the planet, Microsoft is bound to be a major beneficiary. Author - SEC EDGAR Data Author - SEC EDGAR Data We can see this playing out over the past few years. The Intelligent Cloud part of the company has grown from 35.5% of total corporate revenue for the business in 2021 to 41.5% in 2023. By the first quarter of 2024, it totaled 42.9%. It's worth noting that the Productivity and Business Process segment has managed to hold its own, with its overall revenue share remaining more or less unchanged during this period of time. So that part of the company is definitely going to be a major contributor to value creation for shareholders in the future. Both it and the Intelligent Cloud part of the company have seen their contributions to overall profit for the business as a whole expand. And the most significant movement there, not surprisingly, involved the Intelligent Cloud operations of the company. Author - SEC EDGAR Data Author - SEC EDGAR Data From a margin perspective, it has only been recent that the Intelligent Cloud portion of Microsoft has seen a meaningful improvement. By comparison, the Productivity and Business Process segment has seen its profit margin climb from 45.2% in 2021 to 53.6% by the first quarter of 2024. But as the firm's cloud operations continue to expand, I expect that margins will eventually increase as well. Author - SEC EDGAR Data Author - SEC EDGAR Data Unfortunately, we don't have a crystal ball that lets us understand exactly what the future holds. But we do know that management is optimistic. For the second quarter of the 2024 fiscal year, the midpoint of guidance provided by management calls for revenue of $60.90 billion, while analysts anticipate sales of $61.05 billion. This would be a nice increase over the $52.75 billion reported for the second quarter of 2024. If this comes to fruition, about 41.5% of that revenue will have come from the firm's Intelligent Cloud operations. And when we start stripping out certain costs as estimated by management, and assuming that the firm's share count remains unchanged from where it was in the first quarter of the year, we would anticipate a profit per share of about $2.74. That would be an increase over the $2.20 per share reported in the second quarter of 2024. That would mean that profits would climb from $16.43 billion to $20.60 billion. As you can see in the table below, I also included other profitability metrics from the second quarter of 2023. Investors should definitely be paying attention to what these end up being in the second quarter of this year. This is because, after all, these would be the metrics that determine the true value of the business. Author - SEC EDGAR Data Author - SEC EDGAR Data Those who do not believe that Microsoft deserves to move higher will point out that shares are not exactly cheap. As you can see in the chart below, the stock is pricey, not only on an absolute basis, but also relative to where it has traded at some points in the past. But it's definitely not at the highest point it has been in just the past 10 years. Add on top of this the belief that the global cloud market is expected to climb by about 14.1% per annum from 2023 through 2030, taking the overall industry up to roughly $1.56 trillion compared to $619 billion last year, and I believe that paying a bit of a premium, of course, such a high-quality company at the forefront of the space is not unreasonable. Data by YCharts As things stand, I believe that while Microsoft is far from being a value play, it's one of the true growth prospects that can achieve enough growth on the bottom line to justify the lofty price that the market is demanding in order to participate in owning a piece of the pie. For those who have a several-year time horizon and who can accept volatility, this is a kind of opportunity that could make a lot of sense. Crude Value Insights is an exclusive community of investors who have a taste for oil and natural gas firms. Our main interest is on cash flow and the value and growth prospects that generate the strongest potential for investors. You get access to a 50+ stock model account, in-depth cash flow analyses of E&P firms, and a Live Chat where members can share their knowledge and experiences with one another. Sign up now and your first two weeks are free! This article was written by Daniel is an avid and active professional investor. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}