{
    "title": "Microsoft Briefly Crosses $3 Trillion Market Cap, Becomes 2nd Company to Do \nSo",
    "date": "1/25/2024",
    "url": "https://www.equitypandit.com/microsoft-briefly-crosses-3-trillion-market-cap-becomes-2nd-company-to-do-so/",
    "text": "Microsoft’s market capitalisation crossed the $3 trillion mark for a brief moment on Wednesday’s trading session, becoming the second-ever company after Apple to achieve the milestone. The Satya Nadella-run company attained a $3 trillion market cap for the first time in its 48-year history after its stock climbed as much as 1.5% on Nasdaq on January 24, hitting a record high of $405.63. Microsoft’s stock witnessed a rally in recent months as ChatGPT maker OpenAI is widely seen as a frontrunner in the artificial intelligence (AI) race among other tech heavyweights, including Google, Amazon and Meta. The recent surge in Microsft share prices can be attributed to the announcement of a steep price on Copilot for Microsoft 365. Nadella became the company’s chief executive officer (CEO) almost 10 years ago. Under his charge, Microsoft acquired Minecraft developer Mojang, LinkedIn, GitHub, Xamarin, and several AI companies and invested more than $10 billion into OpenAI.  Data is a real-time snapshot *Data is delayed by at least 15 minutes. StockFact, Market Action Data and Analysis. Data Provider CMOTS Infotech. Disclaimer : There is no guarantee of profits or no exceptions from losses. The investment advice provided is solely the personal views of the research team.\n\n                    Equitypandit will not accept any liability for loss or damage as a result of reliance on the information contained within this website including data, quotes, charts and buy/sell signals. Please be fully informed regarding the risks and costs associated with trading the financial markets, it is one of the riskiest investment forms possible.\n\n                    Therefore, Equitypandit doesn’t bear any responsibility for any trading losses you might incur as a result of using this data. "
}