{
    "title": null,
    "date": "1/17/2024",
    "url": "https://www.microsoft.com/en-us/microsoft-fabric/blog/2024/01/17/register-now-for-the-first-ever-microsoft-fabric-community-conference/",
    "text": "We are so excited for our first-ever Microsoft Fabric Community Conference taking place March 26-28, 2024, at the MGM Grand, Las Vegas. With 100+ sessions over three days, plus workshops on March 24, 25, and 29, this will be the most comprehensive learning event for Microsoft Fabric, ever! Sign up now to save your spot. Use the code MSCUST to take $100 off your registration. The Microsoft Fabric product team, customers, partners, and Microsoft MVPs will join me as we share our thoughts on the latest developments with analytics in the era of AI. You’ll get to deep dive into the latest features across Microsoft analytics, AI, databases, and our governance portfolio with workshops and sessions led by an impressive roster of community and Microsoft speakers. You can also connect—and reconnect—with Fabric community members and other Microsoft data users from around the world, building personal and professional relationships while learning from the success stories of your peers. Here are some of the key topics that we’ll cover: You’ll also have the chance to meet and engage with other data professionals in the Community Lounge, where you can meet user group leaders, super users, student ambassadors, Microsoft MVPs, and other community members. Whether you are looking for a network to discuss a specific topic or are just wanting a moment to relax and chat, there will be a space for you. You can also join in the fun activities and games that will be organized throughout the event, such as trivia, bingo, and scavenger hunts. Prepare for the era of AI with Microsoft Fabric Additionally, you can take full advantage of our Ask the Experts area, where data, analytics, and AI specialists will tackle your burning technical questions. Whether you need help with a specific problem, want to learn a new technique, or just want to chat with someone who knows their stuff, you will find someone who can help you. The experts will include members of the community as well as Microsoft engineering and product teams, plus our Fabric Customer Advisory Team (CAT). They’ll be available throughout the event to assist you with any topic related to data and analytics. There’s even more: Join our daily Interactive Learning Labs where we’ll have knowledgeable data professionals from the community on hand to assist you with real-world scenarios. These sessions are designed to help you learn new skills and explore new features in a hands-on environment. You’ll also get the opportunity to participate in diversity, equity, and inclusion panels and sessions, where you can discuss the issues of today in a safe and welcoming environment. You will hear from diverse speakers who will share their stories, perspectives, and best practices on how to create a more inclusive and equitable data community. You’ll also learn how to support and empower others who are underrepresented or marginalized in the data field. The team and I look forward to engaging with you all in-person in Las Vegas in March! Reshape how everyone accesses, manages, and acts on data and insights by connecting every data source and analytics service together—on a single, AI-powered platform. "
}