{
    "title": "Microsoft Trumps Apple; Hyundai Cash Bonus; Indian Software Booms",
    "date": "1/16/2024",
    "url": "https://www.cmcmarkets.com/en-au/opto/microsoft-trumps-apple-hyundai-cash-bonus-indian-software-booms",
    "text": "5 Top Stories By OPTO  16 Jan 2024, 03:30 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. Microsoft [MSFT] has overtaken Apple [AAPL] to become the world’s biggest company by market cap. The tech giant made major gains over the past year, driven by its focus on artificial intelligence (AI). Apple, by contrast, is grappling with a drop-off in demand for the iPhone, particularly in China. Bloomberg reported that Apple is this week offering discounts in China of up to RMB500 on its latest model. Korea’s Hyundai [HYMTF] is to give US buyers of its electric vehicles (EVs) cash bonuses of up to $7,500, in a bid to remain competitive in the face of tax credits associated with the Inflation Reduction Act, one of the aims of which is to boost domestic EV production. The offer will stand until 31 January and apply to the Ioniq 5, Ioniq 6 and Kona Electric models. Tata Consultancy Services [TCS:NS], Infosys [INFY], Wipro [WIT] and HCL Technologies [HCLTECH:NS], India’s four leading software firms, between them added some $22bn in market value in two trading sessions, driven by sales beats in the last quarter and growing demand for AI: “Almost every discussion with clients involves some element of generative AI,” Infosys CEO Salil Parekh said on an earnings call on Thursday. According to an investigation by Reuters, Chinese military bodies, state-run research institutes and universities have been able to buy small amounts of Nvidia [NVDA] semiconductors, despite the US export ban. Chip imports to China fell by 15.4% to $349.4bn last year, their steepest drop on record, suggesting that the export ban is having an effect, even if it can be circumvented. A South China Morning Post report linking Baidu’s [BIDU] Ernie AI chatbot to military research has caused the firm’s share price to drop by 11.5%, more than it has done in over a year, amid fears of US sanctions. The report stated that a university affiliated with the People’s Liberation Army’s Strategic Support Force — which oversees cyberwarfare — had tested its AI system using Ernie. Baidu on Monday denied any connection. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles Analysis “Hard to Imagine a World Without It” — Jeff Desjardin on the Potential of CRISPR Technology Jeff Desjardins, Editor-in-Chief of Visual Capitalist, discusses the far-reaching potential of CRISPR gene-editing technology. 12 Jan 2024 5 Top Stories Bitcoin ETFs Approved; EV Sales Slow; Netflix Ad Tier Thrives The US SEC’s long-awaited decision was met by a muted reaction on the part of the cryptocurrency itself, which largely held steady. 11 Jan 2024 5 Top Stories Chip Sales Rally; Tesla Latest; HPE Pivots to Networking In November last year, semiconductor revenue worldwide amounted to $48bn: a 5.3% year-on-year increase, according to the Washington-based Semiconductor Industry Association. 10 Jan 2024 5 Top Stories Vision Pro Launch Date; JD.com Controversy; New GSK Acquisition Apple has announced that its flagship Vision Pro mixed-reality headset will go on sale in the US on 2 February. 09 Jan 2024 © 2024 CMC Markets Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Chi-X (Chi-X Australia), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Terms and Conditions, Product Disclosure Statement ('PDS') and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Our Financial Services Guide contains details of our fees and charges. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. "
}