{
    "title": "The Zacks Analyst Blog Highlights Microsoft, Amazon.com, Berkshire \nHathaway, Abbott and BlackRock",
    "date": "2/23/2024",
    "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-microsoft-100500041.html",
    "text": "Chicago, IL – February 23, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Microsoft Corp. MSFT, Amazon.com, Inc. AMZN, Berkshire Hathaway Inc. (BRK.B), Abbott Laboratories ABT and BlackRock, Inc. BLK. The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corp., Amazon.com, Inc. and Berkshire Hathaway Inc. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Microsoft’s shares have outperformed the Zacks Computer - Software industry over the past year (+59.2% vs. +52.8%). The company’s second-quarter results gained from strong Intelligent Cloud, and Productivity and Business Processes revenues. Productivity and Business Processes rose due to a strong adoption of Office 365 Commercial solutions. Microsoft 365 Consumer subscribers grew to 78.4 million.Continued momentum in the small and medium businesses, frontline worker offerings and a gain in revenue per user drove the top line. Intelligent Cloud revenues were driven by growth in Azure and other cloud services. Solid adoption of Azure AI, which now has a clientele of more than 53,000 customers, holds promise.However, Office's declining commercial licensing has been a headwind due to the continued customer shift to cloud offerings. Higher operating expenses and spending on Azure enhancements amid stiff competition in the cloud space remains a concern.(You can read the full research report on Microsoft here >>>)Shares of Amazon.com have outperformed the Zacks Internet - Commerce industry over the past year (+75.9% vs. +47.6%). Strengthening AWS services portfolio and its growing adoption rate contributed well to AWS performance. Ultrafast delivery services and an expanding content portfolio were beneficial. Strengthening relationships with third-party sellers was also a positive.A robust advertising business contributed well. Notably, improving Alexa skills, along with an array of smart home products offerings remain tailwinds. Amazon’s strong global presence and solid momentum among the small and medium businesses are positives, as well.Growing capabilities in grocery, pharmacy, healthcare and autonomous driving are additional successes for Amazon. Also, a deepening focus on generative AI is a major plus. However, macroeconomic challenges are among its concerns.(You can read the full research report on Amazon.com here >>>)Berkshire Hathaway’s shares have outperformed the Zacks Insurance - Property and Casualty industry over the past year (+35.0% vs. +29.5%). The company is one of the largest property and casualty insurance companies, with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts, and is indicative of its financial flexibility.Continued insurance business growth fuels an increase in its float, driving earnings and generating maximum returns on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to catatrophic losses induces earnings volatility and also affects underwriting results. Huge capital expenditures remain a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Other noteworthy reports we are featuring today include Abbott Laboratories and BlackRock, Inc. Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Abbott Laboratories (ABT) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report BlackRock, Inc. (BLK) : Free Stock Analysis Report Berkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}