{
    "title": "Intel Sets Sights on Dominating AI PC Market with Ambitious 100M Target, \nPartners with Microsoft",
    "date": "2/28/2024",
    "url": "https://www.tradingview.com/news/benzinga:a6b8e25c0094b:0-intel-sets-sights-on-dominating-ai-pc-market-with-ambitious-100m-target-partners-with-microsoft/",
    "text": "Intel Corp INTC is setting ambitious goals to revolutionize the PC industry by integrating artificial intelligence into up to 100 million PCs by 2025. The tech giant plans to ship 40 million AI-enabled PCs this year and aims for 60 million the next, targeting over 20% of the global PC market in 2025. Intel’s approach emphasizes not just the performance of its chips but also the overall user experience, necessitating close collaboration with software and application developers, Nikkei Asia reports. Also Read: US Chipmakers Want More Subsidies As AI Shapes The Semiconductor Industry Recent reports indicate Intel canvassing the U.S. government to bag over $10 billion in loans and direct grants under the U.S. Chips Act to accomplish its AI goals. It had postponed its $20 billion chip manufacturing project in Ohio due to issues related to government funding. The company is working alongside Microsoft Corp MSFT to pioneer the AI PC concept, which includes Intel’s Core Ultra PC chipset with a neural processing unit (NPU) for AI tasks, Microsoft’s AI chatbot Copilot, and a dedicated Copilot key on keyboards. This initiative will likely attract increased enterprise investment due to its potential to enhance work efficiency. Intel’s strategy extends to forming partnerships to develop AI-powered features with video conference service providers like Microsoft Teams, Webex, and Zoom. Intel is reportedly seeking $2 billion in equity to finance the construction of a semiconductor fabrication plant in Ireland as the world struggles to attain semiconductor technology independence. Benzinga Despite being the leading microprocessor supplier with a dominant market share in the PC industry, Intel faces competition from Apple Inc AAPL and Qualcomm Inc QCOM. Benzinga First Trust Nasdaq Semiconductor ETF FTXL and Invesco PHLX Semiconductor ETF SOXQ, with 6-8% exposure to Intel, have gained 10-16% year-to-date. Price Action: INTC shares closed lower by 0.60% at $42.73 on Tuesday. Also Read: Nvidia Leads AI Chip Rivalry with New GPUs, While AMD and Intel Bet Big on AI PCs Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo courtesy: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @manithawanii @richie_forex @bright_james1988 @trading_tools.ir @tradingview @mytradingsetup @forex.alex @stoic.trades @Cenobar @jamurai82 @tanhef @trading.is.mylife @ketory_fx @hiramedina @i_am_mauricee_ @thetradingfield @arcanebear @frankchevai_fxt1 Whatever the trade "
}