{
    "title": "Microsoft's AI tool Copilot's early users have mixed reviews, question \nprice tag",
    "date": "2/13/2024",
    "url": "https://seekingalpha.com/news/4066004-microsofts-ai-tool-copilots-early-users-have-mixed-reviews-question-price-tag",
    "text": "NurPhoto/NurPhoto via Getty Images Testers who used Microsoft's (NASDAQ:MSFT) new artificial-intelligence assistant software for over six months noted that the tool is useful but often does not live up to its price, The Wall Street Journal reported. The tech giant is hoping that Copilot for Microsoft 365 can be a big success. The AI tool — which plugs into Word, Outlook and Teams — is similar to OpenAI's ChatGPT and can generate texts, generate text and summarize emails, among other things. Companies who have tested noted that their employees have been wanting to try out the tool — at least initially. However, shortcomings with software including Excel and PowerPoint and its tendency to make mistakes have worried some testers that if the tool, at $30 apiece, is worth the price, the report added. \"I wouldn’t say we’re ready to spend $30 per user for every user in the company,\" said Juniper Networks' (JNPR) Chief Information Officer Sharon Mandell. Juniper has been testing Copilot since November. Microsoft has noted that early demand for the product has been unprecedented and the companies testing it have found it valuable. However, the Redmond, Wa.-based company has not shared details about sign-ups, according to the report. Last month, Microsoft (MSFT) overtook Apple (AAPL) as the world's most valuable publicly traded company. The Satya Nadella-led tech behemoth benefited in 2023 from investor positivity around its potential in AI as well as continuing strength in cloud computing. Microsoft's (MSFT) better-than-expected second-quarter results and guidance received much praise from Wall Street, leading many to believe the benefits the company is already seeing from AI are just beginning. Early testers have noted that the AI add-ons for Microsoft's Teams were most useful. Some have already been relying on Copilot if they were late to a meeting and needed a summary of what had been said. However, in some areas the testers said that the tech fell short: Copilot for Microsoft 365, including other generative AI tools, sometimes made up responses. Users added that Copilot, at times, would make errors related to meeting summaries. At one ad agency, Copilot-generated a summary of a meeting which said that \"Bob\" spoke about \"product strategy.\" The issue was that there was no one called Bob on the call and that no one spoke about product strategy, according to an executive at the company. Among other programs — mainly the ones related to numbers — fabrication was more problematic. Testers said Excel was one of the programs for which they were less likely to use Copilot as sometimes while crunching numbers it made mistakes. Jared Spataro, corporate vice president of workplace applications, at Microsoft noted that Excel was still in preview and was behind the other programs in usefulness. Some users have also been disappointed with Copilot's ability to generate PowerPoint slides, the report added. Some early adopters noted have said that the initial excitement about the AI product has faded away quickly. Lenovo (OTCPK:LNVGY) (OTCPK:LNVGF) said that besides the AI used for transcribing Teams' meetings there was around 20% decrease in the use of Copilot for most software after a month. In November 2023, when Microsoft made the assistant widely available, companies had to sign up for at least 300 subscriptions. But many were resistant to this size of commitment for an unproven software, as per a Microsoft software reseller. However, in January, Microsoft (MSFT) eased its minimum requirement, allowing companies to pilot the software with much smaller groups, the report noted. "
}