{
    "title": "Microsoft announces €2 billion AI investment in Spain",
    "date": "2/20/2024",
    "url": "https://www.thelocal.es/20240220/microsoft-announces-e2-billion-ai-investment-in-spain",
    "text": "The Local Europe ABVästmannagatan 43113 25 StockholmSweden Microsoft is set to invest over $2 billion (€1.95 billion) in artificial intelligence technology (AI) in Spain over the next two years to promote digital innovation and the responsible use of AI, the company's president said in a joint announcement with ministers. The funds are intended to benefit both Spanish companies and public sector administration, as well as promote Spain as a European-wide digital hub. The investment, which is the largest the tech giant has made in Spain, will fund work primarily within the National Artificial Intelligence Strategy framework and the National Cybersecurity Strategy. The funds will help the extension of AI use into public administration, including the training of civil servants, as well as promoting the use of responsible AI and implementing warning systems against cyber attacks, something in which Microsoft will collaborate with the Spanish Agency for the Supervision of Artificial Intelligence (AESIA). Microsoft's President Brad Smith met with Spanish Prime Minister Pedro Sánchez in a meeting at La Moncloa, along with Minister for Digital Transformation, José Luis Escrivá, to announce the investment. In a statement, the government said that \"these strategic investments by Microsoft in Spain in data centres and R&D, which will be carried out under sustainability criteria, will contribute to turning our country into a hub of interconnectivity and digital infrastructure.\" READ ALSO: Spain to invest €11 billion to become Europe's microchip factory Microsoft will soon open a 'cloud' region of data centres in Madrid, and has announced that it will also build a so-called data centre campus in Aragón for European companies and public entities, aiming to secure Spain’s position as a European leader. Speaking to Spanish daily El País, Smith said that the strategy is to provide Spain with the tools to successfully harness what many view as the inevitable AI revolution in the coming years. Spain is already one of the countries where AI is most widely used, Smith said, but jobs are not yet being created to reflect that high usage. \"There are some things that are really interesting... Between Q3 and Q4 last year, we saw the use of generative AI by organisations across Spain increase by more than five times in one quarter,\" Smith said. \"So we are literally seeing AI adoption explode across the Spanish economy. Our investment of $2.1 billion in just two years is trying to keep pace with the country's needs.\" It is hoped that the investment can also help to modernise administrative processes and train civil servants in AI technology to increase their effectiveness and efficiency. The funds will also be used to bolster national cybersecurity and the cyber-resilience of state departments, including early warning and response mechanisms to computer security incidents (that is to say, hacks or bugs) in government and public sector systems. Microsoft also intends to help strengthen the cyber-resilience of private companies by providing information on potential threats and cyber-attacks coming from abroad. Join the conversation in our comments section below. Share your own views and experience and if you have a question or suggestion for our journalists then email us at [email protected].\nPlease keep comments civil, constructive and on topic – and make sure to read our terms of use before getting involved. Please log in here to leave a comment. The Local Europe ABVästmannagatan 43113 25 StockholmSweden By signing up you agree to our Terms of Use and Privacy Policy. We will use your email address to send you newsletters as well as information and offers related to your account. 2024 The Local, All Rights Reserved. "
}