{
    "title": null,
    "date": "2/27/2024",
    "url": "https://www.mediapost.com/publications/article/393842/microsoft-backed-mistral-unveils-ai-model-that-can.html",
    "text": "Username Password Remember me Forgot your password? Subscribe today to gain access to every Research Intelligencer article we publish as well as the exclusive daily newsletter, full access to The MediaPost Cases, first-look research and daily insights from Joe Mandese, Editor in Chief. If you're already a paid subscriber, please sign-in. Username Password  \n                                      Forgot?  Log in if you are already a member Username Password  \n                                      Forgot?  A Microsoft-backed generative AI company, Mistral, on Monday\nunveiled a new model that the company's founder Arthur Mensch, a former Google employee, said can perform some “reasoning” tasks comparably with OpenAI GPT-4, and Gemini Ultra. Mistral’s GAI model, Mistral Large, is open-sourced and being made available on its platform and through Microsoft Azure Cloud services, the company's first distributor\npartner. Brad Smith, Microsoft president, announced new AI Access Principles at the Mobile World Congress in Barcelona. This was part of the effort to address Microsoft’s growing role\nand responsibility as an AI innovator and market leader. “This new AI economy is creating not just new opportunities for existing enterprises, but new companies and entirely new business\ncategories,” Smith wrote in a blog post. “The principles we’re announcing today commit Microsoft to bigger investments, more business partnerships, and broader programs to promote\ninnovation and competition than any prior initiative in the company’s 49-year history.” advertisement advertisement This occurred several days after Google faced a backlash in response to its AI chatbot Gemini generating ethnically diverse\nimages of historical characters such as Vikings, popes, and even the founders of the company. Smith announced the investment in Mistral and said the investments and programs announced\nMonday put the company’s principles into practice -- not only in Europe and in the United States, but worldwide. Mistral Large has native multilingual capacities. It strongly outperforms\nLLaMA 2 70B on HellaSwag, Arc Challenge and MMLU benchmarks in French, German, Spanish and Italian. In terms of “reasoning” -- the ability to think logically and reach conclusions\n-- Mistral said the model reaches top-tier reasoning capabilities, and can be used for complex multilingual reasoning tasks including text understanding, transformation, and code generation. Mistral Large achieves strong results on commonly used benchmarks, making it the world's second-ranked model available through an API next to GPT-4. Ericsson, a telecommunications services\ncompany, describes machine reasoning as an “attempt to implement abstract thinking” and “apply human-like common sense to analyze large amounts of data Mistral has raised\nmore than $500 million from investors based on that ability. The investors also include Andreessen Horowitz. And while the funding amount is much less than competitors like OpenAI --\nwhich as of December 2023 raised $100 billion -- its chances of sailing  through privacy and regulatory issues seems more promising. The company is based in France. Mensch told The\nWall Street Journal his model cost less to train -- about €20 million -- which is the equivalent of roughly $22 million in U.S. currency. No doubt GAI models in time will become less\nexpensive to build, operate and train, bringing the price down for any business that wants to use the technology. OpenAI Chief Executive Sam Altman said last year after the release\nof GPT-4 that training his company’s biggest models cost between $50 million and $100 million. Mistral has also partnered with enterprise-software company Salesforce and Nvidia,\nwhich makes graphics processing units of GPUs that are used to build AI systems. Laurie Sullivan is a writer and editor for MediaPost. You can reach Laurie at lauriesullivan@gmail.com. advertisement "
}