{
    "title": "Microsoft to Launch Copilot for Security Globally",
    "date": "3/22/2024",
    "url": "https://www.channele2e.com/news/microsoft-to-launch-copilot-for-security-globally",
    "text": " (Adobe Stock) Microsoft has announced the global launch of its Microsoft Copilot for Security. The company describes it as the first generative AI solution designed for security and IT professionals, aimed at improving threat detection, accelerating response times, and bolstering team expertise. The new solution will be available April 1, 2024, the company said. According to Microsoft, Copilot for Security leverages vast amounts of data, including over 78 trillion security signals processed daily, combined with advanced language models to generate customized insights and action recommendations.  According to Microsoft’s second economic study on Copilot for Security, security analysts who used the tool were 22% faster and 7% more accurate in their tasks than those who did not. Additionally, 97% of these analysts expressed a preference to continue using Copilot for their future tasks, the company said.  The company has introduced a pay-as-you-go licensing model for the offering, intending to broaden access to the tool across different sizes and types of organizations. The announcement also highlighted new features and integrations for Copilot for Security, including custom promptbooks, knowledge base integrations, and support for multiple languages. With its global availability, Copilot for Security will support multiple languages, which will help facilitate adoption in different regions, according to the company. Ty TrumbullMarch 26, 2024 By 2025, AI-integrated PCs are expected to make up 40% of global PC shipments, says a new report Jessica C. DavisMarch 24, 2024 Ahead of the N-able Empower Conference, CEO Pagliuca addresses co-partnering, cybersecurity, the future of RMM, and MSP use of AI. Jessica C. DavisMarch 21, 2024 Today's channel market updates also include Cognizant, Google Cloud, and SmartCIC.  "
}