{
    "title": "Ariel Investments LLC Sells 137934 Shares of Microsoft Co. (NASDAQ:MSFT)",
    "date": "3/13/2024",
    "url": "https://www.americanbankingnews.com/2024/03/13/ariel-investments-llc-sells-137934-shares-of-microsoft-co-nasdaqmsft.html",
    "text": "Posted by ABMN Staff on Mar 13th, 2024 Ariel Investments LLC cut its position in Microsoft Co. (NASDAQ:MSFT – Free Report) by 19.3% in the third quarter, according to its most recent Form 13F filing with the SEC. The institutional investor owned 578,397 shares of the software giant’s stock after selling 137,934 shares during the quarter. Microsoft makes up approximately 1.9% of Ariel Investments LLC’s investment portfolio, making the stock its 17th largest holding. Ariel Investments LLC’s holdings in Microsoft were worth $182,629,000 at the end of the most recent reporting period. A number of other large investors have also added to or reduced their stakes in MSFT. Monumental Financial Group Inc. purchased a new stake in Microsoft in the first quarter valued at approximately $28,000. Atlantic Private Wealth LLC boosted its position in Microsoft by 534.5% in the second quarter. Atlantic Private Wealth LLC now owns 184 shares of the software giant’s stock valued at $63,000 after buying an additional 155 shares during the last quarter. Infrastructure Capital Advisors LLC purchased a new stake in Microsoft in the 2nd quarter worth approximately $601,000. Hibernia Wealth Partners LLC purchased a new stake in Microsoft in the 3rd quarter worth approximately $69,000. Finally, Iron Horse Wealth Management LLC boosted its position in Microsoft by 89.0% in the 3rd quarter. Iron Horse Wealth Management LLC now owns 223 shares of the software giant’s stock worth $70,000 after purchasing an additional 105 shares in the last quarter. 69.20% of the stock is currently owned by institutional investors. Several equities research analysts have commented on MSFT shares. Argus upped their price objective on Microsoft from $390.00 to $430.00 and gave the stock a “buy” rating in a research report on Tuesday, December 5th. Macquarie increased their price target on Microsoft from $430.00 to $450.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. China Renaissance began coverage on Microsoft in a report on Tuesday, December 5th. They set a “buy” rating and a $466.00 target price for the company. Evercore ISI reissued an “outperform” rating and set a $432.00 target price on shares of Microsoft in a research report on Monday, November 20th. Finally, Royal Bank of Canada lifted their price target on Microsoft from $415.00 to $450.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Four analysts have rated the stock with a hold rating and thirty-six have assigned a buy rating to the company. According to MarketBeat.com, Microsoft currently has a consensus rating of “Moderate Buy” and an average target price of $415.00. Check Out Our Latest Stock Analysis on MSFT Shares of MSFT opened at $415.28 on Wednesday. Microsoft Co. has a 1 year low of $245.73 and a 1 year high of $420.82. The company has a current ratio of 1.22, a quick ratio of 1.20 and a debt-to-equity ratio of 0.19. The stock has a 50 day simple moving average of $401.01 and a 200-day simple moving average of $367.12. The stock has a market cap of $3.09 trillion, a PE ratio of 37.55, a PEG ratio of 2.16 and a beta of 0.89. Microsoft (NASDAQ:MSFT – Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, beating analysts’ consensus estimates of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The firm had revenue of $62.02 billion for the quarter, compared to analyst estimates of $61.14 billion. During the same period last year, the company earned $2.32 EPS. The business’s quarterly revenue was up 17.6% compared to the same quarter last year. On average, sell-side analysts predict that Microsoft Co. will post 11.63 EPS for the current fiscal year. The business also recently declared a quarterly dividend, which will be paid on Thursday, June 13th. Stockholders of record on Thursday, May 16th will be given a $0.75 dividend. The ex-dividend date of this dividend is Wednesday, May 15th. This represents a $3.00 annualized dividend and a dividend yield of 0.72%. Microsoft’s dividend payout ratio is currently 27.12%. In other news, EVP Kathleen T. Hogan sold 21,955 shares of the firm’s stock in a transaction on Monday, March 11th. The stock was sold at an average price of $403.96, for a total value of $8,868,941.80. Following the transaction, the executive vice president now directly owns 159,764 shares in the company, valued at approximately $64,538,265.44. The transaction was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through the SEC website. In related news, insider Bradford L. Smith sold 3,303 shares of Microsoft stock in a transaction dated Monday, February 5th. The stock was sold at an average price of $406.12, for a total value of $1,341,414.36. Following the sale, the insider now owns 570,826 shares of the company’s stock, valued at $231,823,855.12. The transaction was disclosed in a document filed with the SEC, which is available through this hyperlink. Also, EVP Kathleen T. Hogan sold 21,955 shares of the business’s stock in a transaction that occurred on Monday, March 11th. The stock was sold at an average price of $403.96, for a total value of $8,868,941.80. Following the transaction, the executive vice president now directly owns 159,764 shares in the company, valued at approximately $64,538,265.44. The disclosure for this sale can be found here. Insiders have sold 1,070,258 shares of company stock worth $30,690,456 in the last three months. Insiders own 0.03% of the company’s stock. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Public Employees Retirement System of Ohio Has $5.56 Million Holdings in Carlisle Companies Incorporated (NYSE:CSL) GSA Capital Partners LLP Makes New $768,000 Investment in TE Connectivity Ltd. (NYSE:TEL) "
}