{
    "title": "Enbridge Target of Unusually High Options Trading (NYSE:ENB)",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nyse-enb-options-data-report-2024-03-21/",
    "text": "Enbridge Inc. (NYSE:ENB - Get Free Report) TSE: ENB was the target of unusually large options trading on Wednesday. Traders acquired 20,216 put options on the stock. This is an increase of approximately 1,036% compared to the average daily volume of 1,779 put options. NYSE:ENB traded down $0.31 during mid-day trading on Thursday, hitting $35.78. The company had a trading volume of 3,465,827 shares, compared to its average volume of 5,673,295. Enbridge has a fifty-two week low of $31.03 and a fifty-two week high of $40.30. The business's fifty day moving average is $35.28 and its two-hundred day moving average is $34.52. The company has a debt-to-equity ratio of 1.30, a quick ratio of 0.74 and a current ratio of 0.83. The firm has a market cap of $76.05 billion, a P/E ratio of 17.04, a P/E/G ratio of 3.39 and a beta of 0.83. Enbridge (NYSE:ENB - Get Free Report) TSE: ENB last posted its earnings results on Friday, February 9th. The pipeline company reported $0.47 earnings per share for the quarter, missing the consensus estimate of $0.50 by ($0.03). The firm had revenue of $8.37 billion during the quarter, compared to analyst estimates of $9.62 billion. Enbridge had a return on equity of 10.23% and a net margin of 13.97%. As a group, research analysts expect that Enbridge will post 2.11 earnings per share for the current year. Hedge funds have recently bought and sold shares of the stock. Moneta Group Investment Advisors LLC raised its holdings in shares of Enbridge by 109,143.5% during the fourth quarter. Moneta Group Investment Advisors LLC now owns 48,468,082 shares of the pipeline company's stock worth $1,895,102,000 after acquiring an additional 48,423,715 shares during the period. Canoe Financial LP increased its holdings in Enbridge by 80,631.1% during the fourth quarter. Canoe Financial LP now owns 33,460,611 shares of the pipeline company's stock worth $1,205,251,000 after buying an additional 33,419,164 shares during the last quarter. Wellington Management Group LLP raised its holdings in shares of Enbridge by 630.3% in the 3rd quarter. Wellington Management Group LLP now owns 32,531,108 shares of the pipeline company's stock valued at $1,083,938,000 after purchasing an additional 28,076,386 shares during the period. Norges Bank bought a new stake in shares of Enbridge in the 4th quarter valued at about $714,662,000. Finally, TD Asset Management Inc raised its stake in Enbridge by 24.9% in the fourth quarter. TD Asset Management Inc now owns 37,749,760 shares of the pipeline company's stock valued at $1,365,583,000 after buying an additional 7,536,678 shares during the period. 48.29% of the stock is currently owned by institutional investors and hedge funds. A number of research analysts have recently commented on the company. Stifel Nicolaus started coverage on Enbridge in a report on Thursday, January 18th. They set a \"hold\" rating for the company. Jefferies Financial Group began coverage on shares of Enbridge in a research report on Tuesday, February 27th. They set a \"buy\" rating for the company. Two research analysts have rated the stock with a sell rating, seven have issued a hold rating and three have given a buy rating to the stock. According to data from MarketBeat, the company presently has a consensus rating of \"Hold\" and an average price target of $55.20. Get Our Latest Analysis on ENB Enbridge Inc, together with its subsidiaries, operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States.Featured StoriesFive stocks we like better than EnbridgeStock Trading Terms - Stock Terms Every Investor Needs to KnowGoogle and Meta Circling the Market on a TikTok Ban RallyBasic Materials Stocks InvestingIntuitive Machines: Charting a Course Among the StarsBuy P&G Now, Before It Sets A New All-Time HighKB Home’s Stock Price Can Move Higher, Here’s Why Before you consider Enbridge, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Enbridge wasn't on the list. While Enbridge currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here With average gains of 150% since the start of 2023, now is the time to give these stocks a look and pump up your 2024 portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}