{
    "title": "Pavan Davuluri, IIT Madras graduate, is new Microsoft Windows boss: Who is \nhe",
    "date": "3/26/2024",
    "url": "https://www.hindustantimes.com/business/iit-madras-graduate-pavan-davuluri-is-new-microsoft-windows-boss-who-is-he-101711515030283.html",
    "text": "Subscribe Now! Get features like Microsoft internally merged the Windows and Surface teams once again and appointed IIT Madras alumni Pavan Davuluri to lead the development on both fronts, as per Windows Central that tracks developments at Microsoft. This comes after a brief separation between the two units during which Windows fell under Microsoft's new AI organisation. This marks a return of the earlier structure within Microsoft's Engineering and Devices organisation which is headed by Rajesh Jha. Pavan Davuluri previously oversaw Microsoft's hardware endeavours. He will now be in charge of Windows engineering as well in a reshuffle following the departure of ex-Windows and Surface chief Panos Panay last September. At the time, Panas Panay's role was split between Pavan Davuluri and Mikhail Parakhin. The latter took charge of Windows, alongside his existing responsibilities as CEO of Web and Advertising at Microsoft. He looked after products such as Bing, Edge, and Copilot. Pavan Davuluri has been behing Microsoft's efforts to optimize Windows for Arm-based devices. In a post on X (formerly Twitter), he earlier shared, \"Today, we announced our first ever #Surface AI PCs built exclusively for business: Surface Pro 10 for Business and Surface Laptop 6 for Business! I'm incredibly proud of the team for the work they did to bring these devices and experiences to life for our customers #Copilot.\" Microsoft recently appointed DeepMind co-founder Mustafa Suleyman as CEO of a new AI division. With this Mikhail Parakhin's team has been absorbed into the new AI division. This comes as Microsoft is expected to unveil new next-generation AI features and Arm-based Surface hardware soon. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}