{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.straitstimes.com/business/no-more-talking-microsoft-woos-s-pore-to-apply-ai-at-scale",
    "text": "SINGAPORE – Tech giant Microsoft has announced six collaborations to ramp up the adoption of artificial intelligence (AI) among local businesses and workers. The American company, a first mover in the global AI race, also made the first big-bang launch in 2024 to co-pilot Singapore’s AI ambitions. Microsoft signed two memorandums of understanding on March 6 with SkillsFuture Singapore (SSG) and NTUC LearningHub. The SSG agreement aims to help 2,000 small and medium-sized enterprises (SMEs) over three years to adopt AI and get more productive in workflows such as human resources, finance and sales, and marketing. There are more than 280,000 SMEs in Singapore, comprising about 99 per cent of businesses here. The signing with NTUC LearningHub is to raise the AI literacy of up to 100,000 members of the labour union. Mr Ahmed Mazhari, Microsoft’s president for Asia, said adoption of generative AI has outpaced every other technology he knows. He was excited about its potential: “Think about all the hawker centres here. Think about those people who have wants and dos, and who work every single day. How can we make them productive? How can we make them more agile?” The Government announced a $1 billion investment for AI funding over the next five years in the 2024 Budget, doubling down on Singapore’s National AI Strategy 2.0 targets to triple the AI workforce to at least 15,000 and make all industries conversant with AI capabilities. While multiple surveys have shown that most organisations believe in AI’s benefits, a majority are grappling with a lack of AI talent and expertise. To catalyse the adoption of its AI tools, Microsoft formed the AI Pinnacle Program with security services provider Certis, Home Team Science and Technology Agency, Mediacorp, engineering services firm Seatrium and national healthtech agency Synapxe. The programme aims to raise AI adoption across its members’ supply chains, creating clusters of AI users in their respective industries. Certis Group chairman Allen Lew said: “Our biggest source of supply is human resources, and the cost of that is going up.” If AI could ease his front liners’ work, the profession could draw more entrants. Besides raising productivity, he said: “How do we change the way we provide a service that it’s not putting humans up front as you see today? We want to use the humans to enhance the technology. That’s the bigger picture.” Microsoft added that it will work with Enterprise Singapore and AI Singapore to speed up AI adoption of its Copilot tools, which function like AI assistants, while promoting industry-specific uses for SMEs. It will work with the Infocomm Media Development Authority to help digitally mature SMEs. It has also tied up with the Institute for Adult Learning to put AI in teaching modules and test new AI tools and methodologies to enhance the curriculum. Mr Toh Keng Hoe, president of the AI and robotics chapter at the Singapore Computer Society, said Microsoft engaging local entities in technology proliferation is well-documented and expected. “However, the widespread support from numerous local organisations is a pleasantly surprising development that speaks volumes about the collective vision for AI proficiency within the region,” he said. He added: “The Microsoft initiative is likely to prompt a ripple effect among other tech giants like AWS (Amazon Web Services), Google, and potentially Huawei, as they strive to establish themselves as key players in this domain.” The stakes for tech companies in the game are billions – even trillions – of dollars. Microsoft became the world’s second-most valuable company after Apple in January, when its market value crossed US$3 trillion (S$4.03 trillion) for the first time in its 49-year history. Investors are banking on it to monetise the technology, following the eye-watering sums it poured into ChatGPT’s OpenAI and, recently, the French small language model maker Mistral. Microsoft chief executive Satya Nadella told analysts in January: “We have moved from talking about AI to applying AI at scale.” Education Minister Chan Chun Sing told more than 100 C-suite guests at the Microsoft event at the Andaz hotel: “In my conversations with some counterparts overseas, the mood is entirely different. “People are not talking about how to adopt AI, or how to find new use cases. They are talking about how to slow down the proliferation of AI because they are afraid of people losing their jobs, or of the divides AI may cause. We must not get into that situation.” The minister, who is also in the Smart Nation and Digital Government Group Ministerial Committee, added that Singapore will spare no effort to be a global leader in AI research, applications and usage, but its approach must be niched and organised. “We must have a generation of savvy users, people who can apply the technologies not just to the local market or the regional market, but also to the global markets.” Academia has a part to play alongside the Government, businesses and workers. Singapore’s AI talent pool must be defined by a global web of AI practitioners, not just experts based here, Mr Chan said, adding: “Our academia has the responsibility to take the lead in this.” Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2024 SPH Media Limited. All rights reserved. "
}