{
    "title": null,
    "date": "3/10/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT/pressreleases/24683127/3-no-brainer-stocks-id-buy-right-now-without-hesitation/",
    "text": "The stock market has seen a lot of movement in recent years, with external factors like the COVID-19 pandemic, a subsequent economic downturn, and a boom in artificial intelligence (AI) creating plenty of peaks and valleys. In fact, the Nasdaq Composite index plunged 33% in 2022, then rose 43% the following year. However, recent volatility appears to be subsiding as inflation eases and excitement over tech fuels a market recovery. As a result, now is an excellent time to dedicate a larger portion of your portfolio to the expanding tech market and reap the rewards long into the future. Here are three no-brainer stocks I'd buy right now without hesitation. Nvidia(NASDAQ: NVDA) has appeared unstoppable over the last year as it became the poster child for AI. The company's stock is up 260% since last March, rallying investors while snapping up an estimated 90% market share in AI chips. Increased demand for AI services boosted sales of graphics processing unit (GPU), the chips crucial for training AI models. As a leading chipmaker, Nvidia has massively profited from rising demand for GPUs. In its most recent quarter (the fourth quarter of 2024 ended in January), the company's revenue increased by 265% year over year to $22 billion. Meanwhile, operating income jumped 983% to nearly $14 billion. The monster growth was primarily thanks to a 409% increase in data center revenue, reflecting a spike in AI GPU sales.  Data by YCharts Nvidia has massive potential as the AI market develops, and earnings-per-share (EPS) estimates reflect this. The chart above shows Nvidia's earnings could reach just over $34 per share over the next two fiscal years. Multiplying that figure by the tech giant's forward price-to-earnings ratio (P/E) of 35 yields a stock price of $1,197. Looking at its current position, these projections would see Nvidia's stock increase 39% by fiscal 2027, making it a screaming buy right now. Like Nvidia, Advanced Micro Devices(NASDAQ: AMD) has much to gain from the rise of AI. According to Grand View Research, the AI market is projected to expand at a compound annual growth rate (CAGR) of 37% until at least 2030. Its massive growth potential suggests Nvidia will be able to retain its dominance and despite newcomers like AMD. AMD was slightly late to the AI party. However, it is making moves to take a slice of the $200 billion industry and could see major gains over the long term. Last December, the company unveiled its new MI300X AI GPU. The chip was designed to compete directly with Nvidia's offerings and has already caught the attention of some of tech's most prominent players, signing on Microsoft and Meta Platforms as clients. Moreover, AMD seeks to lead its own space within AI by doubling down on AI-powered PCs. This segment is expected to see a significant boost this year, with AI integration serving as a key catalyst.  Data by YCharts The table above shows AMD's earnings could reach top $7 per share over the next two fiscal years. In a similar calculation to Nvidia, multiplying this figure by AMD's forward P/E of 58 yields a stock price of $403, projecting that its stock will nearly double in price within two years. Amazon(NASDAQ: AMZN) has come a long way since starting as an online book retailer almost 30 years ago. The company has expanded to multiple industries, from becoming a titan of e-commerce to leading the cloud market, developing space satellites, and venturing into grocery, gaming, consumer tech, and more. Amazon dominates e-commerce in dozens of countries, a market expected to hit $3.6 trillion in 2024 and develop at a CAGR of 10% through 2028. The company will likely continue profiting from the segment's tailwinds for years. However, Amazon's biggest growth catalyst is easily its cloud platform, Amazon Web Services (AWS). In Q4 2023, revenue from the platform rose 13% year over year to $24 billion. Meanwhile, AWS was responsible for 54% of the company's operating income, despite earning the lowest portion of revenue between its three segments. Moreover, AWS gives Amazon a lucrative role in AI. As the world's biggest cloud service, AWS has the potential to leverage its massive cloud data centers and steer the generative AI market.  Data by YCharts Like Nvidia and AMD, EPS estimates project massive potential for Amazon's stock. This table indicates that the e-commerce giant's earnings will achieve nearly $7 per share by fiscal 2026. When multiplying that by Amazon's forward P/E of 42, you get a stock price of $294. From its current position, this would see Amazon's stock rise 68% over the next two fiscal years. Alongside dominating positions in e-commerce and cloud computing, Amazon is a no-brainer buy this March. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 8, 2024  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Microsoft Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}