{
    "title": "A.P. Møller - Mærsk A/S (OTCMKTS:AMKBY) Given Consensus Rating of \"Reduce\" \nby Analysts",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/otcmkts-amkby-consensus-analyst-rating-2024-03-19/",
    "text": "Shares of A.P. Møller - Mærsk A/S (OTCMKTS:AMKBY - Get Free Report) have earned an average recommendation of \"Reduce\" from the twelve research firms that are covering the company, Marketbeat reports. Five analysts have rated the stock with a sell recommendation, four have issued a hold recommendation and three have given a buy recommendation to the company. A number of research analysts have recently issued reports on AMKBY shares. The Goldman Sachs Group raised A.P. Møller - Mærsk A/S from a \"sell\" rating to a \"neutral\" rating in a research note on Tuesday, January 2nd. Jefferies Financial Group raised A.P. Møller - Mærsk A/S from a \"hold\" rating to a \"buy\" rating in a research note on Friday, January 5th. Sanford C. Bernstein began coverage on A.P. Møller - Mærsk A/S in a research report on Wednesday, February 21st. They set an \"underperform\" rating for the company. JPMorgan Chase & Co. downgraded shares of A.P. Møller - Mærsk A/S from an \"overweight\" rating to a \"neutral\" rating in a research report on Thursday, January 4th. Finally, BNP Paribas lowered shares of A.P. Møller - Mærsk A/S from an \"outperform\" rating to a \"neutral\" rating in a research note on Thursday, January 11th. Check Out Our Latest Stock Analysis on A.P. Møller - Mærsk A/S Shares of OTCMKTS AMKBY traded down $0.06 during midday trading on Tuesday, hitting $6.39. 343,648 shares of the stock traded hands, compared to its average volume of 443,612. The business has a 50 day moving average price of $8.20 and a two-hundred day moving average price of $8.37. A.P. Møller - Mærsk A/S has a one year low of $6.38 and a one year high of $12.06. A.P. Møller - Mærsk A/S (OTCMKTS:AMKBY - Get Free Report) last issued its quarterly earnings data on Thursday, February 8th. The transportation company reported ($0.14) earnings per share (EPS) for the quarter, topping analysts' consensus estimates of ($0.17) by $0.03. The business had revenue of $11.74 billion during the quarter, compared to the consensus estimate of $11.32 billion. A.P. Møller - Mærsk A/S had a net margin of 7.48% and a negative return on equity of 0.22%. As a group, equities analysts expect that A.P. Møller - Mærsk A/S will post 0.56 earnings per share for the current fiscal year. The firm also recently declared a dividend, which will be paid on Wednesday, April 3rd. Investors of record on Monday, March 18th will be paid a dividend of $0.2412 per share. The ex-dividend date is Friday, March 15th. A.P. Møller - Mærsk A/S's dividend payout ratio is currently 21.62%. A.P. Møller - Mærsk A/S, together with its subsidiaries, engages in the ocean transport and logistics business in Denmark and internationally. It operates through Ocean, Logistics & Services, Terminals, and Towage & Maritime Services segments. The Ocean segment is involved in container shipping activities, including demurrage and detention, terminal handling, documentation and container services, and container storage, as well as transshipment hubs.Featured ArticlesFive stocks we like better than A.P. Møller - Mærsk A/SShould You Add These Warren Buffett Stocks to Your Portfolio?Growing Twice as Fast as Tesla, XPeng is a BuyHow to Use High Beta Stocks to Maximize Your Investing Profits4 Stocks Building Long-Term Value for Shareholders What Are Dividend Contenders? Investing in Dividend ContendersFedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount  Before you consider A.P. Møller - Mærsk A/S, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and A.P. Møller - Mærsk A/S wasn't on the list. While A.P. Møller - Mærsk A/S currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of seven stocks and why their long-term outlooks are very promising. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}