{
    "title": "Microsoft hires DeepMind co-founder to lead AI unit",
    "date": "3/20/2024",
    "url": "https://japantoday.com/category/tech/microsoft-hires-deepmind-co-founder-to-lead-ai-unit",
    "text": "JapanToday\nSotokanda S Bldg. 4F\n\t\t\t\t\t5-2-1 Sotokanda\n\t\t\t\t\tChiyoda-ku\n\t\t\t\t\tTokyo 101-0021\n\t\t\t\t\tJapan\n\t\t\t\t\tTel: +81 3 5829 5900\n\t\t\t\t\tFax: +81 3 5829 5919\nEmail: editor@japantoday.com\n©2024 GPlusMedia Inc. DeepMind co-founder Mustafa Suleyman will become the head of a newly created consumer AI unit at Microsoft, the scientist and entrepreneur said. Suleyman is one of the biggest names in the artificial intelligence revolution that is taking the technology world by storm and his hiring is a major move by Microsoft, which already partners with ChatGPT creator OpenAI. Of all the tech giants, Microsoft has moved the fastest into adopting generative AI, integrating its powers into a whole range of products, most notably through its Copilot chatbot. \"I'm excited to announce that today I'm joining @Microsoft as CEO of Microsoft AI. I'll be leading all consumer AI products and research, including Copilot, Bing and Edge,\" Suleyman said in a post on X. Suleyman said he would be leaving his role as chief executive of Inflection, a startup he co-founded and that became a promising rival to OpenAI and Anthropic in building the models that deliver ChatGPT-style AI. He added that some key collaborators at Inflection, including co-founder Karén Simonyan, had \"chosen to join\" his team at Microsoft. \"We have been operating with speed and intensity and this infusion of new talent will enable us to accelerate our pace yet again,\" Microsoft CEO Satya Nadella said in a blog post. Nadella said AI innovation at Microsoft would still depend on its partnership with OpenAI, the company led by Sam Altman where Microsoft invested $13 billion last year. \"We congratulate Mustafa and Karén on their new roles and look forward to working with them,\" an OpenAI spokesperson said in a statement to US media. With the hire, Microsoft is expanding its already leading position in the AI frenzy, accumulating investments and partnerships well beyond its deal with OpenAI. Last month, the company said it had partnered with French startup Mistral AI, a company that is seen as another promising upstart in the generative AI field. The full embrace of artificial intelligence has often taken archrival Google by surprise and seen Microsoft become the world's biggest company by market capitalization, taking over that top berth from Apple. Suleyman's DeepMind was acquired by Google in 2014 for $500 million and the company was fully merged with Google's own AI research department last year. Regulators in the United States and Europe have been scrutinizing the relationship between Microsoft and OpenAI amid a broader inquiry into how tech giants are potentially dominating the fledgling sector. Have you tried Japanese facial sheet masks?\r\nCheck out our most recommended products and ingredients! Read More When is peak bloom? Check GaijinPot's interactive forecast map to plan your cherry blossom viewing experience! See when the cherry blossoms will peak in your part of Japan! People and countries realize the potential. The country, company or individual to master AI will be the next global and interstellar power for at least the next 1000 years. Hiring AI talent is challenging and competitive. You have to prove that their is plan in place to get people on board. At the moment, Microsoft is the leader with Mustafa and Altman part of the Microsoft family and partnerships with the company Figure which already ahead of Elon's robotics unit. Nvidia's chip advantage will eventually end because Microsoft will probably team up with Intel or another viable company. Microsoft is so invested that they have already broken ground on their own nuclear power plant to supply their AI. No other company will have the ability to generate enough power to use the full capabilities of their AI except Microsoft. Poor Elon is so far behind that he will sell his soul to China in hopes of claiming a false supremacy. Unfortunately for China, AI research and development has some of the highest security because of its potential. China has not been able to use corporate espionage to steal AI secrets which will be the only way they can catchup like usual. The country, company or individual to master AI will be the next global and interstellar power for at least the next 1000 years. Big words, but in fact there will neither be real AI nor anyone who could master something that is only an insufficient attempt and intrinsically is destined to fail. We really should hurry up and get back some reality ground under our feet, because we mathematically cannot develop AI, cannot biologically live on Mars, cannot physically leave our solar system and meet with other lifeforms and we just won't see all such and similar phantasies. we mathematically cannot develop AI Pluralis majestatis, Svenni? Use your Facebook account to login or register with JapanToday. By doing so, you will also receive an email inviting you to receive our news alerts. See what's trending at Don Quijote in Japan and why you should get them! Learn More Join the leaders of English Education for Children in Japan! A mix of what's trending on our other sites GaijinPot Blog "
}