{
    "title": "Microsoft game testers boost union ranks at company to 1,000",
    "date": "3/9/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/microsoft-game-testers-boost-union-ranks-company-1-000",
    "text": "ABOUT 600 video game testers at Microsoft’s Activision Blizzard studios have unionised, more than doubling the size of labour’s foothold at the software giant, according to the Communications Workers of America (CWA). The achievement, which brings the unionised workforce within Microsoft to roughly 1,000, was possible partly thanks to Microsoft’s labour-friendly posture. Unlike most US tech giants, the company declined to campaign against organising efforts, according to the CWA, and agreed to voluntarily recognise and negotiate with the group if it secured majority support. On Friday (Mar 8), an arbitrator overseeing an election determined that 390 of the nearly 600 workers supported the union, according to CWA, while only eight voted against it. The others in the new bargaining unit did not participate. The employees, who provide quality assurance, are based in California, Texas and Minnesota. By organising, they hope to improve their pay, benefits and job security, and get a say in the company’s decision-making. “There’s been a lot of decisions that were made higher up that we’re just not a part of,” said QA tester Andrew Snell, a member of the union’s organising committee. “We’re just ready to go, ‘Hey, maybe it’s time for us to step in as well and help steer the ship.’” The latest union victory at Activision, acquired by Microsoft last year, could provide a boost for CWA’s efforts to organise gaming workers at other companies. It also could help the union make inroads among better-paid workers elsewhere at Microsoft, who may prove harder to organise. Start and end each day with the latest news stories and analyses delivered straight to your inbox. CWA previously organised roughly 400 quality assurance workers at Activision and the Microsoft game publisher ZeniMax. The union has also secured union recognition in recent years among New York Times tech workers, Oklahoma City Apple store employees and staff at a handful of Wells Fargo branches. Microsoft has been unusually open to working with unions. As it sought regulatory approval in 2022 to buy Activision, the company announced a new set of principles, including a commitment to “collaborative approaches that will make it simpler” for workers to choose whether to unionise. The software giant also entered an agreement with CWA on more specific terms that would make it easier to unionise certain roles and, when ZeniMax game testers sought to unionise, stayed neutral rather than opposing their efforts. Last December, the company announced it would take a similar approach to organising campaigns by other American Federation of Labor and Congress of Industrial Organizations (AFL-CIO) unions. In contract talks underway at ZeniMax, Microsoft has agreed to language governing how it deploys artificial intelligence and committed to convert a group of staff from subcontracted temps to unionised, higher-paid Microsoft employees. “I think we all have to look to the future and acknowledge that artificial intelligence is going to change many people’s jobs,” Microsoft president Brad Smith said at an event in December with the AFL-CIO, where they announced a partnership aimed at understanding how AI will affect workers. “This is a bridge between great union organisations and a technology company. I think with this foundation and mutual respect, we can do more to address the issues AI will inevitably raise. There will be hard days, but this is essential for the future,” Smith said. Under US law, companies have the option to voluntarily recognise and negotiate with a union as soon as it signs up a majority of employees, or to instead hold out for an election conducted by the US National Labor Relations Board. Such NLRB elections can be contentious, with companies holding mandatory anti-union meetings for employees and unions exerting public pressure against union-busting. Microsoft’s approach has contrasted starkly with its Seattle-area neighbors Starbucks and Amazon. Both have waged years-long disputes with unions organizing their employees, and been accused by NLRB prosecutors of repeatedly violating workers’ rights. The companies have denied wrongdoing. Last week, Starbucks signaled it was moving in Microsoft’s direction, announcing a commitment to work with Starbucks Workers United to end hostilities and hash out a fair process for workers to organise. BLOOMBERG BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}