{
    "title": null,
    "date": "3/12/2024",
    "url": "https://www.americanbankingnews.com/2024/03/12/microsoft-co-nasdaqmsft-shares-bought-by-mutual-advisors-llc.html",
    "text": "Posted by ABMN Staff on Mar 12th, 2024 Mutual Advisors LLC lifted its stake in shares of Microsoft Co. (NASDAQ:MSFT – Free Report) by 5.2% in the 3rd quarter, according to its most recent 13F filing with the Securities and Exchange Commission. The fund owned 206,863 shares of the software giant’s stock after buying an additional 10,244 shares during the quarter. Microsoft comprises about 2.5% of Mutual Advisors LLC’s holdings, making the stock its 5th biggest holding. Mutual Advisors LLC’s holdings in Microsoft were worth $65,317,000 as of its most recent filing with the Securities and Exchange Commission. Several other institutional investors have also modified their holdings of the stock. Moneta Group Investment Advisors LLC raised its position in Microsoft by 112,158.6% in the 4th quarter. Moneta Group Investment Advisors LLC now owns 150,187,424 shares of the software giant’s stock valued at $36,017,948,000 after purchasing an additional 150,053,637 shares during the last quarter. Norges Bank purchased a new stake in Microsoft in the 4th quarter valued at $20,700,525,000. Aaron Wealth Advisors LLC increased its stake in Microsoft by 35,465.9% in the 1st quarter. Aaron Wealth Advisors LLC now owns 20,611,140 shares of the software giant’s stock valued at $66,852,000 after buying an additional 20,553,188 shares during the period. Morgan Stanley increased its stake in Microsoft by 14.0% in the 4th quarter. Morgan Stanley now owns 119,417,954 shares of the software giant’s stock valued at $28,638,815,000 after buying an additional 14,652,150 shares during the period. Finally, Osaic Holdings Inc. increased its stake in Microsoft by 348.6% in the 2nd quarter. Osaic Holdings Inc. now owns 11,998,927 shares of the software giant’s stock valued at $894,426,000 after buying an additional 9,324,182 shares during the period. Hedge funds and other institutional investors own 69.20% of the company’s stock. A number of research firms have recently weighed in on MSFT. BNP Paribas raised shares of Microsoft from a “neutral” rating to an “outperform” rating and set a $471.00 price target on the stock in a research note on Thursday, January 18th. Raymond James upped their target price on shares of Microsoft from $400.00 to $450.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Wells Fargo & Company increased their price objective on shares of Microsoft from $435.00 to $460.00 and gave the stock an “overweight” rating in a report on Wednesday, January 31st. StockNews.com lowered shares of Microsoft from a “buy” rating to a “hold” rating in a report on Thursday, February 22nd. Finally, Argus increased their price objective on shares of Microsoft from $390.00 to $430.00 and gave the stock a “buy” rating in a report on Tuesday, December 5th. Four analysts have rated the stock with a hold rating and thirty-six have issued a buy rating to the company’s stock. According to MarketBeat.com, the company currently has a consensus rating of “Moderate Buy” and an average price target of $415.00. Check Out Our Latest Analysis on Microsoft Shares of NASDAQ MSFT opened at $404.52 on Tuesday. The company’s 50 day simple moving average is $400.12 and its 200 day simple moving average is $366.47. Microsoft Co. has a fifty-two week low of $245.73 and a fifty-two week high of $420.82. The firm has a market capitalization of $3.01 trillion, a P/E ratio of 36.58, a P/E/G ratio of 2.16 and a beta of 0.89. The company has a debt-to-equity ratio of 0.19, a current ratio of 1.22 and a quick ratio of 1.20. Microsoft (NASDAQ:MSFT – Get Free Report) last issued its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 EPS for the quarter, topping analysts’ consensus estimates of $2.76 by $0.17. The business had revenue of $62.02 billion for the quarter, compared to analyst estimates of $61.14 billion. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. The firm’s quarterly revenue was up 17.6% on a year-over-year basis. During the same period last year, the business posted $2.32 earnings per share. On average, analysts predict that Microsoft Co. will post 11.63 EPS for the current year. In other Microsoft news, insider Bradford L. Smith sold 45,000 shares of Microsoft stock in a transaction dated Friday, February 2nd. The shares were sold at an average price of $411.78, for a total value of $18,530,100.00. Following the completion of the sale, the insider now owns 574,129 shares in the company, valued at approximately $236,414,839.62. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. In other news, insider Bradford L. Smith sold 45,000 shares of the business’s stock in a transaction that occurred on Friday, February 2nd. The shares were sold at an average price of $411.78, for a total value of $18,530,100.00. Following the completion of the transaction, the insider now directly owns 574,129 shares in the company, valued at approximately $236,414,839.62. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this link. Also, insider Bradford L. Smith sold 3,303 shares of the business’s stock in a transaction that occurred on Monday, February 5th. The shares were sold at an average price of $406.12, for a total transaction of $1,341,414.36. Following the completion of the transaction, the insider now owns 570,826 shares of the company’s stock, valued at $231,823,855.12. The disclosure for this sale can be found here. In the last 90 days, insiders sold 1,048,303 shares of company stock valued at $21,821,514. Company insiders own 0.03% of the company’s stock. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Apple Inc. (NASDAQ:AAPL) Stock Position Lessened by O ROURKE & COMPANY Inc Gotham Asset Management LLC Sells 6,751 Shares of Open Lending Co. (NASDAQ:LPRO) "
}