{
    "title": "Microsoft picks IIT-Madras alumnus Pavan Davuluri to lead Windows and \nSurface teams",
    "date": "3/25/2024",
    "url": "https://www.businesstoday.in/technology/news/story/microsoft-picks-iit-madras-alumnus-pavan-davuluri-to-lead-windows-and-surface-teams-422812-2024-03-26",
    "text": "Feedback Microsoft has chosen Pavan Davuluri, a company veteran and an alumnus of the Indian Institute of Technology (IIT), Madras, to lead its Windows operating system and Surface devices teams. Davuluri, who joined Microsoft in 2001, has been serving as the corporate vice president for almost three years. He is now taking on additional responsibilities after the departure of Panos Panay to Amazon last fall. Davuluri’s promotion comes a week after Microsoft announced the hiring of former DeepMind co-founder Mustafa Suleyman as the head of Microsoft AI. Mikhail Parakhin, CEO of advertising and web services, and his unit that includes people working on the Bing search engine and Edge browser, will be part of Microsoft AI. Parakhin will now explore other roles and report to Kevin Scott, Microsoft’s technology chief, as per a memo by executive Rajesh Jha which was cited by The Verge. Windows continues to be a critical part of Microsoft. Its clients consider their reliance on Windows when deciding which cloud infrastructure to use for their IT projects. This remains true even as Microsoft and other public companies adjust their strategies to work on the growing interest in generative artificial intelligence. Who is Pavan Davuluri? Davuluri graduated from IIT Madras and then pursued a Master of Science degree at the University of Maryland in the United States in 1999. He has been a part of Microsoft since the start of his career, beginning as a Reliability Component Manager in 2001. Throughout his career journey, Davuluri has held various positions at Microsoft. His most recent role prior to this promotion was as Corporate Vice President, overseeing Windows Silicon and Systems Integration. In his new position, Davuluri will lead a team focused on developing silicon systems. Last week, Microsoft unveiled its first Surface PCs with a Copilot button for quickly accessing the chatbot in Windows. “I’m incredibly proud of the team for the work they did to bring these devices and experiences to life for our customers,” Davuluri wrote in a post on X, formerly known as Twitter.  Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}