{
    "title": "Save an extra 20% on Microsoft Office with this code",
    "date": "3/7/2024",
    "url": "https://boingboing.net/?p=1006117",
    "text": "TL;DR: Until March 10th, you can save an extra 20% on Microsoft Office Home & Business for Mac 2021 or Microsoft Office Professional 2021 for Windows for just $55.99 (reg. $219) with coupon ENJOY20. Forget recurring fees with a license to your favorite productivity suite able to be installed on one device as a one-time purchase. Through March 10th, you can save an extra 20% on Microsoft Office Home & Business for Mac 2021 or Microsoft Office Professional 2021 for Windows for just $55.99 (reg. $219). Each of these licenses is good for a one-time download on either a Mac or Windows computer. From there, you can indefinitely access these well-known office production software apps. This wide range of tools could theoretically support a wide range of business and educational needs. So this limited-time price drop could represent a slim window where you can spend less on programs that you'll need in your life one way or another. Mac users will need to make sure to update their OS to Version 12 Monterey, or newer. Windows users will want to use Windows 10 or 11, both of which are available for remarkably affordable rates while also offering favorable security and usability features. For those who appreciate signs of quality, you might like to know that this deal is rated an average of 4.8/5 stars from over 665 reviews on the Boing Boing Store. One recent user put it well by writing, \"I loved the quick access and price for this product.\" Until 11:59 PM PT on March 10th, save an extra 20% on these license: StackSocial prices subject to change. TL;DR: If you're looking to soup up your Tesla even more than it already is, this USB-C Docking Station for the Model 3 from 2021-2023 can be your next favorite toy. It's here…        READ THE REST TL;DR: If you're looking for an affordable website hosting service, we have a solution for you. This lifetime hosting subscription to a Bono Host Unlimited Plan is price dropped to $59.97 (reg. $1614)…        READ THE REST TL;DR: Give an old car a tech transformation with this 9\" Wireless Car Display with Apple CarPlay/Android Auto Compatibility & Phone Mirroring. Usually $179, you can grab it for just $99.97 until…        READ THE REST TL;DR: Revamp your digital world with this incredible lifetime license to Microsoft Windows 11 Pro, with its seamless interface and top-notch security, for only $29.97 (Reg. $199) until 11:59 PM on 1/07.…        READ THE REST TL;DR: Save over $350 on a refurbished Apple iPad Pro 10.5\" 256GB, plus a free accessories bundle, with this sweet deal on sale for just $315.99 right now.  Tech fans, it's time…        READ THE REST TL;DR: The perfect last-minute holiday gift for an aspiring rocker, the 2024 Guitar Lessons Training Bundle is only $15.97 (Reg. $480) until 11:59 PM on 12/25. It's really never too late to make…        READ THE REST Read the rules you agree to by using this website in our Terms of Service. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program\n                        designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites. Boing Boing uses cookies and analytics trackers, and is supported by advertising, merchandise sales\n                        and affiliate links. Read about what we do with the data we gather in our Privacy Policy. Who will be eaten first? Our forum rules are detailed in the Community Guidelines. Boing Boing is published under a Creative Commons license except where otherwise noted. Privacy Manager "
}