{
    "title": "Russian businesses get shut out from Microsoft cloud services at the end of \nthis month – new EU sanctions come into ...",
    "date": "3/24/2024",
    "url": "https://www.tomshardware.com/software/russian-businesses-get-shut-out-from-microsoft-cloud-services-at-the-end-of-this-month-new-eu-sanctions-come-into-effect",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Individual customers remain unaffected for now. To comply with the EU regulations outlined in December 2023, Microsoft will cease the provision of cloud services to Russian organizations at the end of this month. This was originally meant to happen on March 20, but extra time has been given to impacted organizations to migrate to alternative solutions. As a result of the above implementation of EU sanctions, organizations in Russia will no longer have access to best-in-class Microsoft products including Office 365 apps, OneDrive, Microsoft Teams, Azure, SharePoint, Visual Studio, SQL Server, as well as LinkedIn apps and Media Player development kits. There have been no reports indicating that Microsoft will be restricting its cloud services to individuals, and hence they remain accessible to the general Russian public for now. Meanwhile, the Russian government has made efforts to promote domestic alternatives to ensure the continued smooth operations of private companies and organizations. The Russian Ministry of Digital Transformation, Communication, and Mass Media anticipated this kind of move by foreign cloud service providers like Microsoft, Amazon, Google, and Oracle. Thus, last year it started to advise Russian organizations to make the transition to domestically made alternatives. No specific domestic alternatives were named or pointed to - so we don't know how the affected organizations will cope. The EU regulations specifically mention imposing a ban on providing software for managing a wide range of essential business operations. This latest imposition of sanctions comes as a result of Russia's war against Ukraine, and the aggression which has continued for over two years. Sanctions are usually used against countries in such situations with some success. Typically some tech products avoid sanctions by being shipped via third-party distributors and sold in Russia, but other important sanction policies cannot be circumvented, such as the SWIFT ban preventing online transactions via banks. On the hardware side of tech, reports suggest that China and Russia still enjoy component imports for chipmaking equipment, PCs, and servers. Interestingly the sanctions have also provided profits for scalpers from other nations, and we have seen some smugglers get caught, their goods confiscated, and facing likely legal proceedings. Meanwhile, it is thought some Russian entities subscribe to Microsoft cloud services using foreign accounts or using other bypass methods. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. New Windows Insider build gets rid of annoying watermark, adds Copilot support for local accounts Google keeps trying to force feed me its hideous new Chrome design. Here's how to revert to the classic one. TSMC is on a hiring spree to recruit 23,000 employees  — comes amid explosive multi-continent expansion By Avram PiltchMarch 28, 2024 By Les PounderMarch 28, 2024 By Jarred WaltonMarch 28, 2024 By Aaron KlotzMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Ash HillMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}