{
    "title": "Microsoft and OpenAI plan to build a $100 billion supercomputer to power \nartificial intelligence: report",
    "date": "3/29/2024",
    "url": "https://ca.movies.yahoo.com/microsoft-openai-plan-build-100-001149249.html",
    "text": "Microsoft and OpenAI are working on a $100 billion supercomputer, according to The Information. The project could launch as soon as 2028 as part of the companies' five-phase plan. The US-based supercomputer, known as Stargate, would far exceed current computing power. Microsoft and OpenAI are planning an unprecedented supercomputer that uses millions of specialized server chips and could cost up to $100 billion, The Information reported this week. The US-based supercomputer, known as \"Stargate,\" would be the centerpiece of a five-phase plan focused on a series of supercomputer installations the companies plan to build in the next six years, the outlet reported. Stargate, which would be phase 5 of the plan, could launch as soon as 2028, people involved in the proposal told The Information. Executives at both companies have already drawn up plans for the data center project, which would power OpenAI's artificial intelligence, according to the outlet. A spokesperson for Microsoft declined to comment directly on the report but highlighted the company's demonstrated ability to build pioneering AI infrastructure. \"We are always planning for the next generation of infrastructure innovations needed to continue pushing the frontier of AI capability,\" a representative for the company told Business Insider. OpenAI did not immediately respond to a request for comment from BI. Microsoft, which has already committed more than $13 billion to OpenAI, would likely provide funding for Stargate, per the report. OpenAI currently uses Microsoft data centers to power its generative AI system ChatGPT in exchange for Microsoft having exclusive rights to resell OpenAI's technology to its own customers. Microsoft insiders told Business Insider earlier this month that the company's strategy has increasingly focused on its work with OpenAI, leading some to worry that Microsoft is essentially becoming an IT department for the startup. The supercomputer could be 100 times more expensive than the largest data centers currently in operation, per the report. The project signals the massive amount of money likely to be poured into the industry as artificial intelligence continues to evolve in the coming years. Stargate also has the potential to far exceed the computing power currently supplied by Microsoft to OpenAI from its data centers around the country but would require at least several gigawatts of power to do so, The Information reported, Microsoft's involvement in the project, however, hinges on OpenAI fulfilling its promise to boost its AI's capabilities, a source told the outlet. The quest to obtain the necessary server chips is the primary factor driving Stargate's hefty price tag, according to the report. Finding enough energy sources to power the project could also pose challenges, and the two companies have talked about possibly using alternative power sources like nuclear energy, sources said. The demand for AI chips has reached a fever pitch, allowing a select few companies — primarily Nvidia — to control the market. Altman has expressed frustration with the \"brutal\" situation and signaled earlier this year that he wants to make his own. The chip dilemna is just one of several details that still need to be ironed out with regard to Stargate. People familiar with the project told The Information that Microsoft needs to figure out how to put more GPUs into a single rack than it currently does in order to boost the chips' performance. The company also needs to find a way to prevent the chips from overheating, according to the report. It's not clear where Stargate would be located or whether it would be built in just one data center or several nearby centers, The Information reported. Read the original article on Business Insider A man suspected of using guns and explosives to hold four people hostage in a Dutch cafe was detained by police on Saturday, after a dramatic hours-long standoff that involved scores of armed police and a remote-controlled robot. WASHINGTON (AP) — As Donald Trump campaigns on promises of mass deportations and pardons for those convicted in the Jan. 6, 2021, riot at the Capitol, his ideas are being met with little pushback and some enthusiasm by a new era of Republicans in Congress. It’s a shift from the first time around when the presumptive Republican presidential nominee encountered early skepticism and, once in a while, the uproar of condemnation. Rather than being dismissed as campaign bluster or Trump speaking his m  Follow the latest updates from St James' Park as the Premier League returns From the outside, Johannesburg does not look like it is doing well. Nearly four in five NASUWT teacher members in England said they do not support moving to a national statutory ballot for industrial action. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Exclusive: Senior officers tried to set up a food bank for recruits as figures reveal scale of police food poverty The siblings, 34, posted several videos on TikTok Friday Investigator footage provided glimpses from inside the Dali cargo ship that collided with the Francis Scott Bridge in Baltimore on Tuesday, March 24, causing it to collapse.The footage, filmed by the National Transport Safety Board (NTSB) on March 28 and released a day later, shows investigators inspecting the damage from inside the container vessel. The NTSB said those aboard downloaded the voyage data from the ship.NTSB chair Jennifer Homendy previously told NBC that the investigation could take up to two years to complete. Credit: NTSB via Storyful Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... With March Madness in full swing, you may have seen a funny AT&T commercial that showcases Kendrick Perkins, Carmelo Anthony, and TJ Ford, players from the 2003 NBA Draft. In partnership with AT&T, Perk took some time out of his hectic schedule to ... Follow all the live action from the 2024 Boat Race in the blog below Spurs welcome the Hatters to town looking to get back on track  Tesla is the worst S&P 500 stock in 2024 as analysts slash earnings estimates. China EV giant BYD is ramping up a price war. LMPD: Man shot several times in The Highlands area following vehicle crash, argument Inconsistent Blues hope to enjoy home comforts against relegation contenders If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens Meteorologist Taylor Cox shows calmer wind today, but breezy for tomorrow, then storms on Monday. The Blues look to extend a strong run at Stamford Bridge The enigmatic masked trio from Melbourne hypnotise with a psychedelic fusion of Aussie surf rock and traditional Indian music Play this game for 1 minute and see why everyone is addicted. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" As Germany authorises the consumption and cultivation of cannabis from 1 April, the mayor of Strasbourg is calling for the introduction of a local 'experiment' to move away from France's repressive approach to marijuana. According to Mayor Jeanne Barseghian: \"In a shared catchment area, we are going to have two different sets of regulations, almost diametrically opposed, between Germany, which authorises the recreational use of cannabis, and France, which has one of the most repressive sets of l The Emmy nominee tells PEOPLE she and the actor \"have a very lovely friendship\" that feels like \"we've known each other for many lifetimes\" "
}