{
    "title": "Meta to operate \"600000 H100 GPU equivalents of compute\" by year-end",
    "date": "1/18/2024",
    "url": "https://www.datacenterdynamics.com/en/news/meta-to-operate-600000-gpus-by-year-end/",
    "text": "Including 340,000 H100 Nvidia GPUs at its data centers Meta expects to field a fleet of 600,000 GPUs by the end of 2024. CEO Mark Zuckerberg told The Verge that the number includes some 340,000 Nvidia H100s, alongside A100s and other AI chips. Update: In a video, he clarified that the company would operate \"600,000 H100 equivalents of compute\" - suggesting a higher total number of GPUs. “We have built up the capacity to do this at a scale that may be larger than any other individual company,” Zuckerberg said of the company previously known as Facebook. “I think a lot of people may not appreciate that.” He added: “We’ve come to this view that, in order to build the products that we want to build, we need to build for general intelligence. I think that’s important to convey because a lot of the best researchers want to work on the more ambitious problems.” The pivot to AGI comes after an expensive and, as yet, unsuccessful effort to build a metaverse. The company is continuing to spend around $15 billion a year on both the metaverse and virtual reality hardware. To support its aggressive push into AI, Meta last year overhauled its data centers, canceling in-development projects as it rolled out a new design. That caused Meta's capital expenditure costs to dip in the last quarter by $3bn compared to the year before. It spent $6.8bn in Q4, for a total of $27-29bn for 2023. This year it expects to spend somewhere in the range of $30-$35bn, with growth driven by investments in servers – including both non-AI and AI hardware – and in data centers as the company ramps up construction on sites with its new data center architecture. \"We've now gone to market with our design, and the sort of response we've gotten back has given us confidence that our projections are coming to fruition,\" Alan Duong, Meta’s global director of data center engineering, told DCD for a profile on the new data center design. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}