{
    "title": "Ansys (ANSS) Elevates AV Simulation With NVIDIA Integration",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/ansys-anss-elevates-av-simulation-131000449.html",
    "text": "Ansys ANSS revealed that its AVxcelerate Sensors will merge with NVIDIA DRIVE Sim, which is an AV simulator leveraging NVIDIA Omniverse, the platform for Universal Scene Description applications. The integration aims to grant users access to high-fidelity sensor simulation outputs from Ansys AVxcelerate Sensors. These outputs will aid in training and validating the perception of advanced driver assistance systems and autonomous vehicles (AV) systems. The two companies aim to tackle the challenge of ensuring the safety and reliability of AVs that demand extensive testing and validation of sensor suites and software in real-world scenarios, including critical edge cases. The future of AVs relies on highly realistic, scalable simulations to test and validate sensor and software performance in a controlled virtual environment. ANSYS, Inc. price-consensus-chart | ANSYS, Inc. Quote The collaboration between NVIDIA and Ansys bridges the gap between reality and simulation. Ansys AVxcelerate Sensors will complement NVIDIA DRIVE Sim's 3D environments with accurate physics solvers for camera, lidar, and radar sensors. This integration enables DRIVE Sim users with an AVxcelerate Sensors license to efficiently develop, train, and validate AV perception systems that significantly save time and costs. The platform leverages NVIDIA's powerful GPU capabilities and artificial intelligence (AI), which facilitate rapid prototyping and efficient algorithm refinement for AVs. NVIDIA Omniverse's open ecosystem approach, utilizing OpenUSD-based 3D workflows, allows developers to create scalable simulations and act as a data factory for AI model training. Ansys develops and globally markets engineering simulation software and services widely used by engineers, designers, researchers and students across a broad spectrum of industries and academia. The company is likely to benefit from rapid growth in the high-tech industry, led by ongoing development in AI and machine learning. The company’s robust product portfolio and cross-domain offering will continue to drive the customer base going ahead. ANSS currently carries a Zacks Rank #4 (Sell). Shares of Ansys have gained 48.6% in the past year compared with the sub-industry’s growth of 59.5%. Image Source: Zacks Investment Research Some better-ranked stocks worth considering in the broader technology space are Blackbaud BLKB, NETGEAR NTGR and Watts Water Technologies WTS. NETGEAR sports a Zacks Rank #1 (Strong Buy), while Blackbaud and Watts Water Technologies carry a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here. The Zacks Consensus Estimate for Blackbaud’s 2023 earnings per share (EPS) has inched up 1.8% in the past 60 days to $3.86. BLKB’s long-term earnings growth rate is 23.4%.Blackbaud’s earnings beat the Zacks Consensus Estimate in each of the last four quarters, the average surprise being 10.6%. Shares of BLKB have gained 52% in the past year. The Zacks Consensus Estimate for 2023 is pegged at a loss of 9 cents per share for NETGEAR, which remained unchanged in the past 30 days.NTGR’s earnings outpaced the Zacks Consensus Estimate in three of the last four quarters while missing once. The average surprise was 127.5%. Shares of NTGR lost 17% in the past year. The Zacks Consensus Estimate for Watts Water Technologies 2023 EPS has improved 3.9% in the past 60 days to $8.08. WTS’ earnings surpassed the Zacks Consensus Estimate in each of the last four quarters, the average surprise being 11.8%. Shares of WTS have soared 41% in the past year. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NETGEAR, Inc. (NTGR) : Free Stock Analysis Report Blackbaud, Inc. (BLKB) : Free Stock Analysis Report Watts Water Technologies, Inc. (WTS) : Free Stock Analysis Report ANSYS, Inc. (ANSS) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}