{
    "title": "Dow Jones Rises Ahead Of Today's Fed Decision, Powell; Google, Microsoft, \nNvidia, Tesla Sell Off",
    "date": "1/31/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/tech-falls-dow-jones-futures-rise-ahead-of-fed-decision-amd-google-microsoft-tesla-slide/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Tech stocks took a dive Wednesday, as Magnificent Seven stocks Alphabet (GOOGL) and Tesla (TSLA) sold off in morning trade, along with chip giant Advanced Micro Devices (AMD). But the Dow Jones Industrial Average rose as Wall Street braced for the Federal Reserve's interest rate decision. After the opening bell, the tech-heavy Nasdaq composite tumbled 1.5% in early action. The Dow Jones Industrial Average rose 0.1%, while the S&P 500 dropped 0.8%. Among U.S. exchange traded funds, the Nasdaq 100 tracker Invesco QQQ Trust (QQQ) was down 1.5%, while the SPDR S&P 500 ETF (SPY) lost 0.8%. The 10-year Treasury yield fell to 3.96% ahead of today's Fed decision. Further, oil prices threatened to give up Tuesday's gains, as West Texas Intermediate futures fell 0.7%. WTI futures traded above $77 a barrel. January's ADP private payrolls report missed estimates Wednesday morning, as it showed 107,000 jobs were added in January, far below the 145,000 Econoday estimate, vs. 164,000 in December. The Fed decision looms at 2 p.m. ET. That decision will be followed up by a news conference with Fed Chief Jerome Powell. The CME FedWatch Tool shows a 98% chance of the Fed keeping rates steady at the 5.25%-5.5% level. Alphabet reported fourth-quarter earnings and revenue that topped analyst estimates. But shares tumbled more than 6% as the search giant's core advertising business slightly missed views. AMD stock declined 4.2% after the company delivered mixed fourth-quarter results and offered an outlook that was lower than views for the current period. Microsoft (MSFT) beat Wall Street's targets for its fiscal second quarter thanks to strong cloud computing business. Still, shares reversed from early gains to fall 1.4% in morning trade. Other key earnings movers Wednesday include Boeing (BA), Mastercard (MA) and Starbucks (SBUX). Boeing shares rose around 3%, while Mastercard gained 2%. Starbucks stock climbed 0.5% in early trading. Elsewhere, Tesla stock sold off 1.5% after a Delaware judge voided Chief Executive Elon Musk's $56 billion compensation plan, siding with plaintiffs who argue that Tesla's board acted improperly in setting the pay deal. On Tuesday, the Dow Jones Industrial Average moved up 0.35% and the S&P 500 edged 0.1% lower. The tech-heavy Nasdaq composite declined 0.8%. Tuesday's Big Picture column commented, \"Making money in the stock market is trickier now than it was in early November when the Nasdaq composite and S&P 500 confirmed new uptrends with follow-through days. That's because there's no shortage of stocks extended past proper buy points.\" Now is an important time to read IBD's The Big Picture column amid the continuing stock market rally. Be sure to read how to adjust to changing market conditions, with IBD's new exposure levels. Learn How To Time The Stock Market With IBD's ETF Market Strategy DraftKings (DKNG), KKR (KKR), Novo Nordisk (NVO) and Snowflake (SNOW) — plus Dow Jones components Amgen (AMGN), Merck (MRK) and Walmart (WMT) — are among the best stocks to buy and watch in the current market rally. KKR and Walmart were featured in this Stocks Near A Buy Zone column. DraftKings is an IBD Leaderboard Watchlist stock, while KKR is on IBD SwingTrader. Get Real-time Buy And Sell Alerts On Stock Market Leaders With IBD Leaderboard Biotech leader Amgen rose 0.4% Tuesday, further out of the 5% buy range past a 288.46 official buy point in a flat base. The 5% buy area went up to 302.88. Amgen shares added 0.4% Wednesday. Drugmaker Merck is breaking out past a cup base's 119.65 buy point, according to IBD MarketSmith pattern recognition. Shares finished further above their entry amid a 0.3% climb Tuesday. Merck stock rose 0.8% Wednesday. Discount retail giant Walmart is in buy range past a 163.57 entry in a cup with handle, amid a four-day win streak. The stock was up 0.9% early Wednesday after the company declared a 3-for-1 stock split, its first since 1999. 4 Top Growth Stocks To Watch In The Stock Market Rally IBD Leaderboard Watchlist stock DraftKings rallied nearly 1% Tuesday, further past a double-bottom base's official buy point at 38.97. DraftKings stock dropped 1.4% Wednesday morning. IBD SwingTrader stock KKR broke out last week, moving above an 85.66 flat-base entry. Shares inched higher Wednesday morning. Novo Nordisk, the maker of weight-loss drugs, ended Tuesday unchanged, squarely above its 105.69 flat-base buy point. Novo shares rose 4.2% early Wednesday. Software leader Snowflake remains above a 202.83 buy point in a flat base despite a 1.65% drop Tuesday, according to IBD MarketSmith. Snowflake shares fell 2.2% Wednesday. IBD's latest newsletter MarketDiem gives you actionable ideas for stocks, options and crypto right in your inbox These are four best stocks to watch in today's stock market, including a Dow Jones leader. Magnificent Seven stock Nvidia (NVDA) lost 3% in morning action Wednesday. Nvidia rallied 0.5% Tuesday, more than 20% past a 505.48 buy point in a flat base after a Jan. 8 breakout. Shares set more record highs. Among Dow Jones stocks in the Magnificent Seven, Apple (AAPL) traded lower after Wednesday's stock market open. Apple stock fell 1.9% Tuesday, extending a losing streak to five sessions and closing below its 50-day line, a key support level. Shares are now about 6% away from their flat base's 199.62 buy point. Shares dropped 1.6% early Wednesday. Be sure to follow Scott Lehtonen on X, formerly known as Twitter, at @IBD_SLehtonen for more on growth stocks and the Dow Jones Industrial Average. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Nvidia, Tesla, Meta Reveal Rules For Santa Claus Rally And Beyond Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}