{
    "title": null,
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-stock-rocketed-080753404.html",
    "text": "Polen Capital, an investment management company, released its “Polen Focus Growth Strategy” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the quarter the fund returned 14.43% (net) compared to 14.16% for the Russell 1000 Growth Index and 11.69% for the S&P 500 Index. For the full year, the fund returned 38.99% (net) compared to 42.68% and 26.29% returns for the indexes. The firm had the second-highest return in the Portfolio's 35-year history in 2023.  In addition, please check the fund’s top five holdings to know its best picks in 2023. Polen Focus Growth Strategy featured stocks such as NVIDIA Corporation (NASDAQ:NVDA) in its Q4 2023 investor letter. Headquartered in Santa Clara, California, NVIDIA Corporation (NASDAQ:NVDA) provides computer graphics processors, chipsets, and related multimedia software. On January 19, 2024, NVIDIA Corporation (NASDAQ:NVDA) stock closed at $594.91 per share. One-month return of NVIDIA Corporation (NASDAQ:NVDA) was 21.83%, and its shares gained 209.96% of their value over the last 52 weeks. NVIDIA Corporation (NASDAQ:NVDA) has a market capitalization of $1.469 trillion. Polen Focus Growth Strategy stated the following regarding NVIDIA Corporation (NASDAQ:NVDA) in its fourth quarter 2023 investor letter: \"Apple and NVIDIA Corporation (NASDAQ:NVDA) alone drove over 1,100 basis points of the Russell 1000 Growth Index’s 42% return, so not owning them was a meaningful headwind to our relative return in 2023. NVIDIA shares rocketed higher by well over 200% in 2023 although they slightly underperformed our Portfolio and the Russell 1000 Growth in the fourth quarter. Generative AI has been a huge boon for NVIDIA as the use of LLMs like ChatGPT and others requires tremendous processing power that, today, is mostly provided by NVIDIA’s GPUs. All large cloud service providers, AI factories, and many large consumer internet companies are laying the foundation for generative AI by deploying NVIDIA GPUs and other parallel processing chips to be able to do large scale generative AI either for internal use (i.e., Meta) or as a service for others (i.e., AI factories) or both (cloud service providers such as Amazon, Microsoft, and Google). Given many of NVIDIA’s customers or its end customers are still very much in the experimentation phase with generative AI, it is unclear how sustainable the current demand for GPUs truly is. At the same time, it is known that NVIDIA has historically been highly cyclical. By the end of 2024, we believe NVIDIA will already account for roughly half the market for datacenter chips, servers, and networking equipment, which is unprecedented. Even though the valuation at 25x forward earnings doesn’t look very demanding at first glance, it assumes NVIDIA will own virtually the entire datacenter chip market in just the next few years and will sustain year-on-year growth despite being a cyclical business that is currently experiencing much higher new peaks. We believe NVIDIA is a highly advantaged business, but we also believe the long-term growth outcomes are currently too variable, and the expectations built into the company’s $1.2 trillion valuation as of this writing assume the most optimistic of those scenarios.\" Photo by Christian Wiediger on Unsplash NVIDIA Corporation (NASDAQ:NVDA) is in fifth position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 180 hedge fund portfolios held NVIDIA Corporation (NASDAQ:NVDA) at the end of third quarter which was 175 in the previous quarter. We discussed NVIDIA Corporation (NASDAQ:NVDA) in another article and shared the list of stocks that will make you rich in 5-10 years. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: Wall Street Analysts Just Trimmed Price Targets for These 10 Stocks 10 States with the Highest Muslim Population in the US Dividend Challengers List Ranked By Yield: Top 30 Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}