{
    "title": "Nvidia Poised for Continued Dominance in AI Infrastructure, Analysts \nForecast Robust Growth - NVIDIA (NAS",
    "date": "1/19/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36701086/nvidia-poised-for-continued-dominance-in-ai-infrastructure-analysts-forecast-robust",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Raymond James analyst Srini Pajjuri maintained Nvidia Corp NVDA with a Strong Buy and raised the price target from $600 to $700. The analyst noted that Nvidia’s dominant position in Gen AI infrastructure is unlikely to be challenged in the near term. Pajjuri expects strong double-digit revenue growth to continue on the back of the latest H200 and GH200 GPU ramps in 1H24 (35-60% ASP premium over H100) and upcoming B100 ramps in 2H24. In addition, the company is expanding its product portfolio to offer compliant solutions for China and other restricted markets, which could help recapture some of the lost opportunity, the analyst flagged. While a potential pause in customer spending ahead of B100 (“Blackwell”) architecture presents some risk, AI proliferation across industry verticals and sovereign AI investments should help keep any slowdown temporary and modest, Pajjuri said. As per the analyst, any near-term impact from competitive GPUs and in-house solutions should also be modest given the rapidly growing Gen AI demand and the company’s significant Software moat, especially in public Cloud workloads. PC Gaming business is faring well, and the analyst found it likely for Nvidia to expand into ARM PC processors to target on-device AI applications. Pajjuri noted the $15-$20 earnings power in the calendar year 2025, even in case of a temporary 1-2 quarter spending pause by Data Center customers. At ~30x that number, the analyst noted that valuation is already discounting a potential digestion period to a large extent (5-year average P/E 40x). The analyst projected an FY23 revenue and EPS of $58.83 billion and $11.08. Price Action: NVDA shares traded higher by 3.43% at $590.65 on the last check Friday. Image Via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}