{
    "title": "2 Super Semiconductor Stocks (Besides Nvidia) to Buy Hand Over Fist in 2024",
    "date": "1/16/2024",
    "url": "https://www.fool.com/investing/2024/01/16/2-semiconductor-stocks-nvidia-buy-hand-fist-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Artificial intelligence (AI) is a dominant stock market theme right now. The technology wouldn't be possible without advanced semiconductors, which is why Nvidia stock soared 239% in 2023, making it the top performer in the S&P 500. Nvidia's industry-leading data center chips remain in hot demand, but 2024 might be the year several other semiconductor stocks benefit from the AI revolution. The data center will remain critical to developing AI, but the technology is quickly progressing to edge devices, like computers and smartphones, creating an entirely new opportunity. Here's why investors might want to buy shares of Advanced Micro Devices (AMD 0.50%) and Micron (MU -1.04%) this year. AMD is one of the most important chip companies in the world. Its hardware is prevalent in some of the most popular consumer electronics, including the Microsoft Xbox and Sony PlayStation 5, and AMD chips power the infotainment systems in Tesla's electric vehicles. AMD also has a data center segment where it sells chips to cloud providers, but last year, it took an enormous leap forward by announcing its new MI300 lineup. Its MI300X is a stand-alone graphics processing unit (GPU) designed to compete with Nvidia's leading H100. In contrast, its MI300A combines GPU and central processing unit (CPU) hardware to create the world's first accelerated processing unit (APU) for data centers. The MI300A is already shipping to the Lawrence Livermore National Laboratory, where it will power the upcoming El Capitan supercomputer expected to be one of the most powerful in the world. AMD will begin shipping the MI300 lineup more broadly in 2024, and the company says it could generate $2 billion in revenue for the year -- it will be the fastest product to reach $1 billion in revenue in AMD's history. But AMD is also focusing on edge computing. Its new Ryzen 7000 series of chips brings AI to personal computers. Most AI applications are processed in the data center (in the cloud), but advancements in chip design will soon make computers powerful enough to handle AI workloads within a device. Instead of the user deliberately accessing AI, it will soon be automatically embedded across all personal computing facets. Ryzen AI chips already power 50 notebook computer designs, with more to come thanks to a collaboration with Microsoft, which will make the Windows operating system more AI-friendly going forward. AMD will report its 2023 full-year results in February. The company's revenue is expected to shrink by 4% year over year to $22.6 billion, mainly driven by sluggish results in its consumer-focused Client segment. Tough economic conditions led to weak sales of computers and devices, but that trend reversed in the most recent quarter, a good sign for 2024. AMD's hot new lineup of AI hardware should drive the company back to revenue growth this year in what could be one of its best annual results ever. Micron is a chipmaker like AMD, but it makes very different hardware. Micron is a world leader in memory (DRAM) and storage (NAND) chips, which aren't as glamorous as the GPUs sold by AMD and Nvidia but are equally important to edge devices and the data center. In mid-2023, Micron launched a new high-bandwidth memory chip, called HBM3E, for data centers. Nvidia chose the chip to power its brand-new H200 GPU set to extend its advantage over the competition. With respect to multimodal generative AI models -- those capable of creating text, images, videos, and computer code -- HBM3E can reduce training time by 30% because it can process over 50% more queries each day than competing hardware. HBM3E also consumes 30% less power, so it's not only faster but also far cheaper for data center operators to run. But Micron is preparing for a world where AI is everywhere. The company says AI-enabled industrial computers, for example, require 3 to 5 times more memory than their standard counterparts. Therefore, they demand more advanced DRAM chips, which sell at a higher price and drive more revenue for providers like Micron. Micron's revenue collapsed by 50% in fiscal 2023 (ended Aug. 31). Much like AMD, it suffered sluggish consumer segments, like personal computing, which caused an inventory glut and plunging prices. But the fiscal 2024 first quarter (ended Nov. 30) was a different story. Micron's revenue jumped 16% year over year, which included a 45% sequential increase in its compute and networking segment. The latter result was driven specifically by AI-related data center chip demand. Micron expects the sluggish consumer segments from fiscal 2023 to rebound this year, and Wall Street's early estimates point to an impressive 45% increase in the company's total revenue in fiscal 2024. Moreover, the Street thinks Micron's revenue will grow by another 41% in fiscal 2025, reaching an all-time high of $32 billion. AI is a long-term opportunity and could drive significant demand for chips well into the future. With Micron stock trading 15% below its all-time high, now could be an opportune time for investors to buy. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}