{
    "title": null,
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/news/did-magnificent-seven-just-become-112700707.html",
    "text": "The S&P 500 index delivered a gain of 24.3% last year, but it was led higher by a group of stocks dubbed the \"Magnificent Seven.\" This cohort includes: Nvidia (NASDAQ: NVDA) Meta Platforms (NASDAQ: META) Tesla (NASDAQ: TSLA) Amazon (NASDAQ: AMZN) Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) Microsoft (NASDAQ: MSFT) Apple (NASDAQ: AAPL) The companies have a combined market value of $12.7 trillion, and here are the staggering returns they delivered in 2023: But 2024 is a new year, and one of the Magnificent Seven is stumbling. Tesla stock plunged in January due mostly to a disappointing financial report for the fourth quarter of 2023. Tesla's stock performance in 2024 so far is in stark contrast to its Magnificent Seven peers: CNBC personality Jim Cramer, who coined the FAANG acronym in 2017 to describe another group of tech stocks leading the market at the time, now believes Tesla should be booted from the Magnificent Seven. He came up with another name for the group: the \"Super Six.\" I think that stance makes sense in the short term, but here's why Tesla should retain its membership in the Magnificent Seven over the long term. Tesla was the world's largest electric vehicle (EV) company by sales up until the end of 2023 when it was overtaken by China-based BYD. It seemed like Tesla had the entire EV market to itself for years, but new start-ups and legacy automakers have now established themselves in the industry. Tesla delivered 1.2 million of its Model Y EV in 2023, making it the best-selling car globally across all categories. However, the company's share of U.S. EV sales overall fell to a record low of 55%, down from 65% in 2022. Even though the EV market continues to grow, consumers have more choices than ever, so Tesla's dominance is slowly fading. The other challenge Tesla faced in 2023 was softening demand. High interest rates crimped consumer spending and sent monthly car payments soaring, which priced many potential buyers out of Tesla ownership. The company slashed the sticker prices of its entire lineup by an average of 25.1% throughout the year to offset the economic headwinds, which helped the EV maker hit its annual sales target of 1.8 million vehicles in total. But 2024 could be even tougher. Tesla failed to issue any sales guidance, leaving investors in the dark. Analysts believe the company will sell 2.2 million vehicles, but that would represent an increase of just 22% compared to 2023, which is substantially below CEO Elon Musk's long-term annual growth target of 50%. Tesla is now focused on developing a new EV at a lower price point (rumored to be around $25,000) to suit lower-income consumers. Production is expected to begin in 2025, and Musk thinks it will ignite a new wave of growth for the company's core business. Tesla's core business might be struggling, but the company is a leading developer of fully autonomous self-driving software (FSD), which is powered by artificial intelligence (AI). Late last year, Musk said Tesla customers had completed over 500 million miles in the real world using beta versions of FSD. Since data is king when developing AI, that makes Tesla's technology arguably the most advanced in the industry. In his Q4 conference call with investors, Musk highlighted the release of FSD version 12, which features an entirely new architecture. Over 330,000 lines of traditional computer code were replaced with neural networks, which means AI is now more involved in actual real-world decision-making. That will be key in complex driving situations that Tesla's FSD software hasn't encountered before. Musk also revealed plans to ship early models of Tesla's humanoid robot, Optimus, next year. That's another piece of hardware powered by AI, and it could have a profound impact on the broader economy by replacing human workers in jobs like manufacturing. Robots would allow facilities to operate 24 hours per day, seven days a week, which would significantly boost productivity. AI is one of the main reasons the Magnificent Seven stocks performed so well in 2023. Nvidia shares tripled in value thanks entirely to its data center chips, which were designed for AI workloads. Similarly, Microsoft and Amazon both invested billions of dollars into leading AI start-ups while also developing their own large language models (LLMs), applications, and even chips in-house. Meta Platforms is using AI to curate the content feeds of its 3.1 billion daily users on Facebook and Instagram, which is increasing engagement. Alphabet is improving Google Search with AI, and Google Cloud now offers its business customers more than 100 LLMs to help them develop AI applications faster. Even Apple is diving into the world of AI. Its new iPhone 15 Pro features the A17 Pro chip, which can handle AI workloads on-device. The company is developing LLMs in-house, and is rumored to be working on an AI chatbot application that could make full use of that new hardware. Here's the bottom line: Tesla stock could suffer more downside in the short term while its EV sales slow, but technology and AI are the reasons it was included in the Magnificent Seven in the first place. After all, Ford, General Motors, and Rivian have invested heavily in EVs yet they are never discussed alongside companies like Nvidia or Microsoft -- but Tesla is. FSD, AI, and robotics could transform Tesla's economics over the long term, which is why the stock should remain in the Magnificent Seven -- at least until something changes on those fronts. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the ten best stocks for investors to buy right now... and Tesla made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks  *Stock Advisor returns as of January 22, 2024  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, BYD, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy. Did the \"Magnificent Seven\" Just Become the \"Super Six?\" was originally published by The Motley Fool Related Quotes "
}