{
    "title": "Is Nvidia Really an Expensive Stock in 2024?",
    "date": "1/11/2024",
    "url": "https://www.fool.com/investing/2024/01/11/is-nvidia-really-an-expensive-stock-in-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) had an epic 2023 as it rode the wave of new generative AI infrastructure. Demand was insatiable. AI chip sales -- logged under its \"Data Center\" segment -- soared from $3.6 billion in Q4 fiscal 2023 (which ended Jan. 2023) to $14.5 billion nine months later in Q3 fiscal 2024 (ended Oct. 2023). Chart source: Nvidia. Chart highlights on Data Center by author. Based on management's guidance, revenue for full-year fiscal 2024 (ending in Jan. 2024) will come in at roughly $59 billion, a massive increase from $27 billion in the year prior. However, it's a meager amount for a company that currently touts a market capitalization of $1.2 trillion. How expensive is Nvidia stock as 2024 gets underway? There is quite the disconnect between Nvidia's revenue and that of the other few companies that have surpassed the $1 trillion market cap milestone (all of which are part of the so-called \"Magnificent Seven\"). Even assuming Nvidia has already reported full-year results and has achieved the $59 billion in sales it's forecasting, it's still a very distant fourth place behind the other tech giants with a $1 trillion market cap.  Data by YCharts. To understand why Nvidia is getting a pass for this very rich valuation, remember that it's in the driver's seat of a massive new secular growth trend: the buildout of AI and general-purpose accelerated computing infrastructure, primarily in data centers. It's currently estimated that the world's existing data centers (both for public cloud and for private business use) are worth about $1 trillion. But Nvidia CEO Jensen Huang, as well as others inside and outside the semiconductor industry, have stated a belief that new data centers powered by accelerated computing (Nvidia's longtime specialty) are rapidly being built to either replace or augment that existing $1 trillion market. That data center computing infrastructure needs to be replaced every five years or so (equating to about $200 billion in annual spending), plus or minus a year or two depending on usage, technology upgrade trends, economic conditions, and so on. And as we're early on in this upgrade cycle fueled by AI, there's a belief among some on Wall Street that data center upgrades will continue at a rapid pace in 2024 and push that total global data center value far beyond $1 trillion. Even Huang and the top team at Nvidia have stated an expectation that data center revenue will continue to rise sequentially throughout 2024 (fiscal year 2025 for Nvidia), driven by more AI use cases. In addition to AI, Nvidia also provides ample amounts of equipment to traditional data center operators. And let's not forget the company's other sales segments, two of which (\"Gaming\" and \"Professional Visualization\") could catch a strong tailwind as the PC market downturn of the last year-plus has bottomed and is showing signs of life again. Together, these two PC-oriented segments could generate significant sales this year (Gaming and Professional Visualization hauled in $8.7 billion during the first nine months of fiscal 2024, and neither were in top form). Chart source: Nvidia. Chart highlights on Gaming and Professional Visualization by author. All told, this is what Wall Street analysts are thinking about when they give Nvidia a consensus revenue estimate of over $90 billion for fiscal 2025. And with the general conclusion that there will be plenty more accelerated computing market expansion over the next five to 10 years, it explains why Nvidia fetches a significant premium. There's another important reason investors are giving the stock a pass on its rich valuation: profit potential. The company is the world's most valuable semiconductor business, but there's far more going on these days. Huang has helped direct Nvidia into a \"full-stack computing\" business, running the gamut from hardware design to software development and subscription sales. In fact, of those companies with a $1 trillion-plus value, Nvidia currently cranks out more cash as a percentage of total sales than even software giant Microsoft (software tends to generate higher margins than hardware). Granted, Nvidia's historically hardware-based sales and profitability are far more cyclical than Microsoft's, but Nvidia's profit potential is nevertheless impressive.  Data by YCharts. Few semiconductor companies even come close to matching Nvidia in this department. AMD and Intel, both of which many investors hope can make some AI hay of their own even though they lag far behind in the software department, pale in comparison when it comes to operating margin and free cash flow generation.  Data by YCharts. Based on its explosive growth and high rates of profitability, Nvidia stock trades for about 26 times one-year-forward expected earnings as of this writing. By comparison, the S&P 500 index trades for about 21 to 22 times expected earnings. Perhaps Nvidia stock isn't as expensive as it appears. Of course, investors should also consider that at some point, a downturn will come for the accelerated computing market -- just as such cyclical downturns tend to crop up every few years for other enterprise computing markets, PCs, and smartphones. Perhaps by the end of 2024 it will become apparent if such a downturn is imminent. Either way, that's a big reason to be prudent with Nvidia stock right now, even though the valuation may look somewhat reasonable based on full calendar year 2024 earnings estimates. Beyond this growth cycle, though, and looking at Nvidia's evolution into a full-blown tech giant and software platform, there are plenty of reasons to like the stock for the long term. This is a top-notch semiconductor and AI software business to invest in for 2024, assuming your investment time horizon accounts for inevitable bumps down the road. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Nicholas Rossolillo and his clients have positions in Advanced Micro Devices, Amazon, Apple, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}