{
    "title": "Kai-Fu Lee predicts overhaul of China's AI industry amid preparation to \nadopt domestic AI chips",
    "date": "1/4/2024",
    "url": "https://www.digitimes.com/news/a20240103PD215/01.ai-ai-china-nvidia.html",
    "text": "Credit: AFP Lee's startup 01.AI reached the US$1 billion unicorn mark last year after receiving investment during its latest funding round from China's Alibaba and Lee's Beijing-based company Sinovation Ventures. In a recent interview with the media outlet, The Information, Lee predicted that the Chinese AI industry is going through the \"qualifying round\" and after a major reshuffle, only a few major winners will remain. He also pointed out that despite 01.AI's reserves of high-end Nvidia AI GPUs for the next 18 months, the company is exploring how to incorporate Chinese domestic AI chips in the future, along with the tasks of rewriting program designs. 01.AI went on an Nvidia chip buying spree in 2023 in anticipation of US sanctions preventing the sale of high-end chips to China, where 01.AI is based. Speaking to Bloomberg in November last year, Lee said that his company had stockpiled enough chips for up to 18 months. Lee has long expressed confidence in China's potential to take the lead in AI. Outlining his reasoning in his 2017 book \"AI Superpowers\", Lee wrote, \"If data is the new oil, then China is the new Saudi Arabia.\" However, when speaking with Bloomberg, he stuck a more cautious tone. He said, \"The jury is out on whether China in 1.5 years can make equivalent or nearly as good chips [as Nvidia's]\". Covering all bases, Lee's AI unicorn is researching how to introduce Chinese domestic AI chips. However, he accepts that this will be a challenging task as Nvidia's chips are outstanding, and their strength lies in building a complete ecosystem around their CUDA software library, making program design relatively straightforward. Lee noted that engineers might balk at the suggestion of using none non-Nvidia chips, as their efficiency could take a hit. Although this challenge may only emerge after 18 months, he said. Nevertheless, Lee is preparing for the future. He stated that if Nvidia's chips are unavailable at that time, 01.AI will seek simpler chips and focus more on converters. This would be a painful process of program design, but if there are no alternatives, it will be the only choice, Li said. However, Chinese engineers can excellently tackle such formidable engineering challenges, he added. Chinese tech giants such as Alibaba, Tencent, Baidu, ByteDance, and numerous startups are developing their own large language models (LLMs). Lee said that these companies are currently in the technology verification stage, where they must prove their capability to build high-quality LLMs. Those companies that pass technical verification will enter the next stage, focusing on how to achieve commercialization, increase revenue, and generate profits. For Lee, it is only when LLMs demonstrate the excellence that they can stand out in practical applications. Otherwise, they may simply be seen as toys without effective real-world applications. Regarding companies that advance through Lee's qualifying round, the next stage involves increasing business value, having a clear business model, and determining how to generate profits. In the United States, OpenAI has already proven its leading position in technology and its ability to create income. Lee predicted that in China, there will eventually be a few major winners, with a handful of companies able to bow out with dignity. Most other companies will either give up midway or shift towards more concrete and practical goals, such as developing applications and solutions for specific industries, he said. "
}