{
    "title": null,
    "date": "1/8/2024",
    "url": "https://www.fool.com/investing/2024/01/08/wall-street-says-this-company-is-the-godfather-of/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Hype around artificial intelligence (AI) rocked the markets in 2023, sending the tech-heavy Nasdaq soaring more than 40%. The megacap Magnificent Seven stocks were at the epicenter of AI mania, and perhaps their most influential member is semiconductor manufacturer Nvidia (NVDA 0.12%). The company saw its market cap balloon in 2023, and it joined Apple, Microsoft, Amazon, and Alphabet in the exclusive $1 trillion market-cap club. It's no surprise that Wall Street analyst Dan Ives of Wedbush Securities crowned Nvidia as the godfather of AI. After surging 237% last year, some might think now is the time for profit taking. But what if I told you that Nvidia stock could be undervalued? Let's explore how the company is leading the charge in AI, and why now might be as good a time as ever to scoop up some shares. Nvidia has developed a host of graphics processing units (GPUs). The bedrocks of its GPU line are the A100 and H100 chips, the latter of which is experiencing unprecedented demand.  NVDA revenue (quarterly) data by YCharts. The chart above illustrates Nvidia's quarterly revenue during the past decade. The big takeaway is that the slope of the line really steepens starting in 2023. For the third quarter of the company's fiscal 2024, ended Oct. 29, Nvidia reported a record $18.1 billion in revenue, an increase of more than 200% year over year. Moreover, the company's profit increased nearly 500% through the first three quarters of its fiscal year. If this wasn't enough to get your attention, consider that Wall Street is forecasting revenue to rise 54% this fiscal year, followed by another 20% the year after. Although this technically shows decelerating revenue, I'd say that is appropriate. It's unrealistic for investors to expect triple-digit percentage revenue growth in perpetuity. Moreover, while Nvidia dominates the AI application market for data center GPUs, there are other competitors gaining steam.  NVDA revenue estimates for current fiscal year, data by YCharts. With 2024 looking like another milestone year for Nvidia, investors might be wondering how attractive the stock is from a valuation perspective. Image Source: Getty Images As of the time of this writing, the stock trades at a forward price-to-earnings (P/E) multiple of 24.8. By comparison, the company's top competitor, Advanced Micro Devices, trades at a forward P/E of 37. While AMD is making progress of its own, it is far behind Nvidia. Considering Nvidia's growth relative to AMD, fueled by its dominant market share in AI data center GPUs, the disparity between valuation multiples is a head-scratcher. On top of that, the forward P/E of the S&P 500 is 21.7 -- not too far behind Nvidia. Given the company's stellar performance in 2023 and its strong outlook for this year, it's hard to see why Nvidia doesn't carry a higher premium. My hunch is that investors are acting with more emotion than logic when it comes to Nvidia. The stock's performance throughout 2023 and the company's admission to the $1 trillion market-cap club might give off vibes of an expensive stock. However, the multiples above could suggest that Nvidia is growing into its valuation, and the stock could actually be cheap. I think Nvidia will continue to benefit from the secular tailwinds of AI, and now looks like a terrific time to begin dollar-cost averaging into a long-term position at a bargain. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}