{
    "title": null,
    "date": "2/23/2024",
    "url": "https://fortune.com/asia/2024/02/23/nvidia-highlights-us-blacklisted-huawei-major-competitor-in-china/",
    "text": "Nvidia has had a good week. Blockbuster earnings led to a share surge that values the company at $1.9 trillion, making it the third most valuable U.S. company ahead of Alphabet and Amazon. CEO Jensen Huang, who said Wednesday that generative AI is at a “tipping point,” is on the cusp of breaking into the world’s top 20 richest people. Yet in its bumper earnings report, Nvidia also warned that its business in China was dropping: The company’s data center revenue out of China was at “mid-single-digit percentage” levels, coming down from as much as 25% in earlier quarters. U.S. export restrictions are making it difficult for Nvidia to ship products to China. And it appears that Chinese tech giant Huawei could be swooping in to fill the gap. The U.S. chipmaker named Huawei as one of its competitors in a filing with the U.S. Securities and Exchange Commission late on Wednesday. Huawei was the only Chinese company to be listed in several categories, including as a supplier of AI-related chips and as a provider of cloud computing for AI. It’s the first time Nvidia has recognized Huawei as a competitor, according to Reuters. Baidu and Alibaba were the only other Chinese companies listed by Nvidia as competitors. The U.S. chipmaker also cited Samsung and Renesas Electronics, a Japanese semiconductor manufacturer, as competition. Huawei’s Ascend 910B chips are touted as a local alternative to Nvidia’s processors, specifically those the U.S. chipmaker designed for the Chinese market to comply with Washington’s restrictions. Chinese companies like Huawei are pitching their products as a safer option if Washington tightens its export restrictions on semiconductors, Reuters reported in December. The Biden administration first imposed export restrictions on advanced chips in October 2022, tightening them again a year later. In its filing, Nvidia said its competitive position “has been harmed,” and may be further harmed, by U.S. export controls. The company revealed that its supply chain is concentrated in the Asia-Pacific region, including companies like Taiwan Semiconductor Manufacturing Co., Samsung, and Foxconn. Being named as an Nvidia competitor is the latest stage in Huawei’s comeback story. The firm, which at one point was battling for survival after being placed on a U.S. blacklist in 2019, recorded nearly $100 billion in revenue last year. That strong performance came after Huawei unveiled its Mate 60 Pro smartphone—featuring a locally made advanced semiconductor. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}