{
    "title": "TSMC Record High; Nvidia AI Investments; Microsoft AI Boost",
    "date": "2/16/2024",
    "url": "https://www.cmcmarkets.com/en-au/opto/tsmc-record-high-nvidia-ai-investments-microsoft-ai-boost",
    "text": "5 Top Stories By OPTO  16 Feb 2024, 03:50 Every day, we handpick the 5 Top Stories stock market investors need to know. In 5 minutes, you’ll learn the stocks, CEOs, and money managers moving markets. Chipmaker Taiwan Semiconductor Manufacturing Co. (TSMC) [2330:TW] added some $42bn to its market value on Thursday, pushing its capitalisation to a record $575bn. This carried it past Visa [V] to become the world’s 12th most valuable firm. TSMC provides chips to Nvidia [NVDA] and Apple [AAPL]; being Taiwan’s largest company, its rally pushed the country’s benchmark index to a record high. At an event with Chancellor Olaf Scholz in Berlin on Thursday, Microsoft [MSFT] President Brad Smith unveiled plans to invest €3.2bn in German artificial intelligence (AI) infrastructure. “German companies are rapidly adapting AI-related technologies,” Smith said at a press conference. The funds will go towards new data centres in North Rhine-Westphalia and the Frankfurt region. Michael Burry, of The Big Short fame, upped his stake in Chinese tech giants Alibaba [BABA] and JD.com [JD] in Q4. According to its 13F filing for the period, Scion Asset Management, Burry’s investment company, now has Alibaba as its biggest holding. It remains to be seen whether these wagers will pay off: Alibaba is down 5% this year, while JD.com has fallen nearly 20%. In a 13F filing with the US Securities and Exchange Commission made on Wednesday, superstar chipmaker Nvidia revealed that, as of 31 December, it holds stakes in several smaller AI firms, among them healthcare firms Nano-X Imaging [NNOX] and Recursion [RXRX], voice AI platform SoundHound AI [SOUN], and Arm [ARM], in which Nvidia has invested $147.3m. SoundHound’s share price jumped as much as 55% on the news. Eli Lilly’s [LLY] obesity drug Mounjaro is being launched in the UK this week, making it the fourth European country to introduce it. Pharmacy chain Superdrug said that it would prioritise National Health Service patients, and anticipates strong demand based on the popularity of Novo Nordisk’s [NVO] Wegovy, introduced last year. In the US, meanwhile, a growing number of adolescents began taking Wegovy last year, Reuters reported. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles 5 Top Stories PS5 in Decline; Nvidia Trumps Amazon; Waymo Recall “Looking ahead, PS5 will enter the latter stage of its life cycle,” said Senior Vice President Naomi Matsuoka during Sony’s earnings call on Wednesday. 14 Feb 2024 5 Top Stories Temu Splashes Out; SoftBank Soars; Paytm On the Brink? PDD-owned e-commerce app Temu splashed some serious cash on advertisements during Sunday’s Super Bowl in the US. 13 Feb 2024 5 Top Stories Nissan Tumbles; Google AI Fund; Waymo Torched The automaker’s share price saw its biggest drop in more than two decades, wiping out $1.8bn of its market value, after quarterly earnings disappointed. 12 Feb 2024 Analysis “Incredible Margin Growth” — Dave Mazza on Meta’s Bumper Earnings Dave Mazza, Chief Strategy Officer of Roundhill ETFs, explains why Meta’s Q4 earnings led to a record single-day market cap gain. 09 Feb 2024 © 2024 CMC Markets Investing in CMC Markets derivative products carries significant risks and is not suitable for all investors. You do not own, or have any interest in, the underlying assets. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading. Spreads may widen dependent on liquidity and market volatility. The information on this website is prepared without considering your objectives, financial situation or needs. Consequently, you should consider the information in light of your objectives, financial situation and needs. CMC Markets Asia Pacific Pty Ltd ABN 11 100 058 213, AFSL No. 238054 (the derivative product issuer), CMC Markets Stockbroking Limited, Participant of the ASX Group (Australian Securities Exchange) and SSX (Sydney Stock Exchange) and Chi-X (Chi-X Australia), ABN 69 081 002 851, AFSL No. 246381 (the stockbroking services provider) provides the financial products and/or services. It's important for you to consider the relevant Terms and Conditions, Product Disclosure Statement ('PDS') and any other relevant CMC Markets Documents before you decide whether or not to acquire any of the financial products. Our Financial Services Guide contains details of our fees and charges. All of these documents are available at cmcmarkets.com.au or you can call us on 1300 303 888. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. "
}