{
    "title": null,
    "date": "2/6/2024",
    "url": "https://investorplace.com/2024/02/chasing-nvidia-3-hot-semiconductor-stocks-gunning-for-nvdas-crown/",
    "text": " Nvidia isn't the only game in town when it comes to capable AI chips to power the future Advertisement Source: Shutterstock Nvidia (NASDAQ:NVDA) stock cannot seem to be stopped, even with some members of the so-called Magnificent Seven showing signs of frailty. Undoubtedly, the rise of generative artificial intelligence (AI) has continued to be a hot investment theme in 2024, helping propel the cap-weighed S&P 500 — which is heavier in the Magnificent Seven stocks — to continue to outpace its equal-weighed counterpart. In time, I’m sure the equal-weight version of the S&P 500 will gain a leg up. But until now, it seems like the cap-weighted version is the one to own as the Magnificent Six — the Seven minus Tesla (NASDAQ:TSLA) stock — continues to look in complete control. As Nvidia leads the big six and the semiconductor industry higher, investors hoping to bet against them had better be prepared for some pain. Understandably, it’s not easy to buy NVDA stock after yet another rally. With a jarring 44% in year-to-date gains posted in just over a month, the following semiconductor stocks may be worth a look as they seek to gain some ground over Jensen Huang’s $1.713 trillion chip titan. Advanced Micro Devices (NASDAQ:AMD) stock has also been incredibly hot so far in 2024, with just north of 25% in gains posted in just over a month. After recently breaking through to new all-time highs, AMD seems like a compelling momentum play to consider if you’re looking for an Nvidia alternative that’s somewhat less scorching. Compared to the rest of the market, though, AMD remains a red-hot stock and one that could turn viciously should investors suddenly find reasons to take some profits off the table in the semiconductor scene. As AI moves from the cloud to being embedded within personal computing devices (PCs, smartphones, and even VR headsets), AMD stands to be a massive winner, even as it plays against Nivida from behind. Why? The market for consumer and enterprise AI products could be so massive that it will be tough for Nvidia to be the sole beneficiary. Recently, CFRA analyst Angelo Zino stated in an interview conducted by CNBC that AMD has what it takes to be a “clear number two.” He’s right. AMD seems to be sprinting in second place in the so-called AI chip race. The real question is, does it have what it takes to overtake Nvidia in the future? At this pace, dethroning Nvidia for the top spot seems like an impossible feat, given the firm’s pace of innovation. That said, I suppose anything is possible as industry dynamics shift quickly. Meta Platforms (NASDAQ:META) is not a semiconductor pure-play by any means. Heck, I don’t even consider it to be the VR or AR play to own right now. Not as more competiors arrive with shiny new headsets! Personally, I consider Meta to be an AI and social-media juggernaut. After the latest blowout quarter, Meta really had a chance to showcase its AI talents. Those who dared bet against Mark Zuckerberg have now likely taken a hit. As the company continues investing heavily in AI while exploring initiatives in the realm of custom hardware, I think a time will come when we view Meta as an AI kingpin with exposure to numerous segments of the tech universe, including chips. It’s no mystery that Meta is hard at work on its own AI chips. The company has plans to deploy its own data centers with its custom chips later this year. The move is probably going to act as another driver of the share price, as Zuckerberg’s company gets thrown into the conversation along with other hot AI chip plays. Like Meta, Microsoft (NASDAQ:MSFT) is a software company that’s making a huge splash in AI. With its own AI-optimized “custom-designed” chips on the way, Microsoft stock may have what it takes to stay one of the more magnificent members of the Magnificent Seven group. Though Nvidia stock has the lead in 2024 thus far, I’d not count Microsoft out of the running as investors overlook its prowess in the AI chip game. Now, I’m not saying that Microsoft will be grabbing the crown right off Nvidia’s head. However, I do feel that Microsoft is a company that can disrupt markets where it smells of opportunity. Indeed, Nvidia is the envied company right now. But the width of its moat will be put to the test as tech juggernauts like Microsoft look to take a deep dive into the incredible world of AI chips. It’ll take some years for anyone else to catch up to Nvidia. However, at current valuations, I do like the overall risk/reward in MSFT stock while it’s going for just 36.68 times trailing price-to-earnings. On the date of publication, Joey Frenette held a position in Microsoft. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joey Frenette is a seasoned investment writer specializing in technology and consumer stocks. Contributing to the Motley Fool Canada, TipRanks, and Barchart, Joey excels in spotting mispriced stocks with long-term growth potential in a fast-paced market. Technology, Semiconductor   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/chasing-nvidia-3-hot-semiconductor-stocks-gunning-for-nvdas-crown/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}