{
    "title": "Going Into Earnings, Is Nvidia a Buy, a Sell, or Fairly Valued?",
    "date": "2/13/2024",
    "url": "https://www.morningstar.com/stocks/going-into-earnings-is-nvidia-buy-sell-or-fairly-valued",
    "text": "With data centers dominating revenue, here’s what we think of Nvidia’s stock. Nvidia NVDA is set to release its fourth-quarter earnings report on Feb. 21, after the market close. Here’s Morningstar’s take on what to look for in Nvidia’s earnings and stock. The data center segment remains in focus Artificial intelligence will be top of mind We see many moving pieces within the AI market for Nvidia and its peers. Some questions we have: Reuters recently reported that Nvidia is building a custom chip design unit that might help build specialized AI chips for others. We’ll be interested in any insight around this initiative, and the opportunities it might open for Nvidia. All these items will help us inform our estimates for future data center revenue growth, and in turn free cash flow generation and our fair value estimate. With its 2-star rating, we believe Nvidia’s stock is overvalued compared with our long-term fair value estimate of $480 per share, which implies an equity value of over $1.1 trillion, a fiscal 2024 price/adjusted earnings multiple of 45 times, and a fiscal 2025 forward price/adjusted earnings multiple of 31 times. Our fair value estimate (and Nvidia’s stock price) will be driven by its prospects in the data center segment and AI GPUs, for better or worse. We anticipate a massive expansion in the AI processor market in the decade ahead, and we see room for tremendous revenue growth both at Nvidia and for competing solutions from either external chipmakers (like AMD or Intel INTC) or in-house solutions developed by hyperscalers (such as chips from Alphabet GOOGL, Amazon AMZN, or others). Nvidia’s data center business has already achieved exponential growth, rising from $3 billion in fiscal 2020 to $15 billion in fiscal 2023. The firm should see an even higher inflection point in fiscal 2024, as we expect data center revenue to more than double to $41 billion. We don’t view this spike as coming from frontloaded orders or a buildup of excess capacity, as we model 46% growth in fiscal 2025 data center revenue to over $60 billion. We model growth of 23%, 20%, and 13% in the following three years, driving the segment’s revenue to $100 billion in fiscal 2028. We doubt that any enterprise wants to be left behind, nor does any cloud computing provider want to be shorthanded when providing AI GPUs to customers. Read more about Nvidia’s fair value estimate. We assign Nvidia a wide moat thanks to intangible assets around its graphics processing units and, increasingly, switching costs around its proprietary software. This includes the Cuda platform for AI tools, which lets developers use Nvidia’s GPUs to build AI models. Nvidia was an early leader and designer of GPUs, which were originally developed to offload graphic processing tasks on PCs and gaming consoles. The firm has emerged as the clear market share leader in discrete GPUs (it has a share of over 80%, per Mercury Research). We attribute this leadership to intangible assets associated with GPU design, as well as the associated software, frameworks, and tools developers need to work with these GPUs. In our view, recent introductions like ray-tracing technology and the use of AI tensor cores in gaming applications are signs Nvidia has not lost its GPU leadership in any way. The firm’s average selling prices are often twice as high as those of its closest competitor, AMD. Meanwhile, we don’t foresee any companies becoming a third relevant player in the GPU market. Even Intel, the chip industry behemoth, has struggled for many years to build a high-end GPU that would be adopted by gaming enthusiasts; its next effort at a discrete GPU is slated to launch in 2025. We do see integrated GPU functionality within many of Intel’s PC processors. We perceive such integrated solutions as “good enough” for nongamers but not on par with high-end GPU needs. Read more about Nvidia’s moat rating. We assign Nvidia an Uncertainty Rating of Very High. The firm is an industry leader in GPUs used in AI model training, and it has carved out a good portion of demand for chips used in AI inference workloads (which involves running a model to make a prediction or output). We see a host of tech leaders vying for this leading AI position. We think it is inevitable that leading hyperscale vendors, such as Amazon’s AWS, Microsoft MSFT, Google, and Meta Platforms META, will seek to reduce their reliance on Nvidia and diversify their semiconductor and software supplier base, including the development of in-house solutions. Google’s TPUs and Amazon’s Trainium and Inferentia chips were designed with AI workloads in mind, while Microsoft and Meta have announced semiconductor design plans. Among existing semiconductor vendors, AMD is quickly expanding its GPU lineup to serve cloud leaders. Intel also has AI accelerator products, and it will likely remain focused on this opportunity. Read more about Nvidia’s risk and uncertainty. This article was compiled by Quinn Rennell. The author or authors own shares in one or more securities mentioned in this article.\n\n\t\t\t\t\t\tFind out about Morningstar’s editorial policies. Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}