{
    "title": "The 'Wizard of Wharton' says a tech bubble may be forming - and AI stocks \nlike Nvidia could crash",
    "date": "2/27/2024",
    "url": "https://www.businessinsider.nl/the-wizard-of-wharton-says-a-tech-bubble-may-be-forming-and-ai-stocks-like-nvidia-could-crash/",
    "text": "Secties Edities Specials Over Business Insider Copyright © 2024 Business Insider Nederland. Alle rechten voorbehouden. Registratie of gebruik van deze site vindt plaats onder Algemene Voorwaarden en Privacybeleid.\nAlgemene voorwaarden | Privacybeleid | Cookie-overzicht | Adverteren | Vacatures Jeremy Siegel. Foto: Getty Images The breathless hype around technology stocks like Nvidia is nearing dangerous levels, Jeremy Siegel warned. \"The beginnings of a speculative bubble may be forming but it is impossible to tell when it will end,\" the retired finance professor known as the \"Wizard of Wharton\" said in his weekly WisdomTree commentary on Monday. Nvidia stock has soared more than five-fold since the start of last year, vaulting the semiconductor company past Amazon and Alphabet to a $2 trillion market value. Insatiable demand for its graphics chips from AI companies fueled a 265% year-on-year increase in its revenue to more than $22 billion last quarter, and an almost 1,000% rise in its operating income to about $14 billion. Siegel said it's unclear whether the frenzy is more like the halcyon days of the internet revolution, or the peak euphoria that preceded the dot-com crash. \"I do not think we are in a bubble now,\" he said. Heady tech valuations are underpinned by strong earnings growth, and Nvidia is a \"special company\" that doesn't strike him as \"dramatically over- or undervalued\" and could keep rising, he added. Still, the tech-stock rally will ultimately stall and the correction could be brutal, Siegel said. \"In a run such as this, the saying is 'stairs up, elevator down.' And that elevator ride can be quite swift!\" WisdomTree's senior investment strategy advisor shrugged off mounting concerns about the US economy. Historically low unemployment, solid job gains, and stubborn inflation in recent months have fueled fears that the Federal Reserve might not cut interest rates for a long while. That would mean continued pressure on cash-strapped households as well as businesses in industries such as banking and commercial real estate, and an increased risk of recession. Siegel, the author of \"Stocks for the Long Run,\" said he wasn't worried as a healthy economy and robust earnings backdrop are good for companies and their investors. There's also little sign of resurgent inflation in his view.  \"Sensitive commodities are the early warning signals of inflation, and they are quiet,\" he said. The finance guru was one of the few commentators to anticipate last year's stock-market rally, and in December he issued another bright outlook for this year. He predicted stocks would jump, a recession wouldn't materialize, and rates would tumble. Given his perennial optimism, it's striking that even he sees the risk of a tech bubble now. Een ervaren reisjournalist raadt aan voor het boeken goed te kijken naar de verschillende arrange Probeer de drijfveren van de werknemer met een vertrekwens te achterhalen en vraag je ook af of e De Hoge Raad beslist waarschijnlijk in augustus of de methode die wordt gebruikt voor box 3 voor Bij het opbouwen van spiermassa gaat het vooral om uitdagende krachtrainingsessies en niet per se De regels rond de hypotheekrenteaftrek spelen niet alleen bij de jaarlijkse belastingaangifte, ma Het nieuwe koopaanbod is vaak niet betaalbaar voor starters en middeninkomens. Ook zorgt het R New US Marine formations are learning to battle adversaries like China on remote islands. The new Massachusetts state police say a suspect shot a Boston Dynamics robot dog during a SWAT standoff. I’ve been a flight attendant for 9 years, so there are a few things I think passengers shou The father of a woman who Hamas killed has defended an award-winning image of her. The Associated Wil je groeien met je bedrijf? Nu in 30 seconden een indicatie van je lening. Rabo Zakelijk Financieren. Verrassend snel een passend voorstel. Wil je jouw bedrijf verduurzamen? In 15 minuten weet je wat je kan lenen. Bekijk alle vacatures → Het nieuwe koopaanbod is vaak niet betaalbaar voor starters en middeninkomens. Ook zorgt het R New US Marine formations are learning to battle adversaries like China on remote islands. The new Massachusetts state police say a suspect shot a Boston Dynamics robot dog during a SWAT standoff. I’ve been a flight attendant for 9 years, so there are a few things I think passengers shou The father of a woman who Hamas killed has defended an award-winning image of her. The Associated Former New Jersey Gov. Chris Christie is the latest politician to spurn No Labels. The centrist g Copyright © 2024 Business Insider Nederland. Alle rechten voorbehouden. Registratie of gebruik van deze site vindt plaats onder Algemene Voorwaarden en Privacybeleid.\nAlgemene voorwaarden | Privacybeleid | Cookie-overzicht | Adverteren | Vacatures "
}