{
    "title": "NVIDIA’s A.I. Demand Is Solid Promises Goldman Sachs As It Pumps Share Price",
    "date": "2/5/2024",
    "url": "https://wccftech.com/nvidias-a-i-demand-is-solid-promises-goldman-sachs-as-it-pumps-share-price/",
    "text": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy. Ahead of its crucial earnings report due later this month, chipmaker NVIDIA Corporation received bullish analyst coverage from Goldman Sachs earlier today as the bank raised its share price target for the company. NVIDIA has entered 2024 as a fundamentally transformed company on both the stock market and the balance sheet, as the firm's GPUs are indispensable when it comes to running large scale artificial intelligence models. The potential demand for these products and the broader excitement in the industry related to A.I.'s futures has also injected fresh optimism into NVIDIA's shares with Goldman. Sachs's latest analyst note echoes the positive sentiment that the firm has found itself engulfed in. Heading into 2024, the big question on everyone's mind was how well big tech is able to capitalize on the demand for A.I. products and services. This was the theme for the first earnings season of the year, and shares of Alphabet, Meta, Microsoft and AMD responded to investor reactions to their earnings reports and conference calls. While Microsoft soared after its earnings call, Alphabet's investors were less impressed as it shared that the costs of A.I. will be higher. Now, Goldman Sachs's research shows that not only is the demand for AI servers healthy, but the supply chain constraints faced by NVIDIA's GPUs are also easing. In a fresh analyst note, the bank raised its share price target for NVIDIA to $800 from an earlier $625 to mark a 28% bump It also increased NVIDIA's earnings per share estimates for the next couple of years, and analyst Toshiya Hari also provided more details about the long term demand for A.I. products. NVIDIA's smaller rival AMD also struck a bullish tone about A.I. in its latest earnings call, as CEO Dr. Lisa Su highlighted that A.I. has the potential to be worth billions of dollars in the future. According to Goldman Sachs: We increase our FY2025/26 non-GAAP EPS estimates, on average, by 22% as we reflect recent industry data points indicative of robust AI server demand and improving GPU supply. We no longer assume a drop off in Data Center revenue in 2HCY24 and instead model consistent growth through 1HCY25 driven by continued spending on Gen AI infrastructure by the large cloud service providers, a broadening customer profile, and multiple new product cycles. We reiterate our Buy rating (also on the Conviction List) on NVDA with our updated 12-month price target of $800, pointing to 21% potential upside from current levels and our bull/bear analysis indicating an attractive risk/reward profile. NVIDIA's fiscal year ends at the start of a calendar year, with its upcoming earnings report set to provide details about the firm's performance during the fiscal year 2024. The firm's data center division is now its largest business division after taking the crown from gaming products as corporate spending grows and more firms make the shift to cloud computing and associated technologies. Data compiled by Yahoo Finance shows that an average of 46 analyst price targets sets a price target of $646.89 for NVIDIA. GPU supply and A.I. demand are the two key determinants of NVIDIA's share price. In the immediate aftermath of the surge in interest surrounding A.I. in 2023 analysts had worried that NVIDIA's GPUs for A.I. might be in short supply due to capacity constraints for a process called packaging in chip manufacturing. Packaging is one of the final steps in mass production that allows the chip to communicate with other components in a computer. NVIDIA's primary manufacturing partner is TSMC, and industry analyst believes that as packaging constraints are resolved and capacity grows, chip companies will be able to increase their output as well. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}