{
    "title": "Reddit Debuts onto the Market, Chipotle Stock Split, Nvidia & More",
    "date": "3/23/2024",
    "url": "https://www.tastylive.com/news-insights/reddit-debuts-market-chipotle-stock-split-nvidia",
    "text": "Reddit’s IPO Success Story, Nvidia’s Ongoing Good Fortune and Apple’s Week of Nightmares Mar 23, 2024 By:Vonetta Logan  What’s up tastynation! Welcome to this week’s edition of Weekly Dose! Each week, I recap the top stories that I covered on Daily Dose. If you missed any eps, you can catch up on them here. Another magical week has ended where I spent every single day coming into the office just like the “before times.” No one is meant to have the amount of office coffee I have ingested this week. I did have some fun on Tuesday as I took my camera around town to capture the cool phenomenon known as “Chicagohenge.” During the vernal equinox, the east-west streets of Chicago and other cities like New York and Montreal make beautiful illuminated corridors when the sun rises and sets. You can check out my photos here. Let’s get to this week’s recap.  Traders were eagerly awaiting the debut of the hottest initial public offering in recent history: Reddit (RDDT). The 19-year-old “front page of the internet”/social media site made its debut on the NYSE this week. On Monday, Reddit announced they would be pricing their IPO at $34 a share, the high end of its range. It values the company at $6.5 billion. Then news arrived that Reddit’s IPO was as much as five times oversubscribed. While there are no hard and fast rules around oversubscribement?, oversubscription?, oversubbies? It does generally mean the company will probably reach its targeted price range.   And of course this week we also saw the emergence of the legal trolls. Like a remora affixed to an apex predator, lawyers love companies that are about to IPO. First, came a letter from Nokia Technologies claiming Reddit infringed on some of the telecom firm’s patents. Then, Reddit let investors know that the Federal Trade Commission had sent a letter to the company about its data-licensing business related to the training of AI. As the big day approached, more news of moderator discontent began to circulate. Like Airbnb (ABNB) and Rivian (RIVN), Reddit decided to invite users to participate in the IPO.   Some moderators, who work thousands of hours as unpaid volunteers, declined the stock offer because of lingering tension with management and concerns over how Reddit plans to monetize the business. Finally, the big day arrived, and in its NYSE debut, Reddit’s stock popped 48%. Reddit and its selling shareholders raised about $750 million from the offering. The stock opened at $47 and reached a high of $57.80 before closing at $50.44. It opened flat on Friday. Now, the stock must deliver on the lofty goals it promised shareholders. Because advertising accounts for nearly all of Reddit’s revenue, its partnerships in the realm of AI are critical to the business’ bottom line. Reddit is partnering with Google (GOOGL) to use its deep stacks of user conversations to train large language models (LLMs). Volume seems decent in the stock with about 10 million shares trading on Friday. Also, it looks like options are set to go live on Reddit stock on Monday.   Something was in the air on Monday as analysts across the globe started salivating about the moves Nvidia (NVDA) was going to make this week. Maybe they could smell  innovation in the AI space, or perhaps it was the smell of money as Nvidia continues to dominate, or perhaps it was the soft fragrance of whatever oil Nvidia boss Jensen Huang uses on his signature leather jacket.   Whatever it was, Nvidia shares jumped Monday as analysts unveiled new price targets ahead of the company’s “AI Woodstock” event. The annual global developers’ conference attracted more than 300,000 participants and showcased a wide array of new Nvidia products. Its shares have added more than $1 trillion of market value over the past year. On a hockey arena stage, the Taylor Swift of AI, Huang, introduced Nvidia’s latest chip, which is 30 times faster than its predecessor. Nvidia didn’t have to go that hard. Like, wasn’t 15 times faster good enough? Pace yourself. You can read more about everything that was announced here. I am not going to remotely pretend I even understand. After the fanfare the stock actually dropped but by the next day it was back up. Nvidia’s new chip will be priced between $30,000 to $40,000. Tech companies are of course lining up to get the new chips and at the event, Nvidia announced some major partnerships. Nvidia and Johnson & Johnson (JNJ) will partner on AI applications for surgery. News that burrito chain Chipotle (CMG) would be doing a 50-for-1 stock split broke this week, and that led analysts to ask if Nvidia could be next on the splitting block. Other chip-adjacent stories were also on my radar this week. Both IBM (IBM) and Micron (MU) also hit new highs this week. A share offering announcement from Super Micro Computer SMCI wasn’t super well-received.     Apple ( AAPL) has not had the best 2024. In December 2023, it was all rosy forecasts for future Apple products and endeavors. But the brutal reality of the year sees Apple's stock down 11% year-to-date, making it one of the worst performers in the Magnificent 7. Only Tesla (TSLA), run by an unstable ketamine addict who yeets posts on X at all hours of the day and night, is lower. Apple started the week with some good news. First, it announced it was partnering with Google (GOOGL) to license Google’s Gemini AI for Apple’s iPhones. Google and Apple already have an $18 billion deal in place to put Google’s search on iPhone, so this makes sense. Google’s stock popped 4% on the news, but Apple’s only ticked up 1%. That should have been the first sign. Also on Monday, Walmart (WMT) announced it would be offering the MI Macbook Air for a very reasonable $699. Best Buy (BBY) then announced it was offering the laptop for $649. We got ourselves a price war! It’s the first time Macs will be sold at Walmart. Aaaaaand that’s the end of the good news for Apple this week. News headlines of legal lawsuits and settlements started pouring in, and when it rains it pours … high-billable hour litigators. First, news broke that Apple agreed to pay $490 million to settle a class-action lawsuit in which it was alleged that CEO Tim Cook defrauded shareholders by concealing falling demand for iPhones in China. Meanwhile, a San Francisco judge ruled this week Apple must face a lawsuit accusing the company of negligence over the potential stalking risk created by its AirTags. The plaintiffs claim the devices normally used to help people track luggage or find their wallet are “the weapon of choice for stalkers and abusers.” YIKES. Several major tech companies also announced this week they are seeking legal action against Apple because the tech company is flouting a court order intended to reshape the iPhone maker’s app store. Meta (META), Microsoft (MSFT), X, and Match Group (MTCH) made the legal filing to lend support to Epic Games, which sued Apple over Apple’s ban of Fortnite in the app store. BIG YIKES.   Then came the biggest, baddest news of all. The U.S. Justice Department sued Apple in an antitrust case saying that the iPhone maker has a monopoly over the phone market and that it’s “too hard to leave the Apple ecosystem.” SUPER DOUBLE YIKES. Also, it’s not fair that women don’t want to date dudes who have Android phones, Your Honor. Apple’s stock is down around $4 from where it started the week.   These are my favorite funny stories of the week Hormel releases a chip you can double dip! Taco Bell (YUM) showcases the new Chicken Cantina menu Jim Harbaugh inexplicably has a garage sale The lineup for Lollapalooza is released. Take a look and feel old! Will Tom Eat It? Italian Beef Tacos That’s it for this week! See ya next week!   Vonetta Logan has more than a decade of markets experience and has been a trader for five years. She is an on-air personality, creative writer and news correspondent at tastylive. Vonetta appears Monday-Friday on Daily Dose and contributes to Luckbox Magazine. @vonettalogan For live daily programming, market news and commentary, visit tastylive or the YouTube channels tastylive (for options traders), and tastyliveTrending for stocks, futures, forex & macro. Trade with a better broker, open a tastytrade account today. tastylive, Inc. and tastytrade, Inc. are separate but affiliated companies.  Options involve risk and are not suitable for all investors. Please read Characteristics and Risks of Standardized Options before deciding to invest in options. About Us Careers Legal Stuff Press FAQ Glossary Help Center Contact Us Twitter Instagram Facebook LinkedIn tastytrade tastycrypto luckbox Store Connect from anywhere! Newsletters News & Insights On Demand tastylive content is created, produced, and provided solely by tastylive, Inc. (“tastylive”) and is for informational and educational purposes only. It is not, nor is it intended to be, trading or investment advice or a recommendation that any security, futures contract, digital asset, other product, transaction, or investment strategy is suitable for any person. Trading securities, futures products, and digital assets involve risk and may result in a loss greater than the original amount invested. tastylive, through its content, financial programming or otherwise, does not provide investment or financial advice or make investment recommendations. Investment information provided may not be appropriate for all investors and is provided without respect to individual investor financial sophistication, financial situation, investing time horizon or risk tolerance. tastylive is not in the business of transacting securities trades, nor does it direct client commodity accounts or give commodity trading advice tailored to any particular client’s situation or investment objectives. Supporting documentation for any claims (including claims made on behalf of options programs), comparisons, statistics, or other technical data, if applicable, will be supplied upon request. tastylive is not a licensed financial adviser, registered investment adviser, or a registered broker-dealer.  Options, futures, and futures options are not suitable for all investors.  Prior to trading securities, options, futures, or futures options, please read the applicable risk disclosures, including, but not limited to, the Characteristics and Risks of Standardized Options Disclosure and the Futures and Exchange-Traded Options Risk Disclosure found on tastytrade.com/disclosures. tastytrade, Inc. (\"tastytrade”) is a registered broker-dealer and member of FINRA, NFA, and SIPC. tastytrade was previously known as tastyworks, Inc. (“tastyworks”). tastytrade offers self-directed brokerage accounts to its customers. tastytrade does not give financial or trading advice, nor does it make investment recommendations. You alone are responsible for making your investment and trading decisions and for evaluating the merits and risks associated with the use of tastytrade’s systems, services or products. tastytrade is a wholly-owned subsidiary of tastylive, Inc. tastytrade has entered into a Marketing Agreement with tastylive (“Marketing Agent”) whereby tastytrade pays compensation to Marketing Agent to recommend tastytrade’s brokerage services. The existence of this Marketing Agreement should not be deemed as an endorsement or recommendation of Marketing Agent by tastytrade. tastytrade and Marketing Agent are separate entities with their own products and services. tastylive is the parent company of tastytrade. tastycrypto is provided solely by tasty Software Solutions, LLC. tasty Software Solutions, LLC is a separate but affiliate company of tastylive, Inc. Neither tastylive nor any of its affiliates are responsible for the products or services provided by tasty Software Solutions, LLC. Cryptocurrency trading is not suitable for all investors due to the number of risks involved. The value of any cryptocurrency, including digital assets pegged to fiat currency, commodities, or any other asset, may go to zero. © copyright 2013 - 2024 tastylive, Inc. All Rights Reserved.  Applicable portions of the Terms of Use on tastylive.com apply.  Reproduction, adaptation, distribution, public display, exhibition for profit, or storage in any electronic storage media in whole or in part is prohibited under penalty of law, provided that you may download tastylive’s podcasts as necessary to view for personal use. tastylive was previously known as tastytrade, Inc. tastylive is a trademark/servicemark owned by tastylive, Inc. "
}