{
    "title": "Could Nvidia Deliver Another 5X Gain by 2030? Here's Why It's Not Out of \nthe Question.",
    "date": "3/3/2024",
    "url": "https://finance.yahoo.com/news/could-nvidia-deliver-another-5x-094700439.html",
    "text": "No stock is more magnificent right now than Nvidia (NASDAQ: NVDA). That's a subjective statement, of course, but it's one based on objective reality. Name any big company. There's a better chance than not that it has artificial intelligence (AI) initiatives underway. And if so, it's a near certainty that the company is using Nvidia's graphics processing units (GPUs). I'd argue that Nvidia is the most important business in the world -- at least for now. Its stock performance backs me up. The share price has skyrocketed over 400% in less than three years and is up by a multiple of more than 20 over the last five years. That's indisputably magnificent. But could Nvidia deliver another fivefold gain by 2030? Here's why it's not out of the question. I can hear the objections already. Several of them have already entered my mind, too. Nvidia becoming a five-bagger yet again by the end of the decade might seem like an impossible dream. One key problem is the fact that success attracts competition. We're already seeing that with Nvidia. Advanced Micro Devices has launched its new MI300 Instinct chips. The most powerful of these new AI chips, MI300X, beat Nvidia's H100 on key benchmarks, according to AMD. It's also drastically cheaper than Nvidia's chip. Some of Nvidia's biggest customers have gotten into the act as well. Amazon, Alphabet's Google, Microsoft, Meta Platforms, and Tesla have either already developed their own AI chips or are in the process of doing so. The demand for GPUs could slow even without additional competition. For example, if companies see that investments in AI aren't paying off as much as anticipated, they'll shift spending to other areas. These are just a few valid objections to the premise that Nvidia could deliver a 5x gain by 2030. However, I still think it's within the realm of possibility. First of all, I suspect that companies' AI investments will pay off handsomely. As long as the return on investment is attractive, AI spending will increase. Nvidia could realistically skyrocket another 400% or more even with increased competition if the demand for AI chips grows enough. But how much will that demand grow? I found Nvidia CEO Jensen Huang's comments in the company's recent fourth-quarter conference call intriguing. Huang pointed to the transition from general computing to accelerated computing and the adoption of generative AI as huge tailwinds for his company. He predicted that these two trends \"will drive a doubling of the world's data-center infrastructure installed base in the next five years and will represent an annual market opportunity in the hundreds of billions.\" He also hinted that \"amazing breakthroughs in large language models\" could be on the way from Nvidia. Keep in mind that Nvidia's revenue totaled $60.9 billion last year and that the current installed base of data center infrastructure is around $1 trillion. If the company could increase its annual revenue to the levels that Huang envisions, a 5x return doesn't sound far-fetched. There is one other factor to consider, though. The current share price already has a lot of growth baked in. The stock trades at a price-to-sales ratio of nearly 31.8. Aswath Damodaran, a finance professor at New York University who is known as the \"Dean of Valuation,\" says he is selling Nvidia stock because of its lofty price. Damodaran expects Nvidia to deliver strong growth, but he's skeptical that the company will be able to grow at a rate anywhere close enough to justify its current valuation. However, the valuation expert admits that AI could prove to be a bigger tailwind for Nvidia than he projected in his model. Will Nvidia deliver another 5x gain by 2030? I don't know. Just because something is possible doesn't necessarily mean that it's probable. On the other hand, I agree with Huang that \"the world has reached the tipping point of a new computing era.\" Maybe, just maybe, his company will become even more magnificent than it already is. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Keith Speights has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy. Could Nvidia Deliver Another 5X Gain by 2030? Here's Why It's Not Out of the Question. was originally published by The Motley Fool Related Quotes "
}