{
    "title": "Nvidia rallies to record high as chipmaker announces AI-related components",
    "date": "3/29/2024",
    "url": "https://ca.news.yahoo.com/nvidia-rallies-record-high-chipmaker-212137966.html",
    "text": "(Reuters) - Shares of Nvidia surged to a record high close on Monday after the world's most valuable chipmaker unveiled new desktop graphics processors taking advantage of artificial intelligence. Nvidia's stock climbed 6.4% to end at $522.53, its highest close ever, after the company announced the GeForce RTX 40 SUPER Series of graphics processors, aimed primarily at videogame enthusiasts. Ahead of the Consumer Electronics Show in Las Vegas, Nvidia also announced other components and software related to AI. Viewed as the leading supplier of processors used in AI computing, Nvidia's stock more than tripled in 2023. Traders exchanged over $32 billion worth of Nvidia's shares during Monday's session, making it the most traded company on Wall Street, according to LSEG data. Nvidia's stock market value now stands at nearly $1.3 trillion. The latest rally in Nvidia's stock helped propel the PHLX semiconductor index 3.3% higher. (Reporting by Noel Randewich, Editing by Rosalba O'Brien) Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era.  \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Improve grammar, word choice, and sentence structure everywhere you work. Write better with Grammarly. Seven reportedly cost $20 million The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con  \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret.  They soft-launched their relationship at the supermodel's cookbook event in Miami. The \"Late Night\" comedian brutally summed up the former president's media company. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. "
}