{
    "title": "OurCrowd AI Fund to Collaborate with NVIDIA Inception",
    "date": "3/11/2024",
    "url": "https://aithority.com/natural-language/chatgpt/ourcrowd-ai-fund-to-collaborate-with-nvidia-inception/",
    "text": "AiThority - Artificial Intelligence | News | Insights | AiThority OurCrowd AI Fund announced it will offer select artificial intelligence startups, in collaboration with NVIDIA, a fast track into the NVIDIA Inception program. Recommended AI News: Multifamily Leader Introduces Entrata Layered Intelligence, Infusing AI Across its Platform “Our collaboration with NVIDIA Inception will help give qualifying companies in the fund access to a program tailor-made to nurture startups and equip them for success.” The OurCrowd AI Fund provides investors with access to the next revolutionary wave of global venture capital opportunities in mission-centric AI companies and the generative AI space, helping solve real-world problems across multiple verticals. The fund will invest in 20-25 venture investments diversified by stage and geography​, sourced by a team of dedicated investment professionals, along with professionals from OurCrowd’s global network of third-party VC funds. The fund will also pursue follow-on opportunities in the most promising portfolio investments​. So far, several companies have been approved to be part of OurCrowd’s AI Fund including: “The OurCrowd AI Fund gives accredited investors the chance to access the most promising opportunities in AI startups as identified by experienced venture capital experts,” said Jon Medved, CEO and Founder of OurCrowd. “Our collaboration with NVIDIA Inception will help give qualifying companies in the fund access to a program tailor-made to nurture startups and equip them for success.” CZI Launches AI Advisory Group and Residency Program to Accelerate Development of Virtual Cell Models AI in Federal Government: Why Decision Makers Should Work with Data Scientists in 2024 AI Isn’t Taking Your Job…Yet! “When people think of artificial intelligence today, they think of generative AI programs like OpenAI’s ChatGPT. However, the transformative power of AI goes much further than its ability to generate text, photographs, music, video, and other materials,” Medved said. “Investors need to take a vertical view of the AI revolution.​ The application of AI to each business vertical will transform our world and shape the economies of the future. AI is poised to affect every industry sector, with an impact comparable to the introduction of cloud computing, social media, the smartphone, the PC, and, before that, electricity.” Recommended AI News: Generative AI Contracting Copilots Drive Icertis Above $250 Million in Annual Recurring Revenue NVIDIA Inception helps startups evolve faster through cutting-edge technology, opportunities to connect with venture capitalists, and access to the latest technical resources and tools from NVIDIA. The program supports all stages of a startup’s life cycle. Arik Kol, Senior Director, Head of NVIDIA Inception Israel said, “Our collaboration with OurCrowd AI Fund will develop the next generation of AI startups, helping to shape the way that AI will benefit multiple aspects of our lives.” Qualifying startups selected for the OurCrowd AI Fund portfolio will be fast-tracked into Inception, which will support them through access to NVIDIA Training courses. These companies will also benefit from opportunities to collaborate with industry-leading experts and access to additional investors, as well as cloud credits through NVIDIA partners and preferred pricing on select NVIDIA hardware and software. OurCrowd is Israel’s most active AI investor, with $386M invested across 81 AI companies worldwide, with 8 exits to date including Lemonade, Magisto, and BriefCam, and is ranked among the top 15 most active VCs worldwide in AI deals since 2012, according to an analysis of PitchBook data. Recommended AI News: Over 40 Percent of Campaigns on CTV in Next Two Years: OpenX and ExchangeWire Research [To share your insights with us as part of editorial or sponsored content, please write to sghosh@martechseries.com] Business Wire, a Berkshire Hathaway company, is the global leader in press release distribution and regulatory disclosure.\nPublic relations, investor relations, public policy and marketing professionals rely on Business Wire for secure and accurate distribution of market-moving news and multimedia.\nFounded in 1961, Business Wire is a trusted source for news organizations, journalists, investment professionals and regulatory authorities, delivering news directly into editorial systems and leading online news sources via its multi-patented NX network. Business Wire’s global newsrooms are available to meet the needs of communications professionals and news media worldwide. Prev Post Huawei Launches Financial AI Contact Center Solution 2.0 Next Post Horizon3.ai Unveils Pentesting Services for Compliance Ahead of PCI DSS v4.0 Rollout CZI Launches AI Advisory Group and Residency Program to Accelerate Development of… AI in Federal Government: Why Decision Makers Should Work with Data Scientists in… AI Isn’t Taking Your Job…Yet! Nine Major Proposals for Government Regulating Artificial Intelligence Favored by… Comments are closed. AiThority.com covers AI technology news, editorial insights and digital marketing trends from around the globe. Updates on modern marketing tech adoption, AI interviews, tech articles and events. Copyright © 2024 AiThority. All Rights Reserved. Privacy Policy "
}