{
    "title": "Not just SoundHound, these AI stocks are also riding Nvidia wave",
    "date": "3/16/2024",
    "url": "https://www.investorsobserver.com/news/qm-news/5420514991805561",
    "text": "Not just SoundHound, these AI stocks are also riding Nvidia wave\n\n  2024-03-16 06:34:59 ET\n \n\n\n\n\n\n   Following Nvidia’s investment disclosure,\n   \n    SoundHound AI’s\n   \n   shares have dramatically increased, tripling in value and boosting its market capitalization to $2.75 billion.\n  \n\n   The company’s success is attributed to its innovative AI voice technology used across various industries, from fast-food to automotive.\n  \n\n   A recent earnings report showed an 80% revenue jump, prompting analysts to raise their price targets significantly.\n  \n\n   Nvidia’s AI investments\n  \n\n   Nvidia’s 13F filing revealed its investments in several AI-centric companies, including SoundHound AI, Arm, Nanox Imaging, and Recursion Pharmaceuticals, all of which have seen their stock prices climb.\n  \n\n   Nvidia’s investment strategy underscores the chipmaker’s commitment to advancing AI technology across multiple sectors.\n  \n\n   Arm see growth amid AI boom\n  \n\n   Arm’s shares have seen a modest increase since Nvidia’s investment disclosure.\n  \n\n   The company, known for its semiconductor designs, has reported record-high revenue thanks to the AI boom, with its technology becoming increasingly indispensable in AI applications.\n  \n\n   Nanox Imaging’s health tech surge\n  \n\n   Shares of Nanox Imaging have soared, driven by its groundbreaking digital X-ray source technology and AI-driven solutions for early disease detection.\n  \n\n   The company’s vision for accessible and preventative healthcare has resonated with investors, reflected in its stock’s impressive rise.\n  \n\n   Recursion Pharmaceuticals’ biotech jumps\n  \n\n   Recursion Pharmaceuticals, another beneficiary of Nvidia’s investments, has seen its shares grow significantly.\n  \n\n   Despite a revenue dip, the company’s innovative use of machine learning for drug discovery highlights the potential of AI in revolutionizing the biotech industry.\n  \n\n   The post\n   \n    Not just SoundHound, these AI stocks are also riding Nvidia wave\n   \n   appeared first on\n   \n    Invezz\n   \n\n\nInvezzMarch 16, 2024 - 3:34 AM PDTNews by QuoteMediawww.quotemedia.com 2024-03-16 06:34:59 ET Following Nvidia’s investment disclosure,\n   \n    SoundHound AI’s\n   \n   shares have dramatically increased, tripling in value and boosting its market capitalization to $2.75 billion. The company’s success is attributed to its innovative AI voice technology used across various industries, from fast-food to automotive. A recent earnings report showed an 80% revenue jump, prompting analysts to raise their price targets significantly. Nvidia’s 13F filing revealed its investments in several AI-centric companies, including SoundHound AI, Arm, Nanox Imaging, and Recursion Pharmaceuticals, all of which have seen their stock prices climb. Nvidia’s investment strategy underscores the chipmaker’s commitment to advancing AI technology across multiple sectors. Arm’s shares have seen a modest increase since Nvidia’s investment disclosure. The company, known for its semiconductor designs, has reported record-high revenue thanks to the AI boom, with its technology becoming increasingly indispensable in AI applications. Shares of Nanox Imaging have soared, driven by its groundbreaking digital X-ray source technology and AI-driven solutions for early disease detection. The company’s vision for accessible and preventative healthcare has resonated with investors, reflected in its stock’s impressive rise. Recursion Pharmaceuticals, another beneficiary of Nvidia’s investments, has seen its shares grow significantly. Despite a revenue dip, the company’s innovative use of machine learning for drug discovery highlights the potential of AI in revolutionizing the biotech industry. The post\n   \n    Not just SoundHound, these AI stocks are also riding Nvidia wave\n   \n   appeared first on\n   \n    Invezz Subscribe to our daily morning update newsletter and never miss out on the need-to-know market news, movements, and more. Thank you for signing up! You're all set to receive the Morning Update newsletter Stock Price data may be delayed up to 15 minutes. Copyright © 2024. Portions of this content may be copyrighted by Fresh Brewed Media, Investors Observer, and/or O2 Media LLC. All Rights Reserved. Portions of this content protected by US Patent numbers 7,865,496, 7,856,390, and 7,716,116. Investing in stocks, bonds, option and other financial instruments involve risks and may not be suitable for everyone. Portfolio results are unaudited and based on varying investment expiration dates. Terms of Service | Privacy Policy "
}