{
    "title": "Forget Nvidia: 2 Super Semiconductor Stocks to Buy Hand Over Fist, \nAccording to Wall Street",
    "date": "3/17/2024",
    "url": "https://finance.yahoo.com/news/forget-nvidia-2-super-semiconductor-120700741.html?prefer_reader_view=1&prefer_safari=1",
    "text": "Nvidia (NASDAQ: NVDA) is the role model for the artificial intelligence (AI) revolution. The company is worth a whopping $2.2 trillion as of this writing, with $1.5 trillion of that value added within the last 12 months alone. Nvidia's recent success boils down to its data center chips designed for processing AI workloads, which continue to attract incredible demand. But despite capturing the lion's share of investors' attention, Nvidia isn't the only opportunity in the semiconductor space. According to The Wall Street Journal, analysts have a consensus overweight (bullish) rating on two other names: Advanced Micro Devices (NASDAQ: AMD) and Axcelis Technologies (NASDAQ: ACLS). Here's why owning shares of AMD and Axcelis might be a fantastic idea, too. AMD's chips power some of the world's most popular consumer electronics, including Sony's PlayStation 5, Microsoft's Xbox Series X, and even the infotainment systems in Tesla's electric vehicles. However, investors' attention is now on the data center. The company has begun shipping its latest MI300 lineup of data center chips designed for AI workloads -- hardware that competes with Nvidia's industry-leading H100 graphics processing unit (GPU). The MI300 comes in two configurations: The MI300A combines GPU and CPU hardware to create an accelerated processing unit (APU), whereas the MI300X is a pure GPU. The MI300A was selected by the Lawrence Livermore National Laboratory to power its new El Capitan supercomputer, which is expected to be the fastest in the world when it comes online this year. However, AMD is also experiencing strong commercial demand for the MI300 range from leading data center operators like Oracle, Microsoft, and Meta Platforms. The MI300 will likely send AMD's data center revenue soaring in the next few years. It won't be easy to catch Nvidia in that segment. However, AMD does have a 90% market share in AI-enabled personal computers. Its Ryzen 700 series (Ryzen AI) chips are designed to handle powerful AI workloads on-device, leading to faster response times for the end user because requests aren't traveling back and forth to the data center. Millions of computers from leading manufacturers like Dell, HP, and Asus (among others) have already shipped with Ryzen AI chips. In the recent fourth quarter of 2023, Ryzen AI chips sent AMD's Client segment revenue soaring 62% year over year. The company plans to launch a new processor, which is up to three times faster than previous iterations, so this business is just getting warmed up. Combined with a forecast $3.5 billion revenue contribution from the MI300 series in their first full year of sales, 2024 is set to be AMD's biggest year yet. It's no surprise that the majority of the 50 analysts tracked by The Wall Street Journal have given AMD stock the highest possible buy rating. Axcelis Technologies isn't a glamorous producer of GPUs like Nvidia or AMD. In fact, it's relatively overlooked, with The Wall Street Journal tracking just eight analysts who cover its stock. Nevertheless, the majority of them have given it the highest possible buy rating, and it trades at a very attractive valuation right now, which might entice investors to follow the Street's lead. Axcelis manufactures ion implantation equipment, which is critical to the chip fabrication process. Producers of silicon carbide power devices -- which regulate electric power in workloads with high currents -- are a significant source of demand for Axcelis at the moment, thanks especially to the electric vehicle industry. Silicon carbide chemistry is more efficient than traditional silicon chemistry, which leads to more mileage per battery charge and faster charging times. The company is also preparing for growing demand from producers of AI-related semiconductors. Last year, the company noted that AI requires significantly more memory and storage capacity, which could make DRAM and NAND chips more complex to manufacture, and more expensive. Axcelis generated a record $1.13 billion in revenue during 2023, representing a 22.9% year-over-year increase. But here's the kicker: The company ended 2023 with an order backlog worth $1.2 billion, so 2024 is shaping up to be another record year. The stock is up over 400% in the last five years, but it has taken a breather over the last few months, suffering a 44% decline from its all-time high. That might spell opportunity, because based on the company's $7.43 in earnings per share in 2023, the stock now trades at a price-to-earnings (P/E) ratio of just 14.6. That's a 59% discount to the 35.6 P/E ratio of the iShares Semiconductor ETF, so Axcelis' stock is substantially cheaper than the rest of the chip industry, on average. Moreover, when you also consider Wall Street's bullish stance on Axcelis stock, there is a very clear case for buying it right now. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of March 11, 2024 Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, HP, Meta Platforms, Microsoft, Nvidia, Oracle, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Forget Nvidia: 2 Super Semiconductor Stocks to Buy Hand Over Fist, According to Wall Street was originally published by The Motley Fool Related Quotes "
}