{
    "title": "Nvidia beat Aramco to become the world's third-most valuable company",
    "date": "3/5/2024",
    "url": "https://qz.com/emails/daily-brief/1851306787/nvidia-leapfrogs-aramco",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Good morning, Quartz readers! Nvidia beat Aramco to become the third-most valuable company in the world. The chipmaker previously topped Amazon and Google parent Alphabet to become the third-most valuable company in the U.S. The U.S. might bar sales to China from its strategic oil reserve. A measure in a funding bill introduced to avert a government shutdown includes the prohibition. Spirit Airlines stock plunged after its merger with JetBlue was axed. The airlines called off their $3.8 billion combination, though which carrier initiated the breakup is up for interpretation. A flying car startup backed by a key SpaceX investor has almost 3,000 pre-orders. Alef Aeronautics’ Model A has a lot of early fans for its $300,000 Federal Aviation Administration-approved electric vertical takeoff and landing vehicle. Stronger demand for electric cars and hybrid vehicles boosted Ford’s sales last month as the Detroit-based carmaker tries to double down on its hybrid technology to hedge against Americans’ reluctance to go all-in on EVs. That being said, gas-powered trucks and cars still make up the majority of Ford’s sales. 10.5%: Gain in overall U.S. sales in February 12,045: Hybrid vehicles Ford sold, up 32% year over year 6,368: Electric vehicles sold, up 81% year over year 155,779: Traditional cars and trucks Ford sold in the same period “It exhibits near-human levels of comprehension and fluency on complex tasks, leading the frontier of general intelligence.” — AI startup Anthropic talking about its new chatbot model Opus, which outperformed GPT-4 (OpenAI’s most powerful version of ChatGPT) and Google’s Gemini in undergraduate- and graduate-level reasoning, math, and common knowledge assignments. Has OpenAI finally met its match in its Amazon-backed competitor? The price tag Alaska Airlines passengers put on their suffering from the Boeing door plug fiasco.In a fresh lawsuit against Boeing, three passengers said they have experienced “extreme panic, fear, and post-traumatic stress” from the incident. The amount they’re seeking is a lot more than what Boeing initially set aside to compensate family members of the 346 people who died from crashes of Boeing 737 Max aircraft between the end of 2018 and the start of 2019. Boeing later reached a $2.5 billion settlement with the Department of Justice for those crashes. 🚀 Super Micro Computer stock shot up 25% after snagging a coveted S&P 500 slot 😎 The 2024 solar eclipse is coming. Here’s your ultimate guide to it 🍎 Apple killed its car, got snubbed by Goldman, backtracked on iPhone apps, and was fined $2 billion 🤔 Your phone’s screen protector is slowly becoming pointless 🥪 Subway CEO to franchisees: Remodel your stores or lose them 💊 CVS and Walgreens will soon sell birth control pills over the counter Texas is on track to overtake California in  battery developments for its solar power grid. Cheap land is a big part of it. Cookie Monster hates shrinkflation. He’s not happy about the size of his cookies. Wikipedia editors who wrote 15,000 articles on U.S. roads went rogue. They took the work off the site and moved it all to one just about roads. Mukesh Ambani’s son is getting married and the pre-ceremony party had a Rihanna performance. And a nine-page dress code. And Mark Zuckerberg. The fanfare may be unparalleled. A bunch of helium was discovered in Minnesota and it may just be North America’s largest reserve. Probably enough to live out your Up dreams. Did you know we have two premium weekend emails, too? One gives you analysis on the week’s news, and one provides the best reads from Quartz and elsewhere to get your week started right. Become a member or give membership as a gift! Our best wishes for a productive day. Send any news, comments, big cookies, and 25 million balloons to talk@qz.com. Today’s Daily Brief was brought to you by Morgan Haefner. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}