{
    "title": "US stocks led higher by Nvidia and chipmakers, Powell says 'not far' from \nrate cuts",
    "date": "3/7/2024",
    "url": "https://www.proactiveinvestors.com.au/companies/news/1042644/us-stocks-led-higher-by-nvidia-and-chipmakers-powell-says-not-far-from-rate-cuts-1042644.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. After graduating from the University of Kent in the summer of 2022 with a degree in History, Josh joined Proactive later that year as a journalist in the UK editorial team.\r\n\r\nJosh has reported on a range of areas whilst at Proactive, including energy companies during a time of global crisis, aviation and airlines as the sector recovers from the pandemic, as well as covering economic, social and governance issues.\r\n Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Last updated: 08:25 08 Mar 2024 AEDT, First published: 23:31 07 Mar 2024 AEDT The S&P 500 reached a new all-time high of 5,157 points, buoyed by Federal Reserve Chair Jerome Powell's testimony and anticipation for the February jobs report. But it was tech stocks leading the gains, propelling the Nasdaq up by 1.5% to a big 16,273-point close, while the Dow Jones rose 0.3% to reach 38,791. Powell's reassurances on the economy and monetary policy, emphasizing the Fed's cautious approach to rate cuts, contributed to market optimism. Economic indicators showed stable jobless claims, but anticipation grew for Friday's non-farm payroll report. Additionally, gold prices continued to climb, surpassing $2,160 amid expectations of potential rate cuts. However, Victoria's Secret experienced a significant stock drop, down nearly 30%, due to disappointing sales guidance. Gains are increasing for the S&P 500 and the Nasdaq stock indexes while the Dow Jones's are dissipating. The Dow is now up 0.36%, while the S&P has added 0.98% and the Nasdaq Composite 1.46%. All but two of the latter pair's largest names are in the green, topped by NVIDIA Corp (NASDAQ:NVDA, ETR:NVD), Meta Platforms Inc (NASDAQ:META, ETR:FB2A, SWX:FB) and Broadcom Inc (NASDAQ:AVGO, ETR:1YD), up 3.7%, 3.4% and 3.1%. The only top 10 stocks in the red are not tech names, Eli Lilly and Visa. Fed chair Jerome Powell said rate-setters are \"not far from\" the point where they will make their first rate cut. He said the Federal Open Market Committee will cut rates when it has confidence that inflation is on track to hit 2%. \"When we do get that confidence--and we’re not far from it--it will be appropriate to dial back that level of restriction.\" Earlier he acknowledged that rates are currently \"well into restrictive territory\". We've had some macroeconomic data this morning, on jobs and trade, while Fed chief Jerome Powell is shooting the breeze in the Capitol for the second day. The US trade deficit widened 5.1% in January to $67.4 billion, the largest trade gap since April last year, a report from the Commerce Department stated. This was larger than economists' expectations of $63.4 billion. Exports were roughly flat, while imports rose 1.1%, driven by technology equipment and automobiles. Earlier, weekly jobless benefit claims were unchanged at 217,000, roughly as expected. This was as new claims from two weeks ago were revised up to 217,000 from 215,000, the government said. Continuing claims rose to 1.906 million from 1.898 million, while a small dip was forecast. January trade deficit widened to $67.4 billion vs. $63.5 billion est. & $64.2 billion in prior month … imports +1.1% while exports +0.1% pic.twitter.com/MqfpG1G7Ot As expected, US stock indexes have opened higher, with chipmakers and supermarket group Kroger driving the gains and the banking sector in the green after the New York Community Bancorp (NYSE:NYCB) rescue deal. The Nasdaq Composite was the bandleader again, matching up 0.79% to 16,158.5, followed by the S&P 500 adding 0.68% and the Dow Jones climbing 0.47%. Top riser on the S&P is Kroger Inc, up 7% to a two-year high after a beat-and-raise set of earnings. Semiconductor stocks were also notable risers, with Microchip Technology Inc, ON Semiconductor Corp, NXP Semiconductor NV and Broadcom Inc (NASDAQ:AVGO, ETR:1YD) all up between 2.5% and 5%, with NVIDIA Inc of course also up 2.15%. For the first time in what seems like a while, all the 'Magnificent 7' were in the green, with Tesla inching higher to break a three-day run. Among the notably smaller caps, NYCB was up 12% as investors and analysts continued to run the numbers on yesterday's $1 billion investment from a Steve Mnuchin-led consortium. JP Morgan analysts said: “While the list of investors injecting capital into the company is certainly impressive, with more questions than answers remaining at this juncture we wait on the sidelines for the coming conference call.” The Nasdaq is expected to lead gains as US markets open higher on Thursday following reassurances that rate cuts are likely to take place this year. Futures had the Nasdaq adding 67 points to hit 18,111 on Thursday’s opening bell, while the Dow Jones and S&P 500 were expected to tick up by 37 and 10 points respectively to 38,743 and 5,122. This follows gains seen on Wednesday, after Federal Reserve chair Jerome Powell told lawmakers that rate cuts were still likely this year. That said, jobs data is a “concern” for the wider economy, as per Finalto’s Neil Wilson, with Friday set to bring the week’s key non-farm payroll report. “Falling real income, weaker disposable spend, high borrowing costs and depletion of savings generated during the pandemic is going to weigh later this year,” he said. Among equities, New York Bancorp grabbed headlines on Thursday morning with news the troubled bank was set to receive US$1 billion through a capital raise. Victoria’s Secret plummeted nearly 30% in pre-market trading meanwhile, after the chain unveiled weak first-quarter sales guidance on Wednesday evening. And finally, Tesla shares continued a week-long losing streak ahead of the market’s opening after Elon Musk’s firm was dealt a downgrade by Morgan Stanley (NYSE:MS).   Sign up to receive alerts and news direct to your inbox Rowena Smith, CEO and managing director of Australian Strategic Materials Ltd (ASX:ASM, OTC:ASMMF), joins Jonathan Jackson in the Proactive studio to discuss the company’ s Dubbo Project, in Central West New South Wales. This project aims to extract and process critical minerals and rare earth... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive Australia PTY LTD ACN:132787654 ABN:19132787654. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}