{
    "title": "Nvidia: US tech giant unveils latest AI chip",
    "date": "3/18/2024",
    "url": "https://nz.news.yahoo.com/nvidia-us-tech-giant-unveils-023812938.html",
    "text": "Nvidia has unveiled its latest artificial intelligence (AI) chip which it says can do some tasks 30 times faster than its predecessor. The firm has an 80% market share and hopes to cement its dominance. In addition to the B200 \"Blackwell\" chip, its chief executive Jensen Huang detailed a new set of software tools at its annual developer conference. Nvidia is the third-most valuable company in the US, behind only Microsoft and Apple. Its shares have surged 240% over the past year and its market value touched $2tn (£1.57tn) last month. As Mr Huang kicked off the conference, he jokingly said, \"I hope you realise this is not a concert.\" But Bob O'Donnell from Technalysis Research who was at the event told the BBC that \"the buzz was in the air\". \"I haven't seen something like this in the tech industry in quite some time,\" he said. \"In fact, some people were making analogies to the early days of Steve Jobs types of presentations.\" Nvidia said major customers including Amazon, Google, Microsoft and OpenAI are expected to use the firm's new flagship chip in cloud-computing services and for their own AI offerings. It also said the new software tools, called microservices, improve system efficiency to make it easier for a business to incorporate an AI model into its work. Other announcements include a new line of chips for cars which can run chatbots inside the vehicle. The company said Chinese electric vehicle makers BYD and Xpeng would both use its new chips. Mr Huang also outlined a new series of chips for creating humanoid robots, inviting several of the robots to join him on the stage. Founded in 1993, Nvidia was originally known for making the type of computer chips that process graphics, particularly for computer games. Long before the AI revolution, it started adding features to its chips that it says help machine learning, investments that have helped it gain market share. It is now seen as a key company to watch to see how fast AI-powered tech is spreading across the business world. But competition is heating up from rivals such as AMD and Intel. Mr O'Donnell said the market was growing so quickly that \"even if Nvidia loses some share, they can still grow their overall business because there's just a lot of opportunities for everybody\". The crew of an Iranian fishing vessel has been rescued after their vessel was seized by armed pirates off Somalia, India's navy says. A large fire has broken out at an Indonesian military ammunition facility outside the capital Jakarta. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Dutch police have detained a man who walked out of a nightclub where hostages were being held after a tense hours-long stand-off. Envoys from several countries have laid flowers in Russia at the site of an attack on a concert hall that killed 144 people. Melbourne's Ben Brown has kicked three goals as the Demons scored a seven-point away victory against Port Adelaide.  Lachlan Lonergan has suffered a serious ankle injury as the ACT Brumbies overcame a nine-point deficit to beat the Queensland Reds 20-19 at Suncorp Stadium. The Dolphins have gone top of the NRL ladder with a 30-14 win over Gold Coast as their big-name off-season recruits Thomas Flegler and Herbie Farnworth shone. Goalkeeper Ryan Scott was the hero for the Newcastle Jets as they hung on to deny A-League Men finals hopefuls Melbourne City in a scoreless draw. Play this game for 1 minute and see why everyone is addicted. Goals from Anthony Caceres and Joel King have sealed a 2-0 win for Sydney FC over the Central Coast Mariners in the A-League Men. The Hurricanes and Blues have both recorded huge Super Rugby Pacific wins, thumping the Highlanders and Moana Pasifika, respectively. Police are investigating racial abuse yelled at the children of an AFL legend while they were playing in their yard as support floods in for the family. You will never turn off your computer again. St George Illawarra fullback Tyrell Sloan has scored two tries to help the Dragons bounce back to winning ways with a 20-12 NRL victory over a poor Manly side. Essendon star Jake Stringer has kicked the match-winning goal to pull the Bombers over the line against a tired St Kilda at Marvel Stadium. The great Kelly Slater has been beaten at Bells Beach as Australians Morgan Cibilic and Ethan Ewing advanced to the quarter-finals of the Rip Curl Pro.  The Western Force's unbeaten start to the Super Rugby Women season has come to an end, losing to Fijian Drua, while the Brumbies saw off the Reds. Wellington have dealt a blow to Western Sydney's finals hopes, while Michelle Heyman equalled an ALW record as Canberra staged a late comeback in Brisbane. Liam Wilson has been told by ring rival Oscar Valdez he must not give up on a promise he made to his dying dad, despite losing his latest world-title fight. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ Melbourne United will have home-court advantage for the deciding game of the best-of-five NBL championship series against the Tasmania JackJumpers. Endale Mekonnen and Chloe Mannix-Power have set the pace in the heats for the 2024 Stawell Gifts. The Western Force were up a man for 30 minutes against the Drua, but still suffered a 31-13 loss in wet and slippery conditions in Fiji. "
}