{
    "title": null,
    "date": "3/28/2024",
    "url": "https://www.zacks.com/stock/news/2247717/nvidia-nvda-surpasses-market-returns-some-facts-worth-knowing",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    March 28, 2024 NVDA Quick QuoteNVDA Better trading starts here. You follow Tale of the Tape - edit You follow Zacks Equity Research - edit Zacks Equity Research Tale of the Tape Nvidia (NVDA Quick QuoteNVDA  -  Free Report)     closed at $903.56 in the latest trading session, marking a +0.12% move from the prior day. The stock's change was more than the S&P 500's daily gain of 0.11%. On the other hand, the Dow registered a gain of 0.12%, and the technology-centric Nasdaq decreased by 0.12%. The maker of graphics chips for gaming and artificial intelligence's shares have seen an increase of 16.21% over the last month, surpassing the Computer and Technology sector's gain of 3.59% and the S&P 500's gain of 3.55%. The upcoming earnings release of Nvidia will be of great interest to investors. In that report, analysts expect Nvidia to post earnings of $5.48 per share. This would mark year-over-year growth of 402.75%. Simultaneously, our latest consensus estimate expects the revenue to be $24.17 billion, showing a 236.08% escalation compared to the year-ago quarter. For the full year, the Zacks Consensus Estimates are projecting earnings of $23.84 per share and revenue of $105.13 billion, which would represent changes of +83.95% and +72.56%, respectively, from the prior year. Investors might also notice recent changes to analyst estimates for Nvidia. These revisions typically reflect the latest short-term business trends, which can change frequently. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability. Our research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system. The Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 3.09% higher within the past month. Right now, Nvidia possesses a Zacks Rank of #1 (Strong Buy). With respect to valuation, Nvidia is currently being traded at a Forward P/E ratio of 37.85. This represents a premium compared to its industry's average Forward P/E of 29.64. It's also important to note that NVDA currently trades at a PEG ratio of 1.22. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Semiconductor - General was holding an average PEG ratio of 2.55 at yesterday's closing price. The Semiconductor - General industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 45, this industry ranks in the top 18% of all industries, numbering over 250. The Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow NVDA in the coming trading sessions, be sure to utilize Zacks.com. NVIDIA Corporation (NVDA) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}