{
    "title": "Corporate Insiders are Dumping These 5 Tech Stocks",
    "date": "3/22/2024",
    "url": "https://www.insidermonkey.com/blog/corporate-insiders-are-dumping-these-5-tech-stocks-1278729/5",
    "text": "Number of Hedge Fund Investors: 173 NVIDIA Corp (NASDAQ:NVDA) continues to see huge demand for its GPUs. NVIDIA Corp (NASDAQ:NVDA) recently revealed what it called the most powerful AI chip in the world. NVIDIA Corp’s (NASDAQ:NVDA) Blackwell B200 GPU and GB200 “superchip” would cost at least $30,000. NVIDIA Corp (NASDAQ:NVDA) earlier this month saw an important insider selling transaction when one of its board directors, Tench Coxe, sold 200,000 shares of NVIDIA Corp (NASDAQ:NVDA) at $850.10 per share on March 5. Since then through March 22 the stock has gained about 6.36%. Orbis Global Equity Strategy stated the following regarding NVIDIA Corporation (NASDAQ:NVDA) in its fourth quarter 2023 investor letter: “Never before has following the crowd made so much money. Nor, in our estimation, so little sense. But just look at the opportunities the crowd has left for those of us willing to take a different view. We could wax lyrical about the glaring difference in value between Korean banks priced at 4 times earnings, versus Apple at 28 times, despite diverging fundamentals—Apple is increasingly at risk of bans in China, while Korean banks could double their dividends. Or how the thick margin of safety at Intel, backed by listed stakes and real saleable assets, compares to the slim margin for error at NVIDIA Corporation (NASDAQ:NVDA), trading at 13 times next year’s projected revenue. That revenue that could be competed away over time, while Intel’s semiconductor “fabs” in the US are increasingly valuable as the east and the west drift further apart. Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below. You can also look at the 10 Mid-Cap Stocks with Insider Purchases and the 13 Best Mining Stocks To Buy Now. NYSE:ANETNASDAQ:AMDNASDAQ:BKNGNASDAQ:DDOGNASDAQ:NVDANvidia Corp (NASDAQ:NVDA)Datadog Inc. (NASDAQ:DDOG)13 Best Mining Stocks To Buy NowArista Networks Inc. (NYSE:ANET)Booking Holdings Inc. (NASDAQ:BKNG)10 Mid Cap Stocks with Insider PurchasesAdvanced Micro Devices Inc. (NASDAQ:AMD)Corporate Insiders are Dumping These 5 Tech StocksShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}