{
    "title": "Did Nvidia Fever Break? 'Monday Could Be A Rude Awakening,' Says Portfolio \nManager - NVIDIA (NASDAQ:NVDA)",
    "date": "3/9/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/37574862/did-nvidia-fever-break-monday-could-be-a-rude-awakening-says-portfolio-manager",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Nvidia Corp. NVDA shares fell 5.55% on Friday and, in the process, snapped a six-session winning streak. A portfolio manager on Friday warned about further downside. What Happened: “Monday morning could be a rude awakening,” said Jeff Kilburg, founder of boutique investment management firm KKM Financial, as he discussed Nvidia’s stock in a CNBC interview. He noted that Nvidia lost about $225 billion in market cap from its intraday peak on Friday. After closing down at $875.28, the stock lost an incremental $24+ in the after hours, he added. “If you look … technically there’s a gap all the way down to 625 where the 50-day moving average is where it hasn’t been in a long time,” Kilburg said. The gap-down the portfolio manager referred to is backfilling the gap-up the stock made in late-February following the release of the company’s fourth-quarter results. Source: Yahoo Finance Examining Friday’s stock move, Kilburg said, “It feels like the fever broke.” About 14 months ago, the stock had a market cap of about $350 billion and has since risen to $2.2 trillion, he added. “It seems like just two months ago when it was trading $550 to $600 it could not go any higher, and, sure enough, today, it actually went up to $974,” Kilburg said. He also said his firm was buying puts, which may have seemed senseless for a stock that appeared it was never going down. “Luckily that chain worked out very well today,” he said. See Also: Best Artificial Intelligence Stocks Why It’s Important: Kilburg may be pessimistic about Nvidia’s near term, but most tech analysts are bullish about the company’s fundamentals, given their optimistic view of artificial intelligence. Deepwater Asset Management’s Gene Munster said he expects the AI bubble to last for another three to five years before bursting. Wedbush’s Dan Ives sees the AI revolution in its first leg, as he said the current AI frenzy is nowhere near what took place between 1999 and 2000. During the 1999 dot-com bubble burst, sky-high valuations, lack of monetization andinfrastructure, weak balance sheets, froth business models and a macro backdrop characterized the tech world, he said. With Nvidia enjoying a dominant position in the market for AI accelerators, it is likely that the company will continue to be an outsized beneficiary of the AI revolution in the near- to mid-term. Read Next: Forget Gold And Bonds: Are These 2 AI Stocks The New Safe Havens In A Volatile Market? Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}