{
    "title": null,
    "date": "1/8/2024",
    "url": "https://seekingalpha.com/article/4661766-nvidia-corporation-nvda-j-p-morgan-42nd-annual-healthcare-conference-transcript",
    "text": "NVIDIA Corporation (NASDAQ:NVDA) J.P. Morgan 42nd Annual Healthcare Conference January 8, 2024 1:30 PM ET Company Participants Kimberly Powell - Vice President of Healthcare Conference Call Participants Harlan Sur - J.P. Morgan Harlan Sur All right. Good morning. And welcome to the first day of J.P. Morgan's 42nd Annual Healthcare Conference here in San Francisco. My name is Harlan Sur. I'm the semiconductor capital equipment analyst for the firm. For the fifth time in six years, we have the team from NVIDIA presenting. For those of you that don't know NVIDIA, they're a leader in accelerated computing, semiconductors, systems and software platforms in areas like artificial intelligence, deep learning, powering some of the world's most powerful supercomputers, driving compute innovations for cloud and hyperscalers, as well as large vertical markets like healthcare and life sciences. They are the foundational compute platform powering most of the generative AI initiatives worldwide. Here with us today from NVIDIA is Kimberly Powell, Vice President of Healthcare. She's responsible for the company's platforms for accelerating compute, AI and visualization that power the ecosystems of imaging, genomics, life sciences, drug discovery and healthcare analytics. Kimberly, thank you for joining us today and let me go ahead and turn it over to you. Kimberly Powell Thank you. Standing room only. If you guys want to come in, I'd love to have you come in. There's a little bit room up front. Take those other seats. I know I won't be able to see you. But Harlan, thank you so much for inviting us to come back for our fifth year at the conference. It's an extreme honor to be presenting along with the world leaders who are dedicated their lives to save others. And it's an amazing opportunity for us to be the only technology company here. And if you were here during the Recursion talk, I think this is a remarkable year for technology and healthcare and I want to be able to talk about that. So again, thank you to Harlan and the J.P. Morgan event for this opportunity to present. So let's just walk through. Before I get started, our -- a moment to read our safe harbor statement, which you are all quite familiar with. This presentation does contain forward-looking statements. And investors are advised to read our reports filed by the SEC for information related to risks and uncertainties facing our business. Okay, fantastic. Let's get started. NVIDIA is driving two simultaneous computing transitions, accelerated computing and AI. Accelerated computing enabled generative AI, driving platform shifts in software and enabling never before applications to be built like ChatGPT. AI is much more than a GPU problem though, okay? It's a full stack data center problem. We start out with three chip systems that need to be interconnected in ways that they can both scale up and scale out. Together, accelerated computing and generative AI are really the path forward for us to meet the performance, the scale that we need and the efficiency for the generative AI era, okay? Accelerated computing and generative AI make possible this digital biology era that I'm going to talk a lot about, whether it be the $100 genome or new omics fields entirely being created like some of the companies I'm going to talk about who are creating new fields of omics all together. Let's start with one of them that's super exciting called deep cell. Deep cells REMI is a new platform for cell imaging. It does cell sorting, imaging and high dimensional analysis, all in one instrument, and they're creating a new field called morpholomics. This is a video simulating a melanoma cell physically transforming to a functional state that gives it the ability to transmit to other tissues, otherwise known as metastasis. This is highly significant insights and information for both the research community and the clinical community. It's the next generation of flow cytometry and digital pathology put into one instrument. And by using their generative AI algorithms, they have one called the human foundation model. They can do that real time analysis of characterization of those cells right on the instrument using NVIDIA GPUs in our AI stack. This platform is inventing a new omics field called morpholomics. Another incredible exciting platform that is digitizing biology, it’s called spatial genomics. And it's the study of single cell genomics that is represented in 2D and 3D for that spatial understanding and the organization across tissue samples. It's giving new understanding of how cells interact and the genes they each express, and they have broad application in basic biology, clinical diagnostics and drug discovery. The NanoStrings new CosMx system is capable of taking a tissue of over a million cells and visualizing 600 different gene and protein targets per cell. You're listening to these numbers, 6,000 different genes and protein targets for all 1 million cells. And this is producing something like 6 terabytes of data per sample, per sample. The CosMx platform, it allows you to analyze more cell types, more cell states and biological pathways than any other system on the market. There's another phenomenon that is happening, not only the digitization of biology but also with generative AI, the ability to represent the two things that describe drugs, biology and chemistry in a computer. We have the opportunity to use generative AI to represent it. And there are like -- there are papers coming out almost momentarily that are new applications in this space and naming a few that just happened at the end of last year and there are -- a lot of these were presented at the NeurIPS conference, which is known for being the AI conference of the world, now has a drug discovery workshop that is being presented there. When you see these new fields appear at the NeurIPS conference, you know that something big is happening. So for example, docking algorithms, a new docking algorithm by a tech bio called Receptor AI. It has amazing capabilities to meet the capabilities of the new AlphaFold latest but at a 600 times reduction in compute cost. When you're doing docking, you want to explore the universe of chemical compounds. We want to go beyond screening a billion compounds into trillions of compounds. This is the way that we're going to get there. How about AlphaMissense from DeepMind. This team generative model, it can predict pathogenesisity or benign mutations of amino acid sequence across the proteum. I mean that is going to be incredibly powerful tool that is just being developed. And then the team at MIT use deep learning to discover not a single compound but an entire class of antibiotic compounds by using deep learning. And this is super helpful in the age of antibiotic resistance. These are just to name a few ways that we are representing either chemistry or biology in a computer to do things like generate new ideas, to make predictions, to even be able to model very complex interactions, and we're even moving into the age of design with generative AI. So this is a very big moment for the drug discovery industry. The last several decades, instruments, computation and mathematics, have paved the way to create the computer aided drug discovery industry, CAD, okay? Steady progress has been made in simulating the behavior of atoms and molecules starting back in the '80s with DFT and force fields and releasing our first computational molecular and modeling algorithm applications like CHARM. And in all the while we're starting to be able to digitize biology with things like x-ray, crystallography, being able to solve protein structures starting -- kicking off the structural biology drug discovery era, and we continue to make steady progress, larger and larger systems of simulation, more and more biology. Now we had high content screening hit the market, moving into being able to do things in virtual screening with Schrodinger's glide program in the early 2000s. The same time, solving the human genome and then moving into very much multiscale systems of simulation, where we now move in to the GPUs and use accelerated computing to do things multisystem and really understand the dynamic nature of ligands and proteins interacting. And of course, the Nobel prize of cryo electron microscopy, being able to see these proteins at atomic resolution. But something magical has happened since 2020. An age of generative AI, AlphaFold and even our own work with AstraZeneca started with MegaMolBART started to show that you can represent this data in a computer. At the same time, I just talked about, you're able to digitize biology at incredibly new scales and at multiscales with those platforms I just described. So now for the first time, we can represent the world of drugs, chemistry and biology in a computer. This is igniting an exponential expansion to the CAD industry, computer-aided drug discovery industry. Now we're seeing history repeat itself a little bit. What computer-aided design and electronic design automation did for the chip industry was to allow it to represent every stage of the process in a computer. First, there were small programs and then they evolved into applications and ultimately into platforms that codified the method, the method to design chips. Some platforms specialized in the front-end and other platforms specialized in the back-end. And this is a 40-year journey that now allows us to build essentially a perfect 100 billion transistor chip completely in silicon. Because of the CAD and EDA software industry, a trillion-dollar electronics industry has emerged and the world's first trillion-dollar chip company. What CAD and EDA did for chip design, the CAD industry, computer-aided drug discovery industry, will do for drug design. Two necessary conditions have arrived for drugs, digitizing biology and being able to represent it in a computer. We have the perfect conditions to see a massive expansion of this computer aided drug discovery industry to serve this $250 billion spent every year in R&D. Generative AI presents a new class of tools that will get codified into applications and new methods of discovery. In fact, go beyond discovery and evolve into design, helping create the conditions to no longer be a hit or miss industry. This new class of CAD will synthesize and systematically endeavor the process. And it will help it be more consistent and more efficient in finding drugs for specific diseases and specific people someday. And this will be what helps build the world's first trillion-dollar drug company. NVIDIA has been preparing for this moment for over a decade, building deep domain expertise and NVIDIA Clara, our domain specific computing platform for healthcare. We're building the essential components to accelerate the next generation of CAD. Parabricks for genomics, Isaac and Holoscan for next-generation medical instruments and robotic labs, BioNeMo for generative digital biology and chemistry, MONAI for preclinical and clinical medical imaging AI and NeMo to build scientific copilots and the ability to talk to your data. We build domain specific tools and application frameworks and now cloud services that can accelerate the CAD industry's ability to adopt the most important computing platform shifts of our time, which is accelerated computing and generative AI. So today we're going to focus in on BioNeMo. NVIDIA BioNeMo is a generative AI platform that provides services to develop, customize and deploy AI foundation models for drug discovery. BioNeMo provides large scale, optimized and easy-to-use training on your own proprietary data. We offer a growing collection of pre-trained models with applications across the drug discovery process. Models in the platform come from three sources; models invented by NVIDIA; open-source models we curate and optimize; and proprietary models developed by NVIDIA partners. BioNeMo is an AI factory for drug discovery. They are turning raw data into capable models that get deployed for discovery and design tasks and they're validated in the lab. And the data generated from the lab work goes back into the training process once again, completing what's called the lab in the loop. Biology and chemistry generative AI models are still quite small. We're still in the very, very early innings compared to other fields like natural language processing and what you're seeing with GPT-3, 4, 5, but we're growing in size and complexity. And so we still have a lot of progress to be had building larger and more capable models from digital biology data that already exist today and the continuously -- enhancing these models with the data that’s continuously being generated in the labs. So BioNeMo provides the biopharma ecosystem with large scale model training to effortlessly train and scale AI training to thousands of GPUs and you can train billion parameter models in days rather than the months it was taking. So for our very first announcement, we're excited to announce that Amgen, an early adopter NVIDIA DGX Cloud and BioNeMo, they're setting out to build generative AI models and search for novel human data insights and for drug discovery. Amgen is building a supercomputer called Freyja at their deCODE headquarters in Iceland for the use in one of the largest human data sets to build foundation models. Since deCODE's founding in 1996, it's curated more than 200 petabytes of deidentified human data from nearly 3 million individuals. This population scale data has a very, very unique human diversity and you want these models to see that diversity. deCODE has also helped sequence 500 million human genomes from volunteers in the UK Biobank. So working with such big data sets require large powerful AI systems like Freyja, and NVIDIA, it's an NVIDIA DGX SuperPOD with 240 H-100s, running NVIDIA BioNeMo to help them train these million parameter models in just a couple of days. We're also super excited today to be announcing that BioNeMo service is now advancing into beta and being adopted by leading CAD makers in the industry. With our growing collection of models, the BioNeMo service, CAD makers have access to optimize scale -- scalable and stable APIs that are enterprise grade and they can deploy services that they can rely on to build out their platforms and their methods that enable drug discovery and design. And the NVIDIA BioNeMo team carefully optimizes these models, delivering throughput and cost savings up to 7 times faster, which essentially means 7 times cheaper. Let's have a look at some of the amazing CAD platforms being built on the BioNeMo platform with generative AI. [Audio-Video Presentation] It's amazing. And if you were here this morning at the 7:30 talk with Chris, the CEO of Recursion, you would have seen the incredible platform they just announced called LOWE. You use your language to operate it, to kick off, so you use a generative AI inference to talk to it and then you inference another generative AI to generate molecules. So we're super excited to work with all of these amazing companies. We have another incredible announcement. Today, we are announcing the first partner, Recursion, to offer their foundation model called Phenom-Beta in BioNeMo. Not only it’s the first partner model, it's also the first vision transformer model targeting cellular data with applications in target and hit discovery. So Phenom-Beta provides representations of human cell images to systematically relate genetic and chemical perturbations to one another in very high dimensional space, helping identify potential new targets and drugs. So let's take a look at Phenom-Beta in action. [Audio-Video Presentation] Awesome. So Recursion has made great contributions to advance the science of phenomics and machine learning by providing the community with public data sets, and their recent launch of Valence Labs. And so we're excited to now have BioNeMo make their model easily accessible to the community for noncommercial use, and you can also contact Recursion if you're looking for a commercial license. So we're super excited about this extension of the BioNeMo platform to include our very first partner proprietary model. We're also excited to be announcing that NVIDIA's first -- NVIDIA's own invented first foundation model MolMIM, to be deployed in BioNeMo. MolMIM uses a large language model to learn chemical space using self-supervised learning objectives and MolMIM achieves state-of-the-art for constrained generation with what they call multiple simultaneous objectives. This is demonstrating superior generative performance in terms of the validity, the uniqueness and the novelty. So let's look at it. What MolMIM does is what's called controlled molecular generation of small molecules, finding novel molecules with desired properties, while constraining it to the original starting molecule. But MolMIM gives users the ability to specify their own objective functions like synthetic accessibility, drug likeness or solubility, binding affinity to steer this generative process. Control generation increases the likelihood of success by generating molecules that satisfy multiple objectives simultaneously. And then MolMIM can significantly reduce that expensive downstream time consuming screens that generally we’d have to go on because it's arriving at a much higher specified score that the user has defined. So we're really excited to take our work that we did in molecular generation and bring what not only user defined characteristics to it, but this active learning loop to do what essentially is an intelligent search of molecular space. So the next generation of drug discovery, the ecosystem, is really, really starting to emerge. BioNeMo is accelerating computer aided drug discovery platforms being built by software platform companies, being built by tech bio companies, even being built inside of large pharmaceutical companies. The field is diverse and it specializes to different disease focuses, it specializes to therapeutic classes and specializes in different discovery and design methods. And so building out a large ecosystem of next generation computer and drug discovery platforms is what we're all about and accelerating that process. So we're honored to be working with this world class ecosystem to accelerate their mission to shorten the time and increase the success rates of finding new medicines. So let me just talk a little bit about, we believe that the CAD industry will do for drug discovery what the CAD industry did for chip design. We believe the next trillion-dollar drug company is out there somewhere and it will be created. We want to help accelerate them by investing throughout the industry. We like to invest in companies who use our platform, enhance our platform and expand our platform, companies who are heavy in data and AI. It really means that they are pushing the boundaries of scale. They're going to push the boundaries of what NVIDIA has built at AI supercomputing scale, and we love working with companies that are very data first, AI heavy tech first. Companies who are developing methods to combine machine learning with physics simulation. This will really, really enhance our platform. This is going to be -- this is a new phenomenon. We need to get to new levels of scale in terms of simulation. And then AI companies who are pioneering AI design, right? This is a way for us to completely expand our platform. So these are incredible companies. It's a joy working with all of them and we look forward to continuing to accelerate them. 2023 was a remarkable year for NVIDIA healthcare. We announced the work that we're doing with three world leading companies. Amgen is pioneering generative AI design and has adopted BioNeMo and DGX Cloud, now extending their investment in the NVIDIA platform with a new supercomputer in Iceland to put their huge and unique human data sets to work and this ability to represent biology in a computer. Medtronic announced they're building AI platforms with NVIDIA Holoscan. The first one being GI Genius, which is the first FDA-cleared AI-assisted colonoscopy tool to help physicians detect polyps that can lead to colorectal cancer. And then a couple of months ago, we announced a multiyear strategic AI research collaboration with Genentech, building large scale AI models and then helping them accelerate the build-out of their platform, which they dub as the lab in a loop. So it's been an amazing year and we're just getting started. I think J.P. Morgan always makes us feel like we actually entered the new year after all the vacation and the champagne. You know, here we are. AI has opened healthcare to become a technology industry. We opened in this room with a very, very tech first company, Recursion. And we're delighted to be here on the first day as a tech company, really, really expanding your thought process on the role technology plays in this industry. Healthcare customers and partners already consume well over a billion dollars in NVIDIA GP computing each year, directly and indirectly through our cloud partners. The future market opportunity is incredible. The $250 billion drug discovery field is being reinvented with digital biology and the ability to use generative AI to represent biology in a computer. Billions of wearable devices connected to AI supercomputers in the cloud, comparing and predicting our health risk and billions of surgeries and imaging studies are going to use medical AI assistance. Generative AI is going to make healthcare a very large technology industry where NVIDIA can make a significant contribution. NVIDIA has been preparing for this moment for over a decade building deep domain expertise, domain specific computing platforms and a rich ecosystem of partners to accelerate this next generation of healthcare. So with that, I will conclude that without a doubt generative AI is the largest and most important technology shift of all of our lifetimes collectively. It has an absolute ability to open up the entire healthcare market and very importantly, to apply it to the world of drugs where biology and chemistry can be represented in computer. This is an inflection point, an absolute inflection point in our capabilities. Next generation CAD is emerging, it's emerging in software companies, it's emerging in tech companies, it's emerging in large pharma companies. And our investments in healthcare are paying off. And so with that, I really appreciate all of you standing in the back and joining us today for what is going to be, I think, an inflection point for J.P. Morgan where technology and AI is going to be the topic of every conversation. So thank you very much. Question-and-Answer Session Q - Harlan Sur We're going to jump into the Q&A. So if you have a question, feel free to raise your hand, wait for the -- we would appreciate if you just wait for the microphone. We have one up here in the front. Unidentified Analyst Thank you so much for a wonderful talk. Very, very exciting work. I wonder how does NVIDIA plan on -- how does NVIDIA plan on transitioning from the less regulated side of early stage lead generation drug discovery to the much more related aspects of software and hardware that you showed there, because that seems like a huge jump for a company? Kimberly Powell Yes. And what NVIDIA does as a company is we build the essential building blocks and components. We build those for the companies who really understand the method. The method of abiding by the regulatory process, the validation process, going through all the trials. That's -- it's really -- in order for us to really accelerate that, I think is to take away some of the challenging aspects of using generative AI. The challenging aspects of using generative AI is, one, standing up the infrastructure; two, getting the AI algorithm to work; three, getting it to scale. And so we're taking care of a lot of those aspects of accelerated computing and AI so that they can be a tool to be implemented in the methods that this industry is expert at. We're not the experts in this field or in the methods. We have the deep domain expertise, so we can translate them and see are their computing platform features that we should be building to facilitate that, but it is not in our future that we are going to get involved in the actual drug discovery business ourselves. Harlan Sur We have a question over here. Unidentified Analyst Thank you. This is very exciting. Can you share some of the current and potential challenges to capacity to meeting this exponential growth in demand and interest? Kimberly Powell Yes. I mean, I think we're at a really interesting time because as you -- if you even just again, watched Chris' interaction with his application this morning. He did a less than 10 minute demo, and he probably made more than 20 generative AI inference calls, okay? So just one human sitting on a computer for eight hours a day is going to be doing something like 10,000 inferences in their given workday on applications like that. And so we're at a really tricky time right now where what happened overnight was the entire world could use the capabilities of AI. And so that did create a condition where there was just a huge vacuum into some of the large applications that even my daughter uses or my mother-in-law can use in the area of ChatGPT. That's going to go away. But the other thing that we do every single day when NVIDIA wakes up in the morning is how do we make that computing more efficient? Because we know that the scale is just going to continue to expand and expand and expand. And if you look at -- we published, it's called MLPerf benchmarks, for example. These are by a consortium of academics and industry to be an unbiased measure of how well we're performing on both training and inferencing. NVIDIA is at the top breaking all the records. And when you're more efficient, when you're faster, you're reducing the cost or you're reducing the amount of computational footprint than any one application requires. So yes, from a physical capacity demand, we had to get over this hump of this, what nobody could have predicted demand. But we're now in full understanding that each and every one of us is going to have 20 copilots a day working on our behalf. And so we'll ramp up the physical capacity. But the next thing is addressing the software aspects of it, the computing efficiency of this because we're going to run out of power in the world, we're going to run out of space in the world. And so that is what NVIDIA does. When we talk about full stack computing platform, it's not just the silicon, it's the system software, it's the acceleration libraries and it's the application optimization that sits on top. All of it has to be addressed from end to end. Harlan Sur We have a question up here in the front. Kimberly Powell I could repeat the question… Unidentified Analyst Can you hear me? Thank you very much for this. As you know, the drug discovery and development ecosystem is really populated by various strata or levels of different companies that do different things, right, to ultimately deliver a drug to the clinic and ultimately to the patient. The barrier to entry for what you're providing seems to be mainly focused on very large players who may enable them to essentially do a lot more themselves rather than in-source or acquire. Do you foresee going forward? My question is a little bit forward thinking. This basically collapsing the ecosystem. In other words, making entire parts of our industry irrelevant because they're no longer needed. Kimberly Powell What -- if you let what we experienced in computer aided design for chips be any indicator. What happened was, at first, there was a lot of hodgepodge applications out there, everybody going after. And it did somewhat settle down and consolidate and codify. That's how I use words codify into methods. I think this -- and Chris said it again this morning, the method, the individual tools themselves are important and impressive, but the methods are what really, really matter at the end of the day. And the methods have to do with data as well as codifying the process into a software platform. So I can't -- it's hard for me to predict, because as I said, companies, it's even -- healthcare is obviously much more challenging than designing a chip in a lot of ways, right, because we're tackling very -- the disease focus and they're constantly evolving and people are completely unique. So to me, even if we solved some of it for the diseases we know of today and the way we solve them today, it's still so far away from personalized medicine. And what I would hope is that we're moving into methods that will ultimately personalize a medicine for me, right? And so we're going to go beyond what is today's status quo of developing drugs for a population of patients, and you're going to want to constantly turn this crank of entering my personal data into these systems that provide the right insights to find the biological pathways to my phenotype, et cetera, et cetera, into this wheel that would be, this is a drug made for me. So I think that is going to continue to expand actually, expand it rather than collapse it, because we want to go personal. Harlan Sur We have a question back there. Unidentified Analyst Yes. A quick question. Can you speak to how any of the approaches BioNeMo or what have you might apply to complex biologics? I assume most of the data were around small molecules, anything around very complex biologics? Kimberly Powell Yes, that's the field that everybody wants to get in. And I think that's why proteins are being so highly studied and trying to essentially be again, represented in computers, proteins, enzymes because of their attractable traits for drugs. And so that's where the market is right now, even the AI market, so heavily focusing on protein. And then being able to now see biology at very different resolutions and scales, I think, is going to continue to facilitate that. So I don't think that it's actually in -- in my experience, I feel that it's swing very heavy in terms of complex biologics and the work that the companies are doing. Harlan Sur We have our last question back there. Unidentified Analyst Does NVIDIA have any plans to develop a data marketplace or collaborative ecosystem within the BioNeMo platform for sharing data between pharmaceutical companies when they're -- for the training sets, because for companies that might not have such expansive data sets? Kimberly Powell Yes. At this moment, we haven't. We're all about thinking about what is going to -- what's necessary to push the industry to the next level. If it's open data sets and the generation of synthetic data, that is it. We're open to having that discussion about collaboration. At this point, we're trying to put the AI capabilities in the hands of everybody, but happy to have that conversation if you have ideas. Harlan Sur All right. Well, we are just about out of time, Kimberly. Great insights. Thank you for the participation. Kimberly Powell Thank you. "
}