{
    "title": null,
    "date": "1/30/2024",
    "url": "https://seekingalpha.com/news/4060344-amd-sees-current-quarter-revenue-below-estimates-with-sequential-decline-in-three-units",
    "text": "Justin Sullivan/Getty Images News Shares of Advanced Micro Devices (NASDAQ:AMD) on Tuesday seesawed in extended trading, after the U.S. chip designer provided revenue guidance for the current quarter that came in below expectations. AMD stock fell as much as 6.5% to $160.81 after hours, while also adding as much as 2.2% to $175.88. It was last down 2.1%. AMD (AMD) said it earned 77 cents per share on an adjusted basis for Q4 2023 on revenue of $6.2B. Analysts were expecting the company to report earnings of 77 cents per share on sales of $6.14B. For Q1 2024, the Santa Clara, Calif.-based firm sees revenue of about $5.4B, plus or minus $300M. The consensus estimate is $5.75B. AMD's (AMD) guidance comes after rival Intel (INTC) last week disappointed investors with its forecast. AMD (AMD) said it sees revenue in its client, embedded and gaming segments to decline sequentially. The client unit caters to the personal computer market while the embedded business houses programmable chips. The company sees revenue in its Data Center segment to be flat, with a seasonal decline in server sales offset by a strong ramp in graphics processing units (GPUs). For Q4 2023, AMD (AMD) said adjusted net income came in at $1.2B, compared to $1.1B in Q4 2022. Gross margin was 51%, matching the performance from a year ago. \"We finished 2023 strong, with sequential and year-over-year revenue and earnings growth driven by record quarterly AMD Instinct GPU and EPYC CPU sales and higher AMD Ryzen processor sales,” AMD (AMD) top boss Lisa Su said in a statement. “Demand for our high-performance data center product portfolio continues to accelerate, positioning us well to deliver strong annual growth in what is an incredibly exciting time as AI re-shapes virtually every part of the computing market,\" Su added. Breaking down the quarterly performance of AMD's (AMD) segments, data center business revenue was $2.3B (+38% Y/Y), client unit revenue was $1.5B (+62% Y/Y), gaming revenue was $1.4B (-17% Y/Y) and embedded revenue was $1.1B (-24% Y/Y). The company also noted that the launch of its MI300 artificial intelligence chips - with which AMD (AMD) is seeking to compete with market leader Nvidia (NVDA) - has set up growth for 2024. “AMD (AMD) executed well in 2023 despite a mixed demand environment. We drove year-over-year revenue growth in our Data Center and Embedded segments and successfully launched our AMD Instinct MI300 GPUs positioning us for a strong product ramp in 2024,\" the company's finance chief Jean Hu said. AMD (AMD) in October last year had forecasted sales of $2B for the MI300 chip in 2024. The chip designer will be holding an earnings conference call at 1700 ET. "
}