{
    "title": "China’s Military, AI Bodies Still Buying Nvidia Chips Despite US Ban",
    "date": "1/15/2024",
    "url": "https://www.asiafinancial.com/chinas-military-ai-bodies-still-buying-nvidia-chips-despite-us-ban",
    "text": "Public tender documents show dozens of Chinese military and AI research entities have bought Nvidia semiconductors since curbs were imposed by Washington  A review of tender documents in China suggests that the US export ban on advanced computer chips made by tech giant Nvidia has been ineffective. Chinese military bodies, state-run artificial intelligence research institutes and universities have purchased batches of Nvidia semiconductors banned by the US over the past year, a review by Reuters revealed. The sales by largely unknown Chinese suppliers highlight the difficulty that Washington faces, despite its bans, in completely cutting off China’s access to advanced US chips that could fuel breakthroughs in AI and sophisticated computers for its military.   Buying or selling high-end US chips is not illegal in China and the publicly available tender documents show dozens of Chinese entities have bought and taken receipt of Nvidia semiconductors since restrictions were imposed. These include its A100 and the more powerful H100 chip – whose exports to China and Hong Kong were banned in September 2022 – as well as the slower A800 and H800 chips Nvidia then developed for the Chinese market but which were also banned last October. The graphic processing units – a type of chip known as GPUs – that are built by Nvidia are widely seen as far superior to rival products for AI work as they can more efficiently process huge amounts of data needed for machine-learning tasks.  Indeed, ‘Nvidia’s GeForce RTX gaming graphics cards are being allegedly being reconfigured by factories in China to turn them into dedicated AI accelerators, according to a report last week by the Financial Times. “Thousands of Nvidia gaming graphics cards are being stripped of their core components in factories and workshops every month, before being installed on new circuit boards,” the FT reported, citing two factory managers and two chip buyers, who said this was being done because of the lack of high-end processors in the country. Demand for these GPUs surged four-fold in December, weeks after the US expanded its chip curbs, but industry experts warned that modifying Nvidia’s gaming chips violate the company’s IP rights and Nvidia said doing this “is not a viable way to create data centre compute clusters” for artificial intelligence, the report said. But it helps explain continued demand for the banned Nvidia chips, despite the nascent development of rival products from Huawei and others. Prior to the bans, Nvidia commanded a 90% share of China’s AI chip market. Purchasers included elite universities as well as two entities subject to US export restrictions – the Harbin Institute of Technology and the University of Electronic Science and Technology of China, which have been accused of involvement in military matters or being affiliated to a military body contrary to US national interest. The former purchased six Nvidia A100 chips in May to train a deep-learning model. The latter purchased one A100 in December 2022. Its purpose was not identified. None of the purchasers mentioned in this article responded to requests for comment.  The review found neither Nvidia nor retailers approved by the company were among the suppliers identified. It was not clear how the suppliers have procured their Nvidia chips. In the wake of US curbs, however, an underground market for such chips in China has sprung up. Chinese vendors have previously said they snatch up excess stock that finds its way to the market after Nvidia ships large quantities to big US firms, or import through companies locally incorporated in places such as India, Taiwan and Singapore. Reuters sought comment from 10 of the suppliers listed in tender documents including those mentioned in this article – none responded. Nvidia said it complies with all applicable export control laws and requires its customers to do the same. “If we learn that a customer has made an unlawful resale to third parties, we’ll take immediate and appropriate action,” a company spokesperson said. The US Department of Commerce declined to comment. US authorities have vowed to close loopholes in the export restrictions and have moved to limit access to the chips by units of Chinese companies located outside China. Chris Miller, professor at Tufts University and author of “Chip War: The Fight for the World’s Most Critical Technology”, said it was unrealistic to think US export restrictions could be watertight given that chips are small and can easily be smuggled. The main aim is “to throw sand in the gears of China’s AI development” by making it difficult to build large clusters of advanced chips capable of training AI systems, he added.  The review includes more than 100 tenders where state entities have procured A100 chips and dozens of tenders since the October ban show purchases of the A800. Tenders published last month also show Tsinghua University procured two H100 chips while a laboratory run by the Ministry of Industry and Information Technology procured one. The buyers include one unnamed People’s Liberation Army entity based in the city of Wuxi, Jiangsu province, according to tenders from a military database. It sought 3 A100 chips in October and one H100 chip this month. Military tenders in China are often heavily redacted and Reuters was not able to learn who won the bids or the reason for the purchase.  Most tenders show the chips are being used for AI. The quantities of most purchases are, however, very small, far from what’s needed to build a sophisticated AI large language model from scratch. A model similar to OpenAI’s GPT would require more than 30,000 Nvidia A100 cards, according to research firm TrendForce. But a handful can run complex machine-learning tasks and enhance existing AI models. In one example, the Shandong Artificial Intelligence Institute awarded a 290,000 yuan ($40,500) contract for 5 A100 chips to Shandong Chengxiang Electronic Technology last month. Many of the tenders stipulate suppliers have to deliver and install the products before receiving payment. Most universities also published notices showing the transaction was completed. Tsinghua University, dubbed China’s Massachusetts Institute of Technology, is a prolific issuer of tenders and has purchased some 80 A100 chips since the 2022 ban. In December, Chongqing University published a tender for one A100 chip that explicitly stated it could not be second-hand or disassembled but had to be “brand new”. The delivery was completed this month, a notice showed.   NOTE: Further detail was added to this report (about Chinese factories repurposing Nvidia gaming cards) on January 15, 2024.         Jim Pollard is an Australian journalist based in Thailand since 1999. He worked for News Ltd papers in Sydney, Perth, London and Melbourne before travelling through SE Asia in the late 90s. He was a senior editor at The Nation for 17+ years.  Asia Financial is owned by Capital Link International Holdings Ltd,\n902, Wilson House 19-27 Wyndham Street, Central, Hong Kong. www.capitallinkintl.com "
}