{
    "title": "How AI Is Used in the Financial World Today",
    "date": "1/3/2024",
    "url": "https://biztechmagazine.com/article/2024/01/how-ai-used-financial-world-today",
    "text": "Through podcasts, books, research, talks and Twitter conversations, these are the influential voices all small business IT professionals should be listening to right now. Autumn is an associate editorial director and a contributor to BizTech Magazine. She covers trends and tech in retail, energy & utilities, financial services and nonprofit sectors. Autumn is an associate editorial director and a contributor to BizTech Magazine. She covers trends and tech in retail, energy & utilities, financial services and nonprofit sectors. The integration of artificial intelligence and the financial sector might seem like a new development, but it actually has historic roots. “It’s important to understand that AI has been in banking for decades,” says Malcolm deMayo, vice president of financial services at NVIDIA. “Financial services have been leveraging machine learning and early versions of neural nets for a long time.” From its early applications to its current sophisticated algorithms, AI has been a steadfast companion in shaping the financial industry's strategies and operations. Its multifaceted use cases, spanning predictive analysis, risk management, and personalized customer experiences, are a testament to its enduring significance. As IT decision makers begin 2024, organizations are expected to use AI to provide better customer experiences, address talent shortages, and improve their ESG sustainability and environmental frameworks, according to NVIDIA’s survey of nearly 500 financial professionals.  Here’s what you need to know about these three AI use-cases: Click the banner to learn how to effectively leverage your data for more data analytics success. Financiers recognize the cost reduction that AI introduces. More than a third of survey respondents said that AI led to operational efficiencies, and 20 percent said AI reduced the total cost of ownership in 2023. AI can also offer banks better computing power. According to deMayo, “The traditional computing that’s in every bank’s data center will not run AI efficiently.” But creative tech solutions can support data needs: NVIDIA’s new GPU and software library helped lower the cost of inference by a factor of four, deMayo says. AI can also reduce costs by supporting workload portability for use across hybrid cloud infrastructures, enhancing customer service, and building stronger fraud detection and prevention tools. AI can also help IT leaders identify and derive value from their investment in technology. “There’s an opportunity to unlock value,” deMayo says, both across internal initiatives and in customer-facing endeavors. READ MORE: Get started with analytics and artificial intelligence. Nearly half of survey respondents (46 percent) report that AI has improved their customer experience. Accelerated large language models make chatbots more effective and less frustrating, increasing customer satisfaction. “Banks have customers who are expecting the same kinds of experiences they get when they jump on their retail e-commerce experience,” deMayo says. “AI gives a very big set of capabilities to help banks deliver on that customer experience desire.” The loads of data that financial institutions handle can be put to more effective use with AI. “We’re helping them shift through mountains of social news, financial news and financial reports to discover patterns, trends and ideas that they can trade against so that they can deliver more value to their customers.” RELATED: What questions should financial services companies be asking about AI? Many financial institutions are experiencing a labor shortage and are either spending time recruiting the most qualified AI experts or allocating resources to upskill current employees. But using AI technology to improve these labor challenges can help. “There’s an opportunity to leverage AI as a teacher that can teach at the pace of the individual,” deMayo says, potentially enabling cross-training and upskilling among current employees in addition to onboarding new workers. For example, large language models have the capacity to improve education in banking — for consumers as well as for employees. DeMayo points to algorithmic trading as a basic example of how financiers have long deployed tech to amplify results. “Financial institutions have a lot of smart people, and they’ve been using technology that enables them to offer their services for a very long time,” he says. Malcolm deMayo\nVice President of Financial Services, NVIDIA But AI isn’t just about the numbers; it’s about the ethos and principles organizations use as well. In NVIDIA’s 2023 report, 72 percent of respondents said their company understood the ethical issues surrounding AI. And over 10 percent of NVIDIA survey respondents reported that sustainability, social and governance configure into their AI plans. “Sustainable computing needs to be something that every organization in financial services is thinking about,” deMayo says. “Energy usage is an area where we’ve made big strides.” On the whole, AI represents a great deal of opportunities for finance to improve productivity, reduce costs and generate new revenue streams. “All of the use cases are exciting,” says deMayo. Unlock white papers, personalized recommendations and other premium content for an in-depth look at evolving IT Data Analytics NVIDIA GTC 2024: How AI and HPC Are Creating  a ‘New Frontier of Capital Markets’ Cloud Why Improving Customer Service Is the Goal of Most Digital Transformation Visit Some Of Our Other Technology Websites: Tap into practical IT advice from CDW experts. Visit the Research Hub Copyright © 2024 CDW LLC 200 N. Milwaukee Avenue, Vernon Hills, IL 60061Do Not Sell My Personal Information "
}