{
    "title": "Nvidia inks order for 16000 AI GPUs worth $500 million — Indian data center \ncompany seeks to own 32000 Nvidia ...",
    "date": "1/13/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/nvidia-inks-order-for-16000-ai-gpus-worth-500-million",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. India is an essential market for Nvidia now that U.S. export restrictions block off China. According to a report from Reuters, Yotta, a data center and server company based in India, is set to buy 16,000 Nvidia GPUs worth $500 million by March 2025. This deal is coming soon after U.S. sanctions banned the export of many of Nvidia's top-end GPUs to China, and it seems India is at least partially filling the void where Chinese demand used to be. Reuters talked to Yotta CEO Sunil Gupta, who said the company would order 16,000 H100 and GH200 GPUs by March 2025. These GPUs are estimated to be worth around $500 million altogether, though it's unclear how many Yotta is ordering. In 2022, the price of one H100 GPU was over $30,000, but rough math implies $500 million would be enough to buy several thousand H100 chips in addition to GH200, which is presumably significantly more expensive. Yotta may be getting a better deal from Nvidia, and perhaps the order doesn't include many GH200s. Before this latest purchase, the company also bought another 16,000 H100 GPUs last year, and they're due for delivery this July. This deal was worth about $500 million, as Gupta claimed its order for H100 and GH200 would bring the total cost of Yotta's AI GPU purchases to $1 billion. The fact that Yotta can purchase higher-end hardware without significantly increasing its budget implies that perhaps H100 isn't as expensive as it used to be. This may be the case, considering that H200 has since succeeded H100. The report links this Yotta-Nvidia deal to the latest U.S. sanctions on China, which have banned the export of many high-end GPUs to the country. Nvidia wasn't allowed to sell its H100 GPUs in China, so it made a slower version of H800 to comply with the sanctions. Months later, however, H800 was banned from China, meaning Nvidia had to create more variants of its GPUs that it could sell in China. Although the U.S. government seems to be finally easing up on increasing the strictness of its sanctions, it's uncertain whether more rules will be put in place, and uncertainty isn't conducive to business. This may be why India is a more appealing place to strike AI GPU deals because even though it's not an ally of the U.S., India is unlikely to become the next target for sanctions soon. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Matthew Connatser is a freelancing writer for Tom's Hardware US. He writes articles about CPUs, GPUs, SSDs, and computers in general. GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 New open source GPU is free to all — FuryGPU runs Quake at 60fps, supports modern Windows software Best Ultrawide Gaming Monitors 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Roshan Ashraf ShaikhMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Anton ShilovMarch 27, 2024 By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 By Paul AlcornMarch 27, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}