{
    "title": "DigitalOcean and NVIDIA Expand Access to AI Compute for Startups and \nGrowing Digital Businesses",
    "date": "1/18/2024",
    "url": "https://www.dbta.com/BigDataQuarterly/Articles/DigitalOcean-and-NVIDIA-Expand-Access-to-AI-Compute-for-Startups-and-Growing-Digital-Businesses-162221.aspx",
    "text": "DigitalOcean, the developer cloud optimized for startups and growing digital businesses, is offering the virtualized availability of NVIDIA H100 Tensor Core GPUs on its Paperspace platform, providing access to one of the market’s powerful GPUs. According to the company, this provides startups and growing digital businesses with state-of-the-art infrastructure crucial for developing the next generation of artificial intelligence/machine learning (AI/ML) applications. Through this offering and other recent enhancements, DigitalOcean continues to simplify cloud computing and provide an affordable, end-to-end solution for developing, deploying, and scaling AI models. The surge in interest in accelerated AI computing from businesses looking to elevate their capabilities in AI/ML has fueled the demand for NVIDIA H100 GPUs. NVIDIA H100 GPUs can be accessed on demand or reserved for a specific term limit, allowing customers to select the most cost-effective consumption model for their business needs, according to the company. “While many vendors are optimizing their offerings to serve large enterprises, DigitalOcean is proud to offer startups and growing digital businesses with reliable and flexible access to NVIDIA H100 GPUs,” said Kanishka Roychoudhury, GM of AI/ML at DigitalOcean. “As we look ahead, DigitalOcean remains committed to providing solutions that offer superior performance and keep costs in check, lowering the barriers of entry for smaller businesses looking to leverage AI to improve profitability and efficiency.” Customers can access these NVIDIA H100 GPUs as individual machines or as clusters, providing versatility for use cases ranging from multi-node model training to complex inferencing services. DigitalOcean has also made significant improvements to the underlying network infrastructure, now offering interconnect speeds of 3.2TBps to enable optimal performance for users operating one or more of these eight-chip configurations. “Businesses of all sizes are increasingly looking to AI to boost efficiency and better serve customers,” said Dave Salvator, director of accelerated computing products at NVIDIA. “The availability of NVIDIA H100 GPUs through DigitalOcean’s Paperspace platform will help empower the next generation of startups, providing greater access to the tools they need to develop cutting-edge AI products and solutions.” In addition to providing computing power, DigitalOcean is dedicated to ensuring AI/ML businesses have a seamless experience deploying their models into production through gradient deployments. These updates make it easier than ever for Paperspace platform users to deploy and scale modern AI applications, including: For more information about this news, visit www.digitalocean.com. Subscribe to Big Data Quarterly E-Edition "
}