{
    "title": "Best of AI week: Nvidia, regulation, election risk, and more",
    "date": "1/26/2024",
    "url": "https://finance.yahoo.com/video/best-ai-week-nvidia-regulation-201712307.html",
    "text": "AI is now a part of our lives: regulators are looking to keep tabs on the biggest players, the tech titans are now looking to make money from it, and we’re all still wondering – is it the end of civilization as we know it? Who’s going to get there first on meaningful regulation? Who are the biggest AI players you haven’t thought of yet? Will legal battles squash innovation, or open it up? Yahoo Finance caught up with experts across the industry to answer these questions and more as part of its weekly series The AI Revolution. Here are some of the best moments. Where are we now? (00:00:05) Yahoo Finance Tech Editor Dan Howley discussed Nvidia's (NVDA) AI advancements, competitors Intel (INTC) and Advanced Micro Devices (AMD), and where the AI race will go moving forward. \"Nvidia is the AI king. They eclipsed the $1 trillion market cap in June,\" Howley said. \"The big ones (rivals) really are AMD, which has been a long-time thorn in their side, and Intel.\" Radio Free Mobile Founder Richard Windsor discussed the outlook for generative AI adoption and corporate valuations. Windsor explained, \"There is a big use case for artificial intelligence, yes. It's just not worth the valuations that people are ascribing to them because they think the prices are going to be much higher than they really are.\" Finding a referee (00:00:46) Yahoo Finance Legal Reporter Alexis Keenan broke down global AI regulation policies—comparing how different countries are setting up different rules for AI. Keenan said, \"The deep fakes, these are one of the major risks that IP lawyers, tech lawyers talk about ... Also, AI that impacts government infrastructure, that's another big area of concern.\" U.S. Rep. Ted Lieu (D-Ca.) is a part of the bipartisan effort introducing the Federal Artificial Intelligence Risk Management Act to Congress, which aims to provide AI regulatory guidelines. Rep. Lieu explained, \"What this bill does is it mandates that the standards set forth by the (National) Institute of Standards and Technology be applied to both the Federal government as well as any companies that want to contract with the Federal government.\" Tom Davenport, Babson College President’s Distinguished Professor of Information Technology and Management, discussed the adoption of AI and AI regulation across the globe. Davenport said, \"A lot of potential opportunity. The biggest barrier now is in the data and how organizations get their data ready for generative AI.\" Monetizing AI (00:01:37) AI Now Institute Co-Founder and Chief Advisor Meredith Whittaker broke down the recent tech sector layoffs and restructurings that have been fueled by AI. Whittaker said, \"I think what we need is to see increased union density, so workers have more leverage over deciding where AI is introduced and how it's used.\" Boosted.ai Co-Founder and CEO Joshua Pantony highlighted the benefits of using generative AI models for investing, and how it is different from past generations of investing programs. Pantony explained, \"If you use a system like ours, you're going to be able to learn information a lot faster. And the other side is really around efficiency of your process.\" Legal woes (00:02:14) Ryan Abbott, Brown Neri Smith & Khan, LLP Partner, broke down legal precedents surrounding AI including patent and copyright infringement laws. \"What we're fundamentally seeing is this new sort of activity where you have machines that are behaving like people, and legal systems that were designed with human centric concepts,\" Abbott said. \"A company like Novo Nordisk (NVO) uses AI to develop Wegovy or Ozempic, can they patent something like that, or do you need a traditional human inventor?\" Accenture (ACN) Chief Technology Officer Paul Daugherty discussed AI data and the ways workplace AI may effectively be incorporated into many business models to benefit workers. Daugherty explained, \"There hasn't been anything like generative AI ... it is different. The reason is one, the speed ... the second is this human-like nature of the technology. And as a result of that, it changes everything that people do.\" Election risk (00:02:59) Yahoo Finance Senior Columnist Rick Newman broke down how AI will impact the U.S. Presidential election in 2024 and what Americans need to be on the lookout for. Newman said, \"Disinformation in elections is not new ... so I think what's going to be new in 2024 is just the sophistication of the bogus information. It's a lot easier to use AI to do fake videos that look like real people, fake audio recordings.\" Generative AI speaker and advisor Nina Schick discussed the political ramifications to come from the AI boom. Schick explained, \"When people start to understand that anything can be synthetic, anything can be AI generated, anything can be faked, they begin to lose trust in everything. And I think that is one of the core challenges we're facing.\" Video highlights: 00:00:05 - Yahoo Finance's Dan Howley 00:00:26 - Radio Free Mobile Founder Richard Windsor 00:00:46 - Yahoo Finance's Alexis Keenan 00:01:04 - U.S. Rep. Ted Lieu (D-Ca.) 00:01:26 - Tom Davenport, Babson College 00:01:37 - AI Now Institute Co-Founder and Chief Advisor Meredith Whittaker 00:02:01 - Boosted.ai Co-Founder and CEO Joshua Pantony 00:02:14 - Ryan Abbott, Brown Neri Smith & Khan, LLP Partner 00:02:38 - Accenture Chief Technology Officer Paul Daugherty 00:02:59 - Yahoo Finance's Rick Newman 00:03:21 - Generative AI speaker and advisor Nina Schick Related Quotes "
}