{
    "title": "Singtel ropes in industry partners in datacentre push",
    "date": "1/31/2024",
    "url": "https://www.computerweekly.com/news/366568455/Singtel-ropes-in-industry-partners-in-datacentre-push",
    "text": "Alexander - stock.adobe.com Singtel has teamed up with a slew of global and regional industry partners to grow its datacentre business and advance developments in artificial intelligence (AI) in Singapore and Southeast Asia. These include partnerships with Nvidia to make graphics processing units (GPUs) more accessible to businesses; Gulf Energy and Medco Power to tap renewable energy; and Deston and QCT to improve power and water efficiency. Speaking at the launch of Singtel’s datacentre brand, Nxera, Bill Chang, CEO of Nxera and Singtel’s Digital InfraCo datacentre unit, said the partnerships will support the telco’s efforts to develop a new generation of AI datacentres. Singtel’s first AI datacentre, the 58MW DC Tuas, will be the first of its kind to incorporate more efficient cooling services, such as direct-to-chip liquid and immersive cooling, enabling it to achieve a power usage effectiveness (PUE) of around 1.23 at full load. The datacentre will also incorporate advanced real-time server monitoring platforms to ensure smooth management of expensive GPU clusters while running multiple connected networks. “We will be replicating the buildout with our JV [joint venture] partners like Gulf Energy and AIS in Thailand, and with Telkom and Medco in Indonesia, all of whom are the leading businesses in their respective sectors and countries,” said Chang. “We will go ‘glocal’ in our expansion strategy to achieve speed and efficiency in our execution.” Through its partnership with Nvidia, Singtel will also become an Nvidia cloud partner in the region, and offer GPU clusters to support its customers’ cloud and AI needs through a GPU-as-a-service (GPUaaS) offering. “With our GPUaaS, we will democratise AI for enterprises, and make available the scarce and expensive GPUs for rent, all managed in our purpose-built AI DCs,” he said. Computer Weekly understands Singtel will also offer its customers Nvidia AI Enterprise, a software platform for building and deploying AI applications, including generative AI. Sustainability has been a key focus for datacentre operators, with datacentres expected to account for the bulk of carbon emissions by the ICT industry. To that, Singtel hopes to leverage renewable energy sources from its energy partners to reduce its datacentre carbon footprint, with the aim of achieving operational net-zero emissions by 2028. It will also shut down five of its older datacentres with PUEs of about 1.8 on average and move its customers to DC Tuas. Heng Swee Keat, Singapore’s deputy prime minister and coordinating minister for economic policies, lauded Singtel’s efforts to manage the “dual challenges of digitalisation and decarbonisation”. He noted that Singtel’s regional datacentre business is built on a long-standing ecosystem of communication networks and partners that it has established in the region, placing it in a good state to fuel the growth of ASEAN’s digital economy. Heng added that Singtel’s efforts to support pervasive adoption of AI and transformation of enterprises in Singapore will strengthen the country’s digitisation journey and standing as a digital hub. This will require an AI talent pool that can be built up through pre-employment training and continuing education, as well as reskilling and upskilling to keep up with fast-moving developments, he said. To that end, Nxera is creating a Regional Sustainable Datacentre Academy in collaboration with institutes of higher learning to develop talent for the industry, which is facing a shortage due to the rapid growth in datacentre capacity in Southeast Asia. The academy will launch in mid-2024 with Singapore Institute of Technology, Nanyang Polytechnic, Singapore Polytechnic, Temasek Polytechnic and Institute of Technical Education as its first partners. It’s expected to train more than 150 students annually, particularly in new areas of datacentre development such as sustainability and high-density AI environments, to create high-value jobs in Singapore and the region. The OMB's new policy calls for federal agencies to be transparent about AI use and designate chief AI officers to coordinate ... Use cases for the still-developing metaverse are growing as the technologies that enable this next iteration of the internet ... Cybersecurity and cloud top the list of 2024's tech investment drivers, according to an Enterprise Strategy Group survey. But ... As a company's cyber-risks evolve, so must its culture. Here are five tips for creating a cybersecurity culture that protects the... To meet the challenges of managing cyber-risk, organizations need to have a cyber-risk management plan in place. Look at five ... Users who think phishing happens only over email should think again. Learn about recent Microsoft Teams phishing attacks and how ... Green networking is achievable if network managers ensure devices and supporting systems are energy-efficient and comply with ... The cloud's effect on application management and licensing is expected to shift from end-user applications to SDN concepts. Say ... Black holes in the network disrupt connectivity and compromise data integrity. Network monitoring, team collaboration and routing... Nvidia and its partners are providing the tools and infrastructure to build and deploy AI applications that companies say could ... Data center advancements are rapidly occurring with storage demand. Some advancements, like an increase in temperatures, are ... The lift-and-shift approach moves an app and its data from one environment to another. Understanding the pros and cons can help a... The various types of database software come with advantages, limitations and optimal uses that prospective buyers should be aware... Fragmented data protection laws, technology disruptions, AI adoption, data governance and consumer trust are among the complex ... Any organization that wants to drive decision-making with data or use generative AI won't succeed without understanding how to ... All Rights Reserved, \nCopyright 2000 - 2024, TechTarget\n\n\nPrivacy Policy\n\n\n\nCookie Preferences \n\n\n\nCookie Preferences \n\n\n\nDo Not Sell or Share My Personal Information "
}