{
    "title": null,
    "date": "1/22/2024",
    "url": "https://www.benzinga.com/news/24/01/36711124/nvidia-ceo-jensen-huang-reportedly-makes-first-china-visit-in-four-years-amid-escalating-tech-rivalr",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Jensen Huang, chief executive officer of Nvidia Corp. NVDA, reportedly visited China for the first time in four years, a tour that comes as the U.S.-China tech rivalry intensifies. What Happened: Huang was seen at Nvidia’s offices in Shenzhen, Shanghai, and Beijing early this month, reported Bloomberg, citing a person familiar with the matter. Images and videos of his interaction with staff in traditional attire were posted online over the weekend. The exact purpose of Huang’s visit remains undisclosed, as sources could not confirm the occurrence of any official meetings. See Also: After China Setback, Nvidia CEO Says AI Chipmaker To ‘Deepen’ Ties With This Southeast Asian Nation: ‘We Have Millions Of Clients Here’ Huang's trip comes at a crucial time as Nvidia's AI processors have become vital in the U.S.-China tech contest. The Nvidia CEO has previously warned that U.S. sanctions aiming to hinder the supply of AI chips to China might drive Chinese firms to create their own, thus posing a threat to U.S. tech supremacy. He even cited Huawei Technologies Co. as a potential competitor. An Nvidia representative corroborated Huang’s China visit, disclosing that he joined staff in Lunar New Year celebrations, the reported. Nvidia, whose market value tripled in 2023 as a result of its significant contribution to AI progress, saw its stock climb an additional 20% this year, signaling investor confidence in its sustained dominance. After his China tour, Huang reportedly made his fourth trip to Taiwan in less than a year. Why It Matters: In 2023, Nvidia’s stock skyrocketed nearly 246%, and Huang’s net worth soared to an impressive $44 billion, making him one of the year’s highest earners. This surge in stock is tied to investor optimism about Nvidia’s chips leading the AI revolution. Previously, at Microsoft Corporation’s Ignite event, Huang emphasized the importance of AI, calling it “the single most significant platform transition in computing history.” He claimed that it would be “bigger than PC, it's bigger than mobile, and it's gonna be bigger than the internet, by far.” Photo via Shutterstock Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: The Secret To Starting Your Own Business Is Tricking Your Brain, Nvidia CEO Says: ‘How Hard Can It Be?’ Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}