{
    "title": "Perplexity AI raises $73.6M in funding round led by Nvidia, Bezos, now \nvalued at $522M",
    "date": "1/6/2024",
    "url": "https://www.businesstoday.in/entrepreneurship/start-up/story/perplexity-ai-raises-736m-in-funding-round-led-by-nvidia-bezos-now-valued-at-522m-412130-2024-01-06",
    "text": "Feedback Perplexity AI, an innovative search startup, has completed a Series B funding round, raising $73.6 million. This funding was led by investors including Nvidia and Amazon founder Jeff Bezos. The influx of capital has propelled Perplexity AI's valuation to $520 million. The company, which specialises in developing advanced search tools that provide instant answers with sources and citations, has attracted a diverse group of investors. Alongside Nvidia and Bezos, the funding round saw participation from NEA, Databricks, and Bessemer Venture Partners, among others. Founded in August 2022 by Aravind Srinivas, Denis Yarats, Johnny Ho, and Andy Konwinski, Perplexity AI has experienced rapid growth, with its website and mobile web receiving 45 million visits in December 2023, a significant increase from 2.2 million when the service was launched in December 2022. Despite operating in a market dominated by tech giant Google, Perplexity AI is determined to carve out its niche. The company plans to utilise the newly acquired funds to expand its team, aiming to grow from 38 to approximately 60 employees by the end of the year. Additionally, the investment will support further product development and customer adoption, as well as global expansion efforts. Perplexity AI's CEO, Aravind Srinivas, has expressed confidence in the startup's approach, emphasising its ability to fine-tune various top-performing AI models rather than relying on a single one. This strategy, he believes, positions Perplexity AI as a next-generation search tool that will eventually be seen as a successor to legacy platforms like Google. “It removes the burden of prompt engineering and does not require users to ask perfectly phrased questions to get the answers they seek. This enables users to gain more relevant and comprehensive answers than other AI chatbots, traditional search engines, or research tools,” Srinivas said in the blog released with the funding announcement. The company's innovative search engine operates through a chatbot-like interface, allowing users to ask questions in natural language. It offers a range of large language models (LLMs) for users to choose from, including OpenAI's GPT-4, Anthropic's Claude 2.1, Google Gemini, or Perplexity's own Pro model. With a subscription fee of $20 per month, users can tailor their search experience to their preferences. Also Read: Delhi lawyer pays 1,300 times the reserve price for plot owned by Dawood Ibrahim Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}