{
    "title": "I sold Nvidia stock when it hit $689. Here's why",
    "date": "2/8/2024",
    "url": "https://www.fool.co.uk/2024/02/08/i-sold-nvidia-stock-when-it-hit-689-heres-why/",
    "text": "Already this year, Nvidia stock is up more than 40%. Given this rise, Edward Sheldon has been taking some profits off the table. Image source: NVIDIA When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More. Nvidia (NASDAQ: NVDA) is one of my favourite stocks. However, when the share price spiked up to $689 earlier this week, I hit the ‘sell’ button and banked some profits. Here, I’ll explain why I sold. I’ll also explain my strategy with this stock now. There are several reasons I sold Nvidia at $689. First, the stock had had an incredible run. Year to date, it was up 39%. That’s after a gain of 239% last year. A near-40% gain in a little over a month seemed a bit excessive to me. Second, the share price had ‘gone exponential’ (i.e. straight up). That’s always dangerous. In my experience, when a stock goes up like this, it often comes crashing back down. Third, I wanted to manage my risk. After the recent share price gain, Nvidia was a very large part of my portfolio. I just wanted to ‘right-size’ my position and make sure I wasn’t overexposed to the company. After all, this is a very volatile stock that can fall 30% or more in the blink of an eye. Finally, I was sitting on a big profit. I was buying this stock back in 2022 near $190. So, at $689 I was up around 260%. I didn’t want to be too greedy. I’ll point out that I only sold a small part of my position here. So, I still have a decent amount invested in the technology company. Even after my sale, it’s still my sixth-largest individual stock holding overall. So, I’m well positioned to benefit from any further gains. As for my strategy with Nvidia going forward, I plan to be in this stock for the very long term. I am talking 15 years or more. I continue to believe that Nvidia has enormous potential in today’s digital world. It’s literally at the heart of the artificial intelligence (AI) revolution. And I wouldn’t be surprised if one day, it was bigger than Apple and Microsoft. However, I plan to manage my position carefully. If the share price continues to climb rapidly, which it may (Goldman Sachs just raised its price target for Nvidia to $800 on the back of its AI prospects), I might take a bit more profit off the table just to manage my risk. Meanwhile, if the share price comes down by a significant percentage, I will most likely buy more shares for my portfolio. I would be interested in buying more stock around the $400 to $500 level. That price would give me more of a margin of safety. Of course, it’s hard to know where the stock will go in the short term. Yet I feel that after selling some shares, I’m in a good position. I’ve banked some gains and if the stock keeps rising, I can continue to profit.  Should you invest, the value of your investment may rise or fall and your capital is at risk. Before investing, your individual circumstances should be assessed. Consider taking independent financial advice. Edward Sheldon has positions in Apple, Microsoft, and Nvidia. The Motley Fool UK has recommended Apple, Microsoft, and Nvidia. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors. 26 March, 2024 |\n        Ben McPoland Shares of Nike have lagged the market over the last five years. Is it time for me to buy more… Read more » 25 March, 2024 |\n        Ben McPoland Might investing in NIO stock at its current price make this Fool a fortune? Or are shares in this Chinese… Read more » 21 March, 2024 |\n        Oliver Rodzianko With a stable balance sheet, a great track record, and strong earnings estimates, can this growth stock climb up higher… Read more » 20 March, 2024 |\n        Charlie Keough Nvidia stock has soared, but is now a smart time for this Fool to top up? He explores the issue… Read more » 19 March, 2024 |\n        Ben McPoland This investor considers whether buying one increasingly popular AI growth stock today could be like investing in Nvidia back in… Read more » 19 March, 2024 |\n        Mark David Hartley With Tesla rapidly losing ground against Chinese competitors, I'm wondering if the sinking stock can recover. Will an April price… Read more » 19 March, 2024 |\n        Oliver Rodzianko Oliver Rodzianko has been looking for companies with exceptional returns for his Stocks and Shares ISA. Here's one he's considering. Read more » 16 March, 2024 |\n        Oliver Rodzianko Our author wanted to know what one of the best passive income investments in the world was, and he's found… Read more » View All When investing, your capital is at risk. The value of your investments can go down as well as up and you may get back less than you put in. Tax treatment depends on your individual circumstances and may be subject to future change. The content of this article is provided for information purposes only and is not intended to be, nor does it constitute, any form of personal advice. Investments in a currency other than sterling are exposed to currency exchange risk. Currency exchange rates are constantly changing, which may affect the value of the investment in sterling terms. You could lose money in sterling even if the stock price rises in the currency of origin. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, and may have other tax implications, and may not provide the same, or any, regulatory protection as in the UK. Tax Year Ends 5 April 2024 Shelter up to £20,000 from the Taxman this tax year in a Stocks and Shares ISA, and you’ll pay no UK income tax or capital gains on potential profits! We’ve made it easy to compare Stocks and Shares ISAs, so you can find an account that’s a great fit for your needs. Whether you’re shopping for a trading account with all the whistles and bells, or seeking a simple, ready-made portfolio solution, we’ve got it covered. Investments involve various risks, and you may get back less than you put in. Tax benefits depend on individual circumstances and tax rules, which could change. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. Read more about us >  We have taken reasonable steps to ensure that any information provided by The Motley Fool Ltd, is accurate at the time of publishing. Any opinions expressed are the opinions of the authors only. The content provided has not taken into account the particular circumstances of any specific individual or group of individuals and does not constitute personal advice or a personal recommendation. No content should be relied upon as constituting personal advice or a personal recommendation, when making your decisions. If you require any personal advice or recommendations, please speak to an independent qualified financial adviser. No liability is accepted by the author, The Motley Fool Ltd or Richdale Brokers and Financial Services Ltd for any loss or detriment experienced by any individual from any decision, whether consequent to, or in any way related to the content provided by The Motley Fool Ltd; the provision of which is an unregulated activity. The value of stocks, shares and any dividend income may fall as well as rise and is not guaranteed, so you may get back less than you invested. You should not invest any money you cannot afford to lose, and you should not rely on any dividend income to meet your living expenses. Stocks listed on overseas exchanges may be subject to additional dealing and exchange rate charges, administrative costs, withholding taxes and different accounting and reporting standards. They may have other tax implications, and may not provide the same, or any, regulatory protection. Exchange rate charges may adversely affect the value of shares in sterling terms, and you could lose money in sterling even if the stock price rises in the currency of origin. Any performance statistics that do not adjust for exchange rate changes are likely to result in an inaccurate portrayal of real returns for sterling-based investors. Fool and The Motley Fool are both trading names of The Motley Fool Ltd. The Motley Fool Ltd is an appointed representative of Richdale Brokers & Financial Services Ltd who are authorised and regulated by the Financial Conduct Authority (FCA) (FRN: 422737). We publish information, opinion and commentary about consumer credit products, loans, mortgages, insurance, savings and investment products and services, including those of our affiliate partners. The Motley Fool Ltd. Registered Office: 5 New Street Square, London EC4A 3TW. | Registered in England & Wales. Company No: 3736872. VAT Number: 188035783. © 1998 – 2024 The Motley Fool. All rights reserved. The Motley Fool, Fool, and the Fool logo are registered trademarks of The Motley Fool Holdings Inc. "
}