{
    "title": null,
    "date": "2/10/2024",
    "url": "https://www.datacenterdynamics.com/en/news/nvidia-ceo-elected-to-national-academy-of-engineering-for-work-on-ai-and-high-powered-gpus/",
    "text": "Jensen Huang was one of 114 newly elected members in 2024 Jensen Huang, the co-founder and CEO of Nvidia, has been elected to to the National Academy of Engineering (NAE) for his “outstanding contributions” to the world of engineering. The NAE claims that election to its academy is “among the highest professional distinctions accorded to an engineer”, with membership awarded to those who have made outstanding contributions to \"engineering research, practice, or education”; pioneered and developed new technology fields; or made major advancements in traditional ones. In a short biography posted to the Academy’s website where it welcomed the 114 newly elected members, Huang was credited for his work on “high-powered graphics processing units, fueling the artificial intelligence revolution.” Having welcomed its class of 2024, the NAE now has 2,310 US members and 332 international members. Tien Y Wu, CEO of Advanced Semiconductor Engineering; Dario Gil, senior vice president and director of research, IBM Research; and Carolyn Duran, senior director for product integrity at Apple, were also elected to the NAE alongside Huang for their work advancing semiconductor manufacturing or artificial intelligence research. Since generative AI exploded into the public consciousness at the end of 2022, demand for Nvidia chips has skyrocketed, leading some analysts to predict the company could hit a two trillion-dollar valuation in the not-too-distant future. Nvidia currently has an 80 percent market share of the GPU market and although rivals such as Intel and AMD are trying to chip away at that margin, Nvidia is showing no signs of slowing down. Speaking to analysts after the chip company posted its Q3 2024 financial earnings, Huang said: “Nvidia’s GPUs, CPUs, networking, AI foundry services and... AI enterprise software are all growth engines in full throttle.” Nvidia’s H100 chips have been found to improve AI inference performance by around 30 times, and AI training by four times compared to that of Nvidia's A100 GPUs. Each H100 GPU contains 80GB of HBM2 GPU memory and 3.2Tbps of bisectional bandwidth. Data Centre Dynamics Ltd (DCD), 296-300 St John St, London EC1V 4PAEmail. [email protected]DCD is a subsidiary of InfraXmedia "
}