{
    "title": "'Fail quickly and inexpensively': Nvidia founder and CEO Jensen Huang \nshares his mantra for success — here's why ...",
    "date": "2/27/2024",
    "url": "https://www.aol.com/fail-quickly-inexpensively-nvidia-founder-130300544.html?ref=biztoc.com",
    "text": "Advertisement For premium support please call: It's no secret that CNBC’s Jim Cramer holds Nvidia (NVDA) founder and CEO Jensen Huang in high esteem. After all, the “Mad Money” host once hailed Huang as “the da Vinci of tech.” But how does Huang compare to Elon Musk, the visionary entrepreneur celebrated for revolutionizing transportation on Earth with Tesla and in space with SpaceX? Commercial real estate has beaten the stock market for 25 years — but only the super rich could buy in. Here's how even ordinary investors can become the landlord of Walmart, Whole Foods or Kroger Inflation is still white-hot — use these 3 'real assets' to protect your wealth today, no matter what the US Fed does or says Anything can happen in 2024. Try these 5 easy money hacks to help you make and save thousands of dollars in the new year (they will only take seconds) In a recent CNBC segment, Cramer faced the question of whether he sees Huang as “a bigger visionary” than Musk. His answer was unequivocally affirmative. “Yes, and I’ll tell you why,” Cramer explained. “I think that Musk can see around the corner. But I think that Jensen is thinking about a legacy of changing the entire paradigm about the way the world is. Jensen is creating single handedly an industrial revolution.” Cramer's remarks followed Nvidia's announcement of exceptional quarterly results. The chip giant reported that its Q4 revenue surged by 265% year-over-year, while its earnings per share skyrocketed by 765%. Nvidia shares shot up 16% after earnings. Over the last 12 months, the stock has seen a gain of over 236%. While shareholders are celebrating Nvidia's massive success, it might be worth noting that the company's innovative leaps are grounded in a philosophy that embraces “a tolerance for failure.” Huang earned his master’s degree in electrical engineering from Stanford University in 1992. In 2011, he returned to his alma mater to deliver a lecture on the challenges and rewards of building a company. Central to his discourse was the concept of failure. “If you want to be successful, I would encourage you to grow a tolerance for failure,” he stated. However, Huang clarified that he's not advocating for failure per se. Read more: Rich young Americans have lost confidence in the stock market — and are betting on these 3 assets instead. Get in now for strong long-term tailwinds “If you fail often enough, you actually might become a failure — and that's different than being successful,” he explained. “So the question is, how do you teach someone how to fail, but fail quickly? And to change courses as soon as you know it's a dead end?” The answer, according to Huang, is something called intellectual honesty. The approach is straightforward: “We assess on a continuous basis whether something makes sense or not. And if it's the wrong decision, let's change our mind.” He contended that to create a company capable of inventing “amazing things that solves problems for the world that it sometimes didn't even know it had,” building a tolerance for risk-taking is crucial. At the same time, it’s also essential to “teach people how to fail but fail quickly and inexpensively.” According to Huang, this mindset is vital because innovation is predicated on experimentation, which necessitates exploration, and exploration may lead to failure. “Unless you have a tolerance for failure, you will never experiment and if you don't ever experiment, you will never innovate. If you don't innovate, you don't succeed,” he concluded. Here's how you can invest in rental properties without the responsibility of being a landlord ‘The biggest crash in history': Robert Kiyosaki warns that millions of 401(k)s and IRAs will be 'toast' — here's what he likes for protection 'It's not taxed at all': Warren Buffett shares the 'best investment' you can make when battling inflation This article provides information only and should not be construed as advice. It is provided without warranty of any kind. Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}