{
    "title": "Homes Hard to Come By Near Nvidia's HQ in Santa Clara",
    "date": "2/29/2024",
    "url": "https://therealdeal.com/sanfrancisco/2024/02/29/homes-hard-to-come-by-near-nvidias-hq-in-santa-clara/",
    "text": "search Low inventory and affordability impact local market, not the AI firm’s soaring stock price SHARE THIS ARTICLE FONT SIZE Want to buy a home near Nvidia’s headquarters in Santa Clara? Forget it. The housing market around the artificial intelligence giant has squeezed out most comers, with few available homes and relatively affordable prices, the Wall Street Journal reported. Compared with other cities in Silicon Valley, the Santa Clara housing market’s driving forces are its lack of inventory and its affordability. The city draws tech employees from all corners of the region looking for entry-level housing, according to Dave Walsh, vice president and manager of Compass’ San Jose office. Nvidia, known for its AI chips, has been based in Santa Clara since the 1990s. After a strong fourth-quarter earnings report this month, the company’s valuation shot briefly to more than $2 trillion, The Wall Street Journal reported. But while the company’s growing footprint has bolstered the city’s economy and brought new employees and investors, real estate agents don’t see its soaring stock price impacting home prices, according to agents Andy Orion and his wife, Lori Orion, of Golden Gate Sotheby’s International Realty. When comparing Nvidia’s stock performance to the city’s average single-family home price since December 2021, there isn’t a noticeable correlation between stock growth and price appreciation, Andy Orion said. The company’s stock jumped from less than $200 in September 2022 to briefly over $800 this month, but the typical price of a single-family home in Santa Clara remained between $1.5 million and $2.1 million. There are a few reasons for this, according to broker Lori Orion. Last week, Jensen Huang, co-founder and CEO of Nvidia, said he believes the industry’s AI boom is just getting started, so it may be a while before stockholders in the area cash out, she said. In addition, home buyers who look in Santa Clara generally want entry-level housing. High earners from Nvidia and other nearby tech giants, such as Google’s parent company, Alphabet, and Apple, are drawn to Silicon Valley’s pricier neighborhoods, with more competitive schools. Nvidia, with 30,000 employees worldwide, is not likely to make much dent in the Santa Clara or wider Silicon Valley real estate market. That’s because its local workers are a small portion of the total tech workforce that includes Meta, Microsoft and Alphabet. Located between San Jose and Sunnyvale, Santa Clara is home to the headquarters of Intel, Santa Clara University and Levi’s Stadium, home of the 49ers. Its median sale price in January was $1.539 million, up 115 percent from $715,000 in 2014, but significantly less than the median prices in the nearby cities of Los Altos and Saratoga, which topped $4 million, according to Redfin. Santa Clara’s home-price growth over the past decade can be blamed on a limited supply of new housing, coupled with low mortgage interest rates since the 2008-2009 financial crisis, said Andy Orion. Its single-family ranch-style homes generally span around 1,600 square feet, according to Walsh. But the city’s lower price points and proximity to nearby tech campuses keep it competitive. A remodeled home in the city will typically sell for $2 million and get multiple offers. If one does come to market in the $1 million range, it causes a stampede, said Seamus Nolan, a local developer and real estate agent with Christie’s International Real Estate Sereno. Homes for sale in Santa Clara stay on the market for an average of 10 days, and there are 24 days worth of inventory available, according to Walsh. “If a home is lingering on the market, it’s likely overpriced or the agent is keeping it up to see how many offers it can get,” he told the newspaper. — Dana Bartholomew All rights reserved © 2024 The Real Deal is a registered Trademark of Korangy Publishing Inc. "
}