{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.marketwatch.com/story/nvidias-stock-price-isnt-the-only-thing-that-sets-it-apart-from-the-rest-of-the-magnificent-seven-cf39f294",
    "text": "Nvidia’s spectacular growth is hard to quantify sometimes. But this chart, from Sonu Varghese, global macro strategist at the Carson Group, helps put things in perspective. It’s shows how Nvidia’s \n        NVDA,\n        +0.12%\n       earnings — or, to be more precise, analyst expectations of its earnings in 12 months’ time — have soared well beyond its stock price, leading actually to a 102-point multiple contraction over the last two-plus years. That’s not to say Nvidia is necessarily cheap, Varghese said in a message on the social media service X. “There’s a runway here. Of course, how long can they can keep printing profits like this … that’s the question,” he said. “There’s operating leverage too, with profits rising while sales growing. So margins increasing.” As MarketWatch’s Therese Poletti points out, Nvidia’s margins in the chip space are only surpassed by ARM Holdings \n        ARM,\n        -0.50%,\n       the microchip designer. Nvidia stock surged 16% to $785.38 on Thursday after the microchip maker beat revenue expectations for the fourth quarter by about $2 billion, and also projected first-quarter sales that at the midpoint are nearly $2 billion higher. Nvidia is now ahead of both Amazon.com \n        AMZN,\n        +0.31%\n       and Alphabet  \n        GOOGL,\n        +0.04%\n       by market cap. Over the last 52 weeks, Nvidia’s stock has climbed  237.2%. The deal could expand Home Depot’s market by $50 billion. Steven Goldstein is based in London and responsible for MarketWatch's coverage of financial markets in Europe, with a particular focus on global macro and commodities. Previously, he was Washington bureau chief, directing MarketWatch's economic, political and regulatory coverage. Follow Steve on Twitter: @MKTWgoldstein. Steven Goldstein is based in London and responsible for MarketWatch's coverage of financial markets in Europe, with a particular focus on global macro and commodities. Previously, he was Washington bureau chief, directing MarketWatch's economic, political and regulatory coverage. Follow Steve on Twitter: @MKTWgoldstein. Visit a quote page and your recently viewed tickers will be displayed here. "
}