{
    "title": "Beamr Imaging (BMR) Stock Soars 800% on Nvidia Partnership",
    "date": "2/12/2024",
    "url": "https://investorplace.com/2024/02/beamr-imaging-bmr-stock-soars-800-on-nvidia-partnership/",
    "text": " Here's what's driving this small cap stock much, much higher today Advertisement Source: Andre_Carvalho / Shutterstock.com One of today’s little-known stocks that’s absolutely skyrocketing is Beamr Imaging (NASDAQ:BMR). Shares of BMR stock surged more than 800% in early afternoon trading on extremely high volume. At the time of writing, more than 125 million shares have traded hands. That’s relative to an average daily volume of less than 150,000 shares. This high-volume move appears to be tied to a deal Beamr announced with Nvidia (NASDAQ:NVDA) to “present joint research relating to automated video modernization” at the upcoming ACM Mile-High-Video 2024 conference. Beamr is an Israel-based video encoding company that offers a suite of video compression and optimization software solutions. This deal appears to be stoking interest in the company, as the encoding company and chipmaker agree on video standards for the industry. Let’s dive more into what Beamr actually does and why this deal is such big news for the stock. Indeed, it’s not every day we see a stock do a near 10x spike on an intraday basis! Beamr’s business model is, in itself, intriguing to many growth investors. The company’s suite of video encoding, transcoding and optimization solutions essentially allows content distributors, such as video streaming platforms and Hollywood studios, to produce the kind of content we all readily enjoy on various platforms. However, this news, which sees Nvidia working directly with Beamr to accelerate the adoption of the AOMedia Video 1 (AV1) coding format, is important to understand. The idea is that Beamr and Nvidia will work to provide an automated process for current video libraries to be transferred to this new format. In doing so, Beamr’s integral software suite should see an uptick in usage and become a leader in the video encoding market. Today, market participants appear to be coming around to the view that Beamr could play an integral role in supporting the video infrastructure of the future. A market capitalization surge from around $27 million yesterday to more than $250 million today suggests this is the case. Accordingly, BMR stock is one that’s found its way onto my watch list, and I think most growth investors may want to keep a closer eye on this stock moving forward following this news. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Communications, Media, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/beamr-imaging-bmr-stock-soars-800-on-nvidia-partnership/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}