{
    "title": null,
    "date": "2/9/2024",
    "url": "https://www.investors.com/etfs-and-funds/mutual-funds/best-mutual-funds-invest-billions-in-this-unexpected-list-of-7-magnificent-stocks-including-nvidia/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     With Nvidia (NVDA), Microsoft (MSFT), Meta Platforms (META) and the other Magnificent Seven stocks now accounting for around half of the total market capitalization of the Nasdaq, it's no wonder these titans of tech remain the wonders of Wall Street. But this month's list of new buys by the best mutual funds reveals a different set of seven stocks showing magnificent demand. Microsoft, Meta and Nvidia stock all make this screen that showcases companies garnering exceptional institutional demand. The list highlights seven stocks with inflows of at least $1 billion from the best mutual funds. In addition to these three Magnificent Seven stocks, Uber Technologies (UBER), Fair Isaac (FICO), Arista Networks (ANET) and Fiserv (FI) also make the billion-dollar club. Without exception, Nvdia, Uber, Microsoft, Meta and the other members of this elite club now trade at or near their all-time highs. Shares of Nvida stock, for example, just shot past the 700 mark, while Microsoft once again adds to its ascent. Meta stock continues to trade in a tight range — very health action following a more than 20% gain on earnings. Alphabet (GOOGL) just missed getting an invitation to the billion-dollar club. These leading money managers invested a total of $950 million into the Google parent's stock. Like Nvidia, Meta and Microsoft, Google stock has its eyes on its own record highs. The links below highlight a portion of this month's new buys and sells by top funds. Click here to see all the stocks on the list. Spreading like water into every crevice of every industry, artificial intelligence continues to spur demand among the best mutual funds. In addition to the Magnificent Seven stocks, Uber and others mentioned earlier, savvy money managers once again reveal a keen interest into three particular industries: enterprise software, cybersecurity and semiconductors. Led by ServiceNow (NOW), Salesforce.com (CRM), Dynatrace (DT) and Palantir Technologies (PLTR), the enterprise software group accounts for 16 stocks on the list of new buys by the best mutual funds. UiPath (PATH), Shopify (SHOP), Clouldflare (NET), Monday.com (MNDY) and DocuSign (DOCU) also hail from this group. As AI and cloud computing raise concerns around network security, four cybersecurity firms make this screen: CrowdStrike (CRWD), Palo Alto Networks (PANW), CyberArk Software (CYBR) and Zscaler (ZS). Including Nvidia, six stocks from the semiconductor sector have also etched their names on this list of new buys by the best mutual funds. This grouping includes ASML (ASML), Broadcom (AVGO) and Rambus (RMBS). Follow Matthew Galgani on X (formerly Twitter) at @IBD_MGalgani. YOU MAY ALSO LIKE: Nvidia Is King, But This Frog May Turn Into A Prince Did You Miss Palantir? Top Funds Bet This AI Peer Could Pop Next Are The Best Mutual Funds Buying Your Watchlist Stocks? Here's How To Find Out Stock Picks: Google, Nvidia Reveal 7 Telltale Traits To Monitor Identify Bases And Buy Points With This Pattern Recognition Tool 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}