{
    "title": "Better Artificial Intelligence (AI) Stock: Nvidia vs. SoundHound AI",
    "date": "3/8/2024",
    "url": "https://www.fool.com/investing/2024/03/08/better-artificial-intelligence-ai-stock-nvidia-vs/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Artificial intelligence (AI) stocks Nvidia (NVDA 0.12%) and SoundHound AI (SOUN -0.68%) have been in the limelight this year for different reasons, but both of them have delivered handsome gains to investors already in 2024. Nvidia stock is up 72% so far this year, while SoundHound AI has simply taken off and is up 186%. Nvidia's surge can be attributed to the company's solid fiscal 2024 results and market-beating guidance, thanks to the booming demand for its AI chips. What's more, Nvidia is also why SoundHound AI has delivered such astronomical gains this year. The big jump in the stock prices of these companies has made them expensive from a valuation perspective. However, a closer look at their businesses shows that they have the potential to deliver more upside thanks to AI. But which one of these two AI stocks is worth buying right now following their rally? Let's find out. Nvidia's grip over the market for AI chips has led to stunning growth in revenue and earnings. Sales in fiscal 2024 (which ended on Jan. 28) shot up 126% year over year to $60.9 billion. And the company's pricing power led to a year-over-year jump of almost 15 percentage points in its adjusted gross margin to 73.8%. As a result, Nvidia ended the year with adjusted earnings of $12.96 per share, a 288% increase from fiscal 2023. And management's revenue forecast of $24 billion for the current quarter would be year-over-year growth of 233%, suggesting that it could deliver another solid performance in the current fiscal year. Its first-quarter forecast suggests that the company could end fiscal 2025 with close to $100 billion in revenue if it can maintain that quarterly run rate for the rest of the year. Analysts, however, seem to be more optimistic and are anticipating growth to gather momentum as the year progresses. This is evident from the following chart, which indicates that Nvidia's revenue could be well ahead of the $100 billion mark in fiscal 2025.  NVDA revenue estimates for current fiscal year, data by YCharts. What's more, Nvidia's revenue estimate has seen big upward revisions following its latest report. The company forecasts that the demand for its AI graphics processing units (GPUs) will continue to exceed supply this year. And management expects its outstanding growth to continue in the long run. Chief financial officer Colette Kress said on the February earnings conference call that \"the $1 trillion installed base of data center infrastructure is rapidly transitioning from general purpose to accelerated computing.\" Nvidia's estimated 98% share of the data center GPU market, Wells Fargo says, means that it is the go-to supplier of chips for data centers that are transitioning toward accelerated computing. According to Nvidia, its GPUs: \"perform technical calculations faster and with greater energy efficiency than CPUs. That means they deliver leading performance for AI training and inference as well as gains across a wide array of applications that use accelerated computing.\" With the GPU market expected to generate $395 billion in revenue in 2030 as compared to $41 billion in 2022, Nvidia's rapid growth could continue in the long run. SoundHound AI is a much smaller company than Nvidia. Its 2023 revenue came in at $46 million, a jump of 47% from the previous year. Unlike Nvidia, SoundHound AI is a play on the software side of the AI market. The company provides customers with an AI platform to develop voice-enabled products and solutions. It can be used for AI voice assistants, real-time transcriptions, text-to-speech, and other purposes. SoundHound AI's products are deployed in multiple industries including restaurants and automaking. The company's 2023 revenue growth tells us its platform is gaining traction. It's anticipating 2024 revenue to increase at a faster pace of 52% to $70 million at the midpoint of its guidance range. And in 2025, annual revenue could go well past $100 million because management expects growth to accelerate even more. Although SoundHound AI has been growing impressively for quite some time, the stock remained a laggard last year. But investors started taking note of it once Nvidia announced a $3.7 million stake in the company in the middle of February, sending shares surging in recent weeks. Looking beyond the Nvidia-driven surge, you can see that SoundHound AI is in a good position to sustain its growth in the long run because the company finished 2023 with a cumulative backlog worth $661 million, double the previous year. Management splits this into two categories: Its bookings backlog refers to the value of committed customer contracts, while its subscriptions backlog is the potential value of the revenue it could generate from its current customers. So the revenue pipeline could allow it to grow for years to come. Also, SoundHound AI estimates it has a huge addressable market worth more than $160 billion, which indicates that it could be at the beginning of a massive growth curve. Nvidia and SoundHound AI seem to have bright futures with AI. But if you have to choose one of these two stocks, the choice is simple. SoundHound AI could turn out to be the next big AI company thanks to the market it operates in and the solid customer base it has built, but its recent surge has made the stock quite expensive when compared to Nvidia. Though Nvidia is trading at an expensive 32 times sales, it is cheaper than SoundHound AI, which has a sales multiple of 42. This makes buying Nvidia stock a no-brainer choice over SoundHound AI as the GPU maker is growing at a much faster pace and is an established name in AI chips. Wells Fargo is an advertising partner of The Ascent, a Motley Fool company. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}