{
    "title": "How To Get NVIDIA At A 16% Discount",
    "date": "3/5/2024",
    "url": "https://www.forbes.com/sites/michaelfoster/2024/03/05/how-to-get-nvidia-at-a-16-discount/",
    "text": "Microchip and Nvidia logo displayed on a phone screen are seen in this multiple exposure ... [+] illustration photo taken in Krakow, Poland on April 10, 2023. (Photo by Jakub Porzycki/NurPhoto via Getty Images) It’s undeniable that NVIDIA (NVDA) is the hottest stock out there right now. In just five years, it’s soared nearly 2,000%. That’s over 80% annualized (!), including both the pandemic and the 2022 selloff. Most of those gains have come in the last year and a half, thanks to the AI boom. And NVIDIA is perfectly positioned to profit from that boom, with demand for the company’s computer chips so high that it has to pick and choose buyers (NVIDIA has said it’s trying to sell the chips “fairly,” since demand has far outstripped its capacity to make them). If you want to buy into the AI revolution without having to worry about deciding between winners and losers, NVIDIA is a good starting point, despite the fact that it pays a pretty much irrelevant 0.02% dividend yield. But it’s far from the last word here. After all, other chip makers are starting to pivot toward optimizing their products for AI platforms, so NVIDIA’s dominance in the field might not last forever. Until then, though, it would be silly to not have at least some exposure to this company, while also getting exposure to others in the AI market. One easy way to do this is with a simple sector index fund like the SPDR S&P Semiconductor ETF (XSD), which has posted some respectable gains in the last year thanks to growing retail-investor interest in the sector and, of course, its exposure to NVIDIA. XSD Volatility There’s been a lot of volatility here, as you can tell, in part because XSD’s portfolio is pretty evenly distributed among the main semiconductor manufacturers, and when one underperforms, it crimps XSD’s performance significantly. However, there’s one way around this that has the added benefit of outperformance—it also gets us shares of NVIDIA for over 16% less than we’d get them through XSD. And it gives us one other big bonus I’ll get into in a minute. That way is through closed-end funds (CEFs), which are actively managed funds that have some things in common with a mutual fund (i.e., their human managers) and some things in common with ETFs (such as the fact that they trade on the market). And when we’re trying to navigate fast-moving trends like semiconductor demand for AI applications, having an expert portfolio manager who researches the field every single day is a big benefit. That means a fund like the 10.2%-yielding Neuberger Berman Next Generation Connectivity Fund (NBXG) can choose to zero in on the best chipmakers in the field while also diversifying into other fast-moving tech sectors like biotech (which is also seeing increased interest) and other IT services. That’s proven to be a winning formula as the AI boom ramped up, with NBXG (in purple below) easily outperforming XSD in the last year. NBXG Total Returns Note also how much less volatile NBXG’s returns are, thanks to market discipline. Since CEFs have a fixed number of issued shares (hence the “closed” in their name), the actual value of NBXG’s holdings in companies like NVIDIA (its second-largest position), as well as other top-10 holdings like Monolithic Power Systems (MNPW), ServiceNow (NOW) and ASML Holding NV (ASML), is largely determined by market demand for the fund’s shares. Sometimes that means the fund can sell for a premium to its actual market value, giving investors a chance to book strong profits if they sell then. But NBXG is now trading at a massive discount—although it looks like that won’t last long. NBXG Discount NAV After trading at a more than 20% discount in the most bearish months of 2022’s madness, NBXG’s discount has slowly eroded as investors realize the bull run in chipmakers and tech is no mirage. AI is real technology pulling in real profits for many firms. Still, NBXG trades at a 15.9% discount to NAV as I write this, meaning that you’re getting shares of NVIDIA, and the rest of the CEF’s portfolio, at a big markdown. Of course, that won’t last forever. When NBXG debuted, it traded near par, and many tech-oriented CEFs regularly trade at premiums to NAV. That’s a future that NBXG is headed toward, meaning you can buy NVIDIA shares for less than their real market value today, then sell them for more than their market value in the future. But what will we do in the meantime? This is the real secret sauce of CEFs: the dividends. CEFs are designed to hand over as much of their profits as possible in the form of cash to shareholders, leaving you with the option to reinvest, invest in something else or use the money to pay bills. And NBXG offers its huge 10.2% annual dividend because of its even bigger annual profits. NBXG isn’t the only tech CEF that does this, and there are many other funds that translate gains in stocks, bonds, real estate and other assets into steady, reliable income for investors. That’s why CEFs are often a retiree’s best friend, especially if you pick funds that are temporarily out of favor (like NBXG is now) and hold them until they get overbought. Michael Foster is the Lead Research Analyst for Contrarian Outlook. For more great income ideas, click here for our latest report “Indestructible Income: 5 Bargain Funds with Steady 10.9% Dividends.” Disclosure: none  "
}