{
    "title": "'I wish you ample doses of pain and suffering,' Nvidia CEO tells Standford \nstudents",
    "date": "3/14/2024",
    "url": "https://www.gg2.net/i-wish-you-ample-doses-of-pain-and-suffering-nvidia-ceo-tells-standford-students/",
    "text": "Date: Related stories The definition of success and hard work can differ from person to person. Today’s generation calls it ‘hustle culture’ but Nvidia CEO here has some other perspective for the students. Jensen Huang recently shared some interesting thoughts with students at Stanford University. He talked about something unexpected, the importance of facing difficulties. He told students that facing tough times can make us stronger. He wished them “ample doses of pain and suffering,” not to be mean, but because he believes that overcoming hardships helps us grow. He knows from personal experience how facing tough times can shape our character and make us better people. In the interview, Huang credits his work ethic and success to his early job at Denny’s, where he started as a dishwasher and was later promoted to busboy. He emphasised his efficiency and dedication, stating that he never left or returned empty-handed. Reflecting on his journey, he humbly mentioned his ongoing efforts to improve as a CEO. “I think one of my great advantages is that I have very low expectations,” Huang, who graduated with a master’s degree from Stanford in 1992, responded. He mentioned that keeping the bar too high of expectations is not practical, instead try keeping the bar low, for lower expectations. This will eventually help us to be more resilient and keep us prepare for life’s ups and downs. He, like any other successful person, who actually owns a company worth £ 62,770 focusses on his own story that is a proof of his message. He didn’t have an easy upbringing, and he had to work hard to get where he is today. From working odd jobs to facing bullies, he learned that perseverance and hard work are key to success. His story reminds us that it’s okay to struggle on the path to success. “Greatness comes from character and character isn’t formed out of smart people, it is formed out of people who suffered,” he added. While addressing the young students he also mentioned that he believes that true greatness comes from having a strong character. By facing challenges head-on, we can develop qualities like resilience, empathy, and determination. These are the qualities that set us up for success, no matter what obstacles come our way. Jensen Huang’s words may seem surprising, but they carry an important message: facing challenges is part of the journey to success. As we navigate through life, let’s remember that it’s okay to struggle. It’s through overcoming these struggles that we become the best versions of ourselves. Subscribe - Never miss a story with notifications - Gain full access to our premium content - Browse free from up to 5 devices at once Latest stories GARAVI GUJARAT is one Britain’s oldest and biggest selling Asian titles. Published weekly in full colour in both English and Gujarati it is the biggest selling Gujarati publication outside India. Copyright © 2023 Garavi Gujarat Publications Ltd & Garavi Gujarat Publications USA Inc "
}