{
    "title": "Nvidia bets dominate US options market as AI fervor grows",
    "date": "3/3/2024",
    "url": "https://cyprus-mail.com/2024/03/03/nvidia-bets-dominate-us-options-market-as-ai-fervor-grows/",
    "text": "March 28, 2024 March 28, 2024 March 28, 2024 March 27, 2024 March 28, 2024 March 27, 2024 March 24, 2024 March 23, 2024 March 20, 2024 March 8, 2024 March 3, 2024 March 2, 2024 March 28, 2024 March 27, 2024 March 27, 2024 March 26, 2024 March 22, 2024 March 21, 2024 March 21, 2024 March 20, 2024 March 20, 2024 March 15, 2024 March 15, 2024 March 9, 2024 February 26, 2024 February 24, 2024 Investors’ fervor for all things AI-related is leaving its mark on the US options market, as traders pile in to derivatives bets to gain exposure to the red-hot investing theme. Options on artificial-intelligence darling Nvidia (NVDA.O) accounted for 25 cents of every dollar of premium – the price of contracts – traded in US single-stock options over the past month, nearly $3 billion in options premium traded in the chipmaker’s options every day on average, a Reuters analysis of Trade Alert data showed. During several recent sessions, Nvidia surpassed Tesla (TSLA.O) as the option market’s most heavily traded name for the day. Nvidia briefly hit $2 trillion in market value for the first time on Friday – two days after it released quarterly earnings – riding on insatiable demand for its chips which feature prominently in the generative AI craze. Nvidia recently became the third-largest US-listed company as measured in market capitalization. Its shares command a weighting of 4.5 per cent in the S&P 500 (.SPX), giving them an outsized influence on the broader index’s moves. Nvidia’s options should remain popular with traders, “both from a hype and mechanical index perspective,” said Garrett DeSimone, head of quantitative research at OptionMetrics. “It represents such a large portion of S&P 500 weighting.” The stock’s options have drawn a range of bets, including ones guarding against a drop in the stock toward $350 by March and others that would bear fruit if the stock extended its meteoric rise toward $900 and higher in coming months. Nvidia shares were up 1.4 per cent at $798.90 on Monday afternoon. A host of other AI names has also drawn heavy options volume, including Super Micro Computer (SMCI.O) and Arm Holdings . Nvidia’s shares are up about 60 per cent year-to-date, while those of Super Micro Computer have risen 200 per cent and Arm’s have gained 77 per cent. Nvidia is not the first company to captivate options players. Derivatives bets on electric-vehicle manufacturer Tesla accounted for around half of all equity, index and ETF options premium in October 2021, as the company’s shares soared. Tesla’s options remain a crowd-puller that still often feature on the list of any given day’s most actively traded options. Though the frantic pace of trading in Nvidia’s options could ease now that its earnings report is in the rearview mirror, market participants said the AI theme was likely to remain popular among investors. Some of the future demand for Nvidia’s options is likely to come from investors who may have missed the wild rally in the stock. “There are undoubtedly institutions that may not want to chase an already highly appreciated stock but don’t want to miss out on the rally,” said Steve Sosnick, chief strategist at Interactive Brokers. Buying options would “allow them to get leveraged exposure to Nvidia’s upside but with a defined cash outlay,” he said. Sign up to the Cyprus Mail Newsletter We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. Please read this Cookie Policy carefully as it contains important information on who we are and how we use cookies on our website. This policy should be read together with our Privacy Policy  which sets out how and why we collect, store, use and share personal information generally, as well as your rights in relation to your personal information and details of how to contact us and/or the supervisory authorities in case you have any complaint. This Cookie Policy applies to the access and use of the Cyprus Mail Website hosted at https://cyprus-mail.com/ (hereinafter referred to as the “Website”), which is operated by NEO CYMED PUBLISHING LIMITED (hereinafter the “Company”, “we” or “us”). Our Company strives to protect personal data and apply high standards of conduct when it comes to privacy issues. We ensure that we provide our employees and staff with the appropriate training to handle personal data promptly and in accordance with the laws. Furthermore, we endeavour to ensure that any parties with whom we co-operate apply the same high standards when it comes to data protection and privacy as we do. Cookies A cookie is a small text file which is placed onto your device (e.g. computer, smartphone or other electronic device) when you use our Website. We use cookies on our Website. These help us improve your experience and at the same time help us to support our security features i.e. detect for malicious visitors, recognize you and your device and store some information about your preferences or past actions. For example, we may monitor . This information helps us to identify trusted web traffic, generate statistical and analytical data on how our visitors use our Website, our reach and click on links. We also uses cookies to personalize your online experience. Some of this data will be aggregated or statistical, which means that we will not be able to identify you individually. For further information on our use of cookies, including a detailed list of your information which we and others may collect through cookies, please see below. For further information on cookies generally, including how to control and manage them, visit the guidance on cookies published by the Office of the Commissioner of Personal Data Protection in Cyprus, or www.allaboutcookies.org/. Consent to use cookies and changing settings We will ask for your permission (Consent) to place cookies or other similar technologies on your device, except where they are essential for us to provide you with a service that you have requested (enabling basic functions like page navigation and access to secure areas of the Website) and ensure the security of our website and users. You may withdraw any consent provided regarding the use of cookies or manage any other cookie preferences by clicking on the Cookie Settings icon at the bottom end of any page on our Website. You can then adjust the sliders regarding the cookies as per your preferences. It may be necessary to refresh the page for the updated settings to take effect. For more information on how you can change your preferences via browser settings please see ‘How to turn off all cookies and consequences of doing so’ below. It may be necessary to refresh the page for the updated settings to take effect. Our use of cookies Categories of Cookies: The table below provides more information about the cookies we use and why: Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites  Third party access to the cookies The cookies we use will only be accessed by us and those third parties named in the table above for the purposes referred to in this Cookie Policy. Those cookies will not be accessed by any other third party. How to turn off all cookies and consequences of doing so If you do not want to accept any cookies, you may be able to change your browser settings so that cookies (including those which are essential to the services requested) are not accepted. If you do this, please be aware that you may lose some of the functionality of our Website. How to contact us Please contact us if you have any questions about this Cookie Policy or the information we hold about you. If you wish to contact us, please send an email to [email protected],  write to us at 195, Arch. Makariou III, Neocleous House, 1st-5th floor, 3030, Limassol, Cyprus, or call us at ++357 22818585. Changes to this policy This policy was last updated on 4/7/2023. We may change this policy from time to time, when we do so we will inform you via notification on our Website.   Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Please enable Strictly Necessary Cookies first so that we can save your preferences! "
}