{
    "title": "3 Promising AI Stocks That Are Cheaper Than Nvidia",
    "date": "3/21/2024",
    "url": "https://www.fool.ca/2024/03/21/3-promising-ai-stocks-that-are-cheaper-than-nvidia/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. NVIDIA (NASDAQ:NVDA) stock is trendy, but Open Text Corp (TSX:OTEX) is far cheaper. Image source: Getty Images NVIDIA (NASDAQ:NVDA) stock is one of the hottest items on the global stock exchanges in 2024. Up 84% for the year, it has easily outperformed the S&P 500, NASDAQ-100, and TSX. It all got started back in May 2023, when the company put out an earnings release that easily beat analysts’ expectations. The release specifically included guidance – that is, a forecast of the next quarter’s performance – of $11 billion, 57% higher than was previously expected. The stock rallied impressively the day earnings came out. Since then, it has risen another 208%. It’s been an incredible thing to watch, but the end result has been NVIDIA becoming a very pricey stock. It trades at 74 times last year’s earnings, and 36 times the best estimate of next year’s earnings. In this article, I will explore three AI stocks that are cheaper than NVDA. Taiwan Semiconductor Manufacturing (NYSE:TSM), or ‘TSMC’ for short, is a Taiwanese chip manufacturer. The chip foundry is the contract manufacturer for NVIDIA. It also does orders for most chip designers and tech companies that make their own chips (e.g., Apple). TSMC is best known for being the world’s biggest “pure play” chip manufacturing company. It does not design any chips of its own, instead specializing in building other companies’ designs. Its main competitors in chip manufacturing are not pure plays; that is to say, they do design as well as manufacturing. So, they aren’t as focused on manufacturing as TSMC is. The end result is that TSMC is the go-to company for large, complex orders such as NVIDIA’s AI accelerator chips. Despite all of these advantages, TSMC stock is fairly cheap. Trading at 26 times last year’s earnings and 21.8 times the best estimate of next year’s earnings, it is about as cheap as you’ll get with AI stocks. Though the next two on this list are among a small handful that beat it on valuation. Open Text Corp (TSX:OTEX) is a Canadian software company that develops text analysis and content management software. As far as AI stocks go, this is likely the very cheapest of the bunch, trading at 9.9 times earnings and 8.3 times the best estimate of next year’s earnings. Historically, the company’s earnings and free cash flow have not increased very much: both metrics are down over 1-, 5-, and 10-year timeframes. However, the demand for AI-powered services this year ramped up interest in OTEX’s products, which help businesses extract ideas from text, manage content, and create AI-powered content. These use-cases are quite similar to the generative AI that ChatGPT itself is built on, known as large language models (LLMs). This similarity to ChatGPT seems to have driven interest in OTEX’s services among enterprise clients, who are eager to incorporate LLMs in novel and proprietary ways. It has not led to much of a stock price increase, though: OTEX is only up 2.5% over the last year. As a result, it is among the cheapest AI stocks out there. Brookfield Infrastructure Partners (TSX:BIP.UN) is a Canadian infrastructure investor that is jumping on the AI bandwagon by investing in data centres. I don’t want to push the AI connection too far here: the overwhelming majority of the company’s money is invested in opportunities that have nothing to do with AI. Nevertheless, it is an investment company that is getting some exposure to AI by way of data centre investments. The way Brookfield plays AI is it invests in data centres, which contain servers that can be used to run AI applications. The company is also investing in AI-powered phone calls, which are useful in customer service. Overall, Brookfield Infrastructure Partners is a well-rounded financial stock, that also has an AI angle to it. Worth considering if you prefer Canadian financials to pricey tech stocks, but don’t want to miss out on AI. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 29, 2024 | Amy Legate-Wolfe The easiest way of creating passive income comes from from something you have to do anyway. Add in dividend income,… Read more » March 29, 2024 | Amy Legate-Wolfe This tax credit is one you've likely missed in the past but could provide you with thousands each year! So,… Read more » March 29, 2024 | Amy Legate-Wolfe Sienna stock (TSX:SIA) looks like a strong dividend stock that's only getting stronger, but there is more growth available. Read more » March 29, 2024 | Amy Legate-Wolfe Investors can be safe while still making large amounts of passive income, even from an investment you can afford! Read more » March 29, 2024 | Andrew Button You can save a lot for retirement by cutting out expenses, and you can invest your savings in stocks like… Read more » March 29, 2024 | Amy Legate-Wolfe Create a bulletproof passive-income portfolio to get solid monthly dividends and start creating $20,000 right away! Read more » March 29, 2024 | Andrew Button Dividend stocks like Alimentation Couche-Tard (TSX:ATD) can be good RRSP investments. Read more » March 29, 2024 | Amy Legate-Wolfe This dividend stock has been absolutely crushing the TSX 60 and looks like it will continue to do so while… Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}