{
    "title": "Nvidia chip announcement: A catalyst for further gains?",
    "date": "3/13/2024",
    "url": "https://finance.yahoo.com/video/nvidia-chip-announcement-catalyst-further-155526228.html",
    "text": "Shares of Nvidia (NVDA) are pulling back on Wednesday ahead of the company's GTC AI Conference next week. With expected AI innovation announcements, the chip-making giant may see another catalyst in the coming months for its record-breaking rally. Yahoo Finance Reporter Jared Blikre joins the Live show to break down Nvidia's performance compared to competitors like Super Micro (SMCI). For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino - Investors are hoping the company can show off its AI innovation serving as a catalyst for the stock. To break down what the Street is saying, we have Yahoo Finance's very own Jared Blikre. Jared, do we need any more catalysts after the run this stock has had? JARED BLIKRE: [LAUGHS] I'll tell you what, when we have these investors days and this I think counts as one, the GTC conf-- the-- that event that we're going to have next Monday, is just huge. Lots of excitement over it. Not surprising because Nvidia is one of the top performers of the year. And over the last two years, AI is a story. And Nvidia is no stranger to volatility. You mentioned that two-day slump, that would be from this high here all the way down here. That was a worst slump in days. However, that was overcome yesterday and we're giving back a little bit today. But the bottom line is over the last two years, I think this gives a really good picture. Here's what we've done this year. Here's what we did last year. And, in fact, for about half of last year, that was the back half, we were stuck in a trading range at the upper end, just short of $500. Guess where we are now? We're just shy of a thousand dollars. So when the price is heading towards these big psychological levels that have never been hit before, they can act as a magnet, but also as resistance. And so when we think about catalysts, this is a big one next Monday. The event is gonna start at 1:00 PM. It goes till 3:00 PM that's post-- Pacific time. So we're talking about 4:00 PM, after the market event. But stocks will be trading in the after hours and we'll have to see what the reaction is. They're gonna be introducing their new Blackwell architecture and a new chip that would be the RTX 5090, which has double the throughput, double the bandwidth of the RTX 4090. All of this to say that there's a lot more-- there's a lot more to come in the invest-- in the chip space from Nvidia, specifically to address the needs of this hot market right now. And I will close here by just comparing Nvidia to some of its peers. This is year-to-date. Nvidia a very impressive 80 and 1/2%. You compare that to Super Micro Computer-- I'll show you a two-year chart similar to what we saw before. Now, that's up to 2,700% in two years. No idea if they're having a-- if they're having an investor day, but I would expect to see them moving Monday afternoon as well. - Indeed. Certainly, another beneficiary of the generative AI push that we've seen. Appreciate you as always, our very own Jared Blikre. Related Quotes "
}