{
    "title": "Congress trading alert: Congressman dumps Nvidia stock",
    "date": "3/23/2024",
    "url": "https://finbold.com/congress-trading-alert-congressman-dumps-nvidia-stock/",
    "text": "Congress trading data usually provides valuable insights into the stock market, considering the influence Congress decisions can exert on stocks. Most recently, Congressman Daniel Meuser made three large sellings of Nvidia Corp. (NASDAQ: NVDA) shares, part of a massive trade. Finbold retrieved Congress trading data from Quiver Quantitative, gathered through “The Stock Trading on Congressional Knowledge Act.” This regulation requires U.S. Senators and U.S. Representatives to disclose any financial transaction within 45 days. In particular, Daniel Meuser disclosed, on March 21, three large sales of Nvidia stocks he made on February 20. Two of Meuser’s trades were within a value between $15,001 and $50,000. Meanwhile, the third had a remarkable value between $250,001 to $500,000, according to the Congressman’s filings. Notably, this was not the first time the Congressman has sold large amounts of his shares in Nvidia Corporation. Daniel Meuser’s dumps date from January 21, 2022, being his largest trades and the most significant activity disclosed by the Representative in the past two years. Meuser made three sales on January 21, 2022, one of them in the massive range of $250,000-$500,000. In May 2023, he sold NVDA twice, while making three consecutive dumps on August 14, 2023. After each sale, the NVDA stock saw further increases in price varying from 284% from the Congressman’s first dumps to 30.80% from the most recent activity. However, Quiver Quantitative has no records of Meuser’s purchases, which suggests they were made before June 2019. In that case, Daniel Meuser has accumulated impressive profits from this trade, even by missing out on the highlighted pumps following his sales. Interestingly, NVDA has seen over 2,785% gains from its first traded price in 2019 of $32.66, to the current $942.89 per share. In conclusion, Dan Mauser’s recent activity looks like strategic profit realization from a long-term trade that started years before. Nevertheless, investors must watch for possible future legislation that could affect Nvidia’s performance in the United States. Buy stocks now with eToro – trusted and advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}