{
    "title": "SoundHound AI Stock Is Soaring, but the Company Generates Surprisingly \nLittle Revenue",
    "date": "3/6/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/NVDA-Q/pressreleases/24587599/soundhound-ai-stock-is-soaring-but-the-company-generates-surprisingly-little-revenue/",
    "text": "Artificial intelligence (AI) whipped investors into a frenzy in 2023. They raced to deploy money into companies developing the technology, including Nvidia (NASDAQ: NVDA) which saw a 239% increase in its stock price for the year. The momentum is still building, with Nvidia stock climbing a further 76% in 2024 to date. But SoundHound AI(NASDAQ: SOUN) is doing even better right now. Its stock is up a whopping 194% this year so far, thanks mostly to the news that Nvidia recently made a small investment in the company. SoundHound is a leading developer of conversational AI, which uses voice recognition to create virtual assistants capable of having detailed discussions. SoundHound is worth just $1.6 billion, but it has attracted some of the largest companies in the world across the hospitality and automotive industries as customers, from Krispy Kreme to Mercedes-Benz. However, SoundHound generates surprisingly little revenue. It brought in just $45.8 million during 2023 which was a 47% increase from 2022. The company's guidance for 2024 suggests growth will accelerate to 52%, with revenue expected to come in at $70 million.  At the end of 2023, SoundHound told investors it had an order backlog worth a whopping $661 million, which was double the backlog it held at the end of 2022. So, although the company's revenue is modest right now, orders are piling up and that could drive a substantial increase in the coming years. Nevertheless, SoundHound stock seems quite expensive right now. Its $45.8 million in 2023 revenue combined with its $1.6 billion market capitalization translates to a price to sales (P/S) ratio of 34.9 -- that's even higher than Nvidia's P/S ratio of 34.5! Therefore, while SoundHound stock does have potential, investors might want to temper their expectations in the near-term. Should you invest $1,000 in SoundHound AI right now? Before you buy stock in SoundHound AI, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and SoundHound AI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Nvidia Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}