{
    "title": "CIOs share how they are harnessing gen AI's potential at Nvidia GTC",
    "date": "3/20/2024",
    "url": "https://venturebeat.com/ai/cios-share-how-they-are-harnessing-gen-ais-potential-at-nvidia-gtc/",
    "text": "Join us in Atlanta on April 10th and explore the landscape of security workforce. We will explore the vision, benefits, and use cases of AI for security teams. Request an invite here.  Generative AI use cases are progressing quickly from pilots to production, delivering measurable, reliable results at scale across enterprises today. From detecting anomalies in security logs to improving developer productivity through automation of code migrations, CIOs and IT leaders shared how they’re harnessing gen AI’s potential across a broad base of use cases to achieve productivity gains. CIOs from Nvidia, SentinelOne and ServiceNow participated in yesterday’s panel, Driving Enterprise Transformation: CIO Insights on Harnessing Generative AI’s Potential at  Nvidia’s 2024 GTC Event. The panel was moderated by Rama Akkiraju, vice president of enterprise AI and automation at Nvidia. The panel included Sabry Tozin, vice president of engineering at LinkedIn, Sonu Nayyar, senior vice president and CIO at Nvidia, Sandy Venugopal, CIO from SentinelOne and Chris Bedi, chief digital information officer from ServiceNow. The panel’s insistence that gen AI delivers measurable results resonated across their answers to several questions during the session. The AI Impact Tour – Atlanta Gen AI use cases must deliver measurable value and help streamline processes at scale if they’re going to survive the pilot phase and move into production. Tozin, explained how gen AI is enhancing engineer productivity by automating certain tasks, “We’re making a huge dent in developer productivity by automating a lot of that work. What this does, it actually allows engineers to get back to building new things, adding things that actually provide value to the enterprise as opposed to just working on things that are repetitive or that would be considered sort of maintenance.” ServiceNow embedding domain-specific language models into workflows to reduce back-office workload by 14% is another example shared by Bedi. “We deploy gen AI so that when an employee asks for something in natural language gen AI understands the intent. Ninty-nine percent of the time, they’re getting a gen AI response. But what we saw on the backend is a 14% reduction in the work that’s coming to those back office departments, and that’s in about five months,” Bedi said. Bedi said, “I measure the heck out of everything… And to Sabry’s point, this stuff sells itself. When we actually did the math on all those individual measures and add them up, it’s about $10 million of annualized benefit, and that’s in 120 days. And gen AI for us is doing the work of the equivalent of 50 people, and we’re just getting started with this tech.” ServiceNow’s significant cost savings and productivity gains also demonstrate how CIOs are looking at gen AI in terms of its equivalent human resource contribution and capacity. Tozin’s insights into how and where gen AI is contributing to LinkedIn show how his engineering teams see it as a technology that can offload routine tasks and free up engineering to pursue more challenging, complex work. Each of the panelists alluded to how important it is to also focus on the ROI of any gen AI initiative, comparing the costs of adopting gen AI to the productivity gains and any potential operational efficiencies they can achieve. Dealing with change management, including navigating organizational and technical challenges, is a universal challenge, which makes measuring results even more important. Nvidia and SentinelOne’s CIOs told the audience about gen AI’s role in their company’s new product development efforts and environments. They also spoke about how it’s role in delivering products is growing. Nayyar says that Nvidia has chosen to take the initiative in pursuing gen AI use cases across the company. “As Jensen mentioned yesterday, we’ve got a bunch of stuff already in production. We have ChipNeMo for developer productivity, we’re building additional developer tools such as code critic to just enhance aid in code development and so on across the company. We’ve got entire groups working on this. It’s part of our strategic initiatives. I can go on and on, but we have a ton of use cases that we’ve already deployed.” Venugopal from SentinelOne says gen AI is playing a critical role in their cyber security provider’s product strategy and new product development processes. “There’s been a lot of investments on our product to really utilize the capabilities around look at anomalies in all of the data you have around security logs, access logs, where do you find those weird things happening or potential threats, and how can you generate the right prompts or next actions for your security operations center (SOC) analysts to take? So we’ve actually been customer zero of that product, and that’s been a huge investment in validation work that we’ve done on the enterprise side.” All CIOs on the panel acknowledged that the organizational and technical challenges need to be dealt with head-on and early in the process. Nayyar underscores how important it is to create a culture that values experimentation and risk-taking, with the goal being a safe environment for innovation. All CIOs either mentioned data security and governance specifically or alluded to it as a core strength any organization needs to work on if they’re going to succeed with gen AI. Here’s the best advice the CIOs gave during the panel today: See and use generative AI as a learning tool. Tozin stressed the need for gen AI to be considered just as important as a learning tool and a platform to improve skills as it is a task engine. He says a useful exercise is to ask AI to teach concepts back to you and your team that you may already know to sharpen your understanding. Show curiosity and fascination with gen AI to reduce the anxiety of it for the company. Venugopal recommends that CIOs and leaders stay continually curious about gen AI’s rapid advancements and being a student of how it can help teams. Jump in and prioritize use cases early and be willing to flex and adapt. ServiceNow’s Bedi believes business leaders need to experiment and start using gen AI for specific use cases and personas to see how well the technology fits organizational needs. He stressed the fact that knowing the overlap of gen AI, use cases, and personas early helps move use cases from pilot to production. VB Daily\nStay in the know! Get the latest news in your inbox daily\n\n\n\n\n Subscribe\n\nBy subscribing, you agree to VentureBeat's Terms of Service.\n\n\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\nAn error occured. Stay in the know! Get the latest news in your inbox daily By subscribing, you agree to VentureBeat's Terms of Service. Thanks for subscribing. Check out more VB newsletters here. An error occured. Join Gen AI leaders in Atlanta an exclusive invitation-only event filled with networking and insights on how generative AI is transforming the security workforce. © 2024 VentureBeat. All rights reserved. "
}