{
    "title": "Nvidia's Bubble May Burst Sooner Rather Than Later (NASDAQ:NVDA)",
    "date": "1/9/2024",
    "url": "https://seekingalpha.com/article/4662027-nvidia-bubble-may-burst-sooner-rather-than-later",
    "text": "Justin Sullivan Justin Sullivan NVIDIA Corporation (NASDAQ:NVDA) stock has been one of the biggest success stories in the past several years. It has been Wall Street's darling, and lots of analysts still seem to be highly optimistic on the prospects of it. I also wrote an article last September saying that \"Nvidia Stock Is Not A Buy For A Value Investor.\" However, as I read one of the macroeconomic articles about the prospects of the stock market, I realized that NVDA is a typical bubble stock ready to burst as soon as the fair days for the global economy are over. I agree with the author of this analysis saying that a 1929-style catastrophe may be upon us even though everyone predicts there will be a \"soft landing.\" In other words, it is a possible scenario. Overvalued glamorous stocks lose the most when this happens. And I believe Nvidia could be one of these in spite of its profitability. Asset bubbles have happened in the past. One of the most prominent ones was the famous tulip mania in 17th century Netherlands when people were willing to pay the price of a house in Amsterdam in exchange for a single tulip bulb. This was precisely the price offered on the Amsterdam Stock Exchange at the time. Obviously, the tulip bulbs depreciated incredibly after the end of the frenzy. Precisely the same happened to very popular car manufacturers and radio makers after the 1929 stock market crash in the U.S. Although neither radio production nor car-making stopped, many companies went bankrupt. Or, at the very best, their shares depreciated significantly. A very similar story happened in the late 1990s when there was a Dot.com bubble. During that time, the general public rushed to buy high-tech Internet stocks that were significantly overvalued, and sometimes the companies issuing them even had poor debt positions. Obviously, the outcome was precisely the same. Many investors have lost the fortunes they had invested in those stocks. Right now, artificial intelligence (\"AI\") and microchip stocks might be in a very similar position. Nvidia seems to be one of these. As mentioned, I have covered this company before. In my September article, I wrote that Nvidia's stock was expensive mostly due to the AI charm but also due to its extraordinary profit surge in the last couple of years. I also mentioned the company's strong brand image and compared Nvidia to its competitors. I then analyzed some of its vulnerable revenue sources. Basically, my thesis then remains unchanged. But here I have decided to focus more on the company's fundamentals and valuations. These are pressing issues now because a lengthy and serious recession is likely ahead. Indeed, Nvidia is more profitable than its peers, and it has a strong market position. Moreover, its fans can keep raising the stock price for a while. But think twice before buying the stock now. What is not to like about Nvidia and its fundamentals compared to peers? After all, it has the best profitability compared to its peers. Seeking Alpha Seeking Alpha This is even more true of the company's growth rate. Between 2022 and 2023, Nvidia's net income growth was absolutely incredible. Nvidia's annual net income in ($billion) Main Street Data Main Street Data Nvidia's annual cash flows in ($billion) Main Street Data Main Street Data The same is true of its free cash flows (\"FCF\") that have risen from $5 billion to $18 billion in just over one year's time. As can also be seen from the excerpt below borrowed from Main Street Data, Nvidia's profitability margins are extremely high. Main Street Data Main Street Data On the surface, the picture looks superb. But when a company's revenues and/or earnings rise exponentially over a short time period, then it is often viewed as unsustainable. Interesting is also the structure of Nvidia's expenses. The lion's share of Nvidia's operating expenses, that is $8 billion out of almost $11 billion, is due to research and development. It represents the company's big bet that it would beat its competitors in terms of innovations. Main Street Data Main Street Data Although the company has ample amounts of liquidity, its cash position has decreased compared to 2022 when it was at all-time highs. GuruFocus GuruFocus The same is true of its current ratio. Although it is quite good, currently lingering at more than 3, it has still declined compared to the levels seen a few years ago. Yes, one can safely say that the ratio is normal and the company has used the extra cash to grow its business. Main Street Data Main Street Data But still, the valuations raise questions. Not to mention the fact the positive financial returns seem like a one-off because they have not been growing for a while. There are also risks that can push the corporation's earnings downward. I will cover these in some more detail in the next section. GuruFocus GuruFocus Nvidia's valuations are interesting. According to many different criteria, it is clear Nvidia's stock is highly overvalued. According to Graham's valuation methods, the Earnings power value, and even the discounted cash flow (DCF) model, the stock is highly overvalued. But let us also take a look at NVDA's valuation ratios. Its P/E GAAP is over and above those of Broadcom Inc. (AVGO), Taiwan Semiconductor Manufacturing Company Limited (TSM), and especially QUALCOMM Incorporated (QCOM). The same is true of the company's price-to-free cash flow ratio. It is also over and above those of its peers. True, Intel Corporation (INTC) and Advanced Micro Devices, Inc. (AMD) are not as profitable as Nvidia. But still, we can safely say that NVDA stock is overvalued compared to its rivals. Seeking Alpha Seeking Alpha In spite of Nvidia being such a profitable company, it faces numerous risks. The first and foremost being tensions around Taiwan. In 2023 around $16 billion of its revenues was due to the U.S. However, about $20 billion was due to Taiwan and China. The U.S.-China relations might deteriorate and Nvidia being a U.S. company can therefore be easily affected. Main Street Data Main Street Data But the problems do not end here. The demand surge was due to the fact that more individuals switched to remote work and online learning, resulting in a surge in demand for data center chips. Moreover, due to delivery problems, the microchips were highly scarce. The pandemic and post-pandemic semiconductor boom made Nvidia's sales and profits surge significantly, but the story might change simply because the economic situation might change. Many economists say that a recession is highly likely in the near future. Imagine what would happen to the company's stock if the demand for semiconductors decreases substantially, whilst the asset valuations fall down as well. In my view, in spite of Nvidia's glamorous performance, there are serious risks the company faces. The first and foremost being the fact that Nvidia Corporation's stock is far too overvalued. Then, the valuations are based solely on the last couple of years of extraordinarily good performance and are, therefore, not sustainable. Finally, the industry Nvidia operates in is highly dependent on the U.S.-China relationship and also the overall state of the economy. A lot of analysts predict a likely recession ahead, and also growing tensions around Taiwan. Thus, I issue a Neutral rating on Nvidia Corporation stock. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}