{
    "title": "SWKS: Looking Past NVDA: 3 Chip Stocks Positioned for Outperformance",
    "date": "1/15/2024",
    "url": "https://stocknews.com/news/swks-rohcy-sgh-looking-past-nvda-3-chip-stocks-positioned-for-outperformance/",
    "text": "Login \n        Join Login \n                                            Join SWKS – Despite surging demand for AI chips, NVIDIA (NVDA) may have limited upside due to macroeconomic challenges and its elevated valuation. So, investors might consider grabbing chip stocks Skyworks Solutions (SWKS), ROHM Co (ROHCY), and SMART Global Holdings (SGH), which possess the potential to outperform NVDA. Read on…. Jan 15, 2024 While NVIDIA Corporation (NVDA) may not be able to sustain its exceptional run due to macroeconomic hurdles and its elevated valuation, there are definitely opportunities to generate superior returns in the dynamic chip industry landscape. Thus, investors looking to capitalize on the favorable industry trends could consider buying Skyworks Solutions, Inc. (SWKS), ROHM Co., Ltd. (ROHCY), and SMART Global Holdings, Inc. (SGH), which hold the potential to outperform NVDA in the upcoming months. The United States expands export restrictions on NVDA’s AI chips to some countries in the Middle East beyond China. According to the company, this limitation will affect its A100 and H100 chips designed to speed up machine-learning tasks. A few months ago, NVDA’s stock fell nearly 4% on fears that widening U.S. chip curbs would sap growth in China, its third largest market, and curtail the AI-driven boom in its business. NVDA’s fiscal third-quarter revenue grew 206% year-over-year to $18.12 billion, handily beating expectations. Its net income increased from $680 million to $9.24 billion. Moreover, management guided 231% year-over-year revenue growth in the next quarter. However, NVDA, which has been at the forefront of artificial intelligence developments with its tailor-made graphics processing units, said its China business would take a hit from tighter export controls. NVDA’s valuation also appears significantly elevated. In terms of forward non-GAAP P/E, the stock is trading at 44.68x, 88.2% higher than the 23.74x industry average. Its forward EV/Sales of 22.85x is 696.1% higher than the 2.87x industry average. Moreover, the stock’s forward EV/EBITDA multiple of 41.23 is 163.4% higher than the industry average of 15.65. However, the global semiconductor industry is estimated to grow at a CAGR of 16% to $616.50 billion by 2024 on the back of ongoing product innovation, growing semiconductor demand from AI data centers, next-generation computing, and HPC applications, along with the growth of semiconductors in passenger vehicle and automotive electrification. Furthermore, government interventions, such as the CHIPS and Science Act, further fortify the semiconductor industry’s prospects. The Act sets aside approximately $53 billion toward bolstering semiconductor manufacturing, research, and the creation of a skilled workforce in the U.S. Given the favorable industry trends, SWKS, ROHCY, and SGH could offer better returns than NVDA. Therefore, let us dive into the fundamentals of these three Semiconductor & Wireless Chip industry picks, beginning with number three. Stock #3: Skyworks Solutions, Inc. (SWKS) 3 STOCKS TO DOUBLE THIS YEAR SWKS, together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and the rest of Asia-Pacific. SWKS’ trailing-12-month levered FCF margin of 24.55% is 183.9% higher than the industry average of 8.65%. Its trailing-12-month EBIT margin of 24.17% is 391.2% higher than the industry average of 4.92%. For the fiscal fourth quarter (ended September 39, 2023), SWKS’ net revenue came in at $1.22 billion. Its gross profit came in at $478.20 million. The company’s net income and EPS came in at $244.80 million and $1.54. Analysts expect SWKS’ revenue to be $1.20 billion for the fiscal quarter ending December 2023. Its EPS is expected to be $1.95 for the same quarter. SWKS’ shares have gained 5.7% over the past three months to close the last trading session at $102.48. SWKS’ POWR Ratings reflect this promising outlook. The stock has an overall rating of B, equating to a Buy in our proprietary rating system. The POWR Ratings are calculated by considering 118 different factors, with each factor weighted to an optimal degree. SWKS has a B grade for Quality, Momentum, and Value. It is ranked #21 out of 91 stocks in the B-rated Semiconductor & Wireless Chip industry. Click here to see the additional POWR Ratings for SWKS (Growth, Sentiment, and Stability). Stock #2: ROHM Co., Ltd. (ROHCY) ROHCY, headquartered in Kyoto, Japan, is a global electronic components manufacturer. The company operates in three segments: LSI; Semiconductor Devices; and Modules. Its product portfolio comprises ICs, discrete semiconductor products like MOSFETs, bipolar transistors and diodes, power devices such as power transistors and diodes, and modules. On December 14, 2023, ROHCY and Quanmatic announced that, as certain benchmarks have been met regarding production efficiency, both companies plan on carrying out full-scale implementation in April 2024. This represents the world’s first demonstration of manufacturing process optimization using quantum technology in a large-scale mass production line at a semiconductor manufacturing plant. On November 8, 2023, ROHCY introduced the BD2311NVX-LB gate driver IC optimized for GaN devices, enabling nanosecond-level gate drive speeds for high-speed switching. This development supports the growing demand for smaller, more energy-efficient applications, particularly in power supply units for server systems and high-speed pulsed laser applications like LiDAR. The introduction of the ultra-high-speed gate driver reflects ROHCY’s commitment to advancing GaN technology, catering to the demand for faster switching devices. ROHCY’s trailing-12-month EBIT margin of 14.72% is 199.3% higher than the industry average of 4.92%. Its trailing-12-month net income margin of 13.45% is 470.4% higher than the industry average of 2.36%. For the six-month period ended September 30, 2023, ROHCY’s net sales came in at ¥239.32 billion ($1.65 billion). Its operating profit came in at ¥29.83 billion ($205.83 million). The company’s profit attributable to owners of parent came in at ¥37.31 billion ($257.44 million). The consensus revenue estimate of $3.43 billion for the year ending March 2024 represents a 6.5% increase year-over-year. Shares of ROHCY gained marginally intraday to close the last trading session at $18.31. ROHCY’s POWR Ratings reflect its positive outlook. The stock has an overall rating of B, which translates to a Buy in our proprietary rating system. The stock has a B grade for Momentum, Stability, and Value. The stock is ranked #20 in the same industry. Beyond what is stated above, we’ve also rated for Growth, Sentiment, and Quality. Get all ROHCY ratings here. Stock #1: SMART Global Holdings, Inc. (SGH) SGH is a memory-focused company that engages in the designing and development of enterprise solutions in the United States, China, Europe, and internationally. It operates through Memory Solutions; Intelligent Platform Solutions; and LED Solutions segments. On November 30, 2023, SGH announced that the Company, through its wholly-owned subsidiary SMART Modular Technologies (LX), completed its previously announced sale of 81% of SMART Modular Technologies do Brasil – Indústria e Comercio de Componentes Ltda. (SMART Brazil) to Lexar Europe B.V., an affiliate of Shenzhen Longsys Electronics Co., Ltd. SGH’s trailing-12-month EBIT margin of 5.95% is 20.9% higher than the 4.92% industry average. Its trailing-12-month levered FCF margin of 20.98x is 142.5% higher than the 8.65x industry average. In the first quarter, which ended on December 1, 2023, SGH’s total net sales came in at $274.25 million. The company’s non-GAAP gross profit came in at $91.28 million, and its operating income stood at $26.68 million. Non-GAAP net income attributable to SGH came in at $12.54 million, and non-GAAP earnings per share came in at $0.24. Street expects SGH’s revenue to come in at $1.21 billion for the year ending August 2024. Its EPS is expected to be $1.17 for the same year. Moreover, the company has an excellent surprise history, surpassing the EPS and revenue estimates in three of the trailing four quarters. The stock gained 19.7% over the past month to close the last trading session at $21.41. SGH’s robust prospects are reflected in its POWR Ratings. The stock has an overall B rating, equating to a Buy in our proprietary rating system. The stock has a B grade for Momentum, Sentiment and Value. It is ranked #19 in the Semiconductor & Wireless Chip industry. To access SGH’s additional ratings for Quality, Stability, and Growth, click here. What To Do Next? Get your hands on this special report with 3 low priced companies with tremendous upside potential even in today’s volatile markets: 3 Stocks to DOUBLE This Year > Want More Great Investing Ideas? 3 Stocks to DOUBLE This Year Updated: 2024 Stock Market Outlook > 10 Stocks to SELL NOW! SWKS shares were unchanged in premarket trading Monday. Year-to-date, SWKS has declined -8.84%, versus a 0.29% rise in the benchmark S&P 500 index during the same period. Nidhi is passionate about the capital market and wealth management, which led her to pursue a career as an investment analyst. She holds a bachelor's degree in finance and marketing and is pursuing the CFA program.\r\n\r\nHer fundamental approach to analyzing stocks helps investors identify the best investment opportunities. More... Copyright © 2024. Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions.Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use, please see disclaimer. "
}