{
    "title": "Investors Should Be Encouraged By NVIDIA's (NASDAQ:NVDA) Returns On Capital",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/news/investors-encouraged-nvidias-nasdaq-nvda-110023804.html",
    "text": "Finding a business that has the potential to grow substantially is not easy, but it is possible if we look at a few key financial metrics. Amongst other things, we'll want to see two things; firstly, a growing return on capital employed (ROCE) and secondly, an expansion in the company's amount of capital employed. Put simply, these types of businesses are compounding machines, meaning they are continually reinvesting their earnings at ever-higher rates of return. And in light of that, the trends we're seeing at NVIDIA's (NASDAQ:NVDA) look very promising so lets take a look. Just to clarify if you're unsure, ROCE is a metric for evaluating how much pre-tax income (in percentage terms) a company earns on the capital invested in its business. The formula for this calculation on NVIDIA is: Return on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities) 0.46 = US$21b ÷ (US$54b - US$9.1b) (Based on the trailing twelve months to October 2023). Thus, NVIDIA has an ROCE of 46%.  That's a fantastic return and not only that, it outpaces the average of 11% earned by companies in a similar industry. Check out our latest analysis for NVIDIA Above you can see how the current ROCE for NVIDIA compares to its prior returns on capital, but there's only so much you can tell from the past. If you're interested, you can view the analysts predictions in our free report on analyst forecasts for the company. The trends we've noticed at NVIDIA are quite reassuring. The data shows that returns on capital have increased substantially over the last five years to 46%. Basically the business is earning more per dollar of capital invested and in addition to that, 274% more capital is being employed now too. This can indicate that there's plenty of opportunities to invest capital internally and at ever higher rates, a combination that's common among multi-baggers. All in all, it's terrific to see that NVIDIA is reaping the rewards from prior investments and is growing its capital base. Since the stock has returned a staggering 1,339% to shareholders over the last five years, it looks like investors are recognizing these changes. Therefore, we think it would be worth your time to check if these trends are going to continue. One more thing, we've spotted   1 warning sign  facing NVIDIA that you might find interesting. If you want to search for more stocks that have been earning high returns, check out this free list of stocks with solid balance sheets that are also earning high returns on equity. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}