{
    "title": "Where to buy NVIDIA RTX 4070 Super graphics cards: B&H Photo, Best Buy, and \nmore retailers with the latest stock",
    "date": "1/17/2024",
    "url": "https://www.windowscentral.com/hardware/cpu-gpu-components/where-to-buy-nvidia-rtx-4070-super",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Find the best price for the newly-released GeForce RTX 4070 Super desktop GPU. The NVIDIA GeForce RTX 4070 Super graphics card launches today (Wednesday, January 17) at around 9 AM ET, in line with previous launches. As with most gaming-centric PC hardware, stock will be limited, and scalpers will be on the prowl, looking to beat you to the punch for a purchase. Thankfully, many retailers have safeguards to try and prevent this shady practice, but it's not always foolproof. Plus, you can join a queue to buy it directly from NVIDIA for $599 if you're willing to wait. So, I'm looking for US retailers with the new RTX 4070 Super GPU listings and their latest prices to save you the search. Plus, I've gathered details on specifications, MSRP, and a list of pre-built gaming desktop PCs that come with the new graphics card inside and are ready to use. It's a clever way to pick up the latest PC gaming tech if you were planning to build an entirely new gaming desktop around the new GPU. Why you can trust Windows Central \n\n\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test. The NVIDIA RTX 4070 Super has an MSRP of $599, matching the standard RTX 4070 model that launched in April 2023. It's priced between two AMD Radeon rivals, with the RX 7800 XT at $499 and the RX 7900 XT at $899 MSRP. Naturally, this price is just a suggestion and is generally linked closely to the NVIDIA-manufactured RTX 4070 Super reference card. Third-party models with overclocked internals will likely push above the $600 mark, and potential stock issues can, unfortunately, do the same. Buying one of the best pre-built gaming desktops can save you the hassle of sourcing components and configuring a PC, but the price is usually much steeper. The trade-off comes from trusting a third-party company to help you select parts, build the machine, and test for errors before shipping it. So far, pre-built desktops featuring the new RTX 4070 Super haven't appeared. A few listings were hinted at before the GPU launched, but the stock was already unavailable for pre-order. I'll keep you updated with the latest manufacturers offering a shortcut to a ready-made PC loaded with this brand-new graphics card if it becomes available in the next few hours.  This page will see updates as frequently as possible to reflect availability and pricing across the United States and the United Kingdom. Follow Windows Central Deals on Twitter @WinC_Deals to catch any highlighted bargains.   Discover the thrill of lightning-fast ray tracing, AI-boosted performance with DLSS 3, and more. With RTX 4070 Super and third-generation RT Cores, you can immerse yourself in extraordinarily intricate virtual realms as you’ve never done before. All the latest news, reviews, and guides for Windows and Xbox diehards. Ben is the channel editor for all things tech-related at Windows Central. That includes PCs, the components inside, and any accessory you can connect to a Windows desktop or Xbox console. Not restricted to one platform, he also has a keen interest in Valve's Steam Deck handheld and the Linux-based operating system inside. Fueling this career with coffee since 2021, you can usually find him behind one screen or another. Find him on Mastodon @trzomb@mastodon.online to ask questions or share opinions. Windows Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}