{
    "title": "What's Going On With Nvidia (NVDA) Stock Thursday? - NVIDIA (NASDAQ:NVDA)",
    "date": "1/11/2024",
    "url": "https://www.benzinga.com/government/24/01/36595466/nvidia-secures-1b-ai-chip-deal-in-india-signaling-major-market-expansion",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Nvidia Corp NVDA looks to boost its AI chip sales in India significantly through a significant deal with Yotta, an Indian data center operator. The $500 million deal brings Nvidia's total orders from Yotta to $1 billion, marking a substantial increase in Yotta's AI cloud services. Sunil Gupta, CEO and co-founder of Yotta shared that the order includes nearly 16,000 Nvidia H100 and GH200 AI chips, with delivery expected by March 2025, Reuters reports. Also Read: Intel's Automotive Gambit: New AI Chips to Power Future Cars, Taking On Nvidia and Qualcomm This new order follows a previous purchase by Yotta of about 16,000 H100 chips from Nvidia, scheduled for delivery by July of this year. These deals are especially vital for Nvidia as the company navigates through U.S. export restrictions affecting chip sales to China and other countries. Nvidia's presence in the Indian market is further strengthened by AI partnerships with major Indian conglomerates like Reliance Industries and Tata Group, focusing on cloud infrastructure, language models, and generative AI applications. Yotta, a part of Indian billionaire Niranjan Hiranandani's group, collaborates closely with Nvidia in India and operates three data center campuses in Mumbai, Gujarat, and near New Delhi. The increasing demand for storage and processing in India has attracted global tech giants like Microsoft Corp MSFT, Alphabet Inc GOOG GOOGL Google, and Amazon.Com Inc AMZN to expand their cloud and data center investments in the region. Indian tycoons Mukesh Ambani and Gautam Adani are also entering this competitive field. Yotta's growing investment in AI infrastructure aligns with India's ambitious AI goals, which are estimated to reach $14 billion by 2030. Gupta emphasized the necessity of this infrastructure for India's AI ambitions at the Vibrant Gujarat Global Summit. At the summit, Shankar Trivedi, a senior Nvidia executive, announced that Yotta is establishing an AI data center in Gujarat International Finance Tec-City, which will likely be operational by March. India could be a crucial market for Nvidia, which is presently struggling with norms set by U.S. semiconductor sanctions on China, a significant market for chip designers. The embargo could cost severely, with Chinese cloud companies sourcing about 80% of high-end AI chips from Nvidia, curtailing orders by 50%-60% within five years. Price Actions: NVDA shares traded higher by 1.01% at $548.99 on the last check Thursday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Wikimedia Commons © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}