{
    "title": "SoftBank to Spearhead AI Chip Innovation with $100 Billion Project Izanagi: \nNvidia Under Threat?",
    "date": "2/19/2024",
    "url": "https://www.ccn.com/news/softbank-founder-ai-domination-chip-project/",
    "text": "SoftBank founder Masayoshi Son plans a massive $100 billion chip venture called Project Izanagi to take on Nvidia in the AI chip market. Key Takeaways Masayoshi Son, founder of SoftBank Group Corp., is pursuing funding of up to $100 billion for a chip venture aimed at challenging Nvidia and supplying crucial semiconductors for artificial intelligence (AI) applications, sources familiar with the situation told  Bloomberg. But what’s Project Izanagi? Who will fund it? And is that enough to tackle Nvidia’s leadership in the chip sector? Dubbed Izanagi , the project represents billionaire Masayoshi Son’s latest venture as SoftBank shifts its focus away from startup investments. Son aims to establish a company that complements chip design unit Arm Holdings and propels him into the forefront of the AI chip sector, sources familiar with the matter revealed . Potential funding scenarios include $30 billion from SoftBank and up to $70 billion from Middle Eastern institutions. If successful, the Izanagi chip project would rank among the largest investments in AI since the emergence of ChatGPT. It would also surpass Microsoft’s recent $10 billion investment in OpenAI. Masayoshi Son is raising $100 billion for a chip venture that will rival Nvidia The project is code-named \"Izanagi\" \"it will be the birth of a life form far beyond mankind\" pic.twitter.com/zdoMf1GK6F — Chief AI Officer (@chiefaioffice) February 18, 2024  Son named the project Izanagi, after the Japanese god of creation and life, incorporating the initials for artificial general intelligence (AGI). He foresees a future where machines surpass human intelligence, promoting safety, health, and happiness. While details about funding and project specifics are still under consideration, Son is working to expand Arm’s presence in the AI market and investigating next-generation chip technologies. The project’s development and partnerships to challenge Nvidia’s dominance in high-end AI accelerators are yet to be determined. After facing challenges in startup investments, Son redirected his attention to Arm, aiming to build a powerhouse comparable to the Magnificent Seven stocks. SoftBank’s financial strength, with ¥6.2 trillion – equal to $41 billion – in cash and equivalents as of December 31, benefited from global equity market recovery. A windfall from T-Mobile US shares , nearly $8 billion, and a $50 billion surge in Arm’s market value in just one week further bolstered the company’s balance sheet. $ARM  +40% today Now worth $165 Billion SoftBank paid $32 Billion for the company in 2016 pic.twitter.com/sJqUXebTB9 — Masa Capital (@MasaSonCap) February 12, 2024  While Son and OpenAI‘s Sam Altman explored collaboration in semiconductor manufacturing, Izanagi currently operates independently from Altman’s initiatives. Despite initial efforts to involve another company focused on foundational AI models in the chip venture, they declined to participate, according to sources. Directly leading Project Izanagi, Son previously orchestrated the establishment of SoftBank’s Vision Fund , initially a $100 billion venture with Middle East backing, representing one of the world’s largest tech investment pools. However, over the past 18 months, investments from the fund have significantly decreased compared to previous levels. SoftBank stock surged following reports that founder Masayoshi Son is exploring the creation of a $100 billion chip venture to supply AI-enabling semiconductors. Shares in the Tokyo-based tech investor climbed by 3.2% after the news. In the meantime, Nvidia stock in New York didn’t trade on Monday, February 19, 2024, as markets are closed for President’s Day in the U.S.. Nvidia (NVDA) maintains a dominant position in the artificial intelligence (AI) graphics card market, boasting an estimated 92% market share, which has fueled its impressive growth of 230% over the past year. However, the company faces potential challenges from several tech giants. This would prompt a closer examination of these threats and Nvidia‘s strategies to address them. Nvidia is striving to ramp up the supply of its graphics cards through its foundry partners. Nevertheless, customers may grow impatient waiting for the availability of these chips. 🚀 Nvidia's H100 Chips: A Quantum Leap in AI Performance! 🔝 Revolutionary Advancements:– Nvidia's H100 chips redefine AI performance, boasting a 30x improvement in inference and 4x in training compared to A100 GPUs. 💡🔥 💻 Powerhouse Specifications:– Featuring 80GB of HBM2… — alex natan (@alexusername24) February 16, 2024  In addition, Nvidia’s AI GPUs come with a hefty price tag. For instance, the H100 processor has a price between $30,000 and $40,000. Despite the high cost, investment banking firm Raymond James estimates  Nvidia’s manufacturing cost for one H100 GPU to be just over $3,300. This highlights the significant pricing power the company wields in this market. As competitors like SoftBank vie to challenge Nvidia’s chipmaking supremacy in AI, it’s clear that Nvidia will fiercely defend its position. Morgan Stanley forecasts  that Application-Specific Integrated Circuits (ASICs) could seize 30% of the $182 billion AI chip market by 2027. This would offer a revenue opportunity of $55 billion. And Nvidia is well-positioned to uphold its leadership amidst this changing landscape. "
}