{
    "title": "Why Nvidia Stock Joined the Tech Party Today",
    "date": "2/2/2024",
    "url": "https://www.fool.com/investing/2024/02/02/why-nvidia-stock-joined-the-tech-party-today/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Shares of Nvidia (NVDA 0.12%) were among the big tech winners today as the AI chip leader was able to ride the coattails from Meta Platforms (META -1.68%) and Amazon (AMZN 0.31%), which both jumped today. Not coincidentally, both companies are major Nvidia customers as they are each making their own push into AI. The strong reports seemed to set off a virtuous cycle in the tech sector and lifted Nvidia shares as the chipmaker is the key supplier in AI infrastructure, and euphoria is again pushing up AI stocks. As of 2:34 p.m. ET, the stock was up 5%. Image source: Getty Images. There was little company-specific news out on Nvidia today. Bank of America raised its price target on the stock from $700 to $800 and maintained a buy rating on the stock. Analyst Vivek Arya called for the chip stock to beat estimates by 3% to 5% in its upcoming fourth-quarter earnings report and also expected guidance to be above consensus. However, the main driver behind Nvidia's gains today seemed to be the strong reports from Meta and Amazon as well as their comments about AI. Meta said it planned to roll out its next large language model, Llama 3, this year, and it's aggressively adding new GPUs from Nvidia, saying it plans to buy 350,000 of its H100s. Amazon, meanwhile, touted that it offers the \"most expansive collection of compute instances with Nvidia chips.\" Such is the strength of Nvidia's position that its customers essentially do its advertising for it as having its product is considered an asset at this stage of the AI boom. Nvidia stock is now up 34% as signs continue to emerge that the AI boom is only picking up steam. Investors are clearly looking forward to its Q4 earnings report on Feb. 21 as another strong beat could lift the stock further as its profits are soaring. The consensus calls for revenue to jump 209% to $18.7 billion and for earnings per share of $4.17, up from $0.88. If the company can blow past estimates again, then look for the stock to surge again. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Bank of America is an advertising partner of The Ascent, a Motley Fool company. Jeremy Bowman has positions in Amazon, Bank of America, and Meta Platforms. The Motley Fool has positions in and recommends Amazon, Bank of America, Meta Platforms, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}