{
    "title": "'Elon Musk Would Probably Disagree,' But Expert Says 'Investors Don't See \nTesla As An AI Play Like Most O",
    "date": "2/12/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37062438/elon-musk-would-probably-disagree-but-expert-says-investors-dont-see-tesla-as-an-ai-play-like-mo",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW As Tesla Inc TSLA struggles with plummeting stock prices, investors are questioning its place among the “Magnificent Seven” tech stocks that have been driving the S&P 500 Index to new heights. What Happened: Tesla, once a key player in the Magnificent Seven, is now grappling with a significant drop in its stock price. The company’s shares have fallen by 22% in 2024, in stark contrast to the soaring stock prices of other Magnificent Seven members such as NVIDIA Corp NVDA and Meta Platforms Inc META. While six of the seven companies are thriving due to the growing artificial intelligence (AI) sector, Tesla’s unique challenges are becoming increasingly apparent. Despite Elon Musk‘s efforts to position Tesla as an AI investment, the company is facing a slowdown in electric vehicle (EV) demand, which is casting doubt on its ability to maintain its rapid growth. \"Although Elon Musk would probably disagree, investors don't see Tesla as an AI play like most of the other Magnificent Seven stocks,\" said Matthew Maley, chief market strategist at Miller Tabak + Co., reported Bloomberg. \"We have a much different backdrop for Tesla and the others in the Mag Seven — the demand trend for Tesla products is fading, while it's exploding higher for those companies that are more associated with AI.\" See Also: Did Rivian Just Reveal The First Glimpse Of R2 Interior? Not Exactly Analysts have slashed Tesla’s average 2024 profit estimate by nearly half over the past year, while expectations for the other Magnificent Seven members have either risen or remained steady. This, coupled with Tesla’s heavy reliance on the cyclical automotive industry and the uncertainty surrounding self-driving car technology, is making it hard for investors to justify the company’s high valuation. \"The challenge is that Tesla has become a one-product company — the Model Y, with every other initiative either not a meaningful contributor to revenue and earnings or still a bit of a science project,\" said Jeffrey Osborne of Cowen. \"Being a one-product company and mismanaging the timing of product cycles can create periods of pain, which is what we are in now until the next generation vehicle comes out next year or in 2026.\" Tesla’s strong tie to the cyclical auto industry stands out among the Magnificent Seven, especially given uncertainties around self-driving technology. While Musk predicts widespread robotaxis soon, experts believe it’s years, if not decades, away. \"Tesla is one of the riskier companies we cover because the underlying business is cyclical and the autonomy piece is binary,\" said Ivana Delevska, chief investment officer of Spear Invest. \"They will either crack the code on autonomy or this will drag for many years before anyone has a solution.\" Why It Matters: The recent developments raise questions about Tesla’s position in the Magnificent Seven. Just last month, CNBC’s Jim Cramer suggested that Tesla should be removed from the index, citing the company’s lack of AI focus compared to other members. Tesla had dropped to the ninth position on the list of the biggest companies on the S&P 500 index, further calling into question its status as a Magnificent Seven stock. Despite the challenges, some investors remain optimistic about Tesla’s long-term prospects, given its unique position as the only profitable, large-scale, pure-play EV maker. However, the company’s future remains uncertain, with the success of its autonomy efforts being a key factor. Read Next: Tesla Bull Gary Black’s Blunt Take On Lucid: ‘Advertising Can’t Overcome A Bad Product’ Image Via Shutterstock Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}