{
    "title": null,
    "date": "2/10/2024",
    "url": "https://www.republicworld.com/tech/artificial-intelligence/nvidia-sets-sights-on-30-billion-custom-chip-market-with-new-business-unit/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated February 10th, 2024 at 14:04 IST The Santa Clara-based Nvidia currently controls approximately 80 per cent of the high-end AI chip market. Nvidia, the dominant player in the AI chip market, is reportedly launching a new business unit dedicated to designing customised chips for cloud computing companies and other clients, aiming to capitalise on a burgeoning market estimated at $30 billion. According to sources familiar with the matter, the initiative will focus on crafting advanced AI processors tailored to specific needs, marking a strategic move to solidify Nvidia's position in the rapidly evolving semiconductor landscape. The Santa Clara-based company, renowned for its cutting-edge technology in AI and graphics processing, currently controls approximately 80 per cent of the high-end AI chip market. Its ambitious venture into customised chip design underscores a proactive approach to sustain growth and innovation amidst intensifying competition and evolving customer demands. Nvidia's clients, including tech giants like Microsoft, Google, and Meta Platforms, have increasingly sought bespoke chip solutions to enhance performance and efficiency in various sectors such as cloud computing, 5G wireless, video games, and automotive applications. This trend reflects a broader industry shift towards specialised chip designs tailored to specific use cases, enabling companies to optimise performance, reduce costs, and accelerate innovation. The company's expansion into custom chip design represents a strategic response to emerging market dynamics and underscores its commitment to driving technological advancements across diverse industries. By leveraging its expertise in AI and graphics processing, Nvidia aims to establish itself as a key player in the burgeoning custom chip market, challenging incumbents like Broadcom and Marvell. Moreover, Nvidia's collaboration with telecom infrastructure builder Ericsson for a wireless chip incorporating its GPU technology signals its intent to diversify its offerings and target new growth opportunities beyond traditional AI applications. With projections indicating steady growth in the automotive and video game custom chip markets, Nvidia is poised to capitalise on emerging trends and solidify its position as a leading semiconductor innovator. As Nvidia embarks on its ambitious foray into custom chip design, the industry awaits further developments and potential implications for the competitive landscape. With its track record of innovation and technological prowess, Nvidia is well-positioned to shape the future of the semiconductor industry and drive transformative advancements across various sectors. (With Reuters inputs) Published February 10th, 2024 at 14:04 IST Send us your views, we’ll publish them. This section is moderated. 'No Food For 15 Days': Haryana Youth Forced to Join Russian Army 'To Share Grief': Husbands in Jail, Mrs Kejriwal And Mrs Soren Meet Hostages in Dutch Town Ede Rescued, Man Arrested UP: Portion of Under-Construction Bridge Collapses in Bulandshahr Upset Over Relationship Issues, B.Tech Student Dies by Suicide in Noida Daughter-in-Law of Former Lok Sabha Speaker Shivraj Patil Joins BJP Google's timeline for RCS support on iPhone Han So Hee-Ryu Jun Yeol Call It Quits Within Two Weeks Amid Controversy Zodiac Signs That Are Born To Be Rebels And Challenge The Status Quo 'Received I-T Notice Last Night', Claims DK Shivakumar © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}