{
    "title": null,
    "date": "2/9/2024",
    "url": "https://videocardz.com/newz/nvidia-geforce-rtx-4080-super-stock-running-low-in-the-us-no-msrp-cards-available",
    "text": "High-demand for RTX 4080 SUPER or low launch stock?  The latest high-end NVIDIA GPU released this year, priced at $999, has become highly sought after among gamers. At this price, the card is cheaper at launch compared to the RTX 4080 non-SUPER. However, a week after its release, the card is unavailable at any major US retailer for online orders at its original MSRP. While certain retailers like BestBuy or MicroCenter offer some models at the suggested retail price, they are only available for in-store pickup. Presently, the most affordable option found is priced at $1,123.  The limited availability of the RTX 4080 SUPER at its launch could be attributed to insufficient stocks of the RTX 4080 non-SUPER for several weeks now. Similar to the RTX 4090, finding the RTX 4080 at its $1,200 price point has proven challenging for several weeks prior to the introduction of the SUPER models.   RTX 4080 SUPER in Germany, Source: Geizhals  As of now, none of the retailers we’ve checked, including official US stores for major board partners, have any MSRP models in stock. Moreover, there is no information available regarding upcoming shipments of these cards. On the other hand, in Europe, the situation appears to be more favorable, with several retailers listing the cards at or near the MSRP of €1,109. It is worth adding that at the time of writing, it appears that the RTX 4070 SUPER and RTX 4070 TI SUPER are in stock and that there are no issues with supply. Source: Various We may earn an affiliate commission through Amazon and Newegg links. This website relies on third-party cookies for advertisement, comments and social media integration. Check our Privacy and Cookie Policy for details. You can contact us through our contact page or provide a tip through this page. Copyright © 2024 · VideoCardz.com "
}