{
    "title": "Nvidia pursues US$30bn custom chip scheme",
    "date": "2/11/2024",
    "url": "https://www.taipeitimes.com/News/biz/archives/2024/02/11/2003813374",
    "text": "Nvidia Corp is building a new business unit focused on designing bespoke chips for cloud computing firms and others, including advanced artificial intelligence (AI) processors, nine sources familiar with its plans told Reuters. The dominant global designer and supplier of AI chips aims to capture a portion of an exploding market for custom AI chips and shield itself from the growing number of companies pursuing alternatives to its products. The Santa Clara, California-based company controls about 80 percent of the high-end AI chip market, a position that has sent its stock market value up 40 percent so far this year to US$1.73 trillion after it more than tripled last year. Photo: Reuters Nvidia’s customers, which include ChatGPT creator OpenAI, Microsoft Corp, Alphabet Inc and Meta Platforms Inc, have raced to snap up the dwindling supply of its chips to compete in the fast-emerging generative AI sector. The firm’s H100 and A100 chips serve as a generalized, all-purpose AI processor for many of those major customers, but the tech companies have started to develop their own internal chips for specific needs. Doing so helps reduce energy consumption, and can potentially shrink the cost and time to design. Nvidia is now attempting to play a role in helping these companies develop custom AI chips that have flowed to rival firms such as Broadcom Inc and Marvell Technology Group Inc, the sources said. “If you’re really trying to optimize on things like power, or optimize on cost for your application, you can’t afford to go drop an H100 or A100 in there,” Eclipse Ventures LLC general partner Greg Reichow said in an interview. “You want to have the exact right mixture of compute and just the kind of compute that you need.” Nvidia does not disclose H100 prices, which are higher than for the prior-generation A100, but each chip can sell for US$16,000 to US$100,000 depending on volume and other factors. Meta plans to bring its total stock to 350,000 H100s this year. Nvidia officials have met with representatives from Amazon.com, Meta, Microsoft, Google and OpenAI to discuss making custom chips for them, two sources familiar with the meetings said. Beyond data center chips, Nvidia has pursued telecom, automotive and video game customers. Dina McKinney, a former Advanced Micro Devices Inc and Marvell executive, heads Nvidia’s custom unit and her team’s goal is to make its technology available for customers in cloud, 5G wireless, video games and automotives, a LinkedIn profile said. Those mentions were scrubbed and her title changed after Reuters sought comment from Nvidia. According to estimates from research firm 650 Group’s Alan Weckel, the data center custom chip market will grow to as much as US$10 billion this year, and double that next year. The broader custom chip market was worth roughly US$30 billion last year, which amounts to roughly 5 percent of annual global chip sales, according to Needham & Co analyst Charles Shi. Currently, custom silicon design for data centers is dominated by Broadcom and Marvell. In a typical arrangement, a design partner such as Nvidia would offer intellectual property and technology, but leave the chip fabrication, packaging and additional steps to Taiwan Semiconductor Manufacturing Co (台積電) or another contract chip manufacturer. Nvidia moving into this territory has the potential to eat into Broadcom and Marvell sales. “With Broadcom’s custom silicon business touching US$10 billion, and Marvell’s around US$2 billion, this is a real threat,” SemiAnalysis founder Dylan Patel said. “It’s a real big negative — there’s more competition entering the fray.” Nvidia is in talks with telecom infrastructure builder Ericsson AB for a wireless chip that includes the chip designer's graphics processing unit technology, two sources familiar with the discussions said. Weckle expects the telecom custom chip market to remain flat at roughly US$4 billion to US$5 billion a year. Nvidia also plans to target the automotive and video game markets, according to sources and public social media postings. Weckel expects the custom auto market to grow consistently from its current US$6 billion to US$8 billion range at 20 percent a year, and the US$7 billion to US$8 billion video game custom chip market could increase with the next-generation consoles from Microsoft and Sony Group Corp. Nintendo Co's current Switch handheld console already includes Nvidia's Tegra X1 chip. A new version of the Switch console expected this year is likely to include a Nvidia custom design, one source said. DECOUPLING?\n                                         In a sign of deeper US-China technology decoupling, Apple has held initial talks about using Baidu’s generative AI technology in its iPhones, the Wall Street Journal said                                        China has introduced guidelines to phase out US microprocessors from Intel Corp and Advanced Micro Devices Inc (AMD) from government PCs and servers, the Financial Times reported yesterday.\r\nThe procurement guidance also seeks to sideline Microsoft Corp’s Windows operating system and foreign-made database software in favor of domestic options, the report said.\r\nChinese officials have begun following the guidelines, which were unveiled in December last year, the report said. \r\nThey order government agencies above the township level to include criteria requiring “safe and reliable” processors and operating systems when making purchases, the newspaper said.\r\nThe US has been aiming to boost domestic semiconductor Nvidia Corp earned its US$2.2 trillion market cap by producing artificial intelligence (AI) chips that have become the lifeblood powering the new era of generative AI developers from start-ups to Microsoft Corp, OpenAI and Google parent Alphabet Inc.\r\nAlmost as important to its hardware is the company’s nearly 20 years’ worth of computer code, which helps make competition with the company nearly impossible. More than 4 million global developers rely on Nvidia’s CUDA software platform to build AI and other apps.\r\nNow a coalition of tech companies that includes Qualcomm Inc, Google and Intel Corp plans to loosen Nvidia’s chokehold by going OPENING ADDRESS: \n                                        The CEO is to give a speech on the future of high-performance computing and artificial intelligence at the trade show’s opening on June 3, TAITRA said                                        Advanced Micro Devices Inc (AMD) chairperson and chief executive officer Lisa Su (蘇姿丰) is to deliver the opening keynote speech at Computex Taipei this year, the event’s organizer said in a statement yesterday.\r\nSu is to give a speech on the future of high-performance computing (HPC) in the artificial intelligence (AI) era to open Computex, one of the world’s largest computer and technology trade events, at 9:30am on June 3, the Taiwan External Trade Development Council (TAITRA) said.\r\nSu is to explore how AMD and the company’s strategic technology partners are pushing the limits of AI and HPC, from data centers to ENERGY IMPACT: \n                                        The electricity rate hike is expected to add about NT$4 billion to TSMC’s electricity bill a year and cut its annual earnings per share by about NT$0.154                                        Taiwan Semiconductor Manufacturing Co (TSMC, 台積電) has left its long-term gross margin target unchanged despite the government deciding on Friday to raise electricity rates.\r\nOne of the heaviest power consuming manufacturers in Taiwan, TSMC said it always respects the government’s energy policy and would continue to operate its fabs by making efforts in energy conservation.\r\nThe chipmaker said it has left a long-term goal of more than 53 percent in gross margin unchanged.\r\nThe Ministry of Economic Affairs concluded a power rate evaluation meeting on Friday, announcing electricity tariffs would go up by 11 percent on average to about NT$3.4518 per kilowatt-hour (kWh) "
}