{
    "title": "Should You Buy the Post-Earnings Weakness in Cisco Systems Stock?",
    "date": "2/29/2024",
    "url": "https://www.tradingview.com/news/barchart:c221d6d66094b:0-should-you-buy-the-post-earnings-weakness-in-cisco-systems-stock/",
    "text": "By now, most investors have read the stats - mega-cap tech stocks are carrying most of the water when it comes to the stock market's seemingly unstoppable rise. Nvidia NVDA is far and away the top-performing S&P 500 Index SPX stock of 2024 so far, up nearly 60% year-to-date. And over the past 52 weeks, shares of the chip designer have more than tripled in value. However, not every tech giant is in hypergrowth mode. In fact, while NVDA once again approaches a $2 trillion valuation, the market cap of Cisco Systems CSCO has declined this year below the $200 billion benchmark that's generally used to separate the mega-caps from their large-cap counterparts. But after its post-earning pullback, CSCO stock just might be an appealing value play for investors seeking steady income. Here's a closer look. Cisco Systems Sells Off After Earnings Cisco Systems CSCO, a leading provider of networking and cybersecurity solutions, is a San Jose veteran, having survived the dot-com bust of the 2000s. In fact, the stock's all-time highs above $80 per share were set back in this era, and remain unchallenged. While the broader S&P 500 has gained more than 7% so far in 2024, CSCO is down more than 4% since the start of the year. As a result, its market cap has dropped to $194.6 billion.Barchart Cisco reported its fiscal second-quarter earnings on Feb. 14, posting an earnings per share (EPS) figure of $0.72, with quarterly revenues down 6% $12.8 billion. While CSCO managed to beat the Street's expectations with its Q2 EPS and revenue, the stock still fell as investors reacted to disappointing guidance. For the third quarter, Cisco forecast a profit between $0.84 and $0.86 per share, with revenue projected to range between $12.1 billion and $12.30 billion. By contrast, analysts were targeting Q3 EPS of $0.92, with revenue pegged at $13.09 billion. Likewise, management's full-year forecast for EPS of $3.68 to $3.74 on revenue of $51.5 billion to $52.5 billion was a miss, with Wall Street targeting $3.86 per share on $54.26 billion in revenue. The adjusted guidance reflects a continued adjustment to unusually high past orders and an expected normalization in growth rates. Moreover, Cisco announced a 5% workforce reduction as part of a restructuring plan, with management anticipating $800 million in pre-tax charges as a result. Is CSCO Stock a Good Value Buy? Despite these challenges, Cisco's currently low valuation presents a potential opportunity for income investors. CSCO stock's forward price-to-earnings ratio is 12.99, which is less than half the tech sector median earnings multiple of 25.11 - and it's also a healthy discount to Cisco's five-year average P/E ratio of 14.57. Plus, Cisco's forward price/sales multiple of 3.75 is a discount to its historical average of 3.95. The company offers its shareholders a reliable dividend, too. Cisco pays its investors $0.40 per share on a quarterly basis, which translates to a yield of 3.31% at current levels. The tech titan has raised its dividend consistently for over a decade, and the modest payout ratio of 43% indicates these payouts are sustainable. What Do Analysts Expect For CSCO? Looking ahead, analysts are now anticipating adjusted full-year earnings of $3.72 per share for the fiscal year ending in July, representing an expected decline of 4.36% year-over-year. Revenue for the period is expected to dip 8.38%, on average, to $52.22 billion. Analysts consider CSCO a “hold,” with this rating relatively unchanged in recent months. Among 20 analysts in coverage, 4 call the stock a “strong buy,” 1 says “moderate buy,” 14 deem it a “hold,” and 1 more says “strong sell.” The mean price target from this group is $54.27, about 12.4% above current prices.Barchart The Bottom Line For CSCO Stock Considering Cisco stock's attractive valuation and reliable dividend yield, the stock presents a compelling case for income-focused investors. While recent guidance has been disappointing, the company's well-established foothold in the market, as well as management's expectations for a more favorable order trajectory in the second half, set the stage for better returns ahead. For investors seeking fairly priced opportunities in tech, CSCO is worth considering at current levels. On the date of publication, Faizan Farooque did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}