{
    "title": "Hedge fund Munro says Nvidia, Microsoft have more to run",
    "date": "2/15/2024",
    "url": "https://www.afr.com/markets/equity-markets/hedge-fund-munro-says-nvidia-microsoft-have-more-to-run-20240215-p5f555",
    "text": "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Kieran Moore is portfolio manager of Munro Partners Global Growth Fund. The Melbourne-based hedge fund oversees $4.3 billion in assets. Nvidia, Meta and Microsoft are among the fund’s top holdings. Do you think their valuations have got out of hand? We are comfortable with their valuations. For all three of these companies, we believe their reported earnings per share number can double, as they are all backed by the structural tailwind of artificial intelligence. Munro Partners’ Kieran Moore likes US Tex-Mex fast food operator Chipotle, and Meta. Elke Meitzel For Nvidia, we believe the key driver of its earnings is the accelerated computing solutions that its sells to customers to be used to power data centres. Currently, less than 20 per cent of data centres adopt accelerated computing technology, and over time we expect this penetration to increase. This is a structural tailwind that provides a long runway for Nvidia to grow its earnings. Based on our modelling, as this tailwind plays out, Nvidia will be able to generate close to $50 in earnings per share, which means the company trades today on less than 15 times this future earnings potential. In the case of Facebook parent Meta, AI is accelerating the return on advertising spend that their customers are receiving and driving higher engagement with the platform. Despite the stock having performed strongly in 2023, its revenues are accelerating and margins continue to expand. Today we can invest (in what we believe) is a structural winner for a price to earnings ratio of only 22 times compared to the broader S&P 500 that currently trades on a P/E of 20.5 times. Lastly, Microsoft sits at the start of a long runway of growth, where it has the capacity to significantly expand its earnings by benefitting from AI in two key ways: first, by providing the cloud computing infrastructure through its Azure product; and second, by its software solutions such as Copilot, where Microsoft can charge customers a premium to use it. The fund is long on Chipotle. What is it about the Tex-Mex fast food retailer that differentiates it from rivals? Chipotle is a leading brand in the quick-service restaurant space and is another example of a stock we believe can double its earnings over the next five years. The primary reason it will be able to do this is a focused management team that is committed to rolling out thousands of new stores all over the world. Chipotle restaurants are company owned, that is, they don’t franchise, which means it can generate a higher return on every dollar the company invests in growing the business by rolling out new stores. What did you make of the US reporting season? The US reporting season has been very positive for many of our portfolio companies, with many benefitting from strong revenue growth backed by the structural tailwinds that exist in the world today. These include AI, e-commerce, the GLP-1 drugs to treat obesity and diabetes, and decarbonisation. In addition to this strong growth, many companies held in the portfolios are also rapidly expanding their margins, and perhaps one of the clearest examples of this is at Amazon, where group operating margins are now some of the highest they have ever reported. Which stock in your fund is the most undervalued by the market? We believe Meta is still under-appreciated. What many people often don’t realise is that only approximately 12 months ago, Meta’s revenues were actually shrinking. Now, the business has re-accelerated and growing revenues exceeding 20 per cent, largely due to the increased interaction with the platform by the user base, and also a better return on investment for companies advertising on the platform. This higher return on investment is a direct result of Meta spending more than $US7 billion ($10.8 billion) this year on Nvidia chips to improve their AI product suite. This is a re-acceleration in revenue growth that has come about directly through AI spending. Lastly, we can invest in this revenue re-acceleration story for barely a premium to the S&P 500 today. What’s your favourite local bar or restaurant and your go-to order in Melbourne? It’s hard to go past Scopri in Carlton for home-style Italian food. Any podcasts or TV shows that you’ve listened/watched recently that you’ll recommend? I like the Acquired podcast, it’s excellent. I’d also recommend Business Breakdowns. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}