{
    "title": "OpenAI is looking to build an AI chip empire worth more than AMD, Nvidia \nand intel combined — Sam Altman wants up ...",
    "date": "2/16/2024",
    "url": "https://www.techradar.com/pro/openai-is-looking-to-build-an-ai-chip-empire-worth-more-than-amd-nvidia-and-intel-combined-sam-altman-wants-up-to-dollar7-trillion-says-wsj-report",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Altman plans to significantly enhance the global capacity for semiconductor manufacturing In a bid to reshape the global AI chip industry, OpenAI CEO Sam Altman is reportedly in discussions with investors to raise between $5 trillion to $7 trillion. According to The Wall Street Journal, the ambitious fundraising effort, if successful, would surpass the combined worth of AMD, Nvidia, and Intel, and aims to address the current scarcity of graphic processing units (GPUs) vital for operating large language models like ChatGPT, Microsoft Copilot, and Google Gemini. The proposed fundraising sum is indicative of the substantial capital required to establish new semiconductor manufacturing capabilities. Altman is said to be proposing a partnership between OpenAI, investors, chip makers, and power providers to collectively finance the construction of chip foundries, which will be operated by existing chip makers. OpenAI is expected to be a significant customer of these new factories. Altman's ambitious targets surpass the current global sales of the entire semiconductor industry, which stands at $527 billion. Potential investors include sovereign wealth funds, government entities, notably the United Arab Emirates (UAE), SoftBank CEO Masayoshi Son, and representatives from Taiwan Semiconductor Manufacturing Co. (TSMC), the world's largest dedicated independent semiconductor foundry. The move is intended to significantly enhance the global capacity for semiconductor manufacturing, thereby meeting the increasing demand for GPUs and other AI-specific chips. However, the involvement of the UAE, led by Sheikh Tahnoun bin Zayed al Nahyan, a key security official and chair of numerous Abu Dhabi sovereign wealth vehicles, could raise geopolitical concerns, particularly in relation to the US government's strategic priorities in semiconductor production and AI development. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! The US has been cautious about foreign control over microchip supply due to its significance to the digital economy and national security. Reflecting this, the Biden administration has been making efforts to bolster domestic chip manufacturing through subsidies and regulatory scrutiny of foreign investments in critical technologies. To put the proposed $5 trillion to $7 trillion estimate in context, Ars Technica points out the White House recently announced a $5 billion investment in R&D to advance US-made semiconductor technologies. TSMC has already invested $40 billion into a US chip plant in Arizona, representing one of the largest foreign investments in US history. As of now, it remains uncertain whether Altman has secured any commitments towards his fundraising target. Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. This is what a single 256GB DDR5 memory module looks like — but you won't be able to fit this Micron RAM in your desktop or laptop and it will almost certainly cost more than $10,000 if you can buy it Canonical announces Snap Store crackdown after crypto scam apps overload 4 fun horror movies leaving Netflix in April 2024 you don't want to miss By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}