{
    "title": "Nvidia Just Bought This Under-the-Radar Artificial Intelligence (AI) Stock. \nShould You Buy It, Too?",
    "date": "2/18/2024",
    "url": "https://www.fool.com/investing/2024/02/18/nvidia-bought-under-the-radar-ai-stock-you-buy-too/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) is the world's largest semiconductor company. It's worth a whopping $1.8 trillion, and over $1 trillion of that value was created in the last 12 months alone on the back of its next-generation data center chips designed to process artificial intelligence (AI) workloads. Now, Nvidia is spreading some of its newfound wealth across other areas of the AI industry. It filed a form 13F with the Securities and Exchange Commission (SEC) last week, revealing the company held a number of investments in other AI companies. SoundHound AI (SOUN -0.68%) is one of them, and its stock soared 67% on the day Nvidia's investment was revealed. The company is worth just shy of $1 billion as of this writing, but its voice-based AI technologies are incredibly innovative and have the potential to create substantially more value. Here's why investors might want to follow Nvidia's lead and buy SoundHound AI stock. Image source: Getty Images. You might be familiar with the generative AI chatbot ChatGPT, which was developed by OpenAI. It can answer complex questions and turn text-based prompts into blog posts, images, videos, and even computer code. SoundHound AI, on the other hand, develops conversational AI, which is designed to recognize voice-based prompts and respond in kind. SoundHound says its technology can process speech just like the human brain. It has enormous potential in consumer-facing applications, and some of the world's largest companies have already adopted it. Restaurant chains are using SoundHound to answer phones, automate drive-thru ordering, and assist employees with their routine tasks. Jersey Mike's, White Castle, and Krispy Kreme are just some of the restaurant giants using the technology. SoundHound also partnered with restaurant technology providers like Block's Square, Toast, and Olo. They have integrated conversational AI into their point-of-sale and ordering systems so customers can seamlessly use voice to make purchases. Those integrations are helping SoundHound rapidly expand into tens of thousands of new locations. Automotive giants are also using SoundHound to create highly sophisticated in-car voice assistants. They can do everything from helping the driver navigate their vehicle's features to answering questions about the weather, sports results, and even local restaurant availability. Hyundai, Kia, and Stellantis (Chrysler, Jeep, and Dodge) are just a few of the car manufacturers using SoundHound AI right now. SoundHound will report its financial results for the fourth quarter and full-year 2023 in a few weeks. Wall Street analysts are forecasting $46.5 million in total revenue for the year, which would represent 49% growth compared to 2022. While it appears SoundHound is pulling in relatively modest sales for a $1 billion company, the company has amassed a whopping $341.7 million order backlog as Sept. 30, which it's currently working through. Those orders are expected to convert into revenue over time. Plus, SoundHound delivered just $6.7 million in revenue during the first quarter of 2023, yet management is guiding for $16 million to $20 million of revenue in the fourth quarter. The company is rapidly scaling. According to Nvidia's 13F filing for the fourth quarter of 2023, it purchased 1,730,883 shares in SoundHound AI. It doesn't specify what price Nvidia paid, but the position is worth $6.5 million at SoundHound's current stock price of $3.76. SoundHound wasn't the only stock Nvidia bought during Q4. It accumulated 1,960,784 shares in semiconductor designer Arm Holdings, which are worth over $260 million at the current price. Nvidia also bought a stake in Recursion Pharmaceuticals, worth $95 million at today's price. Nano-X Imaging and Tusimple Holdings are the two other stocks Nvidia purchased. Each of these companies is using AI and autonomous technologies in some capacity. Nvidia's $6.5 million position doesn't say much about SoundHound's future potential. However, the fact Nvidia identified SoundHound amid a growing field of AI opportunities does make you wonder what the chip giant is seeing. Financially speaking, SoundHound was on the brink of running out of money just a year ago, before it secured a $125 million loan facility from Atlas Credit Partners. SoundHound continues to lose money, but that cash infusion should be enough to see the company through the next 12 months (at least) assuming its losses don't grow any larger. It does make SoundHound stock a relatively risky play, and it's no surprise it's incredibly volatile. Its 52-week low is $1.49 and its 52-week high is $5.11, which is a very wide spread. Generative AI is a significant opportunity, and SoundHound has already amassed an impressive list of customers. Plus, its order backlog should result in strong revenue growth for at least the next couple of years. It might be worth following Nvidia's lead by taking a small position in SoundHound AI stock, but investors should brace themselves for a volatile ride. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Block, Nvidia, and Toast. The Motley Fool recommends Stellantis. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}