{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.livemint.com/market/stock-market-news/nvidia-adds-277-billion-in-market-capitalisation-in-one-day-beats-meta-s-record-11708650543985.html",
    "text": "Nvidia share price surged to an all-time high on Thursday with its market capitalisation witnessing the biggest single-session increase in history, topping Meta Platforms’ historic gain just three weeks ago. Nvidia shares jumped 16%, adding about $277 billion in market capitalization and bringing its total market value near $2 trillion. The addition in market value eclipsed the $197 billion gain made by Facebook-parent Meta at the start of the month. The shares of the chipmaker rallied after it reported blowout results that cemented Wall Street bets on the potential for its artificial intelligence technologies. The company’s guidance also beat Wall Street estimates, driven by AI spending at its biggest customers, including Microsoft Corp. and Meta. A series of estimate-beating results means the shares have been getting cheaper on a price-to-earnings basis, Bloomberg reported. Also Read: Nvidia hits 15% upper circuit as AI mania sparks tech rally on Wall Street, market value nears $2 trillion Nvidia surpassed high expectations, according to Morgan Stanley analyst Joseph Moore. “We had never seen $2 billion of upside to quarterly revenue guidance until Nvidia did it a few quarters ago, but it has become routine during the AI surge,\" he wrote. “Strength of AI demand continues to be remarkable.\" Nvidia reported fourth-quarter revenue of $22.10 billion, up from $6.05 billion, and beating estimates of $20.62 billion. Adjusted for certain items, fourth-quarter earnings were $5.16 a share, compared with estimates of $4.64 a share, according to LSEG data. Nvidia forecast first-quarter revenue growth of 233%, ahead of Wall Street expectations of 208% growth. The company forecast revenue for the current quarter of $24.0 billion, plus or minus 2%. Analysts on average were expecting revenue of $22.17 billion, according to LSEG data. It expects first-quarter adjusted gross margin to be 77%, plus or minus 50 basis points. Analysts on average forecast a gross margin of 75.6%. (With inputs from Bloomberg) Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Get the best recommendations on Stocks, Mutual Funds and more based on your Risk profile! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}