{
    "title": null,
    "date": "2/6/2024",
    "url": "https://sfstandard.com/2024/02/06/nvidia-santa-clara-offices-for-sale/",
    "text": " Nvidia’s Bay Area headquarters complex wasn't on the market, but in real estate, cash is king—and everyone has a price. According to multiple sources, a large foreign investor made an unsolicited nine-figure offer to purchase a large portion of the Silicon Valley chipmaker’s seven-building campus in Santa Clara, quietly setting off a blockbuster bidding war for one of the region’s trophy properties. Real estate firm Newmark Group confirmed it is representing the property owner, Preylock Holdings—a Los Angeles firm, which according to its website, manages $4 billion worth of properties—in a potential sale but declined to disclose who made the initial bid. Since then, the sellers have received multiple inquiries from other parties interested, said Steve Golubchik, executive vice chairman at Newmark. “It’s easy to fixate on the global appeal of the tenant, but there isn’t a [real estate] product like this anywhere,” Golubchik told The Standard. He said the property’s blend of data centers, advanced manufacturing and lab facilities makes it more attractive than most traditional office listings. Another appealing feature is the fact that the City of Santa Clara owns and operates its own not-for-profit electric utility, Silicon Valley Power, which allows it to set its own pricing and better manage quality control. San Jose or San Francisco, by contrast, negotiates rates with PG&E, a more sprawling business with a somewhat checkered history. Whoever ends up buying the property, located east of San Tomas Expressway, will also gain possession of roughly 2 million square feet of future development rights, Golubchik said. Nvidia, which has seen its valuation skyrocket in recent years as a result of its dominant position in manufacturing chips that are helping drive the artificial intelligence revolution, is the sole tenant on the property and has been aggressively expanding its office footprint in the area. Between 2018 and 2022, Nvidia built and opened two new office buildings in the area, totaling over 1.2 million square feet. Those buildings, named Voyager and Endeavor (both references to Star Trek spaceships), are not a part of the impending sale, which was first reported by Bloomberg. Since the onset of the pandemic, the office market in the Bay Area has largely been frozen due to the sudden drop in demand stemming from the rise of remote work. The valuations of many office buildings have plummeted and left some owners in a severe cash crunch. But the Nvidia-leased buildings are an outlier. The tenant has a long-term lease, and its stock price has more than quadrupled in the last year alone, rising to a market cap of more than $1.7 trillion. In other words: The property is generating cash and will continue to do so. This, despite Nvidia’s flexible work-from-anywhere policy, which does not require employees work in-person. Representatives from Nvidia did not respond to requests for comment. The Bay Area is no stranger to foreign money flowing into real estate. Companies or government entities from Southeast Asia to the Middle East continue to be sought after as alternative sources of financing as domestic banks have tightened up their lending. Just up the freeway from Nvidia’s headquarters, Chinese firm Genzon Group reportedly paid $260 million for a 49-acre site in 2017 that once belonged to Yahoo. The company planned to build a 10.5 million-square-foot mixed-use development that has since stalled out. In Cupertino, near Apple’s headquarters, the Abu Dhabi Investment Authority partnered with Sand Hill Property Company to redevelop the former Vallco Shopping Center. That project, too, has since been stalled and scaled back from its grand ambitions. Bob Staedler, principal of land-use consultancy Silicon Valley Synergy, said the Bay Area will continue to be an attractive place for foreign investors because of its dynamic economy and proximity to Asia. “These guys have cash on hand and can just knock on doors,” Staedler said. “It doesn’t even matter if the property isn’t listed [on the market]. They want to park their money here.” Kevin V. Nguyen can be reached at knguyen@sfstandard.com "
}