{
    "title": "Warren Buffett's danger to Apple, the truth about Bitcoin's record, and \nNvidia's bubble: Markets news roundup",
    "date": "3/9/2024",
    "url": "https://qz.com/warren-bufett-apple-stock-bitcoin-nvidia-stock-bubble-1851320280",
    "text": "2 / 11 Apple has had a terrible start to 2024 — and one man could make it worse. The tech giant’s stock has consistently tumbled in the first two months of the year. It is currently down almost 10% since the start of 2024, to less than $170 per share. This comes as the AI boom has helped other tech companies’ stocks soar, including Microsoft and Nvidia. Still, one analyst warns that the worst could still be yet to come for Apple, the second-most valuable company in the world. Read More 3 / 11 You borrow money, you pay it back. If you can’t pay it back right away, you might pay some money on top of that. Well, Americans are paying a lot of money on top right now: Data from the U.S. Bureau of Economic Analysis (BEA) suggests that consumers spent a record $1.1 trillion on interest payments last quarter. Read More 4 / 11 The crypto community took a victory lap with the news that the price of Bitcoin hit an all-time high of $69,210. Those celebrations cooled when the value dropped a full 8% just a few hours later, but it marked a stunning recovery from the crypto crash of 2022. For the fans, Bitcoin’s rally was evidence that cryptocurrency is a good investment after all. There’s just one problem: Adjusted for inflation, Bitcoin is actually worth less than it was three years ago. Read More 5 / 11 The skyrocketing demand of a new class of weight loss drugs continues to have ripple effects across the economy. Nowhere is that impact felt more than Denmark. The Nordic country’s largest bank, Danske Bank, forecasted that Denmark’s gross domestic product will grow 2.1% in 2024 and it’s primarily thanks to Novo Nordisk, which makes diabetes medication Ozempic and weight-loss drug Wegovy. Read More 6 / 11 Bitcoin’s hot streak continued when it briefly surged to $69,191.95 and surpassed its previous record-high from 2021. The price later retreated to $68,115 by mid-morning. Read More 7 / 11 When it comes to Nvidia’s huge rally to become the third-most valuable company in the world, Wall Street analysts have mixed opinions. Some think the AI chipmaker’s successes will only continue — while others think it’s a bubble ready to burst. Read More 8 / 11 Everyone’s favorite ravenous blue puppet took to social media to add his gravelly voice to a resounding chorus that has grown louder and louder in recent years, decrying one of corporate America’s favorite margin-bumping tricks. Read More 9 / 11 Deepak Puri of Deutsche Bank’s Private Bank says it might be time to consider lightening up on the ‘Magnificent Seven’ 10 / 11 Job cuts at U.S. companies in February reached their highest level since 2009, according to the monthly layoffs report from Challenger, Gray & Christmas. Read More 11 / 11 "
}