{
    "title": "The Globe and Mail",
    "date": "3/30/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/25157700/these-tech-titans-are-teaming-up-against-nvidia/",
    "text": "Nvidia's (NASDAQ: NVDA) shares soared nearly 2,000% over the past five years and turned the chipmaker into the world's third-most-valuable company. That growth was largely driven by its brisk sales of data center GPUs for processing AI tasks. The market's appetite for those high-end GPUs could continue to outstrip Nvidia's available supply for the foreseeable future. Its revenue soared 126% in fiscal 2024 (which ended this January), and analysts expect it to maintain a compound annual growth rate (CAGR) of 37% from fiscal 2024 to fiscal 2027 as the artificial intelligence (AI) market expands. Image source: Getty Images. The bulls believe Nvidia still has plenty of room to run, even as AMD(NASDAQ: AMD) ramps up its production of its own AI GPUs and major customers like OpenAI and Microsoft(NASDAQ: MSFT) start developing their own in-house chips. However, a new threat might be emerging: Some of the world's largest tech companies have formed a new open-source alliance to prevent Nvidia from dominating the AI market with its closed-source programming platform. To develop apps optimized for Nvidia's GPUs, software developers need to access the chipmaker's closed-source CUDA (Computer Unified Device Architecture) programming platform. Those developers would need to access other programming platforms -- like Intel's OneAPI and AMD's MIOpen -- to port their applications to other brands of GPUs. Since Nvidia already dominates the data center GPU market, there's not much of an incentive for developers to rewrite their applications for other GPU brands. Many of Nvidia's critics believe the symbiotic relationship between its GPUs and CUDA platform supports its near-monopolization the GPU market and locks in its software developers. That's why it wasn't too surprising when Intel(NASDAQ: INTC), Qualcomm, Samsung, Arm, Alphabet's (NASDAQ: GOOG)(NASDAQ: GOOGL) Google Cloud, Broadcom's Vmware, Fujitsu, and Imagination Technologies recently teamed up to create the UXL (Unified Acceleration) Foundation. The UXL Foundation plans to use Intel's OneAPI as a foundation to create an open-source alternative to Nvidia's CUDA platform. It doesn't plan to release its first \"mature\" platform until the second half of this year, but its arrival could potentially loosen Nvidia's iron grip on the GPU software and hardware markets. These tech titans clearly want to challenge Nvidia's dominance of the AI market, but the UXL Foundation probably won't make much near-term progress for three simple reasons. First, Nvidia still develops the world's most powerful data center GPUs. Even though its customers are dealing with supply constraints for its newest GPUs, they won't abruptly switch over to Intel or AMD's discrete GPUs just to save a few dollars. That's why the vast majority of Google Cloud's GPUs are still Nvidia chips, even though it's been gradually developing and testing its own first-party chips in recent years. Therefore, a battle between the CUDA and UXL platforms won't even matter unless one of the GPU underdogs takes a meaningful bite out of Nvidia's dominant market share. Second, AMD -- Nvidia's closest competitor in the discrete GPU race -- hasn't joined the UXL Foundation yet. Another missing tech giant is OpenAI's top backer, Microsoft, which recently started buying AMD's AI GPUs. Therefore, AMD and Microsoft might be quietly working on more ways to promote AMD's MIOpen as an open-source alternative to CUDA and UXL. That fragmentation could, ironically, weaken the open-source push against CUDA and indirectly help Nvidia. Lastly, the UXL Foundation plans to expand its open-source programming platform to Nvidia's GPUs in the future. That roadmap might make it easier for developers to optimize their software for a wider range of GPUs, but it also seems to be a blatant admission that Nvidia will remain the 800-pound gorilla of the GPU market. Nvidia's stock dipped after the UXL announcement, but I think it's a lot of sound and fury that signifies nothing. These big tech companies are teaming up to create an open-source alternative to CUDA, but that alliance is missing two major players and isn't co-developing any new chips that could actually challenge Nvidia. Simply put, this headline-grabbing team-up won't stir up any meaningful headwinds for Nvidia's near-term growth. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 25, 2024  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Qualcomm. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Microsoft, Nvidia, and Qualcomm. The Motley Fool recommends Broadcom and Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}