{
    "title": "In the battle between Apple and Nvidia, the gap is clearly narrowing",
    "date": "3/8/2024",
    "url": "https://www.afr.com/wealth/investing/in-the-battle-between-apple-and-nvidia-the-gap-is-clearly-narrowing-20240308-p5farj",
    "text": "Opinion For more than a decade, the iPhone maker was the world’s most valuable public company. But the arrival of generative AI is boosting the stocks of others. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Federal Reserve chairman Jerome Powell did a lot to help the S&P 500 hit its 16th record for the year when he told a Senate committee that the US central bank was “not far” from being able to cut interest rates. But while Powell’s comments helped stoke the broader market rally, the undoubted star of the S&P 500 for the past year has been artificial intelligence chipmaker Nvidia. Earlier this week, Nvidia overtook Saudi Aramco to become the world’s third most valuable company. What’s more, it is fast closing in on Apple. Nvidia’s share price jumped 4 per cent on Thursday, which pushed its market capitalisation to $US2.2 trillion ($3.3 trillion). In contrast, Apple’s market cap is $US2.61 trillion. (Microsoft, which has a market cap of $US2.99 trillion, is the sharemarket’s undisputed king.) Nvidia’s shares have surged over the last year, while other tech shares have been growing more slowly. Bloomberg But while the gap in market cap between Apple and Nvidia remains sizeable – at close to $US400 million – it is the narrowest it has ever been. What’s more, the gap is closing fast. At the start of this year, Apple was worth some $US1.3 trillion more than Nvidia; a year ago, the gap was $US1.8 trillion. Nvidia is fast gaining ground on Apple as the enthusiasm for companies with exposure to artificial intelligence reaches a fever pitch. This year, shares have climbed an eye-watering 87 per cent. In the past 12 months, they have jumped 295 per cent. In contrast, Apple’s share price has fallen 12 per cent so far this year. And in the past 12 months, it has notched a modest 12.4 per cent rise. Apple’s share price has taken a battering this week, falling some 6 per cent, as the company has come under pressure on a few fronts. Investors were rattled after a report from Counterpoint Research estimated that the company sold 24 per cent fewer iPhones in China in the first six weeks of the year compared with the same period a year earlier. Apple’s market share in China has come under intense pressure after Beijing last year banned government officials from using Apple phones at work, as part of its campaign to reduce reliance on US technology. Further evidence of falling Chinese iPhone sales came from Foxconn, the Taiwanese company that assembles the devices for Apple, which said this week that its February sales were down 12 per cent from a year earlier. Apple also faces pressure on the regulatory front. This week, it was fined €1.8 billion ($3 billion) by European Union regulators for thwarting competition from music streaming rivals, one of the bloc’s largest ever antitrust penalties. The EU said it found Apple abused its App Store dominance to restrict developers from telling users about alternative ways to subscribe to music-streaming services. Apple plans to appeal. Speculation that Warren Buffett’s Berkshire Hathaway could be trimming its stake in Apple is also putting pressure on the share price. Last month, Apple abandoned a decade-long project to make an electric car to rival Tesla. Berkshire has been one of Apple’s biggest backers, boasting a 5.9 per cent stake in the company. But its most recent regulatory filing showed it sold 10 million Apple shares, or 1 per cent of its stake, in the final three months of last year. All the same, Apple shares still account for around half of Berkshire’s equity portfolio. Some investors are also disappointed that Apple has been slow to roll out generative AI – software capable of producing sophisticated text, images and computer code – compared with rivals such as Microsoft and Google. However, Apple chief executive Tim Cook has said the iPhone maker will disclose more about its plans to put generative AI to use later this year. Meanwhile, Nvidia continues to ride the tide of AI enthusiasm, which has caused its share price to rise more than sevenfold since October 2022. What’s more, the demand for Nvidia’s chips is booming, and this is translating into a surge in profits. Last month, the chipmaker at the heart of the AI craze reported stunning fourth-quarter results, with sales more than tripling from a year earlier and earnings surging more than eightfold. Nvidia’s chief executive Jensen Huang said that AI was hitting “the tipping point” and indicated that there was still huge demand for the computing power that underlies it. “Demand is surging worldwide across companies, industries and nations,” he said. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}