{
    "title": "Beyond Nvidia: 7 Underappreciated AI Stocks to Buy Now",
    "date": "3/10/2024",
    "url": "https://investorplace.com/2024/03/beyond-nvidia-7-underappreciated-ai-stocks-to-buy-now/",
    "text": " Intelligence at a relative discount Advertisement Source: shutterstock.com/Tex vector We all love – or at least marvel – at the stratospheric run of semiconductor giant Nvidia (NASDAQ:NVDA) thanks to the artificial intelligence boon. But it also raises a question about underappreciated AI stocks to buy. And that is, when will the other guys get a stab at a moonshot? To be clear, Nvidia has been absolutely smoking the competition. As well, the company has been making critical investments in digital intelligence. So, you can’t fault NVDA stock for rising above fears, doubts and looks of incredulity. The underlying enterprise is simply better than the rest. Nevertheless, it probably wouldn’t be the most prudent idea to bet everything on Nvidia. At some point, you must imagine, the company will disappoint against increasingly elevated expectations. If or when that happens, these underappreciated AI stocks to buy may get their time in the sun. For years, I’ve been pounding my fist on the table for legacy technology stalwart IBM (NYSE:IBM). It took a while but I’m glad to see Big Blue get its dues. Since the start of the year, IBM stock gained almost 22% of equity value. Personally, I believe there’s more upside to come thanks to its longstanding innovations in AI and machine learning. From the company’s Deep Blue to Watson, IBM didn’t just develop AI to answer a bunch of random questions. Instead, Big Blue has focused on imbuing practical capabilities with its systems and platforms. Stated differently, it performs many of the actions that the top-tier AI companies do but at a lower valuation. For example, IBM trades at only 19.08X forward earnings. That’s noticeably below the sector median stat of 23.72X. Further, it’s not a powder puff metric. Analysts project that by the end of this year, earnings per share will land at $10.09. That’s above last year’s EPS count of $9.62. Yes, IBM is a consensus hold and its $188.54 average price target is modest, to say the least. However, Wall Street might not be reading this one correctly. Several years ago, Intel (NASDAQ:INTC) unquestionably used to be the premiere semiconductor specialist. However, the competition has caught up in certain areas, casting doubts upon INTC stock. As a result, analysts don’t seem to hold up much hope for shares, pegging them as a consensus hold. Further, the average price target lands at $46.95, which is terribly modest. Nevertheless, speculators may want to add INTC to their watch list. Using the Shiller price-earnings (PE) ratio, INTC trades at less than 12X. That’s well below the semiconductor industry’s median print of 30.11X. Further, INTC trades at a projected free cash flow (FCF) of 1.31X, favorably below almost 69% of its peers. Financially, there could be some room for growth here. Per the Street’s experts, revenue by the end of this year could land at $57.3 billion. If so, that would be up 5.7% against last year’s print. Also, by 2025, sales could hit $63.93 billion. That would be 11.6% above 2024’s projected revenue. Fundamentally, Intel is committed to delivering chips for 100 million AI PCs by 2025. I’d say that’s a decent candidate for underappreciated AI stocks to buy. As a tax-preparation software developer, Intuit (NASDAQ:INTU) might initially seem an odd idea for underappreciated AI stocks to buy. However, I believe Intuit is one of the enterprises that could truly make a meaningful contribution regarding digital intelligence and its practical applicability. Basically, taxes are complicated. Therefore, Intuit has the ability to generate a 24/7/365 tax accountant. The implications are massive. After all, a key benefit of generative AI is the ability to ask anything. Maybe the chatbot won’t answer but you can still ask whatever you want. That’s different from human interactions, which because of social mechanisms, certain important questions may not be asked out of embarrassment or what-have-you. Notably, analysts rate shares a consensus strong buy and I’m not surprised at all. Looking ahead, Intuit could be one of the most important underappreciated AI stocks to buy. Admittedly, its $705.62 average price target is relatively modest. However, the high-side target lands at $775. In fairness, INTU isn’t particularly undervalued on paper. However, as a steady stalwart, it deserves another look. If we’re talking about underappreciated AI stocks to buy, we’ve got to mention CrowdStrike (NASDAQ:CRWD). A cybersecurity technology firm, CrowdStrike is already relevant thanks to its cloud workload and endpoint security, threat intelligence and cyberattack response services. As we’ve seen in recent years, cyberattacks continue to dampen meteoric innovations in the tech ecosystem. Moreover, it’s quite possible that AI could foster a new wave of nefarious online activities. Basically, cybercriminals can use AI to easily (and quickly) create new malware. What’s worse, these threats may use protocols that help them bypass detection. Therefore, it’s imperative that companies like CrowdStrike get ahead of this problem. Right now, analysts peg CRWD as a consensus strong buy. That’s probably one of the easiest assessments you’ll see. Further, the average price target lands at $381.38, with the high side soaring to $435. Again, that’s not shocking. By the end of this fiscal year, the Street’s experts see revenue coming in at $3.94 billion. If so, we’re talking about a 29% lift from last year’s sales. CRWD is easily one of the underappreciated AI stocks to buy. When it comes to digital intelligence, it’s no shocker to see Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) as one of the underappreciated AI stocks to buy. That’s not to impugn the company and its massive Google ecosystem. Clearly, it knows a thing or two about tech. However, its Bard chatbot – now renamed Gemini – tends to take a backseat to ChatGPT. Nevertheless, as I argued in a TipRanks article, Alphabet may have the long-term edge. Here’s the reality: both Gemini and ChatGPT make plenty of mistakes. They also can be incredibly draining and frustrating errors. Given this reality, ChatGPT’s first-mover advantage doesn’t mean much other than symbolism. When it comes to the nuts and bolts, they’re both roughly on the same footing. However, Gemini could rise higher in the long run thanks to Google effectively owning the internet. If Gemini could somehow be integrated with a self-correcting protocol – that is, it looks up answers on Google before giving them – it could end up being exponentially more useful than ChatGPT. Still, one would need to exercise considerable patience for this narrative to pan out. While you’re waiting, you can potentially grab a robust reward over the next 12 months from this “strong buy” stock. If you look at my work output for InvestorPlace and other platforms, you’ll see that I don’t have too much free time. So, I missed much of the earlier enthusiasm surrounding Adobe (NASDAQ:ADBE) and its generative AI solutions. After taking another look, I’m impressed at the modulation opportunities available because of digital intelligence. Not only that, productivity should accelerate tremendously. However, the market appears to be digesting ADBE’s robust return from last year. Admittedly, the price action seems questionable. It’s definitely a higher-risk opportunity among underappreciated AI stocks to buy. That said, analysts anticipate revenue of $21.46 billion for the current fiscal year. If so, we’re talking a revenue growth rate of 20%. Even better, 2025 sales are projected to land at just under $24 billion. That would be almost 12% up from 2024’s projected revenue. Earnings should also soar to $17.94 and $20.31 per share, respectively, in this year and next. Lastly, analysts peg shares as a consensus moderate buy with a $649.52 average price target. Further, the high-side target reaches a lofty $705. Among the most underappreciated AI stocks to buy, Baidu (NASDAQ:BIDU) makes the most sense; that is, it’s easy to figure out why investors have been skeptical about BIDU stock. Sure, from the doldrums of 2020 to early 2021, BIDU went parabolic. However, the subsequent crash stemmed largely from concerns about China’s economy. As you can see from the year-to-date performance, it’s still a matter of concern. However, investors may want to give Baidu another look. For one thing, the company is undervalued now. At the midway point last year, BIDU stock traded hands at 14.47X forward earnings. Right now, this metric sits at 9.51X. Second, analysts anticipate solid growth for this year, with sales possibly reaching $20.16 billion. The high-side estimate aims for just under $21 billion. By 2025, experts anticipate sales to reach $21.63 billion on average and $23.19 billion at the high end. These aren’t unrealistic expectations given Baidu’s investments and substantive progress in AI. Finally, Wall Street rates shares as a unanimous strong buy with a $164.52 average price target. That makes it one of the most compelling underappreciated AI stocks to buy. On the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. A former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia. Artificial Intelligence, Technology Blue-Chip Stocks, Dividend Stocks, Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/beyond-nvidia-7-underappreciated-ai-stocks-to-buy-now/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}