{
    "title": "Forget Nvidia: Another \"Magnificent Seven\" Artificial Intelligence (AI) \nPowerhouse Is Cheaper",
    "date": "3/17/2024",
    "url": "https://finance.yahoo.com/news/forget-nvidia-another-magnificent-seven-100500143.html?ref=biztoc.com",
    "text": "When you think about buying an artificial intelligence (AI) stock today, one of the first names to come to mind is probably Nvidia. And for good reason. Nvidia is the leading seller of AI chips, with more than 80% market share, and this has driven record earnings and tremendous share performance in recent times. Nvidia is also one of the industry-leading stocks dubbed the \"Magnificent Seven,\" a reference to the 1960 film. These stocks have led the market's gains over the past year thanks to their growth and focus on the hot area of AI. But Nvidia isn't the only game in town for investors who want to get in on the AI boom. In fact, another member of the Magnificent Seven is cheaper than Nvidia and is on track to become an AI powerhouse. And this means you may want to hold off on buying Nvidia right now and instead get in on this more compelling Magnificent Seven buying opportunity. So what stock am I talking about? A company that's built a social media empire and in recent times has poured investment into AI -- which it aims to use across its products and services. I'm talking about Meta Platforms (NASDAQ: META). You probably know Meta well thanks to its suite of leading social media apps, including Facebook, Messenger, Instagram, and WhatsApp. The company makes most of its revenue through advertising across these platforms -- they're such popular apps that advertisers flock to them to reach us, their potential customers. This has helped Meta grow its earnings into the billions of dollars over the past several years. And it's likely Meta will continue with this dominance for two reasons. First, its broad range of social media apps helps this company appeal to a variety of age groups and interests. Second, switching to a different social media platform takes a decent amount of time and effort -- and Meta's platforms are widely used around the world. These points keep users coming back. This is great because we can count on this revenue driver supporting Meta's big AI initiative, one the company is making a priority. Meta CEO Mark Zuckerberg says this year AI will be the company's \"biggest investment area,\" from engineering to compute resources. By the end of this year, Meta aims to have 600,000 graphics processing units (GPUs) on board to power its AI programs. One of Meta's big projects so far has been developing its Llama large language model (LLM) and right now Llama 3 is in the training stage. The company is focused on an open-source process, which allows anyone to access general infrastructure such as the Llama models. This could be a winning bet for Meta because open-sourcing results in greater use of the particular tool, such as Llama, and community feedback -- and that helps make the platform more secure, could lead to it becoming an industry standard, and may drive top talent to Meta. Meta has already rolled out various AI tools across its social media platforms, for example AI stickers and virtual assistant Meta AI, both powered by technology from Llama 2. In the future, Zuckerberg says his goal is for every Meta user to have access to AI tools that suit their needs -- from the AI assistant to AI tools that help businesses better serve customers. These features should encourage Meta users to spend more time on the apps, and this in turn makes these apps the perfect destination for advertisers. So, Meta's investment in AI now should drive revenue growth down the road. All of this could also transform Meta into an AI industry leader, opening the door to new revenue opportunities. Now let's consider Meta's valuation. You have to pay surprisingly little to get in on this stock with a solid growth track record and promising AI prospects -- it's trading for only 25 times forward earnings estimates. That's compared to 37 times for Nvidia. Of course, these companies work differently within the world of AI. Nvidia sells AI chips and other products and services to develop AI platforms -- Meta actually is an Nvidia customer, buying GPUs from this market leader. But both of these Magnificent Seven companies are benefiting and could continue to thrive in the AI space. And right now, thanks to its investment in AI and bargain valuation, Meta makes the best stock to scoop up without hesitation. Should you invest $1,000 in Meta Platforms right now? Before you buy stock in Meta Platforms, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 11, 2024 Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Adria Cimino has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms and Nvidia. The Motley Fool has a disclosure policy. Forget Nvidia: Another \"Magnificent Seven\" Artificial Intelligence (AI) Powerhouse Is Cheaper was originally published by The Motley Fool Related Quotes "
}