{
    "title": "Shipments of graphics add-in boards increase for third quarter in a row",
    "date": "3/5/2024",
    "url": "https://gfxspeak.com/featured/shipments-of-graphics-add-in-boards-increase-for-third-quarter-in-a-row/",
    "text": "GfxSpeak Robert Dow March 5, 2024 TIBURON, CA (March 5, 2024)— According to a new research report from leading analyst firm Jon Peddie Research (JPR), unit shipments in the add-in board (AIB) market increased in Q4’23 from last quarter. Nvidia increased its market share from Q3’23, with AMD increasing its market share year over year. Graphics card shipments increased by 6.8% quarter to quarter and 32% year over year. Since Q1 2000, over 2.3 billion AIBs, worth about $482 billion, have been sold. The market shares for the desktop discrete-GPU suppliers shifted in the quarter, as Nvidia’s market share decreased from last quarter by 2%, and AMD’s share increased year over year by 7%. Intel, which entered the AIB market in Q3’22 with the Arc A770 and A750, remained flat, as the company has yet to gain significant traction in the add-in board market. Nvidia continues to hold a dominant market share position at 80%. Shipments of desktop CPUs and graphics add-in boards have increased for three quarters in a row. AMD’s quarter-to-quarter total desktop AIB unit shipments increased 17%, while Nvidia’s quarter-to-quarter unit shipments increased 4.7%, contributing to the strong quarter for graphics add-in board shipments. “Today’s AIBs, although seemingly expensive, offer an astonishing amount of computing power to a wide variety of applications from AI to CAD, to gaming, photo/video editing, and visualization. They are a potpourri of processors and dedicated compute engines. And, they run crazy fast and drive huge arrays of high-speed private memory, while driving multiple 4K monitors at 120 Hz or higher. Consumers at all levels intrinsically know this, and maybe can’t express the technical details fully, but can very explicitly tell you if the AIB meets their expectations in price-performance for the applications they care about,” said Jon Peddie, president and founder of Jon Peddie Research. “And the answer is—they are pretty damn happy and vote with their dollars. This marks the fourth quarter of increased sales for AIBs, and with the backlog of new games and AI-based applications, it looks like the demand is going to stay fairly high. We are entering a golden age for AIBs, but let’s not get ahead of ourselves and overreact as we did in the past with crypto and Covid.” C. Robert Dow, analyst for Jon Peddie Research, added: “The graphics add-in board market enjoyed significant growth during Q4 2023. The clear growth during the last three quarters, along with the stabilization in overall graphics add-in board prices, signals a return to seasonality for the market. Early indications for Q1 are that the market is remaining stable. Both Nvidia and AMD released new AIBs in January, and those prices have remained close to the introductory MSRP, which is a good sign for consumers looking to upgrade their systems.” Jon Peddie Research’s AIB report is now available and sells for $3,000. The annual subscription price for JPR’s AIB report is $6,000 and includes four quarterly issues and four hours of consulting. Subscribers to JPR’s TechWatch are eligible for a 10% discount. Bundled packages are also available. For information about purchasing the AIB report, please call (415) 435-9368 or visit the Jon Peddie Research website at http://www.jonpeddie.com/. Jon Peddie Research has been active in the graphics and multimedia fields for more than 30 years. JPR is a technically oriented multimedia and graphics research and consulting firm. Based in Tiburon, California, JPR provides consulting, research, and other specialized services to technology companies in various fields, including graphics development, multimedia for professional applications and consumer electronics, high-end computing, and Internet-access product development. JPR’s Market Watch is a quarterly report focused on PC graphics controllers’ market activity for notebook and desktop computing. Company contact: Jon Peddie, Jon Peddie Research(415) 435-9368[email protected] Robert Dow, Jon Peddie Research(415) 407-0757[email protected] Media contact:Carol Warren, Creor Group(714) 890-4500[email protected] ‘Silhouette’ claims Autodesk-sponsored student prize at VES Awards Nvidia releases RTX 2000 for SFF and traditional workstations News Watch Alienware keys in on gamers with new Pro wireless gaming keyboard News Watch This gamer mouse is lightweight and really fast News Watch News Watch News Watch Featured Hot Picks Jon Peddie Research4 St. Gabrielle Ct.Tiburon, California 94920 415-435-9368 © 2024 Jon Peddie Research About us | Privacy Policy | terms of service | contact "
}