{
    "title": null,
    "date": "3/28/2024",
    "url": "https://www.investors.com/research/swing-trading/nvidia-stock-earnings-report-swing-trade-success/",
    "text": "BREAKING: Core PCE Inflation In Line With Views      Last week's column covered our recent trade with Taiwan Semiconductor: \"Taiwan Semi isn't too bad, but it isn't Nvidia.\" Let's look at another swing trading example with Nvidia stock, our most successful trade this year so far. Nvidia (NVDA) closed 2023 with a massive gain, nearly 204%. However, the bulk of that run was in the first half of the year. The Q3 earnings report could have easily turned into a breakout if not for the holiday break. After Thanksgiving, the Nasdaq hit resistance and traded sideways until mid-December. It popped and dropped again after the New Year. A week into 2024, Nvidia announced its new desktop graphics processors, taking advantage of artificial intelligence. On Jan. 8, Nvidia cleared the 505.48 buy point of its flat base and we opened our position (1). We took our first profit the next day with a 3.5% gain (2). It was smooth sailing for five weeks. Nvidia stock made a steep ascent, triggering the eight-week-hold rule on Jan. 24 (3). On Feb. 5, Goldman Sachs hiked its price target to 800 from 625. The market helped as well. On Feb. 9, the distribution count on the Nasdaq fell to 1 with advancers outnumbering decliners 2-to-1. Nvidia only closed below its 5-day moving average line once during that stretch. Nvidia made an all-time high Feb. 12 before reversing below the price it opened at that day. With earnings looming and strength appearing to wane, we took our second profit (4). Locking the second profit at 41% appeared to be the right move. The next day, a hotter-than-expected CPI report hit the Nasdaq for nearly 2% and the road got bumpy. Following the three-day weekend, Nvidia fell sharply. It took out the lows of the past seven trading days within the first 30 minutes of the opening bell. Not wanting to give back even more of our gains, we decided to exit our final third (5). With 36% profit, our average gain came to nearly 27%. David Keller shares that rotation might present strong stocks even if the indexes weaken. Hindsight is always 20/20. When swing trading, holding through earnings can be a very risky. A 10% to 15% move can often be expected, but in which direction? For those comfortable with longer-term trading, a swing trade like Nvidia would have been a good candidate to turn into a position trade. Following the Q4 earnings release, Nvidia stock resumed its ascent, ultimately peaking more than 90% above the January breakout. Despite being our best trade, the overall impact to the portfolio was somewhat underwhelming. With a true market leader such as this, we've been considering some possible changes to position sizing with the SwingTrader platform. Stay tuned for more. More details on past trades are accessible to subscribers and trialists to SwingTrader. Free trials are available. Follow Dominic on X, formerly known as Twitter, at @IBD_DGessel. YOU MAY ALSO LIKE: Swing Trading Strategy Basics Eric Krull Shares His \"Everest\" Signal For Recognizing Tops In Stocks Charting Legend Reminisces On How 20-year Bull Market Of 1982 Looks Like Today MarketSurge Is Here! Three New Features You Need To Know. 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}