{
    "title": "Nvidia, AMD, and Broadcom Poised for AI Boom, Mizuho Analyst Says - NVIDIA \n(NASDAQ:NVDA), Broadcom (NASDA",
    "date": "3/7/2024",
    "url": "https://www.benzinga.com/news/24/03/37542447/nvidia-amd-and-broadcom-poised-for-ai-boom-mizuho-analyst-says",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Mizuho analyst Vijay Rakesh reiterated a Buy rating on Nvidia Corp NVDA, Advanced Micro Devices, Inc AMD, Broadcom Inc AVGO, and Arm Holdings Plc ARM. The analyst raised the price target of Arm from $100 to $160, given further custom silicon and mobile upside. Rakesh raised the price target of Nvidia to $1,000 (from $850), Broadcom to $1,550 (from $1,450), and AMD to $235 (from $200), citing multiple expansion with multiple catalysts ahead. The stock prices of Nvidia, Broadcom, and Arm are trading higher Thursday. The analyst highlighted Arm’s accelerating custom silicon roadmap with Neoverse N3 and V3 and foundry collaboration with Intel Corp INTC. Arm remains the unquestioned leader in the mobile CPU space with >99% market share, with potential for further revenue ramps as more OEMs move to v9 platforms, per Rakesh. The analyst maintained his fiscal 2025 revenue and EPS at $4.0 billion and $1.52 (cons. $3.9 billion and $1.52) while raising fiscal 2026 revenue and EPS from $4.8 billion and $1.99 to $4.9 billion and $2.02 (cons. $4.8 billion and $1.93) with improved Client and Infrastructure outlooks while introducing fiscal 2027 revenue and EPS of $6.1 billion and $2.86 (cons. $5.5 billion and $2.30). The analyst said that Arm’s mobile (Client) revenues could grow at 34% CAGR from fiscal 2025-2028 to $3.5 billion as V9 adoption grows. As per the analyst, Nvidia remains the biggest near-term AI winner, with AMD and Broadcom also being primary beneficiaries. He noted strength in Nvidia’s AI ramp through 2024 and 2025 with GH200, B100, B200 with his 2024 at ~$89 billion in Data Center revenues with potentially more upside and potentially, he estimated, reaching ~$280 billion in AI Data Center revenue by 2027 with strength also in ramps at peers Broadcom and AMD. With AMD, Rakesh noted it as the second largest player in a continually expanding AI GPU market while still lagging behind Nvidia, as he said it could see 2024 AI revenue upside to ~$4-5billion (vs current estimates of $3.5 billion) but potentially ramping to ~$18 billion by 2027. Rakesh noted the potential for Broadcom to grow its AI revenues from an estimated $8 billion in 2024 to potentially as high as $20 billion in 2027 as it ramps up custom silicon solutions for customers. He noted Broadcom is well positioned in the new AI arms race. Investors can gain exposure to Nvidia via VanEck Semiconductor ETF SMH and Global X Robotics & Artificial Intelligence ETF BOTZ. Price Actions: NVDA shares traded higher by 3.49% at $918.00 on the last check Thursday. Photo via Wikimedia Commons © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}