{
    "title": "Will Europe Have Its Own NVIDIA?",
    "date": "3/16/2024",
    "url": "https://www.forbes.com/sites/mikeosullivan/2024/03/16/will-europe-have-its-own-nvidia/",
    "text": "A political cartoon aimed at wealth businessman Cyrus Field (1819 - 1892), Jay Gould (1836 - 1892), ... [+] Cornelius Vanderbilt (1794 - 1877) and Russell Sage (1816 - 1906), 1883. Laborers awash in a sea of hard times struggle to hold up the lumber, paper, and linen industries with low wage jobs on their backs as the industrialists and their millions weigh them down. (Photo by Stock Montage/Getty Images) A few weeks ago we wrote of the ‘Bubble Brewing’ in large US technology stocks. Since then some tech stocks like Tesla\nTSLA\n have struggled, but the leader in the ‘bubble’ pack Nvidia has powered on though it is becoming more volatile, such that on a given day it rises or falls by the same magnitude of the market capitalisation of well-known European firms like Volkswagen (Nvidia is worth over USD 2 trn, while Volkswagen is worth a paltry USD 65bn). The disparity in size between what many would consider a giant of European industry (Volkswagen employs 670,000 people half of whom work in Germany) and a fast-growing tech company (Nvidia has roughly 26,000 employees) leads many people to demand that Europe should have its own giant companies. This is not itself a coherent strategy. In the US, the technology giants have become so large as to at very least be oligopolistic, and in some cases monopolistic. Only the veneer of great power competition where tech giants are part of the competitive arsenal of the great powers makes this level of concentration acceptable (by the way the ten largest companies in the US have the largest share of the stock market since…1929). While Europe doesn’t have this problem, a better way to frame the ‘we need to be bigger’ question is to ask what can be done to allow European companies to scale more easily – that after all is the essence of technology led businesses. With a new European defence procurement strategy being put in place, the EU AI Act in force and a supporting ‘supercomputing’ strategy drive its infrastructure, this question becomes even more pertinent. When I think of firms that have successfully scaled across Europe, many have done so by mergers and acquisitions (drinks and spirits) and most are in industries with tangible products that appeal across cultures (luxury goods, payment technologies and drinks, again). In most cases, the difficulty in scaling lies in distribution networks – financial services being a good example. There are many reasons why it is difficult to scale firms across Europe – the lack of deeper capital and venture markets is one. A more telling reason is the cultural and legal complexity of operating across countries with distinct ways of doing things. Within this, the vast majority of European firms – even those fast growing tech firms – tend to have an unavoidable cultural imprint, and these ‘imprints’ make it extremely difficult for firms to go from the ‘national’ to the ‘pan-national’. For example, whilst many French politicians speak to the idea of pan-national champions, virtually no large French companies have ‘foreigners’ as CEO’s (and few women also). For most executives, the ‘national’ rather than ‘European’ corporate politics matters, in the same way that most European politicians would value a seat in their national parliament more than the European parliament. What then needs to be done to build large pan-European corporate champions? First, a few clues come from countries in the geographic and cultural hinterland to the EU. The UK, for instance, used be home to large firms – banks, oil companies and a few tech giants – which is widely regarded as a free-market capitalist economy. The UK should have more mega cap companies but it appears that the shock of Brexit, a longstanding neglect of education and public services and the degradation of the labour market, have undercut its attractiveness. Two other countries that come to mind in a more positive sense are Canada and Switzerland. Canada doesn’t have any mega-cap companies (it has a bunch of large banks, railway companies and miners) but the breadth of its investment ecosystem strikes me as one for Europe to emulate. It is one of the few economies (it has the same population as Poland and 10 million less than Spain) to have a range of successful venture, private equity, infrastructure, and agriculture investment firms and very large pension funds, thanks mostly to progressive pension and tax laws. Switzerland is perhaps a beacon for Europe. Despite the fact that it has a population that is only 12% of that of Germany, its stock market is just half the size of that of Germany (Switzerland has a more impressive stock market to GDP and population ratios than the US), and Switzerland has a range of large global firms such as Nestle and UBS. There are a few elements for Europeans to focus on, notwithstanding the fact that Switzerland is very much the exception. One is that Switzerland has a well-developed capital markets and a large pool of savings capital (a lot of it comes from outside Switzerland), a developed financial markets eco-system, a lively market for executive labour, high levels of research and development and heavy investment in education (front skills based apprentice schools to top flight universities like ETH\nETH\n). Digesting the Swiss recipe for success, and that of other countries might lead to the following suggestions. The Swiss example might point to the need for greater private funding (through endowments) of universities, spread across departments so that developments in physics are matched by the legal and philosophical frameworks that should accompany the deployment of new technologies. It might also point to better funding of pensions and the ability for pension funds to invest in a wider range of asset classes. There is also a need for the European Investment Bank to make greater equity investments, and potentially greater coordination between corporate venture capital firms across Europe. More generally, Europe needs to think about corporate governance on a pan-European level, to reiterate a recommendation we made in ‘The Levelling’ ‘One such proposal would be to harmonize the processes involved in setting up a business. The European Union could establish an EU-level process whereby entrepreneurs could adopt an EU template for setting up a business such that it would take the same amount of time to establish a business anywhere in the European Union. The EU entrepreneur template should ideally make the early stages of the life of a business as uncomplicated as possible and it could be a basis to harmonize laws across specific topics, such as bankruptcy, prosecution of corruption, and labour laws. This would be a much more meaningful reform than deeper political uniformity’. This proposal could for example be established under the EU Horizon programme, and with deeper pools of capital might be the beginnings of a cadre of European corporate champions. As a final comment, perhaps the greatest obstacle to policy action on building corporate ‘champions’, is that there are no votes in this as a political issue in Europe, and therefore little impetus for change.  "
}