{
    "title": "Nvidia CEO Jensen Huang explains why his company is making humanoid robots",
    "date": "3/20/2024",
    "url": "https://www.nbcsandiego.com/news/national-international/nvidia-ceo-jensen-huang-explains-why-his-company-is-making-humanoid-robots/3466930/",
    "text": "In an interview with CNBC's Jim Cramer, Nvidia CEO Jensen Huang explained why his company is bullish on humanoid robotics. At GTC, its annual conference, this week, the artificial intelligence powerhouse announced new hardware and software aimed at the burgeoning robotics industry. This new tech is meant to help robot makers develop and produce robots, including but not limited to humanoid robotics. Huang said he thinks the humanoid form factor in robotics could potentially transform manufacturing. \"We're in a world where,  in order to write a software for a computer, we use data, or training examples, and the computer learns from the examples,\" he said. \"Well, we have the most examples of human(s) moving around of just about any other data.\" Huang suggested \"we built the world for ourselves,\" and used a car factory as an example, saying that manufacturing lines were created for people. Using data from humans will make robots the most productive they can be at these tasks, he said. Eventually, he predicted, factories will see a robot orchestrating a bunch of manufacturing robots that are building cars that also will be robotic.  Huang also touched on Nvidia's many partnerships in Big Tech and beyond, saying his company is \"a market maker, not a share taker.\" He asserted that Nvidia's technology will create jobs. \"This is going to create jobs, it's going to make companies more productive,\" he said. \"When companies are more productive, their earnings improve, or their revenues go up. When that happens, they hire more people.\" Correction: A previous version of this story mischaracterized Nvidia's role in robotics. Click here to download Jim Cramer's Guide to Investing at no cost to help you build long-term wealth and invest smarter. Sign up now for the CNBC Investing Club to follow Jim Cramer's every move in the market. Disclaimer The CNBC Investing Club Charitable Trust holds shares of Nvidia. Questions for Cramer? Call Cramer: 1-800-743-CNBC Want to take a deep dive into Cramer's world? Hit him up! Mad Money Twitter - Jim Cramer Twitter - Facebook - Instagram Questions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com "
}