{
    "title": "Investment Hotspots: 3 Popular Investments for 2024",
    "date": "1/11/2024",
    "url": "https://investorplace.com/2024/01/investment-hotspots-3-stocks-where-the-moneys-flowing-in-2024/",
    "text": " These three stocks will be some of the most popular investments for 2024 Advertisement Source: Shutterstock Halfway through January, investors are wondering what the most popular investments for 2024 will be. In 2023, the top-performing stock index was the Nikkei 225, up 30.1%, 590 basis points higher than the S&P 500. Coming in a distant third was the STOXX 50, a collection of 50 of Europe’s largest companies. The three worst-performing indexes in 2023 by return were the S&P China 500 (-12.5%), S&P GSCI (-12.2%) and WTI Oil (-11,5%). The investment hotspots of 2024 have yet to be discovered, so there is still time to find the winners in the year ahead. Could it be bonds? Perhaps small caps. The large-cap dominance could be over. Large caps have been the top-performing asset class in three of the past five years. It’s due for a comedown. Where’s the big money flowing in 2024? Here are three stocks that should get plenty of attention in the year ahead. Nvidia (NASDAQ:NVDA) looks to be a trendy stock in the next 12 months because it is the king of the artificial intelligence (AI) castle. On Jan. 10, NVDA stock was the top-ranked U.S.-listed stock by price volume with 29.01 million—defined as last price times volume divided by 1,000. This put it more than 7.5 million ahead of second-place Tesla (NASDAQ:TSLA). Tesla’s board worries about Elon Musk’s potential drug use while Nvidia CEO Jensen Wang grows the company’s AI efforts. In the process, generating outsized free cash flow. NVDA stock closed at an all-time high of $546 on Jan. 10 after Huang’s company released the GeForce RTX 4080 Super at the 2024 Consumer Electronics Show (CES) in Las Vegas. Given the excitement around Nvidia’s AI chips, there will be plenty of days in 2024 when Nvidia’s price volume exceeds Tesla’s. That’s good news for shareholders. Uber Technologies (NYSE:UBER) was named one of Wells Fargo’s top stock picks of 2024. Up 143% in 2023, Wells Fargo analyst Ken Gawrelski has an Overweight rating and a $64 price target. Uber was added to the S&P 500 in December. That’s always a catalyst for these fortunate stocks. More importantly than the additional institutions buying its shares, it signals to investors that Uber has generated a GAAP profit for at least four consecutive quarters, a key criterion for addition to the index. As my colleague stated, the combination of higher sales and EBITDA profits in 2024 and beyond should lead to the company buying back one-fifth of its share count by 2026. Without any increase in net income, EPS earnings increase by 25%, pushing its share price ever higher. In late December, I recommended Uber stock as one of three companies to benefit from the urbanization movement in 2024. My rationale centered around the Uber app and how much data the company had about its users. Uber will leverage the information to develop new products and services beyond ride-hailing and food/grocery delivery. A natural extension of the ride-hailing business is the company’s valet car rental service, which delivers a rental car right to your door in select cities across North America and the UK. As I said in December, the possibilities are endless. Despite all the headwinds it faces in 2024, Walt Disney (NYSE:DIS) remains in charge of its destiny. If Bob Iger plays his cards right, Mickey Mouse and his friends will be flush with cash in the next 2-3 years. Disney stock remains a significant disappointment, down more than 7% over the past year and nearly 21% over the past 60 months. That five-year figure has got to be near the bottom of the S&P 500 constituents. Perhaps the most significant moment for Disney in 2023 was the 100th anniversary of the founding of Walt Disney’s company. Unfortunately, it was often overshadowed by poor box office performance, actor and writer strikes, an activist investor fight with Nelson Peltz, and more losses for its Disney+ streaming platform. However, there is no question it’s got some of the best assets in entertainment, with its Experiences business leading the charge. The division plans to invest $60 billion over the next decade to keep people visiting its resorts, theme parks, and cruise ships. 2024 could be the year the mouse roars. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/investment-hotspots-3-stocks-where-the-moneys-flowing-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}