{
    "title": "How Nancy Pelosi made up to $1.8 million in two weeks",
    "date": "1/9/2024",
    "url": "https://finbold.com/how-nancy-pelosi-made-up-to-1-8-million-in-two-weeks/",
    "text": "On December 21, 2023, Representative Nancy Pelosi made public her investment of between $1- $5 million in Nvidia (NASDAQ: NVDA) call options with a strike price of $120. At the time of the trade on November 22, the semiconductor giant’s stock was worth approximately $488. At the stock market’s close on Monday, January 9, 2024, Nvidia’s shares stood at their all-time-high (ATH) price of $522.53, meaning that the Congresswoman potentially made up to $1.8 million on her well-timed investment. It is important to note, however, that the acquisition of Nvidia call options is not necessarily a suspicious congressional trade, given the firm’s strong performance throughout 2023 and the prevailing optimism for its future. On the other hand, the uncannily well-timed trades of Representative Pelosi – suspicious enough that the “Wolf of Wall Street” Jordan Belfort recently concluded that she is likely breaking the law – have been a major force behind the renewed drive to restrict trading activities of elected officials. Additionally, while Nancy Pelosi achieved an impressive 2023 return rate of approximately 65%, she is far from the most successful congressional trader. That particular dubious honor belongs to New York’s Biran Higgins, who is a staggering 238.9% in the green in 2023. The suspicious activities have caused differing reactions among officials. On the one hand, Senator Mark Kelly appears to have decided to place his assets in a blind trust despite not being legally obligated to do so, according to information shared by Quiver Quantitative on X on January 8, 2024. On the other hand, there is some indication that the politicians have started trying to obfuscate their trades after New Year’s Day. However, the situation is not entirely clear at the time of publication. Whether Representative Pelosi’s Nvidia investment is indeed suspicious, it is evident that the chip maker’s performance has been impressive throughout 2023. The company retained its dominant position in the semiconductor industry and is, with the introduction of the new high-end AI chip – the H200 – safely securing its leading position. Its stock has also risen significantly over the 52-week period – as much as 234.36%. In the short term, the company has also been performing well on the stock market, being 12.07% in the green in the last 30 days and 6.43% in the last 24 hours. Its latest closing price of $522.53 constitutes NVDA’s ATH. The company is also likely to continue offering significant growth in 2024. While a new round of export restrictions to China briefly endangered its operations in the country in late October, the semiconductor giant has since reportedly managed to strike a deal with the U.S. government and is poised to begin the deliveries of a new series of chips. Nvidia is generally considered a strong buy by prominent analysts, and many expect it will reach – and possibly exceed – $600 per share in 2024. Buy stocks now with Interactive Brokers – the most advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}