{
    "title": "AI search startup Perplexity AI raises $73.6 million in funding from \nNvidia, Bezos",
    "date": "1/5/2024",
    "url": "https://www.thehindu.com/sci-tech/technology/ai-search-startup-perplexity-ai-raises-736-million-in-funding-from-nvidia-bezos/article67709223.ece",
    "text": "To enjoy additional benefits CONNECT WITH US January 05, 2024 02:58 pm | Updated 02:58 pm IST COMMents SHARE READ LATER FILE PHOTO: AI search engine startup Perplexity AI has reportedly raised $73.6 million in a series B funding round.\n| Photo Credit: Reuters AI search engine startup, Perplexity AI has reportedly raised $73.6 million in a series B funding round led by Institutional Venture Partners LLC with additional investments from Databricks Ventures, former Twitter VP Elad Gil, former GitHub CEO Nat Friedman, Shopify CEO Tobi Lutke and participation from Nvidia and Jeff Bezos. The startup is now valued at $520 million. Founded by Aravind Srinivas, Denis Yarats, Johnny Ho and Andy Konwinski, the California-based startup was founded in August 2022. Company CEO, Srinivas has previously worked at OpenAI and researched on generative models while there. Last year, The Information reported that the company was seeking funding. The startup has raised a total of $100 million till now. Perplexity’s search engine is powered by their in-house large language models and shows up as a chatbot-like interface. This means that users can ask queries in natural language unlike traditional search engines. Subscribers can pick the LLM of their choice from among OpenAI’s GPT-4, Anthropic’s Claude 2.1, Google Gemini or the company’s own Perplexity Pro, for $20 per month. (For top technology news of the day, subscribe to our tech newsletter Today’s Cache) Users can choose between different “focus” modes in Copilot which Perplexity launched in the end of May. The AI research assistant allows users to narrow the search domain and tailor search queries with custom follow-up questions. “It removes the burden of prompt engineering and does not require users to ask perfectly phrased questions to get the answers they seek. This enables users to gain more relevant and comprehensive answers than other AI chatbots, traditional search engines, or research tools,” Srinivas stated in a blog released with the funding announcement. Srinivas has claimed that since the launch of Perplexity, the AI search engine app has grown within the past one year to 10 million monthly active users and resolved more than a half-billion queries in 2023. The company app was also installed more than a million times during this period across iOS and Android. COMMents SHARE technology (general)\n\n/\n\ninternet\n\n/\n\nArtificial Intelligence\n\n/\n\nemerging technologies BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. "
}