{
    "title": "Nvidia Is Incredible. These 3 Chip Stocks Could Beat It in 2024.",
    "date": "1/2/2024",
    "url": "https://www.fool.com/investing/2024/01/02/nvidia-is-incredible-these-3-chip-stocks-could-bea/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More If artificial intelligence (AI) was the story of 2023, then Nvidia (NVDA 0.12%) was the stock of the year. No other company's products were as in demand from the generative AI boom, and no other company has the financial performance to prove it. Nvidia stock finished 2023 up 239% last year, crossing the trillion-dollar mark to become only one of five U.S. stocks to have a valuation above that line. The business also delivered phenomenal growth on the top and bottom lines. In its third quarter, revenue jumped 206% to $18.12 billion, and its net income according to generally accepted accounting principles (GAAP) jumped more than thirteenfold to reach $9.24 billion, giving it a margin of more than 50%. Heading into 2024, Nvidia looks to be in great shape for even more growth. Its AI-focused H100 accelerators are in such high demand that prices for them have skyrocketed, and there's a shortage of its GPUs and other components used for its AI models. The spoils of the AI boom are likely to spill over to other companies in 2024, and while Nvidia may retain its lead in AI chips, other chip stocks could narrow the gap. Here are three that could outperform the AI chip leader in 2024. Image source: Getty Images. If any semiconductor company is going to pose a challenge to Nvidia in AI capabilities, it seems likely to be Advanced Micro Devices (AMD 0.50%). The company's launch of its Instinct MI300 AI accelerators in December was highly anticipated, and the stock jumped 10% on the launch presentation, a sign Wall Street liked what it saw. Among the customers for the new component are Dell, Hewlett-Packard Enterprise, Lenovo, Microsoft, and Oracle, among others. AMD also said the Instinct Platform can offer a throughput increase of 60% for running inference on large language models compared with the Nvidia H100 HGX. AMD also made a number of acquisitions in the AI space recently. It acquired AI software leader Mipsology and Nod.ai, an open-source AI software expert, which will help it accelerate its deployment of AI solutions. AMD stock was no slouch in 2023. The stock jumped 128%. But expectations in 2024 are still modest, with the consensus calling for 16% revenue growth. If its new products take off, AMD could easily top that forecast and the stock could soar. ACM Research (ACMR 1.53%) is a relative unknown in the semiconductor sector. The company doesn't make chips, but instead makes machines that clean semiconductor wafers, an important process to ensure that these tiny components don't make errors. That position in the value chain makes ACM something of a picks-and-shovels play in the sector, but it also stands to benefit from the AI boom, since cleaning requirements are likely to become more technical as chips become more advanced and AI components become more in demand. ACM Research is a small company, with a market cap of $1.2 billion, but its recent results are impressive. Revenue rose 26% to $21.3 million, with a 31% increase in shipments even during a cyclically challenging period in the semiconductor industry. On the bottom line, adjusted net income rose 33% to $37.5 million. ACM is mostly focused on China, where it's considered a domestic supplier. That could give it an advantage at a time when a tech cold war between the U.S. and China is heating up, with the U.S. banning the export of some advanced technologies to China. The stock is cheap at a price-to-earnings ratio of 15, so it shouldn't take much to drive the stock higher in 2024, even after it gained 154% in 2023. Finally, Taiwan Semiconductor (TSM -0.47%) also looks poised for a strong performance in 2024. Taiwan Semiconductor, also known as TSMC, is the world's largest contract semiconductor foundry, handling roughly half of semiconductor manufacturing for companies including Apple, Qualcomm, Broadcom, AMD, Nvidia, and Intel. AI makes up about 6% of the company's revenue, but given the company's strong position in chip manufacturing and even larger market share in the manufacturing of advanced chips, it should see steady growth ahead from increasing AI demand. Like other semiconductor companies, TSMC is fast at work increasing capacity to handle demand for AI production. That momentum may already be starting to build, given that revenue in October jumped 16% from the year before. Compared with the chip designers, TSMC stock is also affordably priced, at a price-to-earnings ratio of 20. With a broader recovery in the chip sector expected in 2024, TSMC could be a big winner. Jeremy Bowman has positions in ACM Research and Broadcom. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Microsoft, Nvidia, Oracle, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}