{
    "title": null,
    "date": "1/22/2024",
    "url": "https://seekingalpha.com/news/4056882-western-digital-rises-after-moving-to-top-pick-at-morgan-stanley",
    "text": "JHVEPhoto/iStock Editorial via Getty Images Western Digital (NASDAQ:WDC) stock rose about 5% on Monday after it replaced Nvidia (NASDAQ:NVDA) as Morgan Stanley's Top Pick, but the firm remained very positive on Nvidia's prospects as well. The analysts said that with the strong move in Nvidia in the last month or so, they see more upside potential from Western Digital. However, Nvidia remains their preferred name in the compute space. All of the Artificial intelligence, or AI, stocks have rallied, and with the potential for AI to come off of allocation in the second half of 2024, there could be some headwinds to consider, the analysts added. Meanwhile, Nvidia has rallied less than other companies in the AI supply chain, while retaining the premiere position, and does have material upside for the next couple of quarters at least, and key products such as H200 and B100 should add to investor comfort with the company's market leadership, according to the analysts. Morgan Stanley increased the price target on Western Digital's (WDC) shares to $73 from $52 and also raised its estimates. The analysts said that they see the valuation disparity between Western Digital and peers as extremely compelling, particularly in light of the second-half separation of the memory business which should unlock sum of the parts values. Business is getting better at a rapid rate; and that there are pluses and minuses to the NAND cycle. NAND flash memory is a type of non-volatile storage technology. The analysts said that near-term business has improved. They are seeing NAND prices up more than 20% quarter-over-quarter in the first quarter, more in some areas. Given that the company had already guided to positive gross margins in the December quarter, we should already be at mid cycle gross margins in the March quarter, in contrast to memory peers, the analysts added. For hard disk drives, they believe that they are seeing a gradual recovery from weak conditions of CY'23, likely roughly in line with consensus views. For the March quarter the analysts now model revenue/nonGAAP GMs/non-GAAP EPS of $3.49B/21.4%/$0.24 versus $3.2B/14.1%/(0.72) previously. For CY'24 the analysts' numbers move from $15.9B/23.8%/$2.07 to $16.5B/27.4%/$4.18 which is above consensus at $14.1B/21.2%/$0.61. In addition, the analysts said that beyond the near-term surge, their NAND cycle view is somewhat mixed, but they expect solid returns next three to four years. The analysts added that the sum of the parts math is straightforward and compelling. While the market appeared to favor consolidation scenarios, the decision to separate the hard disk drive and memory assets towards the end of the year actually simplifies the story completely. The analysts also noted that NAND returns have been well above peers, which highlights the strategic value that this asset could have. "
}