{
    "title": "2 Stock-Spilt Stocks Crushing It in Artificial Intelligence That Could Soar \nin 2024",
    "date": "1/13/2024",
    "url": "https://www.fool.com/investing/2024/01/13/2-stock-spilt-stocks-crushing-it-in-artificial-int/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Data from Grand View Research shows that the artificial intelligence (AI) market is projected to expand at a compound annual growth rate of 37% through 2030, which would see it exceed a value of $1 trillion before the decade's end. So it's not surprising that countless tech firms have restructured their businesses to prioritize AI, thus creating multiple ways to invest in the budding industry. Despite a surge in AI stocks last year, the market's immense potential indicates it's not too late for new investors to see major gains from the market. Meanwhile, companies that have recently split their shares are attractive options, as the move is often followed by significant growth. Here are two stock-split stocks crushing it in AI that could soar in 2024. Nvidia's (NVDA 0.12%) business has exploded in recent years, with its shares soaring more than 1,300% since 2019. Stellar growth led management to trigger a 4-to-1 stock split in July 2021, its fifth split since 2000. And the company appears to just be getting started. Over the last 12 months, Nvidia emerged as one of the biggest names in artificial intelligence, achieving an estimated 90% market share in AI chips. The company's years of dominance in graphics processing units (GPUs) allowed it to get a head start, while rivals like AMD and Intel have yet to catch up. Increased demand for AI graphics processing units (GPUs) has seen Nvidia's earnings soar. In the third quarter of fiscal 2024 (ended October 2023), Nvidia posted revenue growth of 206%, with operating income up more than 1,600% thanks to a spike in chip sales in its data center segment.  Data by YCharts This chart shows Nvidia's earnings could hit $24 per share by fiscal 2026. That figure, multiplied by its forward price-to-earnings ratio of 45, implies a potential stock price of $1,080, projecting growth of 97% over the next two fiscal years. As a leading chipmaker, Nvidia has a lucrative role in AI and tech in general. The company will need to contend with increased competition this year as other companies release new chips. However, its dominance will be challenging to overcome. Meanwhile, the market's growth potential suggests there's enough room for Nvidia to retain its lead and welcome newcomers. As a result, this stock-split stock is too good to pass up in the new year. As the home of potent brands like Google, Android, and YouTube, it's impossible to deny Alphabet's (GOOG 0.21%) (GOOGL 0.04%) powerful role in tech. Its stock has risen 402% over the last decade, with its last split occurring in July 2022 in a 20-to-1 split. Much of the company's success over the years stems from the billions of users its services attract. Alphabet has used its massive user base to build a lucrative digital advertising business, responsible for about 25% of the $740 billion digital ad market. Popular platforms like Google Search and YouTube present almost endless advertising opportunities for the company and have helped its earnings soar in recent years. Since 2019, Alphabet's annual revenue rose 75%, with operating income up 108%. Meanwhile, the company's free cash flow has climbed 200% in the last five years to $78 billion, indicating that Alphabet has the funds to invest heavily in its research and development and venture into burgeoning areas of tech -- such as AI. In December, the tech giant unveiled its highly anticipated AI model, Gemini, which is expected to compete with OpenAI's GPT-4. The new model could open the door to countless growth opportunities in AI for Alphabet. Gemini and the popularity of platforms like Google Search, Cloud, and YouTube could be a powerful combination. The company could have an advantage in AI with the ability to create a Search experience closer to ChatGPT, add new AI tools on Google Cloud, offer more efficient advertising, and better track viewing trends on YouTube.  Data by YCharts These charts show Alphabet's stock is also significantly cheaper than that of its biggest competitors in AI, fellow cloud giants Microsoft and Amazon. The company has lower figures in two key valuation metrics: forward P/E and price-to-free cash flow (P/FCF) ratios. Forward P/E is calculated by dividing a company's current share price by its estimated future earnings per share. Meanwhile, P/FCF divides its market cap by free cash flow. For both metrics, the lower the figure, the better the value. Forward P/E and P/FCF are great ways to determine the value of a company's shares as they take into account its financial health against its stock price. In this case, Alphabet is a far bigger bargain than Microsoft or Amazon. Alongside a solid outlook in AI and consistent financial growth, Alphabet is a screaming buy in 2024. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}