{
    "title": "'Instincts are massively cheaper than Nvidia's H100': AMD is selling \nflagship AI GPUs at a huge discount to Microsoft ...",
    "date": "2/11/2024",
    "url": "https://www.techradar.com/pro/instincts-are-massively-cheaper-than-nvidias-h100-amds-selling-flagship-ai-gpus-at-a-huge-discount-to-microsoft-but-im-not-sure-that-will-be-enough-to-bother-nvidia",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. AMD charges Microsoft a third less than other buyers for its MI300 AI accelerators AMD's flagship AI GPUs, the Instincts, are being sold at a significant discount to Microsoft, offering a competitive alternative to Nvidia's pricier H100. According to Tom's Hardware, Nvidia's H100 AI GPUs cost up to four times more than AMD's competing MI300X, with prices peaking beyond $40,000. Despite the price advantage, AMD's market strategy is not expected to significantly impact Nvidia's stronghold in the AI GPU market. This is due to Nvidia's established CUDA software stack, which has been optimized for a wide range of AI applications and workloads, resulting in overwhelming demand for its GPUs. AMD recently raised its guidance for artificial intelligence-related revenue to $3.5 billion this year, up from $2 billion. However, Citi analyst Christopher Danely believes that AMD could be purposefully underestimating sales figures. He predicts that AMD will generate $5 billion this year and $8 billion next year from the MI300. NVIDIA Tesla M40 24GB Module: $240 at Amazon The NVIDIA Tesla M40 GPU Accelerator is the world's fastest accelerator for deep learning training. It provides accurate speech recognition, deep understanding in video and natural language content and better detection of anomalies in medical images. Microsoft and Meta are reportedly the largest customers for the MI300, which was unveiled in December. The average selling price for Microsoft is roughly $10,000, while other customers pay $15,000 or more. Despite AMD's aggressive pricing strategy, risks remain. The PC space replenishment might be over, and Intel is catching up to Taiwan Semiconductor (TSM) in manufacturing. Furthermore, AMD's sales figures could be affected by the fact that Nvidia does not officially disclose the pricing of its H100 80GB products, which depends on various factors such as the volume of the batch and overall volumes procured by a particular client. While AMD's Instincts are massively cheaper than Nvidia's H100, the impact on Nvidia's dominant market position remains to be seen. With AMD's sales of data center GPUs expected to exceed $3.5 billion, and supply still available, it provides a stark comparison to Nvidia's rumored 52-week wait times. However, given Nvidia's established software infrastructure and high demand, AMD's price advantage may not be enough to significantly disrupt the market. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. This new phishing attack targets iPhone and Android alike via RCS 'Wean itself off Nvidia': Samsung signs $750 million agreement with South Korea's largest online platform — Naver wants to replace Nvidia's super expensive AI GPU with the more affordable Mach-1 chip Quordle today – hints and answers for Friday, March 29 (game #795) By Sead FadilpašićMarch 28, 2024 By Marc McLarenMarch 28, 2024 By Alex BlakeMarch 28, 2024 By Rhys WoodMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By James IdeMarch 28, 2024 By Mackenzie FrazierMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Craig HaleMarch 28, 2024 By Darren AllanMarch 28, 2024 By Nigel PowellMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}