{
    "title": "Bezos, Nvidia join OpenAI in funding robot startup",
    "date": "2/24/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/bezos-nvidia-join-openai-funding-robot-startup",
    "text": "JEFF Bezos, Nvidia Corp and other big technology names are investing in a business that is developing human-like robots, according to people with knowledge of the situation, part of a scramble to find new applications for artificial intelligence. The startup Figure AI – also backed by OpenAI and Microsoft – is raising about US$675 million in a funding round that carries a pre-money valuation of roughly US$2 billion, said the people, who asked not to be identified because the matter is private. Through his firm Explore Investments, Bezos has committed US$100 million. Microsoft is investing US$95 million, while Nvidia and an Amazon.com-affiliated fund are each providing US$50 million. Robots have emerged as a critical new frontier for the AI industry, letting it apply cutting-edge technology to real-world tasks. At Figure, engineers are working on a robot that looks and moves like a human. The company has said it hopes its machine, called Figure 01, will be able to perform dangerous jobs that are unsuitable for people and that its technology will help alleviate labour shortages. Other technology companies are involved as well. Intel Corp’s venture capital arm is pouring in US$25 million, and LG Innotek is providing US$8.5 million. Samsung’s investment group, meanwhile, committed US$5 million. Backers also include venture firms Parkway Venture Capital, which is investing US$100 million, and Align Ventures, which is providing US$90 million. The ARK Venture Fund is participating as well, putting in US$2.5 million, while Aliya Capital Partners is investing US$20 million. Other investors include Tamarack, at US$27 million; Boscolo Intervest, investing US$15 million; and BOLD Capital Partners, at US$2.5 million. OpenAI, which at one point considered acquiring Figure, is investing US$5 million. Bloomberg News reported in January on the funding round, which kicked off with Microsoft and OpenAI as the initial lead investors. Those big names helped attract the influx of cash from the other entities. The US$675 million raised is a significant increase over the US$500 million initially sought by Figure. Start and end each day with the latest news stories and analyses delivered straight to your inbox. Representatives for Figure and its investors declined to comment or didn’t immediately respond to requests for comment. People with knowledge of the matter expect the investors to wire the funds to Figure AI and sign formal agreements on Monday, but the numbers could change as final details are worked out. The roughly US$2 billion valuation is pre-money, meaning it doesn’t account for the capital that Figure is raising. Last May, Figure raised US$70 million in funding round led by Parkway. At the time, chief executive Brett Adcock said, “We hope that we’re one of the first groups to bring to market a humanoid that can actually be useful and do commercial activities.” The AI robotics industry has been busy lately. Earlier this year, OpenAI-backed Norwegian robotics startup 1X Technologies AS raised US$100 million. Vancouver-based Sanctuary AI is developing a humanoid robot called Phoenix. And Tesla Inc. is working on a robot called Optimus, with Elon Musk calling it one of his most important projects. Agility Robotics, which Amazon backed in 2022, has bots in testing at one of the retailer’s warehouses. Bezos – the world’s second-richest person, according to the Bloomberg Billionaires Ranking – was Amazon’s chief executive officer until 2021 and remains chairman. BLOOMBERG BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}