{
    "title": "Salesforce, AMD and other Big Tech stocks not named Nvidia that look smart \nas AI goes mainstream",
    "date": "2/3/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240203216/salesforce-amd-and-other-big-tech-stocks-not-named-nvidia-that-look-smart-as-ai-goes-mainstream",
    "text": "By Daniel Newman 6 companies that can profit from AI's wider use In 2023, the AI winners and losers were largely defined by how they found ways to make money from the technology. Nvidia (NVDA) emerged as the clear leader, its products powering the growth of large language models. Other winners included Microsoft (MSFT), Alphabet (GOOGL) (GOOG), and Amazon.com (AMZN), which capitalized on the cloud-based AI focus. This year, the money will be made at companies that can capitalize on AI implementation. Market analysts expect companies to increase spending on AI strategies, aiming for greater productivity and efficiency. So, beyond the established players, which companies offer exciting potential in this year of implementation? IBM The outlook from research firm McKinsey suggests that AI will generate more than $4 trillion in economic value by 2030. This makes IBM's (IBM) all-in focus on hybrid cloud and AI appear to be a good bet. IBM being first to market with a general-purpose generative-AI solution (watsonx) for enterprise may not have garnered the same attention as GPU sales volume in 2023, but its Watson business has doubled quarter over quarter from what it referred to as \"low hundreds of millions\" in the third quarter of 2023. In a conversation I had with IBM CEO Arvind Krishna at Davos earlier in January, he indicated a strong confidence that the commitment to trusted AI for enterprise was well-placed, and it showed in the company's fourth-quarter 2023 results, which beat expectations and saw the most prominent growth coming from enterprise AI. ServiceNow ServiceNow (NOW) continues to innovate, leveraging AI to scale and diversifying its offerings beyond core IT management. With CEO Bill McDermott's leadership, the company is targeting diverse digital experiences, HR and other critical workflows, which has driven faster-than-expected growth in its AI business. Last year's fourth quarter was testament to its success. In a recent conversation I had with McDermott, he signaled a new category of business-transformation management, and a recent partnership with Visa (V) indicates how ServiceNow is developing vertical solutions powered by GenAI. Throughout market fluctuations, ServiceNow has shown robust growth and relentless innovation and won customers. Its focus on helping companies achieve efficiency, productivity and digital transformation makes it an attractive prospect. AMD AMD's (AMD) 2023 Advancing AI event showcased the company's readiness for delivering competitive AI graphics processing units (GPU). With a multibillion-dollar datacenter GPU forecast, coupled with Nvidia-competitive specifications and an open-source software focus, AMD has a clear route to market-share growth. While parts of its portfolio are consumer-oriented, AMD continues to gain steam in the enterprise arena. Moreover, the demand for silicon in PCs and data centers presents further growth opportunities. Salesforce While I anticipated strong growth from Salesforce's (CRM) AI offerings in 2023, I believe 2024 is the company's breakout year. As the market leader in cloud CRM, Salesforce is well-positioned to gain adoption of its generative-AI capabilities across its customer base, driving meaningful incremental revenue and net-revenue expansion. Salesforce is a strong play in AI and this revenue-expansion opportunity will lead to further growth in 2024. Cisco Systems Acquiring Splunk (SPLK) sets up Cisco Systems (CSCO)  to capitalize on the need for centralized data security and observation in the enterprise environment. Cisco's significant investments in both internal capabilities and the Splunk purchase aim to make the company a leader in observability. Additionally, Cisco's strong position in network infrastructure makes it well-positioned to benefit from the upcoming wave of large-scale AI deployments and the required network-infrastructure investment. Cisco is more of a value stock, but it is tied to AI across its entire portfolio and has done a nice job transforming from hardware to software and services. Plus, the stock yields around 3% for those looking for income and AI. Dell Technologies The diversity of Dell Technologies' (DELL) portfolio supporting PCs, data centers, edge and security makes the stock intriguing for enterprise-AI investors looking for deep value. Recognizing that a significant portion of AI still runs on-premises, Dell is likely to be a major beneficiary of on-premise data-center AI solutions. Its robust private-AI solution set and diverse silicon offerings from AMD, Intel and Qualcomm position the company to benefit from the upcoming AI PC supercycle. Dell won't be a hypergrowth name, but almost its entire portfolio is tied to AI and its massive global salesforce will be able to capitalize on this. Furthermore, for those looking for yield, like Cisco, it also pays a dividend. Even with economic uncertainties, enterprise investment in AI will be substantial. The ability for companies to increase revenue and find efficiencies despite unpredictable conditions will keep AI spending healthy. One thing was abundantly clear from several dozen separate conversations with top executives and leaders at Davos: AI will be the most important trend of 2024, shaping the economy and prompting significant enterprise spending. While unknowns around safety, security, policy and governance remain, they will be addressed in real-time as companies strive to reap the rewards of AI implementation. Daniel Newman is the principal analyst at Futurum Research, which provides or has provided research, analysis, advising or consulting to Nvidia, Meta Platforms and dozens of other technology companies. Neither he nor his firm holds equity positions in companies cited. Follow him on X @danielnewmanUV. -Daniel Newman This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 02-03-24 0938ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}