{
    "title": "World's most valuable car vendor will spend billions on Nvidia and AMD GPU \nand CPU in race to build even more ...",
    "date": "2/8/2024",
    "url": "https://www.techradar.com/pro/worlds-most-valuable-car-vendor-will-spend-billions-on-nvidia-and-amd-gpu-and-cpu-in-race-to-build-even-more-powerful-supercomputer-musk-wants-the-dojo-exapod-to-run-even-faster",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Being competitive in AI takes at least \"several billion dollars\" says Musk Elon Musk has revealed that Tesla will use hardware sourced not only from Nvidia, but also AMD for its next generation Dojo supercomputers. Tesla launched its first Dojo ExaPod supercomputer in 2023, which was built using custom AI chips and is reportedly capable of delivering up to 1.1 exaflops of computing power to train the machine learning models in the company's self-driving technology. Now, in a post on X (formerly Twitter), Musk confirmed that Tesla is intending to spend over a billion dollars on Nvidia's H100 and AMD's Instinct MI300 hardware this year. Following a discussion about Tesla’s new $500 million project for the New York Gigafactory, Musk pointed out that while that seems like a lot of money - and it obviously is – that’s only enough to buy 10,000 Nvidia H100 AI GPUs. Tesla, he said, will spend much more than that on Nvidia hardware this year. “The table stakes for being competitive in AI are at least several billion dollars per year at this point,” he said. When asked about additional potential purchases of AI chips from AMD, Musk confirmed the plan without divulging further details. It's expected that Tesla will buy AI processors from the Instinct MI300 lineup, specifically the Radeon Instinct MI300X which was unveiled alongside the world's first data center APU (Instinct MI300A) in December last year. While the Instinct MI300X is comparable to the Nvidia H100 in training tasks it can be 1.6 times faster in AI inference scenarios and is designed to scale, supporting up to 192 GB of HBM3 memory. In December, Tesla’s Dojo plans faced a major setback when project lead Ganesh Venkataramanan left the company. However, the role was swiftly filled when Peter Bannon, a former executive at Apple and a Tesla veteran, stepped in to head the project. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! The governor is correct that this is a Dojo Supercomputer, but $500M, while obviously a large sum of money, is only equivalent to a 10k H100 system from Nvidia.Tesla will spend more than that on Nvidia hardware this year. The table stakes for being competitive in AI are at…January 26, 2024 Wayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too. With just $700 and a Raspberry Pi — you too can become a cybercriminal 256TB SSDs could land before 2026 with a surprisingly low price — but will most likely use a controversial and popular trick borrowed from tape technology Philips Hue lights to work way better with Samsung TVs and SmartThings, for a price By Demi WilliamsMarch 27, 2024 By Sead FadilpašićMarch 27, 2024 By Hamish HectorMarch 27, 2024 By Darren AllanMarch 27, 2024 By Sead FadilpašićMarch 27, 2024 By Demi WilliamsMarch 27, 2024 By Chiara CastroMarch 27, 2024 By Mackenzie FrazierMarch 27, 2024 By Dashiell WoodMarch 27, 2024 By Andy HilliardMarch 27, 2024 By Kristina TerechMarch 27, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}