{
    "title": "Best Performing AI Fund Of 2024? Spear Alpha ETF Tops The List, Betting Big \nOn Nvidia - Microsoft (NASDAQ",
    "date": "2/15/2024",
    "url": "https://www.benzinga.com/trading-ideas/24/02/37166719/best-performing-ai-fund-of-2024-spear-alpha-etf-tops-the-list-betting-big-on-nvidia",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW As 2022 drew to a close, AI pioneer OpenAI released ChatGPT to the public. Before two months had passed, the revolutionary LLM - or Large Language Model - had surpassed 100 million active users, by far the fastest adoption of a new technology in history ChatGPT, and Artificial Intelligence as a whole, dominated the news cycle for much of 2023 and drove incredible investor interest in the technology and the companies driving its development. This is not just hype, AI has the potential to truly transform our economy potentially faster than a technology ever has before. PwC estimates AI could add an eye-watering $15.7 trillion to the global economy before the decade is out. Investors are rightfully looking for ways to stay ahead of the curve and many are looking for the right company to back. Microsoft MSFT is a solid play, the tech behemoth owns 49% of Open AI and has been investing heavily in Azure, its cloud platform, positioning it as the best cloud provider to power LLMs and other AI models. Another favorite, Tesla TSLA, is popular amongst those who believe the company will deliver on truly autonomous driving. But the darling of AI investing is undoubtedly NVIDIA NVDA. The company’s specialized and uber-powerful chips are essentially what enables AI models to function. NVIDIA has continued to smash earnings targets time and again and the company's stock has reflected this. NVDA is up over 220% on the year. Picking the right horse can be difficult, extremely. Many investors instead opt for an ETF, or Exchange-Traded Fund, preferring the broader exposure and professional teams that operate them. So which AI-focused ETF has performed best so far this year? That would be the Spear Alpha ETF SPRX. The fund has done exceptionally well, up more than 17% since January 1st. The fund is actively managed by Ivana Delevska, whose captaining of the ship has been impressive thus far; SPRX gained 88% in 2023, making it one of the best-performing, non-leveraged, non-bitcoin funds on the market. Although the fund is relatively small, it has just north of $63 million in AUM, it's growing quickly as it outpaces its larger rivals like iShares U.S. Technology ETF IYW, up 10.76% YTD; or Global X Robotics and Artificial Intelligence ETF BOTZ, up 8.84%. Photo by Adi Goldstein on Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}