{
    "title": "Semiconductor revenue rankings in 2023: Intel reclaims top spot, AI wave \nlifts Nvidia to third, and Samsung drops on ...",
    "date": "2/2/2024",
    "url": "https://www.digitimes.com/news/a20240201PD202/semiconductor-revenue-2023-intel-nvidia-ai-samsung.html",
    "text": "Credit: AFP In 2023, the global semiconductor industry saw its aggregate revenue fall 8.8% from 2022 to US$521.3 billion. Despite Intel reclaiming the top spot in annual revenue, it still recorded a 16% decline to US$50.5 billion due to double-digit decreases in PC and server shipments. In contrast, Nvidia, capitalizing on the burgeoning demand for Artificial Intelligence (AI) computing, saw its revenue ranking jump from 10th to third in 2023, marking its first entry into the top five. Samsung Electronics, grappling with downturns in the DRAM and NAND markets, witnessed its revenue plummet by 38% to US$43.4 billion in 2023, relinquishing its top spot to Intel once again. Looking ahead to 2024, Counterpoint Research forecasted that AI-related demands, encompassing AI servers, AI PCs, and AI smartphones, will continue to drive organic growth in the semiconductor industry. Furthermore, the memory industry is anticipated to rebound as supply and demand normalize. The automotive sector is poised to be another growth driver for semiconductor sales in 2024. This trend was already reflected in 2023 as major chipmakers focusing on automotive chips experienced significant revenue growth for 2023. For example, European IDMs Infineon and STMicroelectronics posted year-on-year revenue increases of 11% and 7%, moving up from outside the top 10 to 9th and 10th in 2023 revenue rankings. Particularly noteworthy is that Nvidia, riding the wave of AI investments in 2023, nearly doubled its revenue to US$30.3 billion, showcasing the highest year-on-year growth of 86% among all semiconductor companies. AMD closely followed Nvidia as another beneficiary of the robust AI computing demand, maintaining its seventh position in revenue rankings for the second consecutive year in 2023 despite a 4% slip to US$22.6 billion. Both companies are expected to further develop and expand their AI chip businesses in the coming years. The global memory market faced headwinds in 2023, marked by weak demand in the PC, server, and smartphone sectors, oversupply, and excess inventory in the overall market. Among other major players, SK Hynix and Micron experienced significant revenue decreases of 33% and 36%, respectively. Counterpoint highlighted that 2023 was a year for semiconductor companies to adjust strategies, manage inventory, and prepare for the impending AI wave. Only six of the top 20 semiconductor suppliers globally scored revenue increases in 2023, with the memory industry enduring a substantial 43% year-on-year decline in overall revenue. The top 20 semiconductor suppliers collectively contributed 71% to global semiconductor revenue in 2023, down from 76% in 2022, reflecting a 14% decline in overall revenue. "
}