{
    "title": "Nvidia Surges to $800: Here Is 1 Potential Red Flag Before You Buy Shares",
    "date": "2/29/2024",
    "url": "https://www.fool.com/investing/2024/02/29/nvidia-surges-to-800-here-is-one-potential-red-fla/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Undoubtedly, artificial intelligence (AI) chip company Nvidia (NVDA 0.12%) is the toast of Wall Street right now. The stock is up an eye-popping 234% over the past year. It's not without cause: Nvidia's earnings per share grew a blistering 765% year over year in the fourth quarter of the company's fiscal year 2024, which ended Jan. 28. Nividia recently soared beyond $800 per share, valuing the company at almost $2 trillion. The company's stranglehold on the AI chip market has investors piling in for what is expected to be years of hypergrowth for artificial intelligence. But there is one red flag investors should at least consider as they buy shares. This isn't meant to imply that Nvidia won't be a featured player in AI moving forward, but it's something worth keeping in mind as Nvidia's price increasingly factors in growth that hasn't happened yet. Here is what you need to know. CEO Jensen Huang emphasized on the company's recent earnings call that demand for its AI chips still far exceeds supply. However, those successfully obtaining the chips are a select group of technology's most prominent players. According to data by Bloomberg and Barclays, and reported by the Financial Times, Nvidia's estimated revenue breakdown signals that a small group of companies are contributing a ton of the company's total sales: Data sources: Bloomberg, Barclays, and The Financial Times. These six companies are roughly 51% of Nvidia's revenue. It makes sense -- few companies other than big tech giants have the deep pockets to spend enough to have that impact on Nvidia's business. AI has become an arms race, a sprint to build cutting-edge computing platforms for customers to develop and deploy their AI applications. Investors shouldn't necessarily worry about the long-term demand for AI chips. Advanced Micro Devices CEO Lisa Su believes the AI chip market will explode to $400 billion by 2027. OpenAI CEO Sam Altman believes trillions of dollars are needed to invest appropriately in supporting AI's long-term growth potential. Nvidia was prepared for the AI boom and is dominating the chip market, with market share estimates ranging from 80% to 90%. Considering Nvidia's Q4 revenue was \"just\" $22 billion companywide, it's clear that more growth lies ahead if AI becomes the massive industry tech insiders believe it can be. But investors are increasingly wagering, by bidding the stock increasingly higher, that technology's most prominent companies will continue relying on Nvidia's chips. It looks like that may not remain the case. There have been numerous reports of companies within Nvidia's top six developing their own AI chips to break free from the leverage Nvidia currently has over them. Meta Platforms will reportedly implement a custom AI chip in its data centers this year. Microsoft, Amazon, and Alphabet are also developing in-house custom AI chips. That doesn't mean these custom chips will be superior to Nvidia's or completely replace Nvidia's, even if they perform well. However, analysts are racing to raise their long-term estimates, and price targets are following. But there's a real risk that Nvidia will begin to lose some business, and there aren't many customers like these to easily backfill losing a major customer. Data center revenue has grown to 78% of the total business. Investors should be careful buying the stock because it's cheap based on estimates for 2026. That's an assumption that Nvidia will grow into its lofty expectations. The further out you look, the riskier the stock becomes. That's not to say that Nvidia won't remain an essential company in AI, but it's a reminder of how far the stock has come and that future results aren't guaranteed. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Barclays Plc and Super Micro Computer and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}