{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.cnn.com/2024/02/23/business/china-nvidia-huawei-competitor-ai-chips-intl-hnk/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter, which explores what you need to know about the country’s rise and how it impacts the world. Nvidia has named Huawei a top competitor in a number of areas, including in the crucial production of processors that power artificial intelligence (AI) systems. The Santa Clara-based company said Wednesday in its annual report that Huawei was a competitor in four out of five major categories of its business, including supplying software and hardware for graphic processing units (GPUs), which are widely used in generative AI. Other companies also listed as its rivals in some areas include AMD (AMD), Amazon (AMZN), Microsoft (MSFT) and Broadcom (AVGO). The naming of Huawei came just two months after Jensen Huang, chief executive officer of Nvidia (NVDA), told reporters in Singapore that the Chinese tech giant was a “formidable” competitor in producing AI chips, according to a Reuters report. The Shenzhen-based firm, which makes smartphones and telecoms equipment, surprised the world last year by launching the Mate 60 Pro, a cutting-edge phone powered by advanced chips. Questions swirled over how Huawei was able to manufacture the phone when it had spent the four years under US restrictions banning its access to 5G technology. The breakthrough represented a “milestone” achievement for China, according to analysts, as Beijing and Washington are locked in a battle over semiconductor technology. In October 2022, the Biden administration imposed sweeping curbs designed to curtail China’s access to advanced computing chips. In early 2023, Japan and the Netherlands joined the US in curbing the export of chipmaking technology to China. Beijing has hit back. In April, 2023, it launched a cybersecurity probe into Micron before banning the company from selling to Chinese companies working on key infrastructure projects. In July, it imposed export controls on two strategic raw materials, gallium and germanium, that are critical to the global chipmaking industry. In October 2023, the Biden administration tightened restrictions on sales of advanced semiconductors by American firms. Nvidia has flagged concerns about getting caught up further in the geopolitical tensions between the United States and China. Its competitive position has been harmed and could be further impacted in the long term, if there are further changes in US export controls on chips, it said in the annual report. “In the event of such change [in US export control rules], we may be unable to sell our inventory of such products and may be unable to develop replacement products not subject to the licensing requirements, effectively excluding us from all or part of the China market, as well as other impacted markets, including the Middle East,” it said. Nvidia reported strong earnings on Wednesday. Its profits for the three months ended January 28 were up 769% from a year ago. But its China business took a hit from US restrictions on chip sales to the country. “Growth was strong across all regions except for China, where our data center revenue declined significantly following the US government export control regulations imposed in October [2022],” Colette Kress, Nvidia’s chief financial officer, said in an earnings call. Data centers, which includes the graphics cards, are Nvidia’s biggest source of revenue. Sales from its core data center business grew 409% year-over-year to a record $18.4 billion in the fourth quarter. She said China represented “a mid-single-digit percentage” of the company’s data center revenue in the fourth quarter, and is expected to stay in “a similar range” in the current quarter. Nvidia declined to comment on the news. CNN’s Rob McLean and David Goldman contributed reporting. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}