{
    "title": "Should you buy Nvidia share at this price? 4 reasons why it’s not too late \nto invest in the AI chipmaker",
    "date": "2/25/2024",
    "url": "https://www.moneycontrol.com/news/business/stocks/should-you-buy-nvidia-share-at-this-price-4-reasons-why-its-not-too-late-to-invest-in-ai-chipmaker-12344881.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Has the news of Nvidia’s $2 trillion market cap caught your eye? Over the last two days, news cycles have been abuzz with Nvidia’s Q4 earnings and subsequent rise in market cap and stock price. The company's share price rallied 16 percent on Thursday, 22 February, recording its largest gain in one day. The stock and market capitalisation has ballooned over five-fold since January of 2023, as ‘generative AI’ became known as the company’s earnings growth driver. Read more: Explained | What drove Nvidia’s march to $2 trillion m-cap, and what’s next for this AI play? The US-based Nvidia, which is listed on Nasdaq, is known for high-end graphics processing units (GPUs) being used for gaming, HD movie display as well as now in AI (artificial intelligence) and ML (machine learning) for LLMs (large language models). Indian investors looking to invest in the stock can invest through some Active Mutual Funds with exposure to the stock or through ETFS and FOFs. You can also buy it directly through both Indian and international platforms. Read more here. But is this the right time to invest? Here is what the market says. 1.    Nvidia’s massive AI opportunity A PwC report estimates that by 2030, AI could contribute around $15.7 trillion to the global economy and boost the world GDP by 26 percent. Nvidia, along with other AI firms, is at the forefront of this growth, due to the widespread use of its products in the development of AI. During its early days, Nvidia was well known for its use in gaming. In the Q4 earnings call, Nvidia CFO Colette Kress mentioned an increasing demand for AI across the world and new companies using language models: Adept, AI21, Character.ai, Cohere, Mistral, Perplexity, and Runway. She also cited new startups creating language learning models to serve the specific languages, cultures, and customs of many regions of the world. Other learning models are being used by biotech companies such as Recursion Pharmaceuticals and Generate Biomedicines. \"These companies are driving demand for Nvidia AI infrastructure through hyperscale or GPU-specialised cloud providers,\" she added. 2.    Nvidia’s first-mover advantage Nvidia’s chips play a very important role in development of AI systems and building the infrastructure. This is of advantage to Nvidia and other such companies, which have a growing market share in the field. The demand is expected to continue to rise. But building expertise in the segment takes time, and first movers such as Nvidia, which has grown into a market leader, have an edge. Fisdom’s Nirav Karkera says that in sunrise sectors such as this, there are no clear winners, but early movers have the advantage of a larger market space due to this need for building capabilities and market share. While other players are also growing -- from Qualcomm to even Alphabet, Nvidia is expected to see continued growth. 3.    As Nvidia’s earnings grow, valuations look reasonable As of December 2023, big tech companies Microsoft, Apple, Meta, Nivida, Google and Amazon had a total market cap of around $11 trillion. At that time, Nvidia’s market cap was around $1.2 trillion, making it the fifth largest among the six companies. According to a CB Insights report, among big tech players, as of December 2023, Nvidia has seen earnings growth at a faster pace than others. In Q4, Nvidia's EPS grew 486 percent year-on-year, excluding certain items. The $5.16 figure handily beat analyst estimates of $4.60. Nvidia's current P/E as per CNBC data is 66.07 against Amazon's 60.56, Alphabet (Google) 's 24.82, Meta's 32.56 and Microsoft's 37.11. Talking to Bloomberg, David Wagner, Portfolio Manager at Aptus Capital Advisors LLC, said that despite the recent run-up, Nvidia continues to be the cheapest AI-oriented stock. 4.    Analysts bullish on Nvidia stock despite huge jump; target prices hiked Analysts continue to remain positive on Nvidia stock. Prior to the earnings, five large brokerages raised their target price on the stock. In a February 5 report, analysts at Morgan Stanley said that they believe Nvidia will remain \"the industry gold standard for the foreseeable future, given its robust hardware and software offerings and, importantly, the pace at which it continues to innovate.\" Goldman Sachs has a ‘buy’ call on the stock and has raised the target price to $800 from its previous $625. Other brokerages like UBS and Mizuho have also raised targets. Nvidia’s stock ended the last trading session at $788.2. According to a Bloomberg report, UBS lifted its target to $850 from $580, while Mizuho raised its target to $825 from $625, calling it the \"best AI play.\" Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}