{
    "title": "Morningstar Mobile",
    "date": "2/27/2024",
    "url": "https://www.morningstar.co.uk/mobile/Article.aspx?Site=uk&articleid=246634",
    "text": " Nvidia (NVDA), Wall Street’s buzziest stock, keeps flying higher. The chipmaker and face of the artificial intelligence boom reported another quarter of blockbuster results and better-than-expected guidance, sending its stock soaring 8.5% last weeks. Those results helped prompt Morningstar’s equity research team to lift their fair value estimate for Nvidia stock to $730 from $480 share. Nvidia’s stock price is up 60% for the year, after gaining 239% in 2023. “This is not the path of your typical company,” says Morningstar equity strategist Brian Colello. “The business has transformed remarkably in just a few quarters.” It’s extremely uncommon “for an already-large established business to grow 300% per year, 500% per year in certain parts,” he adds. Nvidia’s unprecedented growth has continually surprised Wall Street veterans. Analysts say it’s very possible the stock can keep running higher. While risks always exist, Colello points to a handful of reasons to be confident about Nvidia’s growth prospects. First, he says, much of Nvidia’s revenue comes from the largest tech companies in the world, which are racing to offer cloud computing services to their customers. Nvidia’s technology is an essential part of that service. “These are trillion-dollar companies, to begin with,” he explains. “They’re the companies that can afford it.” Second, Colello points out that all the hype surrounding AI is translating into real-world investments. “We don’t think this is an area where [companies] are going to skip out on development and risk falling behind,” he says. Third, there’s a place for AI technology both when times are good and bad. If business is booming, companies are willing and able to invest in AI as an important tool for the future. If business isn’t as good, companies may turn to AI to reduce inefficiencies and cut costs. Here are five charts that show Nvidia’s strong growth under the hood, and the ways the company is continuing to drive returns for investors.  Right now, Morningstar analysts consider Nvidia stock to be fairly valued, meaning its market price is in line with our assessment of its intrinsic value. But Colello says that could change quickly: “It would not surprise me if a year from now, this is a thousand-dollar stock or more.” Nvidia may remain the most dominant player in the space and continue to pull in tens of billions more from the biggest tech companies each year. In that case, “they will earn enough to justify today’s price, and it might be cheap,” according to Colello. The risk to this outlook is that other cloud companies will continue to look for ways to retain or gain footing in the market. That would put a dent in Nvidia’s dominance and the outlook for its stock. Source: Morningstar Direct, February 22, 2024 Even among the “Magnificent Seven,” Nvidia stands apart as one of the most powerful drivers of the entire stock market’s returns. The stock contributed 13% of returns to the Morningstar US Large-Mid Cap Index over the past year, and 16% over the past two years. Since January 1, 2022, it has contributed a staggering 31.5% of that index’s returns. When the stock is rising, that concentration can be good for the market overall. But when it’s falling, it can mean outsize losses. “As it’s become a larger portion of the market, changes in its price will also skew the broad market’s average,” says Dave Sekera, Morningstar’s chief US market strategist. Source: PitchBook Data, February 23, 2024 Over the past two years, Nvidia has seen 192% earnings growth, far more than any of its peers in the Magnificent Seven. That strong growth has sent its stock soaring.  Nvidia’s data centre business is “the only segment that should matter to investors,” writes Colello. This includes the graphics cards that are used in generative AI applications. Revenue for the segment has risen from $3 billion in fiscal 2020 to $47.5 billion in fiscal 2024, a jump of nearly 1,500%. Next year, Colello is projecting data center revenues of $101 billion, double this year’s figure. He points to evidence of strong, lasting demand for AI technology to support his forecast, which he describes as sustainable.  All that revenue is translating into profit for Nvidia and its shareholders. The company’s adjusted earnings per share have risen from $3.34 in the 2022 fiscal year to nearly $13 in the 2024 fiscal year. Colello expects earnings per share of roughly $26.50 in the next fiscal year. An unprecedented story like Nvidia’s also brings unprecedented risks. Morningstar’s equity analysts assign the stock a Very High Uncertainty Rating, meaning it’s relatively difficult to pinpoint its exact fair value. That’s no surprise, since “the competitive landscape in AI seems to be changing almost weekly,” Colello writes. He notes that investors shouldn’t rule out the threat of competition from other chipmakers or cloud companies, or the possibility that AI investment could slow down. “To some degree, right now [Nvidia] is a story stock,” says Sekera. “There’s still a lot more potential upside, depending on how AI develops over the next few years. But that also applies to the potential downside.\"  "
}