{
    "title": "Nvidia Stock in Focus After Friday's 10% Intraday Reversal—Key Price Level \nto Watch",
    "date": "3/10/2024",
    "url": "https://www.investopedia.com/nvidia-stock-in-focus-after-friday-s-10-intraday-reversal-8607055",
    "text": " Nvidia (NVDA) remains in focus to start the week after the artificial intelligence (AI) market darling’s share price staged a dramatic intraday reversal of over 10% to end Friday’s session 5.6% lower as investors scrambled to lock in profits after prominent Wall Street analysts raised concerns over the stock’s lofty trading levels. The AI chipmaker’s stock, which has nearly quadrupled over the past 12 months, on Friday initially rallied to a new all-time-high (ATH) before closing near its intraday low at $875.28, slashing $128 billion from its market capitalization in the process. In a Thursday letter to shareholders, famed tech investor and ARK Invest CEO Cathie Wood raised several concerns about Nvidia after its record-breaking run. She cautioned about the star Magnificent Seven member could see slowing growth amid more prudent enterprise spending and increasing competition. “Without an explosion in software revenue to justify the overbuilding of graphics processing unit (GPU) capacity, we would not be surprised to see a pause in spending, compounding a correction in excess inventories, particularly among the cloud customers that account for more than half of Nvidia’s data center sales,” Wood said. She added than competition in the AI chip space could intensify as Nvidia’s customers start to develop their own chips. Wood’s concerns may have hit a nerve after shares in chip stocks Broadcom (AVGO) and Marvell Technology (MRVL) slumped late last week after issuing disappointing outlooks. Mizuho Securities analyst Jordan Klein attributed Friday’s sell-off to overbought conditions, which he referred to as “exhaustion.” Klein said that retail investors grew more nervous throughout the day as quant trading algorithms intensified their selling. Since bottoming out in the fourth quarter of 2022, Nvidia’s share price has trended consistently higher, with only several minor retracements to the 50-day moving average. The uptrend has accelerated this year after the company’s latest blowout earnings report backed up they AI hype surrounding its share price. Breaking down Friday’s price action, the stock formed a textbook bearish engulfing pattern—an ominous chart formation that technical analysts typically interpret as signaling a reversal in an uptrend. In a nutshell, the two bar pattern sees the price rise above the prior day’s high before staging a reversal to close beneath the prior day’s low, precisely what happened in Nvidia stock on Friday. In the short-term, keep an eye on the $780 level, where the price finds a confluence of support from a two-month trendline and the closely-watched 38.2% Fibonacci level. A deeper retracement may see a test of the 50-day moving average, currently sitting at $660.66. Nvdia shares extended their decline in after-hours trading Friday, falling 2.8% to $851.00. The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own any of the above securities. Barron's. \"Nvidia Sheds $128 Billion in Market Cap, Its Largest Drop on Record.\" Ark Invest. \"The Journey From Monetary Shock to an Innovative-Led Economic Boom.\" Barron's. \"Cathie Wood Is Worried About Nvidia Stock. She Isn’t the Only One.\" MarketWatch. \"Nvidia's Stock Completes Dramatic Reversal Lower Not Seen in Almost Seven Years.\" "
}