{
    "title": "Magnificent Seven Stocks To Buy And Watch: Nvidia Stock Sells Off",
    "date": "3/27/2024",
    "url": "https://emeatribune.com/magnificent-seven-stocks-to-buy-and-watch-nvidia-stock-sells-off/",
    "text": "Dubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon, Nvidia, Meta Platforms and Tesla lived up to their name in 2023 with big gains. But the start of 2024 has shown a big divergence of returns. The Magnificent Seven stocks are among the best stocks to buy and watch in the stock market today. X Due to their outsized market capitalizations, Magnificent Seven stocks hold a disproportionate influence on the market-cap weighted Nasdaq composite and S&P 500 indexes. For an in-depth look at this issue, check out IBD’s page on the Magnificent Seven weightings, market capitalizations and the companies’ latest news stories. Table of Contents Stock Market ETF Strategy And How To Invest Google parent Alphabet (GOOGL) is building a new base, as it trades back above its 50-day line after gains in recent sessions. Google fell 0.8% Wednesday, still near a 153.78 buy point. Alphabet surged on March 18 after Bloomberg reported that Apple is in talks with the Google parent over licensing its “Gemini” artificial intelligence  training model for use in iPhones. On Jan. 30, Alphabet reported fourth-quarter earnings and revenue that topped analyst estimates. But shares tumbled as the search giant’s core advertising business slightly missed views. Among the Magnificent Seven stocks, Nvidia (NVDA) is the top performer in 2024, with a scorching 87% year-to-date return through March 7. The AI giant is sharply extended past a new flat base’s 505.48 buy point after a Jan. 8 breakout move. Shares sold off 3.5% Wednesday, threatening to extend Tuesday’s losses. Nvidia is an IBD Leaderboard stock. On Feb. 21, Nvidia beat Wall Street’s targets for its fiscal fourth quarter and guided higher than views for the current period. Nvidia’s Q4 report marked its third straight quarter of triple-digit percentage growth in sales and earnings. And its sales growth has accelerated for the past three quarters. “Accelerated computing and generative AI have hit the tipping point,” Chief Executive Jensen Huang said in a news release. “Demand is surging worldwide across companies, industries and nations.” Be sure to read how to adjust to changing market conditions, with IBD’s new exposure levels. Tesla (TSLA) rose 1.1% Wednesday, as the stock faces resistance at its pivotal 50-day line. On Jan. 24, the electric-vehicle giant said that earnings fell 40% to 71 cents per share while revenue totaled $25.17 billion, up 3.5% vs. the year-ago period. Wall Street expected earnings of 73 cents a share on revenue of $25.62 billion. For 2023, Tesla earnings fell 23% to $3.12 a share while revenue increased 19% to $96.77 billion vs. estimates of $3.05 on sales of $97.5 billion. Two Dow Jones names among the Magnificent Seven stocks, Apple (AAPL) and Microsoft (MSFT) traded mixed on the stock market today. Apple stock gained 1.8% Wednesday. Shares remain below their 200-day line. On Feb. 1, Apple beat Wall Street’s targets for its fiscal first quarter, thanks to iPhone 15 handset sales and services growth. According to MacRumors and other outlets, Apple could have a generative AI feature — internally known as Apple GPT — available on the iPhone and iPad sometime late next year. Meanwhile, Microsoft stock is rallying from support around its 50-day line, a key area to watch. The stock moved down 0.6% Wednesday, just off new highs. On Jan. 30, Microsoft beat Wall Street’s targets for its fiscal second quarter thanks to strong cloud computing business. IBD Live: A New Tool For Daily Stock Market Analysis EMEA Tribune is not involved in this news article, it is taken from our partners and or from the News Agencies. Copyright and Credit go to the News Agencies, email [email protected] Follow our WhatsApp verified Channel Key Takeaways BTC halving will occur when the number of blocks reaches 840,000 in April 2024. Then, the reward per block will decrease from 6.25 […] Demand for chips that provide the processing power to train and support artificial intelligence (AI) models is increasing rapidly as governments and technology companies around […] By Linda Pasquini and Chiara Holzhaeuser (Reuters) -German online fashion retailer Zalando on Wednesday forecast a return to growth this year and said it was […] The EMEA Tribune was founded in March 2020  by DJ Kamal Mustafa. Our aim is to be the primary portal for the Middle East, Africa, Europe, and Pakistan news, and our target audience is all those communities of readers living in and around the region that care deeply for its fate. EMEA TRIBUNE is known for its “Investigative Journalism” where we publish exclusive stories from investigative to trending and that’s how we make it viral for everyone. We have been featured in News Blogs and International Media is also quoting us and publishing our report. A video has recently surfaced from the Dangar Algar region of Afghanistan. It shows members… The recent Gwadar attack exposes a troubling pattern: so-called \"missing persons\" turning up as terrorists.… On March 24, 2023, Lieutenant General Babar Iftikhar, the Corps Commander of Karachi, visited the… Donald Lu, the Assistant Secretary of State for South Asia, has categorically refuted claims that… "
}