{
    "title": "Up 521% in the Last 18 Months, Is Nvidia Stock Still a Buy? This Chart Says \nYes.",
    "date": "3/8/2024",
    "url": "https://www.fool.com/investing/2024/03/08/is-nvidia-stock-still-a-buy-this-chart-says-yes/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Everyone loves a winner. And, without doubt, Nvidia (NVDA 0.12%) is a winning stock. Shares of the graphics processing unit (GPU) designer are up a staggering 551% over the last 18 months. But, after such an unbelievable run, many investors are asking whether it can continue, or whether this red-hot stock is about to come crashing back to Earth. While no one knows for sure, I think Nvidia's incredible streak could continue. Moreover, I have a chart that helps explain why. So, let's have a look. For a stock to take off the way Nvidia has over the last 18 months, there has to be a catalyst -- something that precipitates the movement. And in the case of Nvidia, it's the artificial intelligence (AI) revolution. Organizations are tripping over themselves to integrate AI tools and products, thanks to their ability to save time and money. And while AI-powered applications like ChatGPT or Midjourney may seem like magic, there's actually a great deal of physical hardware required to make them work. And that's where Nvidia -- and its massive stock run -- come in. Take a look at this chart, which shows the segment-based origins of Nvidia's total revenue dating back to 2017: Image source: Statista Note that Nvidia's compute and networking revenue exploded in fiscal Year 2024 (the 12 months ending on Jan. 28, 2024), rising from $15.1 billion to $47.4 billion in a single year. That, my friends, is why Nvidia's stock is up 551%. This segment designs and sells enterprise server GPUs -- aka, the brains behind the latest and greatest AI applications. What's more, analysts expect Nvidia's Compute segment revenue to continue to skyrocket, thanks to its commanding share of the AI chip market, which some industry insiders believe could grow as much as tenfold over the next decade. To sum up, Nvidia's exceptional stock performance over the last 18 months could be just the start. And while it's impossible to know for sure, I wouldn't be betting against Nvidia right now. Jake Lerch has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}