{
    "title": "Top AI investment opportunities beyond Nvidia",
    "date": "3/21/2024",
    "url": "https://english.elpais.com/economy-and-business/2024-03-21/top-ai-investment-opportunities-beyond-nvidia.html",
    "text": "Nvidia’s stock market performance is impressive, showcasing the rising impact of tech giants on Wall Street. Investor enthusiasm for artificial intelligence (AI) remains strong, despite the delay in interest rate cuts by the Federal Reserve. The previously worrisome high rates now seem to have little effect on the stock market, with the tech sector’s momentum taking the spotlight. Tech stocks are thriving, backed by a strong economy and optimistic earnings outlooks. However, investors are not oblivious to the ongoing market debate about the risk of a stock market bubble in artificial intelligence (AI) and the implications of the high concentration of major stocks on Wall Street today. According to Bank of America’s (BofA) April Global Fund Manager Survey, 40% of money managers believe there is an AI bubble while another 45% do not dismiss the possibility, reflecting divided market sentiment. The top ten companies on Wall Street represent 34% of the U.S. stock market value and generate 25% of its profits. A recent report by Goldman Sachs highlights this heavy reliance on a few stocks, the highest in nearly a century. While Goldman Sachs doesn’t foresee an AI bubble or expect major market fluctuations, it stresses the importance of diversification to manage risk. Goldman suggests investing in AI-driven companies beyond Nvidia and other tech giants to enhance value creation. Nvidia, which has surged 240% in the stock market in the past year and quickly surpassed a two trillion dollar market cap, undeniably leads the AI business. It is a dominant supplier of hardware and software for AI applications like ChatGPT, Gemini and many others. Goldman Sachs has identified additional tech firms that stand to gain, though to a lesser degree, from AI and the influence of Nvidia. Goldman places companies involved in providing the necessary infrastructure for AI technology as the next area of opportunity for investors. This includes semiconductor firms, cloud service providers, data centers and cybersecurity software developers. These companies have, on average, seen a 13% increase in value over the last six months. According to Goldman, this rise is mainly due to improved valuations rather than revenue growth, unlike Nvidia, which has maintained its multiples almost unchanged since early 2023. In the tier just below Nvidia, companies like ARM, a chip manufacturer, have doubled their stock prices in the past year. Synopsis, a U.S. software developer, has seen a 13% rise this year. Cadence Design Systems, a computational software company, has risen by 15% in 2024 and 47% in the last 12 months. Advanced Micro Devices has seen a 30% increase this year, while Qualcomm, a software and semiconductor company, has seen its share price rise by 17%. Other AI infrastructure companies include large players in the cybersecurity sector such as Palo Alto Networks, Palantir and CrowdStrike Holdings. In a third tier, there’s a group of companies that Goldman Sachs believes will benefit from products and applications that integrate AI technology. This group has seen an average share price increase of 20% in recent months, partly due to improved valuations and revenue growth. This tier includes companies like Meta, Intuit, Nutanix, Accenture, Adobe, Uber, Mastercard, Apple, Snowflake and Salesforce. Nvidia is at the forefront of the AI boom, which is widely expected to enhance business productivity and revenue. Investors are optimistic about AI’s long-term benefits for communication companies like Pinterest and The New York Times Company, energy companies like Occidental Petroleum, and consumer services and product companies like H&R Block and Walmart. Currently, Nvidia dominates the portfolios of many equity investors, especially hedge funds. Goldman Sachs says that by the end of 2023, 149 hedge funds had taken positions in Nvidia, whereas the next-tier companies were only represented in 40 hedge funds. Sign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition Suscríbete y lee sin límites "
}