{
    "title": "Analysis-Wall Street hunts for more AI gold after Nvidia's soaring rally",
    "date": "3/1/2024",
    "url": "https://finance.yahoo.com/news/analysis-wall-street-hunts-more-060314860.html",
    "text": "By Lewis Krauskopf NEW YORK (Reuters) - Money managers are scrambling to cash in on the stock market’s interest in artificial intelligence, as a stunning rally by Nvidia sparks a search for other companies that are capitalizing on the technology. Shares of Nvidia - whose chips are the gold standard in the AI industry - are up about 60% this year after tripling in 2023. The run has pushed its market value to roughly $2 trillion, making it the third-largest U.S. company by market cap after Microsoft and Apple. It has also spurred Wall Street to search for other AI-focused companies in hopes of catching outsized moves. Whether investors are looking at the broader chip industry or betting on firms elsewhere in the value chain, they agree on one thing: AI is here to stay. “It's not a fad,\" said Francisco Bido, senior portfolio manager for F/m Investments' Large Cap Focused Fund. \"There are too many ... cases where companies can make really good use of the technology to enhance both their top and bottom lines.” Excitement over AI helped power the Nasdaq Composite Index to a record high on Thursday, while the S&P 500 also marked its latest record. The indexes are both up about 7% this year. Further signs of the growing fixation on AI have been easy to spot. Mentions of AI on conference calls reached a new high in the fourth quarter, Goldman Sachs said recently. The bank’s analysts have estimated artificial intelligence technology could add 1.5 percentage points to U.S. productivity growth if there is widespread adoption over the next decade. A Morgan Stanley survey of chief information officers suggests 2024 is \"a Year of Investment for AI,\" the bank said in a note this week, with CIOs naming AI/machine learning as their top priority for the first time. Bido’s fund retains a large holding in Nvidia, but has branched out into other AI plays, including rival chipmaker Advanced Micro Devices and MongoDB, whose database products could be in high demand as AI is poised to change data infrastructure needs. Those stocks have risen sharply, although less dramatically, than Nvidia and some other AI plays that have recently captured the market's attention. AMD shares are up 30% year-to-date, for example, while Mongo’s have risen 9%, though the shares of both companies doubled last year. By contrast, shares of server component supplier Super Micro Computer and chip designer ARM Holding have jumped about 200% and 90%, respectively, in 2024. SMCI's shares tripled in 2023. Ivana Delevska, founder and chief investment officer of Spear Invest, said Nvidia has remained the biggest holding in its Spear Alpha ETF. But the exchange-traded fund has also sought to capitalize on growing cybersecurity needs related to AI by owning shares of Zscaler, a cybersecurity specialist. The fund's position in Snowflake, meanwhile, seeks to take advantage of data infrastructure demands. Of course, the risks of playing the often-volatile stocks of AI-related companies remain despite the technology’s higher profile. Shares of Snowflake, for example, fell 18% on Thursday after the company projected annual revenue below Wall Street estimates and disclosed the unexpected retirement its CEO. Baker Avenue Wealth Management trimmed its Nvidia holding as the stock has climbed so that it does not occupy too large a position in client portfolios, said King Lip, the firm’s chief strategist. But the firm recently started building a position in Taiwan Semiconductor, a key supplier to Nvidia. \"If you still want artificial intelligence exposure but are perhaps a little skittish about Nvidia’s stock price, I think Taiwan Semi is kind of a no brainer,” Lip said. Que Nguyen, chief investment officer of equities at Research Affiliates, is looking for reasonably valued semiconductor companies that could stand to benefit from AI. Among them are Lam Research Corp, which supplies equipment to the semiconductor industry, and Micron Technology, which makes memory chips and data storage. Lam Research shares are up about 20% so far this year, while Micron is up 6%. “Large language models are not just processing, you need to have storage,” Nguyen said. Of course, many investors are happy sticking with big Nvidia positions. The Martin Currie US Unconstrained Fund has nearly 10% of its assets - the maximum the fund allows for one stock - in Nvidia, said portfolio manager Zehrid Osmani. He believes the company will maintain competitive advantages as it spends more heavily than rivals on research and development. \"We have high conviction in the name, and that's expressed through high position size,\" Osmani said. (Reporting by Lewis Krauskopf in New York; Additional reporting by David Randall in New York; Editing by Ira Iosebashvili and Matthew Lewis) Related Quotes "
}