{
    "title": "Nvidia, Broadcom and the expanding breadth of AI momentum",
    "date": "3/23/2024",
    "url": "https://siliconangle.com/2024/03/23/nvidia-broadcom-expanding-breadth-ai-momentum/",
    "text": "UPDATED 13:33 EDT / MARCH 23 2024 BREAKING ANALYSIS\t\t\t\t\t        \t                        by \nDave Vellante We attended both Nvidia Corp.’s GTC conference and Broadcom Inc.’s investor day this week where the artificial intelligence platform shift was on full display. In our view, GTC24 was the most important event in the history of the technology industry, surpassing Steve Jobs’ iPod and iPhone launches. The event was not the largest but, in our opinion, it was the most significant in terms of its reach, vision, ecosystem impact and broad-based recognition that the AI era will permanently change the world. Meanwhile, Broadcom’s first investor day underscored both the importance of the AI era and the highly differentiated strategies and paths that Nvidia and Broadcom are each taking. We believe Nvidia and Broadcom are currently the two best-positioned companies to capitalize on the AI wave and will each dominate their respective markets for the better part of a decade. But importantly, we see them each as enablers of a broader ecosystem that collectively will create more value than either of these firms will in and of themselves. In this Breaking Analysis, we will share our perspectives on the state of AI and how Nvidia and Broadcom are each leading the way with dramatically different but overlapping strategies that may be headed for an eventual collision course. You’d never know it from all the AI froth but the macro appears to be getting worse.  Enterprise Technology Research shared the chart above earlier in the week with its private clients. It shows the expected information technology spending growth rates from more than 1,500 IT decision makers for three time periods – October 2023, January 2024 and the most recent survey in the field. Note the material drop in Q1 from 2.8% to 1.5% and more than a 100-basis-point drop in the expectations for the full-year 2024. As we reported earlier this year, the tech spending outlook is backloaded toward the second half and is further deteriorating based on the latest data. Despite the softer macro environment, we’re seeing countervailing effects from investors toward clear AI beneficiaries beyond the giants. Specifically, the strong performance of the market in 2023 was narrow with just a few names powering the tech rally. Although both Nvidia and Broadcom were part of that momentum along with Microsoft and some other names, 2024 is shaping up to have much broader participation in the AI tailwind. Firms such as Ansys, Cadence, Synopsys, Dell Technologies, Micron, IBM, Supermicro, Pure Storage, VAST Data, ServiceNow, CrowdStrike Holdings, Arm, UiPath, Lam Research and many others are benefitting from the froth around GTC24.  Above we show the recent movement post Chief Executive Jensen Huang’s keynote at GTC24 for Ansys, Cadence, Synopsys and Dell, each of which got major shoutouts from Huang in his presentation. You can see they all moved up nicely and we believe it’s from the combination of 1) the GTC momentum; and 2) good fundamentals, including demand outstripping supply for these firms. In the case of Ansys, Cadence and Synopsys, they are critical design software providers for silicon chips. In the case of Dell, the company’s supply chain leverage is putting it in a good position to secure GPUs. Its execution is throwing of cash that it’s returning to investors and as well it is benefitting from the AI tailwind. And there’s likely more to come from a new PC cycle that will take shape later this year. We also show Cisco Systems, a company that is not considered an AI leader, despite the fact that it has a robust portfolio, which includes many AI innovations. Cisco has silicon to power AI networking, AI in its own networking, AI in its collaboration software, and data from its recently completed Splunk acquisition and ThousandEyes to provide network intelligence data that can feed Splunk. But the macro is hurting Cisco right now as the company has disappointed investors recently. Snowflake (not shown above) is another company that in theory should be benefitting from AI because it houses so much critical analytic data. It has partnerships with the likes of Nvidia and it has acquired AI expertise in the form of Neeva. But investors were shaken by Frank Slootman stepping down as CEO and the street is waiting for Snowflake’s new leader, Sridhar Ramaswamy, to prove that Snowflake is still on track. AI is everywhere but still is in the experimental phase within the enterprise. Our premise is that while the macro is still challenging, AI will be infused into all sectors and eventually be a rising tide for all areas of tech and beyond. However, at the moment, though the return on investment of AI is clear for consumer internet companies such as Google and Meta Platforms, the business impact for enterprise AI has not been as evident. Until it shows up in the quarterly numbers, we expect chief financial officers to remain conservative with their budget allocations. The point is that the AI rally is broadening but it’s still not a tide that lifts all ships. Nonetheless, a broadening of a rally signals investor concern about the valuations at leading companies. They’re making the case for putting money to work with other AI beneficiaries that could give them better returns in the near term. As well, others such as the Cisco and Snowflake examples we shared will eventually benefit in our opinion. These are indicators in our view that there’s still plenty of upside in this AI run. We understand it’s just a matter of time before the other AI winners become highly valued and the market gets toppy. But we’re not there yet, in our view. GTC was a remarkable moment for our industry. The event was held in the San Jose Convention Center, a venue that was filled to the max in 2019, the last time GTC was held as an in-person event. GTC24 was far too large for this venue. In fact, the keynote took place in the SAP Center sports arena, about a mile from the main event. Rumors circulated that Jensen wanted GTC to be held at the Sphere in Las Vegas but it was booked. Perhaps next year, as clearly GTC has outgrown the coziness of San Jose.  The main venue was packed for days, with Monday seeing the largest attendance. Perhaps as many as 30,000 people attended over the course of the week, but what made GTC so important was the reach not only in the technology community but with many presenters outside tech in automotive, healthcare, financial services – virtually every industry was represented. The big takeaways – and there are many we won’t touch on today – started with Jensen’s keynote and his vision for the industry and what he calls accelerated computing. And the building of AI factories. The vision he put forth during the week was that a world of generated content is here. The images from his keynote he said were all simulation, not animation – and the simulations were impressive. He also put forth a vision of a token economy where the computer sees tokens and these tokens can be generalized. If you can generalize, he said, then you can talk to the AI and generate images, perform gene analysis, control robotic arms and more. Jensen said that Blackwell, its new chip named after mathematician David Blackwell, was built for this generative AI moment. He described a reinforcement learning loop where training, learning and generation become part of the same process. And if done well and enough times, it becomes reality. He implied that this workflow would perform both inference and training and a critical enabler to Blackwell is NVLink, a high speed interconnect that is proprietary to Nvidia. He said Blackwell took three years, 25,000 people and $10 billion to create, with incredible complexity – 600,000 parts and lots of software to do switching, links, cables and all the plumbing. He also explained that Nvidia is not a chip company. Rather, it builds entire systems, then disaggregates them to sell to customers. This no doubt caused some stress among systems vendors. GTC24 is a developer conference first, even though that point gets lost sometimes in all the noise from the ecosystem. Jensen laid out a vision for developers showing off NIMS (Nvidia Inference Microservices), which are inference containers. As well, there’s NeMo (Neural Modules), which are models for conversational AI and a platform for developing end-to-end generative AI using automated speech recognition, natural language processing and retrieval augmented generation at very high performance. And he discussed the AI Foundry, which packages all this technology into systems and essentially changes the way data centers are built. He also spent a lot of time showing off Omniverse a platform of APIs, services, and SDKs that allow developers to build digital representations of a business and its workflows using generative AI-enabled tools. Jensen talked about digital twins at length and had robots on stage with him. In a private meeting with Jensen, he told us that within eight to 10 years, robots will be generally fully functioning. And he said this will be done with “just a bunch of tokens.” Think tokenizing of movement. He said we have lots of data and there’s a finite vocabulary around what various human movements like walking, sprinting, skipping, throwing, hugging and the like look like. And this can be simulated with AI — and done so very accurately by being tokenized and made generative. A key, he said, was to be able to ground Omniverse in the laws of physics and he described a cycle of imitate>learn>adapt>generalize>reinforce and ground in the laws of physics. The ecosystem was on full display at GTC24. Virtually every company with a play in AI was basking in the AI glow. Hence the broadening of the AI tailwind we’re seeing post-GTC. You left the event truly believing we saw proof of a new era emerging and coming into full swing. The days of Moore’s Law driving industry innovation are over. A new performance curve has emerged and new styles of computing will dominate virtually all sectors for the next decade. This was the strong feeling one gets when assessing the impact of GTC 2024. A different but compelling AI vision was put forth by Broadcom at its investor event.  Broadcom held its first-ever investor day at its facilities in San Jose on Wednesday morning, perfectly timed to capitalize on the GTC24 momentum and position the company for investors. It was attended by both buy-side and sell-side analysts and only a few industry analysts such as ourselves. This was Charlie Kawwas’ show, designed to educate the investment community on Broadcom’s unique approach to the market. We learned a lot from the president of Broadcom’s Semiconductor Solutions Group about its strategy, philosophy, technology, execution ethos, engineering talent and we saw demos of some of the most leading edge silicon technology on the planet. Broadcom has 26 divisions or P&Ls and 17 of them are in the semiconductor group. The semiconductor group is a roughly $30 billion revenue business, growing in the double digits. The group spends $3 billion annually on R&D. Kawwas and his team took us through the history of how Broadcom came to be, with roots in Bell Labs, HP, LSI Logic, LSI Avago, Broadcom, Brocade and more recently software assets such as CA, Symantec and of course VMware. Kawwas explained the company’s unique three-pronged strategy shown below.  Broadcom doesn’t chase hockey stick markets to try to ride the steep part of an S-surve. Rather, it looks for durable markets with sustainable franchises that have a decade or more runway. In those markets, it goes for technology leadership and it executes to a firm plan. With AI, Broadcom just happened to catch a big wave and is exceedingly well-positioned. So this is a nice Powerpoint, but what was impressive to us is that the five presenters coming after Kawwas each demonstrated: 1) a deep understanding of their markets and the history of their businesses; 2) technology leadership within their division, showing us when they entered the market, how they were first with innovations, their technology roadmaps and; 3) evidence of execution. The proof points were many from AI networks presented by Ram Velaga, server interconnects by Jas Tremblay, optical interconnects from Near Margalit, foundational technologies such as SerDes that are shared across the P&Ls from Vijay Janapaty, and custom AI accelerators presented by Frank Ostojic. The biggest news from the event and part of the reason why the stock popped after Investor Day — in addition to the credibility of the presentations and the GTC24 momentum – was the announcement of a third custom silicon customer. Customer No. 1 is Google in our opinion. It has been a custom silicon customer of Broadcom for 10 years. Custom customer No. 2, we believe, is Meta, a customer for the past four years and one where Broadcom CEO Hock Tan sits on the board. We were all speculating on which customer is No. 3. We think it’s ByteDance, but this wasn’t disclosed. Kawwas was asked in the Q&A if its technologies are restricted from selling to China and his answer was currently there are no restrictions on selling its technology. So ByteDance, the owner of Tik Tok, can’t be ruled out. But as well, we know that ByteDance is an advanced customer of Broadcom. It has a large network and has embraced Broadcom’s on-chip, neural-network inference engine, giving it programmability and flexibility. It also is a large consumer-oriented social network that can get fast ROI from using more custom versus merchant silicon.  Further strengthening our belief that customer No. 3 is ByteDance came from a two other key takeaways from this discussion that further explain the value of custom silicon. For these reasons, we think custom customer No. 3 is ByteDance. Could it be Amazon, Apple or Tesla? Maybe… but we think ByteDance makes the most sense. And the reason this is important is because these are durable customers with long lifecycles and a highly differentiated and very difficult to displace business. These custom customers are AI-driven and will contribute to Broadcom’s AI revenue. The company increased its AI contribution forecast saying that 35% of its semiconductor revenues will come from AI in 2024. That’s a 10% increase from previous forecasts and its up from less than 5% in 2021. In 2024, 35% of Broadcom’s silicon revenue will come from AI workloads. There’s so much to unpack from the Broadcom meeting. We have almost 90 slides of content and multiple pages of notes from the event. But one other key point we want to leave you with is shown here.  Broadcom’s premise is that we’re moving from a world that is CPU-centric to one that is connectivity-centric. The emergence of alternative processors beyond the CPU such as the GPU, NPU, LPU – the XPUs, if you will – requires high-speed connections between them. And that is Broadcom’s specialty. And the power of its business model is shown above. This is an example of a type of system needed to support AI workloads. Broadcom technologies are shown on the right and the numbers show where they fit in the packaging. The company is essentially surrounding the AI infrastructure. Below is a different picture of this dynamic with a configuration that scales up and out to many clusters. Broadcom’s technology is shown in the red and the yellow optics that connect all the various components of a system, from the spine, top-of-rack switching, NICs, PCIe innovation and the like. It has a massive total available market beyond that GPU and CPU that is a very difficult market in which to participate.  Another key takeaway which was shown on all of Broadcom’s slides – Kawwas’ mantra – Open, Scalable, Power-efficient. Broadcom is focused on open technology standards. Two examples are PCIe and Ethernet. There was a nuanced but interesting tidbit shared by Jas Tremblay about Blackwell, Nvidia’s giant GPU. The southbound connectivity of Blackwell is proprietary NVLink, but the northbound connection is PCIe. Nvidia’s highly proprietary architecture is built around Infiniband from the Mellanox acquisition. But even Nvidia must play in the open standards world. The southbound connectivity of Blackwell is proprietary NVLink but the northbound connection is PCIe. – Jas Tremblay, GM Data Center Solutions Group, Broadcom Despite the tension between Nvidia’s proprietary approach to network connectivity and Broadcom’s embrace of Ethernet, Kawwas highlighted that Broadcom has a great relationship with Nvidia and Nvidia is its fastest-growing customer. So you can begin to see how compelling Broadcom’s business model is because it sells to consumer internet companies, device manufacturers such as Apple, hyperscalers, enterprise players such as Dell and Hewlett Packard Enterprise and the most important company in AI right now, Nvidia — which in some ways makes Broadcom as important to the growth of the industry. Another clear takeaway is that Broadcom does the really hard silicon work that others can’t do. The example given was many folks can ski the green trails but the double blacks and extreme skiing with warning signs and skeletons – Broadcom does really well but that’s a huge barrier to entry. There’s so much more we could talk about and we will share more over the coming weeks and months as we digest this material. Especially in the Infiniband-versus-Ethernet discussion, which was fascinating – Jensen saying Ethernet is essentially useless for AI and Broadcom countering with many proof points of AI leaders such as Meta, Google and others adopting Ethernet.  We’ll close with the following key points: Will 2024 be the year of AI ROI in the enterprise, the way it has been for years in consumer internet markets such as search and social? We think perhaps in the second half of this year, enterprises will start to see ROI on their AI investments, but 80% of organizations are still firmly in the experimentation phase. It’s more likely AI ROI is a 2025 story where enough value is thrown off from investments to gain share back into new AI projects that will ideally drive productivity growth and fulfill the promise of AI. For now, keep experimenting, finding those high-value uses cases and stay ahead of the competition in your industry. Thanks to Alex Myerson and Ken Shifman on production, podcasts and media workflows for Breaking Analysis. Special thanks to Kristen Martin and Cheryl Knight, who help us keep our community informed and get the word out, and to Rob Hof, our editor in chief at SiliconANGLE. Remember we publish each week on theCUBE Research and SiliconANGLE. These episodes are all available as podcasts wherever you listen. Email david.vellante@siliconangle.com, DM @dvellante on Twitter and comment on our LinkedIn posts. Also, check out this ETR Tutorial we created, which explains the spending methodology in more detail. Note: ETR is a partner and separate company from theCUBE Research and SiliconANGLE. If you would like to cite or republish any of the company’s data, or inquire about its services, please contact ETR at legal@etr.ai or research@siliconangle.com. Here’s the full video analysis:  All statements made regarding companies or securities are strictly beliefs, points of view and opinions held by SiliconANGLE Media, Enterprise Technology Research, other guests on theCUBE and guest writers. Such statements are not recommendations by these individuals to buy, sell or hold any security. The content presented does not constitute investment advice and should not be used as the basis for any investment decision. You and only you are responsible for your investment decisions. Disclosure: Many of the companies cited in Breaking Analysis are sponsors of theCUBE and/or clients of theCUBE Research. None of these firms or other companies have any editorial control over or advanced viewing of what’s published in Breaking Analysis. THANK YOU Nvidia, Broadcom and the expanding breadth of AI momentum Report: GPU cloud operator CoreWeave seeking new funding at $16B valuation Apple reportedly cancels internal effort to develop custom microLED displays On theCUBE Pod: The most important event in the history of the computer industry? Meta updates Threads to connect with Mastodon and other fediverse social networks At GTC, Nvidia's Jensen Huang kicks off the next era of artificial intelligence Nvidia, Broadcom and the expanding breadth of AI momentum AI - BY DAVE VELLANTE . 1 MIN AGO Report: GPU cloud operator CoreWeave seeking new funding at $16B valuation AI - BY MARIA DEUTSCHER . 18 HOURS AGO Apple reportedly cancels internal effort to develop custom microLED displays APPS - BY MARIA DEUTSCHER . 20 HOURS AGO On theCUBE Pod: The most important event in the history of the computer industry? AI - BY RYAN STEVENS . 22 HOURS AGO Meta updates Threads to connect with Mastodon and other fediverse social networks APPS - BY KYT DOTSON . 1 DAY AGO At GTC, Nvidia's Jensen Huang kicks off the next era of artificial intelligence AI - BY ROBERT HOF . 2 DAYS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}