{
    "title": "Cognizant Enhances Drug Discovery with Generative AI in Partnership with \nNVIDIA BioNeMo",
    "date": "3/24/2024",
    "url": "https://eyesonnews.com/cognizant-enhances-drug-discovery-with-generative-ai-in-partnership-with-nvidia-bionemo/",
    "text": "Cognizant Enhances Drug Discovery with Generative AI in Partnership with NVIDIA BioNeMo: Cognitive (NASDAQ: CTSH) is working to improve generative AI (gen AI) technology and the NVIDIA BioNeMo platform so that the life sciences industry can solve difficult problems in drug development. One important goal is to speed up the delivery of new treatments that can save lives and make the research process more productive. The American global company Cognizant provides business process outsourcing (BPO) services. It is also an IT services and consulting firm. Kumar Mahadeva and Francisco D’Souza started the business in 1994 as a technology unit inside Dun & Bradstreet. In 1996, it started working with outside clients. About 70% of Cognizant’s workers live in India, but the company’s main office is in Teaneck, New Jersey. Check Out: Is Gen AI Set to Dominate SEO? Report Suggests a Potential Takeover by 2027 As part of the normal process of finding new drugs, a lot of scientific research and clinical data needs to be looked over to find useful information. Traditional methods are also expensive and take a long time to build, which means they fail a lot of the time. Gen AI tools help clinical researchers quickly sort through huge datasets, guess how different drug compounds will interact with each other, and create new, workable ways to develop drugs. Anna Elango, EVP of Cognizant, said that generative AI has the potential to change the way new drugs are studied, developed, and brought to market more than any other technological progress in the last few decades. This could make lifesaving discoveries easier to get, faster, and smarter. Cognizant can help our life sciences clients reach this goal in a safe, responsible, and cost-effective way by working with NVIDIA. With BioNeMo, Cognizant wants to give its clients access to a set of model-making services, such as pre-trained models, cutting-edge frameworks, and APIs that let them train and customize enterprise models using their own data and NVIDIA’s pre-trained, industry-specific generative AI models. These services will include NVIDIA’s deep life sciences and AI domain expertise. With this service, you can analyze data with less manual work and without having to write complicated code or set up and manage infrastructure. A VP at NVIDIA called Alvin DaCosta said, “Generative AI will drive the next wave of enterprise productivity gains across industries.” This will be made possible by the NVIDIA AI business software platform. “Using NVIDIA BioNeMo, Cognizant will help provide its life sciences clients with advanced, secure and reliable AI services to drive improved outcomes with custom drug discovery applications.” Cognitive works with top global companies in pharmaceuticals, biotech, and medical products on everything from research and development to digital health. This work helps the healthcare industry improve science, patient outcomes, and business value by promoting a patient-centered approach and better interactions with healthcare workers. More than 18 million people around the world use the products made by a medical device company because of Cognizant’s life sciences services. Cognizant and NVIDIA are going to work together in areas like manufacturing and car engineering, where generation AI can boost output, cut costs, and speed up new ideas. Cognizant is going to open an NVIDIA AI Center of Excellence in 2019 to help them come up with new ideas using NVIDIA technologies like the NVIDIA Metropolis, NVIDIA Omniverse, and NVIDIA AI Enterprise systems. Check Out: How AI is Powering Mango’s $3.4 Billion Business Growth? At EyesOnNews, our mission is simple: to provide our readers with trustworthy news that matters. We believe in the power of information to shape societies, influence decisions, and inspire change. That’s why we’re committed to delivering news that not only informs but also educates and empowers. |  |  |  | Our website uses cookies to provide you the best experience. However, by continuing to use our website, you agree to our use of cookies. For more information, read our Cookie Policy. Accept "
}