{
    "title": "Citadel CEO Ken Griffin Unsure Of AI Market Bubble But Says Nvidia 'Sits In \nA Pretty Good Position' Now: 'Really On ...",
    "date": "3/13/2024",
    "url": "https://www.tradingview.com/news/benzinga:af387433a094b:0-citadel-ceo-ken-griffin-unsure-of-ai-market-bubble-but-says-nvidia-sits-in-a-pretty-good-position-now-really-on-top-of-their-game/",
    "text": "Nvidia Corp.’s NVDA recent volatility may have given some investors sleepless nights, but a big-ticket hedge fund manager dismissed these worries on Tuesday. Market Now Tale Of Many Worlds: Speaking at the International Futures Industry conference in Boca Raton, Florida, Ken Griffin, the founder and CEO of multinational hedge fund Citadel, described the current stock market as a tale of many worlds. He remarked, “You’ve got the Magnificent 7, you’ve got this incredible story that’s just ripping through the equity market about the transformative changes that are coming with AI, and then you’ve got much of the market... priced [at] earnings levels that are far more in line with historical averages, particularly across the industrial base.” Griffin suggested that investors could adopt a bifurcated approach to the market. “So it’s... a moment in time where... in some sense, you can sign up for big bold, you know, these companies that are changing the future, or you can put your money to work in areas of the market where price-earnings ratios are much more in line with historical averages and have a very different risk-reward profile,” he explained. See Also: Best Artificial Intelligence Stocks AI Stock Frenzy: Griffin expressed uncertainty regarding whether certain AI-levered stocks were experiencing frothiness or were on the cusp of a bubble. However, he remained optimistic about Nvidia’s prospects, stating, “The team at Nvidia looks like they’re really on top of their game right now... They’ve done just an incredible job.” He emphasized Nvidia’s significant role in the AI narrative, highlighting the company’s adeptness at capitalizing on this trend. Griffin also noted the diminishing barriers to entry for large-language models, citing Anthropic, an AI startup backed by Google and Amazon, as a notable competitor to OpenAI. “The barriers to the production of a world-class model appear to be somewhat lower than we had thought they were 9 months ago or 12 months ago,” he said. “I don’t know who the next Nvidia is going to be,” Griffin admitted. “I don’t know where AMD is going to land in their race against Nvidia, I don’t know where Intel is going to land. But right now, Nvidia sits in a pretty good position,” he concluded. Nvidia saw a 1.51% increase to $933.04 in premarket trading on Wednesday, according to Benzinga Pro data. Read Next: What Do Nvidia And Inflation Have In Common? Munster Says Their Growth Will Be ‘Higher For Longer’ But ‘Bust Is Going To Be Epic’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}