{
    "title": "2 no-brainer artificial intelligence (AI) stocks (not named Nvidia) to buy \nnow - THE BHARAT EXPRESS NEWS",
    "date": "3/29/2024",
    "url": "https://thebharatexpressnews.com/2-no-brainer-artificial-intelligence-ai-stocks-not-named-nvidia-to-buy-now/",
    "text": " The AI ​​bull market is here.  Stock prices are back at all-time highs, thanks in large part to a new boom in artificial intelligence (AI). The launch of ChatGPT has ignited a race to become the leader in what top CEOs and major investors believe will be the next transformative technology: generative AI. Nvidia, which sells the graphics processing unit (GPU) components that form the backbone of the advanced computing systems needed for AI, is the biggest winner so far.  However, there are several other stocks that are also poised to be winners.  Let’s take a closer look at two of them. Image source: Getty Images. Table of Contents Micron Technologies (NASDAQ:MU) is a leader in memory chips.  Historically, business has been highly cyclical, fluctuating from boom to recession because the semiconductor industry is typically sensitive to supply gluts and demand shifts.  Just a year ago, the company was operating at a big loss as it emerged from the pandemic and the slowdown in demand for PCs and tablets crushed memory chip prices. However, Micron is now emerging as a beneficiary of the AI ​​boom as memory chips play a key role in AI servers.  As Micron management explained during a recent earnings call, demand for AI servers is driving the growth of high-bandwidth memory, which has tightened supply for the DRAM and NAND chips in which Micron specializes. Due to this trend, the company expects DRAM and NAND prices to rise through calendar 2024.  The company now expects record revenue and “strongly improved profitability” in fiscal year 2025. CEO Sanjay Mehrotra also said, “We are in the very early stages of a multi-year growth phase powered by AI as this disruptive technology will transform every aspect of business and society.”  Micron’s memory and storage components are valuable in both training and inference functions for AI algorithms, making Micron a likely winner in the AI ​​space. If the company can generate record revenue in fiscal 2025, it would surpass fiscal 2022’s revenue of $30.7 billion.  At that level, Micron would trade at a price-to-sales ratio of around 4, which is an attractive valuation.  compared to other AI stocks. The story continues Micron also has the potential to be highly profitable, as its operating margin reached 50% in 2019.  If the company’s profitability rises, the stock could go a lot higher from here. Another technology stock that seems well positioned to ride the AI ​​wave is Taiwanese semiconductor manufacturing (NYSE: TSM).  The company, better known as TSMC, is the world’s largest semiconductor foundry.  It handles manufacturing for many of the world’s largest chip designers, including AppleNvidia, BroadcomAnd Advanced micro devices. TSMC has a market share of more than 50% in the third-party chip industry, giving it enormous market power in the semiconductor industry more broadly and in AI chips in particular.  It controls about 90% of the external market for advanced chips, on which AI models rely. Because of its virtual monopoly on third-party chip manufacturing, TSMC is more resilient than a company like Nvidia, which needs to maintain its competitive advantage and pricing power to keep its shares rising.  Chip manufacturing has high barriers to entry, making it unlikely that TSMC’s leadership will be tested in the coming years. Like Micron, TSMC is also emerging from the semiconductor industry’s previous slump, but growth is picking up with the help of AI.  During the first two months of the year, sales increased by 9.4% and sales growth accelerated to 11.3%.  Investors took this as a sign that demand for AI is picking up, as this was a significant improvement from flat revenue growth in the fourth quarter. TSMC is also highly profitable, further proving its competitive advantages and pricing power.  In the fourth quarter, it recorded an operating margin of 41.6%. Finally, TSMC is affordably priced, with a price-to-earnings ratio of 28, and earnings are expected to improve as AI provides a tailwind.  The chip manufacturer was already a very strong company, but its economic position seems to be increasing even more in the AI ​​era. Should You Invest $1,000 in Semiconductor Manufacturing in Taiwan Now? Consider the following before buying shares in Taiwan Semiconductor Manufacturing: The Motley Fool stock advisor The analyst team has just identified what they think is the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them.  The ten stocks that survived the cut could deliver monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including portfolio building guidance, regular analyst updates, and two new stock picks per month.  The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*. View the 10 stocks *Stock Advisor returns March 25, 2024 Jeremy Bowman has positions at Broadcom.  The Motley Fool holds positions in and recommends Advanced Micro Devices, Apple, Nvidia, and Taiwan Semiconductor Manufacturing.  The Motley Fool recommends Broadcom.  The Motley Fool has a disclosure policy. 2 No-Brainer Artificial Intelligence (AI) Stocks (Not Named Nvidia) to Buy Now was originally published by The Motley Fool Save my name, email, and website in this browser for the next time I comment.   Δ "
}