{
    "title": null,
    "date": "3/19/2024",
    "url": "https://www.moneycontrol.com/news/business/markets/wall-street-advances-with-nvidia-and-fed-meeting-in-focus-12490401.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Wall Street's three major indexes closed higher on Tuesday after shares in hotshot chipmaker Nvidia shook off early losses and investors looked ahead to the Federal Reserve's policy meeting conclusion on Wednesday for clues on interest rate policy. Shares in Nvidia pulled out of the red to close up 1% after it revealed pricing and shipment plans for its hotly anticipated Blackwell B200 artificial intelligence chip, which it says could be 30 times faster than current chips. Michael James, managing director of equity trading at Wedbush Securities in Los Angeles attributed Tuesday's overall gains to improving sentiment after Nvidia's shares turned around along with ongoing bullishness about the economy's direction. \"You're continuing to see money go into the market and not just technology,\" said James. \"It certainly helps when you're seeing the large cap tech names today like Nvidia show relative strength from where they opened. But it's continuing the overall bullish theme that's been going on since the year started.\" At 04:15 p.m. the Dow Jones Industrial Average rose 320.33 points, or 0.83% , to 39,110.76, the S&P 500 gained 29.09 points, or 0.56%, to 5,178.51 and the Nasdaq Composite gained 63.34 points, or 0.39%, to 16,166.79. The Dow Jones Industrial Average outpaced its Wall Street peers, supported by a 2% gains in Home Depot and advances of more than 1% in both McDonald's and Apple Inc. In the S&P 500's 11 major industry sectors only communications services lost ground and that ended down just 0.2% after an almost 3% rally on Monday. Energy led gains, rising 1.1% as oil prices rose. Investors were preparing a day ahead of the Fed's policy update, including a press conference from Chair Jerome Powell. Robust inflation data has pulled back bets for the first rate cut in June to about 59% from about 69% at the start of last week, according to the CME FedWatch Tool. \"There's optimism that the Fed's not going to surprise us a lot on Wednesday,\" said Gene Goldman, chief investment officer at Cetera Investment Management. \"We think three cuts are still on the table.\" But, Goldman still sees Powell reminding the market that he is cautious about inflation and that policy will depend on economic data and expects the central bank to update its inflation and economic growth projections. Among other movers, crypto-exchange operator Coinbase Global fell almost 4% while miner Riot Platforms fell almost 3% along with a 5% slide in bitcoin. MicroStrategy shares fell 5.7% after the company announced it had completed a $603.75 million convertible debt offering - its second in a week - to fund bitcoin purchases. AI server maker Super Micro Computer shares tumbled just under 9% after it announced it will sell 2 million shares that could fetch about $2 billion. Spire Global shares soared 30.4% after it announced a collaboration with Nvidia for AI-driven weather prediction. Advancing issues outnumbered decliners by a 2.25-to-1 ratio on the NYSE, which showed 286 new highs and 53 new lows. On the Nasdaq, 2,517 stocks rose and 1,768 fell as advancing issues outnumbered decliners by about a 1.42-to-1 ratio and it recorded 98 new highs and 126 new lows. The S&P 500 posted 49 new 52-week highs and one new low. On U.S. exchanges 10.74 billion shares changed hands compared with the 12.37 billion average for the last 20 sessions. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}