{
    "title": "Family Legacy Inc. Has $309000 Holdings in NVIDIA Co. (NASDAQ:NVDA)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/family-legacy-inc-has-309000-holdings-in-nvidia-co-nasdaqnvda.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Family Legacy Inc. grew its position in shares of  NVIDIA Co. (NASDAQ:NVDA – Free Report) by 12.6% during the fourth quarter, according to its most recent disclosure with the Securities and Exchange Commission. The institutional investor  owned 624 shares of the computer hardware maker’s stock after purchasing an additional 70 shares during the quarter. Family Legacy Inc.’s holdings in NVIDIA were worth $309,000 as of its most recent SEC filing. A number of other hedge funds have also recently made changes to their positions in NVDA. United Bank raised its position in shares of  NVIDIA by 28.9% during the first quarter. United Bank now owns 7,717 shares of the computer hardware maker’s stock worth $2,106,000 after acquiring an additional 1,730 shares during the last quarter.  Mirae Asset Global Investments Co. Ltd. increased its holdings in  NVIDIA by 6.8% in the first quarter. Mirae Asset Global Investments Co. Ltd. now owns 3,904,772 shares of the computer hardware maker’s stock worth $1,065,457,000 after purchasing an additional 249,045 shares in the last quarter.  MAS Advisors LLC increased its holdings in  NVIDIA by 42.1% in the first quarter. MAS Advisors LLC now owns 1,967 shares of the computer hardware maker’s stock worth $545,000 after purchasing an additional 583 shares in the last quarter.  Navis Wealth Advisors LLC increased its holdings in  NVIDIA by 205.3% in the first quarter. Navis Wealth Advisors LLC now owns 2,900 shares of the computer hardware maker’s stock worth $791,000 after purchasing an additional 1,950 shares in the last quarter.  Finally, Ergoteles LLC bought a new stake in  NVIDIA in the first quarter worth approximately $929,000. 65.27% of the stock is owned by institutional investors and hedge funds. In related news, Director Mark A. Stevens sold 35,648 shares of the stock in a transaction that occurred on Wednesday, January 10th. The stock was sold at an average price of $542.93, for a total value of $19,354,368.64. Following the transaction, the director now owns 1,189,083 shares of the company’s stock, valued at $645,588,833.19. The sale was disclosed in a legal filing with the SEC, which can be accessed through the SEC website. In other news, Director Mark A. Stevens sold 35,648 shares of the stock in a transaction on Wednesday, January 10th. The stock was sold at an average price of $542.93, for a total transaction of $19,354,368.64. Following the completion of the sale, the director now owns 1,189,083 shares in the company, valued at approximately $645,588,833.19. The sale was disclosed in a document filed with the SEC, which is accessible through the SEC website. Also, insider Donald F. Robertson, Jr. sold 450 shares of the firm’s stock in a transaction on Friday, January 5th. The stock was sold at an average price of $484.62, for a total value of $218,079.00. Following the completion of the transaction, the insider now owns 50,961 shares of the company’s stock, valued at approximately $24,696,719.82. The disclosure for this sale can be found here. Insiders have sold a total of 105,352 shares of company stock valued at $64,853,077 over the last quarter. 3.99% of the stock is owned by corporate insiders. Shares of NVDA opened at $903.56 on Friday. NVIDIA Co. has a 12 month low of $262.20 and a 12 month high of $974.00. The company has a current ratio of 4.17, a quick ratio of 3.67 and a debt-to-equity ratio of 0.20. The business’s fifty day simple moving average is $772.45 and its two-hundred day simple moving average is $574.01. The company has a market cap of $2.26 trillion, a price-to-earnings ratio of 75.68, a P/E/G ratio of 1.30 and a beta of 1.73. NVIDIA (NASDAQ:NVDA – Get Free Report) last issued its quarterly earnings data on Wednesday, February 21st. The computer hardware maker reported $5.16 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $4.21 by $0.95. NVIDIA had a return on equity of 93.61% and a net margin of 48.85%. The business had revenue of $22.10 billion for the quarter, compared to the consensus estimate of $20.40 billion. During the same period in the prior year, the business posted $0.65 earnings per share. The company’s quarterly revenue was up 265.3% compared to the same quarter last year.  Research analysts anticipate that  NVIDIA Co. will post 22.45 earnings per share for the current fiscal year. The company also recently disclosed a quarterly dividend, which was paid on Wednesday, March 27th. Investors of record on Wednesday, March 6th were paid a $0.04 dividend. The ex-dividend date  was Tuesday, March 5th. This represents a $0.16 annualized dividend and a yield of 0.02%. NVIDIA’s dividend payout ratio (DPR) is currently 1.34%. A number of brokerages have commented on NVDA. HSBC raised their price objective on NVIDIA from $880.00 to $1,050.00 and gave the company a “buy” rating in a research note on Monday, March 18th. Bank of America lifted their target price on NVIDIA from $925.00 to $1,100.00 and gave the company a “buy” rating in a research report on Wednesday, March 13th. Piper Sandler lifted their target price on NVIDIA from $850.00 to $1,050.00 and gave the company an “overweight” rating in a research report on Wednesday, March 20th. CICC Research started coverage on NVIDIA in a research report on Wednesday, March 6th. They set an “outperform” rating and a $870.00 target price on the stock. Finally, Oppenheimer lifted their target price on NVIDIA from $850.00 to $1,100.00 and gave the company an “outperform” rating in a research report on Wednesday, March 20th. Four research analysts have rated the stock with a hold rating, thirty-seven have assigned  a buy rating and one  has given a strong buy rating to the stock. According to MarketBeat.com, the stock  has a consensus rating of “Moderate Buy” and an average target price of $908.68. Read Our Latest Stock Report on NVIDIA (Free Report) NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications.  Want to see what other hedge funds are holding NVDA? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for NVIDIA Co. (NASDAQ:NVDA – Free Report).   Receive News & Ratings for NVIDIA Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for NVIDIA and related companies with MarketBeat.com's FREE daily email newsletter. DeDora Capital Inc. Trims Stock Holdings in Alphabet Inc. (NASDAQ:GOOG) NVIDIA Co. (NASDAQ:NVDA) Shares Sold by Columbia Trust Co 01012016 "
}