{
    "title": "Wall Street Favorites: Why Analysts Love These 3 Blue-Chip Stocks",
    "date": "3/12/2024",
    "url": "https://investorplace.com/2024/03/wall-street-favorites-why-analysts-love-these-3-blue-chip-stocks/",
    "text": " It's only natural the best of the best blue-chip stocks receive analyst accolades Advertisement Source: Shutterstock We’ve all heard of blue-chip stocks. Some companies immediately spring to mind: IBM (NYSE:IBM), Johnson & Johnson (NYSE:JNJ) and Goldman Sachs (NYSE:GS) are just a few traditional, old-line blue chips. But what exactly is a blue-chip stock? While there is no definition written in stone, blue-chip stocks tend to possess certain common characteristics: The following three companies are some of the bluest blue-chip stocks on the market. Wall Street loves its prospects for growth now and well into the future. Although Nvidia (NASDAQ:NVDA) might not be the first stock you think of as a blue-chip, it checks all the boxes for size, success, industry leadership and respect. For investors, it doesn’t hurt that NVDA stock is rampaging up the charts. Everyone is probably feeling a bit thankful it took a breather and fell 5% to end last week. There are only so many superlatives you can heap on a company. Yet Wall Street expects Nvidia to continue on this upward trajectory for some time. There is no limit to how much demand artificial intelligence (AI) generates for high-performance semiconductors. As the leading manufacturer of AI chips for data centers and networks, Nvidia is grabbing the limelight and has a vast market share. Analysts peg its share of the graphics processing unit (GPU) market at 80%. Even as Advanced Micro Devices (NASDAQ:AMD) and others introduce their own competing chips, they are not expected to dent Nvidia’s armor. Analysts forecast NVDA stock to grow earnings at a 36% compounded annual growth rate (CAGR) for the next five years. That’s only slightly slower than the 48% CAGR Nvidia’s been growing at for the last five years. With a “strong buy” recommendation and a high-end target price of $1,200 per share, this chipmaker is on a blue streak for further gains. Mastercard (NYSE:MA) is much more in line with the type of blue-chip stock investors think of. Yet despite being founded in 1966, the credit card processing company didn’t go public until 2006. Since then, MA stock has generated over 10,000% returns for investors compared to the measly 320% returns of the S&P 500. There’s no reason that growth can’t continue. Although Mastercard is the second largest payments processor behind Visa (NYSE:V), Wall Street has a better outlook for its stock. Analysts forecast long-term earnings growth at a 19% CAGR versus 13% for its rival. These aren’t recession-proof stocks, but they are resistant. Economic downturns cause people to rein in their spending, dampening growth. However, recessions tend to be short-term events compared to the subsequent growth. Analysts say we’re deep into the late phase of the expansion cycle and recession typically follows. So we can see share price softness soon. Yet that only allows investors to swoop in and pick up MA stock at a discount. Because Mastercard doesn’t lend money, its downside is protected. The branded credit cards don’t expose the payment processor’s finances to delinquencies or defaults. There remains a long runway of growth still to come. Meta Platforms (NASDAQ:META) is another stock that is not front-of-mind when discussing blue-chips, but like Nvidia, it ticks all the boxes. It is the largest social media platform in the world, with over 3 billion monthly active users (MAU) on Facebook alone. Meta has nearly 4 billion MAU across Facebook, Instagram and WhatsApp. It is the reason Meta is a digital advertising powerhouse. The pandemic caused advertisers to pull back on their ad spending, which caused META stock to fall. However, the reopened economy has advertisers understanding they must go where the people are. Today that is Meta’s various platforms. Ad revenue jumped 25% from the year-ago period as digital ad impressions rose 21%. It should grow even higher going forward as this is an election year and ad spending tends to skyrocket. Although that suggests a hangover in 2025, it would allow investors to buy shares on any stock softness. Analysts give it a “strong buy” rating and a high-end target price of $575 per share. However, with long-term earning growth forecasts of 26% annually, almost twice as fast as the past five years, it is easy to see why analysts love Meta Platforms. On the date of publication, Rich Duprey held a LONG position in JNJ stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Rich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets. Blue-Chip Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/wall-street-favorites-why-analysts-love-these-3-blue-chip-stocks/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}