{
    "title": "Up 18% YTD, Is Oracle Stock Overvalued?",
    "date": "3/15/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/NVDA-Q/pressreleases/24821509/up-18-ytd-is-oracle-stock-overvalued/",
    "text": "Shares of cloud computing giant Oracle (ORCL)surged over 12% in a single trading session following its quarterly results earlier this week, bringing its year-to-date gains to roughly 18.9%. Along with a bottom-line beat, investors responded with enthusiasm to Oracle's hints about a potential partnership with AI chip giant Nvidia (NVDA), with CEO Safra Katz saying \"we expect to have some very nice joint announcements with Nvidia next week\" on the earnings call. Valued at $345 billion by market cap, Oracle stock has now more than doubled in the last five years, easily outpacing the broader markets in this period. Let’s see if it makes sense to invest in Oracle stock at the current valuation. Oracle (ORCL) was founded more than four decades ago, making it one of the oldest tech companies in the U.S. It gained massive traction on the back of its enterprise-facing database management software. Over the years, it has expanded its portfolio of products and services, entering other expanding addressable markets. For instance, in 2016, it introduced the Oracle Cloud Infrastructure (OCI), which enables companies to migrate their business operations to the cloud. Today, it is looking to offer the data center infrastructure to power artificial intelligence (AI) workloads, which will be a key driver of top-line growth in the upcoming decade. In late 2023, Oracle emphasized it is rapidly expanding existing data centers to meet widening demand among AI customers. The company believes its GPU cluster technology helps its clients develop AI models at a lower cost compared to peers, resulting in solid demand. Oracle ended fiscal Q3 of 2024 with 40 new bookings worth over $1 billion that are yet to be executed, providing investors and the company with near-term revenue visibility. The company reported revenue of $13.3 billion in fiscal Q3 (ended in February), an increase of 7% year over year. However, sales from its OCI business surged 49% to $1.8 billion. This business accounts for just 13.5% of total sales, but its enticing growth rates will mean it will be a major revenue driver for Oracle going forward. In fact, Oracle expects this business segment to grow by more than 50% in fiscal 2024 and beyond. Oracle’s AI bookings stood at $80 billion in Q3, rising 29% year-over-year, showcasing the expanding demand for computing capacity. Oracle’s focus on cost savings and operational efficiencies allowed it to increase adjusted earnings by 27% to $0.85 per share, or $2.4 billion, up from $1.9 billion, or $0.68 per share, in the year-ago period. The software giant's improving profit margins and cash flows should help it support dividend growth, too. It currently offers shareholders an annualized dividend of $1.60 per share, indicating a yield of 1.25%. These payouts have risen at an annual rate of 17% in the last 12 years. Out of the 26 analysts covering Oracle stock, 14 recommend “strong buy,” and 12 recommend “hold.” The average target price for ORCL stock is $129.75, indicating an upside potential of 3.7%. The low target price for Oracle stock is $100, while the high target price is $160 - a premium of about 28% to current levels. Analysts tracking the stock now expect adjusted earnings to grow from $5.12 per share in fiscal 2023 to $5.59 per share in fiscal 2024, with continued growth to $6.23 per share in fiscal 2025. So, ORCL stock is priced at 20 times forward earnings - which is not too expensive, given earnings growth is forecast at 11% annually in the next five years. Provided Content: Content provided by Barchart. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Nvidia Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}