{
    "title": "Here's Why I Might Change My Mind and Buy Nvidia Stock",
    "date": "3/5/2024",
    "url": "https://www.fool.ca/2024/03/05/heres-why-i-might-change-my-mind-and-buy-nvidia-stock/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Nvidia stock (NASDAQ:NVDA) has surged in share price. But even so, there is a reason I’d get back in. Image source: Getty Images Nvidia (NASDAQ:NVDA) has literally been the stock to beat these days. Surged isn’t even the word for how this company has performed in the last year or so. Yet as I’ve written recently, the spike has led to a share price that is way out of my comfort zone. Even still, there are some reasons that I might change my mind. So let’s get into why it might be a good idea to stick on the sidelines for now, but what could change to cause a buy situation for Nvidia stock. Look, if you’ve got tens of thousands of dollars and this fits in your risk portfolio, by all means go and buy Nvidia stock. Yet if you’re like me and have bills to pay, very hungry children to feed, and a home to care for, these decisions aren’t made lightly. And that’s been the case for Nvidia stock. Sure, I’m watching it climb higher, but it’s now up 266% in the last year alone. This is just outrageous. And what’s more, it’s not the only company in the space either. Nvidia stock faces competition from established players moving forward, as well as emerging players. So we could end up seeing this put pressure on margins and market share. Then there are macroeconomic factors. The markets have been sensitive to any bad news, including earnings. While recent earnings were excellent, a bad report could easily send shares spiralling. In fact, before earnings the company lost a huge amount of market share before bouncing back. Then there are two huge factors. First, limited income generation. Nvidia stock offers a very small dividend, and doesn’t repurchase a lot of shares. So investors looking for income or capital appreciation will need to look elsewhere. Furthermore, its cash flow is volatile, and this can be a concern as well for those wanting consistent performance. Still, there could be some consistency coming as the company continues to see high demand and growth. This comes from its investment in artificial intelligence, data centres, and gaming. The demand in these areas is expected to continue rising, and Nvidia stock is prepared for it. Nvidia stock is well known for its innovation, making what it has even better. And now, its earnings have proven the demand remains high. Revenue was up 22% from the quarter before at US$22.1 billion and 265% from the year before! Plus, earnings per diluted share hit US$5.16, up 28% from last quarter and 486% from 2023 levels! Full-year revenue hit US$60.9 billion, up 126% from 2023. These results were far higher than estimates. The company remains convinced that long-term growth is here, and the market seems to reflect this. However, there are certain items I’d watch for to decide whether Nvidia stock is a buy. For instance, a stock split could come down the line at these levels. Earnings reports could signal more long-term growth, along with product launches and innovations. Still, if you’re like me, you may want an even less risky option. If you’re like me and want something less risky, I would instead consider investing in an exchange-traded fund (ETF) that invests directly in Nvidia stock, among others. This would include an ETF such as the BMO Global Innovators Active ETF Series (TSX:BGIN). This fund screens for companies involved in the development of innovative products, processes, or services that will shape the next decade. Right now there is a focus on artificial intelligence, as well as biotechnology, semiconductors, and automation. The fund has been an excellent performer, and holds a reasonable expense ratio at just 0.75% as of writing. It can be risky given its investment in innovators, but overall has done quite well. Since coming on the market last year, shares are up 33%! So you can still get in on that growth, with far less risk. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 15, 2024 | Joey Frenette Shopify (TSX:SHOP) stock has been pulling back of late, opening up a window for dip buyers. Read more » March 15, 2024 | Amy Legate-Wolfe These growth stocks have already proven their worth this year, but are solid investments for long-term holders as well. Read more » March 15, 2024 | Amy Legate-Wolfe Nvidia (NASDAQ:NVDA) stock has surged in share price, but so has this stock, with a far lower share price to… Read more » March 15, 2024 | Brian Paradza, CFA Unveiling the Code: Should you Buy, Hold, or Sell Constellation Software (TSX:CSU) stock at current levels? Read more » March 15, 2024 | Nicholas Dobroruka Growth investors should have these two tech stocks high up on their watch lists. Read more » March 14, 2024 | Karen Thomas, MSc, CFA Well Health stock has been hit, but the company remains on a path of record-breaking revenues as it approaches positive… Read more » March 14, 2024 | Amy Legate-Wolfe CSU stock (TSX:CSU) may be the priciest stock on the TSX today, but there is a very good reason for… Read more » March 13, 2024 | Amy Legate-Wolfe CSU stock (TSX:CSU) has surged in the last year, yet even if growth slows by half, you could create immense… Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}