{
    "title": "10 fascinating facts about Nvidia CEO Jensen Huang, who has a company \ntattoo and dozens of direct reports",
    "date": "3/25/2024",
    "url": "https://ca.style.yahoo.com/10-fascinating-facts-nvidia-ceo-130001403.html",
    "text": "We've rounded up the best long weekend Amazon deals at every price point. Nvidia cofounder and CEO Jensen Huang is on track to be one of the richest people in the world. But there's more to the tech CEO than his wealth. Here are 10 surprising facts about Huang, from his Nvidia tattoo to his staggering number of direct reports. Jensen Huang, the CEO and cofounder of Nvidia, is leading the charge towards an AI future — with his company making billions. Just last week, the chip giant reported $22.1 billion in revenue in the fourth quarter, far exceeding Wall Street's expectations. Companies are racing to get their hands on Nvidia's graphic processing units, or GPUs, to power their AI. Meanwhile, Huang's fortune has soared. The CEO, who's been nicknamed the \"Godfather of AI,\" is now worth $69.4 billion as of February 25, according to Bloomberg's Billionaires Index. He is now on track to be one of the richest people in the world. But Huang is known for more than just starting a successful company. Here are some surprising facts about how the CEO got his start and his management style: Huang's aunt and uncle accidentally sent him and his brother to Oneida Baptist Institute in Kentucky when he was a kid, thinking it was a prep school, he told Wired in 2002. \"The kids were really tough,\" Huang told NPR in a 2012 interview. \"They all had pocket knives — and when they get in fights, it's not pretty. Kids get hurt.\" Huang also had to clean bathrooms as part of the school's work requirement, NPR reported. The CEO introduced himself to Lori, his now wife, in an electrical engineering class at Oregon State University in the '80s. They were lab partners. \"I had a great pickup,\" he told HP in a recent interview. \"I asked her if she wanted to see my homework.\" The married couple now have two kids. In 1993, Huang met up with his friends Chris Malochowsky and Curtis Priem at a Denny's in California to discuss a new business idea: starting a graphics company. \"We brainstormed and fantasized about what kind of company it would be and the world we could help. It was fun,\" he told Stanford University's engineering school in a 2010 interview. He worked part-time at the diner chain as an \"incredibly shy\" college student, he previously told the New York Times. Waiting tables, he said, helped \"pull me out of my shell.\" The CEO agreed to get inked when Nvidia's stock price hit $100 per share. He recalled \"crying like a baby.\" \"My kids were with me, and they're like, 'Dad, you've gotta control yourself,'\" he told Fortune in 2017 when describing the process. He said he won't be getting another tattoo. \"It hurts way more than anybody tells you,\" Huang told HP in a recent interview. \"I'm happy that my wife and daughter dresses me,\" Huang said when asked about his signature look during an interview for HP's online show \"The Moment.\" Huang's aesthetic has gotten so popular that some online sellers have sold knockoffs using the CEO's name and image on Amazon, Jacketpop, and Wilson Jackets. The dozens of employees working under Huang, he said, keep him in the loop on what's going on across the company. \"The more direct reports the CEO has, the less layers are in the company,\" Huang said during an interview at the 2023 DealBook Summit. \"It allows us to keep information fluid, allows us to make sure that everyone is empowered by information.\" \"Our company just performs better because everybody's aligned, everybody is informed of what's going on,\" he added. The CEO's emails —typically only a few words long — seem to come off as brusque, the New Yorker reported. One executive told the magazine Huang's emails read like haikus. Another executive compared his emails to ransom notes. One employee said that interacting with Huang feels like \"sticking your finger in the electric socket,\" according to the New Yorker, The leader of the $1.98 trillion company, as of Monday, said he just can't shake the feeling his chip empire might one day fall given the challenges his business has faced in the past. \"I think when you build a company from the ground up, and you've experienced real adversity, and you really experienced nearly going out of business several times, that feeling stays with you,\" Huang said during the 2023 New York Times DealBook Summit. He said he grapples with that fear first thing in the morning. \"I don't wake up proud and confident,\" Huang said. \"I wake up worried and concerned.\" Huang said that starting Nvidia was \"a million times harder than I expected it to be.\" \"At that time, if we realized the pain and suffering and just how vulnerable you're going to feel, and the challenges that you're going to endure, the embarrassment and the shame, the list of all the things that go wrong, I don't think anybody would start a company,\" the CEO said on an October 2023 episode of the tech podcast \"Acquired.\" \"Nobody in their right mind would do it,\" he added. \"I'll do my own stunts,\" he joked in the HP interview. Read the original article on Business Insider Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era.  \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con  \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret.  They soft-launched their relationship at the supermodel's cookbook event in Miami. The \"Late Night\" comedian brutally summed up the former president's media company. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. "
}