{
    "title": "Forget Nvidia: 2 Artificial Intelligence (AI) Stocks With More Upside to \nBuy Now, According to Wall Street",
    "date": "3/6/2024",
    "url": "https://finance.yahoo.com/news/forget-nvidia-2-artificial-intelligence-094500520.html",
    "text": "Nvidia shares skyrocketed 263% over the past year amid a flurry of excitement about artificial intelligence (AI). But Wall Street isn't counting on an encore performance over the next year. In fact, analysts see Amazon (NASDAQ: AMZN) and Atlassian (NASDAQ: TEAM) as better AI stocks to buy right now. Specifically, Nvidia carries a median 12-month price target of $850 per share, implying 3% upside from its current price of $823 per share. But Amazon's median price target of $205 per share implies 15% upside from its current price of $178 per share. And Atlassian's median price target of $255 per share implies 22% upside from its current price of $209 per share. That does not mean Nvidia is a bad investment. Those price targets are educated guesses about what might happen in the next 12 months. Even if Nvidia underperforms during that time period, the stock could still outperform over the next five years. But investors shouldn't fixate on one AI stock. The most prudent way to benefit is to spread money across multiple AI stocks. With that in mind, Amazon and Atlassian warrant further consideration. Amazon reported strong results in the fourth quarter, pairing impressive top-line growth with improved profitability. Revenue increased 14% to $170 billion due to momentum in retail and advertising services, and a sequential acceleration in cloud computing revenue. The company also reported GAAP net income of $1.00 per diluted share, up from $0.03 per diluted share in the prior year. Investors can expect similar momentum in the future given that Amazon is a major player in three quickly growing markets: e-commerce, digital advertising, and cloud computing. Specifically, the company operates the most popular online marketplace as measured by monthly visitors. Amazon is the third-largest ad tech company worldwide. And Amazon Web Services (AWS) is the leading provider of cloud infrastructure and platform services. Additionally, Amazon is executing on a sensible growth strategy that could drive share gains across all three businesses. In e-commerce, the company recently transitioned from a national fulfillment network to regional hubs that reduce costs and hasten delivery times. In digital advertising, Amazon recently introduced a generative artificial intelligence (AI) tool that automates marketing content creation for brands. And in cloud computing, the company is leaning into growing demand for AI with new products like Bedrock, CodeWhisperer, and Amazon Q. To elaborate, Bedrock is a cloud service that streamlines the development of generative AI applications. CodeWhisperer is an AI-enabled coding companion that helps developers work more productively. And Amazon Q is an AI-enabled business assistant that automates a wide variety of tasks, from drafting social media posts to summarizing information. Going forward, online retail sales are expected to increase at 8% annually through 2030, while ad tech and cloud services revenue is projected to grow at 14% annually during the same period. That gives Amazon a good shot at double-digit sales growth through the end of the decade. Indeed, Wall Street expects the company to grow sales at 11% annually over the next five years. Against that consensus estimate, the current valuation of 3.2 time sales appears reasonable. Long-term investors should consider buying a small position in this growth stock right now. The difficult macroeconomic environment has weighed on Atlassian, but encouraging financial results in the second quarter suggest the headwinds are diminishing. Revenue increased 21% to $1 billion and non-GAAP net income increased 65% to $189 million. Management also said free-to-paid customer conversions stabilized and customers added paid seats more quickly. Unfortunately, the stock dropped sharply following the report as investors reacted (or possibly overreacted) to cautious guidance. Artificial intelligence could be a material tailwind for Atlassian in the coming years. The company sells work management and IT service management software that helps organizations plan, track, and complete projects, especially complex projects like the development of AI applications. On that front, Atlassian is well positioned to capitalize on demand given its status as a leader in enterprise service management and enterprise agile planning software. Additionally, Atlassian has introduced a suite of AI features called Atlassian Intelligence. It lets users draft text, summarize information, surface insights, and automate tasks across its platform with natural language. The company also integrated virtual agent technology into its IT service management software to automate IT support interactions. Those features not only create new monetization opportunities, but also make existing products more compelling. Michael Cannon-Brookes, co-founder and co-CEO, said Atlassian Intelligence had a \"fantastic customer reception.\" Atlassian said its software addressed a $29 billion market growing at 14% annually in 2022, implying a market opportunity that now exceeds $37 billion. Wall Street analysts expect the company to grow sales at 22% annually over the next five years. That consensus estimate is sensible given the tailwinds behind the business, and it makes the current valuation of 13.8 times sales appear reasonable. Investors should consider buying a small position in this growth stock today. Should you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Amazon and Nvidia. The Motley Fool has positions in and recommends Amazon, Atlassian, and Nvidia. The Motley Fool has a disclosure policy. Forget Nvidia: 2 Artificial Intelligence (AI) Stocks With More Upside to Buy Now, According to Wall Street was originally published by The Motley Fool Related Quotes "
}