{
    "title": null,
    "date": "1/22/2024",
    "url": "https://investorplace.com/market360/2024/01/nvidia-hits-new-records-is-it-still-a-buy/",
    "text": " Although AI stocks are bouncing back, there is one company in particular that has really outperformed… Advertisement Source: Evolf / Shutterstock.com If there is one word to describe the tech-heavy NASDAQ’s performance this year, it would be volatile. The NASDAQ slipped more than 3% lower in the first trading week of the New Year, with many of 2023’s market leaders (i.e., AI stocks) leading the way down. The Global X Robotics & Artificial Intelligence ETF (BOTZ), which tracks AI stocks, plunged more than 5% in the first trading week of 2024 but is now up slightly for the year. You can see how much the ETF swung around in the chart below…  Although AI stocks are bouncing back, there is one company in particular that has really outperformed… I’m talking about NVIDIA Corporation (NVDA). The reality is NVDA has rebounded with a vengeance – hitting record high after record high in the past two weeks. (This includes a new record intraday high of $595 yesterday!) Given NVDA’s incredible run so far, folks have asked me if the stock is a buy, or if it’s all downhill from here. So, in today’s Market 360, I’ll answer that question. I’ll show you what my Portfolio Grader also says about the stock… as well as share where you can find the AI stocks I like right now. Let’s jump right in. The simple answer: Yes! I’ve said it before, and I’ll say it 100 times more: NVIDIA is the best AI stock on the market right now. The reality is NVIDIA is a major player in the computer hardware arena. It is a leading computer graphics company, making graphic processing units (GPUs) for consumers and businesses. It has over 7,000 patents relating to computer graphics, the largest portfolio of its kind. The company has been in the computer graphics business for more than two decades – it invented the GPU in 1999 – so it is a well-established player. Since 2014, the company has shifted its focus to five major markets – gaming, professional visualization, data centers, auto and artificial intelligence. NVIDIA was hurt by the White House’s stricter regulations on AI chips shipped to China, as NVIDIA is a leading supplier to the Chinese market. However, as I expected, NVIDIA recently announced that it still plans to introduce AI chips in China in the near term. The company plans to launch new AI chips that are compliant with the U.S.’s new restrictions in the second quarter of 2024. NVIDIA shares rallied about 10% in response to the announcement last week. But what was more impressive to me was the analyst community’s response: They revised estimates significantly higher in the past three months. For its fourth quarter in fiscal year 2024, analysts now forecast earnings to surge 367% year-over-year to $4.11 per share, compared to previous estimates of $3.70 per share three months ago. For its first quarter in fiscal year 2025, NVIDIA’s earnings are also expected to soar 339.8% year-over-year to $4.31 per share. That’s up from estimates for $3.89 per share three weeks ago. I should also add that full-year 2024 and 2025 earnings estimates were also revised higher. The stock continued its rally this week, surging another 8.7%. But that shouldn’t come as a surprise to those who follow my Portfolio Grader. Not only does it hold an A-rating in my Portfolio Grader, but it’s been rated a “buy” since February of last year. Those who had bought NVIDIA when my Portfolio Grader first upgraded NVIDIA to a “buy” would have doubled their money on NVIDIA during that time.  That’s a great return, but it doesn’t come close to the return NVIDIA holds in Growth Investor.  It’s up an incredible 1,300% since I added it to my Growth Investor Buy List in May 2019.  The bottom line: I think we’ve only seen the beginning of NVIDIA has to offer. Yes, a lot of AI stocks have soared, but let’s be clear… NVDA is still only trading for about 29 times earnings estimates for the next quarter. That’s extremely reasonable for such a high-growth company, folks. And, as we discussed, it also boasts phenomenal fundamentals. Now, while NVIDIA is my favorite AI stock, it’s not the only AI stock I like right now. There are several others – all of which I recommend in Growth Investor. Each one boasts fantastic fundamentals and is poised to act like rocket fuel for your portfolio. In fact, one of my AI stocks surged more than 30% today after upping its guidance for its second quarter in fiscal year 2024 on Monday afternoon. I recommended this stock in Growth Investor in May 2023 and it’s already up 92% in eight months! So, if you want to make sure your portfolio is filled with the best AI stocks – as well as fundamentally superior stocks in other sectors – then join me at Growth Investor today. You’ll receive instant access to all my Buy List stocks, as well as all my Growth Investor Monthly Issues, Weekly Updates, Special Market Podcasts – and much more. Click here to become a member now. (Already a Growth Investor subscriber? Go here to log in to the members-only website.) Sincerely,  Louis Navellier The Editor hereby discloses that as of the date of this email, the Editor, directly or indirectly, owns the following securities that are the subject of the commentary, analysis, opinions, advice, or recommendations in, or which are otherwise mentioned in, the essay set forth below: NVIDIA Corporation (NVDA)   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/nvidia-hits-new-records-is-it-still-a-buy/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Hot Stocks Stocks to Buy Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}