{
    "title": "7 Tech Stocks Destined to Follow in Nvidia's Footsteps",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/news/7-tech-stocks-destined-nvidia-223659763.html",
    "text": "Following the remarkable ascent of Nvidia (NASDAQ:NVDA) last year, it’s only natural for investors to consider the top tech stocks to buy for 2024. Yeah, I suppose that NVDA could again be a winner. It’s off to a great start and the underlying generative artificial intelligence sector should only blossom from here. Still, it’s risky to target just the usual suspects. While NVDA delivered blistering returns in 2023, most of the upside performance came in the first half. That’s not to say that the second half was a bust. However, the print was comparatively disappointing as other tech stocks to buy stole the limelight. Further, it’s only natural that astute investors will seek underappreciated ideas rather than heavily hyped ones. To that effect, going for enterprises that might not be on everyone’s radar could be ideal. After all, you would theoretically be dealing with a lower baseline from which to extract profitability. On that note, below are top tech stocks to buy in the new year. InvestorPlace - Stock Market News, Stock Advice & Trading Tips Source: JHVEPhoto / Shutterstock.com When it comes to chipmakers, Intel (NASDAQ:INTC) used to be on everyone’s radar. However, after many years of struggles, challenges and missteps, Intel lost ground to its competitors. In some ways, Intel has become the poor man’s Intel. And sure enough, analysts are skeptical (as they should be). INTC is billed as a hold with a $44.33 average price target. When analysts imply downside with their price projections, that’s a worrying proposition. However, I believe that bearish options traders are tempting fate when it comes to INTC. By selling high volumes of call options, these pessimists are setting themselves up for an obligatory risk. If they had merely bought puts, the risk is defined: the loss of principal. By selling calls, if the trade goes against the bears, they’re on the hook for contract fulfillment. In other words, they may be forced to buy shares at the open market, only to sell them at the (lower) strike price. That’s an ugly proposition because anyone can look up options flow data to see how the bears are positioned. From a speculative standpoint, I’d say INTC is one of the tech stocks to buy, not sell. Source: Sundry Photography / Shutterstock.com Regarding unusual ideas for tech stocks to buy, Fortinet (NASDAQ:FTNT). Now, I personally think the company is awfully relevant. However, that’s not really the assessment on Wall Street. While shares printed a positive return in 2023, the overall performance was choppy. Also, analysts – while assigning shares as a moderate buy – peg the price target at $57.25. Again, we’re talking implied downside. To me, that doesn’t make a whole lot of sense. As a cybersecurity specialist, the addressable market should expand, not contract. Right now, revenue for the cybersecurity market is projected to hit $183.1 billion by year’s end. However, McKinsey & Company sees a global addressable market which may reach up to $1.5 trillion to $2 trillion. Plus, everyone can see the consequences of lax cybersecurity protocols. Last year, more than a few major enterprises suffered data breaches, resulting in serious financial damages. Given the vast importance of the sector, I would say FTNT is one of the top tech stocks to consider. Source: T. Schneider / Shutterstock.com Moving onto Archer Aviation (NYSE:ACHR), I wouldn’t call the company an underappreciated idea. Specializing in the development and manufacturing of electric vertical takeoff and landing (eVTOL) aircraft, Archer has made significant progress. I’d say that it’s likely the best-positioned enterprise in the burgeoning air mobility space. But with shares more than doubling last year, some questions arise. Is it really one of the tech stocks to buy in 2024 or is this the year sentiment fizzles out? Conspicuously, ACHR hasn’t enjoyed the most auspicious of starts. Still, analysts regard the business highly, rating shares a consensus strong buy. In addition, their average price target lands at $8.13. Plus, the maximum price target is $10. In my opinion, that’s a credible target. According to MarketsandMarkets, the eVTOL segment reached a valuation of $1.2 billion last year. Further, the sector could hit $23.4 billion by 2030, representing a compound annual growth rate (CAGR) of 52%. I’d say that’s reason enough to rank ACHR as one of the tech stocks to buy for speculation purposes. Source: shutterstock.com/Jarretera Yes, I can go with another blockchain-mining specialist but I’m going to double dip with Canaan (NASDAQ:CAN). Why? When you look at most other blockchain miners, their performance has been absolutely phenomenal. However, CAN has been muted. Further, even with the recent upswing in the cryptocurrency market, at time of writing, CAN was down on a 52-week basis. That might not seem encouraging when talking about top tech stocks. But here’s the deal. Canaan isn’t exactly a blockchain miner. Instead, it manufactures the specialized hardware that blockchain miners use to do their business. However, many blockchain networks have migrated their transactional protocols from proof of work (which emphasizes raw computing power) to proof of stake (which emphasizes network “loyalty”). While that does seem a downer for CAN stock, it’s important to remember that several cryptos use PoW protocols. Also, PoS (Proof of Stake) protocols are unproven relative to PoW (Proof of Work), raising long-term questions. Analysts agree, pegging shares a consensus moderate buy with a $4.25 price target. Source: Andrzej Puchta / Shutterstock.com Moving onto the truly speculative ideas for tech stocks to buy, Planet Labs (NYSE:PL) intrigues because of its space economy play. Specifically, the company designs and manufactures miniature satellites called Doves which are delivered into orbit as secondary payloads on other rocket launch missions. From there, each Dove features a high-powered telescope, enabling groundbreaking earth images. Beyond just the scientific relevance, Planet Labs offers critical solutions for agriculture. By assessing the ground from a bird’s eye view, farmers can make more informed choices about operations and infrastructural expansion. In addition, the company facilitates military and defense-related services. Nowadays, you can’t hide from the satellites. Such intel can be useful across various geopolitical functions. Further, Mordor Intelligence points out that the satellite-based earth observation market reached a valuation of $11.35 billion last year. By 2028, this segment could be worth $18.75 billion, representing a CAGR of 10.56%. Analysts also rate shares a consensus strong buy with a $4.74 average price target. Source: Wirestock Creators / Shutterstock.com To be clear, Rent the Runway (NASDAQ:RENT) isn’t exactly a pure-play idea for tech stocks to buy. However, the company does offer a creative e-commerce platform, providing a subscription-based service for renting (or buying) designer brand apparel and accessories. Think of it like Netflix (NASDAQ:NFLX) for fashionistas. So in that sense, I suppose it is a tech play. However, Rent the Runway is extremely speculative and risky. In the trailing year, RENT lost about 81% of equity value, which is stunning. At the same time, RENT stock has rocketed higher in recent sessions. The reason? Fundamentally, the company is undergoing a restructuring plan, which involves layoffs of 10% of the company’s workers. Still, what’s really driving sentiment could be a squeezing phenomenon. As I explained in my Barchart article, RENT could fly until at least the end of next week. How so? Bullish contrarians are trying to blow up sold calls expiring Jan. 19 featuring a $1 strike price. At the moment, it’s around 70 cents. So, a few big pushes and suddenly, the bears may find themselves panicking. That would be brilliant for optimistic gamblers. Source: T. Schneider / Shutterstock.com One of the more disappointing companies overall, NuScale Power (NYSE:SMR) specializes in small modular reactors. While it’s also not a pure-play example of top tech stocks, NuScale leverages various technologies to bring improvements to nuclear energy. Specifically, by using smaller, pre-fabricated modules leveraging passive safety systems – which rely on natural forces like gravity and convection for cooling – the company is able to deliver nuclear power reliably and safely. Also, a key advantage that NuScale’s SMRs wield is its light-water technology. By relying on proven and well-understood protocols similar to existing reactors, the company can minimize fuel development and regulatory hurdles. That said, investors haven’t been convinced (obviously). Also, a short-seller report blasted the enterprise for inking a contract with a data center service provider that has little chance of execution. Still, with so much interest in zero-emission directives, nuclear energy will likely play a role. And that could help NuScale in the long run thanks to the modular nature of SMRs. Long story short, these facilities can be integrated in areas inaccessible to traditional nuclear powerplants. It’s super-risky but analysts rate shares a moderate buy with a whopping $13 price target. On the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. A former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors The post 7 Tech Stocks Destined to Follow in Nvidia’s Footsteps appeared first on InvestorPlace. Related Quotes "
}