{
    "title": "To the Metaverse and Beyond! 3 Stocks to Buy for the New Digital World",
    "date": "1/11/2024",
    "url": "https://investorplace.com/2024/01/to-the-metaverse-and-beyond-3-stocks-to-buy-for-the-new-digital-world/",
    "text": " Explore the top metaverse stock picks for 2024 and beyond Advertisement Source: Chaosamran_Studio/Shutterstock The metaverse is working to revolutionize the world, including sectors like entertainment and education. Here we look at the top metaverse stock picks for 2024 and beyond. The concept of the metaverse has evolved in recent years into a tangible near-term reality pursued by major companies such as Meta Platforms (NASDAQ:META) (formerly Facebook) and decentralized autonomous organizations. The metaverse seeks to blur the boundaries between physical and digital realities. This development presents new revenue opportunities for a diverse range of participants, including retail investors, gamers, digital collectors, and developers. Along these lines, metaverse stock picks discussed below offer a solid exposure to this next-gen technology. While gaming has already incorporated elements of the metaverse, its potential applications extend to various consumer realms. The metaverse could revolutionize entertainment and education, offering immersive experiences that go beyond traditional learning methods. American users engaging in social media, streaming, and gaming collectively dedicate approximately 11 billion days annually to consuming digital media. Additionally, they invest around 14 billion days each year in watching traditional linear television. This substantial amount of time holds the potential to shift towards the metaverse in the future. “We think the metaverse is most likely going to be a next-generation social media, streaming, gaming and shopping platform,” Morgan Stanley (NYSE:MS) Internet analyst Brian Nowak said. “In some ways, we already live in a metaverse, as shown by the total time spent by daily active users in the U.S. on digital platforms.” Despite its promising prospects, it’s crucial to recognize that the metaverse is still in its early stages, and its actual value proposition remains untested. Investments in this space should be approached with caution, considering the speculative and high-risk nature of the metaverse’s current development. Here are the metaverse stock picks investors should consider for 2024 and beyond. Meta Platforms, is an internet titan that operates various platforms, including Facebook, Instagram, and WhatsApp. Meta Platforms is actively involved in exploring the metaverse. With initiatives like Horizon Workrooms and the development of virtual reality experiences, Meta is working towards creating immersive online environments. In 2023, the company made significant strides in its long-term investments in artificial intelligence (AI) and the metaverse. These two futuristic technologies showed notable progress and, more importantly, began to converge. Generative AI, a key focus for Meta, found its way into popular applications, while mixed reality became central to a mass-market headset. Notably, the integration of AI into Ray-Ban Meta smart glasses allows for a perspective-altering experience. Meta is reportedly planning to launch its initial smart glasses featuring a display in 2025, coupled with a neural interface smartwatch designed for control. These smart glasses aim to offer users a comprehensive augmented reality (AR) experience. In addition, Meta envisions the release of its first fully-fledged AR glasses in 2027. According to recent reports, Meta’s Reality Labs – a segment that hosts all metaverse-focused projects – now lost more than $21 billion since the beginning of 2022. Roblox (NYSE:RBLX), established in 2006, stands as an online metaverse platform enabling gamers to craft and share virtual worlds within the Roblox community. Over the years, Roblox has experienced substantial growth, becoming a prominent platform for user-generated content and social interaction in the virtual gaming space. In November, Roblox disclosed a surge in performance, with 70.2 million average daily active users (DAUs), marking a 20% YoY increase. The company reported a loss per share of 45 cents, surpassing the expected 51 cents loss. Revenue, measured as bookings, reached $839 million, exceeding the projected $830 million. In FQ2, users clocked over 16 billion hours on Roblox, reflecting a substantial 20% YoY uptick. Despite a net loss of $277.2 million for the quarter ending Sept. 30, an improvement is evident compared to the $297.8 million loss reported for the same period in 2022. The company reported a consistent year-over-year figure, stating that the average bookings per daily active user remained unchanged at $11.96. Nvidia (NASDAQ:NVDA), a global leader in graphics processing unit (GPU) development and AI computing, remains a significant investor in the metaverse. As the company continues to generate massive cash flow, it allows it to innovate in GPUs for consoles, laptops, and PCs, serving various applications. Bank of America (NYSE:BAC) recently projected that NVDA could generate $100 billion in FCF over the next 2 years. The Omniverse platform, designed by the company, provides users with an array of tools and features for creating and customizing virtual worlds and experiences. Omniverse is a collaborative real-time 3D graphics platform that leverages technologies such as Universal Scene Description (OpenUSD), RTX, and generative AI. This platform empowers application developers to design, implement, and oversee sophisticated 3D applications and pipelines across diverse industries. Back in 2023, Nvidia teamed up with Microsoft (NASDAQ:MSFT), with the latter working to align itself with Nvidia’s internet services for creating hyper-realistic virtual worlds, Omniverse Cloud, and the AI supercomputing service, Nvidia DGX Cloud. Omniverse Cloud enables the construction and operation of immersive virtual environments, while DGX Cloud provides enterprises with immediate access to infrastructure and software for training advanced models in generative AI. On the date of publication, Shane Neagle did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Shane Neagle is fascinated by the ways in which technology is poised to disrupt investing. He specializes in fundamental analysis and growth investing. Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/to-the-metaverse-and-beyond-3-stocks-to-buy-for-the-new-digital-world/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}