{
    "title": "2 Top Artificial Intelligence (AI) Stocks That Could Go Parabolic in 2024",
    "date": "1/2/2024",
    "url": "https://www.fool.com/investing/2024/01/02/2-top-artificial-intelligence-ai-stocks-that-could/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Following the launch of OpenAI's ChatGPT, generative artificial intelligence (AI) has taken the market by storm, helping send the S&P 500 Index up 25% year to date. Industry leaders such as Nvidia (NVDA 0.12%) and Advanced Micro Devices (AMD 0.50%) have been key in helping power the rally because of their fast-growing chip businesses. Let's discuss why 2024 could be even more exciting for these two AI-related stocks. With shares up a jaw-dropping 246% in 2023, Nvidia is arguably the biggest winner in 2023's AI gold rush. And unlike some other AI companies, its operating performance has surged to match the hype. It isn't too late for investors to bet on Nvidia's continued success because of its reasonable valuation and spectacular margins. Nvidia's business is shifting from lower-value gaming hardware to high-performance AI chips. And that shift is transforming its operations. Third-quarter revenue increased by 206% year over year to a record of $18.12 billion, while net income surged by 1,259% to $9.2 billion. This is partially because of a dramatic rise in margin as the company sells more expensive data center chips like the H100, which can cost as much as $30,000 per unit. Nvidia is also tackling other growth opportunities like China, where U.S. trade restrictions limit the import of some of its most advanced hardware. To comply with the rules, the company has launched slower versions of its Nvidia RTX4090 gaming chip, specifically for Chinese consumers. This move follows a November announcement of plans to develop AI chips customized for the Chinese market. With a forward price-to-earnings (P/E) growth rate of just 25, Nvidia stock is relatively cheap compared with its projected growth over the next 12 months. To put that number in context, the S&P 500 trades for an average of 26. With Nvidia making boatloads of money from its data center chip business, its biggest rival, AMD, is vying for a piece of the opportunity through advanced AI hardware of its own. And while the chipmaker has yet to report significant gains from these efforts, investors can look forward to seeing the business scale up rapidly in 2024 and beyond. According to AMD's CEO Lisa Su, the market for AI-capable chips will surge tenfold to $400 billion by 2027. To take advantage of the opportunity, the company released the MI300 family of AI chips, which can outperform Nvidia's flagship H100 on key metrics like memory space and inference (running AI platforms). Image source: Getty Images. So far, AMD's new products have had no significant impact on the company's performance. Third-quarter revenue increased only 4% to $5.8 billion. However, analysts are optimistic that its new chips will see large-scale deployment in 2024, leading to significant revenue growth. AMD's valuation is nowhere near as good as Nvidia's, considering its significantly lower growth rate in the near term. In fact, with a forward price-to-earnings (P/E) multiple of 39, its shares are more expensive than its larger rival. However, the situation could change as AMD's AI efforts start supercharging its operating performance. While Nvidia and AMD are about to enter direct competition in the market for the most advanced AI hardware, that doesn't mean one company has to lose for the other to win. As mentioned, AMD's management believes the market for AI chips will surge more than tenfold to $400 billion. That figure is more than 20 times Nvidia's trailing 12-month revenue, leaving plenty of room for both companies to sell these products as fast as they can produce them, even if the market reaches only a fraction of those lofty estimates. Both stocks can continue their bull runs in 2024 and beyond.  Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}