{
    "title": "Global Jitters: 3 Stocks to Sell Amid Rising Geopolitical Tensions",
    "date": "1/26/2024",
    "url": "https://investorplace.com/2024/01/global-jitters-3-stocks-to-sell-amid-rising-geopolitical-tensions/",
    "text": " Geopolitical tensions could affect these global stocks to sell Advertisement Source: Shutterstock Inflation has come a long way, and cuts to the Federal Funds rate are expected for the latter half of 2024, but geopolitical tensions are hotter than they have been in a while. Geopolitical tensions between the United States and China, as well as renewed conflict in the Middle East, including the Israel-Hamas War and U.S.-led bombing in Yemen, could either benefit or seriously dent investors’ portfolios if they’re not vigilant. Below are three global stocks to sell as geopolitical tensions continue to flare. The recent challenges Apple (NASDAQ:AAPL) has faced over the years are already well-known. Revenue growth in its key product lines has slowed dramatically and consistently, casting doubt on the company’s future growth prospects. The mobile handset market is at capacity. Consumer demand for smartphones is decreasing as they lose novelty with each iteration. However, another reason investors should be particularly wary of AAPL stock is the uncertainty of the China market, which accounted for about 19% of Apple’s revenue at the end of its fiscal year 2023. The United States and China’s geopolitical tensions have risen ever since the Trump presidency initiated a trade war against the world’s second-largest economy. These strained relations have not been improved under the current U.S. administration. Meanwhile, Huawei’s launch of the Mate 60 Pro with an advanced chip, has galvanized many Chinese consumers to favor it over the new iPhone amidst geopolitical tensions. According to a report by Bloomberg in late October, Apple’s iPhone 15 sales were still behind the predecessor, largely due to the resurgence of Huawei’s flagship device. If we were to examine the winners and losers of geopolitical, Apple would definitely be classified as a loser. That could weigh on its shares for years to come. Nvidia (NASDAQ:NVDA) dominates in both gaming GPUs and AI chips. The GPU maker had an 81% market share of AI chips used in cloud and data centers. Moreover, the chipmaker’s CUDA platform also provides a unified framework for developers to create and run AI applications on its GPUs. The advanced chipmaker has been at the will of geopolitical currents since the United States disallowed the sales of Nvidia’s advanced chips to the Chinese as a way to blight the growth of China’s semiconductor industry. In response, Nvidia offered Chinese companies a slower Nvidia chip, but, so far, this particular GPU has not garnered many buyers. Nvidia recently announced a $1 billion deal to provide India-based companies with its AI chips. While this may soften the blow dealt to Nvidia initially, the demand from China’s market for advanced AI chips is likely higher than that of India’s. Lack of access to the world’s second-largest economy could hurt Nvidia in the future and investors wanting to avoid geopolitical conflicts from damaging their portfolio might want to consider trimming their long-term positions in Nvidia. Apple’s failure to design and implement its own wireless modem into its devices incited positive investor sentiment for Qualcomm (NASDAQ:QCOM) shares in the latter half of 2023. Coupled with that was news Apple would continue using Qualcomm’s wireless modems until 2026, spurring optimism regarding Qualcomm’s prospects. However, as I have written before, geopolitical tensions between the world’s two largest economies can only cast a dark cloud over Qualcomm’s future earnings. Huawei’s release of Huawei Mate 60 Pro, with a 7-nanometer system on a chip (SoC) designed and manufactured, could eventually lead to Qualcomm being unseated as the dominant player in SoCs used by Chinese phone manufacturers. Furthermore, the wireless modem on the Huawei Mate 60 Pro also reached fast 5G speeds. This event, in and of itself, should worry any Qualcomm investor. On the date of publication, Tyrik Torres did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Tyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/global-jitters-3-stocks-to-sell-amid-rising-geopolitical-tensions/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}