{
    "title": "Nvidia Stock's $905 Technical Direction (NASDAQ:NVDA)",
    "date": "1/25/2024",
    "url": "https://seekingalpha.com/article/4664965-nvidia-stock-905-dollar-technical-direction",
    "text": "jiefeng jiang/iStock via Getty Images  jiefeng jiang/iStock via Getty Images Nvidia Corporation (NASDAQ:NVDA) is leading the AI-accelerated healthcare revolution, with its advanced GPUs contributing significantly to sector advancements. Generating over $1 billion in annual GPU computing revenue, Nvidia is tapping into a $250 billion market, offering AI applications in medical imaging and drug discovery. In light of Nvidia's recent 27% stock price surge since our last publication, our investment thesis continues to evolve positively. Our previous upgrade from \"Hold\" to \"Buy\" was premised on aligning Nvidia's P/E ratio with its 5-year historical average, signaling robust fundamental health and market confidence. Fast forward to today, Nvidia's P/E ratio, currently around 81, remains low compared to mid-term averages, coupled with rising ROE and increasing EPS estimates, reaffirming our bullish stance. Additionally, developing from our earlier fundamental analysis-based \"Buy\" rating, we now adopt a more technical approach to upgrade our rating to a \"Strong Buy.\" Anticipating further upward momentum in Nvidia's stock, we recognize the possibility of market fluctuations and have set a target price of $905 by the end of 2024. Finally, we anticipate possible short-term resistance around the $712 mark, and investors should watch these levels as they may offer strategic entry or exit points. Conversely, we identify $505 and $435 as crucial mid-term support levels. Hence, these thresholds represent opportune moments for stock accumulation, suggesting that dips around these values could benefit long-term investors. Data by YCharts Nvidia's leads into AI-accelerated healthcare have positioned the company for prolonged growth in the healthcare and medical industries. For instance, Nvidia's GPUs (like H100 Tensor Core) have become integral (by targeting AI-based drug discovery and accelerated drug development) to healthcare, with customers and partners collectively spending over 1 billion dollars annually on Nvidia GPU computing. This suggests that a substantial portion of Nvidia's top line is derived from the healthcare sector. The widespread adoption of Nvidia's GPU technology (like DGX SuperPOD) signals the company's capitalization on the computational demands of medical applications, from advanced imaging to AI-driven drug discovery estimated at $250 billion addressable market, internal estimate). The AI-accelerated healthcare represents a significant growth opportunity for Nvidia's top line, with a 37% annual growth rate (CAGR). The company expects rapid ($10s billion) revenue inflow from the sector in the upcoming years (latest estimates as of FY24 end of January). Both external and internal estimations are aligned, providing a high possibility for massive growth. Fundamentally, the large revenue multiplications expected in the coming years will position healthcare revenue as a key fraction of Nvidia’s top line. With a gross margin rate of nearly 75%, the revenue inflow will boost the stock price based on a boom line improvement. The thesis is already in motion as a market response immediately integrated the information for the announcements on January 8 (for the healthcare-focused revenue projections shared at the J.P. Morgan Healthcare Conference). Not surprisingly, the market response was so robust that it breached a months-long consolidation in the stock price on the same date. precedenceresearch.com precedenceresearch.com Additionally, the use of GPUs in healthcare may serve as a vital fundamental growth factor for the company in high-performance computing for advancing medical research and applications. Technically, Nvidia's GPUs are known for their parallel processing capabilities, making them ideal for image reconstruction in CT scans and molecular dynamics simulations. Nvidia's involvement (beyond GPUs) in accelerated healthcare can be observed on the Clara and BioNeMo platforms. For instance, these GPUs and platforms are used in cryo-electron microscopy, X-ray crystallography, gene sequencing, amino acid structure prediction, and virtual drug molecule screening. As the tech expert Vlad Susanu highlighted, Nvidia's collaboration with Intuitive Surgical has advanced robotic surgery precision through the RTX A6000 GPUs. Specifically, Nvidia's Clara Parabricks also accelerates genetic analysis, leading to personalized chemotherapy treatments and improved patient outcomes. These advancements are a part of Nvidia's broader impact on personalized medicine, promising more effective treatments with fewer side effects. Hence, Nvidia continues to drive healthcare innovation, focusing on future breakthroughs in drug discovery with quantum computing, developing patient \"virtual twins,\" and enhancing telemedicine. Additionally, AI models are widely applied in cryo-electron microscopy and gene sequencing. Cryo-electron microscopy, for instance, has become a vital tool in structural biology, allowing researchers to visualize biological macromolecules at near-atomic resolution. Applying GPU acceleration to such techniques breeds new top-line growth factors for the company in complex biological structures. NVIDIA-Accelerating-Healthcare NVIDIA-Accelerating-Healthcare At the ground level, Nvidia has an expanding collaboration with a growing number of tech-bio companies and partners leveraging BioNeMo. The participation of major players such as Amgen (AMGN), Deloitte, and Recursion (RXRX) demonstrates the industry's reliance on Nvidia as an enabler of AI-driven healthcare solutions. In detail, Recursion is the first partner offering a foundation model through BioNeMo. Recursion uses Phenom-Beta, a vision transformer model for extracting biologically meaningful features from cellular microscopy images. Similarly, Amgen plans to build AI models for novel human data insights and drug discovery using Nvidia DGX SuperPOD. The application of AI models trained on one of the world's largest human datasets, a system named Freyja, highlights the depth of Nvidia's relevance to cutting-edge research. The goals of building a human diversity atlas for drug target and disease-specific biomarker discovery showcase the potential of AI-driven insights. Nvidia BioNeMo's role in accelerating the computer-aided drug discovery ecosystem is pivotal for its widespread adoption based on a decisive reduction in time to train (for AI models). With a growing collection of pre-trained biomolecular AI models, including those for protein structure prediction, sequence generation, molecular optimization, and generative chemistry, BioNeMo brings precision to AI-accelerated drug discovery. Hence, BioNeMo's easy-to-access APIs for inference and customization indicate BioNeMo's user-friendly approach, making it accessible to a broad range of stakeholders. There are diverse applications across companies, such as Terray Therapeutics, Innophore, Insilico Medicine, and OneAngstrom. NVIDIA-Accelerating-Healthcare NVIDIA-Accelerating-Healthcare For instance, Terray Therapeutics integrates BioNeMo cloud APIs to develop a generalized, multi-target structural binding model. Similarly, the integration by OneAngstrom into its SAMSON platform for molecular design and Deloitte's transformation of scientific research using BioNeMo on Nvidia DGX Cloud with the Quartz Atlas AI platform provide examples of the diverse applications and industry-wide impact of Nvidia's generative AI platform. Looking forward, 97% of companies plan to invest more in AI technologies, whereas Nvidia's continued investment in technologies like BioNeMo, with a focus on identifying additional use cases, optimizing workflows, and increasing infrastructure spending, positions the company to drive massive long-term revenue in the AI-driven drug discovery industry. Fundamentally, these developments suggest Nvidia's technology is not confined to a specific niche (data center or gaming) but extends to various domains (automotive, healthcare, and financial), indicating its products' fundamental versatility and adaptability. For instance, the financial services industry is also experiencing rapid adoption of AI, with 91% of companies either assessing or already using it in production. Nvidia's enabler role in providing the underlying technology for these AI implementations positions the company to attain rapid growth in its top line. Historically, the core of Nvidia's solid performance lies in its Data Center segment, which witnessed a substantial surge. For instance, in Q3, data center revenue, driven by the Nvidia HGX platform and InfiniBand networking, reached $14.5 billion (+279% year-over-year) relative to $18.12 billion in total revenue (+206% year-over-year). This accounted for a significant portion of the overall revenue, highlighting the company's overreliance on the success of its data center offerings. The same factor can be observed in the Q4 fiscal 2024 outlook, where revenue is expected to be $20 billion (+233.70% year-over-year), data centers will drive strong growth, and gaming will likely decline sequentially. While a robust data center segment has been a key growth driver for Nvidia, it also poses a vulnerability. The company's rapid growth potential is tethered to the sustained demand for data center solutions. Any downturn or disruption in this segment could have cascading effects on Nvidia's overall financial health. Overall, the risk lies in the revenue concentration in this segment. The fact that approximately half of Data Center revenue is attributed to consumer internet companies and enterprises suggests the significance of these clients to Nvidia's financial performance. Consequently, a shift in demand dynamics from these companies could impact the company's growth trajectory beyond its control. Q3 Presentation (Overall Revenue) Q3 Presentation (Overall Revenue) Following the previous coverage, the stock price of Nvidia has breached the mid-term resistance to follow an upward trajectory to hit the long-term target. However, the emergence of new fundamentals has led to an upward revision of the target for 2024. NVDA's TA Previous Coverage (tradingview.com) NVDA's TA Previous Coverage (tradingview.com) As per our latest technical analysis, the price of Nvidia may reach $905 by the end of 2024 based on Fibonacci retracement and current momentum. Multiple indicators and factors support this price projection. First of all, the relative strength index (RSI) (stepped black line) is at 80, which generally represents the overbought state of the stock. However, no bearish divergence is emerging, which signals a continued upside considering the strong fundamentals. On the other hand, as per the moving average convergence divergence (MACD), the MACD line (black line) has crossed over the signal line (red line) in recent weeks, which indicates a new course of bullish momentum. In the context of RSI and MACD, this trend can be considered a strong bullish signal. There is a long way to go until the emergence of a bearish divergence and crossover of the MACD line towards the downside. The P/E ratio is still at the mid-term lows, suggesting massive potential based on increasing ROE (stepped green line) quarter over quarter. The continuous increase in EPS estimates (stepped blue line) with a continued reduction in the P/E ratio represents a unique undervalued opportunity where continued bottom-line improvement by the company supports the highest price level. The current P/E of around 80 (bold black line on the price chart) is still in line with the historical long-term average of Nvidia's P/E. Therefore, the current price is still fair. The P/E ratio is still at the mid-term lows, suggesting massive potential based on increasing ROE (stepped green line) quarter over quarter. The continuous increase in EPS estimates (stepped blue line) with a continued reduction in the P/E ratio represents a unique undervalued opportunity where continued bottom-line improvement by the company supports the highest price level. The current P/E of around 80 (bold black line on the price chart) is still in line with the historical long-term average of Nvidia’s P/E. Therefore, the current price is still fair. On the upside, the stock may face short-term resistance near $712 in the coming months. On the downside, $505 and $435 represent mid-term support for the stock, suggesting the ideal zone to accumulate the stock. Specifically, the 2024 target of $905 is a level to book profits partially on long positions. tradingview.com tradingview.com With a robust 24% stock surge and a bullish market outlook, Nvidia Corporation's strategic pivot toward healthcare diversifies its portfolio and sets the stage for long-term financial success. As Nvidia cements its role in AI-accelerated healthcare, investors have a unique opportunity to capitalize on this upward trajectory in a rapidly expanding industry. Author of Yiazou Capital Research Unlock your investment potential through deep business analysis. I am the founder of Yiazou Capital Research, a stock-market research platform designed to elevate your due diligence process through in-depth analysis of businesses. I have previously worked for Deloitte and KPMG in external auditing, internal auditing, and consulting. I am a Chartered Certified Accountant and an ACCA Global member, and I hold BSc and MSc degrees from leading UK business schools. In addition to my research platform, I am also the founder of a private business.  This article was written by Yiannis Zourmpanos is a Charter Certified Accountant, a former corporate auditing consultant and a Fellow Member of ACCA Global with both BSc and MSc degrees. He is also a private business owner. Analyst’s Disclosure: I/we have a beneficial long position in the shares of NVDA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}