{
    "title": "Intel, Nvidia and Micron execs asked to testify by US House China panel",
    "date": "1/12/2024",
    "url": "https://seekingalpha.com/news/4054736-intel-nvidia-and-micron-execs-asked-to-testify-by-us-house-china-panel",
    "text": "tzahiV The House of Representatives' China panel has urged the chief executives of certain U.S. chip manufacturers to testify before Congress, as the panel intensifies its scrutiny of companies with interests in China, the Financial Times reported. This week, the committee sent letters to Intel (NASDAQ:INTC), Nvidia (NASDAQ:NVDA) and Micron Technology (MU), summoning their chief executives to testify, the report noted citing people with knowledge of the matter. The move is a shift by the committee, which has not held hearings with CEOs from any industry since it was formed to intensify Congress' focus on threats from China, the report added. The bipartisan panel had become increasingly interested on having the companies testify after the CEOs of Intel, Nvidia and Qualcomm (QCOM) last year lobbied the U.S. government as it was preparing to toughen semiconductor-related export curbs, according to the report. \"This hearing is a continuation of the committee's oversight work on semiconductor companies and their ties to China, and specifically Intel, Nvidia and Qualcomm since they came to Washington and actively tried to prevent additional semiconductor controls last summer,\" said one person with knowledge of the decision about the sending of the letters. CEO of Intel Pat Gelsinger and his two industry peers, Jensen Huang of Nvidia and Qualcomm’s Cristiano Amon, visited the White House in July last year in an effort to convince officials that their plan to tighten restrictions on the export of cutting-edge semiconductors would cause long-term damage to the US industry. In October 2023, the U.S. brought in new updates to its export restrictions which curbed the sale of chips that Nvidia (NVDA) made for the Chinese market, such as the A800 and H800 chips, as part of Washington's efforts aimed at hindering China's access to advanced semiconductor technology. Last month, Nvidia's (NVDA) CEO Jensen Huang said that the company was working closely with the U.S. government to ensure new chips for the Chinese market are compliant with U.S. export restrictions. The move requesting CEOs to testify will make U.S. groups with interests in China nervous about coming under the congressional spotlight, specially as China is expected to be a focus in this year's presidential election. "
}