{
    "title": "NVIDIA (NVDA) Soars 6% on New AI Chips Rollout at CES 2024",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/nvidia-nvda-soars-6-ai-130100230.html",
    "text": "NVIDIA Corporation NVDA stock rallied 6.5% on Monday after the company unveiled new graphic chips that will bring the power of artificial intelligence (AI) to personal computers (PCs) and laptops. NVIDIA unveiled its groundbreaking GeForce RTX 40 SUPER Series graphic processing units (GPUs), including the RTX 4080 SUPER, RTX 4070 Ti SUPER and RTX 4070 SUPER, representing a significant leap in AI-powered PC experiences. With capabilities designed for gaming, creating and everyday productivity, these GPUs offer unparalleled power and performance. Built on the Ada Lovelace architecture, these GPUs boast up to 52 shader TFLOPS, 121 RT TFLOPS and 836 AI TOPS, setting new standards in gaming realism and AI-enhanced experiences. The RTX 4070 SUPER, starting at $599, promises an exceptional upgrade for PC enthusiasts. NVIDIA Corporation price-consensus-chart | NVIDIA Corporation Quote NVIDIA's Deep Learning Super Sampling (“DLSS”) technology, coupled with ray tracing, revolutionizes visual quality in games like Diablo IV, Pax Dei and Horizon Forbidden West. With DLSS, gamers can experience up to 4x accelerated full ray tracing, ensuring stunning worlds at a click. The GeForce RTX SUPER GPUs redefine AI capabilities on PCs. Featuring specialized AI Tensor Cores delivering up to 836 AI TOPS, these GPUs transform gaming, creating and productivity with their rich software stack. NVIDIA TensorRT optimizes deep learning inference, while TensorRT-LLM (large language models) for Windows significantly accelerates inference performance. For games, AI-driven DLSS enhances in-game immersion, while generative AI applications like Adobe Photoshop benefit from faster processing speeds. NVIDIA Broadcast offers seamless virtual backgrounds and noise removal, enhancing productivity and creative workflows. NVIDIA's recent unveiling of its AI-powered chips at CES 2024 marks a significant stride in its readiness to capitalize on the escalating demand for AI-enabled PCs. After a sales boom during the pandemic, PC manufacturers, including HP Inc. HPQ and Dell Technologies DELL, have been witnessing declining demand due to the reopening of economies, inflationary pressure, rising interest rates and fears of a possible recession. However, they are optimistic about the PC market recovery in 2024, with AI PCs to be a key growth driver. Therefore, both the American PC manufacturers — HP and Dell — are planning to roll out AI PCs to grab the growing opportunities in this category. PC market recovery expectations of HP and Dell coincide with the independent research firm Gartner Inc.’s IT views. During its preliminary data release for third-quarter 2023 global PC shipments, Gartner pointed out that the worst could be over for vendors by the end of 2023, and PC market recovery can be seen in 2024 due to increased demand driven by the PC refreshment cycle. With AI becoming increasingly pervasive across various applications, the quest for more powerful hardware to support these capabilities has intensified. NVIDIA's chips are tailored to cater to this growing demand, promising transformative AI experiences for users. The recently introduced RTX 40 SUPER series chips, engineered with specialized AI Tensor Cores, present a monumental leap in AI capabilities for PCs. This transformative technology isn't limited to gaming. It extends across diverse sectors, facilitating faster deep learning inference, generative AI applications and seamless productivity tools like Adobe Photoshop, among others. Moreover, these chips pave the way for NVIDIA to tap the expansive market of generative AI apps expected to flood PCs. Its TensorRT software and TensorRT-LLM library offer optimized inference performance and accelerate processing speeds for large language models, amplifying the utility and potential of AI-enabled PCs. As the industry increasingly embraces AI-centric computing, NVIDIA's forward-thinking approach and commitment to cutting-edge AI chips position the company as a key player poised to capitalize on the emerging opportunities in the AI-enabled PC landscape. With its newly introduced AI chips, NVIDIA is primed to revolutionize PC experiences, catering to the surging demand for high-performance AI-integrated computing solutions. Currently, NVIDIA and Gartner each carry a Zacks Rank #2 (Buy), while HP and Dell each carry a Zacks Rank #3 (Hold). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report HP Inc. (HPQ) : Free Stock Analysis Report Dell Technologies Inc. (DELL) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Gartner, Inc. (IT) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}