{
    "title": "Nvidia's Rally Casts Spotlight on 2 Leveraged ETFs",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/nvidia-rally-casts-spotlight-2-140719503.html",
    "text": "This article was originally published on ETFTrends.com. Nvidia's stock has nothing but tailwinds blowing behind it and could keep on pushing higher. Leveraged ETFs with a stake in Nvidia are feeling the full weight of the growth potential AI brings. Nvidia's serendipitous run higher isn't all flash and no substance. It has the fundamentals to back up its stock price. “Nvidia got to where it is because of extremely strong earnings and revenue,” said James Demmert, chief investment officer at Main Street Research, via a ThinkAdvisor article. “When a company posts 265% year-over-year revenue growth — like Nvidia did — it deserves a premium valuation.” Of course, when a stock runs this high, prospective investors may be wondering whether they missed the boat. “For investors who don’t own the stock, we would be buying on any weakness,” he noted. “With Nvidia’s stock, there will be corrections and bumps along the way. But the stock will continue to climb the wall of worry.” If Nvidia keeps climbing to the moon, traders can add 50% more exposure to the stock via the Direxion Daily NVDA Bull 1.5X Shares (NVDU). Using the relative strength index technical indicator, NVDU is squarely in overbought territory. That signals it has the full momentum behind it. It also means it could dip at some point when short-term profit takers decide to sell. As mentioned previously, this is where bullish investors can come in and buy into the momentary weakness. While buying the dip is beneficial for long-term investors playing the buy-and-hold strategy, short-term traders can also profit when the stock heads lower. This is available in the inverse version of NVDU — the Direxion Daily NVDA Bear 1X Shares (NVDD). Traders can also use it as a tactical hedge on their bullish position via a pairs trading strategy if a sudden reversal takes place, thereby minimizing potential losses. NVDU data by YCharts Nvidia comprises about 14% of the holdings in the Direxion Daily Robotics, Artificial Intelligence & Automation Index Bull 2X ETF (UBOT), making it the fund's top allocation. As Nvidia continues to trend higher, that should benefit UBOT as well. The double leveraged ETF adds more diversification with allocations to other stocks benefiting from the AI theme that's currently catapulting the overall market higher. UBOT seeks daily investment results that equal to 200% of the daily performance of the Indxx Global Robotics and Artificial Intelligence Thematic Index. That index aims to provide exposure to companies in developed markets expected to benefit from the growing adoption and use of robotics and/or AI. NVDA data by YCharts For more news, information, and analysis, visit the Leveraged & Inverse Channel. POPULAR ARTICLES AND RESOURCES FROM ETFTRENDS.COM SPY ETF Quote VOO ETF Quote QQQ ETF Quote VTI ETF Quote JNUG ETF Quote Top 34 Gold ETFs Top 34 Oil ETFs Top 57 Financials ETFs ETF Prime: Zeno Mercer on Nvidia and More 4Q23 Midstream/MLP Dividend Recap: The Growth Continues VIDEO: ETF of the Week: Columbia EM Core ex-China ETF (XCEM) How Themes ETFs Stands Out in Crowded Market Shipping Costs Hit 15-Month High Amid Safer Sea Routes READ MORE AT ETFTRENDS.COM > Related Quotes "
}