{
    "title": "Nvidia was briefly more valuable than Amazon as AI hype spikes again",
    "date": "2/13/2024",
    "url": "https://www.techradar.com/pro/nvidia-was-briefly-more-valuable-than-amazon-as-ai-hype-spikes-again",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Nvidia overtook Amazon (in terms of market value) for a few hours - a sign of things to come? Nvidia briefly overtook Amazon in terms of market capitalization, fueled by a spike in interest surrounding artificial intelligence. LSEG data reported by Reuters claimed the chipmaker reached a record high of $734.96 per share, giving it a market value of $1.82 trillion, surpassing Amazon’s $1.81 trillion. Nvidia has now returned back to fifth position among the US’s most valuable companies, trailing Microsoft, Apple, Alphabet (Google) and Amazon. With Nvidia share prices rising 231.6% over the past year, and Amazon shares up by a less impressive (but still very healthy) 73.1%, Nvidia may soon overtake the Seattle-based company more permanently. This achievement marks the first time Nvidia has outpaced Amazon in more than two decades, when it 2002 they were both worth less than $6 billion. With Amazon reporting better-than-expected sales last month, thanks to a successful holiday period, investors are waiting for Nvidia to report its most recent quarterly earnings on February 21. Nvidia has positioned itself as a key player in supplying components to technology companies focused on generative AI. However, with companies like Google, Amazon and Meta all exploring their own chips, Nvidia’s success rides on a lot. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Elsewhere in the tech landscape, Microsoft last month surpassed Apple as the world’s most valuable company, and the second to reach a market value of more than $3 trillion. Today, Apple sits below that $3 trillion threshold, after reaching the momentous figure in June 2023. As the AI boom continues, Nvidia’s considerable share of the market highlights the growing significance of technology companies in contributing to the overall global economy, as well as the immense growth potential for companies handling aspects of AI. With several years’ experience freelancing in tech and automotive circles, Craig’s specific interests lie in technology that is designed to better our lives, including AI and ML, productivity aids, and smart fitness. He is also passionate about cars and the decarbonisation of personal transportation. As an avid bargain-hunter, you can be sure that any deal Craig finds is top value! Is self-healing code the next stage of GenAI? Google blocked billions of ads and millions of ad accounts last year for violating its rules Canva won't scrap Affinity's best feature - but subscriptions may be coming By Darren AllanMarch 28, 2024 By Mark WilsonMarch 28, 2024 By Jake GreenMarch 28, 2024 By Alex BlakeMarch 28, 2024 By Sead FadilpašićMarch 28, 2024 By Rob DwiarMarch 28, 2024 By James RogersonMarch 28, 2024 By Kristina TerechMarch 28, 2024 By Lewis MaddisonMarch 28, 2024 By Becky ScarrottMarch 28, 2024 By David NieldMarch 28, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}