{
    "title": "Nvidia: AI bubble won't burst anytime soon",
    "date": "2/26/2024",
    "url": "https://coingeek.com/nvidia-ai-bubble-wont-burst-anytime-soon/",
    "text": " Home » Business » Nvidia: AI bubble won’t burst anytime soon Business   26 February 2024 Nvidia‘s (NASDAQ: NVDA) latest earnings report indicates no sign of the artificial intelligence (AI) wave that many refer to as a bubble–slowing down. The company generated roughly $22.1 billion in Q4 2023, exceeding analyst expectations by over $2 billion. In addition, the company expects to rake in $24 billion in revenue for this current quarter. What is the driver behind the astronomical amount of money Nvidia brought in? The company’s CEO, Jen Huang, credits AI. “Demand is surging worldwide across companies, industries, and nations,” he said, “demand will continue to be stronger than our supply provides through the year, and we’ll do our best [to meet it].” It is no secret that the computer chips that Nvidia—the dominant player in the specialized semiconductor market with roughly 80% market dominance—create are a hot commodity at the moment. Earlier this month, Mark Zuckerberg’s Meta (NASDAQ: META) announced that it would be purchasing more than $9 billion worth of Nivida’s H100 graphics cards to get its overall GPU stockpile to over 600,000 units. The role of computer chips in AI systems Computer chips are a fundamental component of generative AI systems. AI models, especially deep learning models, require a lot of data processing, and computer chips, particularly GPUs, are designed to handle parallel processing tasks efficiently, which is a fundamental aspect of training AI models. These chips can perform thousands of calculations simultaneously, speeding up the training process and content generation. Overall, these chips provide the necessary speed, efficiency, and capacity to handle the complex and data-intensive tasks that AI systems perform, which is why tech giants and AI providers are constantly trying to acquire more of them. Of course, consumers and the users of generative AI systems visibly benefit when companies increase their stockpile and when advancements are made in chip technology. Each of those events results in improved performance of the apps and services that AI providers create. However, even though the users of these systems experience advantages in their lives, thanks to the AI boom, the biggest winners have been the chip companies and the people who invest in them. Semiconductor stocks soar amidst generative AI boom Since the launch of ChatGPT in November 2022, the event that many would consider the beginning of the most recent boom in AI, Nvidia is up over 336%, AMD (NASDAQ: AMD) is up over 140%, and Taiwan Semiconductor (NASDAQ: TSM) is up roughly 60%. “Generative AI has kicked off a whole new investment cycle to build the next trillion dollars of infrastructure of AI generation factories,” Huang said. “We believe these two trends will drive a doubling of the world data center infrastructure installed base in the next five years and will represent an annual market opportunity in the hundreds of billions.” This year alone, Nvidia is up 58% year to date. As Huang mentioned, there is an increasing demand for computer chips but not enough supply to meet that demand, which is just one of the contributing factors that drives up the valuation of these semiconductor stocks. Opting to invest in chip manufacturers rather than AI providers themselves could be referred to as an infrastructure play, or as they allegedly said during the California gold rush, “selling picks and shovels.” Making individual bets on who the winner(s) are when it comes to providing AI tools and services is a relatively high risk, but investing in the infrastructure that all providers need to be successful in the market is a less risky bet that is more likely to generate money no matter what the outcome or output of the AI producers is. Until manufacturers have enough supply to meet the ever-growing demand, you can expect the valuations of these chipmakers to continue increasing. Although AI goods and services providers are currently driving up the demand for computer chips, the success of these companies is a bit of a black box. Although popular media has a spotlight on many of these companies and reports on their every move, it’s not clear if any of them are profitable. Many of their services are still free to use, even though the companies are spending billions to acquire computer chips and train their models. How computer chips are shaping the future Beyond the business-to-business aspect of chip manufacturing, selling, and purchasing, we see these same chips make their way into consumer products. Earlier this year, we witnessed a significant uptick in the amount of consumer AI products. Companies like Samsung began announcing “AI Phones,” companies like LG (NASDAQ: LPL) began promoting “AI TVs,” and companies like Microsoft (NASDAQ: MSFT) began announcing “AI PCs,” all with hardware–chips–that specialize in executing the AI functionalities that each of their products have. Outside of consumer goods, we are seeing both old and new tech companies bring their AI offerings to market. In addition to Meta’s announcement about its significant investment in AI, the company has unveiled its vision for AI and launched a generative AI image tool. Earlier this year, we saw Microsoft plant their flag when it comes to AI, running a Super Bowl commercial and adding a new button to their keyboard for the first time in nearly 30 years solely dedicated to their onscreen AI assistant ‘Co-pilot.” We are currently experiencing a surge in AI capabilities powered by advanced computer chips. On what seems like a weekly basis, AI tools are being released that are aimed at making users more productive and efficient. Thanks to AI, it is now cheaper and faster than it ever was before to bring an idea to fruition, as we are seeing with OpenAI’s recently announced Sora. This has unleashed an unprecedented pace at which individuals and businesses can iterate and innovate, which sets the stage for further technological breakthroughs. In order for artificial intelligence (AI) to work right within the law and thrive in the face of growing challenges, it needs to integrate an enterprise blockchain system that ensures data input quality and ownership—allowing it to keep data safe while also guaranteeing the immutability of data. Check out CoinGeek’s coverage on this emerging tech to learn more why Enterprise blockchain will be the backbone of AI. Watch: Turning AI into ROI width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"> New to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology. Google is transforming Fitbit users' access to health information with AI, announcing the upcoming release of a personalized LLM tailored explicitly for the app with a wide range of functionalities. After launching its tokenized gold for institutional users in November 2023, the bank is now expanding the HSBC Gold Token to retail users in Hong Kong. After its success in Southeast Asia, Animoca Brands is entering Saudi Arabia's Web3 gaming market, announcing a strategic plan to boost the local ecosystem and provide opportunities to startups. Join the official Bitcoin SV Discord channel: www.discord.gg/bsv "
}