{
    "title": null,
    "date": "2/6/2024",
    "url": "https://markets.businessinsider.com/news/stocks/nvidia-tesla-stock-price-market-cap-huang-musk-ai-microchips-2024-2",
    "text": "       Nvidia's stock surge in 2024 has boosted its value by about $500 billion — close to Tesla's entire market value. The graphics-chip maker's shares have soared 40% this year, lifting its market value by $489 billion to $1.7 trillion at Monday's close. It's now threatening to overtake Amazon and Alphabet to become the third-most valuable US company after Microsoft and Apple. In contrast, shares of Elon Musk's Tesla have tumbled 27% this year, slashing the EV maker's market value by $214 billion to $576 billion. That's only $86 billion more than Nvidia's market-cap gain in just over five weeks of trading this year. Nvidia shares climbed another 2%, and Tesla shares dropped a further 2%, in premarket trading on Tuesday. If those changes hold, the gap between Nvidia's year-to-date rise in market cap and Tesla's market value will shrink to less than $50 billion. The semiconductor giant's market cap has more than quadrupled since the start of last year. Investors are wagering it will be one of the biggest beneficiaries of the artificial-intelligence boom, which has already supercharged demand for its chips. The $500 billion rise in Nvidia's market value this year is striking in both speed and magnitude. Only about a dozen US public companies are worth more. Nvidia has added roughly a JPMorgan's ($504 billion) worth of value in under six weeks, and its gain exceeds the likes of Walmart ($454 billion) or Exxon ($406 billion) in size. Similarly, Nvidia's total market cap of $1.7 trillion dwarfs corporate titans like Mark Zuckerberg's Meta ($1.2 trillion), Warren Buffett's Berkshire Hathaway ($848 billion), Eli Lilly ($670 billion), and Visa ($554 billion). The fact that Nvidia commands double the market cap of Berkshire might seem shocking, as the chipmaker generated only $18 billion of revenues in its last reported quarter, compared to Berkshire's $93 billion. However, the pair posted similar operating profits ($10.4 billion versus $10.8 billion), and Nvidia is growing much faster. Notably, Nvidia's stock leap has enriched its largest shareholders. Cofounder and CEO Jensen Huang's net worth has swelled by an estimated $17 billion this year to hit $61 billion, ranking him 22nd on the Bloomberg Billionaires Index and third in year-to-date gains. He's now wealthier than two heirs to the Mars fortune, worth $48 billion each, and just behind commodity tycoon Charles Koch ($63 billion). Read next Indices Commodities Currencies Stocks Jump to "
}