{
    "title": "Nvidia Is Now Worth More Than Berkshire Hathaway, Tesla, and AMD Combined. \nBut Will It Last?",
    "date": "2/12/2024",
    "url": "https://www.fool.com/investing/2024/02/12/nvidia-is-now-worth-than-berkshire-hathaway-tesla/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) was the best-performing stock in the entire S&P 500 last year. As of Feb. 7, it is also the best-performing stock so far this year. At first glance, this accomplishment sounds like Nvidia simply sustained its momentum when the calendar year flipped, which it did. But keep in mind that Nvidia, like the rest of the S&P 500, had a 0% year-to-date performance on the morning of Jan. 1. After surging by 238.9% in 2023, Nvidia is already up an additional 41.6% in 2024. Put another way, it is up 379.7% since Dec. 31, 2022. I have never seen a company the size of Nvidia follow up a banner year with such a swift and sudden spike. In fact, Nvidia is now worth more than Warren Buffett-led Berkshire Hathaway, electric vehicle leader Tesla (TSLA -2.25%), and its fellow semiconductor giant Advanced Micro Devices -- combined. But for those considering adding Nvidia to their portfolios now, the real questions are whether the growth stock can continue its rally and whether it's worth buying at today's levels. Image source: Getty Images. The only price move that I can think of that comes anything close to what we are seeing with Nvidia is what Tesla did in 2020, when it gained 743.4% in a single calendar year, boosting its market cap from $75.5 billion to $677.4 billion. However, Nvidia has topped even Tesla in terms of value creation. At the end of 2022, Nvidia had a market cap of $359.5 billion. As of Feb. 7, Nvidia's market cap is $1.73 trillion. So, in a little over 13 months, Nvidia added $1.37 trillion to its market cap, roughly double what Tesla did in a similar time. It's not an exaggeration to say that Nvidia's combination of percentage gain and market cap gain is changing the market. Nvidia now accounts for 4.1% of the value of the SPDR S&P 500 ETF Trust, an ETF that mirrors the performance of the S&P 500. It's also 5% of the Invesco QQQ ETF, which tracks the performance of the Nasdaq 100. Every time someone buys $10,000 in an S&P 500 index fund, they are also investing $400 in Nvidia. That's a big deal, and it's contributing to making the market more tech-heavy than ever before. There's no denying that Nvidia's business is putting up phenomenal numbers.  NVDA Revenue (TTM) data by YCharts. Its top- and bottom-line growth is extraordinary. Its operating margin is also incredibly high, as Nvidia is pocketing 46 cents in operating income from each dollar in sales. Investors think the performance will improve, as customers can't get enough of Nvidia's products to power their artificial intelligence (AI) aspirations. The danger for Nvidia isn't how the business is doing -- it's the pressure that investors are putting on the stock. The higher Nvidia goes before the fundamentals can catch up to the valuation, the greater the risk that Nvidia becomes a \"story stock.\" With a 92.6 price-to-earnings ratio, some may argue it already is one. A story stock is a company whose valuation is based entirely on a story, or what it could become in the future rather than what it is today. Tesla did this in 2020 when it posted the incredible 743% return mentioned earlier. But Tesla largely lived up to the hype, as its revenue and bottom-line growth have been incredibly strong. Sure, the business has slowed recently. But overall, it has been an impressive period for Tesla, the company. Tesla the stock, however, is actually down by more than 20% from where it traded at the end of 2020.  TSLA data by YCharts. The stock's more recent underperformance is largely because investors were willing to pay such a high price for Tesla before it delivered its stunning results. When Tesla did that in 2021, 2022, and 2023, investors had already priced that progress in. I fear the same dynamic may play out with Nvidia. Tesla is a perfect example of how a business can deliver excellent results at the same time as its stock is performing poorly, simply because the stock price previously got too far ahead of itself. The tailwinds for Nvidia and the rest of the semiconductor industry are stronger than ever. It's just that Nvidia stock is, at least for now, priced for perfection. But that doesn't mean it should be avoided altogether. The Vanguard Growth ETF (VUG -0.24%) is well-suited for investors who feel like they've been caught flat-footed while the AI ascension has zoomed past them. Nvidia makes up 5.3% of the ETF -- a sizable position, but not enough to make or break its performance. The \"Magnificent Seven\" stocks -- Apple, Microsoft, Nvidia, Alphabet, Amazon, Meta Platforms, and Tesla -- comprise over 50% of the fund. Unsurprisingly, the Vanguard Growth ETF is at an all-time high, and the valuations of its top components have gotten much more expensive. But for just a 0.04% expense ratio, or 4 cents for every $100 invested, an investor can get exposure to a lot of megacap growth names, including Nvidia. It's a good way to get a starter position in Nvidia without overly committing. At this point, I don't think investors have to fear Nvidia stock will run away from them. In many ways, its big gains are behind it; it's too late to buy Nvidia if you were looking to nearly 5x your money in a little over a year. Aside from getting limited exposure with the Vanguard Growth ETF or a similar fund, I think the best way to approach Nvidia now would be to simply hit the pause button and wait. If the company's fundamentals have improved a year or two from now, but the stock price has languished, then Nvidia will be a far better value (and probably a strong buy). But for now, so many expectations have been pulled forward, leaving too much hot air and room for the stock to fall. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Berkshire Hathaway, Meta Platforms, Microsoft, Nvidia, Tesla, and Vanguard Index Funds-Vanguard Growth ETF. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}