{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.foxbusiness.com/markets/nvidia-nabs-2-trillion-valuation-sp-500-dow-hit-records-nasdaq-close-behind",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Investment manager James Demmert recommends having Nvidia in your 'core' portfolio while predicting 'multi-years-long' growth. Nvidia has investors cheering the AI boom, which in turn is helping U.S. stocks rise to fresh record highs. The S&P 500 and Dow Jones Industrial Average hit new records on Friday while the Nasdaq Composite closed just shy of an all-time high. The tech-heavy Nasdaq flirted with its first record close since November 2021. Nasdaq Composite Nvidia wowed investors this week after posting revenue that rose 265% from the prior year. The chipmaker, which has been coined the \"MVP\" of AI, cemented its lead in the sector. \"This last year, we've seen a generative AI really becoming a whole new application space, a whole new way of doing computing, a whole new industry is being formed and that's driving our growth\" said Nvidia CEO Jensen Huang on the company's earnings call. \"Conditions are excellent for continued growth calendar '24, to calendar '25 and beyond\" he noted. WHAT IS ARTIFICIAL INTELLIGENCE (AI)? The company's market value rose to $2 trillion for the first time on Friday before settling just below that level. The stock is at a fresh record with year-to-date gains of more than 65%. The Nasdaq is up just 7% over the same time frame. Tim Armstrong, the former CEO of AOL who now heads Flowcode, said Nvidia is well positioned for more growth. \"It is one of the most unique companies in the world and the fact that they were in the video game business, which required them to essentially use AI to render video games to the toughest consumers in the world, which are gamers… It's migrated to everyone's business,\" he said during an appearance on \"Cavuto: Coast to Coast.\" NVIDIA'S BLOWOUT QUARTER Nvidia Huang has seen his net worth explode by more than $9 billion this week alone to over $69 billion, according to Bloomberg's Billionaires Index. Nvidia CEO Jensen Huang speaks during the Taipei Computex expo in Taipei, Taiwan, on May 29, 2023. (Photographer: I-Hwa Cheng/Bloomberg via Getty Images / Getty Images) Wedbush analyst Dan Ives has referred to Huang as the \"godfather\" of AI. The company has several events coming up that could be catalysts for the stock. On March 4th it will present at a Morgan Stanley tech conference, followed by another presentation the following day hosted by TD Cowen. CLICK HERE TO READ MORE ON FOX BUSINESS Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}