{
    "title": "Nvidia stock on meteoric rise: Will earnings keep up? | KrASIA",
    "date": "3/27/2024",
    "url": "https://kr-asia.com/nvidia-stock-on-meteoric-rise-will-earnings-keep-up",
    "text": "Written by Nikkei Asia Published on 28 Mar 2024  3 mins read Exuberance about the potential of artificial intelligence has propelled US chipmaker Nvidia’s shares to record highs, as investors anticipate a breakneck pace of profit growth with few recent parallels. The stock has been moving so fast that analysts trying to set price targets can hardly keep up. The average target calculated by QUICK-FactSet rose from USD 674 at the end of January to USD 893 after Nvidia’s February 21 earnings release. Shares have already jumped past this, rising 4% to close at USD 926.69 on Thursday. Mizuho Securities’ US arm on Tuesday lifted its target from USD 850 to USD 1,000. Goldman Sachs set a target of USD 875 on February 22, citing brisk demand for AI chips among hyperscale cloud computing providers like Microsoft. Goldman semiconductor sector analyst Toshiya Hari said that an earnings drop-off in the year ending in January 2025 and the year ending in January 2026 now looks unlikely. Analysts on average see Nvidia’s net profit surging to USD 64.3 billion in fiscal 2025—twice the latest annual figure for Toyota Motor, Japan’s most profitable company. That would represent a USD 60 billion increase in three years, a pace that would outstrip other beneficiaries of big technological changes. Apple’s net profit rose from USD 3.5 billion in the fiscal year ended in September 2007, the year the iPhone went on sale, to USD 53.3 billion eight years later before temporarily losing steam. Microsoft’s annual net profit swelled by USD 56 billion over the four years from the fiscal year ended June 2018, fueled by growth in cloud computing. Nvidia enjoys a highly profitable near-monopoly on AI chips. Some analysts expect its net profit margin to exceed 50%, far above the most recent figures of 25% and 24% for Apple and Google parent Alphabet, respectively. It is because of this anticipated growth that Nvidia’s shares are not seen as hugely overvalued despite a roughly 90% rally so far this year. Market forecasts of Nvidia’s profits have risen alongside its stock, putting its price-earnings ratio at around 36 based on Thursday’s close and projections for fiscal 2024. By comparison, Cisco Systems’ P/E ratio neared 100 in late 1999, during the peak of the dot-com bubble, while Microsoft’s was in the 60 range around that time. Tesla’s P/E ratio clocked in at around 200 in late 2020 on mounting expectations that it would win the electric-vehicle race. How Nvidia’s stock fares going forward will depend on whether its customers in cloud computing keep up capital spending, and whether generative AI will be as transformative for global business as anticipated. Past cases point to three possible scenarios. The company’s P/E ratio could fall even as its share price keeps climbing. Apple, for example, saw its P/E ratio slide from 37 in late 2007 to below 20 in the early 2010s as profits grew. IBM, the top player in personal computing in the 1980s, stood at 15 in late 1986. Both the shares and the P/E ratio could decline as investors recalibrate expectations, as occurred with tech stocks after the dot-com bubble and later with Tesla. Ross Seymore at Deutsche Bank, who is less bullish on Nvidia than many analysts, expects earnings per share for fiscal 2024 in line with consensus estimates. But he set a price target of USD 720, for a P/E ratio of 30, on expectations of a cyclical downturn in 2025. Nvidia’s P/E ratio could also go the other way, ballooning further. Brent Goldfarb, a professor at the University of Maryland, has named four factors that make bubbles more likely during periods of innovation: uncertainty, the emergence of “pure play” companies tied tightly to the new technology, the alignment of narratives, and the involvement of novice investors. Nvidia has become an AI pure play, generating around 90% of its profit from AI-related business, according to Mizuho, while its prior association with gaming graphics cards has weakened. The narrative of AI changing the world, and the base of novice investors brought in by mobile trading, may also fit into this model. This article first appeared on Nikkei Asia. It has been republished here as part of 36Kr’s ongoing partnership with Nikkei. Auto loading next article... Subscribe to our weekly newsletters  KrASIA A digital media company reporting on the most promising technology-driven trends and businesses in the Asia Pacific. "
}