{
    "title": null,
    "date": "3/28/2024",
    "url": "https://finance.yahoo.com/video/nvidia-room-push-higher-strategist-205726207.html",
    "text": "The first quarter of fiscal year 2024 has been a bullish one, with \"Mag 7\" powerhouse Nvidia (NVDA) leading the charge. Fundstrat Global Advisors Managing Director and Global Head of Technical Strategy Mark Newton joins Market Domination Overtime to break down the technical trends behind Nvidia. In terms of Nvidia's recent performance Neton states: \"We've seen a little bit of a slowdown in Nvidia, just in the last couple weeks...I don't think that's really all that significant, technically. We have had, even at current levels, which is at, what, 903? The stock is up 400 points which is over 80% from where it started just three months ago. It's been a rocket ship. It's been parabolic. It's given us nearly 35% of the gains in the NASDAQ (^IXIC) and about 25% of the S&P (^GSPC)... I view this as just being a temporary period of consolidation. I still think tech is going to push higher.\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. Editor's note: This article was written by Nicholas Jacobino - We are taking a look at technical trends from the past few months, where there may be opportunities ahead. Joining us now is Mark Newton, managing director and global head of technical strategy at Fundstrat Global Advisors. Good to talk to you today. Give me your takeaway here from the first quarter. MARK NEWTON: Well, look we've seen now five straight months of gains, it certainly has been a stellar quarter-- honestly, with the S&P almost 10% or so. This is really the 12th strongest quarter that we've seen going back almost 75 years. And so very impressive quarter. We started off with four straight months of gains over the winter and now we have a fifth straight, very resilient. I would say three things are really important for investors. One is that it hasn't just been a tech-led AI dominated rally, as we all know tech has really underperformed the last month. And we've seen this broaden out to other areas outside of even just financials, industrials, and discretionary, now we're seeing energy and materials start to outperform. So it has gotten a lot more broad-based and I think that's a big positive. The second and to your point about Apple. It certainly has not been a stock market that's seen indiscriminate buying. There have been notable laggards that being Apple and also stocks like Tesla. So I don't sense that we're yet at that stage that we're seeing wild speculation and/or complacency. The third is that, arguably, the stock market is not really all that overvalued either. I mean, a Ford PE for the NASDAQ is right around 21. Not as high as we saw really in the pre-COVID years-- 2019-2020 and certainly well below the time we saw in the early 2000s when the PEs were up nearly above 70. So if anything, look, the stocks that have dominated indices are the ones that a lot of investors involved in. They have given us a lot of great gains, and they're also the ones that are making all the money. So that's certainly a good thing. - And Mark, it's great to have you on the show. I also want to get your take, Mark, on another name, so important to the market. And when we talk a lot about Nvidia, what a move for that name, Mark? I'm just interested, when you look at the charts, the technicals, what are they telling you about Nvidia? MARK NEWTON: Well, we've seen a little bit of a slowdown in Nvidia just in the last couple of weeks. I don't argue-- I don't think that's really all that significant technically, we've had even at current levels, which is at what, 903? The stock is up 400 points which is over 80% from where it started-- literally just three months ago. So it's been a rocket ship. It's been parabolic. It's given us nearly 35% of the gains-- the NASDAQ and about 25% of the S&P, also represents a decent earnings chunk for the S&P and the NASDAQ as well. I view this as just being a temporary period of consolidation. I still think tech is going to push higher, we're likely on the heels of this PCE report that's upcoming. We heard that inflation is now continuing to drop, expectations are being lowered, Powell came in very, very dovish. Finally, the Fed is in line with the dot plot. So rates should start to fall over, that's only going to aid large cap growth in technology. I see Nvidia getting back to this Monday. This past Monday's highs, that's right near 968 and above that, which is what I expect should get the stock up to near 1,050 to 1,100 likely by the middle part of April. So I'm still quite constructive. - What about the other semiconductor players, Mark? I mean, to what extent have they been correlated to Nvidia's rise? You could argue, in some cases, they've actually pulled back as a result of Nvidia's dominance. What are you seeing there? MARK NEWTON: The entire semiconductor sector, if you look at semi and semi-cap is the number one performing level two industry group of the S&P of 25 groups. It's up about 36% for the quarter, that is double the next best performer. So it does pay to be selective. But as a whole, the sector has a lot of stocks that are continuing to act very, very well. - Mark-- I'm sorry. Go ahead. Go ahead, Mark. MARK NEWTON: --I was just going to say I'm fond of a lot of these stocks, until we see some evidence of really technical trends breaking, it doesn't pay to fight this trend. It doesn't pay to say, well, they're overbought and therefore, that means they should fall. If anything, we know the supply constraints on many of these companies have led these stocks higher, that that doesn't appear to be ending anytime soon. It's really a story with this ongoing demand and they have supply constraints. So that's certainly a very, very bullish theme. - And Mark, a final name I need your take on is Tesla. We've got deliveries on deck next week, sentiment is rough stock has been hit. What are you seeing? MARK NEWTON: Well, my own cycle analysis suggests that Tesla should be in the process of bottoming out. So I do have some optimistic words for investors. I mean, look, the technical trends have been quite negative. But I think it's worth trying to pick spots in this stock doing it at least in a very small size. And once they can get up above almost 183 which were close, that would turn the near term trend a lot more positive. That should drive it up to 220 and likely 245. So I think we're very, very close. As you mentioned, sentiment is awful. There's a lot of reasons for people to-- all of a sudden, it's unusual to hear people throwing in the towel after the stock's been down over the last couple of years. We all admire the brilliance of Elon Musk. I think that it's just a matter of time the stock obviously looks to be very, very close to a time when it should start to work. - Mark, great to have you on the show today my friend. Thanks for joining us. MARK NEWTON: Thanks, Josh. Take care, everybody. Thank you. Related Quotes "
}