{
    "title": "Authors Sue NVIDIA for Copyright Violation",
    "date": "3/11/2024",
    "url": "https://goodereader.com/blog/business-news/authors-sue-nvidia-for-copyright-infringement",
    "text": "Good e-Reader 11 March 2024 By Navkiran Dhaliwal Leave a Comment  NVIDIA, whose chips help power artificial intelligence (AI) application, is facing a lawsuit from three authors. The authors, including Brian Keene, Abdi Nazemian, and Stewart O’Nan, claim that the chip-manufacturing company used their copyrighted books to train its NeMo AI platform. They say their works were part of a dataset of about 196,640 books that trained NeMo to mimic everyday written language. NVIDIA removed the database in October 2023 due to alleged copyright infringement. Now, authors are demanding unspecified compensation for this deed. NVIDIA has become the latest AI-focused company to become the target of a copyright lawsuit. In December 2023, a group of 11 authors joined a suit against ChatGPT maker OpenAI and its partner Microsoft, accusing these tech companies of copyright infringement. Recently, The New York Times has also filed its own copyright infringement lawsuit against OpenAI and Microsoft, alleging that the companies used its content without consent to develop their AI products. Reached by PYMNTS at the time, an OpenAI spokesperson said:“The company is committed to working with them to ensure they benefit from AI technology and new revenue models.” Meanwhile, NVIDIA is on the verge of overtaking Apple as the world’s second-most valuable company as the AI industry continues to grow, fueling the firm’s position as the undisputed leader of the AI chip market, of which it commands an 80% share. In a post, PYMNTS wrote: “This dominance has translated into a valuation leap. The company’s worth ballooned from $1 trillion to over $2 trillion in nine months — a feat that has seen it overtake Amazon, Google’s parent company Alphabet and Saudi Aramco.” NVIDIA’s market capitalization was approaching the $2.38 trillion mark, putting it $230 billion shy of Apple and $645 billion behind the leader, Microsoft. Navkiran Dhaliwal is a seasoned content writer with 10+ years of experience. When she's not writing, she can be found cooking up a storm or spending time with her dog, Rain. Filed Under: Business News and Statistics "
}