{
    "title": "Exclusive-Behind the plot to break Nvidia's grip on AI by targeting software",
    "date": "3/25/2024",
    "url": "https://au.finance.yahoo.com/news/exclusive-behind-plot-break-nvidia-110359868.html",
    "text": "By Max A. Cherney SAN FRANCISCO (Reuters) -Nvidia earned its $2.2 trillion market cap by producing artificial-intelligence chips that have become the lifeblood powering the new era of generative AI developers from startups to Microsoft, OpenAI and Google parent Alphabet. Almost as important to its hardware is the company's nearly 20 years' worth of computer code, which helps make competition with the company nearly impossible. More than 4 million global developers rely on Nvidia's CUDA software platform to build AI and other apps. Now a coalition of tech companies that includes Qualcomm, Google and Intel plans to loosen Nvidia’s chokehold by going after the chip giant’s secret weapon: the software that keeps developers tied to Nvidia chips. They are part of an expanding group of financiers and companies hacking away at Nvidia's dominance in AI. \"We're actually showing developers how you migrate out from an Nvidia platform,\" Vinesh Sukumar, Qualcomm's head of AI and machine learning, said in an interview with Reuters. Starting with a piece of technology developed by Intel called OneAPI, the UXL Foundation, a consortium of tech companies, plans to build a suite of software and tools that will be able to power multiple types of AI accelerator chips, executives involved with the group told Reuters. The open-source project aims to make computer code run on any machine, regardless of what chip and hardware powers it. \"It's about specifically - in the context of machine learning frameworks - how do we create an open ecosystem, and promote productivity and choice in hardware,\" Google's director and chief technologist of high-performance computing, Bill Magro, told Reuters in an interview. Google is one of the founding members of UXL and helps determine the technical direction of the project, Magro said. UXL's technical steering committee is preparing to nail down technical specifications in the first half of this year. Engineers plan to refine the technical details to a \"mature\" state by the end of the year, executives said. These executives stressed the need to build a solid foundation to include contributions from multiple companies that can also be deployed on any chip or hardware. Beyond the initial companies involved, UXL will court cloud-computing companies such as Amazon.com and Microsoft's Azure, as well as additional chipmakers. Since its launch in September, UXL has already begun to receive technical contributions from third parties that include foundation members and outsiders keen on using the open-source technology, the executives involved said. Intel's OneAPI is already useable, and the second step is to create a standard programming model of computing designed for AI. UXL plans to put its resources toward addressing the most pressing computing problems dominated by a few chipmakers, such as the latest AI apps and high-performance computing applications. Those early plans feed in to the organization's longer-term goal of winning over a critical mass of developers to its platform. UXL eventually aims to support Nvidia hardware and code, in the long run. When asked about the open source and venture-funded software efforts to break Nvidia’s AI dominance, Nvidia executive Ian Buck said in a statement: \"The world is getting accelerated. New ideas in accelerated computing are coming from all across the ecosystem, and that will help advance AI and the scope of what accelerated computing can achieve.\" Nvidia shares gained 0.8% to close at $950.02 on Monday. NEARLY 100 STARTUPS The UXL Foundation's plans are one of many efforts to chip away at Nvidia's hold on the software that powers AI. Venture financiers and corporate dollars have poured more than $4 billion into 93 separate efforts, according to custom data compiled by PitchBook at Reuters’ request. The interest in unseating Nvidia through a potential weakness in software has ramped up in the last year, and startups aiming to poke holes in the company's leadership gobbled up just over $2 billion in 2023 compared with $580 million from a year ago, according to the data from PitchBook. Success in the shadow of Nvidia's group on AI data crunching is an achievement that few of the startups will be able to achieve. Nvidia's CUDA is a compelling piece of software on paper, as it is full-featured and is consistently growing both from Nvidia's contributions and the developer community. \"But that's not what really matters,\" said Jay Goldberg, chief executive of D2D Advisory, a finance and strategy consulting firm. \"What matters is the fact that people have been using CUDA for 15 years, they built code around it.\" (Reporting by Max A. Cherney in San FranciscoEditing by Kenneth Li and Matthew Lewis) Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  This update would represent Apple's first overhaul to that lineup since 2018. ANALYSIS: The US and EU argue that Apple is abusing its power to crush competition and blight users’ experience. The iPhone maker says the proceedings threaten the company. Andrew Griffin examines what the row could mean for the technology in your pocket Trade 24 hours a day on the world's most popular platform. Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. The new version, called Grok-1.5, will be made available to early testers and existing Grok users on social media platform X, formerly known as Twitter, in the coming days, xAI said in a statement.  The startup said one of the most notable improvements in the new version is its performance in coding and math-related tasks. The dreaded pest also displaces wildlife and can blind pets. Find out more.  Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. The \"Late Night\" comedian brutally summed up the former president's media company. MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. With forward-thinking insurance approaches, IFRC is at the forefront of redefining disaster relief efforts globally. The not-so-happy campers were stunned by the unexpected guest at their beachside campsite. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway.  The person who wrote on the road has been called a \"top bloke\" by motorists. \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann. Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent.  ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ Footage shows Dylan Edwards moved out of the way. Find out more here.  Despite referee Gerard Sutton labelling the collision \"incidental\", Souths superstar Latrell Mitchell has been charged for dangerous contact on Josh Addo-Carr. The ugly incident involving the AFL veteran has sparked debate. More here. An anonymous motorist shared the location to warn others. And it is not the first time motorists have complained about the speed camera set-up in this exact location. "
}