{
    "title": "As Nvidia Shares Soar, We’re Reminded Again of the Fed’s Irrelevance",
    "date": "3/4/2024",
    "url": "https://www.forbes.com/sites/johntamny/2024/03/04/as-nvidia-shares-soar-were-reminded-again-of-the-feds-irrelevance/",
    "text": "U.S. stock markets are not reliant on Federal Reserve rate cuts for their vitality. Repeat the previous truth over and over again for now, while forever marveling that such a fatuous narrative ever became so ingrained in market commentary. Seriously, have you ever read something more ridiculous? To believe that equity markets take their direction from central banks is to believe that markets aren’t just inefficient, but that at least half of all market participants don’t know what the other half apparently does. Think about it. Equity markets aren’t populated by all buyers during bullish periods any more than they’re populated by all sellers during bearish stretches. The reality is that for an optimistic buyer or pessimistic seller to express either emotion in the marketplace, there must be a seller or buyer who disagrees. Applied to the laughable notion that Fed rate cuts drive bull markets is the even more ridiculous notion that when the Fed cuts (or is expected to), oblivious sellers line up to exchange their shares at a discount with buyers who know what they don’t. Sorry, but this kind information asymmetry doesn’t exist in any market, let alone information pregnant U.S. stock markets. Put another way, accepted wisdom about what drives stocks is utter nonsense. Which brings us to Nvidia. It’s no insight to say that in the latest iteration of what some would refer to as a “bull market,” Nvidia has been the most powerful driver of it. Unfortunately for the simpletons who routinely make the stock market about the Fed, Nvidia mocks you. As the Wall Street Journal recently reported, “Almost 28% of the S&P 500’s gains so far in 2024” are a consequence of Nvidia. It’s up 59% in 2024 alone. Of course, part of the reason Nvidia’s rise is so notable has to do with the fact that it wasn’t always the darling that it is now. Are we then supposed to believe that the Fed’s “easy money” randomly discovered it? Furthermore, the Fed starting hiking rates March of 2022, or roughly two years ago. 525 basis points. Supposedly the U.S. economy is a closed shop such that the Fed can overwhelm global credit flows on the way to “tight money.” It seems actual investors operating in actual markets didn’t latch onto this bit of conventional wisdom that is actually quite absurd. No doubt some clinging to the idea that the Fed’s relevant will say that while the Fed hasn’t cut rates in over two years, there’s an expectation that it will soon enough. Supposedly this expectation has lifted Nvidia, and stock market overall? It all sounds so compelling for those who imagine wildly inefficient markets wholly populated by buyers, except that there’s one problem: while Nvidia is up 59% in 2024, it rose 239% in 2023. Not only was the Fed hiking through the first half of 2023, but amid its aggressive hiking Nvidia rose over 200%. The simple truth glossed over by a pundit class that relentlessly manufactures simplistic thoughts is that the Fed is a legend in its own mind, the minds of economists who yearn to be at the Fed, and of market pundits desperate to be quoted such that they’ll say anything to be quoted. In reality, the Fed can’t alter reality. Which is the point. What most readers are likely thinking as they read this write-up is that Nvidia is a great company, and the valuations of great companies tend to go up. Yes, they do. While Nvidia is the biggest (but far from the only) catalyst of the latest market leap upward, companies like Apple, Amazon and Google catalyzed the last one, and then going back to 2000, companies like GE, AOL and Lucent catalyzed that one. In other words, bull markets are about good companies, not rate cuts. See Japan amid decades of “zero” rates if you’re still confused.  "
}