{
    "title": "UPDATE 2-Nvidia to pay $5.5 mln penalty for 'inadequate disclosures' about \ncryptomining -SEC",
    "date": "3/15/2024",
    "url": "https://au.lifestyle.yahoo.com/1-nvidia-pay-5-5-142414171.html",
    "text": "(Adds background and details in paragraph 3, Nvidia's decline to comment in paragraph 5) By Chris Prentice and Kanishka Singh WASHINGTON, May 6 (Reuters) - Nvidia Corporation has agreed to pay $5.5 million to settle civil charges that the technology firm did not properly disclose the impact of cryptomining on its gaming business, the U.S. Securities and Exchange Commission (SEC) said on Friday. In back-to-back quarters in fiscal 2018, Nvidia failed to disclose that cryptomining was a \"significant element\" of its revenue growth from sales of chips designed for gaming, the SEC said in a statement and charging order. The firm, which did not admit or deny the SEC's findings, agreed to pay a civil penalty of $5.5 million. A spokesperson for Santa Clara, California-based Nvidia declined to comment. In 2018, Nvidia's chips became popular for cryptomining, the process of obtaining crypto rewards in exchange for verifying transactions on distributed ledgers, the SEC said. The regulator alleged that Nvidia knew that information, but failed to share it with investors. Those omissions misled investors and analysts who were interested in understanding the impact of cryptomining on Nvidia's business, the SEC said. (Reporting by Kanishka Singh and Chris Prentice in Washington; Editing by Hugh Lawson and Marguerita Choy) This food habit is linked to a specific type of dementia. Abby Hensel officially tied the knot in 2021, it has been revealed  The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The British monarch will not host an Easter lunch after the service, either.  The actress is soaking up every moment of 'paradise.' 'We love a girly that shreds,' one fan said of the very 'Barbie' moment. Benny Larkin and daughter Taylor Larkin, 14, were boating down Dora Creek, New South Wales, Australia, when they broke down and were approached by a fuming kayaker.  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The person who wrote on the road has been called a \"top bloke\" by motorists. ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’  ‘I guess turning 29 isn’t so bad,’ the ‘American Idol’ alum joked. King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann.  Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent. ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ "
}