{
    "title": "AI Robotics Startup Attracting $675M from Nvidia, OpenAI, Microsoft, Bezos \n- High-Performance Computing News ...",
    "date": "3/1/2024",
    "url": "https://insidehpc.com/2024/03/ai-robotics-startup-attracting-675m-from-nvidia-openai-microsoft-bezos/",
    "text": "Start up robotics company Figure, founded in 2022 and based in Sunnyvale, CA, is in the process of attracting $675 million in venture funding from the likes of Amazon founder Jeff Bezos, Microsoft, Intel, Samsung, OpenAI and Nvidia, along with a slew of venture companies, according to news reports. The company’s valuation: roughly $2 billion. The Figure web site says it’s “an AI Robotics company building the world’s first commercially viable autonomous humanoid robot.” Noting the chronic shortage of employees in the U.S. economy, the web site states its intent is to build a general-purpose humanoid: “With the first humanoid by our side in the workforce, we’ll have the ability to create and produce so much more, address drastic labor shortages, and reduce the number of workers in unsafe jobs.” It’s first robot, called Figure 01, “brings together the dexterity of the human form and cutting edge AI to go beyond single-function robots and lend support across manufacturing, logistics, warehousing, and retail.” “Figure 01 is AI-powered and self-reliant, ready to produce an abundance of affordable, more widely available goods and services to a degree which humanity has never seen,” the company states. “As we reach the upper limits of our production capability, humanoids will join the workforce with the ability to think, learn, and interact with their environment safely alongside us.” According to a story in The Wall Street Journal, the investment money will be used by Figure to accelerate commercial deployment of its robots. Also, the company said it signed an agreement with BMW to use Figure robots for automotive manufacturing. The company said this month that “its robots could complete a real-world task like moving a box onto a conveyor belt,” according to the Journal story. “The startup has posted videos of its robots that look like something out of a sci-fi movie. In one, a robot puts a pod in a Keurig coffee machine, though a human had to place the cup down. In another video, an ungainly robot walks across a room.” Other investors include Parkway Venture Capital, Align Ventures, ARK Venture Fund, Aliya Capital Partners, Tamarack, Boscolo Intervest and BOLD Capital Partners,. Industries such as railways are moving from traditional inspection methods to using AI and ML to perform automated inspection of…. The high-performance computing (HPC) market is witnessing a notable shift towards the cloud, partially driven by the benefits of enhanced energy efficiency. According to Hyperion Research nearly every organization running HPC workloads is either already using or investigating the cloud to accelerate application performance, with the cloud market for HPC workloads forecast to reach $11.5 […]  Name * Email * Website Notify me of follow-up comments by email. Notify me of new posts by email.   Δ "
}