{
    "title": "Stocks end week at fresh records as Nvidia tops USD2 trillion",
    "date": "3/3/2024",
    "url": "https://borneobulletin.com.bn/stocks-end-week-at-fresh-records-as-nvidia-tops-usd2-trillion/",
    "text": "NEW YORK (AFP) – Wall Street stocks finished the week with a flourish on Friday behind continued momentum for equities tied to artificial intelligence, especially Nvidia, which finished with a valuation above USD2 trillion for the first time. Both the S&P 500 and Nasdaq ended at fresh all-time highs following records in Tokyo and Frankfurt. “This week saw risk on sentiment take several global stock indices to record highs, the first day of March being no exception,” said senior market analyst at online trading platform IG Axel Rudolph. Trade Nation Senior Market Analyst David Morrison said, “Market sentiment remains bullish, and there seems little appetite for profit-taking.” Stock markets have been on a march higher since late last year, initially on hopes that central banks will soon be able to begin lowering their high interest rates as inflation began to fall closer to normal levels. While hotter-than-expected inflation data from recent months has pushed expectations for the first interest rate cut to mid-year, markets have instead been propelled by stellar results from AI firms in recent weeks. Perhaps no company has benefited as much as Nvidia, led by Jensen Huang, who has developed technology perfectly suited for developing the large language models (LLMs) that underpin generative AI interfaces such as ChatGPT. Nvidia jumped four per cent on Friday to end the day with a valuation above USD2 trillion, joining an elite club that includes just Apple, Microsoft and Saudi Aramco. Also on Friday, Dell Technologies became the latest big beneficiary of the AI fever, surging more than 31 per cent following an earnings report that highlighted its growing AI business. The tech-rich Nasdaq led the major US indices, rising 1.1 per cent. CFRA Research’s Sam Stovall said the gains in New York were also supported by weaker economic data, including the Institute for Supply Management survey of manufacturers and consumer confidence data as “indicating that there could be more reason” for the Fed to cut interest rates in May. In Europe, Frankfurt’s DAX set a new record while the CAC in Paris was also near its record high, with a less-than-expected drop in eurozone inflation failing to derail sentiment. Meanwhile in Asia, Tokyo’s benchmark Nikkei index almost touched 40,000 points for the first time. Asian markets mostly rose, with better-than-expected Chinese data helping sentiment. “China’s factory growth rising above forecasts even though manufacturing shrank for a fifth straight month did not dent investors’ mood with the country’s stock indices pursuing their recovery,” said IG’s Rudolph. Borneo Bulletin is the leading English daily in the country. It was first published by Brunei Press. Today, Borneo Bulletin has become the foremost source of information on local and foreign affairs, and the region’s business news. © 2013 Borneo Bulletin Online - The Independent Newspaper in Brunei Darussalam, Sabah and Sarawak "
}