{
    "title": "And One More Thing About Nvidia",
    "date": "3/12/2024",
    "url": "https://theirrelevantinvestor.com/2024/03/12/and-one-more-thing-about-nvidia/",
    "text": "The Irrelevant Investor Posted March 12, 2024 by Michael Batnick Over the weekend, I wrote about the explosion of dollars into index funds and how they might be impacting the market. Today, I want to discuss what else is moving stocks, and it has nothing to do with Jack Bogle. Before we get into some of the insane shit happening around Nvidia, I want to point out something obvious but also true. Nvidia’s business has earned the run its stock is on. We can argue about how much is warranted and how much is froth, but its shares are up 275% over the last year for good reason. In their most recent earnings report, they shared that their revenue is up 265% year over year, and their net income is up 769% over the same time period. The business is on fire. On TCAF, we discussed NVDL, a levered single-stock ETF that offers twice the daily returns of Nvidia. To start the year, it had $220 million in assets; now, it’s at $1.4 billion. I don’t know enough about the intricacies of this product, the gammas, the deltas, and whatnot, but this has to be impacting the underlying. But why get only two times the daily return when you can use options and really have some fun? According to Danny Kirsch, Nvidia call volume reached 2.55 million on Friday, which is over $200 billion in notional dollars. This is definitely, definitely moving the stock. And then there are the analyst upgrades that seem to happen every day. Today, Cantor Fitzgerald raised its price target from $900 to $1,200. The stock has 39 buys, 11 outperforms, 5 holds, 0 underperforms, and 0 sells. And let’s not forget about the active managers who are mostly setting prices for the rest of us. Daily Chartbook was kind enough to send me these charts. To nobody’s surprise, Nvidia is the most owned semiconductor stock by active fund managers. I was surprised to learn, however, that active managers are only slightly overweight the stock. In fairness, it’s now the third largest stock in the index, at a 5% weight, so I guess it wouldn’t make sense for a monster overweight. Several factors are pushing the stock higher; retail investors, option YOLOers, mutual fund managers, analysts price targets, and yes, probably index funds too. This content, which contains security-related opinions and/or information, is provided for informational purposes only and should not be relied upon in any manner as professional advice, or an endorsement of any practices, products or services. There can be no guarantees or assurances that the views expressed here will be applicable for any particular facts or circumstances, and should not be relied upon in any manner. You should consult your own advisers as to legal, business, tax, and other related matters concerning any investment. The commentary in this “post” (including any related blog, podcasts, videos, and social media)  reflects the personal opinions, viewpoints, and analyses of the Ritholtz Wealth Management employees providing such comments, and should not be regarded the views of Ritholtz Wealth Management LLC. or its respective affiliates or as a description of advisory services provided by Ritholtz Wealth Management or performance returns of any Ritholtz Wealth Management Investments client. References to any securities or digital assets, or performance data, are for illustrative purposes only and do not constitute an investment recommendation or offer to provide investment advisory services. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any investment decision. Past performance is not indicative of future results. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others. The Compound Media, Inc., an affiliate of Ritholtz Wealth Management, receives payment from various entities for advertisements in affiliated podcasts, blogs and emails. Inclusion of such advertisements does not constitute or imply endorsement, sponsorship or recommendation thereof, or any affiliation therewith, by the Content Creator or by Ritholtz Wealth Management or any of its employees. Investments in securities involve the risk of loss. For additional advertisement disclaimers see here: https://www.ritholtzwealth.com/advertising-disclaimers Please see disclosures here. Michael Batnick is a managing partner at Ritholtz Wealth Management. He is the co-host of Animal Spirits, What Are Your Thoughts, and The Compound and Friends. For disclosure information please see here.  Email address: © 2024 The Irrelevant Investor. Every month you'll receive 3-4 book suggestions--chosen by hand from more than 1,000 books. You'll also receive an extensive curriculum (books, articles, papers, videos) in PDF form right away. "
}