{
    "title": "Nancy Pelosi stocks portfolio is up 110% this year; Here's what she holds",
    "date": "3/13/2024",
    "url": "https://finbold.com/nancy-pelosi-stocks-portfolio-is-up-110-this-year-heres-what-she-holds/",
    "text": "In the ever-shifting landscape of Wall Street, not many names carry as much weight as that of United States House Representative Nancy Pelosi, whose personal investments have been making headlines of late, and her portfolio has already soared over 100% in 2024 alone. Indeed, Nancy Pelosi’s stocks portfolio has skyrocketed by an astonishing 110% since the year’s start, in addition to having made more than ten times her annual salary off a single Nvidia (NASDAQ: NVDA) trade, according to the recent Insider Alerts data retrieved on March 13. Indeed, technology behemoth Nvidia is the most prominent investment in Nancy Pelosi stocks list, taking up 21% of all of her stock possessions and bringing her particularly substantial profit in recent times thanks to its high-end graphic processing units (GPUs) and artificial intelligence (AI) advances. Indeed, the shares of the prominent semiconductor supplier are currently trading at the price of $893, recording a 2.84% decline on the day, as well as losing 0.57% across the previous week, but nonetheless increasing 27.10% over the month, and rallying 81.77% since the start of 2024. Furthermore, popular iPhone manufacturer Apple (NASDAQ: AAPL) assumes the second position in Pelosi’s portfolio, judging by the portion of 19% immediately following that of Nvidia, and she continues to hold onto it despite the Berkshire Hathaway (NYSE: BRK.A) CEO dumping nearly $2 billion of it. In the meantime, Apple is recording a decline of 0.97% on its daily chart, a weekly increase of 1.71%, dropping 8.80% over the past month, as well as losing 8.09% this year, as its price presently stands at $171.55, according to the most recent data on March 13. Following Apple, the next on Pelosi stocks list is Microsoft (NASDAQ: MSFT), which is one of the most prominent professional software and cloud services providers and accounts for 18% of the California representative’s holdings despite concerns over its increasing focus on partnership with OpenAI. For now, Microsoft is changing hands at $412.45, down 0.68% in the last 24 hours, advancing 1.73% in the past week, declining 0.51% across the previous 30 days, and growing its price by 10.51% this year, demonstrating its share of ups and downs. Meanwhile, the most recent addition to Pelosi’s portfolio is Palo Alto Networks (NASDAQ: PANW), the provider of cybersecurity solutions across clouds, networks, and mobile devices, the shares of which her husband Paul Pelosi bought in the same week when Congress received a ‘Serious National Threat’ brief, raising some eyebrows. Holy Sh*t.2 weeks ago, Congress was briefed on a \"Serious National Threat\"?This briefing occurred the week of 2/12That same week, Pelosi bought $1M of the cyber security company, Palo Alto Networks $PANW pic.twitter.com/tYae8MRuBM Currently occupying 9% of the representative’s portfolio, the price of PANW at the time of publication stood at $283.42, suggesting it has declined by 0.46% on the day, climbed 0.86% across the previous week, dropped 24.30% in the past month, and lost 3.26% since the year’s turn. In addition to the above, Nancy Pelosi also holds other prominent technology stocks, including Alphabet (NASDAQ: GOOGL) at 11%, Crowdstrike Holdings (NASDAQ: CRWD) at 10%, Amazon (NASDAQ: AMZN) at 4%, Tesla (NASDAQ: TSLA) at 3%, AllianceBernstein (NYSE: AB) and 3%, and Disney (NYSE: DIS) at 1%. All things considered, most of these shares have recorded positive price movements throughout the last year, justifying Pelosi’s reputation as one of the greatest investors on Wall Street (and in Congress) and creating an army of followers monitoring all of her trades for ideas. Buy stocks now with eToro – trusted and advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}