{
    "title": "Nvidia Stock: Got What Berkshire And Few Others Didn't Get – AI \n(NASDAQ:NVDA)",
    "date": "3/2/2024",
    "url": "https://seekingalpha.com/article/4675471-nvidia-stock-got-what-berkshire-and-few-others-didnt-get-ai",
    "text": "David Becker David Becker The following segment was excerpted from this fund letter. Nvidia company designs and sells graphic processing units ('GPU') and central processing units (CPU) for use in gaming, professional visualization, some automotive and more recently data centers. Their heavy lifting of manufacturing semiconductor wafers is outsourced to Taiwan Semiconductor (TSM).  From its founding in 1993 and early 1999 IPO it's been a good business with high-teens to mid-twenties returns on capital. During the decade that ended at our 2021 secular peak, dollar sales grew an impressive 21% annually from a small $4 billion in 2011 to $26.9 billion. Profits went on a tear in the final two years of the decade, rising from a margin of 25% in 2019 to 36% in 2021. Over the full decade, margins expanded from 14.7% to 36%. Like many growing tech companies and on the back of the big margin surge, the stock traded up to 76x earnings from 14.4x ten years prior. The company was paying a third to 40% of its profits as dividends from 2013 to 2015. Combining our five factors and the stock compounded by 57.2%. The top line ground to a halt in 2022 and with the slowdown, margins dropped from 36.0% to 22.3%. The abrupt chilling of business activity cut the share price in half to $146 and a $360 billion market cap. At its year-earlier $737 billion market value the stock was slightly more valuable than Berkshire Hathaway despite its $27 billion in sales being about what Berkshire earns in profit in six months. Read that again. From its halving to $360 billion in 2022, Nvidia got what Berkshire and few others didn't get - AI. Artificial Intelligence, baby. Charlie Munger joked at Berkshire's annual meeting last year that, \"Old-fashioned intelligence works pretty well.\" Well, the prospects of AI and a shortage of manufacturing capacity and chips sent Nvidia's business straight up like something few have seen. Just a month before he passed in November, Charlie quipped, \"I think it's [AI] getting a huge amount of hype. I think it's probably getting more than it deserves.\" Rightly or wrongly, Nvidia's revenues likely grew 119% to $59 billion from $27 billion when they report January 31 fiscal year earnings later this month. The profit margin likewise more than doubled in 2023 to 51.4%. There have been few companies with a margin at or above 50%. Nvidia's multiple came down to 40.2x. The stock was up an incredible 239% in 2023 and saw the market capitalization grow from $360 billion to over $1.2 trillion by yearend. Just yesterday (2/22) the stock reached $700 per share, which gives the company a market value over $1.7 trillion. Some sell side analysts model revenues growing from today's $59 billion to $150 billion over the next four years and earning margins close to 51.4% at present. Call it $75 billion in earnings in early 2028. That's \"only\" 23x earnings four years out at today's market cap. In the meantime, $1.7 trillion is 56x today's earnings at a 51.4% profit margin. What could go wrong? SEC-registered investment advisory firms are now required to disclose 1-, 5- and 10-year returns, or the time period since performance composite or portfolio inception, if shorter. The new rule seeks to prevent \"advertisers\" from cherry-picking time periods that make returns appear more favorable. As short- and intermediate-term returns change frequently due to beginning and endpoint sensitivity, we have chosen to disclose all yearly intervals from the current 1-year return all the way back to inception. Intra-year periods will likewise be shown annually back to inception. Better, in our opinion, to provide more data than less. We are augmenting the mandated disclosure with the full data set - not to confuse - but if we must provide a few defined numbers, to the extent anybody uses them in decision making, we want you to have the information we'd want if our roles were reversed. The yearly return intervals are italicized and shaded in blue. Information presented herein was obtained from sources believed to be reliable, but accuracy, completeness and opinions based on this information are not guaranteed. Under no circumstances is this an offer or a solicitation to buy securities suggested herein. The reader may judge the possibility and existence of bias on our part. The information we believe was accurate as of the date of the writing. As of the date of the writing a position may be held in stocks specifically identified in either client portfolios or investment manager accounts or both. Rule 204-3 under the Investment Advisers Act of 1940, commonly referred to as the \"brochure rule\", requires every SEC-registered investment adviser to offer to deliver a brochure to existing clients, on an annual basis, without charge. If you would like to receive a brochure, please contact us at (303) 893-1214 or send an email to csc@semperaugustus.com. Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}