{
    "title": "NVIDIA GTC 2024: How AI and HPC Are Creating a 'New Frontier of Capital \nMarkets'",
    "date": "3/29/2024",
    "url": "https://biztechmagazine.com/article/2024/03/nvidia-gtc-2024-how-ai-and-hpc-are-creating-new-frontier-capital-markets",
    "text": "Through podcasts, books, research, talks and Twitter conversations, these are the influential voices all small business IT professionals should be listening to right now. Trevor Mottl, portfolio manager at Walleye Capital speaks about generative AI's impact on quantitative finance at NVIDIA GTC 2024, hosted in San Jose, Calif. Lily is a Senior Editor at BizTech Magazine. She follows tech trends and the IT leaders who shape them — reporting on entrepreneurial business, security and thought leadership. Lily is a Senior Editor at BizTech Magazine. She follows tech trends and the IT leaders who shape them — reporting on entrepreneurial business, security and thought leadership. A “new frontier of capital markets” is emerging, and it’s rooted in artificial intelligence, said Nikolai Larbalestier, senior vice president of cloud strategy and enterprise architecture at Nasdaq. At NVIDIA GTC 2024, hosted March 18-21 in San Jose, Calif., financial services was the largest industry in attendance — a sign of the technology’s rapid influence on market trends. “In a given day, we handle about 100 billion events, with latency measured at approximately 20 microseconds roundtrip from the edge of our network to that order back to the customer,” Larbalestier said. But with high-performance computing and AI added to the mix, capital market trades are becoming more precise. It’s also allowing predictive analytics and investment strategies to grow exponentially, he said. “When we think of the capital markets in the future, we see a parallel infrastructure developing,” Larbalestier said.  This means that HPC and AI will start to run alongside the current infrastructure that the financial services sector has in place, on-prem and in the cloud. The result is “a market that’s more adaptable to the conditions we experience in real time,” he said, one that is receptive to the instant shocks of global events and almost intuitive when it comes to risk management. Here’s how these new capabilities are transforming financial services, from enhancing efficiency to personalizing customer experiences and innovating product offerings. Click the banner below to receive exclusive industry content when you register as an Insider. Generative AI is revolutionizing the way financial advice is delivered to customers, namely by making it more personal. For Trevor Mottl, portfolio manager at Walleye Capital, “the promise, I think, is personalization. Many of us are privy to financial advisers, and many of us get generic portfolios. The real promise is getting a portfolio just for you. Getting a call when you want the call,” he said. RELATED: How does high-performance computing and artificial intelligence help financial firms? That’s where quantitative finance is headed. By using AI-driven platforms powered by natural language processing and machine learning tools, IT leaders can analyze a customer’s financial data, including spending habits, savings, investments and goals, to offer tailored advice on budgeting, saving, investments and even retirement planning. This approach makes financial advice accessible and affordable to a wider audience, moving beyond traditional wealth management services reserved for high-net-worth individuals. Trevor Mottl\nPortfolio Manager, Walleye Capital Generative AI is also refining market forecasting. Capable of synthesizing and analyzing large volumes of data, these models can identify patterns, trends and insights that are not easily discernible by humans, as NVIDIA GTC 2024 experts noted. Banks and investment firms are modeling market scenarios in real time, which will make predictions even more accurate and informed. “A lot of those high-frequency trades are really price- and microevent-dependent. But when you want to buy a stock, or Warren Buffett wants to buy a stock, what do they do?” asked Mottl. “They learn about the company. They read, they look at filings and a whole bunch of data that isn’t price, and the trade affects the price.” With Generative AI, Mottl said, quantitative analysts can look beyond price and evaluate “text or multimodal data to forecast something else.” This includes factors such as industry performance, company news, and performance and economic factors — all of which can impact price. Ioana Boier, principal solution architect at NVIDIA, said that “sentiment analysis” is one example of these newer evaluations leading to more context-based decision-making. In sentiment analysis, a natural language process model uses computational linguistics and collects the good, bad or neutral sentiment in news articles, social media posts, financial reports and other investor sources to get a temperature on a stock, company or trend. DISCOVER: Deploy these artificial intelligence and analytics solutions to advance your business. Generative AI is also helping financial firms identify patterns and anomalies that indicate fraudulent activity and credit risk. This not only protects the financial institution's assets but also safeguards customer interests by reducing the number of incidents. “Data is the bedrock” on which financial organizations will grow their businesses, Mottl said. And for computing capabilities to excel, IT leaders must continually prioritize clean data, train talent and select the right features to input into AI models. That’s going to be an iterative process. “Generative AI is still in the very early stages of being integrated into asset management, with years of progress to come,” Mottl said. “The next 10 years will be some of the most exciting times in our industry,” said Jensen Huang, CEO and founder of NVIDIA. This will be due in large part to how AI is making financial services more efficient, secure and customer-centric. Unlock white papers, personalized recommendations and other premium content for an in-depth look at evolving IT Cloud Why Improving Customer Service Is the Goal of Most Digital Transformation Security Solutions For Managing Endpoint Tech Are Getting Better Visit Some Of Our Other Technology Websites: Tap into practical IT advice from CDW experts. Visit the Research Hub Copyright © 2024 CDW LLC 200 N. Milwaukee Avenue, Vernon Hills, IL 60061Do Not Sell My Personal Information "
}