{
    "title": "What's Preventing Nvidia From Replacing Intel in the Dow Jones Industrial \nAverage?",
    "date": "3/17/2024",
    "url": "https://www.fool.com/investing/2024/03/17/whats-preventing-nvidia-replacing-intel-dow-jones/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More In February, Amazon became the third big-tech stock in nine years to join the Dow Jones Industrial Average (Salesforce was added in 2020 and Apple joined in 2015). With the pace of change accelerating, investors may wonder when other \"Magnificent Seven\" stocks will join the historic index. Nvidia (NVDA 0.12%) is now the most valuable company not in the Dow. Even better, Intel (INTC 0.91%) is a Dow component and would be the most obvious choice for Nvidia to replace. Here's what is preventing Nvidia from joining the Dow and why the growth stock deserves to be a Dow component in the near future. Image source: Getty Images. Dow components are usually replaced because they have lost some of their industry leadership or the industry they operate isn't as important to the economy anymore. At a price of just $42 per share, Intel is the second-smallest component of the price-weighted index, ahead of Verizon. Intel stock is doing well, up over 66% in the last year. It is in the same industry as Nvidia, but it isn't a direct competitor. There's some crossover in gaming, PCs, and data centers. But Intel's main growth driver is getting into the foundry business. And Nvidia could even be a customer of Intel's advanced packaging services. Intel doesn't deserve to be replaced. It makes up such a small portion of the Dow that the semiconductor industry is, in many ways, unrepresented. It may be better to swap a different component for Nvidia. But we are getting ahead of ourselves. The first thing Nvidia has to do is split its stock. Amazon could be added only because it split its stock in June 2022. With a price of nearly $900 a share and the median price of a Dow component around $175 a share, Nvidia would have to issue at least a 5-for-1 stock split to avoid tilting the balance of the index. Another issue is timing. There's no schedule for Dow shakeups. But they don't happen too often. Given Amazon just got added, it's unlikely we'll get another swap for at least a couple of years. Alphabet may be first in line for a swap considering its history, market position, and the fact it already split its stock in July 2022. Deciding which component to replace, the stock split ratio, and the timing of the next index restructuring are all relatively minor challenges in the grand scheme of things. The bigger question is whether Nvidia deserves to be a blue-chip Dow stock or if its growth is fleeting. Nvidia is an unrecognizable business from just a few years ago. And it's all because of data centers. Go back to fiscal 2022, and the Graphics segment a far larger segment than Compute and Networking (led by data centers) for Nvidia, generating nearly double the operating income. But in just two years, Compute and Networking performance exploded. In fiscal 2024, Compute and Networking made up 77.8% of total revenue and 84.5% of segment-operating income, with operating income up nearly seven times in that period. Customers are rapidly building AI models and demanding more and more output from Nvidia's chips. However, the semiconductor industry is cyclical. Right now, demand is outpacing supply, driving prices and margin expansion for Nvidia. For Nvidia to sustain its torrid growth rate, AI has to be worth the expense for businesses. In other words, they have to make money on the solutions. For example, if Apple spends a fortune developing an AI assistant for every iPhone and tries to charge a monthly fee that many customers are unwilling to pay, then it's probably not going to accelerate its spending. Microsoft is having breakout success with its AI solutions, like Copilots for Microsoft 365, GitHub AI, Azure AI for cloud infrastructure, and more. It's working now, but the pace of growth could change based on the market, the economy, and customer reception of these solutions. No one knows when it will happen, but Nvidia will eventually enter a downturn, and its growth will slow. At that point, earnings will fall, and the stock will look more expensive -- as is the nature of cyclical industries. The market may be less willing to pay up for Nvidia during that period. Nvidia has the makings of a Dow stock. But the growth of its data center business has happened in a flash. Before Nvidia gets added to the Dow, the market will need to see how this business does during a downturn and mid-cycle conditions. No company is going to get added to the Dow just because its business is hot right now. If that were the case, PayPal could have been added in early 2021 to replace or pair with Visa. Three years ago, PayPal briefly overtook Mastercard in market cap but is worth around seven times less than Mastercard today. Or Zoom Video Communications could have been added in 2020. There are plenty of periods in the stock market where investors get super excited about a theme and drive valuations higher. I don't think AI is a bubble, and I think much of Nvidia's growth is here to stay. But I do expect the pace of growth to slow and want to get a better look at how Nvidia's data center business performs during that slowdown. I suspect the folks in charge of the Dow Jones Industrial Average feel the same. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Mastercard, Microsoft, Nvidia, PayPal, Salesforce, Visa, and Zoom Video Communications. The Motley Fool recommends Intel and Verizon Communications and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $370 calls on Mastercard, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2025 $380 calls on Mastercard, short January 2026 $405 calls on Microsoft, short March 2024 $67.50 calls on PayPal, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}