{
    "title": "Nvidia and other stocks \"approaching the trough of disillusionment\" over \nGenAI",
    "date": "1/3/2024",
    "url": "https://www.marketwatch.com/story/beware-as-nvidia-and-other-stocks-approach-trough-of-disillusionment-over-genai-warns-this-analyst-8176e674",
    "text": "Wall Street’s second day of 2024 is starting like the bumpy first day, with major indexes all in the red, led by technology stocks. Steve Eisman, of “Big Short” fame and now portfolio manager at Neuberger Berman, told CNBC that he’s worried “everybody is coming into the year feeling too good.” Note, technology is one area the manager favors for 2024, with some Wall Street banks also hoping for more of what they saw in 2023. That may partly explain why Apple and tech stocks got hit so hard by the Barclays’ advice to sell the stock on Tuesday. We stay on the tech sector in our call of the day from a D.A. Davidson analyst, an early fan of generative artificial intelligence (GenAI) who is now warning the software sector is “approaching the trough of disillusionment” over the technology. Gil Luria, senior software analyst, said he hasn’t changed his year-ago view that GenAI would be the “most important transformative technology since the internet,” but notes how companies now regularly trot out related products and strategies. “We expect the market to do what the market does and compete the gains away from all but a few. We may be experiencing the most FOMO [fear of missing out] shortened cycle to date,” Luria told clients in a note. Chats with industry participants have revealed “significant obstacles” for enterprise customers in implementing GenAI solutions, as they first need to modernize existing data, and even set up AI committees to deal with cybersecurity impacts and other issues. That means more time will be needed to ramp up those solutions, he said. The analyst expects just a few companies will be able to point to direct GenAI revenue benefits — Nvidia \n        NVDA,\n       Microsoft \n        MSFT\n       and “generously” Adobe \n        ADBE.\n       “We expect this number to expand this year as a few more companies crack the code and find a new GenAI killer app, but believe it unlikely they all do.” He sees Amazon \n        AMZN\n       and Google \n        GOOGL,\n       via their cloud platforms, along with Snowflake \n        SNOW,\n       leveraging investments in GenAI infrastructure “to allow everybody else to play with their own products.” But as for Nvidia, in a separate note he assumed coverage on the company with a neutral rating and $410 price target, as he warned the AI chip giant is vulnerable to that coming “trough of disillusionment.” Luria explains many Nvidia’s customers will fill their GenAI capacity over this year, a shift that will start to fade in 2025. Included in his price target is $155 per share for “sandbox” revenue coming in from GenAI. “We believe the value of this sandbox could drop considerably once NVDA growth rolls over.” He’s got a more upbeat view on Amazon, where he assumed coverage with a buy rating and a $195 per share target, up from a previous $157. “We believe a potential reacceleration of growth in AWS [Amazon Web Services] could drive upside to shares in 2024, as AMZN gets some of the GenAI boost already in MSFT [buy-rated at D.A. Davidson], GOOGL and META \n        META\n       shares,” he said. Finally, Luria discussed Apple in a separate note, assuming coverage with a neutral rating and $166 per share price target, both the same as previously. Apple will likely return to “moderate growth” this year, boosted by services and easier comparisons on Mac sales, but needs to get “unstuck” on innovation to help generate product growth, as wearables seem to have plateaued, he said. Like Barclays, Luria also sees iPhone domination challenges. “While Apple may have a strong hold on existing handset owners because of the strength of its ecosystem, it will need to be more creative in order to convert new consumers to the iOS ecosystem,” notably in places like China. GenAI applications could prompt some of that new innovation, with Apple “in a position to leverage an unparalleled walled garden consumer data set to provide new applications and experiences,” said Luria. U.S. stocks \n\n\n\n       are in the red as Treasury yields \n\n\n       rise on questions over Fed rate-cut timing. Oil prices \n        CL\n       turned higher after deadly explosions near a cemetery in Iran. Read: These 3 flashpoints could spark a wider Middle East war that markets can’t ignore The minutes of the Fed’s December meeting will be released at 2 p.m., and could shake up rate-cut expectations. Richmond Fed President Tom Barkin said interest rate moves will depend on more inflation progress and the outlook for the economy. Data showed the U.S. manufacturing sector shrank a 14th straight month in December. Job openings slid to a 32-month low of 8.8 million. Agios Pharmaceuticals \n        AGIO\n       is up nearly 20% after the biotech announced positive results from a Phase 3 trial of a rare blood disorder treatment. Xerox shares \n        XRX\n       are falling after the copier and printer maker announced a reorganization and said it was targeting cuts for 15% of its workforce. ‘Steamboat Willie’ has been in the public domain barely two days, free from Disney’s \n        DIS\n       copyright and already the focus of two horror films. Four things the best diets of 2024 have in common — and where Ozempic and Wegovy fit in How a coolheaded cabin crew helped nearly 400 people escape a burning plane Nobel Prize winner cautions against piling into STEM subjects after rise of AI “Not only has the U.S. offered double the equity return of all regional peers over the past decade (10% USD CAGR [compound annual growth rate] compared with 2-4% outside the US), but also the U.S. market has been the best performing equity region in 5 of the past 6 years,” say a team of Goldman Sachs strategists led by Caesar Maasry, who surveyed returns for seven global regions and offered up this chart: These were the top-searched tickers on MarketWatch as of 6 a.m.: New York City awaits first big snowfall in nearly 700 days. Workers calling in sick to binge-watch new Netflix thriller Only psychopaths sleep in socks? Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern. Stock-market investors get a key piece of economic data on Good Friday, but won’t be able to trade on it. Barbara Kollmeyer is based in Madrid, where she leads MarketWatch's pre-markets coverage of financial markets and writes the Need to Know column. She has worked in London and Los Angeles for MarketWatch previously. Follow her on Twitter @bkollmeyer. Barbara Kollmeyer is based in Madrid, where she leads MarketWatch's pre-markets coverage of financial markets and writes the Need to Know column. She has worked in London and Los Angeles for MarketWatch previously. Follow her on Twitter @bkollmeyer. Visit a quote page and your recently viewed tickers will be displayed here. "
}