{
    "title": null,
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/news/one-chart-shows-why-big-tech-earnings-are-critical-for-the-health-of-the-market-rally-160444587.html",
    "text": "The stock market is still all about tech. New data from FactSet shows that while strategists have called for a broadening out of the market rally, they expect Big Tech companies to drive Q4 earnings growth for the S&P 500. Earnings for Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), Meta (META), and Nvidia (NVDA) are expected to grow a combined 53.7% in the fourth quarter. The other 494 companies in the S&P 500 are expected to see a 10.5% decline. Five of those companies — Apple, Alphabet, Microsoft, Amazon, and Meta — are set to report quarterly results this week. After Tesla (TSLA), the last of the \"Magnificent Seven,\" disappointed with its report, Evercore ISI managing director Julian Emanuel described the stock price reaction to these reports as \"critical for overall market direction.\" The expectations for some names are massive. Nvidia is expected to grow earnings per share by more than 400% compared to the same period a year prior. Analysts project Meta's earnings per share to grow 175% from the same period a year prior. The eye-popping growth for some of the largest stocks in the market is expected to continue next quarter, too. A second chart from FactSet shows that Amazon, Alphabet, Meta, and Nvidia are expected to grow earnings by nearly 80% in the first quarter of 2024. The other 496 companies, including Apple, Microsoft, and Tesla, are expected to grow earnings by a combined 0.3%. \"Their earnings are incredible compared to the rest of the market,\" JJ Kinahan, IG North America's CEO, told Yahoo Finance Live. \"You don't often see this where a few stocks are so outperforming the rest of the market.\" To some on Wall Street, these massive earnings expectations help explain why the S&P 500 is hitting all-time highs and yet still might not be overvalued. \"There's more growth in that [S&P 500] valuation now than there used to be,\" Citi director of US equity strategy Drew Pettit said, nodding to the increased position of technology in the index. There's a simple reason why investors will be watching these earnings reports closely: During the market's recent January rally, the same tech companies, excluding Tesla, drove nearly 90% of the growth, per analysis from Yahoo Finance's Jared Blikre. This came after the seven tech companies led the market in 2023. Still, tech earnings expectations go beyond just the quarterly numbers. They are about updates on various market-moving narratives during earnings calls too. Artificial intelligence has been at the center of earnings improvements for Meta and Nvidia. Microsoft and Amazon have AI plays too, but their cloud revenues are typically more scrutinized. Additionally, Apple's products business can provide a lens into demand for hardware and the overall state of consumer spending. All of this combines to make tech earnings crucial for the market — not only because people expect Big Tech to do well but because if their results miss estimates, the lagging parts of their businesses could flash a warning sign about an economic slowdown. Josh Schafer is a reporter for Yahoo Finance. Follow him on X @_joshschafer. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Related Quotes "
}