{
    "title": "Super Micro Stock's 'Nvidia Moment' Is Here (NASDAQ:SMCI)",
    "date": "1/23/2024",
    "url": "https://seekingalpha.com/article/4664408-super-micro-smci-stock-nvidia-moment-is-here",
    "text": "da-kuk da-kuk Super Micro Computer, Inc (NASDAQ:SMCI), or \"SMCI,\" recently had an \"Nvidia moment,\" as shares surged by 35% after the company raised its quarterly guidance considerably. Due to its market-leading position in the AI hardware segment, SMCI continues to increase sales and profitability much faster than expected. Super Micro's earnings are scheduled to be revealed on January 30, and provided SMCI's stellar pre-announcement, the results should be much better than previously thought. Also, SMCI's recent outperformance suggests that many analysts may need to revise future estimates to keep up with Super Micro's stellar growth. Additionally, due to SMCI's likely future outperformance, its valuation is still relatively inexpensive. As a leading hardware supplier for the AI segment, SMCI should continue expanding sales and increasing profitability, leading to a higher stock price in future years. I highlighted SMCI recently, as I had a suspicion about it reporting much better than expected this quarter. SMCI highlight (The Financial Prophet ) SMCI highlight (The Financial Prophet ) The next day, I increased my SMCI position by 50%, and the following day, the stock skyrocketed by 35% due to its \"Nvidia moment.\" I sold covered call options against 33% of my stake, and I may sell more covered call options if the parabolic price action continues. I remain bullish on SMCI long term despite the likelihood of a near-term pull-back/consolidation. SMCI (StockCharts.com) SMCI (StockCharts.com) Technically, SMCI consolidated for a very long time. Moreover, the price remained cheap relative to SMCI's growth and profitability potential. Additionally, about 9% of SMCI's shares were sold before its Nvidia moment. Short-covering likely exacerbated the recent spike and may continue to contribute here in the near term. Now that we've seen record volume and the RSI approaching 80, we could see a consolidation/pullback phase, especially post-earnings. Nonetheless, SMCI remains a top \"buy the dip\" opportunity, as we advance in the coming months. The AI boom is here, and Super Micro's top and bottom lines continue to expand more rapidly than expected. Super Micro expects fiscal Q2 revenues of $3.6-$3.65 billion, much higher than the $2.7-$2.9 billion prior range. This ultra-bullish dynamic illustrates that SMCI's revenue will be about 32% higher than consensus estimate expectations. Moreover, the updated EPS range guidance is about $5.50, much higher than the previous range of $4.40 to $4.88. The updated guidance is much higher than the consensus estimate figures for sales of $2.84B and profit per share estimate of $4.55. Super Micro said it was raising its guidance as it saw a strong market and end customer demand for its rack-scale, AI, and total IT solutions. Sales estimates (SeekingAlpha.com ) Sales estimates (SeekingAlpha.com ) SMCI's sales should come in about 32% above the consensus estimates, suggesting that future estimates are too low. The previous fiscal Q2 revenue range was $2.7-$3.08 billion. However, SMCI said it would deliver around $3.6-$3.65 billion instead. This dynamic illustrates massive outperformance and suggests that future revenue estimates need to be revised higher to reflect the stellar sales growth potential of Super Micro. Sales estimates (annual) (SeekingAlpha.com ) Sales estimates (annual) (SeekingAlpha.com ) This year's (fiscal 2024) revenue estimate range was $10.3 to $11.77 billion, but given the massive revenue guidance increase, we could see fiscal 2024 sales around $13-$14 billion if the outperformance continues in future quarters. Also, we could see considerably higher than expected revenues in the coming years, illustrating that Super Micro is inexpensive here. Therefore, SMCI's forward P/S multiple is likely around 1-1.2 instead of the 1.5-1.6 range. EPS estimates (SeekingAlpha.com ) EPS estimates (SeekingAlpha.com ) SMCI's updated EPS guidance is $5.40-$5.55. Therefore, SMCI could achieve higher-end estimates or higher for fiscal Q2. Additionally, SMCI could achieve higher-end estimates in future quarters, implying its EPS could be much higher than expected as we advance. Provided SMCI continues reaching higher-end figures, it could earn around $20-$22 in EPS in fiscal 2024. EPS estimates (annual) (SeekingAlpha.com ) EPS estimates (annual) (SeekingAlpha.com ) Instead of the projected $17.88 in EPS, SMCI could achieve around $21 instead. This dynamic illustrates that SMCI's forward (fiscal 2024) P/E ratio may only be around 21.4 here. Moreover, SMCI's EPS could be considerably higher than the projected $21.21 consensus estimate for 2025. Super Micro could continue outperforming, achieving around $27-$29 in EPS in fiscal 2025. This scenario illustrates that SMCI may be trading around 16 times forward (fiscal 2025) earnings now, which is exceptionally cheap for a company in SMCI's market-leading position with substantial growth ahead. Where Super Micro's stock could be in the future: Source: The Financial Prophet Despite my bullish projections, SMCI faces risks. First, there is the risk of competition, as SMCI is not alone in its space. Second, there is the risk of lower margins, as SMCI is on the hardware side of AI, and intense competition may lead to margin compression in time. Also, there are macroeconomic factors to consider, such as a possible economic slowdown and AI. There are concerns that SMCI's growth may peak, leading to stagnant or lower EPS after its AI rise. Investors should consider these and other risks before investing in SMCI. This article was written by Victor Dergunov is an independent investor and author with 20 years experience. He preaches diversification and shares investment ideas across all market sectors. Victor aims to help readers build portfolios that perform well in all economic conditions. Analyst’s Disclosure: I/we have a beneficial long position in the shares of SMCI either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I am long a diversified portfolio with hedges. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}