{
    "title": "3 Things About Nvidia Stock That Smart Investors Know in 2024",
    "date": "1/4/2024",
    "url": "https://www.fool.com/investing/2024/01/04/3-things-about-nvidia-stock-smart-investors-know/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) has taken the world by storm. Spurred by surging demand for artificial intelligence (AI) chips and interest in the long-term potential of this incredible new technology trend, the company's stock delivered incredible performance in 2023. The graphics processing unit (GPU) leader's share price surged 228% over the last year -- a performance that pushed the company to a market capitalization of $1.19 trillion and made it the world's sixth-most-valuable business. As exciting as Nvidia's story has been so far, the world-changing impact of the processing specialist's technologies is likely just beginning to unfold. If you're thinking about investing in this fast-growing technology titan in 2024, read on for a look at three things that you should know about the company and its stock. Image source: Getty Images. Founded in 1993, Nvidia quickly established itself as a leading provider of GPU hardware. But notably, the company's first processors were almost entirely intended for high-end computer gaming and other resource-intensive visual applications. The gaming-focused business was quite successful, and it remains the company's second-biggest segment by revenue to this day. However, Nvidia's business started to change rapidly roughly a decade ago. For starters, the company began designing chips for self-driving and driver-assisting vehicle technologies. More importantly, it made a big push into designing GPUs for cloud-computing data centers. In 2019, Nvidia acquired high-performance networking specialist Mellanox in a $6.9 billion deal -- a move that helped facilitate and accelerate the transformation that has driven the semiconductor designer's incredible returns. By 2022, the company's data segment had become its largest by revenue -- and it's since gone on to set new performance records. Powered by surging demand for AI technologies, Nvidia's data center segment saw revenue soar 279% year over year to reach $14.51 billion in the third quarter of 2023. The segment accounted for roughly 80% of the company's revenue in the period. But the company isn't resting on its laurels. With a heavy focus on artificial intelligence, Nvidia is making a push to expand its software offerings. It's also offering AI computations at its own data centers through a service-based model. Thanks to the company's existing strengths, these emerging initiatives have a good chance of being successful and creating lasting sales and margin tailwinds. Nvidia is the clear-cut leader in most key segments of the GPU market. Most importantly for long-term investors, it's the clear-cut leader in processors that are used for advanced AI applications, processing at data centers, and other accelerated computing uses. Nvidia currently commands roughly 90% of the GPU market for ultra-advanced computing applications. Many analysts expect the company to retain its market share lead. While companies, including Advanced Micro Devices and Intel, are readying processors that are aimed at competing in the space, Nvidia's technologies currently offer substantial performance advantages. As a result, the company is positioned to continue enjoying much stronger sales and margins in the category. Nvidia's excellent performance and promising outlook aren't a secret. Accordingly, some strong growth is already priced into the company's current valuation. The semiconductor leader is currently valued at roughly 13 times the expected sales for 2024 and 24 times the expected earnings for the year.  NVDA PE Ratio (Forward 1y) data by YCharts While continued momentum is already priced into the stock to some extent, it's worth reiterating just how impressive the company's recent performance and near-term guidance have been. In last year's third quarter, Nvidia posted non-GAAP (adjusted) earnings per share of $4.02 on sales of $18.12 billion. This performance crushed Wall Street's target for per-share earnings of $3.37 on revenue of $16.18 billion. In its last reported quarter, the AI frontrunner grew sales 206% year over year and earnings 593% year over year. For the fourth quarter, Nvidia is guiding for another blockbuster quarter and expects year-over-year sales growth to accelerate to 231%. Even though Nvidia stock has seen explosive growth and will likely see some cyclical shifts for its business, the passage of time could show that the stock was actually quite cheap at today's prices. Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}