{
    "title": "Nvidia’s earnings report could kill the momentum driving U.S. stocks higher",
    "date": "2/18/2024",
    "url": "https://www.marketwatch.com/story/nvidias-earnings-report-could-kill-the-momentum-driving-u-s-stocks-higher-regardless-of-how-it-turns-out-66c17b16",
    "text": "Wall Street is growing increasingly uneasy about an options-driven momentum trade that has helped push the S&P 500 index into record territory. As demand for bullish call options surges to its highest level in years, some analysts have set their sights squarely on Nvidia Corp.’s \n        NVDA,\n        +0.12%\n       Wednesday earnings report, warning that it could be the catalyst that slams the brakes on this trade, potentially reversing a substantial amount of the market’s rally over the past four months. Their reasoning is rooted in the fact that investors have gotten so bulled up on risky options bets, the mere fact that the earnings report has passed could be enough to sink the main U.S. stock-market indexes due to the internal dynamics of the options market — even if Nvidia’s results satisfy Wall Street’s expectations, according to several derivative-market experts who spoke with MarketWatch. According to FactSet, analysts expect Nvidia to report earnings per share of $4.59, an increase of more than 700% from the same quarter last year. See: Nvidia may shine again when it reports on Wednesday As stocks rallied over the past year, taking many on Wall Street by surprise, investors have increasingly relied on options to chase the market higher and boost returns. This has caused demand for bullish out-of-the-money calls on the largest U.S. stocks to approach the most skewed level since the meme-stock craze of 2021, according to data from Cboe Global Markets, one of the biggest options-exchange operators. An option is said to be trading “out of the money” when the strike price of the option is above where the underlying stock or index is trading, in the case of calls, or below it, in the case of puts. In the options market, “skew” typically measures demand for out-of-the-money calls compared with out-of-the-money puts, or demand for out-of-the-money puts or calls compared with their at-the-money counterparts. In this case, it is the former. One key difference between the meme-stock era and the latest options-market frenzy is that this time around, more of the action is taking place in stocks that are heavily weighted in the main market indexes, said Michael Lebowitz, a portfolio manager at RIA Advisors. “Option buyers are normally more insurance buyers. But now they’re more speculative traders, that’s what the skew is telling you,” he said during an interview with MarketWatch. Michael Kramer, a longtime independent stock-market analyst and founder of Mott Capital, said Nvidia earnings could be a make-or-break moment for the market, but the odds are stacked against the chip maker. “The market in my opinion has placed a gigantic bet on one company,” Kramer said. “If Nvidia doesn’t guide up significantly, what is going to keep this thing going higher?” With the stock already up nearly 50% this year, Nvidia has contributed roughly 25% of the S&P 500’s 4.9% advance since the start of 2024, Kramer said. As of Thursday, the skew in Nvidia reached its highest level since June, according to data from SpotGamma, which provides data and analytics about the derivatives market. Kramer said most of the stock’s advance over the past few months has been driven by aggressive call buying, which has forced options market makers to scoop up shares of the underlying stock to hedge their positions. While Nvidia has become the poster-child of the momentum trade, plenty of other stocks have gone along for the ride. That’s why Brent Kochuba, founder of SpotGamma, believes the broader market could decline next week, alongside Nvidia, as bullish call options tied to a swath of major U.S. companies are likely to cheapen after the chip maker reports its earnings. Once Nvidia’s earnings report has passed, implied volatility across the options market is likely to decline, Kochuba explained. This would be a typical reaction: implied volatility rises when investors see potentially market-moving events ahead that they want to hedge against, or speculate on. The opposite often happens when these events pass the market by. As implied volatility falls, the options would get cheaper, while allowing the market makers that sold them to dump some of the stocks they accumulated to hedge their positions. “Anything with a rich call skew could feel a bit more selling pressure” after Nvidia reports on Wednesday, Kochuba said in a note to clients shared with MarketWatch. Options market makers typically buy stocks or index futures to hedge their positions since, if an option goes in the money, they could be on the hook to deliver the underlying stock. Plenty of other technology names are seeing an extreme call option skew also, particularly semiconductor names like Advanced Micro Devices Inc. \n        AMD,\n        +0.50%\n       and Arm Holdings \n        ARM,\n        -0.50%,\n       as well as other Big Tech giants like Microsoft Corp. \n        MSFT,\n        -0.17%\n       as traders bet that Nvidia’s rising tide could lift the broader information-technology sector. Many on Wall Street, including Kramer, have been uneasy with the role the options market has played in driving the broader market higher since October, particularly as investors have reined in their expectations for the number of interest-rate cuts by the Federal Reserve this year, while earnings outside of a handful of megacap technology names have generally been lackluster, Kramer said. The market’s torrid advance has left stocks to trade at their richest levels relative to their expected earnings in more than two years as major equity indexes like the S&P 500 and Nasdaq-100 have marched into record territory, while Wall Street analysts’ expectations for corporate earnings growth in 2024 have lessened. The ratio of the S&P 500 relative to its expected full-year earnings recently topped  20 for the first time since early 2022, according to FactSet data, rising above its five-year and 10-year averages. The forward price-to-earnings ratio for the Nasdaq-100 \n        NDX\n       is even higher, and was trading north of 26 on Friday. “Stocks aren’t trading on earnings momentum. They are trading on multiple expansion,” Mott Capital’s Kramer said. To be sure, just because momentum has helped propel stocks higher, doesn’t mean traders can easily turn a profit by betting that the momentum will imminently reverse. As is often the case on Wall Street, momentum typically begets momentum. “The pace of these rallies is not really sustainable — and in the case of something like Nvidia, it sets a pretty high bar to hurdle on earnings — but timing when the momentum fades is always the tough part,” said Bret Kenwell, U.S. options investment analyst at eToro. U.S. stocks finished lower during the final trading session of the week, with the S&P 500 \n        SPX\n       and Nasdaq Composite \n        COMP\n       snapping five-week winning streaks. The Dow Jones Industrial Average \n        DJIA,\n       on the other hand, managed to extend its winning streak to a sixth straight week. Aside from Nvidia’s earnings, next week’s calendar of potentially market-moving events is looking pretty light, aside from the release of minutes from the Fed’s January meeting. Something unusual happened in the stock market this quarter: Both the S&P 500 and Cboe Volatility Index, better known as the Vix, rose. Joseph Adinolfi is a markets reporter at MarketWatch. Joseph Adinolfi is a markets reporter at MarketWatch. Visit a quote page and your recently viewed tickers will be displayed here. "
}