{
    "title": null,
    "date": "2/10/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37049954/nvidias-1-7-trillion-market-cap-surpasses-entire-chinese-stock-market-investment-strategist",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Nvidia Corporation NVDA has reached a market valuation that equals the entire Chinese stock market, a first in history. What Happened: The market cap of Nvidia, a leading chipmaker, has surged by $600 billion in the last two months, reaching $1.7 trillion, according to a recent research note from Bank of America chief investment strategist Michael Harnett, reported Business Insider. This valuation is now on par with the combined market cap of all Chinese-listed companies on the Hong Kong Stock Exchange. Nvidia’s market cap has nearly quadrupled since the beginning of 2023, with its stock rising by 239% in 2023 and an additional 41% in 2024. See Also: Surging Against The Odds – Nvidia’s Astounding 41% Growth In 2024 Amidst Global Challenges Meanwhile, China’s economic struggles have led to a significant drop in stock prices. The Hang Seng index, a key indicator for Chinese stocks listed in Hong Kong, has fallen by 26% over the past year and 8% year-to-date. Why It Matters: Despite its remarkable growth, some experts have expressed concerns about Nvidia’s valuation. Aswath Damodaran, often referred to as the “Dean of Valuation,” earlier stated that Nvidia’s stock is “priced to the point of insanity.” However, other analysts have a more optimistic view of Nvidia’s future. Joseph Moore, an analyst at Morgan Stanley, previously reiterated an Overweight rating on Nvidia and increased his price target to $750, citing the company’s strong near-term results and unique valuation. Moreover, Nvidia’s recent partnership with Cisco Systems to expand AI technology in the corporate sector has further bolstered its position as the most valuable chipmaker globally. Analysts are optimistic about Nvidia’s future growth potential, with Vivek Arya of Bank of America predicting a significant upside in the company’s quarterly earnings, driven by AI innovations and the upcoming B100 accelerator launch. Read Next: Nvidia’s RTX 4090 Graphics Card Frenzy: Supply Crisis Hits Hard Amid Global Demand Surge and US Sanctions Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo via Shutterstock. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}