{
    "title": "Forget About Nvidia. Small-Cap Stocks Are Way More Important.",
    "date": "2/26/2024",
    "url": "https://investorplace.com/2024/02/forget-about-nvidia-small-cap-stocks-are-way-more-important/",
    "text": " The divergence between small- and large-cap stocks matters for the stock market... and for your job Advertisement Source: iQoncept / Shutterstock Most small-cap stocks are still in a bear market. When a rising tide does not lift all boats, everybody drowns. We have never seen anything like this “new bull market” before in history, where the top names in the S&P 500 are so disproportionately driving total returns, while most stocks are nowhere near their 2021 highs. We know the reason why – it’s obvious and it’s something I’ve been saying for months. We are in a bear market, with a few stocks participating in a bubble. Higher interest rates are putting a tremendous squeeze on companies, and the risk of a credit event remains in place. There’s no other explanation. So, what do we do with this information? Is it possible that the broader market will start to catch up to mega-cap tech names like Nvidia (NASDAQ:NVDA)? It’s certainly possible. But it doesn’t change the near-term reality and risks. As noted by my friend Bob Elliott, we’ve never seen small-cap sensitivity to interest rates ever look like this before. Small-caps hold the key. https://t.co/OOfkx7vj2u It might be easy to dismiss the importance of small-cap stocks, especially with mega-cap names leading the way in all stock market indices. However, investors must remember that small businesses drive a huge part of the American economy, and of the American labor market. Unemployment would surge if some of these small firms ceased existing. These firms also are a key part of continued economic growth. So, while everyone is focused on the millions of dollars being made by investing in Nvidia, Rome is burning. Most companies are struggling. This can not last. It is unsustainable, and either resolves itself with a small-cap melt-up, or large-cap breakdown. The divergence is real, and yes, it very much matters not just for stock market health, but for your job too. On the date of publication, Michael Gayed did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. The Lead-Lag Report is provided by Lead-Lag Publishing, LLC. All opinions and views mentioned in this report constitute our judgments as of the date of writing and are subject to change at any time. Information within this material is not intended to be used as a primary basis for investment decisions and should also not be construed as advice meeting the particular investment needs of any individual investor. Trading signals produced by the Lead-Lag Report are independent of other services provided by Lead-Lag Publishing, LLC or its affiliates, and positioning of accounts under their management may differ. Please remember that investing involves risk, including loss of principal, and past performance may not be indicative of future results. Lead-Lag Publishing, LLC, its members, officers, directors and employees expressly disclaim all liability in respect to actions taken based on any or all of the information on this writing.\r\n\r\nMichael A. Gayed is the Publisher of The Lead-Lag Report, and Portfolio Manager at Tidal Financial Group, an investment management company specializing in ETF-focused research, investment strategies and services designed for financial advisors, RIAs, family offices and investment managers.\r\n\r\nInvestorPlace readers that are new subscribers to the The Lead-Lag Report can receive a 30% discount.   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/forget-about-nvidia-small-cap-stocks-are-way-more-important/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}