{
    "title": "Why Nvidia (NVDA) is a Top Stock for the Long-Term",
    "date": "2/28/2024",
    "url": "https://finance.yahoo.com/news/why-nvidia-nvda-top-stock-143002129.html",
    "text": "Kickstarting your investment journey can be both exciting and scary at the same time, and if you're new to investing, you may not know where to even begin. However, one thing is for certain -- stocks set to beat the market over the next 12 months serve as the perfect foundation for any kind of investor. Now, let's take a deep dive into a great stock that could be just the right addition to your portfolio. Why You Should Pay Attention to Nvidia (NVDA) NVIDIA Corporation is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit, or GPU. Over the years, the company’s focus has evolved from PC graphics to artificial intelligence (AI) based solutions that now support high performance computing (HPC), gaming and virtual reality (VR) platforms. NVDA was added to the Zacks Focus List on May 20, 2019 at $39.13 per share. Since then, shares have increased 1911.27% to $787.01. 13 analysts revised their earnings estimate higher in the last 60 days for fiscal 2025, while the Zacks Consensus Estimate has increased $3.46 to $23.22. NVDA also boasts an average earnings surprise of 20.2%. Additionally, Nvidia's earnings are expected to grow 79.2% for the current fiscal year. Because stock prices react to revisions, buying stocks with rising earnings estimates can be very profitable. Focus List stocks like NVDA offer investors a great opportunity to get into a company whose future earnings estimates will be raised, potentially leading to price momentum. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}