{
    "title": "Futures File: Equities pause, reflect positive Nvidia earnings",
    "date": "2/24/2024",
    "url": "https://www.record-eagle.com/news/business/futures-file-equities-pause-reflect-positive-nvidia-earnings/article_ecde8c22-d33f-11ee-9fb7-3f9ab747a5a9.html",
    "text": "Cloudy with rain and snow. High around 40F. Winds NNE at 5 to 10 mph. Chance of rain 90%.. Overcast. Low 29F. Winds NW at 5 to 10 mph. Updated: March 30, 2024 @ 12:22 pm   Hermesch The S&P, Dow Jones, and NASDAQ indices have moved sharply higher since last November with all three markets making new all-time highs in the month of February. Equities took a step back from new highs last week and had the look of a market that might have peaked temporarily and due for a break. A highly anticipated earnings report for Nvidia that was bullish on its own merit and as compared to trade estimates turned the potential break into a blip on the radar with new all-time highs being made in the stock market shortly after the earnings release. Nvidia is a — if not the — world leader in artificial intelligence (AI) computing. The current environment surrounding AI stocks is a frenzy with headlines and expanding market caps that resemble the dot com phase of the late '90s and early 2000s. When people reference the dot-com phase, it is often referred to as the dot com “bubble.” Several dot-com stocks that came out of nowhere in the late '90s purchased a roundtrip ticket ending up right back where they started by the mid 2000s. AI potential may seem limitless, but the ability to tap that potential is uncertain, and unknown. Replace AI with “the internet” and that statement would have fit the late '90s as well. Not all dot-coms or AI enterprises are created equal. If a bubble should form and burst at some point, there will still be individual winners as there was in the wake of the dot-com bubble burst. A stock market that rallies sharply across the board with the news of one company’s earnings report that isn’t a FAANG (Facebook, Amazon, Apple, Netflix, Google) member is either a reasonable indicator that a bubble is forming or an update from FAANG to FAANNG is going to make its way into the vernacular soon. Have a comment or question? Please reach out to derrick.hermesch@pinionglobal.com or call at 785-338-9605. Information contained herein is believed to be reliable, but cannot be guaranteed as to its accuracy or completeness. Past performance is no guarantee of future results or profitability. Futures and options trading involve substantial risk of loss and is not suitable for all investors. All information, including this specific material, used and distributed by Paragon Investments LLC (PI) shall be construed as a solicitation for entering into a derivatives transaction. PI does not distribute research reports, employ research analysts, or maintain a research department as defined in CFTC Regulation 1.71. Sign up now to get our FREE breaking news coverage delivered right to your inbox. First Amendment: Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}