{
    "title": "Druckenmiller dumps Alphabet, Amazon and Broadcom; Nvidia remains largest \nholding",
    "date": "2/14/2024",
    "url": "https://www.marketwatch.com/story/druckenmiller-dumps-alphabet-amazon-and-broadcom-but-nvidia-remains-largest-holding-81678a19",
    "text": "Duquesne Family Office, the investment vehicle belonging to famed macro investor Stanley Druckenmiller, dumped shares of Alphabet Inc., Amazon.com \n        AMZN,\n        +0.31%\n       and Broadcom Inc. \n        AVGO,\n        +0.51%\n       while scooping up shares of beaten-down gold miners Barrick Gold Corp. \n        GOLD,\n        +2.65%\n       and Newmont Corp. \n        NEM,\n        +1.67%,\n       according to a Wednesday filing with the Securities and Exchange Commission. The filing showed that the family office also bought shares of Adobe Inc. \n        ADBE,\n        +0.04%\n       and Arista Networks \n        ANET,\n        +0.54%,\n       two companies that have benefited from the artificial-intelligence craze, while dumping shares of Alibaba Group Holding Ltd.  \n        BABA,\n        +1.08%. In another AI-related play, Druckenmiller bought 64,715 shares of Palo Alto Networks \n        PANW,\n        +0.66%\n       last quarter, according to the filing. AI remained a prominent theme in Druckenmiller’s portfolio as of Dec. 31, Nvidia Corp. \n        NVDA,\n        +0.12%\n       was Druckenmiller’s biggest position, with his fund holding shares worth nearly $550 million. Druckenmiller touted Nvidia as an artificial-intelligence play early last year, before saying that the stock was in ”nosebleed” territory in the fall. Shares of the chipmaker have nearly doubled in value since then: They’re up nearly 50% since the start of 2024 alone, according to FactSet data. The company comprises roughly 16% of Druckenmiller’s total equity holdings. The legendary fund manager, who rose to prominence due to his work with George Soros, closed his firm to outside investors more than a decade ago. However, his views on markets remain sought-after by the financial press and both investment professionals and amateurs alike. His decision to sell shares of Alphabet \n        GOOG,\n        +0.21%\nGOOGL,\n        +0.04%\n       is notable for a seemingly quick exit:  He bought the stock during the third quarter of 2023. He also sold about 50,000 shares of Eli Lilly \n        LLY,\n        -0.03%,\n       which has rocketed into the ranks of the top 10 most valuable companies in the S&P 500 over the past few months due to its weight-loss and diabetes drugs Zepbound and Mounjaro, according to FactSet data. All told, Duquesne had a strong quarter for his equity portfolio. The value of his total stock holdings rose by more than 20% to nearly $3.4 billion. Hedge funds and family offices are required to report their holdings quarterly to the SEC, but the filing only includes long positions in stocks, and may not offer a complete picture of Duquesne’s holdings or performance. For more 13-F reports: • George Soros’ fund bets on U.S. leisure travel, with fresh stakes in JetBlue, Spirit, Sun Country • David Einhorn’s Greenlight Capital adds Kenvue, ETFs and exits Southwestern Energy • Berkshire Hathaway loads up on shares of Sirius XM and Chevron, exits home builder D.R. Horton • Appaloosa takes new stakes in Oracle and GM, raises stakes in Alibaba and Microsoft • Nvidia discloses positions in SoundHound AI, Arm — and these other stocks Walgreens’ stock seesawed around the flatline Thursday, after the drugstore chain swung to a large quarterly net loss and trimmed its full-year outlook, but also reported the biggest beat for quarterly adjusted profit in at least five years. Joseph Adinolfi is a markets reporter at MarketWatch. Joseph Adinolfi is a markets reporter at MarketWatch. Visit a quote page and your recently viewed tickers will be displayed here. "
}