{
    "title": "Nvidia surpasses $2 trillion market cap and becomes more valuable than \nGoogle and Amazon",
    "date": "2/29/2024",
    "url": "https://supercarblondie.com/nvidia-surpasses-market-cap-more-valuable-google-amazon/",
    "text": "  Published on Feb 29, 2024 at 2:41PM (UTC+4) Last updated on Feb 29, 2024 at 3:30PM (UTC+4) Nvidia has made history, briefly exceeding $2 trillion and the market cap during trading last week. The significant milestone was reached on Friday (23 February). As well as putting it ahead of Amazon and Google, it also surpassed Alphabet, Meta, and put it well ahead of Tesla. READ MORE! Elon Musk shares new video of ‘Optimus’ robot strolling confidently around lab In fact, only two members of the Magnificent Seven still surpass it. This includes Microsoft, which boasts a market cap of $3.07 trillion, and Apple, which sits at $2.84 trillion. It followed a positive earnings report that had already revealed a substantial revenue increase. In fact, the company’s fiscal fourth-quarter earnings revealed a 265 percent surge in revenue. That took them up to $22.10 billion. It’s thought that the surge is driven by the booming demand for artificial intelligence technology. Demand for its chips by makers of artificial intelligence continues to rise. However, despite this achievement, Nvidia’s stock closed up less than 1 percent on the same day. It’s proof, if it were needed, of the transient nature of market valuations. Despite the rollercoaster, there is a general uptick in the company’s fortune. The achievement comes just over a week after Nvidia became the third most valuable U.S. company, leapfrogging Google. Nvidia has seen its market capitalization increase by the worth of Tesla over the past two months. Its shares are up 68 percent year on year. Apple was the first company to hit $3 trillion in market cap – despite recent bad news that the Apple Car project has been shelved. Microsoft cleared $1 trillion five years ago. Looking at individual wealth, Elon Musk looks set to become the world’s first trillionaire. Musk and Bernard Arnault are constantly vying for the title of ‘richest man in the world‘. Nvidia revenue is expected to climb by 120% in fiscal 2024, with another 60% jump expected next year. Apple employees spill key details about the death of the Apple Car after $10 billion was spent on it 2003 footage shows how extraordinary it was to live near London Heathrow Airport as Concorde took off Instagram\nFacebook\nTwitter\nLikedin Copyrights ©2024 SB Media Holding Limited "
}