{
    "title": null,
    "date": "2/1/2024",
    "url": "https://techwireasia.com/02/2024/singtel-partners-nvidia-for-sovereign-ai/",
    "text": "Singtel will collaborate with Nvidia to make AI adoption more accessible not only in Singapore but in Southeast Asia. (Photo: RENDY ARYANTO/VVS.sg). By Aaron Raj | 1 February, 2024 When it comes to AI adoption in Southeast Asia, Singapore has been leading the revolution for some time. As other countries in the region continue to play catch up, Singaporean organizations are way ahead of the game. But that does not mean that the other countries are being left behind. In fact, Singapore has been innovating AI use cases with the hopes of sharing the knowledge and solutions developed with businesses in the region. Such businesses know that collaboration in technology is the best way forward for them all. Dashveenjit Kaur | 31 January, 2024 When the government announced the National AI Strategy 2.0, one of the key shifts from the initial strategy the country hoped to achieve was moving from local to global. Put simply, the strategy states that Singapore must operate from the outset with a global outlook for AI. “We must connect to global networks, working with the best and pooling resources among the like-minded to overcome the complex challenges that plague AI today.” As such, Singtel is launching its initiative to advance AI development in Singapore and the region. The telco giant is tying up with global and local ecosystem partners across AI, renewable energy, sustainable technologies and talent development. The initiative comes as the company is scaling its regional data center business, having gained a foothold in new markets beyond Singapore like Indonesia and Thailand where it is building a new generation of green, sustainable and hyper-connected AI-ready data centers. Singtel’s Digital InfraCo unit and Nvidia will collaborate on opportunities to support Singapore’s updated National AI Strategy 2.0. At the launch of Singtel’s new data center brand, Nxera, the telco giant also announced four strategic MOUs for developing technology for the region. Specifically, Singtel will collaborate with Nvidia to make AI adoption more accessible not only in Singapore but in Southeast Asia as well. Singtel’s Digital InfraCo unit and Nvidia will collaborate on opportunities to support Singapore’s updated National AI Strategy 2.0 to drive innovation and create new value through AI. In becoming an Nvidia cloud partner in the region, Singtel will democratize AI access for enterprises, large and small, to Nvidia GPU clusters hosted in Nxera’s AI DC platform in the region. Muhammad Zulhusni | 19 January, 2024 Businesses can use Singtel’s extensive fixed broadband network, submarine cables and 5G high-speed network connectivity together with the patented Paragon cloud platform to orchestrate their AI workloads in a multi-network and multi-cloud environment. Nxera will also provide customers with carrier neutrality to meet all their connectivity resiliency needs. Apart from the collaboration with Nvidia, Singtel will also tap the renewable energy expertise of Gulf Energy, Medco Power, Sembcorp and TNB Renewables to accelerate Nxera’s journey towards net-zero emissions. This includes establishing a co-innovation platform with technology partners to improve power and water efficiency and operational resiliency. Bill Chang, CEO of Nxera and Singtel’s Digital InfraCo unit commented that the launch of the Nxera data center brand is a key milestone for Singtel’s data center business as the company looks to expand its footprint in the region beyond 200MW over the next three years. “As we build out our data center business, we are putting in place a purpose-driven, fully aligned group of ecosystem partners with distinctive capabilities and unique platforms that will help us grow this digital infrastructure in an AI world – sustainably and responsibly. This means democratizing AI access for enterprises, introducing renewable energy and sustainable technologies, and helping produce the talent for our new generation of data centers,” he said. “Digitalization shouldn’t come at the expense of our decarbonization efforts. In fact, it should accelerate our efforts. Given our aim to achieve operational net-zero emissions for our data center business by 2028, these partnerships are critical to laying the groundwork for turning digitalization into a driver for decarbonization,” he added. Singtel will also be creating a Regional Sustainable Data Centre Academy with five institutes of higher learning. (Source – Singtel). Singtel will also be creating a Regional Sustainable Data Centre Academy with five institutes of higher learning to train more than 150 students annually for its data center business, ecosystem partners and the industry. The academy will launch in mid-2024 with Singapore Institute of Technology, Nanyang Polytechnic, Singapore Polytechnic, Temasek Polytechnic and Institute of Technical Education as its first partners. Nxera will jointly develop curriculum and training programs incorporating practical workplace asynchronous learning for existing undergraduate, diploma and ITE DC-related courses and upskilling opportunities for seasoned and mid-career professionals, including competency-based, stackable micro-credentials that align with the latest technologies and practices as well as mentoring from industry experts. This collaboration will be extended to other institutes in its regional markets of Thailand and Indonesia in the next phase. “As an industry leader, we are developing a sustainable data center talent pipeline to power our growth in the region. It will augment and strengthen our long-standing expertise in designing, developing and operating data centers as we aim to make Nxera a trusted data center brand that is future-proofed – one that provides excellent interconnectivity, efficiency, resiliency with high power density while remaining sustainable,” explained Chang. Singapore’s service provider joins pioneers in France, India, Italy and Switzerland in deploying AI factories that deliver generative AI services with data sovereignty. (Image generated by AI). Singtel also announced that Nxera is currently developing three AI data center projects. The new 58MW DC Tuas in Singapore and data centers with partners Telkom and Medco Power in Indonesia and Gulf Energy and AIS in Thailand will increase its total pipeline capacity to more than 200MW from its current operational capacity of 62MW in Singapore. According to a report by Nvidia, the energy-efficient data centers across Southeast Asia are accelerated with Nvidia Hopper architecture GPUs and using Nvidia AI reference architectures proven to deliver optimal performance. The data centers will serve as sovereign national resources. Basically, they would be AI factories that process the private datasets of companies, startups, universities and governments safely onshore to produce valuable insights. Nxera will offer its customers Nvidia AI Enterprise, a software platform for building and deploying AI applications, including generative AI. Singapore’s service provider joins pioneers in France, India, Italy and Switzerland in deploying AI factories that deliver generative AI services with data sovereignty. Nxera is expected to continue to execute this approach as it expands its footprint in Asia Pacific, including India and Australia. By Aaron Raj Aaron RajAaron enjoys writing about enterprise technology in the region. He has attended and covered many local and international tech expos, events and forums, speaking to some of the biggest tech personalities in the industry. With over a decade of experience in the media, Aaron previously worked on politics, business, sports and entertainment news. Aaron enjoys writing about enterprise technology in the region. He has attended and covered many local and international tech expos, events and forums, speaking to some of the biggest tech personalities in the industry. With over a decade of experience in the media, Aaron previously worked on politics, business, sports and entertainment news. © 2024 Tech Wire Asia | All Rights Reserved Terms of use Privacy Policy "
}