{
    "title": "An Opportunity In Small Caps Or A Danger Sign, All Important CPI Ahead - \nNVIDIA (NASDAQ:NVDA)",
    "date": "2/12/2024",
    "url": "https://www.benzinga.com/markets/24/02/37072985/an-opportunity-in-small-caps-or-a-danger-sign-all-important-cpi-ahead",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW To gain an edge, this is what you need to know today. Please click here for an enlarged version of the chart of small cap iShares Russell 2000 ETF IWM. Note the following: In the early trade, money flows are positive in NVIDIA Corp NVDA. In the early trade, money flows are neutral in Apple Inc AAPL, Amazon.com, Inc. AMZN, Meta Platforms Inc META, and Microsoft Corp MSFT. In the early trade, money flows are negative in Alphabet Inc Class C GOOG and Tesla Inc TSLA. In the early trade, money flows are mixed in SPDR S&P 500 ETF Trust SPY and Invesco QQQ Trust Series 1 QQQ. The momo crowd is buying stocks in the early trade. Smart money is inactive in the early trade. The momo crowd is like a yoyo in gold in the early trade. Smart money is inactive in the early trade. For longer-term, please see gold and silver ratings. The most popular ETF for gold is SPDR Gold Trust GLD. The most popular ETF for silver is iShares Silver Trust SLV. The momo crowd is like a yoyo in oil in the early trade. Smart money is inactive in the early trade. For longer-term, please see oil ratings. The most popular ETF for oil is United States Oil ETF USO. Bitcoin BTC/USD rallied to $48,795, where it met resistance. It is pulling back as of this writing on slight disappointment that whales did not push bitcoin to $50,000 over the weekend. Those who understand whales’ secrets know that whales are very smart, and they preserve the element of surprise, not always doing exactly what is expected. It is important for investors to look ahead and not in the rearview mirror. Consider continuing to hold good, very long term, existing positions. Based on individual risk preference, consider a protection band consisting of cash or Treasury bills or short-term tactical trades as well as short to medium term hedges and short term hedges. This is a good way to protect yourself and participate in the upside at the same time. You can determine your protection bands by adding cash to hedges.  The high band of the protection is appropriate for those who are older or conservative. The low band of the protection is appropriate for those who are younger or aggressive.  If you do not hedge, the total cash level should be more than stated above but significantly less than cash plus hedges. It is worth reminding that you cannot take advantage of new upcoming opportunities if you are not holding enough cash.  When adjusting hedge levels, consider adjusting partial stop quantities for stock positions (non ETF); consider using wider stops on remaining quantities and also allowing more room for high beta stocks.  High beta stocks are the ones that move more than the market. Probability based risk reward adjusted for inflation does not favor long duration strategic bond allocation at this time. Those who want to stick to traditional 60% allocation to stocks and 40% to bonds may consider focusing on only high quality bonds and bonds of seven year duration or less.  Those willing to bring sophistication to their investing may consider using bond ETFs as tactical positions and not strategic positions at this time. The Arora Report is known for its accurate calls.  The Arora Report correctly called the 2008 financial crash, the start of a mega bull market in 2009, the COVID crash, the post-COVID bull market, and the 2022 bear market.  Please click here to sign up for a free forever Generate Wealth Newsletter. This article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}