{
    "title": "'Euphoria in Nvidia': How long can it last?",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/video/euphoria-nvidia-long-last-211410413.html",
    "text": "While equity markets (^GSPC, ^DJI, ^IXIC) are mixed as investors remain wary before new inflation data, the AI rally has continued for most of the companies involved, most notably Nvidia (NVDA). Commerce Street Capital President Dory Wiley joins Yahoo Finance to discuss the popularity of Nvidia and the market's attempts to balance the AI rally with the expectation of rate cuts. He also explains what investors need to keep in mind when trading these stocks. Wiley expands on his thoughts about Nvidia in this market: \"I think you under-allocate Mag Seven...at your own risk. I think you gotta stay allocated and I think you have to tilt to some of your favorites like Nvidia, and that's been working. It's because there's fundamental reasons to do so. Microsoft, Nvidia, massive margins, massive market entrenchment and great return on equity, estimated earnings, estimated revenues continue expanding. You saw for Nvidia what they did -- their net income is what? Up almost 586%? What kind of company gets you that? A company like that warrants a euphoria.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino JOSH LIPTON: So for a closer look at how to play or avoid this momentum trade, joining us now is Dory Wiley, Commerce Street Capital President. Dory, it is good to see you. I don't know if you were listening, Dory, to this conversation I was having with Julie here. And we were just kind of talking about this the kind of broader investing environment we find ourselves here in, Dory. You know, we look at these moves in Nvidia, the broader kind of AI mania we're seeing. And of course, Bitcoin rallying. And just love, Dory, just to start get your take on what do you make of some of these moves, what do you make about the environment we find ourselves in. DORY WILEY: Well, good to be on. And I was enjoying the conversation, because I think we have a new mental mindset today that we haven't had for a while. Previously, you know, recommending, making sure you're allocated to the big seven or Magnificent Seven, x Tesla, overweight Nvidia, that's been working for us as a money manager. But now today, which is the conversation you have. We knew that-- we know there's euphoria in Nvidia, right? We don't know how much. But there's a core reason to own the Nvidia. It supplies all this AI to everyone. It makes money. It coins money. It has a massive margin. And everything's at lightspeed with accelerated computing and what they're doing in AI. And they're touching all the other [INAUDIBLE]. So but there's something different today, just something different. Bitcoin, that's a euphoria measure. Some of these other stocks, I was looking up SoundHound today, you know, it's got a great technology and voice AI. But when you look at it, it's got a market cap of $1.8 billion. And it has $34 million in revenues. Well, immediately, when you look at that, my mind goes back, this is dotcom-ish. You know, I remember these kind of numbers in dotcom. I have a 1.8 billion market cap on $34 billion of revenues. That's more euphoria than we have in fundamentals. Doesn't mean they don't have a great product, doesn't mean they don't have a great future, but surely that's a little ahead of itself, doesn't even make money yet. And neither does another one bear AI the same thing. Great product, great job in AI was logistics and supply chains, getting themselves into the market, getting entrenched. But again, they don't have the revenues. They have a $525 million market cap with revenues 154 million. Not as bad as SoundHound, but still ahead of itself. And we're seeing this in the market today, a little more euphoria. And so the question I have for myself today was, is this the beginning of euphoria? Because I was-- I was OK with this tech rally because there were fundamental reasons for it. But now, it's starting to feel euphoric. And how long can that go? If you remember the irrational exuberance speech started in February of '96, and it took four years to pop the bubble. JULIE HYMAN: I mean, it feels like it's been going here for a little while now, Dory, right? Certainly not four years, but call it maybe six months-- maybe you can even date it back to when Nvidia first shocked the market last spring with its forecast. So I guess the question is, in this kind of a market, do you try and chase or participate or risk leaving out not participating in the upside for some of these? Or how do you kind of play it in a smart way? DORY WILEY: So what we've been doing is I think you under-allocate Mag Seven or Mag Six-- ex-Tesla, because I can find fundamental reasons not to do that-- at your own risk. I think you got to stay allocated. And I think you have to tilt to some of your favorites like Nvidia, and that's been working. But it's because there's fundamental reasons to do so. Microsoft, Nvidia, massive margins, massive market entrenchment, and great return on equity. Estimated earnings, estimated revenues continue expanding. You saw for Nvidia what they did-- what they did with their-- I mean, their net income is, what, up almost 586%? I mean, what kind of company gets you that? A company like that warrants a euphoria. So I'm OK with that. So I think you got to stay allocated there. And if it drops 20%, hallelujah. It'll shake off some of the euphoria, and you still got a really good company. I kind of hope that happens. I told my trader the other day, buy on the dips in Nvidia. And he goes, there are no dips. I said, no, a dip is when it goes up only 2% that day. JOSH LIPTON: Dory, I also wanted to get your take on a big piece of economic data we're still waiting for, Dory, PCE on Thursday. We know that, of course, is Jay Powell's preferred inflation gauge. What are you looking for there, Dory? How important do you think that is going to be for the market? DORY WILEY: If it's a real material change, that'll be real important-- I'm talking about to the downside or the upside. Know this-- if you listen to Powell and Mickey Bowman, who I got a chance to interview the other day, and some others, they're very skeptical about the inflation data. They're very skeptical about the unemployment data. So I don't think you'll see them knee-jerk anything right now in changing their statements from beyond a possible rate cut in May-- more likely later in the year, some of the Fed speak that's come out this week. I don't expect that to deviate a whole lot. And if the number is pretty close to expected, then nothing changes. JULIE HYMAN: And sort of what's the feeling-- the consensus has seemed to come around to that the economy's going to be pretty good this year, that we're going to see pretty strong GDP growth, especially relative to what expectations were. Is that how you're viewing this as well? And then again, how does that feed through to the market? DORY WILEY: I think we have to balance that with the market expectations, absolutely. So the market is trying to balance this AI rally, if you will, with the expectation of rate cuts. Where I think the market's been making a mistake and has been for the last 20 months now is we don't have to have rate cuts to do OK. We don't have to have them. So it's almost like weaning the market off the bottle. We pull the bottle away, the market's got to grow up. The economy is going to be fine. Having 5%, 5.25% Fed funds, that's OK. People can handle that. We've had that for years. If you remember 20, 30 years ago, all passbook savings and now accounts all paid 5%. So that is OK. The market can do very well with rates not cutting at all. We don't have to have the rate cuts. And I think that's where the market's been missing it. Related Quotes "
}