{
    "title": null,
    "date": "2/6/2024",
    "url": "https://finance.yahoo.com/video/nvidias-market-cap-nearly-100b-151949300.html",
    "text": "Shares of Nvidia (NVDA) continue to rise as the company reaches a new milestone of having a $100 billion higher market cap than the entire energy sector. The chipmaker is rapidly approaching a $2 trillion market cap, after breaking the $1 trillion market cap just last year. Yahoo Finance Executive Editor Brian Sozzi joins the Live show to discuss Nvidia and its latest achievements. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino BRAD SMITH: Soz, you're watching one big milestone, a stock hitting an interesting one this morning. BRIAN SOZZI: Yeah, you need stats? I got them for you. Or in this case, Charlie Bilello over at Creative Planning. Really fun fact that I came across on my Twitter/X feed. NVIDIA's market cap is now over $100 billion higher than all of the companies in the S&P 500 energy sector. So just doing some quick math, the market caps for Exxon, Chevron, and Conoco-- really, the three biggest oil companies by market cap-- about $825 billion. Guys, NVIDIA right now, over $1.7 trillion market cap. Now it was just early last year, the company crossed the $1 trillion market cap for the first time. It's just-- it's a mind blowing story. BRAD SMITH: I mean, this might be the fastest that we see a company get to $2 trillion after we've seen them finally get to $1 trillion. And ultimately, they still hold the title for that as well. BRIAN SOZZI: I mean, we're supposed to be skeptical in this gig, but I mean, NVIDIA is selling a lot of chips that people need for AI. I mean, what else do you need to know about the story? BRAD SMITH: Absolutely. All right, it's already struck a lot of key price targets out there on the Street. We'll see where investors and analysts keep nudging that higher. Related Quotes "
}