{
    "title": "Nvidia announces AI-powered health care 'agents' that outperform nurses — \nand cost $9 an hour",
    "date": "3/21/2024",
    "url": "https://ca.finance.yahoo.com/news/nvidia-announces-ai-powered-health-220120829.html",
    "text": "High-powered chipmaker Nvidia has teamed up with artificial intelligence health care company Hippocratic AI to develop generative AI \"agents\" that not only outperform human nurses on video calls but cost a lot less per hour. The two companies on Thursday announced their collaboration to build \"empathetic health care agents\" powered by Nvidia and trained on Hippocratic's health care-focused large language model (LLM) that are better able to form a human connection with patients through \"super-low latency conversational reactions.\" Hippocratic's agents have already been tested by more than 1,000 registered nurses and 100 licensed physicians in the U.S., and dozens of health care providers are trying out the bots internally for non-diagnostic tasks. The company's data shows its bots outperform not only rivals such as OpenAI's GPT-4 and the LLaMA 2 70B Chat, but beat human nurses in every category tested. NVIDIA CEO JENSEN HUANG ANNOUNCES COMPANY'S NEXT-GEN AI CHIP Hippocratic says its Constellation model outperformed real nurses 79% to 63% in identifying a medication's impact on lab values; 88% to 45% in identifying condition-specific disallowed over-the-counter medications; 96% to 93% in correctly comparing a lab value to a reference range; and 81% to 57% in detecting toxic dosages of over-the-counter drugs. READ ON THE FOX BUSINESS APP In a press release, Nvidia and Hippocratic touted the agents as a way to help ease the shortage of health care workers in the U.S. INTEL PLANS US BUILDING SPREE THANKS TO BILLIONS IN FEDERAL CHIP SUBSIDIES Munjal Shah, co-founder and CEO of Hippocratic AI, said in a statement, \"We’re working with NVIDIA to continue refining our technology and amplify the impact of our work of mitigating staffing shortages while enhancing access, equity and patient outcomes.\" WHAT IS ARTIFICIAL INTELLIGENCE (AI)? \"Voice-based digital agents powered by generative AI can usher in an age of abundance in health care, but only if the technology responds to patients as a human would,\" Kimberly Powell, Nvidia's vice president of health care, said. The generative AI-powered bots also cost a fraction of the hourly rate for nurses. Hippocratic's website shows its agents cost $9 an hour to operate. According to the Bureau of Labor Statistics, the median hourly pay for nurses was $39.05 as of 2022.  Original article source: Nvidia announces AI-powered health care 'agents' that outperform nurses — and cost $9 an hour $46.25 for four ibuprofen tablets, lmao. This food habit is linked to a specific type of dementia.  MISSISSAUGA, Ont. — Ontario's top doctor is calling on the province to immediately enact policy that will restrict access to alcohol, vapes and cannabis as the number of people who have died or visited a hospital due to using multiple substances has spiked in recent years. But Dr. Kieran Moore, the province's chief medical officer of health, also recommends Ontario decriminalize simple possession of unregulated drugs for personal use and make safer supply accessible to reduce the number of peopl The Ozempic rival helped people lose weight while keeping more of their muscles intact. In a trial, people lost 75% fat and 25% muscle. A Toronto police officer who has been the subject of multiple cases of misconduct in the workplace, including an incident where he was found guilty of assaulting a cyclist, is set to be fired.  McALLEN, Texas (AP) — A Texas woman who was charged with murder over self-managing an abortion and spent two nights in jail has sued prosecutors along the U.S.-Mexico border who put the criminal case in motion before it was later dropped. The lawsuit filed by Lizelle Gonzalez in federal court Thursday comes a month after the State Bar of Texas fined and disciplined the district attorney in rural Starr County over the case in 2022, when Gonzalez was charged with murder in “the death of an individ Kate Middleton and Prince William will not attend Easter services at St. George’s Chapel at Windsor Castle on Easter Sunday. References from conservative justices to a long-dormant chastity law during the Supreme Court’s arguments in a major abortion pill case this week are bringing new attention to the 19th century statute, which prohibits the mailing of drugs used for abortions among other “obscene, lewd, lascivious” or “indecent” materials.  Health officials are alerting doctors to be on the lookout for certain types of rare but serious meningococcal infections that are on the rise in the United States. Yogurt has rightfully earned a spot in the refrigerator of many health-conscious consumers. We're here to weed out many of the misconceptions about it. From melanoma to perimenopause, Canadians had a range of health-related questions on their mind. Trade 24 hours a day on the world's most popular platform. The 'Shark Tank' star said that their arrangements add a bit of intrigue now that they're able to adhere to their own routines The test policy to help address a deadly drug crisis in British Columbia faces public backlash and political challenges. In this article, we are going to discuss the 20 European cities with the highest weed consumption. You can skip our detailed analysis of the global cannabis industry, the legalization of cannabis in Germany, and the offshore business activities of some US-based cannabis companies, and go directly to the 5 European Cities with Highest Weed […]  \"I never thought I would be a first-time mom at 43, but I am so thankful we have our son and wouldn't change our journey for anything!\" Transgender people in Idaho will no longer be able to use Medicaid and other publicly funded programs to help cover the cost of gender-affirming medical care under a new state law set to take effect in July. Republican Gov. Brad Little quietly signed the measure Wednesday, a day after receiving it from Idaho’s GOP-controlled Legislature.… A doctor who worked at Al-Shifa Hospital in Gaza, which is under siege by the IDF, says he has lost contact with other doctors who are still working there. Anna Coren speaks with Dr. Ghassan Abu Sittah, who is calling on the ICRC to help get medical personnel and civilians out of Al-Shifa.  Should pets consume food like eggs and garlic, or what about apples and baked bread? We have the answers. Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. Some strains of this opportunistic pathogen are also increasingly becoming resistant to the drugs designed to treat them. "
}