{
    "title": "Stock market today: Stock rally stalls after jobs report, Nvidia sinks 5%",
    "date": "3/8/2024",
    "url": "https://finance.yahoo.com/news/stock-market-today-stock-rally-stalls-after-jobs-report-nvidia-sinks-5-134312027.html",
    "text": "Stocks ended the week with a thud, closing down on Friday, as investors pulled back after February's job report and market powerhouse Nvidia (NVDA) had a rare off-day. The S&P 500 (^GSPC) lost 0.7% after logging another record close on Thursday, while the Dow Jones Industrial Average (^DJI) shed 0.2%, with losses pared by a pop in Apple (AAPL) shares. The tech-heavy Nasdaq Composite (^IXIC) lost 1.2% after a sharp gain the previous day. Shares of Nvidia fell more than 5% after a record-breaking hot streak. Friday's non-farm payrolls report showed the US economy added 275,000 jobs in February, once again zooming past Wall Street expectations. However, the unemployment rate ticked up to 3.9%, its first increase in four months. Futures on the three major averages were trading in red figures ahead of the jobs data. The report bolstered investor confidence that the Federal Reserve will cut rates following its June meeting, but the momentum fizzled by the end of the trading day. Showing how the wind is blowing elsewhere, policymakers from the European Central Bank lined up to support a rate cut before their summer break as inflation falls faster than expected. Meanwhile, Bank of Japan officials are said to be warming to the idea of finally lifting rates out of the negative zone. On the corporate front, Costco (COST) shares fell 7% after its quarterly sales miss overshadowed an earnings beat. Broadcom's (AVGO) revenue beat and forecast for $10 billion in sales of AI-linked chips failed to impress investors, sending the stock over 6% lower. In commodities, gold futures (GC=F) continued to rally, as spot gold eyed its biggest weekly jump in five months amid optimism for a mid-year Fed rate cut. How high will Nvidia (NVDA) go? Friday's trading session offered an answer, at least temporarily. Wall Street ended the day down as investors took profits and paused what had been a staggering rally for Big Tech names, including the AI chipmaker. The S&P 500 (^GSPC) lost 0.7% while the Dow Jones Industrial Average (^DJI) shed 0.2%, with losses tempered by Apple's (AAPL) gains. The tech-heavy Nasdaq Composite (^IXIC) lost 1.2% after a sharp increase the previous day. Shares of Nvidia fell more than 5%, pausing a hot streak. Just as the most influential and popular cryptocurrency set an all-time record — briefly surpassing $70,000 — SEC Chair Gary Gensler offered new warnings about cryptocurrencies, saying in an interview with Yahoo Finance's Jennifer Schonberger that \"the whole field is rife with abuses and fraud.\" Investors, he added, should be aware that bitcoin is a \"highly speculative, volatile underlying asset.\" His remarks come amid a crypto resurgence. Bitcoin this week reached levels that investors have not seen since the 2021 boom, climbing out from the doldrums of the 2022 crash. The latest rally was sparked by demand from a series of spot bitcoin exchange-traded funds that started trading in January after receiving approvals from the SEC. Gensler voted in favor of those ETFs. On Friday he said of that decision \"I thought it was the most straightforward path forward.\" See the full interview and story here. Mean-reversion is the trade today, though some will call it \"profit-taking.\" Regardless, some of year's biggest winners like Nvidia (NVDA) and Marvell (MRVL) are down decent amounts as beaten-down stocks like Apple (AAPL) and Etsy (ETSY) are seeing a nice pop. Apple stock has been particularly weak lately, suffering the biggest drop in Relative Strength Index (RSI) since December 2018. Thursday's close at 21.9 is solidly below the 30 level, which is commonly understood to indicate \"oversold.\" When a stock becomes deeply oversold like this, it can potentially lead to an interim bottom. (It can work the other way too at highs when a stock is overbought.) But this is not always the case. The above study reveals how Apple stock fared following a close in RSI above 25 after closing below it the prior day. This \"oversold pop\" setup in Apple has caught a few price bottoms precisely — like June 28, 2013, and Feb. 6, 2018 — leading to both short- and long-term gains. But, more often than not in the dozen instances this signal has fired since the year 2000, Apple stock bleeds lower in the subsequent days and weeks. The average and median returns are negative in time periods up to one month following the signal. Notably, the results get much better as more time passes, with average gains of over 25% one year later and 75% positive results. Less than a week after Tesla CEO Elon Musk sued OpenAI, alleging the influential AI startup abandoned its original mission of working for the public good, the company struck back. OpenAI published a blog post that revealed a Musk-backed plan to turn the organization into a for-profit entity as early as 2017. The maker of ChatGPT also contends Musk vied for total control over the transformed company. Musk argued that OpenAI breached its founding ethos of sharing its tech breakthroughs with the public by becoming a closed-source ally with Microsoft. In shared emails, OpenAI's leaders suggested that, as their technology advances, scientific details should be kept from full public view to guard against bad actors. In the unflattering portrait OpenAI presents, Musk comes off as a bitter ex and a hypocrite. And though the re-heated memes Musk has been sharing and responding to on X about OpenAI needing to change its name are embarrassing cringe content, they also offer a straightforward critique of the company. Because the same evidence OpenAI marshals against Musk undermines the startup's own narrative about democratizing the power of advanced AI tools. That's part of what makes OpenAI's straight-faced mission statement about benefiting humanity and \"helping create broadly distributed benefits\" hard to take seriously. A decade ago, tech's big social aims held sway. But in 2024, you don't need a trove of emails to learn that story isn't real. The February jobs report calmed concerns that inflation concerns could keep the Federal Reserve from cutting rates this year. The newly released jobs data released Friday showed the US economy added far fewer jobs in the previous two months than previously believed, and signs of slowing wage growth are beginning to emerge, reports Yahoo Finance's Josh Schafer. An uptick in unemployment to 3.9%, in line with its highest level seen in the last two years, bolstered the narrative that the labor market remains resilient but not strong enough to rule out a coming rate cut. \"After today’s report, we remain comfortable with our longstanding call for a first rate cut from the Fed in June. The rise in unemployment and easing in wage inflation should make the FOMC a little more confident that the labor market is moving back into balance,\" JPMorgan chief US economist Michael Feroli wrote in a note to clients on Friday. Here are some of the stocks leading Yahoo Finance’s trending tickers page during afternoon trading on Friday: Bitcoin (BTC-USD): The world's largest cryptocurrency reached an all-time high Friday, surpassing $70,000 for the first time, but swiftly climbed down to around $68,000 as some investors locked in their profits. The recent burst of excitement around the digital currency lifted the price to levels not seen since late 2021. Nvidia (NVDA): The stock at the center of Wall Street's AI excitement pulled back nearly 5% during afternoon trading, as the company's staggering rise takes a breather. In recent months the investor frenzy around the stock has intensified as tech companies who rely on Nividia's technology double down on investment in the rapidly developing field. Costco (COST): Shares of the warehouse retailer fell by more than 7% Friday after the company reported mixed second quarter results. Rivian (RIVN): The all-electric car company rose 2% during afternoon trading after the company unveiled two new lower-priced SUVs. The first of the two, a midsize SUV called the R2, will start at around $45,000, and Rivian plans to ship it in the first half of 2026. The move is designed to attract a broader consumer base, akin to Tesla's Model 3. After a powerful surge investors are taking a breather, sending stocks mostly lower during afternoon trading on Friday and putting a pause on the tech-led rally. The S&P 500 (^GSPC) trended near the flatline after logging another record close on Thursday, while the Dow Jones Industrial Average (^DJI) increased by close to 0.3%. The tech-heavy Nasdaq Composite (^IXIC) lost 0.3% after a sharp gain the previous day. Renters across the country can breathe easier this year as an influx of apartment supply pressures rent growth. Asking rents for professionally managed apartments inched up just 0.2% in February from the previous year, according to data from RealPage. That's notably lower than the historical average of 0.6% dating back to 2010. “Muted rent growth is expected to continue throughout 2024 as supply continues to put downward pressure on rents,” RealPage said in a report. Austin was the biggest laggard for rent growth, with a decline of 6.7% annually in February. Meanwhile, Virginia Beach led rent increases, with an uptick of 3.3%. While strategists have been expecting a slowdown in rents, one inflation gauge, the Consumer Price Index, has shown rents to be sticky. Analysts say this is because there is a lag in the data. February CPI will be released on Tuesday. Overall, apartment occupancy remained steady at 94.1% in February, according to RealPage, marking the third consecutive month at this rate. RealPage noted that record-high construction activity in the apartment sector poses a challenge to occupancy levels this year, with nearly 962,000 units under construction nationally at the end of 2023 and 672,000 units expected to be completed this year. Bitcoin (BTC-USD) reached an all-time high Friday, surpassing $70,000 for the first time, but swiftly climbed down as some investors locked in their profits. The recent burst of excitement around the world's largest cryptocurrency lifted the price to levels not seen since late 2021. Earlier this week, investors pushed the price to to nearly $69,000, matching the previous high set during the acute phase of the pandemic. But bitcoin tumbled below the $60,000 level again in a matter of hours, highlighting the volatility of the market. The recent trading frenzy reinforced a remarkable comeback for bitcoin following a 2022 crash that created huge losses for investors and triggered the downfall of several big industry players, including cryptocurrency exchange FTX and its founder Sam Bankman-Fried, Yahoo Finance's David Hollerith reports. Here are some of the stocks leading Yahoo Finance’s trending tickers page during morning trading on Friday: Rivian (RIVN): The all-electric car company rose 6% during morning trading after the company unveiled two new lower-priced SUVs. The first of the two, a midsize SUV called the R2, will start at around $45,000, and Rivian plans to ship it in the first half of 2026. The move is designed to attract a broader consumer base, akin to Tesla's Model 3. Costco (COST): Shares of the warehouse retailer fell sharply Friday after the company reported mixed second quarter results. Gap (GPS): The clothing company gained 3% Friday after reporting fourth quarter earnings that exceeded expectations for both the top and bottom lines. The latest quarterly results arrive about six months into the tenure of CEO Richard Dickson, whose mandate was to turn the company around. Broadcom (AVGO): Shares of the semiconductor manufacturer slipped 3% after reporting first quarter results that topped analyst estimates on both the top and bottom lines. However, the report was not the blowout many investors had hoped for, sending shares slightly lower. Wall Street rang in the trading day on a positive note, as stocks climbed higher after the February jobs report showed an increase in the unemployment rate. A slightly weaker jobs market bolsters the case for the Federal Reserve to cut interest rates this summer, lifting investor optimism. The S&P 500 (^GSPC) rose 0.2%, while the Dow Jones Industrial Average (^DJI) was flat. The tech-heavy Nasdaq Composite (^IXIC) gained 0.3%. Costco (COST) being Costco has historically worked very well for investors. The company sells giant $1.50 hot dogs at its foodcourt (they taste great, as you can see below in my 2022 photo with retired CEO Craig Jelinek). In the most recent quarter, an 18% online sales increase was fueled by gold bar demand. I surprisingly found (and bought) two tomahawk steaks from my local Costco a few weeks ago for $40 (about five pounds of meat). Costco just does things differently, and it's built into its DNA. The stock has risen in the last five years because members are happy shopping there: +245%. So I wasn't surprised to hear Costco's longtime CFO Richard Galanti (who is retiring soon) reveal it's getting into the sushi business on last night's earnings call: \"We recently opened our first fully operated sushi offering in Issaquah, Washington, across the street from our headquarters, with two more planned to open in the very near future. This operation is what we have successfully done for years — for many years — and throughout our Asia Costcos and several countries over there. The sushi program has proven to be a category where we can be successful in both quality and price, and we're looking forward to seeing more of that in the future.\" Sign me up for a California roll, Rich. Related Quotes "
}