{
    "title": "6:1, 5:1 Stock Splits: Two Mega ETFs Related To Nvidia, Meta Splitting In \nMarch 2024; Do You Own?",
    "date": "3/2/2024",
    "url": "https://www.goodreturns.in/news/6-1-5-1-stock-splits-two-mega-etfs-related-to-nvidia-meta-splitting-in-march-2024-do-you-own-1333973.html",
    "text": "Many expected a stock split announcement from the world's largest AI company Nvidia after it went on to witness a massive bull run so much so that it is now the world's third-largest company. While Meta Platforms, formerly known as Facebook, was also expected to split. However, both the giants have made no such announcements. But did you know there is a stock split going to happen related to Nvidia and Meta in the ratio of 6-for-1 and 5-for-1 respectively? This week, GraniteShares has announced it will execute forward share splits for two of its ETFs. These two ETFs are GraniteShares 2x Long NVDA Daily ETF and GraniteShares 2x Long META Daily ETF. While NVDA Daily ETF will be split into 6 smaller shares, the one Meta Daily ETF is going to be subdivided into 5 new shares. The total market value of the shares outstanding will not be affected as a result of these splits. After the close of the markets on March 12, 2024 (the \"Payable Date\"), each Fund will effect a forward split of its issued and outstanding shares, it said. As a result of these share splits, shareholders of each Fund will receive six or five, as applicable, shares for each share held of the applicable Fund as indicated in the table above. Accordingly, the number of each Fund's issued and outstanding shares will increase by the approximate percentage indicated above. The tickers and CUSIPs will not be affected by the transactions. Further, GraniteShares said that all share splits will apply to shareholders of record as of the close of the NASDAQ Stock Market. (the \"NASDAQ\") on March 11, 2024 (the \"Record Date\"), payable after the close of the NASDAQ on the Payable Date. Shares of the Funds will begin trading on the NASDAQ on a split-adjusted basis on March 13, 2024 (the \"Ex-Date\"). On the Ex-Date, the opening market value of each Fund's issued and outstanding shares, and thus a shareholder's investment value, will not be affected by the share split. However, the per share net asset value (\"NAV\") and opening market price on the Ex-Date will be approximately one-sixth or one-fifth, as applicable, for the Funds. The table below illustrates the effect of a hypothetical six-for-one or five-for-one split on a shareholder's investment, it said. GraniteShares is an independent ETF issuer headquartered in New York City. On Friday, Meta shares listed on Nasdaq traded at $502.30 up by 2.5%, which is near its day's high of $504.2. Meta's market cap is around $1.28 trillion. Meanwhile, NVIDIA's share price traded at $818.54, up by 3.5% with a market cap of $2.056 trillion. NVIDIA shares traded near its all-time high of $823.94 apiece. Stock splits have a host of benefits such as this corporate action being carried out to improve liquidity, lessen the value of the stock, make it cheaper or simply attract new buying from both existing and new investors. The ratio in which the stock will be split varies from company to company. Going by the past track record, apart from being cheap and attractive, the demand for listed shares is usually very high when they're undergoing sub-division. "
}