{
    "title": "Meet the 5 Stocks That Have Contributed Almost All of the S&P 500's 2024 \nGains",
    "date": "3/10/2024",
    "url": "https://www.fool.com/investing/2024/03/10/5-stocks-contributed-almost-all-market-2024-gains/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Containing the 500 largest publicly-traded U.S. companies by market cap, the S&P 500 is arguably the best indicator of the performance of the overall U.S. stock market. At least, it has been in the past. But something is happening that's making the index's performance somewhat misleading. As of March 6, the S&P 500 has gained 7.0% year to date. But 6.5 percentage points of that gain are due to the performance of just five companies. You may be wondering how this is possible, given the index is so massive. Are the other 495 companies really putting up mediocre results? Let's look at these growth stocks, their impact on the market, and what it means for your portfolio (whether or not you're invested in them). Image source: Getty Images. The following table showcases why huge gains from overweighted components of the S&P 500 can move the whole index. Company YTD Gain Weight in S&P 500 Percentage Point Contribution to S&P 500 Nvidia (NVDA 0.12%) 79.2% 5.0% 3.9% Meta Platforms (META -1.68%) 40.2% 2.6% 1.0% Amazon (AMZN 0.31%) 14.2% 3.7% 0.5% Eli Lilly (LLY -0.03%) 33.8% 1.5% 0.5% Microsoft (MSFT -0.17%) 6.6% 7.0% 0.5% Data sources: Slickcharts and YCharts as of Mar. 6, 2024. YTD = year to date. Nvidia and Meta Platforms alone are responsible for over half of this year's gains for the index. Microsoft is another interesting case; as the highest-weighted component of the S&P 500 (yes, even more than Apple), it doesn't take a big move for it to affect the index. Drugmaker Eli Lilly makes up just 1.5% of the S&P 500, but it's strong rally this year has been enough to move the index half a percentage point higher. Combined, these five companies make up 19.7% of the S&P 500. A little math tells us that, on average, the other 495 companies have gained just 0.7% this year (adjusted for their weightings in the index). There are a few ways to unpack this information. The obvious takeaway is that the market's roaring start really is due to a handful of companies. But a more subtle realization is that the market will have difficulty sustaining these gains from these leading constituents. Since the beginning of 2023, Nvidia, Meta Platforms, Microsoft, Amazon, and Eli Lilly have put up big numbers. The story has carried over into 2024, but it may soon begin to run out of steam through no fault of these five companies.  Data by YCharts. As we've seen repeatedly in past market cycles, valuations can only expand so much before fundamentals must catch up. The good news is that earnings from this cohort are growing. Nvidia is arguably the best example. On the surface, its 74.4 price-to-earnings (P/E) ratio looks sky-high, but analysts expect Nvidia's earnings to roughly double over the next year, so its forward P/E ratio is a much more reasonable 36.1. In fact, it's on par with Microsoft while coming in lower than Tesla, Amazon, and Eli Lilly. Growth can make rapid run-ups in stock prices justifiable. It's just that the faster and higher stock prices run, especially when they have this level of impact on the broader market, the more stretched the market becomes and the more room there is for a sell-off. 2023 and 2024 have been fascinating years in the market. The highest-weighted companies are also some of the market's top gainers -- concentrating the gains of the overall index in just a few companies. It doesn't matter where the gains come from if you own an S&P 500 index fund, but if you don't own these companies, your returns may vary wildly from the broad market's. The tech sector alone makes up 29.5% of the index. In fact, it's the only sector to have outperformed the S&P 500 over the last five years. So, if you didn't own tech or the market's top movers outside of tech, it would have been challenging to beat the market during this period. No one knows what will happen over the next five years, but we do know what has driven the market over the last five. Market dynamics can help you understand what's happening in the short term -- the trick is to not lose sight of what really matters, which is achieving your financial goals. Hitching a ride on a hot trend to make a quick buck is a common way to lose money. A better approach is to focus on a long-term investment thesis and compounding wealth over time. The real gains in Nvidia, Meta Platforms, Microsoft, Amazon, and Eli Lilly have come to those who have held the stocks for five years, a decade, or even longer. The road hasn't been easy as most of these companies have endured brutal sell-offs, most recently in 2022's bear market. If you want to invest in growth but don't know where to start, there are plenty of inexpensive exchange-traded funds (ETFs) worth checking out that achieve diversification and the benefits of a hands-off approach. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}