{
    "title": "With Nvidia Up 80% This Year, Are There Any AI Crypto Tokens You Should Be \nBuying Now?",
    "date": "3/9/2024",
    "url": "https://finance.yahoo.com/news/nvidia-80-ai-crypto-tokens-233000837.html",
    "text": "For crypto investors, Nvidia (NASDAQ: NVDA) has become the one stock to watch for clues about the future direction of artificial intelligence (AI) crypto tokens. As Nvidia's stock goes, so goes the market for AI crypto tokens. So with Nvidia shares surging after a monster earnings report in February, AI crypto tokens are also surging. Some are up 300% during the past month, and it all stems from a renewed sense of excitement around the AI market. But are any of these AI crypto tokens actually worth buying? Recognizing that it's still the very early innings for artificial intelligence, the one AI crypto token that has my attention right now is Fetch.ai (CRYPTO: FET), which is up almost 400% in the past 30 days and nearly 300% for the year. As of March 7, Fetch.ai had a market cap of $2.2 billion and ranked 51st among all cryptos in terms of overall market cap. The goal of the token is to build, deploy, and monetize AI by creating an open network for AI agents. That's a mouthful, but all it really means is that Fetch.ai wants to offer a marketplace for paid AI services. Anytime you need a task fulfilled by an AI bot, you would theoretically go to the Fetch.ai marketplace and hire the right one to do the job for you. You would then use the Fetch crypto token to pay for the service. What makes Fetch.ai so interesting is that it sounds very similar to the concept for the new ChatGPT Store, which now enables you to hire customized AI bots to do certain tasks for you. Given that a lot more people know about ChatGPT than Fetch.ai, I'm not entirely convinced that the crypto should be worth $2.2 billion, but you can start to see why some investors are getting excited about its long-term prospects. Where things get interesting is if Fetch.ai can sell enterprises (i.e., huge corporations) on the concept of these AI bots. One new partner is Deutsche Telekom, which is looking at potential uses for AI bots. This could become a great example of AI bots providing utility on a vast scale, and it ties back to the whole idea of investing in Nvidia in the first place. After all, big blue chips like Deutsche Telekom are the ones that are going to be buying Nvidia's semiconductors and using its data centers. You definitely need to be doing your due diligence in this sector if you want to benefit from the long-term convergence of AI and crypto. Otherwise, you could wind up in the same situation as we saw with metaverse crypto tokens back in 2021-22. Investors sensed a huge market opportunity around the metaverse, and a few big metaverse crypto tokens eventually attained billion-dollar market caps. But nobody these days is buying metaverse crypto tokens. And that's because metaverse crypto tokens never figured out how to appeal to more than young gamers and early tech adopters. Big brands set up shop in the metaverse, hoping to find new customers and new sources of revenue, but things never really turned out as planned. And that's one concern that I have about Fetch.ai. Sure, the idea of using paid AI bots sounds great, but will it ever appeal to a mainstream audience? It would be great to see more examples of people actually using Fetch.ai bots in their daily lives. If forced to pick just one AI crypto token right now, it would be Fetch.ai. For a little more than $2 per token, you can theoretically gain access to nearly unlimited upside if the use case for autonomous AI agents in the enterprise market plays out as expected. That said, it might be better for risk-averse investors to focus on blue chip names in the AI market such as Nvidia rather than trying to make speculative bets on AI crypto tokens they have never heard of. Picking winners in an emerging tech market is always dicey, and so for now, I'm sticking with Nvidia, up more than 80% for the year, as the best way to play the future in AI. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 8, 2024 Dominic Basulto has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Fetch and Nvidia. The Motley Fool has a disclosure policy. With Nvidia Up 80% This Year, Are There Any AI Crypto Tokens You Should Be Buying Now? was originally published by The Motley Fool Related Quotes "
}