{
    "title": null,
    "date": "3/19/2024",
    "url": "https://daily.fattail.com.au/us-tech-billionaire-points-the-way/20240320/",
    "text": "Fat Tail Daily Investment Ideas From the Edge of the Bell Curve By Callum Newman, March 20, 2024 The Godfather of Artificial Intelligence (AI) speaks! We could call him the King of Wall Street too. Or the King of semiconductors. Or simply Jensen Huang. He’s the CEO of the hottest stock in the world: Nvidia [NASDAQ:NVDA]. NVDA is now the third most valuable listed company in the world. Which is also to say, in history. Mr Jensen just unveiled Nvidia’s latest AI superchip – known as ‘Blackwell’. The Australian Financial Review reported… ‘The famous Moore’s law of computing power, Huang said, holds that computing power increases by 100 times every 10 years. ‘In the last eight years, he says Nvidia has increased the power of artificial intelligence by 1000 times. ‘And we have two more years to go. That puts it in perspective: the rate at which we’re advancing computing is insane, and it’s still not fast enough.’ This is not hyperbole. I’ve been around a long time. I can remember when NVDA was the best performing stock on Wall Street in 2016 and 2017 too. Its expertise here is unparalleled…and has a long history to back it up. If Huang says their advancing computing at an ‘insane’ level, I believe him. I’m not telling you to buy NVDA. But it’s clear to me that AI is not a flash in the pan. This thematic is going to run for years. And the ripples now from Nvidia’s big splash will spread far and wide. We explored last week how this could send productivity, margins and profits up right across the stock market. You can see the impacts on the ASX already. For example… It might seem bizarre to go from the hottest tech stock on the planet to a department store that’s over 100 years old. But Myer [ASX:MYR] has been in the news lately too. They need to replace their retiring CEO, John King. Whom did they choose? They chose a lady called Olivia Worth. This was notable because Worth has no direct executive retail experience. She ran Qantas’s Loyalty (Frequent Flyer) program before this – and very successfully too. Her strengths are ecommerce, data and – obviously – loyalty. Myer’s board knows perfectly well that its future lies in this direction. Myer has 4.3 million ‘active members’ as part of its Myer One membership. Every time they make a purchase, Myer gets a look at what, how and where they buy. In other words, they are absorbing data from 4.3 million people making multiple spending decisions. They’re now overlaying AI on top of it. In their latest update, Myer said… ‘Enhanced analytics, AI and machine learning models are driving greater CRM benefits and providing stronger platform for personalisation, producing highest incremental revenue on record from own channels.’ There you have it. AI leading to more profits for even the most stolid company. Kogan.com [ASX:KGN] has said something similar. It also has a multimillion customer base. Part of Kogan’s recent resurgence is because it’s brought its previously bloated inventory under control. AI is going to help retailers and other firms predict demand and therefore their inventory requirements. And that’s the key lesson here. Please remember this one point above all: AI is a prediction technology. But it needs data. The more data, the better. That’s precisely what loyalty programs like Myer One deliver by the truckload. This is going to make retailers more efficient. They’ll need less working capital and, all else being equal, report higher profits and return on equity. This is just a small hint of the efficiency that AI promises. Kogan, by the way, is up 80% this year. I just launched a special report on 5 ASX small caps stocks that I believe the AI megatrend will benefit. Kogan is not one of them…and nor is Myer. The stocks in this report sit at the riskest end of the market and carry high volatility. I wanted stocks with more exciting potential. Curious? I hope so! AI is minting millionaires across America from stocks like Nvidia. The best news for all of us is this tech doesn’t stop at the Californian border. It’s washing over the ASX right now…ready to lift the economy to new heights. Check out my Top 5 ‘AI’ plays here.  Best, Callum Newman,\nEditor, Small-Cap Systems and Australian Small-Cap Investigator   All advice is general advice and has not taken into account your personal circumstances. Please seek independent financial advice regarding your own situation, or if in doubt about the suitability of an investment. Callum Newman is a real student of the markets. He’s been  studying, writing about, and investing for more than 15 years. Between 2014 and  2016, he was mentored by the preeminent economist and author Phillip J  Anderson. In 2015, he created The Newman Show Podcast, tapping  into his network of contacts, including investing legend Jim Rogers, plus  best-selling authors Jim Rickards, George Friedman, and Richard Maybury. He  also launched Money Morning Trader, the popular service profiling  the hottest stocks on the ASX each trading day. Today, he helms the ultra-fast-paced stock  trading service Small-Cap Systems and small-cap advisory Australian Small-Cap Investigator. Investment ideas from the edge of the bell curve. Go beyond conventional investing strategies with unique ideas and actionable opportunities. Our expert editors deliver conviction-led insights to guide your financial journey. Subscribe About FAQ Terms and Conditions Financial Services Guide Privacy Policy Contact Us Email: support@fattail.com.au Phone: 1300 667 481 All advice is general in nature and has not taken into account your personal circumstances. Please seek independent financial advice regarding your own situation, or if in doubt about the suitability of an investment. The value of any investment and the income derived from it can go down as well as up. Never invest more than you can afford to lose and keep in mind the ultimate risk is that you can lose whatever you’ve invested. While useful for detecting patterns, the past is not a guide to future performance. Some figures contained in our reports are forecasts and may not be a reliable indicator of future results. Any actual or potential gains in these reports may not include taxes, brokerage commissions, or associated fees. Fat Tail Daily is brought to you by the team at Fat Tail Investment Research Copyright © 2024 Fat Tail Daily | ACN: 117 765 009 / ABN: 33 117 765 009 / ASFL: 323 988 "
}