{
    "title": "Tech guru Cathie Wood says Nvidia is the Cisco of the AI boom and warns its \ngrowth may falter",
    "date": "3/14/2024",
    "url": "https://ca.news.yahoo.com/tech-guru-cathie-wood-says-134804128.html",
    "text": "Cathie Wood's outlook for Nvidia is slower growth, weaker demand, and fiercer competition. The Ark Invest CEO compared the chipmaker's stock surge to Cisco's during the dot-com bubble. Wood has cut her exposure to Nvidia as she believes the market's hopes may be overblown. Cathie Wood has sounded the alarm on Nvidia, warning its spectacular growth is likely to slow, and comparing its stock surge to Cisco during the dot-com bubble. The tech evangelist and Ark Invest CEO made the striking comments in a letter to her shareholders on Thursday. She drew a parallel between Cisco riding high on demand for network hardware during the internet boom in the early 1990s, and Nvidia selling record amounts of graphics chips to companies developing artificial intelligence today. It's a \"similar technology moment in time,\" Wood said. She recalled that Cisco stock soared by 31 times in the 3.5 years to March 1994, then tanked 51% over the next four months as recession fears and the release of rival offerings caused customers to cut back on orders. The stock rebounded to rise 71-fold by the peak of the internet bubble in March 2000, but then crashed about 90% over the next few years and hasn't come close to its dot-com highs since. \"Today, Nvidia is that company,\" Wood said. She highlighted that the microchip stock has jumped 117-fold in the nine years since February 2015, and 23 times since October 2018, when the crypto winter hammered chip sales and sent Nvidia stock down 56% in three months. Wood's point seemed to be that just as Cisco's routers and switches enabled the internet revolution, Nvidia has emerged as the AI era's defining company. And when a company plays such a key role in a new tech paradigm, it can see dramatic swings in its stock price. Indeed, Nvidia has grown at a blistering pace in recent quarters as companies like Tesla and Oracle have scrambled to buy its chips. But the mad rush could mean its customers end up with double or triple the amount they need, Wood said. She also noted that Nvidia is guiding toward a growth slowdown this quarter, and the wait time to secure its chips has shrunk from up to 11 months to as little as three months, signaling supply is catching up with demand. \"Without an explosion in software revenue to justify the overbuilding of GPU capacity, we would not be surprised to see a pause in spending,\" Wood said. Nvidia's customers might also spend less on chips as they begin working through and reducing their inventories, she continued. \"Longer term, unlike the history with Cisco, competition could intensify, not only because AMD is finding success but also because Nvidia's customers — cloud service providers and companies like Tesla — are designing their own AI chips,\" she added. Wood clearly sees the shine coming off Nvidia in the face of slowing growth, slimmer spending, and stiffer competition. But she made sure to caveat that the major AI advances in recent years have shown \"anything is possible.\" The fund manager has grown increasingly wary of Nvidia in recent months. She disclosed in February she was cutting Ark's exposure to the stock as \"expectations could be getting ahead of themselves.\" Indeed, Nvidia stock has soared almost 90% this year, boosting the company's market capitalization to more than $2 trillion. It's now more valuable than Amazon or Alphabet, and only 13% behind Apple after being 1/47th as valuable as the iPhone maker a decade ago. Ark's website shows it holds just $64 million of Nvidia across its various funds, compared to $1.3 billion of Coinbase and $788 million of Tesla, its two largest holdings. Nvidia now ranks as its 41st biggest holding out of nearly 200. Read the original article on Business Insider This dividend stock has been absolutely crushing the TSX 60 and looks like it will continue to do so while providing a juicy dividend. The post Beat the TSX With This Cash-Gushing Dividend Stock appeared first on The Motley Fool Canada. Truth Social's owner, which counts Donald Trump as its biggest shareholder, is now worth more than American Airlines and Ralph Lauren by one measure. Improve grammar, word choice, and sentence structure everywhere you work. Write better with Grammarly. Here's why undervalued TSX energy stocks such as Secure Energy Services should be part of equity portfolio in 2024. The post 2 Absurdly Cheap Energy Stocks I’d Buy in April 2024 appeared first on The Motley Fool Canada. The CPP pegs the start retirement age at 65, but it's not necessarily the ideal option to start pension payments. The post Why Claiming CPP at 65 Could Be a Mistake appeared first on The Motley Fool Canada. The stock value of Reddit and Donald Tump's Truth Social took a hit by the end of trading on Thursday ahead of Easter weekend and the NYSE's Friday closure.  Berkshire Hathaway’s chairman Warren Buffett, one of the world's most famed investors, is still faithful to the fact that holding steady, being patient and believing in the power of value investing is key to successful investments. Just as important to Buffett's investment strategy, though, are the investments he doesn't believe in. Here are but a few of the investment types that the Oracle of Omaha would rather not waste money on. With stocks off to their best start in five years, many strategists on Wall Street still make a case for the S&P 500 to keep chugging higher. BCE (TSX:BCE) stock is a dividend juggernaut that's getting beyond cheap at multi-year depths. The post 1 Nosediving Blue-Chip Stock That’s Getting Ridiculously Cheap appeared first on The Motley Fool Canada. Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... Good Friday is here—and Easter Sunday is around the corner.  The New York Stock Exchange and the Nasdaq Stock Market will both be closed on Friday.  Since Good Friday is not a federal holiday, the U.S. Postal Service and banks will both be open. Fairfax Financial Holdings (TSX:FFH) and another TSX stock I'd buy and hold for the next five decades in a TFSA! The post Millennials: 2 TFSA-Worthy Stocks to Buy and Hold for 50 Years appeared first on The Motley Fool Canada. Investors can be safe while still making large amounts of passive income, even from an investment you can afford! The post 2 Dividend Stocks That Could Create $553.72 in Passive Income in 2024 appeared first on The Motley Fool Canada.  Sienna stock (TSX:SIA) looks like a strong dividend stock that's only getting stronger, but there is more growth available. The post 1 Dividend Stock Down 20% to Buy Right Now appeared first on The Motley Fool Canada. If you've already created a diversified portfolio and are looking for more options from a windfall, here is where I would invest next. The post Where to Invest $10,000 in April 2024 appeared first on The Motley Fool Canada. Do you own Enbridge (TSX:ENB) in your portfolio? Here's why every investor needs to own some Enbridge stock. The post Why Enbridge Stock Belongs in Every Portfolio appeared first on The Motley Fool Canada.  When thinking about whether you’re financially prepared to retire or not, you’ll want to think about it in a certain way. You have a lifestyle that you would like to maintain, and a portfolio that can safely generate a specific amount of income each year. Once your costs and means overlap, you can afford to […] The post I'm 59 With a $1.4 Million Net Worth and $5k in Monthly Expenses. Can I Retire Now? appeared first on SmartReads by SmartAsset. Existing home inventory increased nearly 6% last month, suggesting the housing market's inventory crisis is easing. In this article, we will be taking a look at 11 undervalued semiconductor stocks to buy according to hedge funds. To skip our detailed analysis of the semiconductor sector, you can go directly to see the 5 Undervalued Semiconductor Stocks To Buy According to Hedge Funds. Semiconductor Industry Outlook The semiconductor space is now more […] 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ There are plenty of growth stocks in the market worth considering, but Shopify (TSX:SHOP) looks like one of the best right now. The post 1 Growth Stock Down 50 Percent to Buy Right Now appeared first on The Motley Fool Canada. Boom and Bust It was only a matter of time. Reddit shares are cratering right now, plunging almost 25 percent in just two days, as CNBC reports. The social media company went public last week at an IPO price of $34 and initially rallied to around $65. This week, however, shares started slipping, following Hedgeye […] The price of gold hit a record high this week. While support for the rally may be fading, the yellow metal could still gain. "
}