{
    "title": "Nvidia Just Dropped Great News for Super Micro Computer Stock",
    "date": "3/16/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/SMCI-Q/pressreleases/24842445/nvidia-just-dropped-great-news-for-super-micro-computer-stock/",
    "text": "Share prices of Super Micro Computer(NASDAQ: SMCI) took off in the past year, gaining 1,180% as of this writing, and a big reason behind the stock's red-hot surge is the booming demand for Nvidia's (NASDAQ: NVDA) artificial intelligence (AI) graphics cards. Supermicro's modular server rack-scale systems are being used to mount AI-related graphics cards from Nvidia, as well as other chipmakers. As the demand for Nvidia's cards has increased, Supermicro has also witnessed a terrific jump in demand for its server solutions, leading to rapid growth in the company's top and bottom lines.  SMCI Revenue (Quarterly) data by YCharts And now, a recent revelation from Nvidia CEO Jensen Huang suggests that Supermicro's eye-popping growth will continue. Nvidia's current flagship AI graphics card, the H100, reportedly performs well under air cooling. What's more, the upcoming H200 processor is also anticipated to perform optimally while being air-cooled, according to Tom's Hardware. But at an economic summit at Stanford this week, Huang said that one of Nvidia's next-generation computers is going to be liquid-cooled. Nvidia's next-generation AI graphics processing units (GPUs) based on the Blackwell architecture are expected to consume 40% more power than the existing offerings based on the Hopper architecture. According to some other claims, Nvidia's next-generation AI chips could even consume double the power of the current lineup. This is where liquid-cooled server systems are going to come into the picture. When launching what Supermicro claimed to be the first liquid-cooled server systems for Nvidia's H100 processors last year, the company said: Savings for a data center are estimated to be 40% for power when using Supermicro liquid cooling solutions compared to an air-cooled data center. In addition, up to 86% reduction in direct cooling costs compared to existing data centers may be realized. A look at third-party studies suggests something similar. Liquid cooling reportedly consumes just 20% of the energy required for air cooling. In other words, liquid cooling is known to reduce energy consumption in data centers significantly, while also helping reduce operating expenses by using less water than air-cooled data centers. Supermicro seems to have been ahead of the curve, as it took the initiative to launch liquid-cooling solutions for Nvidia's AI chips last year. The company is now working to boost the manufacturing capacity of liquid-cooled server racks. On its January earnings conference call, Supermicro management remarked: \"By this June quarter, we will have high-volume, dedicated capacity for manufacturing 100-kilowatt to 120-kilowatt racks with liquid-cooling capabilities, providing DLC, direct liquid cooling racks capacity, up to 1,500 racks per month, and our total rack production capacity will be up to 5,000 racks per month by then.\" The company's focus on expanding its capacity of liquid-cooled servers will not only let it take advantage of Nvidia's power-hungry AI chips but also allow it to make a dent in the fast-growing market for liquid-cooled data centers as a whole. The liquid-cooled data center market is expected to generate annual revenue of $40 billion in 2033, compared with just $4.5 billion last year, clocking an annual growth rate of 24% over the next decade. As such, it won't be surprising to see Supermicro maintaining its healthy pace of growth for a long time to come. Though Supermicro has been on a tear on the stock market over the past year, its sales multiple stands at just 6.7. That's cheaper than the technology sector's price-to-sales ratio of 7.1. Moreover, Supermicro's forward earnings multiple of 36 points toward a big jump in its bottom line, considering its trailing earnings multiple of 84. As the following chart suggests, Supermicro's earnings are set to take off big time from the previous fiscal year's reading of $11.81 per share.  SMCI EPS Estimates for Current Fiscal Year data by YCharts It's also worth noting that analysts have raised their earnings growth expectations from the company, and there's a good chance that they may keep raising those estimates considering added catalysts such as the growing demand for liquid-cooled systems. That's why now would be a good time for investors to buy this AI stock, as it seems capable of sustaining its stunning rally in the long run. Should you invest $1,000 in Super Micro Computer right now? Before you buy stock in Super Micro Computer, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Super Micro Computer wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Super Micro Computer stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}