{
    "title": "How Much Would $10,000 Invested in Nvidia Stock 20 Years Ago Be Worth Today?",
    "date": "3/6/2024",
    "url": "https://wtop.com/news/2024/03/how-much-would-10000-invested-in-nvidia-stock-20-years-ago-be-worth-today/",
    "text": "U.S. News & World Report March 6, 2024, 7:00 PM Today, the size of Nvidia Corp. (ticker: NVDA) is staggering: It’s the third-largest company in the U.S. by market capitalization, with a valuation north of $2.2 trillion. By that metric, the semiconductor company is larger than Warren Buffett’s Berkshire Hathaway Inc. (BRK.A, BRK.B) and multinational conglomerates like Johnson & Johnson (JNJ). On top of that, Nvidia is still growing. The stock is already up a staggering 79.1% year to date through March 6, driven largely by growing demand for high-performance chips that power artificial intelligence. This followed an incredible 239% surge in 2023 that made NVDA the single best-performing stock in the S&P 500. [Sign up for stock news with our Invested newsletter.] That said, Nvidia hasn’t always been a stock market darling. It went public in an initial public offering back in 1999 and has earned its current status as a tech star through decades of evolution and innovation. Here’s some background on the company’s history, and a bit of math on how much a $10,000 investment in NVDA stock 20 years ago would be worth today. Nvidia’s 30-Year Journey Nvidia was founded in April 1993. Jensen Huang co-founded the company with Chris Malachowsky and Curtis Priem and remains its CEO. Back in 1993, Huang and the other co-founders realized that graphics-based computing would be a large opportunity in the coming years. Innovations in the video gaming market would give Nvidia a profitable niche while allowing the company to build up the research, development and patent base necessary to branch out into related fields. Nvidia launched the first model of its GeForce graphics card in 1999, the same year as its IPO. Over the years, GeForce has gone on to become the dominant brand in graphics cards for high-resolution gaming and video performance. Nvidia was hardly just a one-trick pony though, as its business has moved well beyond video gaming. Investors have reaped the rewards along the way. Nvidia split its stock in 2000, 2001, 2006, 2007 and 2021. All told, an investor who bought 100 shares of NVDA stock in the 1999 IPO would now own 4,800 shares of Nvidia thanks to all the share splits along the way. Shares started trading at around 40 cents each on a split-adjusted basis in 1999. And, again on a split-adjusted basis, shares were still going for around $5 as recently as 2015. That’s when Nvidia’s second act, cryptocurrency, really kicked into gear. As it would turn out, Nvidia graphics cards ended up being ideally suited for solving the cryptographic puzzles needed to mine Bitcoin and other leading proof-of-work-based cryptocurrencies. As cryptocurrency prices soared, digital asset-mining firms could afford to invest a lot more in Nvidia’s graphics processing units, or GPUs, to mint more digital coins and tokens. Nvidia’s revenues saw exponential growth, jumping from $5 billion in 2016 to more than $11.7 billion in 2019 amid the historic surge in the price of Bitcoin and related cryptos. While cryptocurrency-related graphics card demand has dried up more recently, Nvidia enjoyed a huge rise in demand for high-end gaming cards during the pandemic, as people were stuck at home with more time to pursue their hobbies. In addition, Nvidia’s data center business has also enjoyed robust growth. This led revenues to further surge to $27 billion for fiscal year 2023. Today, with the jump in orders for artificial intelligence-related chips, it seems clear that generative AI and large language models will power the next act of Nvidia’s tremendous growth story. Fiscal 2024 revenue surged 126% to $60.9 billion, and analysts expect another year of blockbuster growth in the current fiscal year, with revenue expected to surge more than 80% to $110 billion. There simply isn’t another large-cap growth story like Nvidia in the stock market today, which is why its stock price has been going stratospheric in recent years. [READ: 10 Best-Performing Stocks of the Past 30 Years] Nvidia Stock by the Numbers Between its 1999 fiscal year and fiscal 2024, Nvidia grew its revenue 385-fold. Interestingly, much of this growth occurred within the past few years as Nvidia made large strides outside of the video game graphics space. The company’s net income grew by an even larger multiple: Fiscal 2024 net income was more than 7,200 times larger than it was in fiscal 1999. A $10,000 investment in Nvidia made in March 2004 would have grown to a stunning $5.23 million today. This works out to an incredible 36.7% compound annual growth rate for investors who held on over the past 20 years. This return trounced the S&P 500, which delivered a 7.7% compound annual growth rate over the same period. A $10,000 investment in the S&P 500, by contrast, would have turned into $44,126 over the same 20-year period. Nvidia: What Analysts and Investors Are Saying Famed investor Stanley Druckenmiller, while attending an investing conference, recently discussed his purchase of Nvidia shares: “If it’s as big as I think it is, Nvidia is something we are going to want to own for at least two or three years.” While Druckenmiller conceded that the firm’s valuation level is “lofty” today, he countered that objection by noting that: “I do believe, unlike crypto, AI is real … it could be as transformative as the internet.” While it may be too early to dismiss crypto entirely, AI-powered developments such as ChatGPT and image generation products seem likely to gain mass consumer adoption in a way that non-fungible tokens and blockchain never quite achieved. These impressive AI applications serve as the sort of must-have product that makes artificial intelligence seemingly more likely to sustain a long bull run than other recent technological developments. Right now, Nvidia appears to be in the early stages of what should be a sustained period of sharply rising demand as large enterprises race to deploy their own AI models. In this sort of AI arms race, the momentum factor could prevail over more fundamental-driven valuation analysis, at least in the intermediate term. Investors tend to do well when there is accelerating revenue growth and rising profit margins. Nvidia shares more than tripled in 2023, and are already up a tremendous amount in the first quarter of 2024. It’s hard to argue that shares are a bargain today based on traditional valuation metrics. Nevertheless, analysts project an incredible 80.5% revenue growth rate for Nvidia in its current fiscal year, driven by an insatiable increase in AI-related investments. Given the strength of that underlying trend and Nvidia’s tremendous long-term track record, it wouldn’t be surprising if Nvidia continues to rally despite the elevated starting valuation. [READ: 6 of the Best AI ETFs to Buy Now] More from U.S. News 7 Best Semiconductor ETFs to Buy in 2024 7 Best Monthly Dividend Stocks to Buy Now 10 Best Growth Stocks to Buy Now How Much Would $10,000 Invested in Nvidia Stock 20 Years Ago Be Worth Today? originally appeared on usnews.com Update 03/07/24: This story was published at an earlier date and has been updated with new information. 5425 Wisconsin Ave\n                Chevy Chase, MD 20815 hello@wtop.com 202.895.5000  Copyright © 2023 by WTOP. All rights reserved. This website is not intended for users located within the European Economic Area. "
}