{
    "title": null,
    "date": "3/28/2024",
    "url": "https://es-us.finanzas.yahoo.com/video/nvidia-room-push-higher-strategist-205726207.html",
    "text": "The first quarter of fiscal year 2024 has been a bullish one, with \"Mag 7\" powerhouse Nvidia (NVDA) leading the charge. Fundstrat Global Advisors Managing Director and Global Head of Technical Strategy Mark Newton joins Market Domination Overtime to break down the technical trends behind Nvidia. In terms of Nvidia's recent performance Neton states: \"We've seen a little bit of a slowdown in Nvidia, just in the last couple weeks...I don't think that's really all that significant, technically. We have had, even at current levels, which is at, what, 903? The stock is up 400 points which is over 80% from where it started just three months ago. It's been a rocket ship. It's been parabolic. It's given us nearly 35% of the gains in the NASDAQ (^IXIC) and about 25% of the S&P (^GSPC)... I view this as just being a temporary period of consolidation. I still think tech is going to push higher.\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. Editor's note: This article was written by Nicholas Jacobino - We are taking a look at technical trends from the past few months, where there may be opportunities ahead. Joining us now is Mark Newton, managing director and global head of technical strategy at Fundstrat Global Advisors. Good to talk to you today. Give me your takeaway here from the first quarter. MARK NEWTON: Well, look we've seen now five straight months of gains, it certainly has been a stellar quarter-- honestly, with the S&P almost 10% or so. This is really the 12th strongest quarter that we've seen going back almost 75 years. And so very impressive quarter. We started off with four straight months of gains over the winter and now we have a fifth straight, very resilient. I would say three things are really important for investors. One is that it hasn't just been a tech-led AI dominated rally, as we all know tech has really underperformed the last month. And we've seen this broaden out to other areas outside of even just financials, industrials, and discretionary, now we're seeing energy and materials start to outperform. So it has gotten a lot more broad-based and I think that's a big positive. The second and to your point about Apple. It certainly has not been a stock market that's seen indiscriminate buying. There have been notable laggards that being Apple and also stocks like Tesla. So I don't sense that we're yet at that stage that we're seeing wild speculation and/or complacency. The third is that, arguably, the stock market is not really all that overvalued either. I mean, a Ford PE for the NASDAQ is right around 21. Not as high as we saw really in the pre-COVID years-- 2019-2020 and certainly well below the time we saw in the early 2000s when the PEs were up nearly above 70. So if anything, look, the stocks that have dominated indices are the ones that a lot of investors involved in. They have given us a lot of great gains, and they're also the ones that are making all the money. So that's certainly a good thing. - And Mark, it's great to have you on the show. I also want to get your take, Mark, on another name, so important to the market. And when we talk a lot about Nvidia, what a move for that name, Mark? I'm just interested, when you look at the charts, the technicals, what are they telling you about Nvidia? MARK NEWTON: Well, we've seen a little bit of a slowdown in Nvidia just in the last couple of weeks. I don't argue-- I don't think that's really all that significant technically, we've had even at current levels, which is at what, 903? The stock is up 400 points which is over 80% from where it started-- literally just three months ago. So it's been a rocket ship. It's been parabolic. It's given us nearly 35% of the gains-- the NASDAQ and about 25% of the S&P, also represents a decent earnings chunk for the S&P and the NASDAQ as well. I view this as just being a temporary period of consolidation. I still think tech is going to push higher, we're likely on the heels of this PCE report that's upcoming. We heard that inflation is now continuing to drop, expectations are being lowered, Powell came in very, very dovish. Finally, the Fed is in line with the dot plot. So rates should start to fall over, that's only going to aid large cap growth in technology. I see Nvidia getting back to this Monday. This past Monday's highs, that's right near 968 and above that, which is what I expect should get the stock up to near 1,050 to 1,100 likely by the middle part of April. So I'm still quite constructive. - What about the other semiconductor players, Mark? I mean, to what extent have they been correlated to Nvidia's rise? You could argue, in some cases, they've actually pulled back as a result of Nvidia's dominance. What are you seeing there? MARK NEWTON: The entire semiconductor sector, if you look at semi and semi-cap is the number one performing level two industry group of the S&P of 25 groups. It's up about 36% for the quarter, that is double the next best performer. So it does pay to be selective. But as a whole, the sector has a lot of stocks that are continuing to act very, very well. - Mark-- I'm sorry. Go ahead. Go ahead, Mark. MARK NEWTON: --I was just going to say I'm fond of a lot of these stocks, until we see some evidence of really technical trends breaking, it doesn't pay to fight this trend. It doesn't pay to say, well, they're overbought and therefore, that means they should fall. If anything, we know the supply constraints on many of these companies have led these stocks higher, that that doesn't appear to be ending anytime soon. It's really a story with this ongoing demand and they have supply constraints. So that's certainly a very, very bullish theme. - And Mark, a final name I need your take on is Tesla. We've got deliveries on deck next week, sentiment is rough stock has been hit. What are you seeing? MARK NEWTON: Well, my own cycle analysis suggests that Tesla should be in the process of bottoming out. So I do have some optimistic words for investors. I mean, look, the technical trends have been quite negative. But I think it's worth trying to pick spots in this stock doing it at least in a very small size. And once they can get up above almost 183 which were close, that would turn the near term trend a lot more positive. That should drive it up to 220 and likely 245. So I think we're very, very close. As you mentioned, sentiment is awful. There's a lot of reasons for people to-- all of a sudden, it's unusual to hear people throwing in the towel after the stock's been down over the last couple of years. We all admire the brilliance of Elon Musk. I think that it's just a matter of time the stock obviously looks to be very, very close to a time when it should start to work. - Mark, great to have you on the show today my friend. Thanks for joining us. MARK NEWTON: Thanks, Josh. Take care, everybody. Thank you. Un total de 40 agentes y fiscales intervinieron en el allanamiento a la casa de la presidenta de Perú, Dina Boluarte, que empezó a la media noche del viernes 29 de marzo. El operativo hace parte de una investigación contra la mandataria por presunto enriquecimiento ilícito y falta de declaración de propiedad de unos relojes de lujo marca Rolex.Leer más sobre FRANCE 24 Español Un murciélago ultra raro nació boca abajo en un zoológico inglés el 19 de marzo. El murciélago frugívoro de Livingstone se encuentra en peligro crítico de extinción y cada nacimiento es una victoria para la conservación de la especie. Se cree que es la primera vez que se graba el nacimiento de esta especie. Trade 24 hours a day on the world's most popular platform. Puerto Príncipe, 30 mar (EFE).- El sistema sanitario sigue deteriorándose en Haití, sumido en una grave crisis política y económica, agudizada por el terror que han extendido las bandas armadas, que se han hecho más fuertes en el último mes. La Habana, 30 mar (EFE).- Científicos de Cuba y México desarrollan un molécula que podría ayudar a las investigaciones conjuntas para el tratamiento y terapia del Alzheimer, informó este sábado el diario oficial Granma. El arquero deslizó disconformidad por los oponentes que debió enfrentar el campeón del mundo He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Redacción deportes, 30 mar (EFE).- En su vuelta a la titularidad, el brasileño Reinier, cedido por el Real Madrid, alentó al Frosinone, que sacó un punto del estadio Luigi Ferraris ante el Génova (1-1) que mantiene las esperanzas de salvación del conjunto de Eusebio Di Francesco. Toronto (Canadá), 30 mar (EFE).- Estado de emergencia, escuelas cerradas, un millón de turistas y precios desorbitados. Así se prepara la región de Niagara, la más meridional de Canadá, para el eclipse total solar que se producirá el próximo 8 de abril. Este fin de semana se reanudan las ligas de Europa y varios futbolistas pujan por el prestigioso galardón; Harry Kane lidera la clasificación y Lautaro Martínez está en el Top 3  Getafe (Madrid), 30 mar (EFE).- En su pelea por alejarse de los puestos de descenso, el Sevilla sumó tres puntos importantísimos en el Coliseum al ganar 0-1 al Getafe gracias a un tanto de Sergio Ramos, que celebró su 38 cumpleaños con un gol que sirvió a su equipo para resucitar después de dos pinchazos seguidos. Leópolis (Ucrania), 30 mar (EFE).- La economía ucraniana muestra un crecimiento mejor de lo esperado al adaptarse a las condiciones de la guerra tras el desplome sufrido al comienzo de la invasión rusa a gran escala, aunque su futuro parece incierto, ya que una serie de desafíos ponen en peligro una mayor recuperación.  Tras contraerse casi un 30 % en 2022, la economía de la nación invadida creció un 5,3 % en 2023, según reveló su Oficina de Estadística a principios de esta semana. La cifra superó las previsiones, pero apenas refleja la complejidad de hacer negocios en medio de la guerra. \"¡Vive aquí y ahora!\", reza un cartel sobre la entrada de una pequeña tienda en el centro de Leópolis. Ante la abrumadora incertidumbre sobre el futuro, a muchos ucranianos no les queda más remedio que seguir ese consejo. Negocios y guerra  La vida de Lerane Jaibulaieva, fundadora de la cafetería \"Patio crimeo\", situada justo al lado, ha dado ya un par de giros bruscos a causa de la guerra. Tártara de Crimea, tuvo que huir de su península natal después de que Rusia se la anexionara en 2014 y lanzara represiones contra la minoría, cuenta a EFE. Pronto abrió una cafetería cerca de Kiev, en Irpin, que se convirtió en su forma de popularizar la cultura tártara de Crimea. Sin embargo, Jaibulaieva tuvo que huir de nuevo cuando Rusia destruyó gran parte de Irpin al intentar capturar la capital. Al principio, carecía de fondos para reactivar su negocio en Leópolis, a unos 1.000 kilómetros de la línea del frente. Tuvo que abortar su segundo intento después de que Rusia provocara cortes de electricidad al atacar el sistema energético del país. La empresaria no podía permitirse un generador de energía autónomo mientras su marido, soldado, estaba herido y necesitaba más atención. El tercer intento dio resultado hace unos meses y la cafetería se ha convertido en un éxito tanto entre los residentes como entre muchos visitantes de esta ciudad fronteriza.  Sin embargo, la propietaria tiene dificultades para encontrar empleados en medio del éxodo de población y los desequilibrios del mercado. Los costes de equipamiento y de otro tipo también han ido en aumento, con muchas instalaciones de producción destruidas en el este del país y la logística interrumpida.  \"Todo emprendedor ucraniano tiene que hacer malabarismos cada día para sobrevivir\", afirma Jaibulaieva. Un 2024 plagado de riesgos  El 64 % de los altos directivos son más pesimistas en 2024 de lo que lo eran en 2023, según una encuesta realizada en marzo por la Asociación Empresarial Europea de Ucrania.  \"Las principales razones incluyen la situación militar, la movilización, así como los retrasos y la incertidumbre en torno a la ayuda internacional\", explica su directora general, Anna Derevianko. Los nuevos ataques rusos con misiles y drones contra la infraestructura energética se están convirtiendo rápidamente en una gran preocupación. Es probable que Ucrania sufra cortes de electricidad en todo el país a más tardar ya en julio y agosto debido a los enormes daños sufridos por las centrales térmicas e hidroeléctricas, advierten los expertos en energía. Aunque mejor preparadas que en 2022, muchas empresas aún pueden verse duramente afectadas. Además, aunque Ucrania va camino de recibir en marzo el equivalente a la cifra récord de 8.300 millones de euros de ayuda financiera, su continuidad también sigue siendo motivo de preocupación. El país aún necesita 7.500 millones de euros para financiar sus gastos en 2024, según el Centro de Estrategia Económica. Esta ayuda es crucial, ya que el gobierno sólo cubre la mitad de sus gastos por sí solo. Gran parte de su industria pesada en el este se ha perdido a causa de los ataques o la ocupación rusos, mientras que las economías de ciudades en la línea del frente, como Járkiv, siguen asfixiadas. Sin ayuda suficiente, Ucrania tendrá que recurrir a la impresión de dinero o retrasar el pago de salarios y pensiones, lo que perjudicará aún más la economía, advierten diversos analistas. El actual bloqueo de la frontera del país con Polonia, su ruta comercial más segura en medio de los ataques rusos a sus puertos, también cuesta millones de euros al mes a las grandes empresas y afecta a pequeños emprendedores como Jaibulaieva. A pesar de todo, la dueña del café permanece estoica y espera que la próxima vez que se mude a cualquier lugar sea a una Crimea liberada. \"Gracias a nuestros defensores, podemos y deberíamos planificar el futuro de nuestros negocios. Aunque al final sea diferente de lo que imaginamos que vaya a ser\", subraya.  Rostyslav Averchuk (c) Agencia EFE Toronto (Canadá), 30 mar (EFE).- Estado de emergencia, escuelas cerradas, un millón de turistas y precios desorbitados. Así se prepara la región de Niagara, la más meridional de Canadá, para el eclipse total que se producirá el próximo 8 de abril.  Ana Villarrubia, psicóloga del programa Mañaneros y exnuera de Ana Rosa Quintana, se encuentra en un momento personal de lo más dulce. La colaboradora televisiva dio el ‘sí, quiero’ a Pedro José Onieva, tío de Iñigo Onieva, el pasado viernes 15 de marzo en un discreto enlace civil en una notaría de Madrid. En estos primeros días como marido y mujer, los recién casados no dudan en gritar a los cuatro vientos el amor que sienten el uno por el otro con dedicatorias de lo más románticas. “Todo en la Baltimore, 30 mar (EFE).- Los fines de semana de Maynor Suazo eran para su familia. De lunes a viernes, trabajaba reparando baches en carreteras y autopistas, una labor que solo se puede hacer cuando los demás duermen. Los días libres, llamaba a despertar a su hermano Carlos: \"¿Qué hacés, vos? ¿Pa dónde nos vamos?\". Un parque, un río o un asado. La cuestión era armar un plan y disfrutar del tiempo juntos. Cuando la inflación es alta y los precios de los productos, servicios y alquileres de vivienda, así como las facturas de agua, gas y electricidad suben en un porcentaje considerablemente mayor que la subida de los salarios e ingresos, a muchas personas, parejas y familias no les resulta fácil ahorrar.  Quienes busquen empleo en Estados Unidos deben obtener una visa de trabajo ya que trabajar con una visa de turista conlleva consecuencias legales Ana Victoria Ávila estaba desaparecida hace casi tres días; se fue a vivir a Playa del Carmen a fines de 2023 No te pierdas los nuevos lanzamientos de Nelly Furtado, Juanes, Pepe Aguilar y muchos artistas más.  El Millonario y el xeneize están, en mayor o menor medida, comprometidos con la clasificación a la próxima ronda del primer certamen local El local logró la victoria con un doblete del jugador que querían incorporar los Hammers No hay más que verlo y leer sus palabras, cargadas de ternura y del sentido del humor que tanto le caracteriza, para comprobar la felicidad plena de Alejandro Sanz en estos días. La estrella internacional de nuestra música se ha marcado un planazo con sus hijos, no cabe duda, escapándose juntos a una preciosa casa rural situada en plena naturaleza. Rodeados de campo y vegetación por los cuatro costados, el artista ha resumido perfectamente en una sola y explícita frase su grata experiencia: \"Tod "
}