{
    "title": "Why Does SoundHound AI (SOUN) Stock Keep Climbing",
    "date": "3/13/2024",
    "url": "https://investorplace.com/2024/03/why-does-soundhound-ai-soun-stock-keep-climbing/",
    "text": " SoundHound AI is continuing to roar ahead as its voice recognition and response technology gains customers Advertisement Source: T. Schneider / Shutterstock.com SoundHound AI (NASDAQ:SOUN) stock is continuing to rise amid the frenzy for generative AI (GenAI). SOUN stock opened at $7.28 a share this morning after selling for under $6 early on March 12. The rally has lifted the company’s market capitalization to over $2.2 billion. This is the second big gain for SoundHound in just a month. It jumped from $4 to $7 in February. The stock may rise further as the company prepares to present at the Nvidia (NASDAQ:NVDA) GPU Technology Conference on March 18. Nvidia is now worth over $2.2 trillion and is the third most valuable company in the world, after Microsoft (NASDAQ:MSFT) and Apple (NASDAQ:AAPL). SoundHound is a voice recognition company that originally sold its software to car companies. Now, it is using artificial intelligence (AI) to serve restaurants and call centers. Nvidia has invested in it. But fellow InvestorPlace contributor Rick Orford believes SOUN stock is still undervalued. He says SoundHound’s Only Voice AI platform has wide applications in marketing and transcription of text-to-speech. Voice services have recently become a popular AI niche. But SoundHound faces competition from Cloud Czars as well as an open source voice clone. Artists are worried that the new software will copy their voices and lead to fraud. So far, SoundHound is trying to sidestep these problems. The company is focused on connecting database computing to voice recognition. Understanding the voice on the other end, rather than replicating any particular voice, is the aim. Voice applications linking telephony to databases are low-hanging fruit for the AI revolution. SoundHound will need to show other innovations next week to keep the excitement growing. As of this writing, Dana Blankenhorn had LONG positions in MSFT, AAPL, and NVDA. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Dana Blankenhorn has been a financial and technology journalist since 1978. He is the author of Technology’s Big Bang: Yesterday, Today and Tomorrow with Moore’s Law, available at the Amazon Kindle store. Tweet him at @danablankenhorn, connect with him on  Mastodon or subscribe to his Substack. Artificial Intelligence, Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/why-does-soundhound-ai-soun-stock-keep-climbing/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}