{
    "title": "NVIDIA CORP. (CDRS) Trade Ideas — SWB:NVDG — TradingView",
    "date": "3/24/2024",
    "url": "https://www.tradingview.com/symbols/SWB-NVDG/ideas/page-14/?sort=recent",
    "text": "Good evening and i hope you are well.\n\nLast time i talked about Nvidia was 3 week ago and Nvidia at 661. Time to revisit and adjust again.\nI said buy, 700 and even 800 were my targets. Market kept at it, 788 now with 823. If you made money, please leave a comment, thumps up or whatnot. I hope you enjoyed it.\n\n Outlook \nQuote from last outlook:  \"The thing about... While the main scenario for this stock implies a further advancement in price considering the importance of its product(s) in AI development and deployment, this project attempts to anticipate or \"catch\", a significant reversal signal, preferably with a candlestick shadow at one of the shapes (similar to the examples highlighted in past price action). 2 other... scamz finished. we loaded uh massive weekly 820-835 PUT position posted this morning. rolling them into 800 PUTS 4 next week. back to 750 in no time. thu valuation iz reedickulous for this nonsense. also, RSI 87 on thu weekly lol. unsustainable strong hands hold> more upside coming for nvidia they have 95 % ai market in there hands new launce for ai chips in q2 coming ai hype every one wants the nvidia chips. NVIDIA  NASDAQ:NVDA  - Feb. 22nd, 2024\n\nBUY/LONG ZONE (GREEN): $661 - $810\nDO NOT TRADE/DNT ZONE (WHITE): $609 - 661\nSELL/SHORT ZONE (RED): Not Shown\n\nWeekly: Bullish\nDaily: Bullish\n4H: Bullish\n\nNot much to say, earnings and momentum speak for themselves, just thought I'd quickly throw up what I have drawn as support areas for bulls and a profit target. The target... Weekly 9 coming on a 2 week time span. It has been a good indicator for pullbacks / consolidation. NVDA could see some chop as it did in the last 9 or more off a pullback to the uptrend. Just something to keep in mind. After finding this channel to my liking, I also noticed that today it closed at exactly the price needed to complete a measured move. \n\nTwo range expansions will put it at $822\n\nI have no clue what it will do, just observations. I don't trade NVDA. \n\nI just know that parabolic moves are not sustainable and no matter how far it goes up in a straight line, it must... We can spot a perfect bullish impulse starting the month of October 2022.\nNVIDIA Corporation's valuation grew by an astonishing 590%.\n\nAfter the fifth wave we get a correction.\nWe have a rounded top and a very strong bearish divergence with the RSI.\n\nToday's session is full red pushing price action below EMA10.\nAs the action moves below EMA10 the bias turns from... this looks like a good technical scenario\nall indicators are good\nMarket is good\nyes let's do it “Accelerated computing and generative AI have hit the tipping point. Demand is surging worldwide across companies, industries and nations.” says Jensen Huang - CEO of NVIDIA.\n\nThe company has reported record 126% growth YoY. \n\nNvidia stands as the fourth largest company in terms of market capitalisation. \n\nThe company revenue is expected to grow as highlighted in... Simple EW/Fibonacci analysis shows that a possible top for NVIDIA could be in.\nOR this could be my imagination and we go to the magic 1000 number.\n\nTrading is risky, and this is no financial advice :)\nAlso look at my other posts which delves into the general concept that the entire market has topped. The drop in Palo Alto Networks Inc (PANW) shares by 21.09% from February 20 to February 21, 2024, following the company's reduction of its annual forecast, could mark the end of the growth phase for the technology sector.\n\n\n\n NASDAQ:NVDA   NASDAQ:PANW  #NVDA #Nvidia #Stock #StockMarket #Shares\n\nBoth stocks have met all their targets and are likely to have... After a good rally the stock is looking weak on weekly timeframe \nThe key supports are mentioned in chart \nA daily candle closing below 666 would be strong confirmation for  downtrend NVDA Short (2024.02.20) Current price :  727.10\nIt shows that technical indicators are very overheated\nAlthough there has been some adjustment, it is very likely that it will go down further.\nSince there will be an earnings announcement soon, we need to be cautious of volatility and respond accordingly. But the overall direction is more likely to be down than up.... I have some followers who made quite a loss shorting this stock. They believed it has gone overboard with its buy and decided to short against it. Some did the intrinsic value calculations and felt it is also way over valued by a double digit percentage and short it. Both groups suffered losses !\n\nDrawing a simple trend line tells you the bullish trend is still... Fibonacci targets lining up for a push to 800 zone\n\nGood for some profit taking and potential short hedges The Nvidia effect has ripped through global equity markets and given fresh wind to markets that were looking ominously poised for a 3-5% drawdown. New highs have been seen in EU Stoxx, GER40, JPN225, and the US large-cap equity bourses; the US30, US500 and NAS100. \n \n  What levels do the bulls target now? \n \nWell either, you’re looking at fibo... \"Technical analysis suggests Nvidia may be forming a bull pennant pattern, potentially indicating future price movement within the range of $620-$1100.\" Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}