{
    "title": "Nvidia and Equinix partner for AI data center infrastructure",
    "date": "1/29/2024",
    "url": "https://www.networkworld.com/article/1302075/nvidia-and-equinix-partner-for-ai-data-center-infrastructure.html",
    "text": "The deal is aimed at businesses that want to rapidly deploy generative AI applications but don’t have the infrastructure or in-house skills to do it alone.  Nvidia is partnering with data center giant Equinix to offer what the vendors are calling Equinix Private AI with Nvidia DGX, a turnkey solution for companies that are looking to get into the generative AI game but lack the data center infrastructure and expertise to do it. As part of the deal, Equinix hosts and manages Nvidia DGX supercomputers purchased by businesses. So it is a standard colocation type of agreement, but instead of traditional x86 servers, Equinix is hosting Nvidia GPU clusters, which start at six figures and shoot up to millions in cost. It’s made for businesses that don’t want their data in the public cloud for various reasons, including security, data sovereignty and auditability, said Charlie Boyle, vice president of DGX systems at Nvidia, in a conference call with journalists. “Lots of enterprises don’t have the expertise needed to build these very complex clusters of systems,” he said. “Most enterprise companies are sitting on a massive amount of enterprise data, sometimes decades of data. And all that data needs to be very close to the AI processing that they’re trying to accomplish.” The ramp to AI is a steep and long one, it’s very expensive, and talent is hard to come by. All of these are inhibitors to companies adopting and deploying comprehensive AI. This is a fully managed service, and Equinix is one of the largest data center providers in the world, with 250 facilities in 71 metropolitan areas. “Many customers have the desire to have this capability within their company,” said John Lin, executive vice president and general manager of data center services at Equinix. “Customers can really reduce their time, from the moment that they have the idea that they want this AI infrastructure, to the time that they actually get it up and running.” Equinix’s Private AI service offers either Nvidia’s DGX BasePod or SuperPod cluster configurations, which start at eight DGX H100 GPUs for the BasePod and 128 DGX H100 systems in the SuperPOD. The systems are connected by Nvidia’s ultra-low latency InfiniBand networking technology and managed by Equinix’s managed services team. The service also includes Nvidia’s AI Enterprise platform, which comes with pretrained models, optimized frameworks and accelerated data science software libraries for building LLMs. Equinix’s data centers are connected to the Internet through a high-speed private network, and the company also offers high-speed interconnections to leading cloud services and enterprise service providers. Equinix Private AI with Nvidia DGX is available today. Andy Patrizio is a freelance journalist based in southern California who has covered the computer industry for 20 years and has built every x86 PC he’s ever owned, laptops not included.\nThe opinions expressed in this blog are those of the author and do not necessarily represent those of ITworld, Network World, its parent, subsidiary or affiliated companies. Andy Patrizio is a freelance journalist based in southern California who has covered the computer industry for 20 years and has built every x86 PC he’s ever owned, laptops not included. The opinions expressed in this blog are those of the author and do not necessarily represent those of ITworld, Network World, its parent, subsidiary or affiliated companies. Sponsored Links "
}