{
    "title": "3 Stocks Still Worth Buying at 52-Week Highs",
    "date": "1/23/2024",
    "url": "https://investorplace.com/2024/01/3-stocks-still-worth-buying-at-52-week-highs/",
    "text": " These companies have stocks that are likely to keep on running higher Advertisement Source: Shutterstock After a sluggish start to the year, the stock market has quickly turned around and now sits at an all-time high. The benchmark S&P 500 index closed at an all-time high on Jan. 19 as investors resumed buying equities with a vengeance. Closing at 4,839.81, it surpassed its previous record high set in January 2022. Also, the Dow Jones Industrial Average and technology-focused Nasdaq 100 indices are currently at record highs. The bull run has brought up the share prices of many stocks. While technology stocks continue to lead, many non-tech stocks that are presently on an upswing, trading at 52-week highs. While investors might hesitate to take a position in a stock near peak, some stocks will likely continue rallying higher. And that makes now a fine time to allocate capital. Strong earnings and favorable market conditions will keep these equities moving upwards in coming months. Let’s explore three stocks that are still worth buying at 52-week highs. Up 24% so far in 2024, the stock of chipmaker Nvidia (NASDAQ:NVDA) is trading at an all-time high on a split adjusted basis. Despite rising 210% in the last 52 weeks and leading the benchmark S&P 500, plenty of reasons exist to buy NVDA stock. As many analysts have pointed out, Nvidia’s share price is currently not that expensive. In fact, it is actually the cheapest among the Magnificent 7 securities. While Nvidia’s stock has run far in the past 12 months, its earnings have grown at an even faster clip. For Q4 of 2023, Nvidia has forecast $20 billion in revenue, which implies 231% year-over-year (YOY) growth. For Q3 of last year, the company reported that revenue in its data center chip unit grew 279% YOY. The company’s growth justifies NVDA’s big rally. However, the stock has trailed the financial performance, indicating more room to run. The median price target on NVDA stock is now $650 a share, implying an additional 10% upside from current levels. And, this is prior to company reports of Q4 2023 numbers coming Feb. 21. The stock of shoemaker Deckers Outdoor (NYSE:DECK) is riding high due to the growing popularity of its Hoka running shoes. The company, whose other brands include Uggs and Teva sandals, has seen its share price rise 12% in early January, hitting an all-time high. In the last 12 months, DECK has gained 80%, bringing its five-year return to 504%. Further, the share price performance of Deckers Outdoor is being driven by the company’s earnings, which show record growth. The company’s most recent earnings for Q3 of last year crushed Wall Street forecasts. DECK reported earnings per shares of $6.82, far ahead of the $4.40 consensus estimate. Sales in the quarter increased 24.7% YOY and hit $1.09 billion, topping the expected $960.62 million. Impressively, the company’s direct-to-consumer sales grew nearly 40% in the quarter. Expect another move higher in DECK stock when the company announces its Q4 earnings on Feb. 1. After languishing for the better part of two years, Goldman Sachs (NYSE:GS) gained 34% since it bottomed in late October last year. Now, GS is trading at a 52-week high. While the investment bank’s recently released Q4 2023 results helped the share price, much of the turnaround is due to a recovery in Wall Street deals. In recent weeks, several high-profile and richly valued initial public offerings (IPOs) have been announced, which are expected to be a windfall for Goldman Sachs. Since the start of the year, social media platform Reddit announced that it plans to go public in March at a valuation of as much as $10 billion. Also, Europe’s Amer Sports, best known as the maker of Wilson tennis rackets, has announced plans to go public on the NYSE by late January at a valuation of $8.7 billion. Recently, Nasdaq CEO Adena Friedman said that 100 companies have filed confidentiality to hold IPOs this year. All the deals could be a boon for Goldman Sachs. It continues to get most of its revenue from IPOs and mergers and acquisitions (M&A). On the date of publication, Joel Baglole held long positions in NVDA and DECK. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia. Bank, Consumer Discretionary, Financial, Retail, Semiconductor, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/3-stocks-still-worth-buying-at-52-week-highs/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}