{
    "title": "Why is Nvidia Stock Going Up? The Rise of Nvidia",
    "date": "1/2/2024",
    "url": "https://www.xrtoday.com/mixed-reality/why-is-nvidia-stock-going-up-the-rise-of-nvidia/",
    "text": "Home → Mixed Reality Will Nvidia Stock Continue to Soar in 2024? Published: January 2, 2024 Rebekah Carter If you’re anything like the countless other investors in the tech market, you might be asking, “Why is Nvidia stock going up?” After a somewhat problematic year in 2022, Nvidia soared into the spotlight throughout 2023. In May, the company posted a blowout earnings report; thanks mainly to its investment in Generative AI solutions like ChatGPT, Nvidia has continued to grow. On August 23rd, the company released its revenue report for the second quarter of 2023, showing revenue of $13.51 billion (a 101% increase from last year). It even managed to outperform Wall Street analyst predictions. Once again, in the company’s fiscal third quarter, ending on October 29th, Nvidia reported incredible results. The company’s data center sales grew 279% from the year before to a record $14.51 billion. Q3 revenue soared by 206% to $18.12 billion (almost $2 billion more than analysts predicted). Plus, Q3 adjusted earnings increased by 46%. Now, Nvidia is anticipating an equally impressive 2024, with a possible 231% revenue growth for 2024. But why is Nvidia stock going up so aggressively, and will it grow in 2024, or has the chip maker finally reached its peak? Nvidia burst into the technology scene in 1993 as the brainchild of three chip engineers who believed enhanced computers would one day be able to process better visuals. By the 2000s, the company had earned a contract to make chips for Microsoft’s Xbox console. As the years passed, the company became perhaps the world’s most sought-after producer of high-power computing solutions. The chipmaker pioneered world-leading GPUs (Graphics Processing Units) and began introducing us to some of the most advanced AI chips in the world. These chips are used in everything from supercomputers to data centers. At the same time, Nvidia has proven to be a market innovator, experimenting with chips that support everything from self-driving electric cars to Bitcoin mining. The brand has even begun investing heavily in the metaverse, creating concepts like the omniverse. This isn’t the first time Nvidia has seen a rapid increase in demand. The company’s gaming and data center businesses experienced significant growth during the pandemic as companies upgraded their cloud servers and consumers invested in new technology. Though growth slowed for Nvidia following the pandemic, the arrival of OpenAI’s ChatGPT and other similar LLM and generative AI platforms introduced a new opportunity. Before we look at the question, “Why is Nvidia stock going up?” it’s worth examining how much the company’s value has grown. During May, the chip giant’s earning report introduced a bullish, AI-fueled sales forecast, earning $1.09 a share on sales of $7.19 billion in the quarter ending in April. For the first quarter, data center sales rose 14%, and analysts predicted Nvidia sales would jump 65% by the end of the year. The August earnings report showed Nvidia’s GAAP earnings per diluted share were $2.48 – an 854% increase from the previous year. Non-GAAP earnings per diluted share were $2.70, representing 429% growth from the year before. By December 2023, Nvidia was boasting a 230% share price increase. In its fiscal third quarter, Nvidia’s earnings increased 593% yearly, and sales soared by 206%. For the beginning of 2024, Nvidia predicts sales of up to $20 billion, representing a 231% growth from the previous year and the company’s third straight quarter of triple-digit growth. Like any technology company, Nvidia has experienced ups and downs in the stock market, but few companies matched the success of the tech brand through 2023. Nvidia has become the world’s top producer of GPUs, and its earnings exceeded every estimation throughout the year. At the end of 2023, Nvidia was considered one of the best-performing S&P stocks of the year, dwarfing its next biggest competitor (Meta) in growth. So, why is Nvidia stock going up so aggressively? Perhaps the most obvious answer is the rising interest in AI, generative AI, and LLMs. Technical analysis has shown growing demand for Nvidia’s collection of advanced chips capable of powering the latest AI innovations. Nvidia produces chips capable of crunching massive amounts of data with exceptional efficiency. These are the chips companies need to train cutting-edge AI programs like OpenAI’s ChatGPT 4 and Google’s PaLM 2. As demand for intelligent and spatial computing increases, businesses need hardware that supports high amounts of memory. Many investors believe we’re only at the tip of the iceberg regarding AI demand. This could mean Nvidia has excellent potential for additional growth. However, it also suggests the tech company will face increasing competition in the years ahead. Some analysts, such as Bernstein Research, are concerned that hardware vendors like Nvidia could face the most risk from an impending “overbuild situation.” The general growth of the AI landscape is just one answer to the question of “Why is Nvidia stock going up?”. According to Grandview Research, the market for artificial intelligence is expected to increase at a CAGR of 27.3% from 2023 to 2030. There are a few distinct answers to “Why is Nvidia stock going up.” Here’s what we’ve learned based on industry reports and insights: According to S&P Global, revenues from generative AI applications will surge from a value of $3.7 billion to $36 billion by 2028. This represents an incredible opportunity for Nvidia. Earlier this year, it was revealed that Nvidia’s A100 GPU chips are training OpenAI’s chatbot, ChatGPT. As ChatGPT continues to evolve, it could end up deploying tens of thousands of A100 GPUs, translating into a massive chunk of revenue for Nvidia. Already, Nvidia has a strong reputation in the AI market. The company commands about 95% of the market for machine-learning GPUs. As we move into a new computing era, with companies transitioning from accelerated computing and generative AI, Nvidia is perfectly poised for growth. The company’s hardware has become indispensable to the world of artificial intelligence, and it doesn’t plan on slowing down anytime soon. It’s not just the opportunity to invest in generative AI that gives Nvidia an edge. Another answer to “Why is Nvidia stock going up?” is that the company’s chips can power all kinds of supercomputers. The need for supercomputers is increasing in a world with larger volumes of data and more advanced technology. By 2028, the “supercomputer” market is set to reach around $12.14 billion, and the high-performance computing market will potentially reach $85.34 billion. We’ve already seen examples of companies leveraging Nvidia’s tools for supercomputing use cases. In January 2022, Meta Platforms introduced its Supercluster computer for training complex AI models. This solution was powered by more than 6,000 Nvidia GPUs at the time. However, Meta also shared it would be powered by over 16,000 GPUs when fully built. Elsewhere, Tesla recently shared its plans to start building an AI-focused supercomputer. By the end of this year, this system will have more than 100,000 Nvidia A100 GPUs, according to Musk. Additionally, another 300,000 GPUs will likely be deployed by the end of 2024. It’s also worth paying attention to Nvidia’s role in the metaverse and the extended reality landscape. With its 3D modeling solutions and omniverse tools for streaming XR content more efficiently, Nvidia is poised to transform the future of immersion. As the extended reality market and the concept of the metaverse continue to evolve, demand for Nvidia chips will only increase. Already, countless companies are investing in XR solutions to create digital twins and virtual environments. By 2030, experts believe the XR market will be worth more than $345.9 billion. Nvidia’s technologies are one of the few capable of efficiently powering the metaverse. Nvidia’s processors currently run most of the data centers, powering the future of generative AI. While the company has shown strength in the last year, challenges may lie ahead. We’ve already begun to see evidence of issues emerging. Nvidia stock retreated slightly in November despite a stellar earnings report. The reasons for this stem from factors such as changing AI market regulations and rising competition from other vendors. While the generative AI market is set to continue growing, new regulations and rules are constantly being introduced. The US may be planning to crack down on redesigned Nvidia AI chips. Additionally, US trade restrictions on China linked to advanced semiconductor technologies are already impacting Nvidia’s growth. In the past, Chinese sales have accounted for around 25% of Nvidia’s data center sales. If stricter import controls are implemented, this could substantially impact Nvidia’s future. Despite this, Nvidia does plan to offset this loss with greater growth in other regions, according to Nvidia’s chief financial officer, Colette Kress. Moreover, the company is already exploring opportunities to produce new regulation-compliant computing products for the Chinese market. The rise in people asking, “Why is Nvidia stock going up?” has prompted other competitors in the industry to act. Even before new AI technologies began taking over the landscape, Nvidia stood as one of the dominant graphics chipmakers in the landscape. When new AI tools demanded heavy-duty computing capabilities, this created an opportunity for Nvidia to extend its grip on the market. However, many cloud service providers and large enterprises have been reluctant to rely on a single vendor. This has driven an increased demand for alternatives. On December 6th, 2023, AMD released a new AI chip as part of its Instinct MI300 family of GPU accelerators. AMD also said it plans on growing its momentum with other AI software and hardware partners. Later in December, Intel launched a set of 5th generation Intel Xeon processors for data centers during its “AI Everywhere” event. For now, we know the answer to “Why is Nvidia stock going up?” but it’s difficult to know whether the tech vendor’s growth will continue. Nvidia has done an excellent job building a solid position in the AI market. If the generative AI market grows at its predicted rate of 34% up to 2032, and Nvidia matches that growth rate, its revenue could grow by almost 15 times. However, the growing demand for AI means there will be a lot of different players striving to knock Nvidia from its perch. Of course, Nvidia isn’t simply standing still in the face of rising competition. In November 2023, the company announced an updated H200 computing platform specifically designed for training and deploying advanced AI models. The company is working hard to create a “sticky” ecosystem of solutions that addresses every innovative computing need. Additionally, it’s worth noting that many competitors still have a lot of work to do to catch up with Nvidia. Many cloud service providers like Microsoft, Amazon, and Google Cloud have already developed AI processors that work with Nvidia chips. However, the market is still changing at an incredible rate. In 2023, the consumer world began embracing generative AI with the rise of ChatGPT. In 2024, analysts predict the focus will be on the enterprise, opening the door for new vendors to broach the market with solutions that address specific business concerns, such as security. Nvidia will need to ensure it continues to address the underlying concerns of its target audience as the technology market and AI continue to develop. So far, it seems the company is on the right track, firing on all cylinders to maintain its edge in the industry. Alongside the question “Why is Nvidia stock going up?” one of the most common queries among investors is: “Is it still worth buying?” As with most investment landscapes, the answer depends on who you ask. According to some reports, Nvidia has proven to be one of the best-performing stocks of the last 30 years. Between 1990 and 2020, the company generated over $309.4 billion in wealth for shareholders. Twenty years ago, if you put just $1,000 into Nvidia stock, you would have earned an annualized return of around 30%. Even though stock growth for the company began to lag at the end of 2023, there’s still significant potential for the tech brand. Since its IPO, Nvidia’s revenues have grown by over 6,180%, most of which happened in the last few years. However, the competition is starting to heat up. As we move into 2024, Nvidia is still positioned for explosive growth, but only if it can stay ahead of the competition. At the same time, as macroeconomic uncertainties continue to linger and geopolitical risks evolve, there will be countless challenges for the chip manufacturer to navigate. For now, Nvidia appears to be an incredible investment opportunity for AI and tech enthusiasts. We’ll have to wait and see whether it retains its position as the market leader.    Mixed Reality Tencent Involved in Apple Vision Pro’s China Launch – Reports Mixed Reality Will Apple Debut the Vision Pro In China this Year? Mixed Reality Could Major XR Partnerships Offset High-Risks and Costs? Mixed Reality XR Cloud Streaming to Break Down Enterprise Barriers, says Innoactive Mixed Reality IDC Predicts Surge in AR and VR Headset Shipments Mixed Reality Big XR News from NVIDIA GTC, Apple, LG, and HTC VIVE Share This Post Mixed Reality Tencent Involved in Apple Vision Pro’s China Launch – Reports Mixed Reality Will Apple Debut the Vision Pro In China this Year? Mixed Reality Could Major XR Partnerships Offset High-Risks and Costs? Get our Free Weekly Newsletter, straight to your inbox! Handpicked News, Reviews and Insights delivered to you every week. Tech Industries Trending Topics Featured Brands About More All content © Today Digital 2024 "
}