{
    "title": "Chip-making giant TSMC halts revenue drop on brisk AI demand",
    "date": "1/10/2024",
    "url": "https://www.scmp.com/tech/big-tech/article/3247936/tsmc-halts-revenue-drop-beats-expectations-brisk-demand-ai-chips-nvidia-advanced-micro-devices",
    "text": "Taiwan Semiconductor Manufacturing Co (TSMC), the world's largest contract chip maker, saw its fourth-quarter revenue beat estimates of a decline, as demand from artificial intelligence (AI) players helped offset sluggish smartphone and laptop chip sales. Hsinchu-based TSMC, the main chip supplier to Apple and Nvidia, reported December sales of NT$176.3 billion (US$5.7 billion), completing a NT$625.5 billion quarter. That matched earnings from the same period a year earlier, which was among TSMC’s highest quarterly results. The average analyst estimate for sales over the last three months was NT$616.2 billion. Over the course of 2023, TSMC moderated its capital expenditure plans as the consumer electronics industry grappled with a glut of unsold inventory. The chip maker signalled the trough in demand had been reached in the summer and recovery would begin to take hold in the months leading up to 2024. 02:42 Biden tours new Taiwanese chip-making plant in Arizona, fans US-China semiconductor rivalry Overall revenue declined 4.5 per cent last year, to NT$2.16 trillion. While it outdid analyst expectations and its own guidance, TSMC’s US$20.2 billion quarter still fell short of delivering growth. December sales were down 8.4 per cent on the same month a year earlier, offering a mixed outlook for the year ahead. Top management including chief executive CC Wei have said they expect overall business to grow this year, and the company has seen its high-performance computing business boosted by demand for AI chips from Nvidia and Advanced Micro Devices. Still, the latest report from the Semiconductor Industry Association showed the first growth in chip sales in over a year came in November, suggesting momentum is gathering for a resurgence in 2024. Upgrades to AI server farms and on-device AI applications are likely to drive an information technology replacement cycle, according to HSBC analysts Ricky Seo and Hankil Chang. “For US cloud service providers, we expect capex to grow significantly, about 65 per cent in 2024e. Additionally, AI server purchases will likely total 57 per cent of their investments in 2024e, up from 8 per cent in 2022,” they wrote in a research note on Wednesday. Apple, arguably TSMC’s most important customer, has faced headwinds with its latest iPhone generation in China, the world’s biggest smartphone market. Several analysts have downgraded Apple this year on expectations of soft demand, and this week Jefferies said the iPhone sales slump in China is likely to deepen. "
}