{
    "title": "2 důvody, proč být v roce 2024 nakloněn společnosti Nvidia",
    "date": "1/4/2024",
    "url": "https://medium.seznam.cz/clanek/mercurius-pro-2-duvody-proc-byt-v-roce-2024-naklonen-spolecnosti-nvidia-38337",
    "text": "Tlačítkem Sledovat můžete odebírat oblíbené autory a témata. Články najdete v sekci Moje sledované. Obchodní aktivity společnosti v roce 2023 prudce vzrostly, ale i nadále zůstává jedním z nejzajímavějších nákupů pro nový rok. Americký výrobce čipů Nvidia Corp. (NVDA) překonal veškerá očekávání a završil jeden z nejúspěšnějších fiskálních roků od svého založení před téměř 30 lety. Tento technologický gigant, který je již dobře známý svou rozhodující rolí na trhu s hrami a profesionální grafikou, si zajistil postavení hnací síly v rychle rostoucím odvětví umělé inteligence (AI). Tento fenomén vyhnal poptávku po grafických procesorech (GPU) společnosti do nebývalých výšin a umožnil tak jejímu hardwaru dominovat na trhu s čipy pro umělou inteligenci. V důsledku toho cena akcií společnosti Nvidia v uplynulém roce vzrostla o téměř 240 %. Do roku 2024 vstupuje společnost Nvidia s plně rozvinutými plachtami a je nejen lídrem, ale nyní ovládá většinový podíl na trhu v lukrativním odvětví čipů umělé inteligence. Navzdory závratnému dvanáctiměsíčnímu vzestupu prokázala společnost Nvidia odolnost a pokračující chuť k růstu a zároveň si udržela svůj půvab jako solidní investice. Jistota v budoucí úspěch společnosti Nvidia není neopodstatněná. Níže uvádíme dva pádné důvody, které vysvětlují, proč je optimismus investorů kolem společnosti Nvidia na prahu roku 2024 stále vysoký. Počítačový trh se dostává z krize: Naděje na obzoru Technologický sektor dostal v roce 2022 pořádně zabrat, protože makroekonomické faktory vyvolaly výprodej, v jehož důsledku se index technologického sektoru Nasdaq-100 propadl o znepokojivých 40 %. Po náročné fázi se však toto odvětví v roce 2023 do jisté míry zklidnilo, a to zejména díky zmírnění inflace a rostoucímu nadšení pro inovativní technologická odvětví, především pro umělou inteligenci. Prognózy na rok 2024 ukazují na pokračující renesanci. Společnost Gartner uvedla, že dodávky osobních počítačů se v roce 2022 propadly o výrazných 16 %, protože naléhavost upgradovat zařízení po pandemii klesla a peněženky se pod tlakem inflace a rostoucích úrokových sazeb napjaly. Co by se dalo považovat za pozitivní zprávu, krvácení se zpomalilo a ve třetím čtvrtletí roku 2023 dodávky PC klesly méně výrazně, a to o 9 %. Zprávy několika technologických firem podnítily optimismus ohledně blížícího se obratu na trhu. Společnost Nvidia, která se v předchozích dvou letech potýkala s problémy v oblasti PC, označuje svůj herní segment za hlavního příjemce svých prodejů souvisejících s PC; její GPU jsou rozhodující pro sestavování výkonných herních sestav. Ve svém třetím fiskálním čtvrtletí roku 2024, které skončilo 29. října, se herní segment společnosti Nvidia pochlubil meziročním nárůstem tržeb o 81 % a 15% nárůstem oproti předchozímu čtvrtletí, což značí nesporné známky oživení. Udržení dominantního postavení v oblasti umělé inteligence Zatímco konkurenti jako Advanced Micro Devices (AMD) a Intel se po léta zaměřovali především na trh s centrálními procesory (CPU), Nvidia pečlivě rozvíjela svou nabídku GPU. Tento strategický manévr postavil společnost Nvidia do výhodné pozice, když se osa technologického světa loni přiklonila k umělé inteligenci, a oživil tak poptávku po aplikacích poháněných grafickými procesory. Díky tomu Nvidia rychle získala odhadovaný 90% podíl na trhu s čipy pro umělou inteligenci. Silný nárůst prodeje GPU pro umělou inteligenci se výrazně projevil ve výsledcích společnosti Nvidia za 3. čtvrtletí fiskálního roku 2024: Společnost zaznamenala meziroční nárůst tržeb o 206 %, zatímco její provozní výnosy vzrostly o ohromujících 1 600 %. Příjmy společnosti Nvidia z datových center, která jsou klíčovým příjemcem nárůstu umělé inteligence, se v tomto čtvrtletí zvýšily o 279 %. Vzhledem k pozoruhodným ziskům společnosti Nvidia v tomto fiskálním roce někteří upírají oči k obzoru, protože přímí konkurenti AMD a Intel se v nadcházejících měsících chystají dodat své nové čipy s umělou inteligencí. Rostoucí rivalita vnáší do vyhlídek společnosti Nvidia v letošním roce trochu obav. Společnost Grand View Research nicméně předpokládá, že trh s umělou inteligencí bude do roku 2030 narůstat složenou roční mírou růstu (CAGR) o 37 %, což by mohlo znamenat, že do konce desetiletí objem trhu v tomto odvětví přesáhne 1 bilion dolarů. Tento expanzivní růst trhu potenciálně představuje pro společnost Nvidia více než dostatečný prostor k tomu, aby si nejen udržela, ale i posílila svou dominantní pozici na trhu, a to i v době, kdy se konkurenční prostředí rozrůstá. Historie také napovídá, že Nvidia neochvějně drží svůj podíl na trhu; Nvidia je již léta lídrem s více než 80% podílem v oblasti grafických procesorů pro stolní počítače, přestože AMD a Intel v tomto segmentu výrazně pronikají. Zopakovat tuto úroveň dominance v oblasti umělé inteligence je pro konkurenty těžký úkol, protože pevná pozice společnosti Nvidia představuje pevnou obranu proti pokroku soupeřů. Růstová trajektorie společnosti Nvidia: Silné prognózy před námi Přesvědčivý příběh růstu společnosti Nvidia zde nekončí. Dominantní postavení společnosti v oblasti umělé inteligence spolu s jejím oživením v oblasti osobních počítačů představuje obrovský potenciál pro nadcházející roky. Odhady analytiků ohledně zisků společnosti Nvidia tento optimismus odrážejí a naznačují, že by zisk na akcii (EPS) společnosti mohl do jejího fiskálního roku 2026 dosáhnout působivých 24 dolarů. Pokud to porovnáme se současným poměrem forwardové ceny k zisku (P/E) společnosti Nvidia ve výši 40, dojdeme k předpokládané ceně akcií 960 USD – což je oproti současnému ocenění pořádný nárůst o 94 %. Na základě těchto prognóz a skvělých fiskálních výsledků se akcie společnosti Nvidia jeví jako jedna z nejzajímavějších investic do technologických produktů pro rok 2024. Vzhledem k tomu, že umělá inteligence se nadále prosazuje v technologiích i každodenním životě a trh s osobními počítači opět nachází své pevné místo, zdá se, že společnost Nvidia se vydala na trajektorii, která bude pravděpodobně i nadále odměňovat její akcionáře a posilovat její postavení titána v technologickém průmyslu. Máte na tohle téma jiný názor? Napište o něm vlastní článek. Texty jsou tvořeny uživateli a nepodléhají procesu korektury. Pokud najdete chybu nebo nepřesnost, prosíme, pošlete nám ji na medium.chyby@firma.seznam.cz. Reklama Reklama Stačí mít účet na Seznamu a můžete začít psát. Ty nejlepší články se mohou zobrazit i na hlavní stránce Seznam.cz Reklama Copyright © 1996–2024, Seznam.cz, a.s. "
}