{
    "title": "The Daily Chase: NVidia passes Amazon and Google",
    "date": "2/15/2024",
    "url": "https://www.bnnbloomberg.ca/the-daily-chase-nvidia-passes-amazon-and-google-1.2035317",
    "text": "Are you looking for a stock? Try one of these Are you looking for a stock? Try one of these More More Latest Videos {{ video.Name }} The information you requested is not available at this time, please check back again soon. Most Popular Content Feb 15, 2024  Pete Evans , BNN Bloomberg The Voyager building at Nvidia headquarters in Santa Clara, California, US, on Monday, June 5, 2023. Photographer: Marlena Sloss/Bloomberg\n                        , Bloomberg Here are five things you need to know this morning: NVidia climbs the ranks: The rise of semiconductor giant NVidia has been fascinating to watch in recent months and years, as the sudden explosion of artificial intelligence has caused demand for the company’s chips to go parabolic. After tripling in value in 2023, the company has managed to add another 40 per cent to its market cap in the first six weeks of 2024 and now finds itself in some truly rarified air.  The company’s dizzying ascent passed a couple of significant waypoints this week, passing Amazon’s market capitalization on Tuesday and then Google parent Alphabet’s on Wednesday. As of the start of trading on Thursday, the company was worth just over US$1.83 trillion, while Alphabet was at US $1.82T. On the leader board, NVidia is now staring up at Apple at US$2.84T and then just Microsoft atop them all, at $3.04T. Truly remarkable stuff for a company that before the pandemic, was worth about US$140 billion — that’s about as much as Canada’s biggest company, the Royal Bank of Canada, is worth today. Canada’s population surge has a gender gap: Much has been written about Canada’s stunning population surge in recent years, where an immigration boom has seen the country adding hundreds of thousands of working-aged adults every year. That growth leads the G8 and while it’s an enviable problem to have for many developed economies with declining birth rates, it’s come with a host of problems. While the subject has been discussed at length — deservedly so — economist Doug Porter with BMO noted a fascinating new wrinkle on the trend in a report this week, observing that the bulk of new arrivals are men, not women. Canada’s adult male population grew by 3.4 per cent in the past year, Porter notes, while that of women rose 2.9 per cent. That’s a reversal of the trend seen between the late 1970s and roughly 2010, where Canada’s population was skewing more female. In 2022, the gap between men and women was at its narrowest in more than 30 years, but based on the latest numbers, the spread between the growth of the two groups is now at the widest in nearly 50 years of records. Housing starts in focus: Turning now to something that could do with a surge, we’ll keep an eye on the latest numbers from Canada’s housing agency about housing starts. Policymakers, economists, demographers and the industry itself are in agreement that Canada hasn’t been building enough homes to keep up with its growing population for years now, and the problem actually seems to be getting worse, not better. The CMHC will release its latest data on housing starts, and barring something unexpected, that pace of home construction is likely to fall short of what’s needed to produce the millions more homes we are going to need in the next decade or so. Bellwether retail results: We’ve got our eyes on a couple of consumer-focused corporate earnings of note, and they are sending some mixed signs about the state of Canadian shoppers. First, numbers from major retailer Canadian Tire showed that the company’s fourth-quarter profit and revenue fell compared to a year ago as it navigated what it calls “a challenging economic environment.” A bout of unseasonably warm weather in December didn’t help either, as it reduced demand for winter sports gear that the company is a leading supplier of. Same-store sales were down 6.8 per cent. The view was a bit less gloomy at food court giant MTY Group, where demand at it’s more than 7,000 restaurant locations under banners like including Mr. Sub, Manchu Wok and Mr. Souvlaki was strong enough for the company to post higher profits and sales. Revenues rose to $280 million from $242 million, which was just shy of analyst expectations. The company previously announced a dividend hike for this quarter, with the payout rising 12 per cent from $0.25 per share to $0.28 per share. BNNBloomberg will have an exclusive interview with MTY’s CEO Eric Lefebvre at 10:20 EST on The Open today. BOC to wind down QT: As everyone with a variable rate mortgage waits for the Bank of Canada to start cutting rates this year, there are signs beneath the surface that the central bank is getting its affairs in order to remove stimulus everywhere it can. Data from the bank’s balance sheet show its assets have tumbled to around $313 billion according to the latest figures. That’s almost half the peak of $570 billion hit earlier in the pandemic and the reason is that the bank is allowing the government bonds it holds to mature, draining liquidity form the system. The bank previously signalled it expected to end its “quantitative tightening” program at the end of 2024 or perhaps early 2025, but Simon Deely, RBC’s director of Canada rates strategy, said in a note to investors this week he thinks that could happen as soon as the April policy meeting, currrently scheduled for April 10. At the very latest, “quantitative tightening ends at a similar time as the first rate cut,” Deeley says. "
}