{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.electronicsweekly.com/news/business/nvidia-makes-semi-no3-slot-2024-02/",
    "text": "By  David Manners \n6th February 2024 In 2023, Intel took the No.1 slot while the memory slump pushed Samsung  to No.2 and the AI boom raised Nvidia to No.3, says Counterpoint Research. In 2023, Intel took the No.1 slot while the memory slump pushed Samsung  to No.2 and the AI boom raised Nvidia to No.3, says Counterpoint Research. It was a year when revenues fell 8.8% y-o-y and only six of  top 20 semiconductor vendors showed y-on-y growth. Memory revenue  was down 43% y-o-y. The  top 20 global semiconductor vendors contributed to 71% of the market, down from 76% in 2022 and showing a 14% y-o-y revenue decline. Intel saw revenues fall 16%; Samsung’s  fell 38% m; Hynix was doen 33% and Micron down 36%.  Top 10 semiconductor companies’ revenue equals 55% of global revenue. Source: Counterpoint Research. Nvidia had an 86% y-o-y  revenue surge, securing. a third place in revenue, its first-ever top five position. Tagged with: Nvidia Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Get our news, blogs and comments straight to your inbox! Sign up for the Electronics Weekly newsletters: Mannerisms, Gadget Master and the Daily and Weekly roundups.  Find out more » Read our special supplement celebrating 60 years of Electronics Weekly and looking ahead to the future of the industry. Read the Electronics Weekly @ 60 supplement »\n\nRead the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it.\nRead the very first edition »  Read the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it. Read the very first edition » Keep up with developments relating to space technology - satellite technology, PNT, thermal imaging, SatIoT, spaceports and more View our busy aerospace section »  Image: ESA Read our special supplement celebrating 60 years of Electronics Weekly and looking ahead to the future of the industry. Read the Electronics Weekly @ 60 supplement »\n\nRead the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it.\nRead the very first edition »  Read the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it. Read the very first edition » Keep up with developments relating to the Internet of Things (IoT) - Industrial IoT, sensors, Edge AI, battery technology, SatIoT and more View our popular Internet of Things section »  Image: ESA "
}