{
    "title": "Nvidia Stock: Buy Protection Before Earnings (NASDAQ:NVDA)",
    "date": "2/14/2024",
    "url": "https://seekingalpha.com/article/4670124-nvidia-buy-protection-before-earnings",
    "text": "Michael M. Santiago/Getty Images News Michael M. Santiago/Getty Images News Nvidia Corporation's (NASDAQ:NVDA) fourth quarter earnings for fiscal 2024 are expected to come out after the close on February 21st. As I've written in past articles, Nvidia earnings releases are among the most important of all tech releases. This is because Nvidia is the supplier of chips to the big artificial intelligence \"AI\" companies, such as Microsoft (MSFT), Alphabet (GOOG) and Meta Platforms (META). Although other companies build AI chips, only Nvidia currently offers chips powerful enough to handle the most demanding workloads. NVDA stock has defied almost everybody's expectations in the last two years. Since the start of 2022, it has risen 300% in price, and is a 20-bagger over a five year period. It has really been something to witness. With that being said, nothing is worth an infinite price. Although Nvidia has fantastic growth and a wide moat, that doesn't mean the stock is worth, say, $10 trillion. Any series of future cash flows is finite, which means asset prices are finite as well. The question, of course, is where the upper limit of fair value actually resides. Attempting to find that upper limit for Nvidia's price has proven difficult. The company currently has a higher market cap than Google and Amazon (AMZN), and is not showing signs of slowing down. With that said, it's not just going to keep rallying forever. Major Nvidia bulls like Stanley Druckenmiller and George Soros were trimming their positions in the third quarter. At today's prices, NVDA trades at 83 times earnings, and 58 times forward earnings. The price/book ratio is an unheard-of 53.5. Although Nvidia is likely to continue growing for the next several quarters, and probably at high rates, much of the future growth is already priced in. If you take a $1 cash flow and grow it at 20% for five years, after which time the growth slows to 5%, then with a 10% discount rate, the cash flow is worth $39. If the stock hits that price then it has a P/E ratio of 39-lower than Nvidia's current multiple. Although Nvidia's growth was much faster than 20% last year, the company will soon have 2023's sky-high profits in the base period. The economic principle of \"base effects'' says that maintaining the same percentage growth from one period to the next, requires even more dollar growth. In other words, high percentage growth becomes harder to achieve with scale. Currently, analysts expect Nvidia to deliver $12.33 in adjusted EPS for 2024. That represents 63% growth over the trailing 12-month sum ($7.53). That's still well ahead of 20%, granted, but keep in mind that the TTM growth rate was 222%. The expectation of 63% growth next year is consistent with a gradual decline to a 20% CAGR growth rate over five years. After five years, Google, Microsoft and Meta may well have their own AI chips in production - Google's Tensor Processing Unit has already been built. Should all of these tech companies successfully launch advanced AI chips, then Nvidia will no longer have a wide moat, and its earnings growth will probably decline if not turn negative. So, Nvidia's growth story faces several long-term risks, which is why I rated it a hold the last time I covered it. I still think it is a hold if unhedged. However, it occurred to me recently that there was a way of enjoying the possible continued upside of Nvidia while mitigating risk: protective puts. Nvidia puts are quite cheap these days: you can buy the right to sell on February 16 at $675 for $1.32 (midpoint price), and at $650 for $0.40. This results in total costs between $80 and $264 for puts giving you the right to sell 200 shares. You can protect a $72,100 position against 6.3% downside for $264-a mere 0.36% of what the shares are worth. Now, this \"extreme cheapness\" is a function of these contracts' February 16 expiration date. It costs more for expiration dates further out. In the ensuing paragraphs, I will show that hedging 100 Nvidia shares all the way through the company's upcoming earnings release is relatively inexpensive, too. First, though, we need to discuss this stock's fundamentals to illustrate why hedging a long position is desirable. Nvidia's mix of strong business fundamentals and extraordinarily high multiples make it a stock worth hedging. Anybody going long the stock could get hit with an extremely severe correction if the company misses earnings on February 21st. On the other hand, someone going short would get burned if the last two years' trend were to continue. On balance, a hedged long position is preferable. To understand why that is, we need to understand the value of Nvidia as a company. If Nvidia were for sale in a private transaction, would it make sense to buy it? Here's what we know: Nvidia growth rates in revenue and earnings were both extraordinarily high in the trailing 12-month period. Revenue was up 57%, earnings were up 222% and free cash flow was up 173%. The growth rates are expected to be high for 2024, but not as high as before. The 63% expected growth over 2023 earnings levels cuts the growth rate by two thirds-significant deceleration. As previously mentioned, Nvidia's big tech customers are all working on chips of their own. Reviewers are touting the ability of the Apple's M3 Max to handle AI workloads. Most other big tech companies are working on plans to build their own chips. In Porter's five competitive forces model, \"power of customers\" is named as a risk to a company's competitive position. If Google, Apple, Amazon and Meta can build their own chips that are as good as Nvidia's, then Nvidia 's competitive edge will evaporate, and its margins will likely decline. To illustrate that last point, we can use some basic microeconomics. If the quantity supplied equals the price, and the quantity demanded equals 7 minus the price, then we end up with equilibrium at $3.5. If, on the other hand, quantity demanded equals five minus price, then the equilibrium price is $2.5. When a customer develops a way to do business without a supplier, that causes a decline in the quantity demanded. The math and charts on that are shown below. How customers becoming less reliant on a company reduces that company's revenue (The author)Supply and demand (The author) How customers becoming less reliant on a company reduces that company's revenue (The author) Supply and demand (The author) Now, in the real world, supply and demand functions are driven by many different variables, and supply/demand dynamics are not as simple as these basic functions. Nevertheless, Porter's Five Competitive forces does predict that Nvidia will lose revenue if/when its big tech clients make their own chips. If it loses revenue faster than its costs go down, then its earnings will decline as well. My expectation is that Nvidia will face increased bargaining power from customers within the next five years, but not within the next year. The reason is that building chips is complex and takes a lot of time to scale. As Google showed with TPU, it's possible to develop systems that beat NVIDIA's previous generation systems on some benchmarks. For now, Google is still buying Nvidia chips: specifically, the newer H100. Over time, though, and with enough R&D spending, the big tech giants should become less reliant on Nvidia products. Apple's success with its A and M series chips proves that you don't need to be a pure play semi company to make your own chips. All of that has to be kept in mind when looking at the profitability and growth metrics below. They look good, but they will stop looking so good if and when clients stop being reliant on Nvidia. First up, let's look at the profitability metrics, courtesy of Seeking Alpha Quant. These ratios are all very high, but if demand for Nvidia chips falls, then the margins and returns on assets/equity will fall as well. NVDA profitability (Seeking Alpha Quant) NVDA profitability (Seeking Alpha Quant) Next up, we have the growth numbers. Again, these look amazing, with revenue up by 57%, and with earnings and FCF up by three figure percentages. These growth rates are much higher than the same rates for other \"Magnificent 7\" stocks. NVDA growth (Seeking Alpha Quant) NVDA growth (Seeking Alpha Quant) Next, we have the growth rates from the most recent quarter. Revenue, earnings and diluted EPS were up even more in Q3 than they were in the trailing 12-month period. So, acceleration was observed in 2023. That's definitely a good thing, however, it was partially due to weakness in the base period: in last year's Q3, revenue went down 17%. Most analysts expect growth to decelerate this year. Finally, we have the valuation. This is where things start to get ugly for Nvidia. All of the multiples below are much higher than the averages for the information technology sector. That's really saying something, because the NASDAQ 100-Index (NDX) is already at 32 times earnings. NVDA valuation (Seeking Alpha Quant) NVDA valuation (Seeking Alpha Quant) Another way to value Nvidia stock is to discount its earnings, which were $7.53 in the trailing 12-month period. If you assume no growth and discount that sum at the 10 year treasury yield (US10Y), you get just a $171 fair value estimate. If you assume 20% growth for five years and 5% growth every year after that period, and use a 10% discount rate, you get a $293 fair value estimate. You need to model for an extreme amount of growth and a low discount rate to get a fair value estimate above the current stock price. So, the level of risk here is very high. To sum up everything we've covered so far: Nvidia has extremely high margins and growth. Its growth is expected to decelerate in 2024. Big tech companies making their own chips would cause Nvidia revenue and margins to decrease. NVDA stock is valued with high future growth in mind. These signals are very mixed, which is why I recommend anybody going long NVDA now hedge their position. Assuming you can afford to hold 100 Nvidia shares within an adequately diversified portfolio, it makes sense to hedge the position. Nvidia can be hedged with protective puts quite cheaply now in relation to its stock price. A put on NVDA with a $650 strike price expiring March February 23 currently costs $13.82. An otherwise identical put with a $680 strike price costs $23.80. Puts are sold in lots of 100. At the time of this writing, NVDA had closed at $721.50. You can more than hedge the downside on NVDA stock by buying protection in the ratio of 200 puts to every 100 Nvidia shares. 100 Nvidia shares costs $72,150. Two hundred puts with a $650 strike price cost $2,764. Two hundred puts with a $680 strike price cost $4,760. If you have 100 Nvidia shares, you pay 3% to protect against 9.9% downside, or 6.5% to protect against 5.8% downside. With the $650 strike price you are paying less for protection than the magnitude of the downside you are protecting against. If you use a stop loss order, you can even profit off of Nvidia going down. For example, if you do a stop loss at $680, and you sell NVDA at $680 when its price is $600, then you get a $11,240 payoff. That is, the $80 difference, times 200, minus $4,760 in premiums. At the same time, your Nvidia shares only decline $4,150 in price. So, you will have profited on the trade to the tune of $7,090. The worst case scenario is if Nvidia is at $680 when your options expire, in which case you take $4,150 in capital losses and pay $4,760 in premiums. The total loss in this extreme scenario is still just 12.3% of your $72,150 position. So, hedging a $72,150 position in Nvidia with two puts for every one share makes sense. If you buy the puts that expire on March 23, you'll be covered throughout the entire period when Nvidia reports earnings, your potential downside is extremely minimal, and the portion taken out of your potential upside is minimal too. It's a great way to deal with the uncertainty surrounding Nvidia stock, at a time when everybody in big tech is looking to make their own AI chips. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AAPL, GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}