{
    "title": null,
    "date": "2/9/2024",
    "url": "https://stocknews.com/news/nvda-stm-csco-nvda-vs-stm-which-will-be-the-dominant-chip/",
    "text": "Login \n        Join Login \n                                            Join NVDA – In the middle of the chip industry’s boom fueled by rebounding demand, advanced tech adoption, and beefed-up investments, which of the two chip stocks, NVIDIA Corporation (NVDA) and STMicroelectronics (STM), would take the cake as the top dog chip stock in 2024? Read more to find out…. Feb 9, 2024 In this piece, I evaluated two chip stocks, NVIDIA Corporation (NVDA) and STMicroelectronics N.V. (STM), to predict the leading player in 2024. However, before diving into specifics, let’s examine the prevailing dynamics influencing the chip sector. Post-pandemic, the chip industry demonstrated remarkable resilience, navigating through supply chain disruptions, geopolitical tensions, and evolving consumer preferences. Despite these challenges, the industry not only persevered but flourished, showcasing its adaptability and capacity to thrive amid dynamic external pressures. Looking ahead to 2024, IDC predicts a significant resurgence driven by recovering smartphone demand and the increasing need for AI chips, with an annual growth rate projected to exceed 20%. Similarly, Gartner (IT) anticipates a parallel surge, forecasting a 16.8% growth in global semiconductor revenue, reaching $624 billion. In line with these optimistic projections, SEMI’s latest quarterly report paints a picture of growth, with a 6.4% surge in global semiconductor capacity expected in 2024, surpassing 30 million wafers per month for the first time. This uptick follows a 5.5% increase witnessed in 2023, reflecting the industry’s momentum. The expansion is not happening in isolation; instead, it’s driven by the adoption of cutting-edge technologies such as generative Artificial Intelligence (AI) and High-Performance Computing (HPC), alongside a resurgence in end demand for chips. With the global demand for chips steadily rising, the industry finds itself in a favorable position for sustained growth. Moreover, increased government incentives and a surge in fab investments act as catalysts for these promising trends. As a result, the chip market is poised to usher in a new era of innovation and prosperity. In terms of price performance, NVDA has gained 33.3% over the past month, while STM marginally plunged during the same period. Additionally, NVDA surged 213.6% over the past year, closing the last trading session at $696.41, whereas STM declined 6.8% during the same period, closing the last trading session at $45.17. But which Semiconductor & Wireless Chip stock could be a better pick? Let’s find out. 10 STOCKS TO SELL NOW! Recent Developments On February 6, 2024, NVDA and Cisco Systems, Inc. (CSCO) announced their collaboration to provide accessible AI infrastructure solutions for data centers, facilitating the substantial computing power crucial for enterprises in the AI era. The partnership would enable NVDA to streamline access to essential infrastructure, empowering enterprises worldwide to harness the transformative potential of generative AI. On January 18, 2024, STM announced its partnership with ZINSIGHT Technology, providing third-generation silicon-carbide (SiC) MOSFET technology for e-compressor controllers in New Energy Vehicles (NEVs). The collaboration could lead to significant gains for STM through increased demand for its highly efficient controllers, catering to the expanding NEV market. Recent Financial Results For the fiscal 2024 third quarter that ended October 29, 2023, NVDA’s non-GAAP revenue increased 205.5% year-over-year to $18.12 billion. However, its non-GAAP operating expenses grew 13% from the year-ago value to $2.03 billion. Additionally, as of October 29, 2023, NVDA’s current liabilities amounted to $9.10 billion, up from $6.56 billion as of January 29, 2023, while its total liabilities came in at $20.88 billion, compared to $19.08 billion as of January 29, 2023. For the fiscal 2023 fourth quarter that ended December 31, 2023, STM’s other revenues increased 25% year-over-year to $20 million. Its cash inflow from financing activities came in at $336 million, compared to a cash outflow of $185 million in the prior year’s quarter. Moreover, as of December 31, 2023, STM’s current assets amounted to $11.81 billion, up from $9.81 billion as of December 31, 2022, while its total assets stood at $24.45 billion, compared to $19.98 billion as of December 31, 2022. Past and Expected Financial Performance Over the past three years, NVDA’s revenue and EBITDA increased at a CAGR of 44.8% and 63.3%, respectively. Moreover, its net income and EPS grew at respective CAGRs of 70.3% and 70.5% over the same time period. The consensus revenue estimate of $92.18 billion for the fiscal year ending January 2025 reflects a 56.4% year-over-year increase. Moreover, the company’s EPS is expected to grow 68.2% from the prior year to $20.71. STM’s revenue and EBITDA rose at a CAGR of 19.2% and 39.3%, respectively, over the past three years. In addition, its net income and EPS increased at a CAGR of 56.2% and 54.9%, respectively, over the same time frame. For the fiscal year ending December 2025, analysts expect the company’s revenue to reach $17.58 billion, indicating a 9.1% year-over-year increase. Likewise, STM’s EPS for the same period is expected to grow 27.6% from the previous year to $3.85. Valuation In terms of trailing-12-month non-GAAP P/E, STM is trading at 10.13x, 87.4% lower than NVDA, which is trading at 80.14x. STM’s trailing-12-month Price/Sales of 2.28x is 94% lower than NVDA’s 38.31x. In addition, STM’s trailing-12-month EV/EBITDA of 6.16x compares with NVDA’s 77.29x, respectively. Thus, STM is more affordable. POWR Ratings NVDA has an overall rating of C, which equates to Neutral in our proprietary POWR Ratings system. Conversely, STM has an overall rating of B, translating to Buy. The POWR Ratings are calculated considering 118 different factors, with each factor weighted to an optimal degree. Our proprietary rating system also evaluates each stock based on eight distinct categories. NVDA has an F grade for Value, reflecting its higher-than-industry valuation. In terms of forward EV/EBIT and forward Price/Cash Flow, the stock is trading at 48.56x and 59.82x, 133.1% and 154.2% higher than the industry average of 20.83x and 23.53x, respectively. In contrast, STM has an A grade for Value, reflecting its lower-than-industry valuation. In terms of forward EV/EBIT and forward Price/Cash Flow, the stock is trading at 11.23x and 8.59x, 46.1% and 63.5% lower than the industry average of 20.83x and 23.53x, respectively. Furthermore, NVDA has a D grade for Stability due to its high 24-month beta of 1.94, indicating significant volatility. In contrast, STM boasts a C grade for Stability, supported by its comparatively lower 24-month beta of 1.28. Of the 91 stocks in the Semiconductor & Wireless Chip industry, NVDA is ranked #21, while STM is ranked #8. Beyond what we’ve stated above, we have also rated both stocks for Growth, Momentum, Quality, and Sentiment. Click here to view NVDA’s ratings. Get all STM ratings here. The Winner Forecasts for the year paint a picture of a resurgence driven by escalating demand for AI chips and the recovery of the smartphone market. The trajectory is further reinforced by significant technological progress and increased investment, heralding a future ripe with innovation and prosperity. In this landscape, both NVDA and STM stand poised to capitalize on the industry dynamics. However, STM’s discounted valuation and greater stability could render it a more compelling investment choice compared to NVDA at this juncture. Our research shows that the odds of success increase when one invests in stocks with an overall rating of Strong Buy. View all the top-rated stocks in the Semiconductor & Wireless Chip industry here. What To Do Next? 43 year investment veteran, Steve Reitmeister, has just released his 2024 market outlook along with trading plan and top 11 picks for the year ahead. 2024 Stock Market Outlook > Want More Great Investing Ideas? 3 Stocks to DOUBLE This Year Updated: 2024 Stock Market Outlook > 10 Stocks to SELL NOW! NVDA shares were trading at $715.14 per share on Friday morning, up $18.73 (+2.69%). Year-to-date, NVDA has gained 44.41%, versus a 5.17% rise in the benchmark S&P 500 index during the same period. Aanchal's passion for financial markets drives her work as an investment analyst and journalist. She earned her bachelor's degree in finance and is pursuing the CFA program.\r\n\r\nShe is proficient at assessing the long-term prospects of stocks with her fundamental analysis skills. Her goal is to help investors build portfolios with sustainable returns. More... Copyright © 2024. Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions.Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use, please see disclaimer. "
}