{
    "title": "5 Investors Betting Big on Beamr Imaging (BMR) Stock",
    "date": "2/12/2024",
    "url": "https://investorplace.com/2024/02/5-investors-betting-big-on-beamr-imaging-bmr-stock/",
    "text": " BMR stock is surging higher today on a collaboration with Nvidia Advertisement Source: thinkhubstudio / Shutterstock.com Beamr Imaging (NASDAQ:BMR) stock is up by 700% after the company announced that it would present its automated video modernization joint research in collaboration with Nvidia (NASDAQ:NVDA) at the ACM Mile-High-Video 2024 conference. This conference began on Feb. 11 and will end on Feb. 14. Beamr seeks to improve video format with its AOMedia Video 1 (AV1) offering. The company points out that most videos utilize an extremely outdated 20-year-old format that existed before high-speed internet. “The research presented today will highlight the Beamr-NVIDIA collaboration in facilitating the transition to AV1 adoption at scale,” said the company. “Beamr and NVIDIA will describe an automated process to transfer video libraries and repositories into the emerging format.” Meanwhile, the company will launch its new video cloud service on Feb. 20, which is powered by Nvidia on Amazon’s (NASDAQ:AMZN) Amazon Web Services (AWS). The service seeks to improve the affordability and accessibility of video processing. Beamr will also hold a webinar discussing the launch with CEO Sharon Carmel on the same day. Tracking institutional ownership is important, as these large investors provide liquidity and support for stocks. However, institutional ownership of BMR stock is very low, as these investors own 9.25% of shares while insiders own 64.93%. In fact, Carmel is the largest shareholder with ownership of 28.67% of shares outstanding, equivalent to 3.69 million shares, based on a filing dated April 2023. Institutional ownership as tracked by 13F filings is also very low. Based on third-quarter 13F filings and fourth-quarter 13F filings that have already come in before the deadline of Feb. 14, only five filers own shares of BMR stock. None of these filers own more than 25,000 shares. With that in mind, let’s take a look at Beamr’s top 13F shareholders: On the date of publication, Eddie Pan held a LONG position in NVDA and AMZN. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Eddie Pan specializes in institutional investments and insider activity. He writes for InvestorPlace’s Today’s Market team, which centers on the latest news involving popular stocks. Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/5-investors-betting-big-on-beamr-imaging-bmr-stock/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}