{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.zeebiz.com/markets/global-markets/news-nvidia-fuels-global-stock-records-bond-yields-rise-277689",
    "text": "AI chipmaker Nvidia's stunning results sparked a worldwide wave of record highs in equity markets on Thursday, including the first new peak for Japan's Nikkei since 1989, while bond yields mostly rose as economic data kept immediate hopes of interest rate cuts at bay. The benchmark S&P 500 index (.SPX), and Dow Jones Industrial Average on Wall Street, along with Europe's pan-regional STOXX 600 index and MSCI's all-country world index also hit record highs as Nvidia's (NVDA.O), shares surged 16.4 per cent and lifted artificial intelligence-related chip stocks around the globe. National bourses in Frankfurt (.GDAXI), and Paris (.FCHI), set fresh highs too, while Chinese stocks overnight extended their winning streak to eight straight sessions. After the bell on Wednesday, Nvidia forecast a roughly three-fold jump in first-quarter revenue and beat expectations for fourth-quarter revenue on strong demand for its AI chips. Nvidia added $277 billion in stock market value, the biggest one-day gain in a company's market capitalization in history. Artificial intelligence provides the means to boost productivity that economies have been seeking for two decades, said Thomas Hayes, chairman and managing member of Great Hill Capital LLC in New York. \"What Nvidia represents is the catalyst for the roaring '20s in terms of productivity enhancement moving forward and as productivity increases, it keeps a lid on inflation,\" he said. MSCI's gauge of stocks across the globe (.MIWD00000PUS), rallied 1.67 per cent to set closing and intra-day record highs, while the STOXX 600 index (.STOXX), in Europe closed up 0.82 per cent after hitting an all-time high. The STOXX technology index (.SX8P), is up 12.4 per cent year-to-date and is trading at more than 23-year highs. Dutch chipmaking equipment supplier BESI (BESI.AS), rose 4.9 per cent to a record after exceeding fourth-quarter targets on demand for AI-related parts. On Wall Street, the Dow Jones Industrial Average (.DJI), rose 1.18 per cent, to close above 39,000 for the first time. The S&P 500 (.SPX), advanced 2.11 per cent and the Nasdaq Composite (.IXIC), climbed 2.96 per cent. The S&P 500 and Nasdaq posted their biggest single-day gains since January and February 2023, respectively. The number of Americans filing new claims for unemployment benefits unexpectedly fell last week, indicating job growth likely remains solid in February and will reduce the urgency for the Federal Reserve to start cutting interest rates. The dollar index hit a three-week low and then pared losses as investors awaited new data for insight into when the Fed might begin cutting rates. The dollar index was down 0.038 per cent, with the euro rising 0.05 per cent to $1.0822. The Nikkei has jumped nearly 17 per cent this year, with the S&P 500 and Nasdaq rallying about 7 per cent and 8 per cent, respectively, driven in large part by the expectations for AI. Nvidia is at the center of that boom. Thursday's record-setting charge included Tokyo Electron (8035.T), jumping 6 per cent, chip-testing equipment maker Advantest (6857.T), surging 7.5 per cent and another chip-related share, Screen Holdings (7735.T), opens new tab, rallying more than 10 per cent. \"It has taken the Nikkei roughly 34 years to get to this record high but it is all being driven by strong earnings upgrades,\" said Absolute Strategy's global equities analyst Nick Nelson.\nThere was a big difference from the last time the Nikkei peaked during its bubble, Nelson said. When the Nikkei set the all-time high in 1989, stocks were valued at almost four times what they are now, Nelson said. Euro zone yields drifted to multi-month highs as markets scaled back their bets on European Central Bank rate cuts to less than 100 bps this year after Fed minutes on Wednesday showed policymakers were concerned about moving too early. The latest ECB minutes showed its rate-setters were sticking with patience while new PMI data showed the downturn in euro zone business activity eased in February. The two-year US Treasury yield, which typically moves in step with interest rate expectations, was up 5.9 basis points at 4.712 per cent. The yield on 10-year Treasury notes was down 0.2 basis points to 4.321 per cent as longer-duration bonds were flat.\\ While the bulk of Fed policymakers said they were concerned about the risks of cutting too soon, according to its meeting minutes, there was still broad uncertainty about how long borrowing costs should remain at their current lofty level. That reinforced the view among traders that any rate cut is not imminent, with market pricing suggesting one-in-three odds for a first reduction in May, according to CME Group's FedWatch Tool. Oil prices steadied as a big rise in US crude inventories offset the supportive impact of another attack on shipping near Yemen. US crude rose 70 cents to settle at $78.61 a barrel, and Brent settled up 64 cents at $83.6 a barrel. Gold prices fell from a near two-week high after jobless claims data indicated a strong US economy, while investors awaited further economic data for guidance on the Fed's interest rate stance. US gold futures settled 0.2 per cent lower to $2030.70 an ounce. LATEST NEWS "
}