{
    "title": "Apple Vs. Nvidia: Only One Added $1 Trillion In 67 Days As Battle For \nMega-Cap Dominance Continues - NVID",
    "date": "3/7/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/03/37544925/apple-vs-nvidia-only-one-added-1-trillion-in-67-days-as-battle-for-mega-cap-dominan",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW We’ve written a lot over the past months — as has every financial media organization — about the meteoric rise of Nvidia Corporation NVDA, the artificial intelligence (AI)-linked semiconductor stock. We’ve asked a lot of questions: Is it overvalued after a 1,634% rise over the past four years? Can the promise of AI deliver the earnings growth expected of the company? Is its position among the mega-cap stocks truly deserved? The first two questions above will only be answered in hindsight, and the third can only be tackled by comparing Nvidia with a similar-sized company. Apple Inc. AAPL for instance. Apple has the larger market cap — $2.61 trillion. Nvidia is not far behind, sitting on a valuation of $2.29 trillion. Also Read: Nvidia Overtakes Tesla As The Most Popular Stock Among Retail Investors: ‘…There’s A New Sheriff In Retail Town’ Apple’s growth has been far more steady. When it launched the iPhone in 2007, its market cap was around $62 billion. A decade later it was $556 billion. Nvidia, by comparison, stayed flat throughout this period with a market cap just above $2 billion The following data were compiled by Charlie Bilello, chief market strategist at Creative Planning, which he posted on X on Thursday. Here are Bilello’s findings: Take a look at Bilello’s chart here: The chart shows in stark detail — something that percentage moves don’t often convey in words — just how much growth Nvidia’s valuation has gained in just the two months or so of 2024. At the close on Dec. 29, 2023, Nvidia’s market cap was $1.22 trillion. The means now, at $2.29 trillion, it’s added nearly $1.1 trillion in just 67 days. Apple took four years to add its most recent trillion. Isn’t this bubble territory? Analysts don’t think so. Many believe Nvidia warrants this valuation because of its earnings creation and its earnings potential. Two days ago, investor and financial TV host featured the stock on his CNBC program saying that given the company’s ability to consistently beat market earnings expectations, its valuation was not excessive. Meanwhile, it’s become a favored stock of retail investors according to a recent note from Vanda Research with purchases exceeding $1 billion over a 10-day period, compared to just $500 million of Tesla Inc. TSLA shares. \"Trading is about mood and momentum, and when you think mood and momentum, I don't think I have ever seen a company celebrated as much as Nvidia,\" said Aswath Damodaran, professor of finance at Stern School of Business, New York University, in an interview on CNBC last week. Damodaran did, however, caution that the pricing may have got a little out of control. We will know with hindsight. Now Read: Wall Street’s ‘Dean Of Valuation’ Thinks ‘You’re Setting Yourself Up To Lose’ With Nvidia © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}