{
    "title": "What To Expect From High-Flyer Nvidia's Upcoming GTC 2024 - NVIDIA \n(NASDAQ:NVDA)",
    "date": "3/17/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/03/37768632/after-nvidias-record-10-week-winning-run-analyst-says-investors-will-pay-attention-",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Nvidia Corp. NVDA stock is looking unstoppable and has closed higher for a record ten straight weeks. The stock could receive a further boost this week as the company holds its GPU Technology Conference (GTC) 2024, with CEO Jensen Huang delivering the keynote between 4 p.m. EDT and 6 p.m. EDT on Monday. The GTC 2024 will be a hybrid event, with in-person and virtual options for attendees. The keynote will be delivered at the SAP Center, near the San Jose McEnery Convention Center, in San Jose, California. Hyped-Up Expectations: Nvidia has promoted the keynote as the stage where Huang will “explore the AI advances that are shaping our future.” Stifel analyst Ruben Roy said in a CNBC interview on Friday that he expects a lot of discussion around a product roadmap. Nvidia has increased the cadence at which they are bringing new products to market, he added. “I think there’s going to be a discussion around the consistence that is building around their AI offerings.  So, it’s just not about hardware right. We are not considering Nvidia as a chip company anymore — systems company, software company, it’s a networking company,” the analyst said. “I think, there is going to be a lot of discussion, again around the concept of the Nvidia AI ecosystem that Nvidia has been busy building and we’re looking forward to the roadmap ahead,” Roy said. See Also: How To Buy Nvidia (NVDA) Stock Valuation Dilemma: When probed whether the upward trajectory in the stock would continue, Roy said it would be all about the ecosystem. He noted an increase in revenues and margins, attributing it to the significant incorporation of software into Nvidia’s system sales. “They are establishing cloud services, they are establishing concepts like AI factories, which include hardware and software,” he said. Buy side investors, mainly professional investors, will be listening closely to what’s next for the ecosystem and how Nvidia plans to participate in a very rapidly growing total addressable market (TAM), the analyst said. Compute, he said, has been characterized as a trillion-dollar TAM opportunity by Nvidia. “General-purpose compute, which historically has been serviced by standard general-purpose processors, now [are] moving to their GPUs and other forms of accelerated compute,” he added. Nvidia shares rose 0.35% last week compared to the 0.7% retreat by the tech-heavy Nasdaq Composite Index and a 0.1% edge down by the broader S&P 500 Index. The stock has gained 72.80% for the year-to-date period. It is the second-best performing S&P 500 stock after Super Micro Computer this year and the best-performing Nasdaq 100 stock. It ended Friday’s session down 0.12% at $878.36, according to Benzinga Pro data. Read Next: Forget Gold And Bonds: Are These 2 AI Stocks The New Safe Havens In A Volatile Market? Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}