{
    "title": "The 4 key trends in AI chip development (1)",
    "date": "3/11/2024",
    "url": "https://m.theinvestor.co.kr/view.php?ud=20240311050699",
    "text": "  The 4 key trends in AI chip development (1) PUBLISHED : March 11, 2024 - 16:08 UPDATED : March 12, 2024 - 14:48 The humanoid robot unveiled byUS startup Figure AI (Herald Business)Jo Weon-kyoung, professor and director of UNIST University-Indusry Relations Center, recently authored an article for the Herald Business, a vernacular business daily, which was subsequently picked up and published by The Investor after an unofficial translation. This is the first of the two-part story. –Ed.Nvidia's dominance in the artificial intelligence (AI) market is undisputed. The company has experienced a remarkable evolution from its origins as a provider of graphics processing units (GPUs) for gaming to becoming a global leader in supplying GPUs for the data centers of major tech firms.Hosting the GPU Technology Conference (GTC) in 2024 from March 18-21 at the San Jose Convention Centre in the US, Nvidia's market leadership faces various challenges. These include potential US government restrictions on semiconductor chip exports to China, competition from AMD and Intel, and the emerging presence of Chinese chip makers. Moreover, Nvidia's heavy reliance on chips manufactured by Taiwanese foundry TSMC raises concerns.In response, the Biden administration is advocating for increased investment in domestic semiconductor production through the Chips Act. It will likely be a decade before US-based foundries like Intel are fully operational.Despite these challenges, Nvidia, holding a dominant share of over 80 percent in the global AI chip market with products like H100 and A100, reported impressive earnings in the fourth quarter of last year, with revenue reaching $22.1 billion and operating income hitting $13.6 billion, establishing it as the third-largest US market capitalization company.One of the recent conversations in the tech industry revolves around the status and future trends of AI chips. Here are four key topics that exemplify the current landscape and potential directions in AI chip development, with a particular focus on Nvidia's role in shaping this market.(1) Green chip leadership - Transitioning from general purpose AI chips to customized AI chipsThe quality of AI services is intricately linked to the efficiency of data computation processing. AI chips play a pivotal role in determining the performance of computational processing. Typically, AI chips encompass AI accelerators that can be categorized as follows.AI chips find applications in diverse fields such as natural language processing, robotics, computer vision, and network security. Although GPUs are prevalent as AI chips, they tend to be power-intensive and generate significant heat. To address these challenges, technologies like FPGA (Field Programmable Gate Array) and ASIC (Application Specific Integrated Circuit) are gaining prominence for their ability to offer high computational performance with low power consumption.According to Statista's forecast on the AI chip market, the global AI chip market is projected to reach $53.5 billion by 2023. This figure is anticipated to surge to $120 billion by 2027 as AI technologies become more pervasive in daily life.In recent developments, Nvidia's dominance in GPUs for AI has solidified, prompting a shift towards proprietary chip development. Nvidia has strategically pivoted its focus toward the burgeoning $30 billion custom AI chip market. The company is establishing a new division dedicated to designing tailored chips for cloud computing firms, including cutting-edge AI processors.Engagements are underway with tech giants such as Amazon, Meta, Microsoft, Alphabet, and OpenAI to co-create custom chips. These entities currently rely on Nvidia's H100 and A100 chips for general-purpose AI processing, albeit constrained by high costs and power demands.Nvidia's strategic realignment aims to propel growth by delving into the realm of custom AI chip design for data centers, a sector currently served by companies like Broadcom and Marvell Technology. In addition to data center applications, Nvidia intends to extend support for custom AI chips in 5G wireless communications, automotive sectors, video gaming, and other domains. Such market demands underscore the evolving landscape within the AI chip industry.  According to data from investment bank Needham, the global market for personalized AI will be worth around $30 billion in 2023. That's about 5 percent of annual global chip sales. Of this, the data center custom AI chip market is expected to grow up to $10 billion this year and double by 2025. Low-power custom AI chips will continue to be a hot topic in the future. (To be continued)By Jo Weon-Kyoung (ableman@unist.ac.kr)Professor and Director of UNIST Global University-Industry Relations Center  The humanoid robot unveiled byUS startup Figure AI (Herald Business) Jo Weon-kyoung, professor and director of UNIST University-Indusry Relations Center, recently authored an article for the Herald Business, a vernacular business daily, which was subsequently picked up and published by The Investor after an unofficial translation. This is the first of the two-part story. –Ed.Nvidia's dominance in the artificial intelligence (AI) market is undisputed. The company has experienced a remarkable evolution from its origins as a provider of graphics processing units (GPUs) for gaming to becoming a global leader in supplying GPUs for the data centers of major tech firms.Hosting the GPU Technology Conference (GTC) in 2024 from March 18-21 at the San Jose Convention Centre in the US, Nvidia's market leadership faces various challenges. These include potential US government restrictions on semiconductor chip exports to China, competition from AMD and Intel, and the emerging presence of Chinese chip makers. Moreover, Nvidia's heavy reliance on chips manufactured by Taiwanese foundry TSMC raises concerns.In response, the Biden administration is advocating for increased investment in domestic semiconductor production through the Chips Act. It will likely be a decade before US-based foundries like Intel are fully operational.Despite these challenges, Nvidia, holding a dominant share of over 80 percent in the global AI chip market with products like H100 and A100, reported impressive earnings in the fourth quarter of last year, with revenue reaching $22.1 billion and operating income hitting $13.6 billion, establishing it as the third-largest US market capitalization company.One of the recent conversations in the tech industry revolves around the status and future trends of AI chips. Here are four key topics that exemplify the current landscape and potential directions in AI chip development, with a particular focus on Nvidia's role in shaping this market.(1) Green chip leadership - Transitioning from general purpose AI chips to customized AI chipsThe quality of AI services is intricately linked to the efficiency of data computation processing. AI chips play a pivotal role in determining the performance of computational processing. Typically, AI chips encompass AI accelerators that can be categorized as follows.AI chips find applications in diverse fields such as natural language processing, robotics, computer vision, and network security. Although GPUs are prevalent as AI chips, they tend to be power-intensive and generate significant heat. To address these challenges, technologies like FPGA (Field Programmable Gate Array) and ASIC (Application Specific Integrated Circuit) are gaining prominence for their ability to offer high computational performance with low power consumption.According to Statista's forecast on the AI chip market, the global AI chip market is projected to reach $53.5 billion by 2023. This figure is anticipated to surge to $120 billion by 2027 as AI technologies become more pervasive in daily life.In recent developments, Nvidia's dominance in GPUs for AI has solidified, prompting a shift towards proprietary chip development. Nvidia has strategically pivoted its focus toward the burgeoning $30 billion custom AI chip market. The company is establishing a new division dedicated to designing tailored chips for cloud computing firms, including cutting-edge AI processors.Engagements are underway with tech giants such as Amazon, Meta, Microsoft, Alphabet, and OpenAI to co-create custom chips. These entities currently rely on Nvidia's H100 and A100 chips for general-purpose AI processing, albeit constrained by high costs and power demands.Nvidia's strategic realignment aims to propel growth by delving into the realm of custom AI chip design for data centers, a sector currently served by companies like Broadcom and Marvell Technology. In addition to data center applications, Nvidia intends to extend support for custom AI chips in 5G wireless communications, automotive sectors, video gaming, and other domains. Such market demands underscore the evolving landscape within the AI chip industry.  According to data from investment bank Needham, the global market for personalized AI will be worth around $30 billion in 2023. That's about 5 percent of annual global chip sales. Of this, the data center custom AI chip market is expected to grow up to $10 billion this year and double by 2025. Low-power custom AI chips will continue to be a hot topic in the future. (To be continued)By Jo Weon-Kyoung (ableman@unist.ac.kr)Professor and Director of UNIST Global University-Industry Relations Center "
}