{
    "title": "3 AI Stocks That Could Give Nvidia a Run in 2024",
    "date": "3/5/2024",
    "url": "https://finance.yahoo.com/news/3-ai-stocks-could-nvidia-210733354.html",
    "text": "The generative artificial intelligence (AI) trade can’t seem to slow down. Nvidia (NASDAQ:NVDA) continues to do most of the heavy lifting for the semiconductor industry and the broader tech sector. Undoubtedly, the days of the Magnificent Seven may be coming to an end as the performance of its constituents begins to vary by a widening margin. In any case, I think there’s no doubt that Nvidia was the most magnificent of the batch. And it may very well continue its magnificent run until it’s left in a league of its own. Who knows? By year’s end, we may be left with the Magnificent One (NVDA stock) as all that remains of Jim Cramer’s famed Magnificent Seven. In this piece, we’ll concentrate on some of the less-loved AI stocks that could outpace Nvidia stock in the latter 10 months of 2024. Undoubtedly, the following AI stocks to buy are moving into year’s end with a lower bar and perhaps a greater means to surprise to the upside in coming quarters. InvestorPlace - Stock Market News, Stock Advice & Trading Tips Source: Sundry Photography / Shutterstock Snowflake (NYSE:SNOW) stock suffered quite the meltdown following the release of its latest quarterly results and a rough sales outlook. Though the numbers weren’t abysmal, investors had some pretty high hopes that the firm could not meet. Additionally, the sudden CEO change was not on the radar of such hopeful investors. As you may know, few things rattle investors quite like uncertainty and surprises. With Frank Slootman out and Sridhar Ramaswamy — an AI technologist who’s been at Snowflake for less than a year — in, questions linger as to where the company heads from here and if it’s still the growth juggernaut it once was. Indeed, leadership changes bring forth a haze of uncertainty. And perhaps the most significant source of investor disappointment was Slootman stepping away from the post. Recent volatility suggests some investors aren’t willing to stay aboard the Snowflake ship with a new captain. After shedding nearly 5% on Monday, adding to the recent ~20% post-quarter flop, Snowflake seems to have some freshly lowered expectations baked in. If Ramaswamy can prove he’s the right person for the job (his extensive AI background is a huge overlooked plus), perhaps SNOW could be able to outrun NVDA stock from here. Source: Sundry Photography / Shutterstock.com Salesforce (NYSE:CRM) is another software company that could give Nvidia a run for its money as it looks to double down on generative AI. CEO Marc Benioff has been incredibly vocal about AI’s potential and the firm’s role in the so-called fourth industrial revolution for many years. Despite reporting lukewarm quarterly earnings alongside softer sales guidance (9% growth on the high-end), the stock proceeded to march higher in the following sessions. Over the past week, shares are up around 5%, helping CRM stock break to new highs past $308. With the announcement of its first-ever dividend, it seems like Salesforce is a cloud king experiencing a coming of age. Sure, the best growth days may be over. But with a new dividend and the means to increase margins, Salesforce may very well be a blue chip that could continue to surprise us all. Either way, I view the outlook as too conservative. And with that, I expect rising over the bar won’t be nearly as difficult as it would be for the likes of Nvidia. Source: Casimiro PT / Shutterstock.com Autodesk (NASDAQ:ADSK) has been sailing through some turbulent tides in the architecture, engineering and construction scene of late. With major advancements in the field of generative AI, it seems like AutoDesk will need to harness the power of AI or run the risk of being disrupted. Thus far, it looks like AI is going to be a tailwind for the firm as it gives its computer-aided design tools a shot in the arm. Though the company’s fourth-quarter numbers (revenue rose 9%) were encouraging, I believe generative AI innovations could be key to a potential year-end breakout for ADSK stock. Autodesk’s AI design tools can save users money while making them more productive. In short, such tools represent a catalyst that can help the firm navigate through what remains of macro headwinds. At 33.3 times forward price-to-earnings, ADSK stock is a low price for what I consider to be one of the market’s generative AI underdogs. On the date of publication, Joey Frenette owned shares of Salesforce and Snowflake. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joey Frenette is a seasoned investment writer specializing in technology and consumer stocks. Contributing to the Motley Fool Canada, TipRanks, and Barchart, Joey excels in spotting mispriced stocks with long-term growth potential in a fast-paced market. The #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now. The post 3 AI Stocks That Could Give Nvidia a Run in 2024 appeared first on InvestorPlace. Related Quotes "
}