{
    "title": "Nvidia stock rally will fade, Ark Invest's Cathie Woods says",
    "date": "3/8/2024",
    "url": "https://qz.com/nvidia-stock-price-rally-faltering-cathie-woods-1851320536",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters What goes up must come down, right? One investor who famously sidestepped the skyrocketing ascent of Nvidia’s stock price is warning others in the market that they should try to sidestep a potential decline in the AI chipmaker’s stock price. In a market commentary Thursday, Ark Invest founder Cathie Wood suggests that the rest of the computer chip industry is catching up with Nvidia, which has been the artificial intelligence sector’s go-to supplier for the intense computing needed for image generators and chatbots and everything else that’s threatening to take your job. Nvidia stock was down about 5% in Friday afternoon trading. Ark Invest, known for its tech-focused exchange-traded funds, got out of Nvidia in January 2023, a couple months after the company had lost more than half of its then-peak value. But it also came a couple months after the launch of ChatGPT. Since Ark’s exit, Nvidia shares are up well over 300%. Woods’s words come as several Nvidia insiders are taking the opportunity to cash out, to the tune of millions of dollars. “The launch of ChatGPT in November of 2022 has fueled several quarters of unprecedented growth for Nvidia as cloud service providers, other consumer internet companies, and well-funded startups have scrambled — likely double- and triple-ordering GPUs in the process — to acquire Nvidia’s hardware and train AI models,” she writes. But wait times for those chips are coming down as Nvidia massively expands to keep up with demand. And the industry is looking elsewhere: OpenAI founder Sam Altman is looking to raise trillions of dollars for a computer chip project. Microsoft is making its own chips. So are Google and Amazon and Meta. Wood, who made her reputation jumping into the likes of Tesla and bitcoin early, says the EV-maker is also working on its own chips. If all those competitors start to lighten Nvidia’s load, it could spell trouble. “Without an explosion in software revenue to justify the overbuilding of GPU capacity, we would not be surprised to see a pause in spending, compounding a correction in excess inventories,” Wood writes. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}