{
    "title": null,
    "date": "3/28/2024",
    "url": "https://www.marketwatch.com/amp/data-news/nvidia-corp-stock-rises-thursday-outperforms-market-e294fb62-71ee04ac9598",
    "text": "Shares of NVIDIA Corp. NVDA inched 0.12% higher to $903.56 Thursday, on what proved to be an all-around positive trading session for the stock market, with the S&P 500 Index SPX rising 0.11% to 5,254.35 and the Dow Jones Industrial Average DJIA rising 0.12% to 39,807.37. The stock's rise snapped a two-day losing streak. NVIDIA Corp. closed... Shares of NVIDIA Corp.\n        \nNVDA\n\n        \n      inched 0.12% higher to $903.56 Thursday, on what proved to be an all-around positive trading session for the stock market, with the S&P 500 Index\n        \nSPX\n\n        \n      rising 0.11% to 5,254.35 and the Dow Jones Industrial Average\n        \nDJIA\n\n        \n      rising 0.12% to 39,807.37. The stock's rise snapped a two-day losing streak. NVIDIA Corp. closed $70.44 below its 52-week high ($974.00), which the company achieved on March 8th. Trading volume (43.0 M) remained 12.4 million below its 50-day average volume of 55.4 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. See original version of this story Trading in General Electric’s power-generation spinoff began this week. The spinoff itself takes place on April 2. So far, trading has hewed pretty close to Wall Street estimates. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Thanks for reading Continue Reading Your Article With a MarketWatch Membership  You are approaching your article limit.Get unlimited access Copyright © MarketWatch, Inc. All rights reserved. By using this site you agree to the\nSubscriber Agreement & Terms of Use,\n    Privacy Notice and\n    Cookie Notice\n\n      (Manage Cookies)\n    \n    . "
}