{
    "title": "AI Revolution and NVDA: Why Tough Going May Be Ahead",
    "date": "3/26/2024",
    "url": "https://www.elliottwave.com/articles/ai-revolution-and-nvda-why-tough-going-may-be-ahead/",
    "text": "The topic with all the buzz these days is Artificial Intelligence (AI) and its future. The potential benefits include automating repetitive tasks, enhancing productivity, data analysis, assisting in medical applications – and more. Then there’s the possible downside. Some of the major worries include the elimination of jobs, privacy violations, unclear legal regulations and the potential for AIs to go rogue as the goals of AI become misaligned with the goals of humans. In an interview with NPR in 2023, computer scientist Geoffrey Hinton, who is known as the godfather of AI, said: These things could get more intelligent than us and could decide to take over, and we need to worry now about how we prevent that happening. However, right now, the mood surrounding AI is way more optimistic than pessimistic. Just think about how investors have bid up the price of AI-related stock Nvidia Corp., which has a market capitalization of around $2 trillion. That’s more than the GDP of Australia or South Korea. Indeed, if Nvidia was a country, it would rank just outside the top ten largest economies on Earth. Yet – a word of caution: Trends generally don’t go up or down in straight lines without significant interruptions. Indeed, our March Global Rates & Money Flows shows this chart of an AI exchange-traded fund and says: BOTZ, the ticker for the Global X Robotics & Artificial Intelligence ETF, sports a clear five-wave decline from 2021 to 2022. Since then, a corrective rally appears to be in operation with wave C advancing now. … [The] evidence suggests that the AI revolution may be off to a false start. But what about the price pattern of Nvidia? – you may ask. Know that our Senior Global Strategist, Murray Gunn, also provides analysis of Nvidia in the March Global Rates & Money Flows. Murray takes you back to the 2008 low in Nvidia and provides his assessment of the stock – now. You can access Global Rates & Money Flows by following the link below. The financial trends of even new and exciting technologies can sometimes go into prolonged reversals. Yes, even going back to when the steam engine and railroads were new. Today, the new technology is Artificial Intelligence. Here’s our take from a financial point of view. Global Rates & Money Flows is one of Elliott Wave International’s newest services: Already it’s a “must” read for global fixed income investors. Yet, this unique service also analyzes stocks, currencies (including digital currencies), central bank machinations, macro-economic issues and much more. GR&MF is the work of Senior Global Strategist Murray Gunn, a 30-plus year veteran of global bond and money markets, notably with Standard Life, the Abu Dhabi Investment Authority and HSBC. Get financial insights that you will not find anywhere else via the link below. Books Videos & DVDs On-Demand Courses Live Classes & Events Certifications Pro Services EWAVES Flash Trader’s Classroom Crypto Junctures Financial Forecast Service Asian-Pacific Financial Forecast Service European Financial Forecast Service Global Financial Forecast Service Copyright © 2024 Elliott Wave International. All rights reserved. About Us  •  Privacy Policy   •  Terms of Service  •  Contact Us Socionomics Institute  •  Robert Prechter  •  New Classics Library "
}