{
    "title": "If You Like Nvidia, Then You Will Love These 2 Hot AI Stocks",
    "date": "3/29/2024",
    "url": "https://www.fool.ca/2024/03/29/if-you-like-nvidia-then-you-will-love-these-2-hot-ai-stocks/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Hot AI stocks like Open Text Corp (TSX:OTEX) have been rallying lately. Image source: Getty Images Hot AI stocks are all anybody can seem to talk about these days. Between NVIDIA’s stock market rally and the massive amount of hype generated by ChatGPT, there have been plenty of catalysts driving AI stocks higher. For many investors, this is an intriguing opportunity. Hot artificial intelligence (AI) stocks are capitalizing on a real technology trend; they are not just unprofitable “hype stocks” like those that came to prominence in the 2021 tech bubble. Surely, they are worth buying. Maybe so, but some of them are unquestionably getting expensive. NVDIA trades at more than 74 times earnings, and Microsoft is approaching 40. These stocks aren’t cheap. Fortunately, there are other AI stocks out there that are cheap, or at least not “outrageously” expensive. In this article, I will explore two such stocks — one of them being a homegrown Canadian AI company. Open Text (TSX:OTEX) is a Canadian tech company that is making big strides in AI. It offers a number of cloud-based solutions that help people manage content and information. The most “AI-heavy” of these is AI Cloud, a product suite that helps companies organize, glean insights from, and interpret their data. AI Cloud delivers text analysis, provides predictive insights, and protects customers’ security. AI Cloud is a suite of products, not a single one. Examples of products included in it include Vertica, an SQL database; IDOL, which finds insights in complex media (including video); and Magellan, which finds intelligible insights in unstructured data. Open Text seems to be doing well with its suite of AI-powered products. In its most recent quarter, it delivered the following: It was a pretty good showing. For the longest time, OTEX was not really growing much, but the addition of AI to its marketing and product strategy seems to have paid off. In the meantime, the stock is still pretty cheap, trading at 10 times earnings. Taiwan Semiconductor Manufacturing (NYSE:TSM), sometimes known as TSMC, is a Taiwanese semiconductor company best known for supplying chips to its fellow semiconductor companies, as well as America’s big tech giants. Of all the hot AI stocks that people are talking about, this is one of the cheapest. Trading at 27 times earnings, it is far cheaper than any of the big tech companies that it supplies chips to. One of the reasons why TSM is comparatively cheap is because of where it’s located. Taiwan is something of a geopolitical hot spot at the moment, being at the centre of a dispute between the U.S. and China. Taiwan sees itself as semi-independent; China disagrees, viewing it as part of its own territory. The U.S. backs Taiwan in this dispute, in large part because TSMC is so vital to the U.S.’s own tech industry. Many people think that China will invade Taiwan because it hopes to achieve “national reunification.” It is a risk, but TSMC is so vital to China itself that it would probably think twice about invading — a reality that some have called Taiwan’s “silicon shield.” This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 29, 2024 | Puja Tayal Have you given a thought to how you plan to retire? Your decision depends significantly on how much your investments… Read more » March 29, 2024 | Andrew Button AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. Read more » March 29, 2024 | Amy Legate-Wolfe Hut stock (TSX:HUT) surged by 23% after the company reported strong earnings, and even more growth occurred in 2024. Read more » March 28, 2024 | Puja Tayal Nvidia stock has made investors millionaires in the last 10 years. Is it too late to invest to become a… Read more » March 28, 2024 | Chris MacDonald There are plenty of growth stocks in the market worth considering, but Shopify (TSX:SHOP) looks like one of the best… Read more » March 28, 2024 | Puja Tayal The TSX has been favouring tech stocks, but not this one. However, it has the potential to trounce the market… Read more » March 27, 2024 | Rajiv Nanjapla These three under-$20 stocks offer excellent buying opportunities for long-term investors. Read more » March 27, 2024 | Adam Othman Investors looking to invest in companies doing big things in AI should consider these three stocks for their portfolios. Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}