{
    "title": "Nvidia tops Aramco for third-most valuable company on Earth",
    "date": "3/4/2024",
    "url": "https://qz.com/nvidia-aramco-chips-ai-saudi-arabia-oil-1851304742",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Nvidia once again surpassed a $2 trillion market cap and closed at $2.06 trillion Friday, marking the first time it closed above the threshold, and pushing it past Saudi Arabia’s Aramco to be the world’s third most valuable company. The chipmaker became the first in its industry to reach a $2 trillion valuation in February, thanks to earnings that beating analysts’ expectations and a booming AI industry. Nvidia previously beat out Amazon and Google parent Alphabet to become the third most valuable company in the U.S. by market cap. Meanwhile, Aramco has seen its shares drop 5% this year due to lower oil production from OPEC+ cuts, and a possible follow-on offering from the government this month, according to Bloomberg. The chipmaker saw its stock fall before it reported earnings for its fourth quarter, as investors responded to rumors that its earnings would fall short. But stock prices rebounded in a big way after Nvidia reported revenues of $22 billion — a whopping 270% increase from the year before. “Accelerated computing and generative AI have hit the tipping point,” Nvidia founder and CEO Jensen Huang said in a statement. “Demand is surging worldwide across companies, industries and nations.” Analysts had reportedly been worried about Nvidia’s revenue due to some of its largest customers, including Microsoft and Meta, developing their own AI chips. Nvidia counts both companies as the largest customers of its $30,000 H100 chip which powers the companies’ AI models. Microsoft and Meta spent $9 billion on the chips last year. Other big spenders include Alphabet, Amazon, and Oracle. But Nvidia’s performance still has skeptics concerned about how long it can hold its dominance, and what it all could mean for the tech bubble. “Another blockbuster quarter from Nvidia raises the question of how long its soaring performance will last,” Jacob Bourne, a senior analyst for Insider Intelligence, wrote in a note after earnings. “Nvidia’s near-term market strength is durable, though not invincible.” Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}