{
    "title": "Nvidia: Weighing The AI Growth Upside Vs. Looming Risks (NASDAQ:NVDA)",
    "date": "1/5/2024",
    "url": "https://seekingalpha.com/article/4661324-nvidia-weighing-the-ai-growth-upside-vs-looming-risks",
    "text": "Guillaume/iStock via Getty Images  Guillaume/iStock via Getty Images Nvidia Corporation (NASDAQ:NVDA) is riding the AI wave with extraordinary growth in its Data Center segment, but risks loom. Nvidia is a fabless semiconductor and software firm best known for its GPUs (graphic processing units). In its early days as a public company, it was largely a provider of chips to the gaming industry, giving the industry’s high demands for graphics performance. Following its introduction of its CUDA parallel computing software layer in 2007, its GPUs began to open up to other applications that needed a large amount of processing power. Today, the Data Center segment is its largest end market, accounting for about 56% of its FY23 revenue. Gaming was number #2 at about 33% of its FY23 revenue, followed by Professional Visualization at 6% and Automotive at 3%. In FY24, though, Data Center is up to about 75% of its business given its explosive growth, while Gaming is about 19%. NVDA also designs CPUs (central processing units) and DPUs (data processing units). Through its 2019 acquisition of Mellanox, the company also offers other computer networking products, such as Ethernet and InfiniBand switches and adapters. Growth for NVDA’s data center business has been explosive. Revenue for the segment grew 279% in Q3, while its Q4 guidance implies growth of 400% for its January quarter. This is remarkable on several levels. The first is that this growth is coming off of very large numbers. Revenue in Q3 for the Data Center segment was $14.5 billion, so it’s not coming off a small base. Second, this isn’t a business where a subscription is just turned on. NVDA is managing a complex supply chain that needs to see its chips get manufactured. This means obtaining the components needed for its chips, as well as getting the fab capacity to meet surging demand. Given the large numbers the company is working with, this is impressive to say the least. NVDA Data Center Growth (Company Presentation ) NVDA Data Center Growth (Company Presentation ) Going forward, NVDA is the go-to company for chips to power generative AI applications in the data center. The opportunity is massive with no signs of growth slowing, and NVDA has proven to be the dominant leader in GPUs that can power this data center evolution. Discussing generative AI at the Arete conference last month, VP of Accelerated Computing Ian Buck said: “I don't think there's ever been, at least in recent history, a technology introduction that -- unlike maybe PC to phone where you change the modality -- you create a whole new ecosystem, a new opportunity, a new way of working. That's clearly happening with gen AI. New services, new kinds of experiences, new consumer products, new business opportunities, but you're also making the old stuff way more interesting. Word just got sexy again. I always liked PowerPoint, but we're working in from both angles. So seeing how that commercialization of AI has happened to really make it a useful tool for literally everyone. … I mean it found us, we didn't find it. … This year, there's been a couple of great advances as a result. NVIDIA now really, we've talked about being a data center-scale company where data center is being the new unit of compute. And these language models and generative AI is a data center-scale problem. It really has brought all of our different technologies together, whether it be GPUs, DPUs, CPUs, to provide that infrastructure and in addition, all of the software that goes on to that. And NVIDIA as a company has more software engineers and hardware engineers because of the opportunity and capability and what we deliver. So certainly, LLM, generative AI ramps. From NVIDIA product perspective, I've been extremely thrilled about the progress that we've made on Grace and Grace Hopper. .. You've seen the opportunity that it can provide as a single-node inferencing platform. You've seen what it can do for our supercomputing and HPC business, which is often a leading indicator where we're going. We were obviously doing GPUs at scale for myself 20 years now. And we're now next year slated to deploy on the order of 200 exaflops of AI across supercomputing, all Grace Hopper.” Not to be outdone by its strength in GPUs, the company’s networking portfolio, which is largely from its Mellanox acquisition, has crossed a $10 billion revenue run rate, while growing about 200%. Mellanox was acquired in 2019 for $6.9 billion, so this deal has proven to be a good one. So while NVDA’s GPUs have become the gold standard in the data center for AI applications, so have its networking products. And from the quote above, the company also appears to be gaining momentum with its Grace Hopper CPU superchip, as well. While Gaming isn’t quite as important as it was is in the past, it still also has been growing quite substantially. The company has benefited from a shift to notebook gaming, and as AI makes its way into games, NVDA is only set to benefit from this as well. Further out, the company could have opportunities in such areas as autonomous vehicles, robotics, servers (through its DGX line), enterprise, and industrial applications. The world and technology is changing quickly with AI, and wherever AI heads, it looks like NVDA will follow and benefit. Company Presentation Company Presentation Now NVDA is certainly not without risks. The biggest would be if there is over-ordering. Right now, there is a rush to order its GPUs and networking products to help power generative AI in the data center. However, sometimes urgency leads to over-ordering by customers to meet needs well into the future. Given long lead times, I wouldn’t be surprised if customers were booking orders for projects well in advance of current and short-term needs. If this were to be the case and eventually leads to lower future demand at some point, it could be a pretty big blow to NVDA’s stock. China is a risk as well. In October, the U.S. Department of Commerce announced that it would enact new export restrictions on the sale of advanced AI chips to China and other countries. The U.S. already banned NVDA’s H100 chip, and the new ban was set to also ban its slower A800 and H800 chips. In all, NVDA said the ban will impact its A100, A800, H100, H800, L40, L40S, and RTX 4090 chips, as well as its DGX and HGX systems with those chips. China had been about 20-25% of NVDA’s data center business in recent quarters. The company said sales to China would decline significantly in Q4, but be made up in other geographies. The company is also working on a compliant chip for the country. However, there is also the risk that this leads to more Chinese competition in the space, particularly from a company like Huawei, which has developed GPUs. However, Chinese GPU tech is considered behind NVDA, and the infrastructure to mass produce chips also isn’t there, as the company is banned from using fabs from Taiwan Semiconductor Manufacturing (TSM), which used to manufacture the chips for Huawei. Instead, it would need to rely on the older fabs of Chinese domestic foundry Semiconductor Manufacturing International Corporation (\"SMIC\"). Competition from rivals Advanced Micro Devices (AMD) and Intel (INTC) is another risk. INTC has announced its Gaudi3 chip to compete with NVDA’s H100 flagship chip, and also some new CPUs and NPUs aimed at AI tasks. AMD, meanwhile, has launched its MI300X chip, which it says is “the most advanced AI accelerator in the industry.” It also has said it has improved its ROCm software suite. AMD’s software is often cited as a reason why developers have favored NVDA. Meta Platforms (META), Microsoft (MSFT), and OpenAI have already come out and said they will use the AMD chip as an alternative to NVDA’s chips. I view AMD as the bigger threat, and if the chip proves to be a good alternative, it could take away sales from NVDA and/or also put pressure on prices. NVDA’s H100 chip costs around $40,000, so they are not cheap by any stretch. AMD will have to prove that its chips and software can be just as effective and less expensive, but large companies often like a second source and to not rely on a sole supplier. The announcements by the like of Meta and MSFT demonstrate this. NVDA currently trades at an EV/EBITDA multiple of 24x the FY25 (ending January) consensus of $49.03 billion. Based on FY26 EBITDA projections of $59.16 billion, it trades at a 19.9x multiple. On a P/E basis, the company trades at 24x the FY25 consensus of $19.88 and 20x the FY26 consensus of $24.02. Revenue is projected to grow over 54% in fiscal year 2025 and nearly 20% in FY2026. NVDA trades at a premium to other semiconductor stocks outside of AMD, although it has superior growth. NVDA Valuation Vs Peers (FinBox) NVDA Valuation Vs Peers (FinBox) Given its robust revenue growth, I’d value NVDA between 20-30x FY26 EBITDA. This assumes no sudden change to its current outlook. That would value the company at between $475-$715. The midpoint would be $595. Nvidia Corporation has been one of the best performing stocks over the past decade, and for good reason. The company has a dominant position in GPU chips, which are now becoming ever more important is a world where AI applications and processing power are dominant themes. Its growth the past year has been outstanding off of already large numbers, and its execution extraordinary. Given its growth outlook, the stock is not expensive. In fact, I would argue it looks quite reasonable, especially given the company’s penchant for topping estimates. That said, despite its decade of dominance, the company hasn’t always seen extraordinary growth year in and year out. Twice it has had negative growth (FY14 and FY20) and for fiscal year 2023, growth was essentially flat. And coming off a year of outsized growth, the company does face the potential risk of customer over-ordering, a slowdown in China, and increased competition impacting demand and/or pricing power. Overall, I think Nvidia Corporation has enough upside to justify a “Buy” rating and $600+ target, and I can clearly see the bullish argument. However, given the current potential risks listed above, I’m more neutral on the name. With only about $1 billion in software revenue, the business doesn’t have a lot of recurring revenue, and semiconductors can be cyclical. If revenue growth slows down due to a sudden shift in demand or an industry glut from over-ordering, the stock likely gets crushed. With a bit more downside risk than upside potential, this keeps me on the sidelines for Nvidia Corporation stock. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}