{
    "title": null,
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/news/nvidias-key-market-china-wants-152254160.html",
    "text": "In 2023, China witnessed a significant 14% increase in imports of chipmaking machines, reaching nearly $40 billion, despite a general decline of 5.5% in total imports. This surge, one of the largest since 2015, reflects Chinese chip companies’ efforts to build new semiconductor factories and boost national capabilities amidst U.S.-imposed export controls. These restrictions have hampered Chinese access to advanced chipmaking machinery, slowing the development of the country’s high-tech sector, Bloomberg reports. Meanwhile, Nvidia Corp (NASDAQ:NVDA) accounts for up to 90% of China’s $7 billion AI chip market. In 2023, Nvidia chief Jensen Huang said China made up roughly 33.33% of the U.S. tech industry’s market. Also Read: Is Nvidia Benefiting From US Sanctions On China? Jensen Huang recently made his first trip to China in four years amid escalating U.S.-China tech competition. During early this month, Huang visited Nvidia’s offices in Shenzhen, Shanghai, and Beijing. Online posts over the weekend showed him interacting with staff in traditional attire. A notable rise in China’s imports from the Netherlands occurred last year in anticipation of new export controls, impacting companies like Semiconductor Manufacturing International Corp. In December, lithography equipment imports from the Netherlands skyrocketed by nearly 1,000% to $1.1 billion as firms accelerated purchases before the Dutch restrictions came into effect. Before these export bans, ASML Holding NV (NASDAQ:ASML), a Dutch company, had already halted shipments of some high-end machines to China following the U.S. government’s request. This move predated the formal implementation of the export bans on sophisticated chipmaking equipment. These developments highlight China’s growing challenges in advancing its semiconductor industry amid international regulatory pressures. In 2023, reports indicated China’s establishment of a $40 billion state fund to support its chip industry, marking a determined response to the U.S. embargo on acquiring advanced AI chips from Nvidia and Advanced Micro Devices, Inc (NASDAQ:AMD). This fund, aiming for a record 300 billion yuan ($41 billion), will focus on chip manufacturing equipment. Concurrently, Huawei Technologies and SMIC’s development of an advanced 7-nanometer smartphone processor illustrates China’s progress in creating a domestic chip ecosystem. Reports also suggested that many Chinese semiconductor design companies tapped Malaysian firms to assemble high-end chips, mainly graphics processing units (GPUs). In November, as the U.S. sanctions kicked in, Nvidia lost to Huawei Technologies Co for a sizeable artificial intelligence chip order from Chinese tech giant Baidu Inc (NASDAQ:BIDU). Companies like Alibaba Group Holding Limited (NYSE:BABA) and Tencent Holding Ltd (OTC:TCEHY) reportedly indicated their intentions to reduce their Nvidia chips orders substantially. Chinese cloud companies sourcing nearly 80% of high-end AI chips from Nvidia could reportedly curtail orders by 50%-60% within five years. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via ASML \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article Nvidia's Key Market China Wants To Beat US Embargo, Boosts Chipmaking Machinery Imports by 14% originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}