{
    "title": "Dow Jones Futures: Nvidia Reclaims Market Leadership; Five Stocks In Buy \nZones",
    "date": "1/10/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-nasdaq-holds-gains-as-nvidia-leads-spot-bitcoin-etf/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Dow Jones futures were little changed Wednesday morning, along with S&P 500 futures and Nasdaq futures. The stock market rally was narrowly mixed Tuesday, largely holding onto Monday's strong gains. The Nasdaq reversed slightly higher, fueled by Nvidia (NVDA), which is reasserting its leadership. NVDA stock is now slightly extended from a buy zone. But Google parent Alphabet (GOOGL), Palo Alto Networks (PANW), Datadog (DDOG), Uber Technologies (UBER) and DoorDash (DASH) moved into buy areas. Tesla (TSLA) announced Tuesday night that the updated Model 3 is now available in North America. In Tuesday's session, Tesla stock fell below a key support level and nearing another. Hewlett Packard Enterprise (HPE) will buy Juniper Networks (JNPR) for $14 billion, HPE said Tuesday night. Intuitive Surgical (ISRG) reported preliminary Q4 revenue up 17% to $1.93 billion, slightly above consensus. It credited strong demand for procedures using its da Vinci robotic surgical systems. ISRG stock jumped late. Taiwan Semiconductor (TSM) reported December revenue fell 8.4% vs. a year earlier in local currency, or 14.4% vs. November. But that was better than expected. Full-year revenue declined 4.5%. The chip foundry makes chips for Apple (AAPL), Nvidia and many others. TSM stock fell 0.3% to 101.89 on Tuesday. Shares are working on a 105.52 handle buy point. Uber stock, Datadog and Nvidia are on IBD Leaderboard. Nvidia stock is on SwingTrader. Nvidia, Datadog and DASH stock are on the IBD 50. Datadog and PANW stock are on the IBD Big Cap 20. Palo Alto Networks was Tuesday's IBD Stock Of The Day. The video embedded in the article discussed Tuesday's market action and analyzed PANW stock, Howmet Aerospace (HWM) and Cameco (CCJ). Dow Jones futures fell 0.1% vs. fair value. S&P 500 futures lost a fraction. Nasdaq 100 futures were up 0.15%. The 10-year Treasury yield fell slightly to 4%. Remember that overnight action in Dow futures and elsewhere doesn't necessarily translate into actual trading in the next regular stock market session. Meanwhile, the SEC is expected to approve spot bitcoin ETFs, which are seen drawing in a lot more institutional support. But the SEC hasn't done so yet. Shortly after the close, the SEC's account on the X social site declared that bitcoin ETFs had been approved. But the financial watchdog agency said the account was compromised. The SEC deadline for action reportedly is Wednesday. The price of bitcoin fell 3.25% to $45,558.86 as of 5 p.m. ET, following the SEC approval hoax. That was after hitting the highest levels since March 2021. Bitcoin traded around $45,500 early Wednesday. Cryptocurrency exchange Coinbase (COIN) sank 4.7% Tuesday and bitcoin miner Marathon Digital (MARA) edged lower. Coinbase edged lower after hours and MARA stock fell modestly. COIN stock and Marathon jumped Monday, both consolidating since hitting 52-week highs at the tail end of 2023. Join IBD experts as they analyze leading stocks and the market on IBD Live The stock market rally was mixed, though with a downside bent. Still, stocks largely held Monday's gains. The Dow Jones Industrial Average fell 0.4% in Tuesday's stock market trading. The S&P 500 index dipped 0.15%. The Nasdaq composite edged up 0.1% after briefly testing the 21-day line. The small-cap Russell 2000 fell 1.05%, but did close just above the 21-day line. Losers easily outpaced winners. Nvidia climbed 1.7% to 531.40, up 8.2% already this week in strong volume. Shares on Monday cleared a 505.48 buy point from a flat base but really cleared several months of sideways action, fueled by new AI chip announcements. NVDA stock is now past the 5% chase zone. U.S. crude oil prices rose 2.1% to $72.24 a barrel. The 10-year Treasury yield edged higher to 4.02%. Among growth ETFs, the iShares Expanded Tech-Software Sector ETF (IGV) advanced 0.4%, with Palo Alto and DDOG stock both holdings in UGV. The VanEck Vectors Semiconductor ETF (SMH) climbed 0.3%. NVDA stock is the No. 1 holding in SMH. SPDR S&P Metals & Mining ETF (XME) sank 1.45% and the SPDR S&P Homebuilders ETF (XHB) closed fractionally lower. The Energy Select SPDR ETF (XLE) retreated 1.6% and the Health Care Select Sector SPDR Fund (XLV) was just below break-even The Industrial Select Sector SPDR Fund (XLI) dipped 0.3% and The Financial Select SPDR ETF (XLF) gave up 0.7%. Reflecting more-speculative story stocks, ARK Innovation ETF (ARKK) gave up 1.55% while ARK Genomics ETF (ARKG) rose 0.9%. COIN stock is the No. 1 holding across Ark Invest's ETFs. TSLA stock is still a major component for Cathie Wood's Ark. Time The Market With IBD's ETF Market Strategy The updated Model 3 is now available in North America, Tesla announced via Elon Musk's X social site Tuesday night.  The \"Highland\" Model 3, with has limited exterior changes and some internal refinements, had already been made at the Tesla Shanghai plant, with Q4 deliveries in China nd Europe. The Fremont-made updated Model 3 will start at $38,990 for the base-model RWD variant and $45,990 for the Long Range, unchanged from the older Model 3. The RWD and LR trims are not eligible for IRA tax credits of $7,500 due to tougher battery sourcing rules. Tesla, at least for now, is not offering a Model 3 Performance. The old Performance had a $50,990 price tag, but only $43,490 including tax credits. TSLA stock edged higher early Wednesday. Tesla stock sank 2.3% on Tuesday to 234.96, undercutting the 50-day moving average but still holding above the 200-day line. The U.S. EV giant still has a 265.13 handle buy point from a double-bottom base. But the relative strength line is approaching October lows, according to MarketSmith. Google stock rose 1.5% to 140.95, moving back above a 139.42 cup-with-handle buy point and extending Monday's bounce from the 10-week line. Volume has been light this week, though. Also, the relative strength line has been lagging since late October, which means Google stock is lagging the S&P 500. On the upside, earnings and sales growth has accelerated for the last three quarters. PANW stock popped 3.8% to 300.42, rebounding back above the 21-day line and breaking a short downtrend. That also extended Monday's bounce from the 10-week line. All of these offer reasons for an early entry. Palo Alto stock is starting to forge a new base. DDOG stock climbed 1.6% to 121.18, back above a 120.26 handle buy point after retaking the 21-day line on Monday and rebounding from the 10-week line. Investors also could use 124.69 as an alternate or add-on entry. Uber stock gained 2.2% to 60.31, back above the 21-day line after Monday's bounce from the 10-week. That was the first such pullback since an early November breakout, offering a buying opportunity. Uber is working on a new base. DASH stock jumped 4.6% to 103.05, breaking a downtrend and offering an early entry. DoorDash moved above the 21-day line on Monday, extending Friday's move from the 50-day. The stock market rally largely held Monday's strong gains on Tuesday, while many leaders continued to advance. Investors could be adding exposure, taking advantage of the buying opportunities. How aggressive you are depends on your investing style, and how much cash you had on the sidelines. Don't chase extended stocks. What investors should be doing is keeping your watchlists up to date so you can take advantage of stocks like Nvidia as they're breaking out. Read The Big Picture every day to stay in sync with the market direction and leading stocks and sectors. Please follow Ed Carson on Threads at @edcarson1971, X/Twitter at @IBD_ECarson and Bluesky at @edcarson.bsky.social for stock market updates and more. YOU MAY ALSO LIKE: Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Tesla Vs. BYD: Tesla Tests Key Levels; Big News Looms For New EV King HPE To Buy Juniper Networks For $14 Billion 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}