{
    "title": "'A deceptive tactic': Nancy Pelosi disclosed a 7-figure bet on NVIDIA over \nthe Christmas holidays — despite recent ...",
    "date": "1/2/2024",
    "url": "https://finance.yahoo.com/news/deceptive-tactic-nancy-pelosi-disclosed-180000159.html",
    "text": "Rep. Nancy Pelosi (D-CA) and her venture capitalist husband reportedly bet millions on technology giant Nvidia (NVDA) late last year — despite immense scrutiny and backlash against congressional stock trading. The former house speaker bought Nvidia call options on Nov. 22 — her largest stock purchase in the last three years, according to stock trading news site Unusual Whales. Commercial real estate has outperformed the S&P 500 over 25 years. Here's how to diversify your portfolio without the headache of being a landlord Take control of your finances in 2024: 5 money moves to start the new year off strong The US dollar has lost 87% of its purchasing power since 1971 — invest in this stable asset before you lose your retirement fund According to a disclosure form obtained by Unusual Whales and congresstrading.com, Pelosi purchased 50 call options with a strike price of $120 and an expiration date of Dec. 20, 2024 — with a potential capital gian of up to $5 million. “Pelosi bet millions on NVDA in November using call options. Using a deceptive tactic, she purposely disclosed this on the Friday before Christmas weekend to avoid media coverage,” ongresstrading.com revealed on X, formerly Twitter. Pelosi, aged 83, and her husband, Paul, have re-entered the Nvidia game after selling their shares and call options in the AI software company at a total loss of over $700,000 in 2022. Their ill-timed departures occurred around the same time that the CHIPS and Science Act was passed into law, which Pelosi publicly supported. This law majorly benefited domestic chipmakers like Nvidia. Since selling their 25,000 shares, the Nvidia stock price has surged by almost 200%, according to the New York Post, which means the value of the Pelosis’ original stake would have been worth in excess of $12.2 million today. However, the duo has certainly made up for it in other transactions. They have netted millions of dollars in profit from buying call options on other blue-chip stocks such as Salesforce (CRM), Roblox (RBLX), and Disney (DIS). They have also made some well-timed sales. Notably, Paul Pelosi, 83, sold 30,000 shares of Google (GOOGL) stock in December 2022, just one month before the tech giant was sued over alleged antitrust violations. That transaction had lawmakers crying foul about insider trading. Specifically, it riled up Sen. Josh Hawley of Missouri, who responded by introducing the Preventing Elected Leaders from Owning Securities and Investments (PELOSI) Act in January 2023. When announcing the PELOSI Act, he said: “While Wall Street and Big Tech work hand-in-hand with elected officials to enrich each other, hard-working Americans pay the price. The solution is clear: we must immediately and permanently ban all members of Congress from trading stocks.” Read more: Thanks to Jeff Bezos, you can now cash in on prime real estate — without the headache of being a landlord. Here's how Hawley is by no means alone in trying to tackle this problem. The PELOSI Act followed fast in the footsteps of the Transparent Representation Upholding Service and Trust in Congress Act, or TRUST Act, introduced by Reps. Abigail Spanberger of Virginia and Chip Roy of Texas on Jan 12, 2023. Both bills failed to move the needle in Congress — but they set the scene for a busy year of politicians trying to stifle corruption in Washington. In July, Hawley took another stab at the problem by co-introducing the bipartisan Ban Stock Trading for Government Officials Act alongside Sen. Kirsten Gillibrand (D-N.Y.) That proposed law builds on the decade-old Stop Trading on Congressional Knowledge (STOCK) law, which is supposed to combat insider trading by members of Congress and their staff. This Pennsylvania trio bought a $100K abandoned school and turned it into a 31-unit apartment building — how to invest in real estate without all the heavy lifting Worried about the economy? Here are the best shock-proof assets for your portfolio. (They’re all outside of the stock market.) Rising prices are throwing off Americans' retirement plans — here’s how to get your savings back on track This article provides information only and should not be construed as advice. It is provided without warranty of any kind. "
}