{
    "title": "Tech Earnings Preview: AI Wave 'Hitting the Shores', Bears Are Wrong",
    "date": "1/17/2024",
    "url": "https://markets.businessinsider.com/news/stocks/tech-earnings-ai-wedbush-microsoft-nvidia-apple-tesla-q4-amazon-2024-1",
    "text": "       A new season of tech earnings is about to kick off, and the bears will find themselves off-side as artificial intelligence boosts valuations beyond names like Nvidia and Microsoft, according to Wedbush analyst Dan Ives. In a note on Tuesday, Ives likened investors with recession concerns to those yelling fire in a crowded theater. He expects an uptick in demand around enterprise software, cybersecurity, and AI to help fuel new projects and use cases in 2024. \"We believe the key narrative for 4Q earnings season,\" Ives said, \"is the beginning of the AI Revolution hitting the shores of the broader tech landscape being led by Nadella and Microsoft along with the Godfather of AI Jensen and Nvidia.\" Yet the massive consumer spending and demand, he added, is pouring into second-, third-, and fourth-derivatives of AI across software, chips, and hardware. AI technology is gaining momentum in the mainstream, and Ives expects that to lead to more growth and new products. The analyst said a strong \"year-end budget flush\" will hit for the December quarter around cloud giants Microsoft, Amazon, and Google, as well as the overall software sector. Those three names are among Wedbush's top tech picks, which also include Apple, Microsoft, Palo Alto Networks, Palantir, Zscaler, CyberArk, Crowdstrike, and MongoDB. \"While the bears will continue to fret about tech valuations, we believe Street numbers (and valuations) for 24/25 will move higher as this AI spending tidal wave hits the tech industry,\" Ives said. Indeed, corporate America and its executives have become more upbeat over recent months. Fears of an economic downturn have cooled, third-quarter earnings calls saw a drop in mentions of \"recession,\" and while risks remain, Wall Street has ramped up calls for a soft landing. On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Disclosure: Palantir Technologies CEO Alexander Karp is a member of Axel Springer's shareholder committee. Axel Springer owns Insider Inc, Business Insider's parent company. Read next Indices Commodities Currencies Stocks Jump to "
}