{
    "title": "Science of Success: The Nvidia CEO's Lessons in Building a $1T Company - \nWSJ's The Future of Everything - WSJ ...",
    "date": "1/26/2024",
    "url": "https://www.wsj.com/podcasts/wsj-the-future-of-everything/science-of-success-the-nvidia-ceos-lessons-in-building-a-1t-company/e91dd807-fb3c-434c-8a9a-22621bee23a0",
    "text": "Nvidia's Jensen Huang is Silicon Valley's longest tenured CEO, and his company recently joined the trillion dollar club. But if he knew at the start what he knows now, would he do it all again? WSJ Science of Success columnist Ben Cohen explains Huang’s approach to success and what that might mean for tomorrow's entrepreneurs.  What do you think about the show? Let us know on Apple Podcasts or Spotify, or e mail us: FOEPodcast@wsj.com  Further reading: He Built a Trillion-Dollar Company. He Wouldn’t Do It Again. Tech’s ‘Magnificent Seven’ Stocks Are Back on Top Markets Analysis: Nvidia Stock Jumps to Record High This transcript was prepared by a transcription service. This version may not be in its final form and may be updated. Ben Cohen: Hi Future of Everything listeners. I'm Ben Cohen and I write The Science of Success column here at the Wall Street Journal. We're trying something new and bringing you a new feature based on my column. Take a listen and let us know what you think. Drop a line to foepodcast@twsj.com.\nWhen he sat down in a booth at his local Denny's and began plotting out the business that would change his life, Jensen Huang did not know where his startup would be 30 years down the line, and if he had known, he never would've done it. Speaker 2: It is official. Nvidia is the first chip company to hit a $1 trillion market value. Speaker 3: Nvidia is on fire, being over a trillion dollar in market cap now. Speaker 4: The microchip maker briefly entered record-breaking territory. Only four companies in history have ever passed $1 trillion in value. According to their stock price, today, Nvidia became the fifth. Ben Cohen: Nvidia was the most successful company of 2023. The only other companies worth $1 trillion are household names like Apple, Microsoft, Amazon and Google parent, Alphabet. Nvidia? Nvidia is a name that looks like someone fell asleep on a keyboard, but the chips that Nvidia makes have become fuel for the AI boom. And now Nvidia is worth more than Netflix, Nike and Novo Nordisk combined. It tripled in value last year. It beat every other company in the S&P 500. In fact, Nvidia had the single best year of any major stock in the past decade. So why wouldn't Jensen Huang do it all again?\nFrom the Wall Street Journal, this is The Science of Success. A look at how today's success could lead to tomorrow's innovation. I'm Ben Cohen. I write a column for The Journal about how people, ideas and teams work and when they thrive. Nvidia has been around for 30 years, but last year was the year that it really took off. That's because there has never been so much demand for GPUs or graphics processing units. These are the advanced chips that provide oxygen for artificial intelligence. They're responsible for basically every piece of technology the nerdiest person you know is really psyched about. And the supply of those AI chips, it's controlled by Nvidia.\nJensen Huang is the only Chief Executive Officer in Nvidia's history. He co-founded the company in a Denny's booth with Chris Malachowsky and Curtis Priem in 1993. Nvidia started out making chips to process 3D graphics for marketing materials and video games. In 1999, Nvidia started getting into GPUs. You might remember computer games like Counter-Strike... Speaker 5: The hostages were rescued. Ben Cohen: Or Diablo II... Speaker 6: Stay a while and listen. Ben Cohen: What you may not know is that Nvidia's GPUs are what made images in games like these crisper and less choppy. Back then, Huang didn't see the AI boom coming. Nvidia's GPUs were used for graphics, but today, these GPUs help train AI in everything from autonomous driving to the large language models behind ChatGPT. AI models require tens of thousands of these chips that can handle lots of computational tasks at the same time, which means billions of dollars in revenue. According to the company, more than 40,000 companies use NVIDIA's technology and it has become indispensable to the most valuable corners of the economy. Jensen Huang: We are the world's engine for AI. Ben Cohen: That's the man himself. Jensen Huang in an interview with CNBC, and his statement helps us understand the success of this company and its current stock price. But Huang has said if he knew then what he knows now, even standing on this mountain of success, he never would've started climbing. He might've simply turned back to his Super Bird Turkey sandwich and diner coffee and gone on with his day. We find out more about what made Huang the CEO he is today and what that means for the tech entrepreneurs of tomorrow. That's after the break.\nJensen Huang Has been on the job since Mark Zuckerberg was in elementary school. He's Silicon Valley's longest tenured CEO. He has silver hair. He wears a signature black leather jacket. He even got Nvidia's spiral eye logo tattooed on his bicep. But the reason he's flexing today is because he had no idea how difficult the road to success would be when he started. He recently told the hosts of the Acquired podcast. Jensen Huang: If we realized the pain and suffering and just how vulnerable you're going to feel and the challenges that you're going to endure, the embarrassment and the shame, and the list of all the things that go wrong, I don't think anybody would start a company. Nobody in their right mind would do it, and I think that that's the superpower of an entrepreneur. Ben Cohen: Basically, ignorance is not just bliss. It's a huge advantage to any entrepreneur. Every time that Nvidia embarks on some new project that seems impossible, Huang tricks his brain into thinking, \"How hard could it be?\" I spoke with the hosts of the Acquired podcast, who scored their exclusive interview after many hours of very thorough and extremely wonky coverage of Nvidia. Seriously, these guys might know more about Nvidia's history than anyone who did not live through it. They told me that company is him. He does everything but sweep the floors, and he may sweep the floors, but it's not just his ignorance or his diligence that got Nvidia where it is today. The other major key to Huang's success is that he's not afraid of making really big bets. In fact, he's bet the company on three different occasions\nAfter the company released its first product, a graphics card that flopped, Huang laid off half the workforce. Running out of money, teetering on the edge of bankruptcy, he bet the company on the 1997 chip that would save Nvidia. But the decade after Huang's company went public in 1999 would bring two more brutal stretches, during the dot-com bust and the global financial crisis. Even when markets rallied, Nvidia didn't. From 2008 to 2013 when the S&P 500 was up 25%, Nvidia's stock was down 50%.\nNvidia stagnated as Huang plowed money into a new platform for accelerated computing, one that would allow developers to do anything they wanted with GPUs. And the group of people who really picked this up, AI researchers. They used Nvidia's chips to train neural networks, and then he decided to put his chips on the table again. The initial breakthroughs in deep learning compelled Huang to make another bet the company move on AI. In 2012, Nvidia began work on the system that would become its first AI supercomputer. Huang delivered it four years later to OpenAI, whose researchers would use Nvidia's GPUs to educate ChatGPT, which became the hottest app in tech history when it was released in 2022.\nJensen Huang is the billionaire CEO of a trillion-dollar company today. Who are the entrepreneurs of tomorrow sitting in their own metaphorical Denny's, dreaming about building their own companies, and blissfully unaware of how hard it's going to be? Because really, how hard could it be?\nAnd that's The Science of Success. This episode was produced by Charlotte Gartenberg. I'm Ben Cohen. Be sure to check out my column on wsj.com. And if you like the show, tell your friends and leave us a five star review on your favorite platform. Thanks for listening. Danny Lewis is an audio reporter and co-host for The Wall Street Journal's Future of Everything podcast, where he covers the latest developments in science and tech and how they will change everyday life. Before joining the WSJ's podcast team, Danny was a reporter/producer for WNYC and Gothamist, where he covered arts and culture, local government and environmental news in New York City and New Jersey. He has written for publications including the New York Daily News, Smithsonian Magazine, 99% Invisible and many more. Danny earned his bachelor's degree from Bard College and his master's from the Craig Newmark Graduate School for Journalism at CUNY. In his spare time, Danny is a cartoonist and illustrator, as well as an avid reader of everything from comics to cookbooks. He also enjoys birdwatching, especially for ducks. He lives in Brooklyn, where he was born and raised, alongside his two cats, Soba and Miso. Alexandra (Alex) Ossola is an audio reporter and producer covering science and tech for The Wall Street Journal’s Future of Everything podcast.  Before joining the Journal, Alex ran podcasts and special projects at Quartz and was the managing editor at Futurism. She has written about science for publications such as The Atlantic, National Geographic, Popular Science, and many more. She earned her bachelor’s degree from Hamilton College and her master’s from NYU’s Science, Health and Environmental Reporting Program (SHERP). She is fluent in Spanish and is learning Korean. In her spare time, Alex likes to travel, bake, read, and birdwatch. She lives in New York City. "
}