{
    "title": "Nvidia, Fed's Goolsbee, earnings themes: Top Stories",
    "date": "2/14/2024",
    "url": "https://finance.yahoo.com/video/nvidia-feds-goolsbee-earnings-themes-204410573.html",
    "text": "Yahoo Finance's Jared Blikre, Jennifer Schonberger, and Josh Schafer highlight the top stories making waves in equity markets and the US economy. Nvidia (NVDA) momentarily takes the lead over Alphabet (GOOG, GOOGL) for the third-largest market cap. Chicago Fed President Austan Goolsbee calmed distress relating to the January CPI report's forecast on interest rate cuts while speaking before the Council on Foreign Relations. Lastly, layoffs and share buyback programs are some of the core themes across mega-cap stocks this earnings season. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. ALEXANDRA CANAL: We're joined by Josh Schafer, Jennifer Schonberger, and Jared Blikre. Let's kick it off with Jared on the latest moves from the Magnificent Seven. JARED BLIKRE: Allie, we can see broad gains today, though not Apple. That's down 1%. Alphabet has been flirting with the unchanged, both green and red for an hour or so. Nvidia up to another record, 1.4%. But I want to take a look at the market cap because Nvidia over the last two days has briefly, from time to time, surpassed Alphabet in market cap. They're both about $1.8 trillion right now, so both shy of $2 trillion. And Nvidia recently passed Amazon as well. Google, by the way-- Alphabet-- one of three companies to reach that $3 trillion-- or excuse me, $2 trillion mark so far. I'm also throwing Bitcoin in here. Bitcoin is worth $1 trillion, and just wanted to get a quick update on the technicals here. We are past $50,000 at $51,500, basically, in territory we have not seen since late 2021. But the overarching theme today is mega caps are definitely in focus, and do not count out the Mag Seven. Now let's send it over to Jennifer Schonberger with the latest commentary from Fed officials. JENNIFER SCHONBERGER: Chicago Fed President Austan Goolsbee soothing market fears today over that hotter-than-expected January CPI report, saying the Fed still intends to cut rates multiple times this year. Goolsbee saying, quote, \"let's not get amped up over one month of CPI that was higher than expected.\" AUSTAN GOOLSBEE: We can still be on the path even if we have some increases and some ups and downs. There's nothing wrong with that. So let's not get too flipped out. JENNIFER SCHONBERGER: Goolsbee also pointed to the fact that Fed officials see inflation of 2.4% this year. That's actually higher than the data that we've seen over the past six months. And at that higher level of inflation, Goolsbee says he still expects the Fed to cut multiple times this year. Now let's kick it over to Josh Schafer for the latest on the earnings roundup. Josh. JOSH SCHAFER: Thanks, Jen. Fourth-quarter earnings season well underway, and a few key themes have emerged. First, buybacks. Uber unveiling its first-ever buyback totaling $7 billion, sending shares soaring today. And Airbnb, Disney, Alibaba, and Meta among others announcing repurchase plans in their quarterly reports. Also getting a lot of mention, layoffs. Meta set the trend in 2023 with its year of efficiency, and the trend is clearly catching on. Though job cuts historically tend to rise in January, big names across media and tech have been making headlines with plans to streamline and slim down staff. And finally, inflation. This week's hotter-than-expected CPI print raising concerns about progress made in the inflation fight. Names in the food and alcohol space like Krispy Kreme and Heineken calling out inflation's impact on pricing. So, Allie and Josh, not necessarily shocking themes here, I would argue, the fact that we're still talking about inflation and we're still talking about layoffs. But one that does stand out to me, because it is a little bit of a different trend than we had been seeing, is buybacks. We have earnings coming up, right? We have earnings increasing again for the second straight quarter on a year-over-year basis. You often see buybacks come with that, and we hadn't really seen the buyback resurgence yet, but it seems like we're starting to see that a little bit right now, Allie. ALEXANDRA CANAL: Yeah. JOSH LIPTON: Go ahead, Allie. ALEXANDRA CANAL: No. Yeah, I was going to say, some of these stats are interesting. The last three weeks have seen nearly $130 billion in buyback announcements. Goldman Sachs also had some separate research that, for the fourth quarter, S&P 500 companies are set to increase buybacks by about 6%. And it's just been interesting to see the reaction in some of these stocks. I covered Disney very closely when they announced their buyback. That was one of the reasons why we saw that stock surge. Along with buybacks, you're also having dividends. A lot of these things is what investors want to see. But I know, Josh, we were all talking about how it's an interesting time for all of this to happen. Interest rates are high. Borrowing costs are high. A lot of these companies seem to be under a lot of pressure, yet here they are. The stock buyback is back. JOSH LIPTON: Yeah, I mean, they've been making news, we were talking about Josh, in that, you know, capital turnover from Meta and Airbnb and Uber. But it was interesting whether you saw kind of differences between sectors because we were talking off camera about this how I would think a lot of CFOs are still thinking, given corporate borrowing costs, given all the uncertainty about the macro still, I think a lot of them are thinking, you know what? I'm going to hold on to my cash for a while. JOSH SCHAFER: And that is what strategists have pointed to leading into earnings season, right, was this is why we haven't seen the return in buybacks yet or at least the normal level of buybacks that you would see is those concerns you listed, Josh, right? But you see communication services leading buybacks thus far this earnings season, and what stands out to me there is you think of a company like Meta, right? And you think about what Meta was able to do in the last year by getting basically their capital structure in a better situation they feel, and it's increased margins. It's increased earnings. And eventually you end up with more cash, right? And what do you do with that cash when you feel like you're in a better position and you might not necessarily need it? You can go to share buybacks. So I think we're seeing it from some of these top companies. We already mentioned Disney, right? We mentioned Meta. Now you have Uber also feeling like they're in a better spot over the last year. We know that's been a big turnaround story. So it's sort of those leaders of the, quote, unquote, \"year of efficiency.\" We're using Meta's word for everyone now. But I think it's the leaders of that year of efficiency, right, and finding the right structure. Maybe the last piece of that is the buybacks. And I think maybe the broader question is, When do you start seeing it across more sectors? JOSH LIPTON: Yeah, Zuckerberg really should have trademarked the year of efficiency. ALEXANDRA CANAL: I know. JOSH LIPTON: It's really abused at this-- [INTERPOSING VOICES] ALEXANDRA CANAL: I thoguht we did this last year. JOSH SCHAFER: We should have a T-shirt. JOSH LIPTON: At least a bumper sticker. ALEXANDRA CANAL: Exactly. But I want to pick up on that efficiency point because this is a cool chart that I want to bring up. Morgan Stanley analyst Mike Wilson, he said that transcript mentions of operational efficiency are at historic levels as these companies are really focusing in on profitability. You mentioned, Josh, the layoffs that we've seen. Instacart, Paramount Global two recent examples here. And a big part of this too is the refocus on AI. I should say new focus on AI. So they're really trying to trim their business to focus their cash on that, and with that, unfortunately, tends to come layoffs. JOSH SCHAFER: And the other thing with operational efficiency too that always comes to mind for me-- because we've been talking a lot about the Fed and, Are we going to see these rates go higher for longer, or are they going to wait until May? Are they going to wait until June? When you think about what that means for these companies-- and, Josh, you mentioned borrowing costs being higher. So borrowing costs go up. Typically you see layoffs because companies are trying to protect their margins, right? They need somewhere to basically get money back. And we haven't seen necessarily mass layoffs, and that's the broad question, it seems like, for the market right now. If those borrowing costs do stay high, how much more do we hear mentions of layoffs as companies try to protect margin? Because there's only so many things you can do, right, and that's sort of the last straw sometimes that companies go to to basically say, all right, well, we've got to cut costs somewhere. It might have to be in the labor force. JOSH LIPTON: We'll keep watching. Joshua, thank you. Related Quotes "
}