{
    "title": "Cathie Wood’s Ark Invest Sheds More Coinbase, Nvidia and Robinhood Shares",
    "date": "2/27/2024",
    "url": "https://coingape.com/cathie-wood-ark-invest-sheds-more-coinbase-nvidia-and-robinhood-shares/",
    "text": "News Markets Cryptoguru Collection Contact Follow us on: TRENDING TODAY On Monday, February 26, Ark Invest, led by Cathie Wood, made significant adjustments to its portfolio, notably divesting shares of cryptocurrency-related companies, such as Robinhood Markets Inc (NASDAQ: HOOD) and Coinbase Global Inc (NASDAQ: COIN), This comes amidst a notable rally in Bitcoin (BTC) as it surpassed the $57,000 mark. The decision encompasses a pivotal moment for investors, with the crypto market cap exceeding $2 trillion. The Cathie Wood-led organization sold a total of 35,509 Coinbase shares through its flagship ARK Innovation ETF (ARKK), with the transaction valued at $6.9 million. On Monday, Coinbase shares surged 16.85% to $193.94, gaining 27.96 points. Whilst, in the pre-market trading session, the Coinbase stock surged 6.29% to $206.13 on Tuesday, February 27. Earlier, on February 23, ARK Next Generation Internet ETF (ARKW) decided to divest 24,193 shares of the Coinbase stock, totaling $4 million, amidst a market dip that saw the price fall below $170. The preceding day saw ARK Innovation ETF (ARKK) offloading 2,828 Coinbase shares, maintaining their strategy of active portfolio management. Moreover, on February 21, ARK Innovation ETF (ARKK) sold 31,747 Coinbase shares, while Ark Fintech Innovation ETF (ARKF) divested 8,936 COIN shares, indicating a continued trend of reducing exposure to Coinbase. On February 20, ARK Innovation ETF (ARKK) divested 19,732 Coinbase shares, Ark Fintech Innovation ETF (ARKF) sold 4,970 COIN stock shares, and ARK Next Generation Internet ETF (ARKW) opted to offload 4,029 Coinbase shares, collectively demonstrating a concerted effort to reduce holdings in Coinbase across multiple ARK ETFs. Also Read: AI News: Cathie Wood Clears Slate on Nvidia Sale After Stellar Results Additionally, the firm divested 444,853 Robinhood shares through ARK Next Generation Internet ETF (ARKW) and Ark Fintech Innovation ETF (ARKF) on Monday. The total of transactions was valued at nearly $6.9 million. Robinhood shares closed 7.7% higher at $15.59 for the day. In addition, the HOOD stock gained 3.01% to $16.05 in the pre-market session today. The firm sold 2,724 Nvidia shares through ARK Genomic Revolution ETF (ARKG) on Monday, valued at $2.15 million. Nvidia stock edged up 0.35% higher at $790.92 for the day. In addition, the pre-market session today witnessed the Nvidia stock gain by 0.41% to $794.19. Whilst, Cathie Wood defended the sale of Nvidia shares, highlighting their early investment in 2014 when the company was undervalued as a PC gaming chip maker, resulting in significant profits. Despite Nvidia’s recent surge, ARK continued to sell shares, explaining that they take profits after substantial gains. Also Read: Ethereum ICO Investor Initiates Massive Coinbase Dump As ETH Price Soars To $3200 Wall Street Peeks at Bitcoin ETFs on Strong Pre-Market Gains, BTC Price to Hit $60K? FLOKI Price Skyrockets 40% As DWF Buys $10M FLOKI DAILY NEWSLETTER Your daily dose of Crypto news, Prices & other updates.. Top News Cryptocurrency Prices Popular Coingape Academy Blogs Popular Categories Exclusive Contact Exclusive Contact Close "
}