{
    "title": null,
    "date": "2/23/2024",
    "url": "https://www.marketwatch.com/story/nvidia-now-worth-2-trillion-becoming-only-third-u-s-company-to-hit-that-mark-3f717418",
    "text": "Nvidia Corp. just fell short of finishing as one of only three U.S. companies to fetch a closing market value above $2 trillion. The chip maker’s stock \n        NVDA,\n        +0.12%\n       rose as much as 4.9% in Friday’s session, which would have implied a market capitalization of $2.06 trillion. But shares pulled back as the session wore on and finished at $788.17, up only 0.4%. That translated to a closing valuation of $1.98 trillion. Any finish above $800 would have given Nvidia a $2 trillion closing market capitalization. The company first finished with a $1 trillion market value on June 13. Though it didn’t close in $2 trillion territory Friday, it would be the quickest to ascend between those two milestones if it achieved the feat at any point over the next 11-plus months. Friday marked the 175th trading day since Nvidia reached the $1 trillion mark, according to Dow Jones Market Data. For context, it took Apple Inc. \n        AAPL,\n        -1.06%\n       516 trading days and Microsoft Corp. \n        MSFT,\n        -0.17%\n       543 trading days to hit $2 trillion from $1 trillion. See also: After Nvidia’s latest blowout, here are 20 AI stocks expected to rise as much as 44% Nvidia shares are up 233% over the past year as the company has seen frenzied interest in its graphics-processing units, which have proven essential to companies building out artificial-intelligence applications. The company’s latest earnings report suggested that robust demand for GPUs was poised to continue, and powered Nvidia to a $277 billion gain in market cap during Thursday’s session. That was the biggest one-day valuation haul for any U.S. company ever. Intel Chief Executive Pat Gelsinger got a big bump in compensation in 2023, but it still amounted to  just over half what Lisa Su made as CEO of rival Advanced Micro Devices. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}