{
    "title": "Nvidia partner Synopsys Stock Breaks Out",
    "date": "2/5/2024",
    "url": "https://www.investors.com/research/nvidia-partner-synopsys-stock-breaks-out/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Synopsys stock is Monday's IBD 50 Stocks To Watch pick as it touched a buy point out of a cup-with-handle base Monday morning. Synopsys (SNPS) provides technology including testing, chip design and software security for the semiconductor industry. It partners with specialty-chip maker, Nvidia (NVDA), a leader in artificial intelligence technology. Synopsys uses AI in its electronic design automation used in data analytics. It collaborates with chip and AI leaders Advanced Micro Devices (AMD), Intel (INTC) and Microsoft (MSFT) on design, verification, testing and manufacturing. \"AMD is very excited about the opportunities we see to provide our design teams with generative AI capabilities that will enable them to more efficiently deliver multiple generations of leadership products,\" said Mydung Pham, vice president of Silicon Design Engineering at AMD. On, Jan. 16, Synopsys announced it will acquire engineering simulation software designer Ansys (ANSS) for about $35 billion. The Ansys purchase is expected to increases Synopsys' footprint in the chip, automobile and aircraft industries. Synopsys holds the No. 1 spot out of 12 stocks in the computer software-design group. The group rose to No. 42 out of the 197 IBD industry groups from No. 101 four weeks ago. Synopsys stock kept Friday's momentum going and rose in early trading Monday morning. Shares broke out and hit the 554.57 buy point of a cup-with-handle base before retreating just below the entry in recent action. The 5% buy zone reaches to 582.30. SNPS stock jumped 3.1% in heavy volume on Jan. 16, following the Ansys deal news. Synopsys stock reclaimed its 50-day moving average on Jan. 22 in heavy trading, as tech stocks rallied. Shares reached an all-time high on Dec. 13, before retreating to form the second-stage base. Its relative strength line dropped as shares pulled back in the cup but now that is improving. Synopsys' fiscal fourth-quarter earnings grew 66%, up from 37% and 2% in the prior two quarters. Sales growth also picked up steam with a 25% rise, up from 19% and 9% in the same time periods. Its fiscal first-quarter earnings are due for release on Feb. 21. Analysts expect 24% per-share earnings growth for fiscal 2024 and 20% in 2025. Mutual funds own 58% of shares. A total of 3,268 funds owned Synopsys in December, up from 3,205 in September and 3,073 in June. Mutual funds have added shares of Synopsys stock over the last eight quarters. SNPS stock holds best-possible scores of 99 on its IBD Composite and EPS Ratings. Follow Kimberley Koenig for more stock market news on X/Twitter @IBD_KKoenig. YOU MAY ALSO LIKE: These Brokers Help You Boost Your Cash | Where To Invest Warren Buffett Stocks Hit Highs | Where To Invest Have You Checked Out These S&P 500 Leading Stocks? | Where To Invest Cadence Design Systems Teams Up With Tesla| Where To Invest IBD Live: A New Tool For Daily Stock Market Analysis 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}