{
    "title": "Nvidia CEO Calls for Sovereign AI Infrastructure",
    "date": "2/16/2024",
    "url": "https://www.datanami.com/2024/02/16/nvidia-ceo-calls-for-sovereign-ai-infrastructure/",
    "text": " Translation Disclaimer The AI boom has catapulted Nvidia’s stock to an all-time high. The GPUs by Nvidia are the best-in-class hardware for supporting AI workloads. The remarkable rise of the company has resulted in the greater influence of the founder and CEO of Nvidia, Jensen Huang, on the AI market. At the recent World Governments Summit in Dubai, Huang shared his views that every country should have its own AI system. This will empower nation-states to serve their specific cultural and language needs and leverage their particular business strengths in the age of AI. Huang believes companies should own the AI intelligence and data they produce. “It codifies your culture, your society’s intelligence, your common sense, your history – you own your own data,” Huang said at the event attended by more than 4,000 delegates from 150 countries. AI sovereignty refers to the strategic development and deployment of AI technology to protect national security, economic competitiveness, and societal well-being. This is in contrast to corporate-controlled AI, which is developed primarily for the best interests of a company, rather than the state. The concept of a sovereign AI is not new, but now that this suggestion has come from Huang and other influential business leaders, the idea has gained significant attention in the industry. Earlier, IBM CEO Arvind Krishna also made a similar call to action by urging countries to have “some sovereign capability on artificial intelligence, including large language models for AI.” Krishan suggested that countries should set up national AI computing centers and common data sets for specific use cases. Several countries have already started establishing a sovereign AI infrastructure, including the Netherlands. The Dutch government revealed its vision for GenAI, which includes further investment in the nation’s open large language model, GPT-NL. The European Union is also pursuing sovereign AI by investing in supercomputers to support AI startups in the region. Taiwan is also investing in sovereign AI. It is building a government-funded LLM named Taide with a primary objective to counter the influence of AI tools from China such as Baidu’s Ernie bot. The Taiwanese government wants to restrict the use of Chinese AI tools as they often provide politically biased information. While sovereign AI infrastructure has to be led by governments, the private sector plays a vital role in achieving this vision. The private tech industry must cooperate with governments to build a robust API infrastructure. This is where the support of major tech players, such as Nvidia and IBM, is critical to the successful development of sovereign AI. The Dutch government suggests an “open strategic autonomy” structure where local companies have the freedom to work with foreign governments but have the ability to work independently as needed. Speaking at the summit in UAE, Huang urged business leaders not to be “mystified” by AI as the capabilities offered by the technology offer great potential. An increasing number of AI events are happening in the UAE, which has become a center for AI innovation in the Middle East. PwC projects the AI market in the region to reach $320 billion by 2030. While AI sovereignty offers some key benefits, such as tailored deployment of AI based on specific needs, there are some risks. The move to sovereign AI could result in further fragmentation of the global digital ecosystem. This can further escalate the ongoing arms race for AI superiority amongst nations. Even if governments envision having a sovereign AI, they must continue their international cooperation in AI development. Related Items Nvidia’s Huang Sees AI ‘Cambrian Explosion’ Sam Altman Seeks $7 Trillion to Supercharge Chip Production NVIDIA CEO Hails New Data Science Facility As ‘Starship of The Mind’ Comments are closed. Sorry. No data so far. Sorry. No data so far. Sorry. No data so far.   View More… "
}