{
    "title": "Wall Street Breakfast Podcast: Nvidia Bets on Arm,SoundHound",
    "date": "2/15/2024",
    "url": "https://seekingalpha.com/article/4670478-wall-street-breakfast-podcast-nvidias-ai-bets-include-arm-soundhound",
    "text": "Vertigo3d  Vertigo3d Listen below or on the go on Apple Podcasts and Spotify  AI bets: Nvidia reports stakes in Arm Holdings, SoundHound and others. (00:24) Shell exits discussions to build major petrochemicals plant in Iraq. (01:25) Macau tourism hits a post-pandemic record during Chinese New Year. (02:17) This is an abridged transcript of the podcast. Nvidia (NASDAQ:NVDA), the AI chip-making powerhouse, has disclosed investments in U.K. chip designer Arm Holdings (ARM), voice AI recognition firm SoundHound AI (SOUN), and Chinese self-driving truck maker TuSimple (TSPH). The Arm (ARM) stake was the biggest, totaling $147.3M. Recall that Nvidia (NVDA) had tried to buy Arm for $40B back in 2020, but regulatory pressure forced it to scrap the deal in 2022. Arm's (ARM) stock has more than doubled in value since its market debut last September, which was 2023's biggest IPO. Nvidia's (NVDA) disclosure of a $3.7M stake in SoundHound (SOUN) and SoftBank's (OTCPK:SFTBY) new stake in the firm sent its shares surging 45.9% after the bell on Wednesday. Nvidia (NVDA) disclosed a smaller stake in TuSimple (TSPH) at a little over $3M. Note that TuSimple (TSPH) is in the process of winding down its U.S. operations and recently delisted its stock from Nasdaq. Shell (NYSE:SHEL) has withdrawn from talks on building a petrochemicals plant in Iraq's southern oil hub of Basra after nearly 10 years of trying to get the project off the ground. Argus reported Wednesday that Iraq's oil ministry said Shell (SHEL) will end discussions regarding its role as \"a major investor\" in the Nebras petrochemicals project, while also affirming the company's continued support for the project through its partnership with Basra Gas Company. The project has been in the works for nearly a decade, with Shell (SHEL) signing an initial agreement in 2015 to build an $11B petrochem complex in Basra that could make Iraq the largest petrochemical producer in the Middle East, but a final deal stalled amid financial and contractual issues. Shell's (SHEL) exit is considered a major blow to Iraq's aspirations to attract foreign investment into its energy sector. Macau has received 877K tourists through 5:00 p.m. local time on Wednesday, according to officials. The tourist tally is within sight of the one million visitor arrival projection, with three full days of the holiday period still left. Just as promising, the hotel occupancy rate at the gambling mecca is reported to be at 97%. Asia Gaming Brief reported that on February 12th, Macau received 217,448 tourists, which was noted to mark the highest daily visitor arrivals tally since the pandemic. The highest daily visitor tally in history was 226,326 on February 7, 2019. Earlier in the week, Jefferies upgraded Macau operator MGM China to a Buy rating from Hold. Analyst David Katz highlighted that China macro concerns remain a headwind, but sector fundamentals continue to be stronger than estimates. Macau-related casino stocks: Wynn Macau (OTCPK:WYNMF) (OTCPK:WYNMY), Wynn Resorts (WYNN), Sands China (OTCPK:SCHYY) (OTCPK:SCHYF), and Las Vegas Sands (LVS) among others. Other articles to look out for on Seeking Alpha: Joann falls amid report of talks with lenders on cash infusion Occidental Petroleum plans flat 2024 production, to cut two Permian Basin rigs Roku facing mixed impact from proposed Walmart-Vizio deal, analysts say Now for a look at our earnings watch from Wednesday. Class A shares of Twilio (NYSE:TWLO) on Wednesday slid more than 9% in extended trading, after the cloud communications firm provided current quarter revenue guidance that came in below estimates. Premarket Twilio is down 13%. Twilio (TWLO) reported Q4 2023 adjusted earnings of 86 cents per share on revenue of $1.08B. Analysts had been expecting the company to earn 58 cents per share on revenue of $1.04B. Turning to Twilio's (TWLO) guidance, the company sees Q1 2024 revenue of $1.025B to $1.035B. The consensus estimate is $1.05B. Adjusted earnings per share is expected to be $0.56 to $0.60, compared to a consensus of $0.54. On our catalyst watch for the day, Notable investors events include Datadog's (DDOG) Investor Day, Otis Worldwide's (OTIS) Investor Day, and Ford Motor's (F) appearance at the Wolfe Research Global Auto Conference. The IPO lock-up and market stand-off agreements executed by Instacart's (CART) directors, officers, and holders of convertible shares will expire. Oppenheimer thinks the lockup expiration could end up being a positive share price catalyst. The go-shop period expires on Restaurant Brands International's (QSR) deal for Carrols Restaurant Group (TAST). Restaurant Brands International (QSR) will host an investor event with CEO Josh Kobza and Executive Chairman Patrick Doyle at the New York Stock Exchange. Wall Street on Wednesday rebounded from its previous session in which hotter-than-expected consumer inflation data sent U.S. stocks reeling. The Nasdaq (COMP.IND) led the three major averages rising 1.30%. The S&P 500 (SP500) added 0.96%, while the Dow (DJI) climbed 0.40%. Of the 11 S&P sectors, nine ended in the green. Now let’s take a look at the markets as of 6 am. Ahead of the opening bell today, Dow, S&P and Nasdaq futures are in the green. The Dow is up 0.2%, the S & P 500 is up 0.2% and the Nasdaq is up 0.15%. Crude oil is down 0.7% at more than $76 per barrel. Bitcoin is up 1.4% more than $52,000. In the world markets, the FTSE 100 is up 0.1% and the DAX is up 0.7%. The biggest movers for the day premarket: Tripadvisor (NASDAQ:TRIP) is up 6% after its Q4 results surpassed market estimates on both top and bottom lines. On today’s economic calendar: 10:00 Housing Market Index This article was written by "
}