{
    "title": "Could Investing $20,000 in Nvidia Make You a Millionaire?",
    "date": "2/19/2024",
    "url": "https://finance.yahoo.com/news/could-investing-20-000-nvidia-160000929.html",
    "text": "Nvidia (NASDAQ: NVDA) has turned out to be a top investment over the past decade. A $20,000 investment made in the semiconductor giant 10 years ago would be worth more than $3.4 million today -- up by around 170 times in value. It is also worth noting that the company has taken less than a decade to turn a $20,000 investment into precisely a $1 million. Assuming you bought $20,000 worth of Nvidia stock on Aug. 1, 2016, your investment would now be worth just into seven figures. So, if you have $20,000 in investible cash after paying your bills, retiring any high-interest debt, and building up an emergency fund large enough to cover you in rough times, should you be putting that money into Nvidia in the hopes that it can replicate its past performance and make you a millionaire? Nvidia's business has grown tremendously in the past eight years. In its fiscal 2016 (which ended Jan. 31, 2016), the company reported $5 billion in revenue. When the company releases its fourth-quarter fiscal 2024 results later this week, its annual revenue is expected to come in at almost $60 billion. That stunning 12-fold increase in revenue in eight years means that Nvidia's revenue increased at a compound annual rate of 36%. This impressive growth can be attributed to the company's dominant position in the market for discrete graphics processing units (GPUs), which were originally used in gaming personal computers (PCs) to improve the graphics performance of games. Its graphics cards are now deployed in multiple areas ranging from automotive to data centers to digital twins. The market has handsomely rewarded Nvidia for its growth, and it is now the world's fourth-largest company, boasting a market capitalization of $1.82 trillion. That's a massive step up from the company's $30 billion market cap back in August 2016. And the company still has some terrific growth drivers that could help it maintain a solid pace of growth in the future. Artificial intelligence (AI) is the first of those catalysts. The market for AI chips could be worth $305 billion in 2030 as compared to $29 billion in 2022. With a market share of 92% in that niche, Nvidia is in a prime position to capitalize. Meanwhile, the company has been gaining ground in the multibillion-dollar market for digital twins as well. Throw in other catalysts, such as the cloud gaming market, and it is easy to see why consensus estimates are for the company's earnings to increase at a compound annual rate of just over 100% for the next five years. Even better, Nvidia management pointed out in its investor day presentation a couple of years ago that it sees revenue opportunities worth a whopping $1 trillion across its various end markets. Given that Nvidia's fiscal 2024 revenue is set to come in at just under $60 billion, it can be said that it hasn't scratched even 10% of its total addressable market. So, based on Nvidia's total addressable market estimate, the possibility of the company's revenue growing 12-fold again cannot be ruled out. However, how long that would take or whether it's really going to happen are in question, and something similar can be said about the stock's ability to turn a $20,000 investment into a $1 million stake. From its current market cap of around $1.8 trillion, a 50x jump would take its market cap to an astronomical $90 trillion. That seems absurd -- the entire global economy was worth an estimated $105 trillion last year. Given that the global gross domestic product (GDP) is expected to grow at an annual rate of 2.2% a year through 2030, the global economy could be worth around $122 trillion by the end of the decade. Expecting Nvidia to account for almost three-fourths of the global economy is not reasonable. However, it is worth noting that global GDP has increased by just over 1,800% in the past 50 years. Assuming that the global economy clocks 1,000% growth in the next 50 years, global GDP could reach $1.155 quadrillion. In that context, a $90 trillion market cap looks less impossible for Nvidia. If continues to exist for another half-century and remains the dominant supplier in its end markets thanks to its solid product development moves, it might turn a $20,000 investment made today into $1 million, eventually. Of course, if Nvidia fails to keep up with its competitors over those decades, it may not be able to give investors the returns they may be expecting. However, Nvidia's outlook for the next few years seems bright enough to warrant an investment. We have already seen how fast Nvidia is growing. More importantly, analysts are anticipating eye-popping bottom-line growth from the company thanks to its solid position in the AI chip market and the other catalysts it is sitting on. As a result, it won't be surprising to see Nvidia's stock delivering healthy returns over the next five years. Given that Nvidia is trading at 35 times forward earnings as compared to its five-year average earnings multiple of 42, now would be a good time to buy this top AI stock before it surges higher. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Could Investing $20,000 in Nvidia Make You a Millionaire? was originally published by The Motley Fool Related Quotes "
}