{
    "title": "Is Nvidia Stock a Buy Now?",
    "date": "2/3/2024",
    "url": "https://www.fool.com/investing/2024/02/03/is-nvidia-stock-a-buy-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) won over Wall Street last year, illustrated by its more than 210% stock growth since January 2023. The company's years of dominance in graphics processing units (GPUs) perfectly positioned it to profit significantly from a boom in artificial intelligence (AI) as demand for the chips skyrocketed. As a result, Nvidia's quarterly revenue and free cash flow are up 200% and 360%, respectively, in the last 12 months. Nvidia's meteoric rise has some analysts questioning whether the company has much more to offer investors in 2024. However, trends in the chip market indicate Nvidia will have little problem retaining its leading market share in AI GPUs, despite new offerings from Advanced Micro Devices and Intel. Meanwhile, the AI market is nowhere near hitting its ceiling, projected to expand at a compound annual growth rate of 37% until at least 2030. The sector's potential indicates GPU demand is likely to continue rising for the foreseeable future, with Nvidia well equipped to continue enjoying significant gains from AI. So here's why Nvidia remains an attractive buy right now. Nvidia's success in the AI chip market has led to countless tech firms announcing ventures into the industry. Leading chipmakers AMD and Intel plan to begin shipping new GPUs soon in an attempt to challenge Nvidia's market share. Meanwhile, companies new to the sector are also joining in, with Amazon and Microsoft announcing new AI chips last year. However, market trends suggest Nvidia's supremacy will be challenging for competitors to overcome. The company has held an over 80% market share in desktop GPUs for years, despite AMD's and Intel's presence in the sector. Intel only entered the industry last year, while AMD's history in desktop GPUs spans decades. Still, AMD's GPUs only account for about 10% of the market. A similar situation has occurred in another area of the chip market. Intel was a king in central processing units (CPUs) for years, with an 82% market share at the start of 2017 when AMD landed on the scene with its Ryzen line of CPUs. AMD has managed to steal a significant share from Intel since then. However, Intel is still responsible for most of the CPU market, with its share above 60% and AMD's at 36%. Nvidia's estimated 80% to 95% market share in AI GPUs could falter slightly as competition heats up. However, history indicates the company will retain its overall lead and continue to see major gains from AI for years. Nvidia stunned Wall Street last year, posting multiple quarters of record earnings. In the third quarter of fiscal 2024, the company's revenue soared 206% year over year to $18 billion. Meanwhile, operating income increased by more than 1,600% to $10 billion. While a spike in AI GPU sales is mainly responsible for Nvidia's stellar financial growth, the chipmaker is also profiting from an improving PC market. Spikes in inflation prompted steep declines in PC sales, with shipments dipping 16% in 2022 and continuing to fall for most of 2023. However, recent reports indicate the market is finally showing signs of recovery. According to Gartner, PC shipments popped 0.3% in Q4 2023, marking the first such increase in over a year. Market improvements have reflected in Nvidia's sales, with its PC-centered gaming segment reporting an 81% rise in revenue in Q3 2024 (which ended October 2023). A leading role in AI and a recovering PC market suggests Nvidia has a strong outlook in the coming years, and EPS estimates seem to support this.  Data by YCharts This chart shows Nvidia's earnings could hit $24 per share by fiscal 2026. Multiplying that figure by its forward price-to-earnings ratio of 51 yields a stock price of $1,224. Considering its current position, that projection would see Nvidia's stock rise 96% over the next two years. It's a tall order, but based on reasonable financial forecasts. The company may not replicate last year's growth, but Nvidia still has much to offer new investors and is an exciting buy right now. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Microsoft, and Nvidia. The Motley Fool recommends Gartner and Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}