{
    "title": "2 'Strong-Buy'-Rated Russell 2000 Stocks to Scoop Up Now",
    "date": "2/25/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/NVDA/pressreleases/24334293/2-strong-buy-rated-russell-2000-stocks-to-scoop-up-now/",
    "text": "The large- and mid-cap players have received a lot of attention since the artificial intelligence (AI) rush began in 2023. Most tech titans, including Microsoft (MSFT), Amazon (AMZN), and Nvidia (NVDA), recently reported better-than-expected quarterly results, and their stock prices have soared this year. However, the Russell 2000 Index (RUT), which tracks the performance of a large basket of small-cap companies, should not be overlooked. Two small-cap companies that I believe investors should be curious about right now are semiconductor company Semtech (SMTC) and energy company Matador Resources (MTDR), as Wall Street sees significant upside for these two stocks this year. Investing in innovative tech companies as the AI era progresses is a wise decision. Meanwhile, including energy stocks in your portfolio will provide diversification as global energy demand continues to increase. Let's find out more about why Semtech and Matador Resources are attractive investments now. Founded in 1960, Semtech focuses on developing high-performance analog and mixed-signal semiconductors that can be used for a range of applications. Semtech may not be directly competing with the larger players in the semiconductor industry. However, as AI advances, Semtech has the opportunity to expand its business on a larger scale. In the third quarter of fiscal 2024, Semtech's net sales increased 13.1% year on year to $200.9 million. However, adjusted earnings per share (EPS) fell to $0.02, down from $0.65 in the year-ago quarter. Both revenue and earnings surpassed analysts' expectations. In fact, analysts expected the company to report a loss for the quarter, but it reported a profit. One of Semtech's key products is LoRa (Long Range), a low-power wide-area technology. It has made significant headway in the Internet of Things (IoT) space, offering long-range, low-power connectivity to smart devices. Management stated in the Q3 earnings call that many European-based utilities are interested in adopting LoRa-based solutions. Furthermore, its broad product portfolio serves a wide range of markets, including data centers, automotive, and medical. Recently, the company announced its new product, the AirLink XR60 5G Router Solution, which will provide “5G and Wi-Fi 6 performance in an ultra-compact and ultra-rugged design for highly demanding environments.” Looking ahead, management expects macroeconomic conditions to cause a drop in net sales in Q4 to around $190 million (plus or minus $10 million). Furthermore, EPS is projected to range from a loss of $0.05 to a profit of $0.06. By comparison, analysts predict a loss of $0.04 per share on revenue of $190.7 million in Q4. Analysts expect Semtech to continue reporting profits into fiscal 2024. Overall, Wall Street rates Semtech stock a “strong buy.” Out of the 12 analysts that cover SMTC, 10 rate it a “strong buy,” while one recommends a “moderate buy,” and one suggests a “hold.” While Semtech stock is down 6.2% YTD, analysts' average price target of $31.40 suggests that Wall Street sees potential upside of about 54.6% over the next 12 months. Wall Street has assigned a high target price of $42 for SMTC, which could mean a potential price jump of 106% from current levels. Founded in 2003, Matador Resources has become a key player in oil (CLJ24) and natural gas (NGH24) exploration. The company currently operates seven drilling rigs in the U.S. Matador’s shares have returned 236.6% over the last five years. The outstanding revenue growth from $899.5 million in 2018 to $3.06 billion in 2022 mirrors the stock price performance. Earnings have increased at a compounded annual growth rate of 23.9% during the same period. On a YTD basis, Matador stock has gained 5.8%, compared to the S&P 500’s ($SPX) gain of 7.3%. In the recent third quarter, Matador produced over 135,000 barrels of oil and natural gas equivalent (BOE) per day, claiming it to be its best quarter of total production. Matador, like most energy companies, pays quarterly dividends. It yields 1.33%, while the energy sector average is 4.24%. Although the yield isn't particularly appealing, the company's dividend payments have been consistent, with a recent increase from $0.15 to $0.60 per share. This is the fourth dividend increase since Matador began paying dividends in 2021. Furthermore, the forward payout ratio of 9.5% indicates plenty of room for dividend growth. At the end of the quarter, the company's adjusted free cash flow was $144.6 million. Aside from dividend payments, the company uses its free cash flow to pay down debt and invest in acquisitions. Management stated that positive FCF has helped the company increase its \"acreage position to over 150,000 net acres in the Delaware Basin.\" The company also plans to add an eighth rig in the first quarter of 2024. Matador expects to finish the year strong, with increased production and debt repayments. Approximately 145,000 BOE per day are expected in the fourth quarter. Analysts are looking for revenue to increase by 13% to $799 million in the fourth quarter. Revenue and earnings are expected to rise by 20.8% and 1.5%, respectively, in 2024. Turning to Wall Street, Matador stock is a \"strong buy\" among analysts. Out of the 10 analysts covering the stock, seven rate it a “strong buy,” two recommend a “moderate buy,” and one suggests a “hold.” The average analyst target price for the stock is $70.09, which implies a potential upside of 15.4% in the next 12 months. The high estimate for MTDR suggests the stock could go as high as 35% from current levels. Provided Content: Content provided by Barchart. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Nvidia Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}