{
    "title": "Nvidia's Stock Is At A Point Of Exhaustion (NASDAQ:NVDA)",
    "date": "2/8/2024",
    "url": "https://seekingalpha.com/article/4668639-nvidia-stock-at-point-of-exhaustion",
    "text": "Justin Sullivan Justin Sullivan Nvidia's (NASDAQ:NVDA) shares have rocketed higher in recent weeks, rightly or wrongly. The stock has been the biggest contributor to the S&P 500 and the broader market success in 2024. Now, Nvidia's stock appears to be showing signs of extreme stress and fatigue. Whether real long-term or not, the AI hype has certainly shown up in Nvidia's stock price, with analysts' earnings and revenue estimates rocketing higher since May, when the company first issued very strong guidance on its new AI products. Bloomberg Bloomberg However, some of its valuation and metrics are starting to look like the Nvidia of old, with a price-to-sales ratio for the next twelve months now at 35, back to those old 2021 levels, and a PE ratio of 33.5. It is quite possible that the valuation makes sense if Nvidia is actually able to put up the growth rates that analysts expect over the next couple of years. Bloomberg Bloomberg However, much of the stock price movement appears to be options-related rather than fundamentally driven, at least that part of the rally that has allowed the company's market cap to climb by almost $650 billion in the last 120 trading days, or more than the size of Tesla (TSLA). Bloomberg Bloomberg But what is clear is that since November 1, the put/call ratio has taken a noticeable turn lower, indicating that call volumes have been higher than put volumes regularly. The ratio averaged 0.8 from July to October and then dropped to an average of 0.66 from November until now. This tells us that there are more calls trading relative to puts since the big run higher in the stock at the start of November. Bloomberg Bloomberg But more recently, what has also become clear is that as the stock has been ripping higher, we have seen the implied volatility of the 95% and 105% moneyness 1-month options implied volatility rip higher. Bloomberg Bloomberg The story's underlying message comes from these implied volatility levels that have ripped higher, not from the number of puts and calls. The rising implied volatility levels show that the skew has been towards the calls. As the stock has been rising, the implied volatility of the calls has been rising faster than the puts, which is determined by taking the implied volatility of the 95% 1-month options and subtracting it from the 105% 1-month options. Bloomberg Bloomberg This suggests that instead of the rising stock price bringing in people betting on the stock price to fall or to hedge their profits, the rising stock has instead brought in more investors looking for the stock price to continue to rise. However, these events tend to create self-inflected wounds over time because the higher the implied volatility rises, the more costly it becomes to continue trading the calls, and the more likely the trade will run out of steam. For the bullish betting to pay off, the stock needs to continue to rise, and when implied volatility is low, the options are cheap. Still, as the implied volatility rises, options become more expensive, so fewer options trade. But for the trade to work, there needs to be a continued flow of call options trading because when an investor buys a call option, in most cases, the seller of the options is the market maker. Because the market maker sold the call options, the market maker is now effectively short Nvidia, and so to hedge their position, the market maker is likely to go out and buy the stock in order to remain neutral. The process of the market maker buying shares can end up pushing the shares higher. But as the implied volume of the calls rises and the cost becomes more expensive, fewer calls trade. With fewer calls, market makers don't have to keep adding to their hedges as much, which leads to the trade's momentum fading. Or worse, if the stock declines, the market maker may start to unwind some of their long hedges. While it may be early in the process, the early signs suggest that Nvidia's rising implied volatility levels are starting to result in daily call volumes falling, indicating that calls are no longer cheap enough to make a profit. Bloomberg Bloomberg Additionally, there is a lot of call gamma at $700 which could be acting a resistance level for the stock, for the expiration date on February 16. This is likely a level that brings out sellers of calls that have gone in the money, and investors are looking to monetize. Bloomberg Bloomberg So, at this point of the game, it is quite possible that the stock's higher run is nearing a point of exhaustion and that a big higher run may be closer to its end at this point in the game. This article was written by Mott Capital is managed by Michael Kramer, a former buy-side trader, analyst, and portfolio manager with 30 years of experience tracking market fundamentals. He focuses on long-only macro themes and studies trends and unusual options activities to identify long-term thematic growth opportunities. Since its inception in 2016, the Mott Capital Management portfolio is up 115.4% using the fundamentals and macro trend-based approach to trading. Michael Kramer leads the investing group Reading the Markets, where he helps a devoted following of members to better understand what is driving trading and where the market is likely heading, both the short and long-term. Features of the investing group include: daily written commentary and videos analyzing the driving factors behind price action; general macro trend education to help members make well-informed decisions based on market conditions, interest rates, currency movements and how they all interact; chat for questions and community dialogue; and regular Zoom videos sessions to discuss current ideas and answer questions. The level of access RTM subscribers and the expertise of the source are unprecedented given that the subscription price is a fraction of similar technical coaching and mentoring services. Learn more here. Learn more. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Charts used with the permission of Bloomberg Finance L.P. This report contains independent commentary to be used for informational and educational purposes only. Michael Kramer is a member and investment adviser representative with Mott Capital Management. Mr. Kramer is not affiliated with this company and does not serve on the board of any related company that issued this stock. All opinions and analyses presented by Michael Kramer in this analysis or market report are solely Michael Kramer’s views. Readers should not treat any opinion, viewpoint, or prediction expressed by Michael Kramer as a specific solicitation or recommendation to buy or sell a particular security or follow a particular strategy. Michael Kramer’s analyses are based upon information and independent research that he considers reliable, but neither Michael Kramer nor Mott Capital Management guarantees its completeness or accuracy, and it should not be relied upon as such. Michael Kramer is not under any obligation to update or correct any information presented in his analyses. Mr. Kramer’s statements, guidance, and opinions are subject to change without notice. Past performance is not indicative of future results. Neither Michael Kramer nor Mott Capital Management guarantees any specific outcome or profit. You should be aware of the real risk of loss in following any strategy or investment commentary presented in this analysis. Strategies or investments discussed may fluctuate in price or value. Investments or strategies mentioned in this analysis may not be suitable for you. This material does not consider your particular investment objectives, financial situation, or needs and is not intended as a recommendation appropriate for you. You must make an independent decision regarding investments or strategies in this analysis. Upon request, the advisor will provide a list of all recommendations made during the past twelve months. Before acting on information in this analysis, you should consider whether it is suitable for your circumstances and strongly consider seeking advice from your own financial or investment adviser to determine the suitability of any investment. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}