{
    "title": "Could Broadcom Become the Next Nvidia?",
    "date": "2/17/2024",
    "url": "https://www.fool.com/investing/2024/02/17/could-broadcom-become-the-next-nvidia/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) became the world's first trillion-dollar chipmaker in 2023, and it's now worth $1.8 trillion. That marks a whopping gain of 1,810% in just five years. Nvidia's historic run was fueled by the rapid growth of the artificial intelligence (AI) market, which sparked brisk sales of its high-end data center GPUs for processing AI tasks. Nvidia's multibagger gains are impressive, but could Broadcom (AVGO 0.51%) -- which rallied nearly 350% over the past five years and is worth about $590 billion -- follow its lead and become the next hot chipmaker by the end of the decade? Image source: Getty Images. Broadcom is a more diversified company than Nvidia. Its chipmaking business produces a wide range of wireless, networking, optical, data storage, and industrial chips. Its software segment provides infrastructure, cloud, and cybersecurity services. In fiscal 2023 (which ended last November), Broadcom generated 79% of its revenue from its chipmaking business and 21% from its software division. It also generated a fifth of its total revenue from Apple, which holds a multiyear agreement to purchase its wireless, radio frequency, and mobile chips. Broadcom might seem too dependent on the cyclical chipmaking market and Apple's orders, but it expects its recent acquisition of cloud giant VMware to expand its software segment to account for about half of its top line. Like Nvidia, Broadcom also expects the secular expansion of the generative AI market -- which was responsible for 20% of its semiconductor revenue in the fourth quarter of fiscal 2023 -- to fuel its long-term growth. Nvidia's business model is simpler than Broadcom's. In its latest quarter, it generated 80% of its revenue from its high-growth data center division. Its gaming GPU business accounted for 16% of its revenue, while 4% came from professional visualization, automotive, and OEM chips. Nvidia develops higher-end chips than Broadcom, but they're both \"fabless\" chipmakers that outsource their production to third-party foundries like Taiwan Semiconductor Manufacturing. Today's Broadcom was actually called Avago Technologies until 2016. That's the year Avago acquired the original Broadcom and inherited its more well-established brand. Before buying Broadcom, Avago repeatedly grew through big acquisitions. As the \"new\" Broadcom, it continued to expand inorganically by buying CA Technologies, Symantec's enterprise security unit, and VMware to construct its software business. Broadcom's organic growth and ongoing acquisitions enabled it to increase its annual revenue at a compound annual growth rate (CAGR) of 15% from fiscal 2016 to fiscal 2023. Its adjusted earnings per share (EPS) rose at a CAGR of 21%. From fiscal 2023 to fiscal 2026, analysts expect its revenue and earnings to climb at CAGRs of 19% and 18%, respectively, as it integrates VMware and continues to expand its chipmaking and software divisions. By comparison, Nvidia grew its revenue and adjusted EPS at a faster CAGR of 21% and 23%, respectively, from fiscal 2017 to fiscal 2023 (which ended last January). From fiscal 2023 to fiscal 2026, analysts expect its revenue and earnings to increase at a CAGR of 61% and 133%, respectively, as the AI market continues to expand. We should take all of those estimates with a grain of salt, but Nvidia should grow much faster than Broadcom for the foreseeable future. Broadcom also seems more dedicated to generating stable double-digit revenue and earnings growth from its diversified portfolio instead of chasing breakneck expansion from a smaller selection of chips like Nvidia. That said, Broadcom could still become a trillion-dollar chipmaker by the end of the decade if it simply maintains its current valuation and growth rates. Its stock looks reasonably valued today at just 27 times forward earnings -- and if it maintains that multiple, matches analysts' estimates, and increases its earnings at a stable CAGR of 15% from fiscal 2026 to fiscal 2030, its market cap could easily exceed $1.2 trillion by the final year. Therefore, Broadcom might not ever attract as much attention as Nvidia, but it's still one of the few promising chipmakers that has a shot at following Nvidia's lead into the four-comma club. Leo Sun has positions in Apple. The Motley Fool has positions in and recommends Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}