{
    "title": "Nvidia Stock: Sovereign Nations Next AI Customers",
    "date": "3/22/2024",
    "url": "https://www.investors.com/news/technology/nvidia-stock-sovereign-nations-next-ai-customers/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Internet cloud service providers have comprised the first wave of buyers of artificial intelligence systems from Nvidia (NVDA). The next wave is likely to be sovereign nations, a Wall Street analyst says. Nvidia stock rose Friday. \"Nvidia sits on the cusp of an entirely new wave of demand from global enterprises and sovereigns — with each sovereign potentially as big as a large U.S. cloud customer,\" UBS analyst Timothy Arcuri said in a client note. At its GTC 2024 conference this week, Nvidia mentioned Japan, Malaysia, South Korea and Sweden as customers, Arcuri said. The company also mentioned the Middle East market, where Saudi Arabia and United Arab Emirates are likely buyers, he said. Those are in addition to major projects underway with Singapore, Switzerland and France. Arcuri reiterated his buy rating on Nvidia stock and raised his price target to 1,000 from 800. On the stock market today, Nvidia stock rose 3.1% to close at 942.89. Nvidia shares have risen for five consecutive trading days. The graphics-chip maker saw its stock surge higher this week on news from its GTC 2024 conference. Arcuri predicts Nvidia will generate sales of $112.5 billion in calendar 2024, up 94% from last year. Analysts polled by FactSet are looking for sales of $105.6 billion this year. \"We now see another solid growth year in calendar 2025 with revenue approaching $150 billion (about 30% growth),\" he said. Wall Street is targeting sales of $131.5 billion next year. Nvidia stock is on five IBD stock lists: IBD 50, Leaderboard, Big Cap 20, Sector Leaders and Tech Leaders. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: High Hopes For Synopsys Stock As AI Spotlights Chip Design Apple Stock Drops As Justice Department Sues iPhone Maker Broadcom Stock Rallies After Tech Firm Gains New AI Chip Customer MarketSurge: Research, Charts, Data And Coaching All In One Place See Stocks On The List Of Leaders Near A Buy Point 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}