{
    "title": "Missed Out on Nvidia? My Best Chip Stock to Buy and Hold",
    "date": "3/11/2024",
    "url": "https://www.fool.ca/2024/03/11/missed-out-on-nvidia-my-best-chip-stock-to-buy-and-hold/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Nvidia stock surged 500% in 14 months on the generative AI boom. If you missed the rally, you could consider buying this chip stock. Image source: Getty Images The ChatGPT sensation in 2023 reversed the 2022 tech bubble burst for Nvidia (NASDAQ:NVDA), struggling with huge declines in the PC and gaming markets. Nvidia stock surged almost 500% since January 2023, making new milestones of US$400 and US$800, way above its 2021 crypto peak of around US$330. If you missed Nvidia’s stock price rally, you could still make up for it by buying Advanced Micro Devices (NASDAQ:AMD) stock. AMD stock has surged 182% since January 2023 and is yet to realize the sales growth from its artificial intelligence (AI) portfolio. After PC, server, and mobile computing, we are entering the next age of AI and accelerated computing. AI computing processes large amounts of data in real time and develops inferences from it to deliver actionable insights. This level of computing needs specialized chips and supporting software that can handle such large amounts of computing load. Nvidia’s graphics processing units (GPUs) remain unbeatable in AI, gaming, and edge computing. However, AMD has also been developing a complete end-to-end AI infrastructure, comprising AI chips for clouds, data centres, servers, PCs, and embedded devices. AMD has a full suite of competitive central processing units (CPUs) used for general-purpose computing, GPUs for accelerated computing, and data processing units (DPUs) for moving data around the data centre. Like Nvidia, AMD’s data centre segment’s revenue has surpassed the revenue of the PC and gaming segments, marking the age of AI. However, AMD has not yet realized the sales from the AI boom. AMD’s data centre revenue surged 7% to US$6.5 billion in full-year 2023, while Nvidia’s data centre revenue surged 409% to US$18.4 billion in just the fourth quarter of 2023. AMD may not realize the same growth as Nvidia, but it is chasing the same AI boom as Nvidia. Some analysts expect Nvidia’s stock price to see some correction as the AI GPU shortage eases. AMD could also see some correction. But these are the stocks to buy and hold for the long term, irrespective of the market. Here’s why. A PC, mobile phone, car, or software can face disruption from technological advancements. Mobile phones replaced PCs in many areas, like accessing the internet. But a chip is the starting point of any technological innovation. They are here to stay and facilitate disruptive technological advancements through more powerful and efficient chips. Semiconductors are the most complex pieces of technology, and mastering them takes decades of research. There are very few chip companies that can make advanced chips. Nvidia and AMD are the only two that offer high-performance discrete GPUs. AMD and Intel are the only two companies with high-performance PC and server CPUs. This intellectual property (IP) advantage puts AMD and Nvidia at the sweet spot for long-term growth. In this digital age, work is ongoing on several technology forms like AI, robotics, drones, autonomous cars, satellites, and space research. All of it needs high-performance computing of AMD and Nvidia chips. AMD is set to ride the AI wave. It is developing the networking capabilities to facilitate the AI ecosystem. Nvidia already rode the gaming and crypto wave and is now riding the AI wave. It also has a competitive advantage in the future technologies of autonomous cars and AI at the edge. In the next 10 years, US$880 might look cheap for one stock of Nvidia. Similarly, US$200 might look like a bargain for a stock of AMD 10 years from now. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 29, 2024 | Puja Tayal Have you given a thought to how you plan to retire? Your decision depends significantly on how much your investments… Read more » March 29, 2024 | Andrew Button AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. Read more » March 29, 2024 | Andrew Button Hot AI stocks like Open Text Corp (TSX:OTEX) have been rallying lately. Read more » March 29, 2024 | Amy Legate-Wolfe Hut stock (TSX:HUT) surged by 23% after the company reported strong earnings, and even more growth occurred in 2024. Read more » March 28, 2024 | Puja Tayal Nvidia stock has made investors millionaires in the last 10 years. Is it too late to invest to become a… Read more » March 28, 2024 | Chris MacDonald There are plenty of growth stocks in the market worth considering, but Shopify (TSX:SHOP) looks like one of the best… Read more » March 28, 2024 | Puja Tayal The TSX has been favouring tech stocks, but not this one. However, it has the potential to trounce the market… Read more » March 27, 2024 | Rajiv Nanjapla These three under-$20 stocks offer excellent buying opportunities for long-term investors. Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}