{
    "title": null,
    "date": "3/28/2024",
    "url": "https://www.investors.com/research/magnificent-seven-stocks-to-buy-and-and-watch/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Dubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon, Nvidia, Meta Platforms and Tesla lived up to their name in 2023 with big gains. But the first quarter of 2024 has shown a big divergence of returns. The Magnificent Seven stocks are among the best stocks to watch on the stock market today. Due to their outsized market capitalizations, Magnificent Seven stocks hold a disproportionate influence on the market-cap weighted Nasdaq composite and S&P 500 indexes. For an in-depth look at this issue, check out IBD's page on the Magnificent Seven weightings, market capitalizations and the companies' latest news stories. Amazon (AMZN) is sharply out of buy range above a cup base's 145.86 buy point and nearing new highs, as shares rose 0.5% Thursday. In recent weeks, Amazon reported quarterly results, beating expectations for both earnings and revenue. Through its Amazon Bedrock platform, the e-commerce and cloud giant provides a fully managed service offering a choice of high-performing foundation models (FMs) from leading AI companies like AI21 Labs, Anthropic, Cohere, Meta and Stability AI. Stock Market ETF Strategy And How To Invest Google parent Alphabet (GOOGL) is building a new base, as it trades back above its 50-day line after gains in recent sessions. Google moved up 0.2% Thursday, still near a 153.78 buy point. Alphabet surged on March 18 after Bloomberg reported that Apple is in talks with the Google parent over licensing its \"Gemini\" artificial intelligence  training model for use in iPhones. On Jan. 30, Alphabet reported fourth-quarter earnings and revenue that topped analyst estimates. But shares tumbled as the search giant's core advertising business slightly missed views. Among the Magnificent Seven stocks, Nvidia (NVDA) is the top performer in 2024, with a scorching 87% year-to-date return through March 7. The AI giant is sharply extended past a new flat base's 505.48 buy point after a Jan. 8 breakout move. Shares rose 0.1% Thursday, looking to bounce back from Wednesday's losses. Nvidia is an IBD Leaderboard stock. On Feb. 21, Nvidia beat Wall Street's targets for its fiscal fourth quarter and guided higher than views for the current period. Nvidia's Q4 report marked its third straight quarter of triple-digit percentage growth in sales and earnings. And its sales growth has accelerated for the past three quarters. \"Accelerated computing and generative AI have hit the tipping point,\" Chief Executive Jensen Huang said in a news release. \"Demand is surging worldwide across companies, industries and nations.\" Be sure to read how to adjust to changing market conditions, with IBD's new exposure levels. Tesla (TSLA) skidded 2.3% Thursday, as the stock faces resistance at its pivotal 50-day line. On Jan. 24, the electric-vehicle giant said that earnings fell 40% to 71 cents per share while revenue totaled $25.17 billion, up 3.5% vs. the year-ago period. Wall Street expected earnings of 73 cents a share on revenue of $25.62 billion. For 2023, Tesla earnings fell 23% to $3.12 a share while revenue increased 19% to $96.77 billion vs. estimates of $3.05 on sales of $97.5 billion. Two Dow Jones names among the Magnificent Seven stocks, Apple (AAPL) and Microsoft (MSFT) traded lower on the stock market today. Apple stock dropped 0.7% Thursday. Shares remain below their 200-day line. On Feb. 1, Apple beat Wall Street's targets for its fiscal first quarter, thanks to iPhone 15 handset sales and services growth. According to MacRumors and other outlets, Apple could have a generative AI feature — internally known as Apple GPT — available on the iPhone and iPad sometime late next year. Meanwhile, Microsoft stock is rallying from support around its 50-day line, a key area to watch. The stock moved down 0.1% Thursday, just off new highs. On Jan. 30, Microsoft beat Wall Street's targets for its fiscal second quarter thanks to strong cloud computing business. IBD Live: A New Tool For Daily Stock Market Analysis Shares of Meta Platforms (META) are about 5% off their new highs after modest losses in recent weeks. Meta stock fell 1% Thursday. In early February, Meta reported better-than-expected fourth-quarter earnings and announced plans for its first-ever dividend. META stock boasts a perfect 99 IBD Composite Rating, per the IBD Stock Checkup. In recent months, Chief Executive Mark Zuckerberg said that Threads is now available to users in the European Union. The Facebook parent company launched Threads as a separate app in July. It is a competitor to the Elon Musk-owned X, formerly Twitter. The European rollout was reportedly delayed by regulatory uncertainty in the EU over the use of personal data on the app. YOU MAY ALSO LIKE: Magnificent Seven Weighting And News Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Nvidia Partner Rides AI Megatrends To 3,594% Gain — With More To Come 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}