{
    "title": "Figure AI valued at $2.6 billion as Jeff Bezos, OpenAI, Nvidia join funding",
    "date": "3/2/2024",
    "url": "https://techstory.in/figure-ai-valued-at-2-6-billion-as-jeff-bezos-openai-nvidia-join-funding/",
    "text": "Credits: The India Bizz In a recent investment round, Figure AI, a 2022-founded company, raised an astounding $675 million, taking a significant step toward changing the robotics scene. The startup is working to develop humanoid robots that can perform unpleasant and hazardous tasks. It has the support of major players in the industry, including Microsoft, Nvidia, and Jeff Bezos.  Image Credits: CNBC The primary objective of Figure AI’s endeavor is the creation of Figure 01, a humanoid robot capable of remarkably accurate gesture imitation. In sectors including manufacturing, shipping, transportation, warehousing, and retail where labor is in short supply, the company plans to deploy these robots. The corporation has made an interesting vow to refrain from using its technology for military purposes, which highlights its dedication to using cutting edge technology for good purposes. This week, Figure AI gave the world a peek into the capabilities of Figure 01 through a captivating video. The robot, tethered for now, confidently strolled on two legs, deftly using its five-fingered hands to pick up a plastic crate. With graceful steps, it transported the crate to a conveyor belt, showcasing the ambition of Figure AI to have these robots autonomously perform everyday tasks – a glimpse into a future where machines seamlessly integrate into our daily lives. However, Figure AI is not alone in this race for humanoid supremacy. Agility Robotics, backed by Amazon, plans to churn out up to 10,000 of its Digit robots annually. Tesla is also in the game with its humanoid robot project, Optimus. The field is robust, featuring stalwarts like Boston Dynamics and newer entrants like Norwegian startup 1X Technologies, recently boosted by a $100 million investment with backing from OpenAI. The competition, fueled by projections of a $38 billion market by 2035, underscores the industry’s dynamism and potential. As the humanoid robotics market is still in its infancy, industry experts, like Tom Andersson of STIQ Ltd., caution that several breakthroughs are needed before widespread deployment can occur. The industry is experiencing a surge of interest, but it will require “several step changes” before humanoid robots become ubiquitous. This acknowledgment reflects the cautious optimism within the sector, acknowledging both the potential and the hurdles to overcome. Figure AI’s recent funding round is not just about financial backing but also strategic partnerships. The collaboration with OpenAI, the brains behind ChatGPT, to develop next-gen AI models tailored for humanoid robots, marks a significant step towards enhancing the capabilities of Figure 01. Additionally, leveraging Microsoft’s Azure cloud services for AI infrastructure emphasizes the crucial role of advanced computing resources in the development and training of these sophisticated robots. The impressive $675 million funding round reads like a who’s who of the tech and investment world. Jeff Bezos, Nvidia, Microsoft, Intel’s venture fund, Cathie Wood’s Ark Invest, Align Ventures – the list goes on. This not only injects significant capital into Figure AI but also signals a collective belief in the potential of humanoid robotics. With these resources, Figure AI is poised to accelerate its research and development efforts. Figure AI’s recent funding achievement is more than just a financial win; it demonstrates the collaborative efforts defining the future of robotics. With visionary investors, strong alliances, and a focus on overcoming market difficulties, Figure AI is traversing the tricky landscape of humanoid robotics. As competition heats up and technology advances, we’re on the verge of witnessing a paradigm change in which humanoid robots seamlessly integrate into various aspects of our lives, posing both difficulties and opportunities that will define the next era of innovation. Ishaan is a student at Sri Venkateswara College, University of Delhi. Throughout his school days, he has been an avid reader, writer and speaker. He has led multiple sessions concerning varying issues under his non profit organization: 'Candescentt'. With unbiased opinions and varying sources, he reports all sides of any topic relating to the tech industry. In a surprising turn of events, Google has revealed its intention to shut down Google Podcasts app in the U.S., marking a significant change for its user base.... The recent acquisition of Borderlands developer Gearbox Entertainment by Take-Two Interactive from Embracer Group has already led to layoffs within the company. Let's delve into the aftermath of... Elon Musk, the well-known businessman and inspirational, recently made news once more, this time for his wild predictions on the potential applications of AI chatbots. Musk, who is...  Make data loading to flash drives a simple process. Nexcopy USB Duplicator Systems. Tech and Business News from around the world. Follow along for latest in the world of Tech, AI, Crypto, EVs, Business Personalities and more. reach us at [email protected] © 2024 Techstory.in © 2024 Techstory.in "
}