{
    "title": "Nvidia’s stock continues to hit new highs. Why that may be ‘a bit \nunhealthy.’",
    "date": "3/7/2024",
    "url": "https://www.marketwatch.com/story/nvidias-stock-continues-to-hit-new-highs-why-that-may-be-a-bitunhealthy-ec604df2",
    "text": "Nvidia Corp. shares are up for the sixth day in a row, and they’re on track to rack up their sixth straight record high. That’s an example of the type of market activity that has at least one analyst feeling somewhat worried. It “feels a bit unhealthy” to see Nvidia shares \n        NVDA,\n        +0.12%\n       race to new records almost daily, Mizuho Securities desk-based analyst Jordan Klein wrote in a note to clients Thursday morning. And it’s not just Nvidia’s momentum that’s starting to spook Klein, as he notes that shares of “new” AI winners like Broadcom Inc. \n        AVGO,\n        +0.51%,\n       Marvell Technology Inc. \n        MRVL,\n        -1.98%\n       and Taiwan Semiconductor Manufacturing Co. Ltd. \n        TSM,\n        -0.47%\n2330,\n        +1.30%\n       were each up in the realm of 6% to 8% last Friday on seemingly no new fundamental information. See also: Micron’s stock gets new buy call as it’s deemed another chip-sector play on AI In light of some semiconductor stocks’ moves Thursday and their sharp rallies in recent months, Klein said he was “starting to actually get worried” about the tech market — not because he doesn’t believe chip companies will benefit from growth in spending on artificial-intelligence hardware, but because investor sentiment is starting to resemble a “frenzy.” Investors seem to be “either in pure chase mode” or behind their benchmarks such that they’re dumping past winners in favor of boosting their exposure to AI-chip plays that continue to show strong momentum, he said. Also read: It’s not just Nvidia. These companies are finally making real money from AI. Klein called out the “self-reinforcing” nature of the current march higher for chip stocks. “This takes prices higher, but pushes some of the laggards lower as folks rotate out of losers and chase winners,” he noted. The frenzied market action and the fact that sell-side analysts continue to boost their price targets on semiconductor names are giving Klein flashbacks to the technology sector circa 1999 and 2000. Needless to say, “that did not end well,” he observed. Nvidia is gearing up for its annual GTC event later this month, and that could be the “blow-off top” moment for the market. He doesn’t think managers want to trim their Nvidia positions before that event, but at same time, he’s not expecting too many surprises from Nvidia’s management team. “I could see some fast money take profits on the headlines, then others see a pullback and get nervous that the launch or event was somehow a disappointment (when it would not be), [and] then the flywheel starts working in reverse,” Klein wrote. And since Nvidia is leading the tech rally, he’s not sure which stock could step in to prop up the market if Nvidia were to break. Apple Inc. \n        AAPL,\n        -1.06%,\n       Tesla Inc. \n        TSLA,\n        -2.25%,\n       Alphabet Inc. \n        GOOG,\n        +0.21%\nGOOGL,\n        +0.04%\n       and “even” Meta Platforms Inc. \n        META,\n        -1.68%\n       don’t have that same power, in his view. Meanwhile, Broadcom and Marvell are due to report quarterly results after Thursday’s closing bell. Neither one is poised to “tank” sentiment around Nvidia and, in fact, both seem more likely to further fuel the excitement, Klein said. Don’t miss: Nvidia’s stock sees one advantage that only two other chip makers share Those companies have non-AI businesses that are in decline and muddy their stories, but Klein added that “any more bullish tone [or] financial guides from AI products” could send their stocks surging. Klein said he has an overall “positive” view on the semiconductor sector, though he worries some investors could take profits following Nvidia’s GTC and in the lead up to the next chip earnings season. The stock looks like a bet on Trump himself more than a company with significant revenue and profits. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}