{
    "title": "3 Chip Stocks to Buy for the AI Tsunami",
    "date": "3/26/2024",
    "url": "https://investorplace.com/2024/03/3-chip-stocks-to-buy-for-the-ai-tsunami/",
    "text": " Consider adding these chip stocks to buy for AI to your portfolio Advertisement Source:  IM Imagery / Shutterstock.com Chip stocks have continued to heat up for investors seeking to benefit from the early stages of the AI race. Undoubtedly, generative AI hit many of us like a tsunami last year, with many of the top semiconductor innovators experiencing a surge in demand for their offerings as many firms looked to jump aboard the accelerated computing bandwagon. Following the latest Nvidia (NASDAQ:NVDA) 2024 GTC conference, the question on NVDA stockholders’ minds is whether the next generation of AI chips, Blackwell, will be able to keep sales growth potential off the charts. Despite the impressive comparable gains of Blackwell, we cannot ignore the fact that NVDA stock is already up big for the year. The first quarter isn’t quite over yet, but Nvidia stock has already almost doubled year to date, up around 97% at the time of writing. To some, Nvidia’s momentum is a sign of a bubble. To others, it’s a sign that AI is the real deal. If you’re in the latter camp, the following chip stocks to buy for AI are worth watching if you believe artificial intelligence is an industrial revolution driver, not just another hyped-up technology that fails to deliver. Given Nvidia’s massive head start in AI, thanks to CEO Jensen Huang’s vision of the future, I’m not even sure we’ll be dealt another Nvidia, at least not anytime soon. If you’re awed by the firm’s pace of innovation, perhaps it makes more sense to nibble NVDA stock on dips rather than dismissing the AI king as some sort of bubble and going for one of the firm’s less-capable rivals. Indeed, NVDA’s stock chart looks like a run-of-the-mill bubble. After all, the stock has gained about 2,000% in the past five years. That said, when you look at valuation metrics, NVDA suddenly doesn’t look any more expensive than most other semiconductor stocks. In fact, the 39 times forward price-to-earnings multiple makes it a lower-cost play than more than a handful of AI stocks out there, most of which aren’t growing nearly as fast. As Nvidia continues selling and customers continue stockpiling, the “peak” in Nvidia stock may still be out of sight, perhaps years out of sight. Lam Research (NASDAQ:LRCX) is another AI stock that could find itself knocking on the $1,000 per-share milestone over the coming weeks. Like Nvidia, the stock’s been making higher highs of late, with valuation metrics that aren’t indicative of a bubble. LRCX stock actually looks cheap at around 26.6 times forward price-to-earnings, given it supplies etch and deposition equipment to many heavyweight chip makers out there. Simply put, without Lam’s machinery, the semiconductor industry probably wouldn’t be able to meet the sky-high chip demands of firms eager to back up the truck on AI chips, memory and other hardware needed to get an AI model up and running. More demand for AI chips begets more production capacity and Lam equipment. Should demand for semiconductors stay strong for another year (or more), Lam’s tailwind could also continue for a lot longer. Over the past year, shares of LRCX have nearly doubled, gaining 95%. Despite the potential for the wafer-fabrication equipment (WFE) scene to stay hot in the face of the AI boom, I’m more inclined to wait for a dip before getting serious about scooping up shares. Microsoft (NASDAQ:MSFT) is an enterprise software and AI giant first and foremost. However, its push into the hardware realm is notable. Dismiss the company’s limited success with hardware (think the Windows Phone or HoloLens), if you will, but I think getting into the chip scene could prove lucrative as it looks to lessen its dependence on AI chip heavyweights like Nvidia. With its Azure Maia 100 AI chip, Microsoft has an answer to Nvidia’s impressive H100 GPU. But as the world shifts gears from H100 to the Blackwell B200 GPUs, Microsoft will need to keep pushing its silicon efforts at full speed if it wants to breathe down Nvidia’s neck at some point in the future. In the meantime, it seems like Microsoft’s chip efforts won’t stop it from being a huge net buyer of Nvidia chips. The software behemoth will still need to spend a great deal on Nvidia’s Blackwell chips to keep its data centers as competitive as possible. If Microsoft experiences a few chip breakthroughs at some point over the next 10 years, though, I would look for Microsoft’s Nvidia dependence to trend downward. On the date of publication, Joey Frenette owned shares of Microsoft. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joey Frenette is a seasoned investment writer specializing in technology and consumer stocks. Contributing to the Motley Fool Canada, TipRanks, and Barchart, Joey excels in spotting mispriced stocks with long-term growth potential in a fast-paced market.   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/3-chip-stocks-to-buy-for-the-ai-tsunami/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}