{
    "title": "Microsoft Unveils DirectSR API, A Boost for AI-Upscaling with Nvidia, AMD, \nand Intel",
    "date": "3/1/2024",
    "url": "https://www.tradingview.com/news/benzinga:aa4ab8482094b:0-microsoft-unveils-directsr-api-a-boost-for-ai-upscaling-with-nvidia-amd-and-intel/",
    "text": "Microsoft Corp MSFT has introduced a new Windows API, DirectSR, aimed at revolutionizing how game developers incorporate AI-upscaling technologies from leading companies like Nvidia Corp NVDA, Advanced Micro Devices, Inc AMD, and Intel Corp INTC into their games. As program manager Joshua Tucker described, DirectSR is the crucial connection facilitating games to utilize super-resolution technologies. This new API promises to deliver a smoother and more efficient gaming experience compatible across various hardware platforms, the Verge reports. The essence of DirectSR lies in its ability to support multi-vendor super-resolution (SR) technologies through a unified set of inputs and outputs. This approach enables developers to implement a single code path to activate diverse solutions, including Nvidia’s DLSS Super Resolution, AMD’s FidelityFX Super Resolution, and Intel’s XeSS. The advantage for developers is significant, as it absolves them from the need to individually code for each upscaling technology, streamlining the development process. This announcement follows the discovery of an “Automatic Super Resolution” feature in a test version of Windows 11, which suggested the use of AI to enhance the smoothness and detail of supported games. Microsoft fired 1,900 employees across Activision Blizzard and Xbox in January to create a more sustainable cost structure, equating to about 8% of its Gaming division. Blizzard president Mike Ybarra and Allen Adham, Blizzard’s chief design officer and co-founder, also departed. Blizzard canceled its previously announced survival game. Investors can gain exposure to the AI driven FAANG stocks via ProShares UltraPro QQQ TQQQ and Invesco QQQ Trust, Series 1 QQQ, which gained 9-25% year-to-date. Price Action: MSFT shares are trading lower by 0.37% at $412.12 at last check Friday. Also Read: Microsoft Strikes Historic Union Deal on AI Usage, But What Does It Mean for Workers? Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}