{
    "title": "The Globe and Mail",
    "date": "3/15/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/24820696/3-brilliant-reasons-to-buy-nvidia-stock-right-now/",
    "text": "Nvidia (NASDAQ: NVDA) is a stock many investors have missed out on. Its unbelievable market outperformance started at the beginning of 2023 and continues well into 2024, with the stock up more than 480%. But just because it has risen that much doesn't necessarily mean investors have missed out; you can always buy the stock now. Many might be concerned about shares falling due to high expectations built into it. However, I can come up with three good reasons Nvidia is a buy right now, and investors of all opinions should consider these. Nvidia's primary products are graphics processing units (GPUs), the hardware often tasked with complex computing, like engineering simulations or gaming graphics. But they're also useful for data gathering and training artificial intelligence (AI) models. That makes them a key factor in the AI revolution taking the world by storm. As companies rush to build data centers to increase computing capability and power these ever-improving models, Nvidia's business has soared. In its latest quarter, Nvidia's revenue was up 265% to $22.1 billion. This brought its revenue for the full-year 2024 (ending Jan. 28) to $60.9 billion. And many market analysts believe there is more in store for GPU production.  NVDA revenue (TTM) data by YCharts; TTM = trailing 12 months. Precedence Research sees the GPU market expanding to $773 billion by 2032. Considering that Nvidia holds a firm grip on the GPU market, it will be the primary benefactor of this increase. Just because Nvidia has experienced unbelievable growth doesn't mean it's done yet. But investors shouldn't expect revenue to triple like it did over the past year. AI is all the rage in the stock market, but how many people use it in their daily work? The reality is that very few people have been affected by its power. But with AI going mainstream through digital assistants, that is about to change. GPUs will be needed to harness the power of these tools, which is another boost for Nvidia. More innovations will follow once the workforce becomes comfortable with using AI to improve productivity. These innovations will require more computing power because previous models are being run on existing infrastructure, so GPUs will once again benefit from AI proliferation. The last piece of the puzzle is Nvidia's H100 GPU. This is its flagship model, but the company is working on its replacement already. The H200 GPU is expected to launch in Q2 2024, and will essentially double the computing capacity for a single GPU compared to the H100. The increase in computing power and efficiency will drive many to upgrade, which will be another boost for the chipmaker. Additionally, it keeps Nvidia ahead of the competition, further cementing its place on top of the GPU world. We're in the early innings of AI affecting work, and Nvidia is set to capitalize. The previous two reasons don't involve the stock; they only concern the future. However, thanks to Nvidia's growth, the stock isn't as expensive as it used to be. When a company is undergoing a massive transformation, it's useful to look at the forward price-to-earnings (P/E) ratio, which uses analyst projections. This analysis isn't perfect, but it gives investors a better idea of where Nvidia is heading rather than looking at where it has been.  NVDA PE ratio data by YCharts. While Nvidia's P/E ratio has been sky-high at times, its forward earnings have hovered around reasonable levels -- 38 times forward earnings is still a very expensive price tag for a stock, but it looks much more palatable than 78 times trailing earnings. And when the world's largest company, Microsoft, trades at 35 times forward earnings despite slower growth, Nvidia's stock price doesn't look all that bad. Investors are unlikely to see the incredible growth Nvidia experienced in 2023 again, but there is still plenty of room for steady, market-beating growth, which makes it a stock that investors can confidently invest in, even now. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}