{
    "title": "ARK CEO Cathie Wood Calls NVIDIA A Massive Bubble - Is She Right?",
    "date": "3/17/2024",
    "url": "https://247wallst.com/technology-3/2024/03/17/ark-ceo-cathie-wood-calls-nvidia-a-massive-bubble-is-she-right/",
    "text": "Cathie Wood rose to fame thanks to the incredible performance of the ARK Innovation ETF (NYSE: ARKK) from 2016 to early 2021. The past three years haven’t been as kind to the ARK Innovation ETF, which still sits 70% below all-time highs reached in early 2021 even as the Nasdaq sets new highs. One reason for ARK’s struggles is that the fund sold NVIDIA (Nasdaq: NVDA) before its most recent run. Yet, Wood recently doubled down on her firm’s position, comparing NVIDIA to stocks that imploded during the 2000 Internet bubble. Let’s take a closer look at Wood’s remarks and ARK Innovation’s history with NVIDIA.  The most recent comments from Wood were in a letter she published on March 7th. The letter is favorable to artificial intelligence as a market but draws a sharp comparison between Cisco (Nasdaq: CSCO) in 2000 and NVIDIA today. Wood notes how Cisco soared 31-fold in the three and a half years leading up to March 1994, saw a 50% drop, and then went on another 73-fold run that ended with the Dot-Com bust in 2000. She draws a comparison to NVIDIA’s recent run, which is now at 23-fold since the company saw a 56% sell-off in late 2018. Simply put, Wood sees NVIDIA at a similar place to where Cisco stood in early 2000 before its share price collapsed as it became apparent growth expectations for the company were far too high. She says: “Well-funded startups have scrambled – likely double- and triple-ordering GPUs in the process – to acquire Nvidia’s hardware and train AI models. Today, Nvidia is guiding expectations to a sequential deceleration in growth and, reportedly, the lead time for its GPUs has dropped from 8-11 months to 3-4 months, suggesting that supply is increasing relative to demand.” Wood goes on to add that without an explosion in software revenue to justify all this GPU capacity, she would expect a pause in spending. Her final point is that NVIDIA could face increased competition as their largest customers (companies like Meta, Facebook, and Google) may simply rely more on AI chips designed in-house. Before evaluating specifics in Cathie Wood’s comments, it’s worth looking at ARK’s history of owning NVIDIA stock. NVIDIA was one of the ARK Innovation ETF’s largest positions at times, but the fund sold a large position of NVIDIA in November 2022 and completely divested from the company in January 2023. The cited reason for the sale was valuation. If we look at November 9th, 2022 as the date ARK sold most most their NVIDIA shares, the stock closed that day trading for $137.76. If Wood had simply held those shares, they’d be up another 537% today. What’s particularly striking about ARK’s sale date was it happened in the same month the “iPhone moment” for AI happened. In November 2022, OpenAI launched ChatGPT, which was a massive move forward in artificial intelligence capabilities and started the demand boom for AI hardware that continues today. Simply put, it’s not just that ARK sold NVIDIA, it’s that their sales kind of looks like selling Apple in January 2007.  Looking back at Cathie Wood’s critiques about NVIDIA, they’re not without merit. She notes that lead times for NVIDIA’s AI chips are reportedly dropping from 8-11 months to 3-4 months. In the days leading up to NVIDIA’s latest earnings report, the stock was selling off in large part due to reports about lead times falling hitting the press. Yet, post-earnings commentary from NVIDIA management and the strength of NVIDIA’s forecast reassured investors that demand was strong, and the stock has continued rallying after earnings. One factor that makes reading too much into lead times difficult is that NVIDIA is about to launch a new generation of AI chips. The current boom has seen customers ordering up as many of NVIDIA’s H100 chips as they could get their hands on. However, NVIDIA is readying two new AI chips, the H200 and B100 in the coming months. That means that falling H100 lead times could simply be customers waiting to purchase NVIDIA’s newest chips that are readying for launch. Comments from the founder of Taiwan Semiconductor (NYSE: TSM) – the company that manufactures NVIDIA’s AI chips – also support booming demand for years to come. Taiwan Semiconductor’s founder said large customers (likely companies like OpenAI, Microsoft, and Meta) have approached him requesting the company build up to 10 fabs just to build cutting-edge AI processors. That level of investment in AI manufacturing would be unprecedented (costing hundreds of billions) and shows just how bullish some industry insiders remain. The comments from Wood that NVIDIA faces long-term threats also have merit. Their customer base is very concentrated into large “hyper scalers” like Meta, Microsoft, Google, and Amazon that would all love to reduce their reliance on NVIDIA. Of course, that’s easier said than done. But NVIDIA faces the challenge of keeping massive market share in AI chips and maintaining unprecedented margins in the semiconductor space as well. The company reported a staggering 55.6% profit margin last quarter. Wall Street forecasts have NVIDIA returning an absurd 56% profit margin through 2028. Enough competition and pricing power to push this below 50% could cause a sell-off in NVIDIA’s shares.  Wood finishes her commentary on NVIDIA with an extremely important note. She says: “That said, since 2019 futurists have collapsed the time to AGI (Artificial General Intelligence) from 80 years to 8 years, so anything is possible.” This is an extremely important point because the possibility of NVIDIA being the central company to the most important technology trend ever is part of what’s keeping its shares in the stratosphere. As a quick example, let’s run a scenario on the value of NVIDIA shares. Here’s what’s interesting about these scenarios, in 85% of them NVIDIA investors lose money from where the stock is valued today ($2.2 trillion). And yet, if you add up the probability of each scenario happening multiplied by NVIDIA’s potential value, there is a surprising result. The sum of all these scenarios is about $2.6 trillion, which is above NVIDIA’s share price today ($2.2 trillion). Of course, these numbers are more illustrative, but they show the scenarios that may be priced in for NVIDIA. The bottom line: the odds are on Cathie Wood’s side that NVIDIA is overlvaued today. However, if she’s wrong she’s going to be spectacularly wrong. That’s a fact she’s all too aware of.  Are you ready for retirement? Planning for retirement can be overwhelming, that’s why it could be a good idea to speak to a fiduciary financial advisor about your goals today. Start by taking this retirement quiz right here from SmartAsset that will match you with up to 3 financial advisors that serve your area and beyond in 5 minutes. Smart Asset is now matching over 50,000 people a month. Click here now to get started.  Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}