{
    "title": "Are These Magnificent Seven Stocks Ready to Be Magnificent Again?",
    "date": "3/13/2024",
    "url": "https://www.marketbeat.com/stock-ideas/time-to-buy-these-3-underperforming-magnificent-seven-members/",
    "text": " As the calendar flipped its pages into 2024, the spotlight again illuminated the famed 'Magnificent Seven,' a cohort of tech titans whose every move resonates throughout the market. However, this year's narrative unfolded with a twist, casting shadows of uncertainty over the once-unrivaled dominance of these corporate giants. In the new year's initial strides, three members of this illustrious group, Alphabet NASDAQ: GOOGL, Apple NASDAQ: AAPL, and Tesla NASDAQ: TSLA have found themselves trailing behind their counterparts, caught in a struggle to regain their momentum. The echoes of their lagging performance reverberate through the market, contrasting sharply against the soaring heights reached by their peers.  Over the past ninety days, Apple and Tesla have dipped into the red, while Alphabet treads water with modest gains. Their sluggish pace pales compared to the meteoric rise witnessed in shares of Nvidia NASDAQ: NVDA, which have surged by nearly 90% during the same period. Meanwhile, the broader market marches steadily ahead, boasting a year-to-date increase of over 7%, leaving these three tech behemoths languishing in negative territory. Yet, amidst the gloom of underperformance, a glimmer of opportunity might emerge as these three names have caught a bid over the previous week. Could Alphabet, Apple, and Tesla be poised to stage a comeback, closing the gap and reclaiming their prominence within the magnificent seven and overall market? Let's look closer at the three names mentioned above to see whether now might be the time to get involved, as they appear to be finding support. Shares of Alphabet are slightly in the red year-to-date, down close to 1% and over 6% over the previous months. The company previously reported earnings on January 30 and reported $1.64 earnings per share (EPS) for the quarter, surpassing the consensus estimate of $1.60 by $0.04. Alphabet earned $86.31 billion during the quarter, exceeding analyst estimates of $70.77 billion. The stock has a P/E of 23.94 and a moderate buy rating based on thirty-three analyst ratings. Momentum might be shifting for Alphabet, as the stock has found support over the previous week. After weeks of steady selling, shares of GOOGL caught a bid near its 200-day SMA and have been positive for the last four days. If the stock can consolidate above its flattening 200-day SMA and confirm a higher low, a move toward its flattening 50 and 20-day SMA would be the next target. Tesla has been the worst-performing magnificent seven-member year-to-date, with shares of the company down almost 30%. The company released its quarterly earnings on January 24 and reported earnings per share of $0.71 for the quarter, falling short of the consensus estimate of $0.75 by $0.04. Tesla's revenue for the quarter was $25.17 billion, slightly below analysts' expectations of $25.64 billion. However, the company experienced a 3.5% increase in quarterly revenue compared to the previous year. Based on thirty-three ratings, the stock has a hold rating and price target, forecasting an almost 22% upside. Unlike GOOGL, Tesla shares are still in a downtrend and have yet to find significant support. Over the previous five days, the stock has consolidated between $175 and $185. Therefore, the stock would need to break through the short-term resistance of $185 and consolidate above its 5-day SMA for signs of shifting momentum. Apple is the second-worst performing member of the magnificent seven year-to-date, with its stock down almost 10%. The company announced its earnings results on February 1 and reported earnings per share of $2.18 for the quarter, surpassing the consensus estimate of $2.09 by $0.09. Apple earned $119.60 billion during the quarter, slightly higher than the consensus estimate of $117.99 billion. Analysts are bullish on the stock, with a moderate buy rating and consensus price target predicting over 18% upside. Its stock is also beginning to show signs of a turnaround. After finding support near $170, shares of Apple have now reclaimed its 5-day SMA. Going forward, if the stock can consolidate above its 5-day SMA and then push above $175, a higher timeframe move toward its 200-day might begin to shape up. Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Do you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio. Technical Analysis, Momentum Trading, Risk Management Ryan Hasson has been a contributing writer for MarketBeat since 2023. Equity research and analysis, technical analysis and price action, market sentiment and underlying themes, risk management and trading psychology Bachelor of Commerce in Financial Management Equities trader, Kershner Trading Group, business analysis consultant, SMB Capital Zoom International: Business Analysis Consultant. Expert insights into the psychological impact of stock splits and the potential candidates for future splits. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}