{
    "title": "How PM Modi’s meeting with Nvidia CEO Jensen Huang helped Yotta obtain \nlarge H100 Tensor GPUs order",
    "date": "1/2/2024",
    "url": "https://www.businesstoday.in/technology/news/story/how-pm-modis-meeting-with-nvidia-ceo-jensen-huang-helped-yotta-obtain-large-h100-tensor-gpus-order-411604-2024-01-02",
    "text": "Feedback The United States, China and many other countries have surged ahead of India in terms of innovation in artificial intelligence (AI) models, particularly in the development of generative AI models. Given that the essential components for constructing such models, including large language models (LLM), hinge on data centres equipped with GPUs specialised for AI generation, the Hiranandani Group’s Yotta Data Services is ambitiously endeavouring to construct India’s largest Supercomputer, Shakti Cloud, potentially ranking as the world’s 10th largest. In pursuit of this goal, Yotta is acquiring 16,000 of Nvidia’s H100 Tensor GPUs. After all, Nvidia practically owns 90% of the GPU market. This acquisition is noteworthy considering the global shortage of Nvidia H100 GPUs, which has caused delays in numerous major projects worldwide. Despite the challenges posed by the global GPU shortage, the breakthrough in securing these GPUs for Yotta followed Prime Minister Narendra Modi’s meeting with Nvidia CEO Jensen Huang. “In September, when Jensen Huang, founder & CEO, Nvidia came to India, he had met Prime Minister Narendra Modi. At that time, Prime Minister had expressed his desire of bridging this gap, helping India come at the forefront of AI, and even sought Huang’s help for the same. The Nvidia CEO offered PM Modi to help in his best capacity possible by offering technology and support to the local providers,” says Sunil Gupta, Co-founder & CEO of Yotta. He adds, “As somebody has to invest in, take a step forward to build this infrastructure in India, Yotta took the first step and placed the order.” Yotta is putting the NVIDIA GPUs in its Mumbai data centre to start with and then it plans to them in the greater Noida centre followed by the one it is planning in the Gift City.  But simply obtaining and installing the latest GPUs doesn’t do the job. A lot of preparations and backend work goes into it.  “I am refreshing my own engineering of data centre because my traditional data centre, buildings and enforcer will not work to handle this. So, we are getting into liquid cooling and immersion cooling that can handle 40-50 kilowatt per rack and all.” The company is starting with 4096 Nvidia GPUs in February this year, and will install 16,384 GPUs by June 2024. Gupta is hopeful that by the end of 2025, Yotta will increase it to 32,768 GPUs. Gupta adds, “India has got a lot of talent. A lot of start-ups are working towards developing AI solutions. But ultimately, if you make any large-scale AI model to train large model, you need a huge humongous amount of compute and network capacity, which is not there in India at all. It’s just not there. So that is what somebody had to take initiative.” Gupta is confident whatever size of AI models Indian developers want to make, they will have access to this infrastructure right here in India, and they won’t have to opt for foreign operators. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}