{
    "title": null,
    "date": "1/22/2024",
    "url": "https://investorplace.com/2024/01/nvidia-is-great-but-these-3-semiconductor-stocks-are-even-better/",
    "text": " The chip space is a relatively diverse one Advertisement Source: Shutterstock Semiconductor stocks are increasingly coming into focus for growth investors looking to amplify their returns. Indeed, looking at Nvidia’s (NASDAQ:NVDA) performance on a year-to-date (YTD) basis (and really over almost any time frame), it’s clear that investors are focusing on long-term growth trends for the coming decade. As data usage grows, the demand for computing power will exponentially rise. Accordingly, Nvidia has become the focal point of most investors’ chip exposure. And yet, investors should consider plenty of other semiconductor stocks, given the potential market size. Estimates include a projected market value of $1 trillion by 2030. Therefore, other stocks look poised to provide big returns over time. Given the rise of AI, machine learning, and quantum computing, check out these stocks that are set to see gains. Advanced Micro Devices (NASDAQ:AMD) has been hot lately, with its stock similarly surging to all-time highs. Investors who seek the “next Nvidia” find promise in AMD as a compelling alternative. The company has a strong market position and a new AI GPU challenging Nvidia. Launched in November 2022, OpenAI’s ChatGPT reshaped perceptions of AI capabilities. Nvidia dominated as the main chip supplier to this endeavor and others. In fact, it underscored AMD’s lag in the AI race. However, AMD has since responded with the MI300X AI GPU, on par with Nvidia’s H100 for training and 10% to 20% superior for inference. Microsoft (NASDAQ:MSFT) and Meta (NASDAQ:META) partnerships further bolster AMD’s AI future. Despite hitting a $160 high and a 127% increase over the last year, AMD’s potential ascent extends into 2024. The company’s Q3 revenue came in at $5.8 billion, up 4% year over year (YOY), suggesting a continuing positive trend. Now, AMD is looking at record revenue. While not mirroring Nvidia’s rally, AMD’s appeal to top tech firms positions it well for significant market share gains over the long-term. On January 18, Taiwan Semiconductor Manufacturing (NYSE:TSM) surpassed Q4 earnings estimates, reporting $1.44 per U.S. share on $19.62 billion in sales. Despite four consecutive quarters of declining revenue, TSM anticipates a return to growth this quarter, overcoming challenges in smartphone and automobile chip demand. In Q1, TSMC anticipates revenue between $18 billion and $18.8 billion, surpassing Wall Street’s $18.27 billion target. The company’s Q4 success was driven by the robust 3-nanometer technology ramp-up. CFO Wendell Huang expects Q1 impact from smartphone seasonality, balanced by sustained high-performance computing demand. The chipmaker projects 2024 revenue to surge more than 20% due to high demand for AI-centric high-end chips. Needham analyst Charles Shi noted TSMC’s outlook slightly exceeds Wall Street expectations. This suggests a prolonged downturn and a slower-than-normal cycle recovery in 2024. Also, it makes TMC stock a semiconductor option worth considering right now. Marvell Technology’s (NASDAQ:MRVL) shares surged 5.7% following TMC’s robust Q4 earnings results. It really provided a rising tide that lifted all boats (AMD also surged following these impressive forward forecasts). Despite not being a leader in terms of semiconductor stocks, Marvell Technology has nearly doubled from its 52-week low. And, it continues to provide plenty of strong upward momentum for investors. MRVL is an outside option in the chip race, with higher potential upside. Indeed, if one takes the view that this entire sector should get a boost from surging chip sales, MRVL could have greater upside than its mega-cap counterparts. Investors and traders will want to look for higher-beta ways to play this trade. The company certainly looks intriguing in this right. Also, Marvell Technology trades at a higher discount to its peers, with a more attractive valuation multiple. Still off its all-time highs, this company presents a compelling option for value-oriented growth investors in this current environment. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/nvidia-is-great-but-these-3-semiconductor-stocks-are-even-better/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}