{
    "title": "Zuck's GPU flex to cost Meta as much as $18 billion by end of 2024",
    "date": "1/19/2024",
    "url": "https://www.businessinsider.com/mark-zuckerberg-ai-flex-meta-nvidia-gpus-2024-1",
    "text": "       Some people brag about their fancy houses. Others drive expensive cars or sail giant yachts. The latest flex in Silicon Valley is to tell people how many AI chips you own. Meta CEO Mark Zuckerberg upped the ante this week by disclosing how many of these graphics processing units Meta will have by the end of 2024. The bill for all this could be as high as $18 billion, based on industry estimates. \"We're building an absolutely massive amount of infrastructure\" to support Meta's burgeoning efforts in generative artificial intelligence, Zuckerberg explained in a brief video released Thursday. Related stories The company is building of \"general intelligence\" to support AI tools that are \"available and useful to everyone in all of our daily lives,\" he added. To that end, Meta will have purchased about 350,000 Nvidia H100 GPUs by the end of 2024. And overall the company will own roughly 600,000 of these types of chips, if you include other similar GPUs, Zuckerberg noted. He even gave an interview to The Verge, reiterating that when its Nvidia components and other AI chips are accounted for, Meta will have a stockpile of almost 600,000 GPUs by the end of this year. \"We have built up the capacity to do this at a scale that may be larger than any other individual company,\" he crowed. GPUs enable the level of computing necessary for training the giant models that support generative AI services such as ChatGPT. Nvidia's GPUs are considered the best at the moment, but other companies including AMD offer similar chips. A single Nvidia H100 GPU is estimated to cost about $30,000 although other estimates put the cost as high as $40,000. If Meta amasses 600,000 of these, that would cost $18 billion. Meta might be getting a volume discount. And similar GPUs from other providers may be cheaper than Nvidia's offerings. But even at $20,000 each, that's $12 billion. If this rings a bell, it should. In 2022, Meta spent about $13 billion on Reality Labs, its metaverse division. Zuckerberg noted in Thursday's video that Meta's AI and metaverse projects are coming closer together given his expectation that AR-style glasses with AI, like Meta's Ray-Bans, will be how people in the future \"talk to AIs frequently throughout the day.\" Meanwhile, Meta continues to push Zuckerberg's \"efficiency\" mantra. Since late 2022, the company has cut over 20% of its workforce. Employees expect even more cuts in the weeks ahead, as Business Insider reported. A broader restructuring hit AI teams last year, too. The company will report full-year results for 2023 on Feb. 1. Are you a Meta employee, someone else with a tip or insight to share? Contact Kali Hays at khays@insider.com or on the secure messaging app Signal at 949-280-0267. Reach out using a non-work device. Read next Jump to "
}