{
    "title": "2 Reasons to Be Bullish About Nvidia in 2024",
    "date": "1/4/2024",
    "url": "https://www.fool.com/investing/2024/01/04/2-reasons-to-be-bullish-about-nvidia-in-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Chipmaker Nvidia (NVDA 0.12%) just completed one of its best years since its founding almost 30 years ago. Increased interest in artificial intelligence (AI) sent demand for graphics processing units (GPUs) soaring, and its hardware dominated the AI market. As a result, the tech giant's stock rose nearly 240% in 2023. Nvidia is starting the new year with a majority market share in AI chips, one of the world's fastest-growing and most lucrative industries. Despite its meteoric rise over the last 12 months, the chipmaker has shown no signs of slowing and continues to be an attractive investment. So here are two reasons to be bullish about Nvidia in 2024. Macroeconomic headwinds hit the tech market hard in 2022, triggering a sell-off that pulled the Nasdaq-100 Technology Sector index down by 40% that year. However, easing inflation and excitement over budding sectors like AI saw the industry begin to recover in 2023, and it will likely continue improving in the new year. According to Gartner, PC shipments fell 16% in 2022 as consumers who had purchased new computers early in the pandemic had little motivation to upgrade, and as inflation and rising interest rates took a toll on discretionary spending. That figure improved to a 9% decline in the third quarter of 2023, with quarterly results from multiple companies suggesting that a recovery in the market was on the way. Nvidia classifies much of its PC-related sales under its gaming segment, as its hardware is used by consumers to build high-powered gaming computers. In its fiscal 2024 third quarter, which ended Oct. 29, this segment posted revenue growth of 81% year over year and 15% sequentially. The PC market has been a weak point for Nvidia for much of the last two years. However, the worst declines appear to be in the past, and the company is starting 2024 with a booming AI business and a return to growth in its PC segment. While companies like Advanced Micro Devices and Intel spent years prioritizing the central processing unit market (CPU), Nvidia made GPUs its specialty. So when companies across tech pivoted their businesses to AI last year and demand for GPUs to power those applications soared, Nvidia was perfectly placed to snap up an estimated 90% share of the market in AI chips. Nvidia's skyrocketing chip sales were reflected in its fiscal 2024 Q3 report: Revenue rose 206% year over year, and operating income was up 1,600%. Increased demand for AI GPUs lifted the company's data center revenue by 279% for the quarter. While Nvidia profited from a relative lack of chip competition last year, that looks likely to change in 2024. AMD and Intel will begin shipping new AI chips in the coming months, which has some investors concerned about the chipmaker's prospects for this year. However, Grand View Research projects that the AI market will expand at a compound annual growth rate of 37% through 2030. If that proves accurate, the industry's market size would exceed $1 trillion before the end of the decade, suggesting there's plenty of room for Nvidia to hold onto its dominance even as new competitors appear. Moreover, Nvidia has held a market share of over 80% in desktop GPUs for years, even while AMD and Intel have grown their footprints in the sector. It has been challenging for rivals to chip away at Nvidia's lead in that niche, and it is unlikely to be different in AI.  Data by YCharts Nvidia continues to have massive potential in 2024 and beyond, with its positions at the top of AI and in a recovering PC business. Its potential is backed up by this chart, which shows its EPS estimates until its fiscal 2026. According to the data, Nvidia's earnings could hit $24 per share. Multiplying that figure by the tech giant's current forward price-to-earnings ratio of 40 yields a stock price of $960 -- 94% higher than its position today. Based on that outlook, Nvidia's stock is one of the smartest buys for 2024. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}