{
    "title": "3 Stocks That Have Turned $50,000 Into More Than $500,000 in Just 5 Years",
    "date": "1/3/2024",
    "url": "https://www.fool.com/investing/2024/01/03/3-stocks-that-have-turned-50000-into-more-than-500/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Growth stocks get the designation because they have the potential to generate life-changing gains for investors. Some even do so in a relatively short time frame. Finding proper growth stocks generally involves determining which companies can turn the above-average growth they might be seeing short-term into long-term earnings and stock price appreciation. If those companies will generate massive returns in a relatively short period, that's much less predictable. Nvidia (NVDA 0.12%), Tesla (TSLA -2.25%), and Axsome Therapeutics (AXSM 0.80%) are some recent examples of companies that managed to generate outsized growth in a short timeframe, surprising the markets. All three stocks were 10-baggers over the past five years. Here's a look at what was behind their strong performances and some informed analysis on whether they're still good buys today. It would have been difficult to predict Nvidia's trajectory five years ago. The boom in artificial intelligence (AI) this past year wasn't on anyone's radar. But it ended up being a big reason Nvidia was a hot stock to own over the past five years -- demand for AI chips has been through the roof. A $50,000 investment in Nvidia five years ago would be worth more than $730,000 today. A significant chunk of those gains came in 2023 (it was up 230%), thanks to AI and the emergence of ChatGPT. Those outsized gains pushed its valuation above $1.2 trillion. Nvidia stock sells at a premium now, trading at more than 60 times earnings, but it can still be a good buy. The company has a 70% market share of the overall AI chip market, which is expected to grow more than 40% (compounded) annually through 2030. And with plenty of demand still to come in generative AI, this is one of the best AI stocks to buy for the long haul. In the company's most recent quarterly results (for the period ended on Oct. 29), Nvidia's revenue rose by 206% to $18.1 billion -- a record for the business. With growth like that and more opportunities still out there for Nvidia, it's easy to see why this can still make for an excellent investment right now. Over the past five years, Tesla transformed itself from an unprofitable company into one of the leading stocks on the S&P 500. These days discussion has turned to whether Tesla can maintain its blistering growth rate and if its margins are high enough. A $50,000 investment in Tesla five years ago would be worth close to $560,000. And that's with some significant price volatility over that time as well as the stock giving back some gains recently. Tesla is still a promising investment as the world transitions toward electric vehicles, but it is likely to remain a bumpy ride for investors going forward. The company's margins took a hit recently, as Tesla cut prices on its vehicles to remain competitive. The recent launch of its Cybertruck, which is unlikely to be profitable in 2024, will only exacerbate short-term concerns relating to its bottom line. At 80 times earnings, the stock isn't cheap. While the business may be a safer one to invest in versus where Tesla was five years ago, investors should temper their expectations for the future. For those who are willing to hang on for several years, this can still be a good stock to own but don't expect a smooth ride. Tesla and Nvidia have been great buys over the past five years, but Axsome Therapeutics performed even better. A $50,000 investment in the biotech stock five years ago would have made you a millionaire today, with the value of that investment now being worth $1.8 million. That's easier said than done, of course, as five years ago the company had no approved products, and was an extremely risky buy. But oversized gains (and losses) are not unusual in the biotech world, where hype or approval from the Food and Drug Administration can send a company's shares skyrocketing in no time. Axsome obtained approval for Auvelity, its treatment for major depressive disorder, in 2022, and the stock has been climbing since then. The blockbuster drug could generate $1.8 billion in annual sales for Axsome at its peak. And with Axsome's market cap fairly modest at $3.7 billion, this can still be a good investment to buy, although the company remains unprofitable at the moment and it comes with more risk than the other two stocks on this list.  David Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Axsome Therapeutics, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}