{
    "title": "Intel and Nvidia shine in Gartner's latest global semiconductor revenue \nrankings",
    "date": "1/17/2024",
    "url": "https://siliconangle.com/2024/01/17/intel-nvidia-shine-gartners-latest-global-semiconductor-revenue-rankings/",
    "text": "UPDATED 20:49 EST / JANUARY 17 2024 by \nMike Wheatley Global semiconductor market revenues fell by 11% in 2023, to just $533 billion, driven by a steep decline in the price of memory chips. That allowed Intel Corp. to reclaim its position as the world’s top semiconductor supplier in terms of revenue, surpassing Samsung Electronics Co. Ltd., which came in first one year earlier. Nvidia Corp. also made an impressive climb in the rankings, breaking into the top five for the first time. The numbers come today via Gartner Inc.’s Top 10 Semiconductor Vendors by Revenue report for 2023, which show how Nvidia raked in more than $15 billion in sales that year, up 56% from a year earlier. In contrast, Samsung, which is heavily reliant on sales of memory chips, saw its revenue fall by 37% from the year prior, causing it to fall behind Intel, which also saw a double-digit decline. Gartner VP Analyst Alan Priestley said the decline in revenue is a result of the cyclical nature of the semiconductor industry, where demand ebbs and flows according to a variety of market forces. According to Priestley, last year was a particularly difficult year for the industry, with revenue from memory chips “recording one of its worst decades in history.” “The underperforming market also negatively impacted several semiconductor vendors,” Priestly added. “Only nine of the top 25 semiconductor vendors posted revenue growth in 2023, with 10 experiencing double-digit declines.” It’s no surprise that revenues in the memory chip segment fell so significantly, as the major players in that market all began cutting back on production last year in an effort to stem a dramatic fall in prices. The chipmakers all suffered from low demand as their customers attempted to shift a big backlog of stock that was built up from shortages experienced during the COVID-19 pandemic. As a result, they reduced production capacity to try and boost the price of the few products they were able to sell. Unfortunately, the strategy caused a bit of short-term pain for the top memory chip makers, including Samsung and SK Hynix Inc., which saw revenue fall by 37.5% and 32.1%, respectively. There’s an argument to be made that those companies may have fared better if they had kept their production operations running at full steam in order to benefit from economies of scale. After all, if prices declined further, customers may have been tempted to stock up even more to take advantage of the lower costs. Both Samsung and SK Hynix appear to be mindful of that, however, and reports suggest that they may soon expand production once again. Overall, the memory chip market segment saw revenue fall by 37% from a year earlier. It was the biggest drag on the semiconductor industry by far, as those chipmakers that do not make memory chips suffered an average revenue decline of just 3%, Gartner said. Intel is one of those chipmakers. The company exited the memory chip business in 2022 and, although its revenue still fell by 16.7% last year, it was nevertheless able to surpass Samsung and become the world’s biggest chipmaker again. However, nobody did quite as well as Nvidia, which has emerged as the darling of an artificial intelligence market that’s growing faster than any other sector within the technology industry. Nvidia’s graphics processing units are widely seen as the best silicon for powering AI training and inference workloads, and that helped it move up from the No. 12 spot to become No. 5 in terms of its total revenue.  Nvidia’s chips are in such high demand that the company is struggling to fulfill its customers’ orders, and that may help rivals such as Advanced Micro Devices Inc. Last year, AMD debuted a rival AI chip that it says can perform just as well as Nvidia’s most powerful GPUs. AMD was ranked seventh overall in 2023, just as it was one year earlier, though its revenue declined 5.6%. Qualcomm Inc., the smartphone chipmaker, saw its revenue decline by 16.6% but still managed to hold onto third place, while Broadcom Inc., which says it has benefited from increased sales of automotive chips, rose from sixth to fourth place, with revenue growing 7.2% last year. The French-Italian chipmaker STMicroelectronics N.V. also deserves a mention for its steady climb. It managed to grow its revenue by 7.7% last year, and that helped it rank eighth overall, rising from last year’s 11th place. THANK YOU Blockchain-focused cryptography startup Zama raises $73M to protect data in use Bipartisan bill could see TikTok banned in US if it doesn’t split with China OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions Taalas raises $50M to develop chips optimized for specific AI models Claroty secures $100M to enhance cyber-physical system security Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research Blockchain-focused cryptography startup Zama raises $73M to protect data in use SECURITY - BY MIKE WHEATLEY . 6 HOURS AGO Bipartisan bill could see TikTok banned in US if it doesn’t split with China POLICY - BY JAMES FARRELL . 9 HOURS AGO OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions AI - BY MIKE WHEATLEY . 11 HOURS AGO Taalas raises $50M to develop chips optimized for specific AI models AI - BY MARIA DEUTSCHER . 12 HOURS AGO Claroty secures $100M to enhance cyber-physical system security SECURITY - BY DUNCAN RILEY . 13 HOURS AGO Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research AI - BY MARIA DEUTSCHER . 14 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}