{
    "title": "David Trainer Likes Energy, JPMorgan Over S&P Uber, Tesla, Nvidia Too \nExpensive",
    "date": "2/28/2024",
    "url": "https://seekingalpha.com/article/4674399-david-trainer-likes-energy-jpmorgan-over-s-and-p-uber-tesla-plus-nvidia-too-expensive",
    "text": "Listen here or on the go via Apple and Spotify.  David Trainer says the Fed and liquidity remain a salient driver of markets (0:40) Big opportunity now in energy and industrials (4:20). JPMorgan safer than the S&P (19:10). Uber, Nvidia and Tesla all too expensive (21:05). Rena Sherbill: David Trainer, welcome back to Seeking Alpha. Welcome back to Investing Experts. Always great to have you on the show. So, thanks for taking the time. David Trainer: Thank you, Rena. I am glad to be here. RS: Yeah, glad to have you back on. You were on last summer talking about markets and some of the stocks you like, some of the stocks you didn't like. You've had a few recent articles on Seeking Alpha talking about some ETFs and sectors. How are you thinking about things? How are you looking at things, kind of the end of February 2024? DT: Well, I think the most important driver really of markets these days is the Fed and liquidity. As long as we're pumping more liquidity into the market, fiscal, monetary, whichever, I think we're going to see stocks start to just continue to move up in the way we have. And we're inventing new meme stocks all the time. Nvidia, Arm, et cetera. And I think we're seeing actually a bit of a sophistication, improvement, I believe, in our retail investing base where to be a meme stock, you don't have to be a junk stock, right? Walmart Inc. (WMT) even taking a big run. Walmart was a focus list stock of ours for a long time. It got expensive. We took it off the list. It's had a huge run up this year. And I think what's happening is that this liquidity is potentially, excess liquidity in a lot of individual and retail hands is getting smarter. I think the bored apes got bored with chasing meme stocks, and they said, I don't have to put my money into a junk stock that's about to go bankrupt, why don't I invest in Walmart? And just take some risk off the table and do just as well probably. So, I think that that's a positive movement, but Rena, in terms of the overall market, I think a lot of that really just depends on what the Fed's doing and where people see rates and what that means about excess liquidity. RS: It's funny because this is a lot about what we were talking about in July. And the more things change, the more they stay the same. How are you thinking – there's a lot of talk, and we've been talking about this on the podcast about, there's not going to be rate cuts probably for the first six months of the year, at least. How are you thinking about that? And do you agree with how the Fed is handling things? DT: Yeah, look, I think it's a tough situation. I mean, I think I would have been much more different, much different about it earlier on would have raised sooner and not waited for as long. And so that creates a very different backdrop. And I think that the Fed's doing the right thing in the current circumstances. It's a wait and see kind of situation, and they don't know there are a lot of theories that there's a big lag effect that catches up very quickly with respect to raising rates. And so, the economy falls off a cliff, spending and things like that fall off a cliff. That's not what appears to be the case. So, it appears that despite the rapid increase, it wasn't so high that it forced the engines of commerce to halt. It is slowing them down, which I think was the Fed's intended effect. And I think they got to continue to see it hopefully continue to gradually slow. And that's what they want is a soft landing. And in that process, what I hope is that that investors get smarter, and they chase fewer junk stocks to the traditional meme stock and put their money a little more intelligently into businesses that actually create shareholder value and will in the long term create value for them. RS: So, what does that look like for you? How are you looking at worthy investments? DT: Yeah, that's easy. That's energy and industrials. The infrastructure of our economy, the physical infrastructure, the technological or digital infrastructure is important as well, but it's overvalued. And where we're seeing real pockets of opportunity are in energy and industrials materials. Certain stocks in those sectors are really attractive. One, a case study poster child for that is, Warrior Met Coal, Inc. (NYSE:HCC), a report that we published on Seeking Alpha. It came out a few months after we gave it to clients. And a lot of what we do on Seeking Alpha now is on individual stocks is going to be pretty significantly delayed, but we – Warrior Met Coal was just an awesome example. I think it's up 60% since we first put it on our focus list. And it's an awesome example of a business that's really overlooked, but super important and overlooked for a lot of reasons, right? The title of the report is, Coal in Green Clothing. Because people mistake, or they don't understand that there are two types of coal. There's thermal coal and metallurgical coal. The coal that's really bad for the environment that everyone says needs to go away is thermal coal. Metallurgical coal, on the other hand, is not nearly as bad and not even close. And it is also an essential element in the production of steel. And steel is an essential element in the production of alternative energy equipment. So, windmills, solar panels, they all require large amounts of high-grade steel. And so, going up the value chain, right, we identified Warrior Met Coal at the time it was trading as if its profits would permanently decline by 50% or 60%. And it’d been thrown out with the — that baby had been thrown out with the coal water, right? The thermal coal water. And in reality, they are not a business that is bad for the environment. And they are in a growth sector where we need to get back to producing, the steel needed to keep the economy going. And that's in building bridges and building the materials required for the transition to clean energy. And so, that's a great example, I think, in terms of materials, industrials, picks that – one of the picks we've had on that front that has done really well, we think will continue to do well. And what I love about that, Rena, is that kind of stock is that the risk reward is so much better, right? You got great – all of us, all our long ideas they're going to have great cashflow, right? Great free cash flow yields. And yet, it's super cheap, and it's in a growth business. Not a sexy one, not one that people talk about, but still a growth business, an essential business. And it's just – it's what we like to do at New Constructs is, give people the stock picks and investment advice they can put their head on their pillow at night and be comfortable with, that understand that this is something that's going to happen. It may not be tomorrow. It may not be the next day. And NVIDIA Corporation (NVDA) News may trump the Warrior Met Coal news all day long, but you can trust that this is a business that's going to be around for a long time, and it will create value. RS: Aside from the fundamental story, are there certain metrics that you're focused on that are either sector specific that you tend to pay more attention to when you're trying to pick winners in the market? DT: Rena, we had always been and will continue to be big fans of return on invested capital and free cash flow. We think that it makes no sense to measure the performance of a business without understanding how much capital has gone into it and how much cashflow it generates, full stop. If you're not doing that, you're not investing. You're speculating. If you don't understand the return on capital of the business, you're speculating. And if you don't understand the market's expectations for future returns on capital, you're speculating. So, we like to divide the analytical process down into two parts, understand the fundamentals today and understand the fundamentals of the future as reflected in the stock price. Because every stock price is equal to the present value of future cash flows. So we reverse engineer what the fundamentals have to be to justify the stock price. If you don't have a fair understanding of where the return on invested capital is today, how can you have a good assessment of the market’s expected ROIC in the future? How do you know if that's good or bad? Right? If the market expects the return on invested capital to be 500%, which is what it does for Nvidia, is that good or bad? You don't know until you understand that, well, Nvidia is around 40% right now. And so, return on invested capital, free cash flow, and I think I have to throw in a third one here because it's essential to both return on invested capital, free cash flow, and getting it right and getting both of those right. And that's footnotes. Rena, footnotes in the financial statements where the best data goes to hide. And I say it's the best because it's the most market moving. Everybody's looking at income statements. A lot of people are looking at balance sheets, not as many. Everyone's looking at income statements, but almost no one is looking at footnotes. And we know that because professors from Harvard Business School and MIT Sloan studied it for years and published a paper in a top tier peer-reviewed journal, the number three peer-reviewed journal in the world, proving that the market does not discount footnotes. So, there's idiosyncratic alpha or real edge to be gained from our analysis that includes footnotes. In fact, we've got Quant clients that pay us specifically for our footnotes adjustments as part of their systematic trading strategies. But the main thing is that, look, you need to gather all the data so that you can correctly calculate return on invested capital and free cash flow, and I believe New Constructs does that better than anybody else in the business. And we've got proof from Harvard Business School, Ernst & Young, and others to support that. RS: And are there particular filings that you pick at or highlight more than others? DT: It's the Ks and the Qs. Sometimes if they're international, they come off as a 6-F or 20-F. And so 10-Ks, 10-Qs, 6-Ks, 20-Fs, all the things that present the financial statements. Not so much the 8-Ks. Those are unaudited. Those are incomplete press releases, rarely give you a full income statement, even more rarely give you a full income statement, a full balance sheet. And without both of those, you really got no idea what's going on in the business. You got to have at least a balance sheet and an income statement. So, we wait for the full financial data set to come out, which is usually within a day, sometimes the same time as a press release. And we use AI to parse through those things, break them down word by word and get the footnotes' data out. We add that footnotes data into our calculations of return on invested capital, free cash flow to ensure that we're giving our clients a true measure of profits. And then, yeah, that feeds into how we screen for stocks, right? So, our screening tools we think are the best in the business because we're screening with precision. Most of the time, screening is done without precision and keep people use really rough metrics because they just need to narrow the universe of 3,000 stocks down to 20, but a lot of times, 10 of those 20 stocks are not what they think they are because the screening tool is poor. And that's part of why our model portfolios, like the most attractive stocks or dividend growth stocks, are very popular and very successful because we've got screens that really boil things down to stocks that have truly excellent fundamentals and cheap valuations based on screening with real precision because we're always bringing this footnotes advantage and insight to the table. RS: And in terms of the energy sector, is there something that worries you in terms of internationally, in terms of a catalyst coming for very green or alternative energy that that maybe trips you up a little bit? DT: Not so much. We think the narrative is shifting finally, in a positive way because we were building bridges to nowhere when we were effectively betting the world and the economy and the industrial complex on green energy. Just not there yet. It's going to take a couple of decades or more to build up enough green energy production to handle the demand. That's the bottom line. And this has been a big part of our research for a couple of years now as we've been putting more and more energy names on our long idea and focus lists. Our focus list, by the way, has been an extremely strong performer since really 2021. It really strongly outperformed the market. We've been adding energy names consistently because when we do the research, we see fossil fuel demand and use going up over the next few years and not going down for 30 years. And when it does, going down marginally because there's just not enough energy from windmills, solar panels, et cetera to take over. Bottom line, even the Energy Information Administration projects this. Anywhere you look, if you're doing your diligence, you're seeing energy demand is going up and green energy production is just not growing faster. And that's why you've seen folks like Larry Fink backpedal on being so heavy-handed about forcing people to get out of fossil fuels. It's kind of a disaster. In many ways, we're seeing brownouts in California and other parts of the world because now we don't have the energy to support our needs because we basically sold off all these fossil fuel assets. Now, they're buying them back, and people are just waking up to the fact that, look, fossil fuels aren't going to go any time soon. And by the way, if you don't want energy prices to go through the roof, you need fossil fuels to fuel the world until green energy is ready. And that's a ways off. RS: Yeah, we've been talking a lot about this recently in terms of investing smartly and strategically as opposed to being a reactionary. And there's so many ways to be a reactionary and there's so many reactionaries these days. I think it's hard to stay true to the strategy a lot of times because it seems that everybody's pushing you in certain directions, and it's hard to remain loyal to a strategy or be more thoughtful. In terms of the stocks that you like, are there other stocks that you would name right now or sectors that you would advise investors to be looking at? I mean, you mentioned a few before. DT: Yes, absolutely. And by the way, I couldn't agree with you more, Rena, just how hard it is to remain disciplined and the cacophony of recommendations and noise. And we have an online community for New Constructs, a society of intelligent investors. And one of the most interesting posts here this week was about, an e-commerce and SEO expert in our community who pointed out just how misleading Google searches are around finding quality research and how some of these big firms manipulate SEO. And they admit it. They admit it in the fine print that they are putting out somewhat misleading information for the purpose of just getting leads. And so, yeah, what you're saying is exactly right. It's becoming increasingly difficult for investors to discern between signal and noise. It's part of why what we do, we think is so important because I have been steadfastly focused on this for a couple of decades. You can look at our track record and see, we've been tooting the same horn for a long time. And we think it's going to matter more now. I think the worst days are behind us because the zero interest rate policy is gone. We've got a Fed that is forced to reconcile with inflation and is not going just to drop rates because the market says it thinks it should. And in our stock picking track record on Seeking Alpha, on Sum Zero in our model portfolios speaks for itself. And yeah, so I can give you a couple of other names that we think are really attractive. Enterprise Products Partners L.P., ticker (NYSE:EPD), is one we like a lot. Similar story to Warrior Met Coal in terms of being in a business that is super profitable and positioned to grow, but been sort of shunned and disregarded because it's in the energy space. And one of the benefits from this business too is it's more in the transport of energy as opposed to the production. So, it benefits in good and bad markets because it's just a middleman taking a profit. And that's a good thing. They've got a very strong diversified transportation network. And look, I mean, that network can be used to transport traditional fossil fuels, as well as the greener kinds of fossil fuels like natural gas, which is, we think, going to continue to be in demand because it's the cleanest of the fossil fuels and is readily available. So that's another good one in the energy space. In the financial space, one of the stock that we've liked for a long time, been one of our top picks for a while and has performed really well, that's JPMorgan Chase & Co. (JPM). We think JPMorgan is a safer pick than the S&P. Because I think the S&P's got a lot of junk stocks in it, including Tesla, Inc. (TSLA). And it's carrying a lot of risk because so much dumb money and ETFs has just flown into it. And it just keeps allocating to these bigger market cap stocks. And valuation risk is just getting higher and higher. Whereas at J.P. Morgan, I know it's just one stock, but I think it's got a better risk-reward profile than the S&P because it is super high cash flow generating and got a really low risk valuation. The stock price for J.P. Morgan at 170 bucks implies its profits will permanently decline by 20%. So, you got a large margin of safety there. And we think investors deserve that. We really think that that's something people need to be mindful of. And with all the uncertainty in the market and an election, people need to be investing intelligently around risk reward. It's coming back. That's what high rates does. It forces people to acknowledge risk. When we had zero rates, there was no risk. There's risk now. RS: So, acknowledging some of that risk, you mentioned Tesla as a stock that you don't feel to be a worthy investment right now and given its inclusion in the S&P 500. Last time you were on, you were talking about Uber Technologies, Inc. (NYSE:UBER) being on your Zombie stock list, you've talked about Nvidia already, you published a sell article on it on Seeking Alpha a few months ago, how would you contextualize why you're bearish on those three stocks? I know they might be for different reasons, but how would you contextualize for investors there? DT: Yeah, Nvidia, Tesla, and what was the third one? RS: Uber. DT: Uber. Yeah, I mean, Nvidia is a different animal because it does have great fundamentals. And this is where I'm saying that the meme stock investors are getting smarter. You're not just investing in something because Wall Street dislikes it. I mean, Hertz Global Holdings, Inc. (HTZ), (AMC), I mean, they saved Hertz from bankruptcy. I mean, Hertz was going bankrupt, and they sold stock and stayed around. Same with AMC. So, these are complete junk businesses, right? And so, why not invest in something like Nvidia? Because the profits are strong. It's a great return on invested capital business. Used to be on our focus list until it got too expensive. But it's going – its stock, its valuation is at meme stock levels. I think if you read our report, you'll see something in there that the returns on capital have got to go to something like 300% and the company's got to grow revenues at 30% compounded annually for 20 years or something just incredible. And at that point in time, it's going to have revenues that's larger than the GDP of Mexico. Grow revenue at 30%, compounded annually for 15 years. That's what the current stock price, that's what it implied at $484. And what is it now? $694, goodness gracious. So, yeah, I kind of don't know what to say. I mean, the analysis, and we've done some great Reverse DCF case studies, which you can get from the Society of Intelligent Investors. They used to be on YouTube, but with large language models dissecting everything, we're taking them off of YouTube. But we did a reverse DCF case study, just outlining what the company had to do to justify the price. And it's I don't know what to tell you. It's looking at the numbers, it's just outrageous. There's few companies in the history of the world that have grown revenues at over 20% for a significant period of time, but to do so 30% for 15 years it's pretty outrageous. And that's again, that was for $484, not $600, $700 a share. We’re talking 30%, probably compounded annually for 20, 25 years, which is like, what'd the market share have to be at that point in time. It's like assumes there's no competition. It also assumes that margins are maintained at a current level of 38%, which is the highest ever. So that to simultaneously maintain high margins and extraordinary revenue growth for an extraordinarily long period of time, it doesn't happen. It's effectively impossible unless your technology is so good, and you can retain your employees so well that you never lose them and no one is ever able to copy you. Because all that – anybody else in the world wants to do is copy Nvidia's business model right now. So, the more profitable you are, the harder it is. That's the nature of a capital market. RS: Yeah, I was going to say, just in terms of Nvidia, I mean, you're talking about these extraordinary numbers and this extraordinary growth. And it's like, the fans will say, well, yeah, this is about to be an extraordinary business in an extraordinary time, maybe this is the stock to break all the records and to kind of put reasonableness on its face. DT: That's what's priced in. So, you know, that's already priced in. And I'm looking at that – that's often the argument. I hear this all the time about, what's a retail stock Wayfair? It's going to be the next Amazon. Snapchat (SNAP) is going to be the next Facebook (META), right? These are the narratives that typically bring these companies public. And Wall Street likes to pitch because it's easy comparison. Everyone likes to believe they're going to be in on the next great company. Well, there's only 5 or 6 of these companies around because that's all there ever is. It's very difficult, if not impossible, to be another Amazon or another Facebook. They're once in generation companies, another Google (GOOG), (GOOGL). And Nvidia is already priced to be that once in another generation company. RS: Fair enough. So, deeper thoughts on Tesla and Uber? DT: Very similar, very similar on those stocks. Tesla, we're seeing it happen already, I think pretty fast that this is a business that has competition. The first-mover advantage is gone and in that context, the growth embedded in the stock price is completely unrealistic. I'm not saying Tesla is a bad company or Musk is a bad person, I'm saying the economics of the business are not as good as people think because you've got to take out the regulatory credits because those won't be around forever as evidenced by every other legacy manufacturing car company producing electric vehicles now. And then you look at the future growth baked into the stock price, and it implies that Tesla has like 60%, minimum 60% market share. The most successful car company of all time, I'd say would be Toyota. I think the most market share they've ever had is 11%. So, Tesla 200 bucks implying it's going to own 60% of the electric vehicle market by 2031. Again, back to what you said before about Nvidia. Oh yeah, maybe, what about the people who say that Tesla is the next best, the next greatest thing, Elon Musk is going to change the world. I'm telling you it's already priced in and then some. And I'm also telling you that Tesla's already starting to lose market share outside of the United States in China and Europe. Market share growth in the US is effectively flat. Everybody's coming at them. They don't have a monopoly on the electric vehicle market in the way that you need to get to anything close to 60%. They're lucky to, I think, to eventually end up with 10. So, we think the stock's more like worth maybe 25, 30, realistically. And I've seen some other folks, Aswath Damodaran, has told me, David, you're right about Tesla if it's only a car company, but I'm giving credit to the solar panel and battery business. And I'm like, well, those businesses have done nothing. And everything I read about solar city is that State of New York got really a bad deal there. Battery technology is falling behind. They also talk about the self-driving technology falling behind, ranked last, I think, amongst the major firms. So, I just think that the other alternative businesses to save the Tesla stock are false narratives. And the evidence supports that. Uber. I mean, look, they don't make any money. Cash flow has been really pretty terribly negative for most of its life. And it's a commodity business. Tell me the value add. It's somewhat – it's a, someone drove the, it's just another form of a taxi. Last I checked, right, taxi businesses aren't billion dollar businesses, and I just - I don't know what else to say. I mean, it's a taxi business. Is it worth $160 billion valuation? It's got a return on invested capital of 5%. Economic earnings are negative. And yet, the valuation implies some absurd amount of growth. Absurd amount of growth. Yeah, it's a Zombie stock. Zombie stock number 12, out of about 26. And the valuation when we wrote this report was about half of what it is now. And at 32 bucks a share, the stock price implied the company had to improve its margins to a positive 4%, and they've been negative 6% most – negative most of its life and grow revenue by 31% compounded annually for a decade, at which point, it would have around $264 billion in revenue. And at its current take rate, its bookings would be 1.4 trillion or 178% of the total addressable market. Right now, they're at 72% of the total addressable market in ride share, 27% of food delivery, but the stock price at $32 a share implied 178%. So, it's $75 a share. We think it's just really overpriced and a business that I don't think ever sustainably makes money. They do specials, and they occasionally get profitable for a short amount of time, but I don't know if it's sustainable. RS: There also was news around a driver strike and how the business model is getting worse for the drivers. Does that figure into any of your thoughts there? DT: Yeah, absolutely. I mean, they have effectively convinced a lot of these drivers to operate at below cost because the drivers are taking into account the depreciation of the vehicles. And so, it's effectively an unprofitable activity that's going to catch up with them, and you're going to see more strikes like this. And look, I mean, the software they've created is not that difficult to create. We've seen other startup ride share companies emerge in other markets like Austin, where they didn't allow the Uber folks because they weren't providing background checks. You've got other models that are going to be more focused on safety and security, and maybe people will pay even a premium for that, but the point is that the competitive moat around Uber's business is really shallow. And the force of their employees, one of their key inputs is very strong. It's a very strong influence. And so, they're just not in a real position to be very profitable, ever. And yet the valuations implying enormous amounts of profitability and market share, and so, there's just – risk reward is bad. That's what it comes back to Rena, risk reward is bad. We want businesses that are profitable and have low expectations for future cash flows baked into their stock price. Low expectations for market share. We'd rather have market share losses implied, but when you've got a business with poor economics, poor competitive position, and evaluation that says they're going to take over the world and then some, 178% of the total adjustable market, I'm a hard pass. RS: I think in this world, it's more difficult to get smart at the same time that it's easier to get smart. There's so many ways. I mean, speaking to the signal noise ratio, but I think a lot of truthful nuggets in here that a lot of people would try and dispel, but I think a lot of smart ways to look at these things that a lot of people are looking at in different ways. David, as we wind down, anything that you feel like would behoove investors in addition to what you've already shared to be thinking about or not thinking about? DT: Yeah, I think just to understand the inherent conflict between people selling stock and research. So, Wall Street's in the business of selling stock. That's how Wall Street makes money. Wall Street does not make money selling research. I know I was on Wall Street. I was there during the tech bubble. I've seen how the sausage is made. So, be mindful of the signal-to-noise ratio when it comes to Wall Street research. They're in the business of selling stock. They don't make money selling research. So, research analysts that don't help the bank sell stock, they don't stick around. Just look up Mike Mayo, Credit Suisse, and you'll see a case study on an analyst who was fired because he wasn't as bullish as the bankers wanted him to be. And there's plenty of other papers and studies that support what I just showed you. The other thing is, doing due diligence is a worthwhile activity. Peace of mind matters. And so, I encourage you to look for firms whose research is transparent and independent and gives you reason to trust them because if you're doing good work, there's no reason you shouldn't share it. And I think if the research is not transparent, it's probably not transparent for a reason. So, understand the motivations of the people that are selling your research and writing reports and challenge their transparency. Because if you're doing good work, there's no reason you shouldn't show it. And if you're not showing it, it's probably for a reason. So, that's what I would lead people with. RS: Yeah, cheers to that. If I can ask one more question just in terms of earnings as we're in the thick of it, any general takeaways there? DT: I think it's going to be an interesting time. Look, we are coming out of a time when we saw companies throw the kitchen sink in on earnings where they purposely understated the earnings back during COVID and 2021, some of 2022 when markets weren't good. And so, in the second half of last year, we saw people take some of that money out of the cookie jar because when they understate earnings they set it aside later to use when markets are better. I think a lot of that's been used up. We are seeing an economy that is slowing in some places. It's not super-hot. And so, in conjunction with the Fed really trying to walk this tight line of a soft landing and investors getting smarter about capital allocation, not every company is going to be shooting the moon in terms of earnings. We're going to start to see the wheat separate from the chaff, good businesses and bad businesses. A lot of these meme stocks, Zombie stocks, are going to hit the skids. And when they do, they're going to get punished big time, as we've seen with something like Trupanion, Inc. (TRUP) and Peloton Interactive, Inc. (PTON) and Affirm Holdings, Inc. (AFRM) and other stocks here recently that have been down in a big way. CAVA Group, Inc. (CAVA), down 10%, Trupanion down 20% or 30% here recently. Affirm down 5% today. Just be careful, right. Live by the sword, die by the sword. So, if you rode this thing up on speculation and momentum, know that it can go down just as fast and just as brutally, if not more. So, earnings is going to be, I think earnings is going to be really more telling this year. This is not going to be when everybody's just doing great. And it's all the more time for Footnotes to be important, to understand the true numbers because companies can fake it for a little while. The cookie jar can last a while, but not forever. This article was written by "
}