{
    "title": "Week Ahead: FOMC Minutes, Nvidia Earnings | markets.com",
    "date": "2/16/2024",
    "url": "https://www.markets.com/news/week-ahead-investors-look-to-fomc-nvidia-earnings/",
    "text": "English\n                English (Global) English\n                English (EU) English\n                English (UK) English\n                English (AU) English\n                English (ZA) English\n                English (St. Vincent) Deutsch\n                German Español\n                Spanish (Latam) Español\n                Spanish (Spain) Français\n                French Dansk\n                Danish Italiano\n                Italian Nederlands\n                Dutch العربية\n                Arabic Svenka\n                Swedish Tiếng việt\n                Vietnamese Bahasa Melayu\n                Malay ภาษาไทย\n                Thai 繁體中文\n                Traditional Chinese 简体中文\n                Simplified Chinese Tagalog\n                Tagalog தமிழ்\n                Tamil हिन्दी\n                Hindi Português\n                Portuguese Bahasa Indonesia\n                Indonesian 한국어\n                Korean Forex Shares Commodities Indices Crypto ETFs Bonds Web Platform App MT4 MT5 Social Trading CFD Trading Calculator Forex Margin Calculator Commodities Profit Calculator Forex Profit Calculator Economic Calendar CFD Trading CFD Asset List Trading Conditions Trading Hours Expiration Dates Upcoming Trading Holidays Weekly Expiration Rollover Depth of Market Glossary Education Centre Trading Basics Video library News Trader's clinic Webinars Why markets.com Global Offering Our Group Careers FAQ Help Centre Contact Support Complaints Safety Online Cookie Disclosure Legal Pack Regulation English\n                English (Global) English\n                English (EU) English\n                English (UK) English\n                English (AU) English\n                English (ZA) English\n                English (St. Vincent) Deutsch\n                German Español\n                Spanish (Latam) Español\n                Spanish (Spain) Français\n                French Dansk\n                Danish Italiano\n                Italian Nederlands\n                Dutch العربية\n                Arabic Svenka\n                Swedish Tiếng việt\n                Vietnamese Bahasa Melayu\n                Malay ภาษาไทย\n                Thai 繁體中文\n                Traditional Chinese 简体中文\n                Simplified Chinese Tagalog\n                Tagalog தமிழ்\n                Tamil हिन्दी\n                Hindi Português\n                Portuguese Bahasa Indonesia\n                Indonesian 한국어\n                Korean Trade now Deposit Logout  Friday Feb 16 2024 12:31 5 min  It’s a busy week for economic data and earnings, with Nvidia set to provide the direction for equities whilst a lot of market focus will also be on the release of minutes from the last FOMC meeting. The Fed’s thinking on inflation is in the spotlight after last week’s CPI report indicated inflationary pressures persisting. Meanwhile PMI reports and earnings updates on Wall Street provide plenty for traders to stay interested.  Washington’s Birthday holiday sees Wall Street closed, which might keep liquidity a bit thin and mean some lack of direction for a lot of FX crosses and metals. Japan’s core machinery orders and UK house price data will provide some interest but by and large it’s a quiet start to the trading week as investors continue to digest the importance of the previous week’s US inflation print and what it could mean for the Federal Reserve.  The Reserve Bank of Australia’s monetary policy meeting minutes are due up early ahead of China’s loan prime rate decisions. Canada’s CPI inflation will be considered in terms of the Bank of Canada’s policy footing after the loonie suffered its worst daily decline against the greenback in almost a year last week. We’re also due monetary policy report hearings in the UK from the Bank of England, whilst US retail giants are due to report earnings and provide a snapshot of the health of the consumer. Earnings:  Medtronic (MDT), The Home Depot (HD), Walmart (WMT), Palo Alto Networks (PANW), Teladoc Health (TDOC)  It’s all about Nvidia earnings and FOMC meeting minutes. Nvidia’s had a couple of bullish price target upgrades in the last week, so expectations are clearly running high. UBS raised its price target on the stock to $850 per share from $580, whilst Mizuho Securities raised to $920 from $750. The market will be acutely focused on the guidance and whether, as UBS analysts alluded to last week, supply might be starting to outstrip demand. FOMC meeting minutes will be pored over for clues about when the first rate cut might come – last week’s inflation numbers have seen markets trim expectations for a move in May and now the consensus is coalescing around June. Earnings: Etsy (ETSY), Lucid Group (LCID), Nvidia (NVDA), Rivian Automotive  It’s PMI day! The monthly round of flash purchasing manager surveys comes around again and the focus will again be on Europe, where the picture has not been positive of late. Nevertheless, the downturn in Euro area manufacturing did show signs of easing in January. The HCOB eurozone manufacturing PMI was 46.6 last month, whilst the decline in input costs and output prices gained momentum. Meanwhile ISM survey data recently showed a pickup in US service sector growth in January. Final CPI inflation readings from the Eurozone are also due. Earnings:  Moderna (MRNA), Block (SQ)  The week rounds out in relatively subdued fashion with a holiday in Japan, the Reserve Bank of New Zealand’s latest statement of intent, and some UK consumer confidence numbers to contend with early on. The main economic data comes from Germany with the final GDP report and Ifo business climate survey. Earnings week closes with Berkshire Hathaway and the irrepressible Warren Buffett, with some now talking of the company as the next $1tn stock. Earnings: Berkshire Hathaway (BRK.B) When considering shares, indices, bonds, and foreign exchange (forex) for trading and price predictions, remember that trading CFDs involves a significant degree of risk and could result in capital loss. Past performance is not indicative of any future results. This information is provided for informative purposes only and should not be construed to be investment advice. Written by: Neil Wilson Asset List                                                                                                 Tags Directory Latest Thursday, 28 March 2024 5 min Thursday, 28 March 2024 4 min Thursday, 28 March 2024 3 min  Friday, 29 March 2024 Indices European IPO market notches biggest quarter since 2022 Friday, 29 March 2024 Indices Japan’s Nikkei index posts record point gain for fiscal year Friday, 29 March 2024 Indices Dow, S&P 500 index end short trading week at new records Friday, 29 March 2024 Indices Standard Chartered: Japanese yen intervention “very close” Contact Us Markets Trading Learn About Promo Partnership Contact Us Follow us on Listed on PaymentMethods The www.markets.com site is operated by Finalto (BVI) Ltd which is an authorized and regulated by the B.V.I Financial Services Commission (“FSC”) under the Securities and Investment Business Act, 2010, licence number SIBA/L/14/1067. Finalto (BVI) Ltd is located at 6th Floor Luna Tower, Waterfront Drive, Road Town, Tortola, VG1110, British Virgin Islands. Risk Warning: Trading Foreign Exchange (Forex) and Contracts For Difference (CFD) is highly speculative, carries a high level of risk and is not appropriate for every investor. Any advice provided on this website is general advice only, and has been prepared without taking your individual objectives, financial situation or needs into account. Before deciding to trade Forex/CFDs offered by markets.com, you should carefully consider your objectives, financial situation, needs and level of experience, and consider seeking independent professional advice. By trading, you may sustain a loss of some or all of your invested capital, therefore, you should not speculate with capital that you cannot afford to lose. You should be aware of all the risks associated with trading on margin. Please read the full Risk Disclosure Statement and Terms and Conditions. For privacy and data protection related complaints please contact us at privacy@markets.com. Please read our PRIVACY POLICY STATEMENT for more information on handling of personal data. Markets.com operates through the following subsidiaries: Finalto Financial Services Limited (FFS) is authorised and regulated by the Financial Conduct Authority (FCA), registration number 481853. Finalto Financial Services is incorporated in England and Wales under company number 06557752. Cryptocurrency CFDs are not available to Retail Clients. Safecap Investments Limited, which is regulated by the Cyprus Securities and Exchange Commission (“CySEC”) under license no. 092/08. Safecap is incorporated in the Republic of Cyprus under company number ΗΕ186196. Finalto (Australia) Pty Ltd is an Australian based company (ACN 158 641 064) regulated by the Australian Securities and Investments Commission (“ASIC”) under license no.424008. Finalto (South Africa) Pty Ltd is regulated by the Financial Sector Conduct Authority (“FSCA”) under license no. 46860 and licensed to operate as an Over-the-Counter Derivatives Provider (“ODP”) in terms of the Financial Markets Act no.19 of 2012. Finalto International Limited is registered  in the Saint Vincent and The Grenadines (“SVG”) under the revised Laws of Saint Vincent and The Grenadines 2009, with registration number  27030 BC 2023.      "
}