{
    "title": null,
    "date": "2/23/2024",
    "url": "https://asia.nikkei.com/Business/Markets/S-P-500-Dow-surge-to-record-closing-highs-as-Nvidia-sparks-AI-frenzy",
    "text": "Chipmaker's strong earnings and outlook lift entire U.S. stock market (Reuters) -- The S&P 500 and Dow Jones Industrial Average both surged to record closing highs on Thursday, powered by investors piling into growth and technology stocks the day after artificial intelligence poster child Nvidia's bumper earnings and outlook. For the S&P 500 benchmark, it was also the largest daily gain in 13 months. The Nasdaq Composite notched its biggest single-session advance in a year and just missed a record finish. Investors eagerly bought stocks as Nvidia shares jumped 16.4% after the chip designer forecast a roughly three-fold surge in first-quarter revenue on strong demand for its AI chips and beat expectations for fourth-quarter revenue. The company's earnings were a major test for the AI-fueled rally on Wall Street that first pushed the S&P 500 above the 5,000 point mark earlier this month. Some analysts had cautioned that disappointing results could spark a steep selloff among technology stocks. Instead, the S&P 500 ended at a record high, gaining 105.23 points, or 2.11%, to 5,087.03, as did the Dow Jones Industrials, which closed at 39,069.11 after rising 456.87 points, or 1.18%. It was the first time the Dow has ever finished above 39,000 points. The Nasdaq Composite added 460.75 points, or 2.96%, to 16,041.62. \"As Nvidia goes, so goes the world,\" joked Jack Janasiewicz, lead portfolio strategist at Natixis Investment Managers Solutions. He noted how Nvidia's earnings performance trounced high market expectations, showing doubters that plenty of juice was left in the AI trade after the recent rally. \"When do you sell -- maybe you don't. Maybe there's still room, and I'm happy to sit and ride it out,\" Janasiewicz added. Nvidia added $277 billion to its market capitalization, beating Meta Platform's $196 billion surge earlier this month as the biggest one-day gain by any company in Wall Street history. Those shorting Nvidia stock were left nursing more than $2.9 billion of paper losses, per data from Ihor Dusaniwsky, managing director of predictive analytics at S3 Partners. The benchmark index will finish this year above the 5,000 mark, according to strategists in a Reuters poll. All but one of the 11 major S&P 500 sectors rose, with technology stocks leading gains with a 4.4% increase. The outlier was utilities, which slipped 0.8% The S&P 500 growth index advanced 3.3%, its biggest daily percentage gain since November 2022. Shares of other companies, seen as beneficiaries of the AI boost, also got a shot in the arm. Nvidia's rival Advanced Micro Devices, server component supplier Super Micro Computer and Arm Holdings jumped between 4.2% and 32.9%. Synopsys soared 6.9%, to a record finish, after the software maker for chip designers reported estimate-beating earnings and outlook. Also posting a record close was the Philadelphia Semiconductor index, with its 5% increase its largest one-day gain since October. Big Tech and growth stocks such as Alphabet, Microsoft and Meta Platforms climbed between 1.1% and 3.9%. Elsewhere, vaccine maker Moderna jumped 13.5% after surprising investors with a fourth-quarter profit. The stock's technicals also pointed to a bullish outlook. However, Rivian and Lucid tumbled 25.6% and 16.8%, respectively, after the electric vehicle startups forecast 2024 production well below analyst estimates on slowdown in demand. The volume on U.S. exchanges was 11.93 billion shares, compared with the 11.64 billion average over the last 20 trading days. Discover the all new Nikkei Asia app Nikkei Asian Review, now known as Nikkei Asia, will be the voice of the Asian Century. "
}