{
    "title": "S&P 500 Earnings: Walmart And Nvidia Report This Coming Week",
    "date": "2/18/2024",
    "url": "https://seekingalpha.com/article/4671288-s-and-p-500-earnings-walmart-and-nvidia-report-this-coming-week",
    "text": "Javier Ghersi/Moment via Getty Images  Javier Ghersi/Moment via Getty Images Nvidia’s (NVDA) weighting in the various indices/ETFs: Recent analyst target price changes: Nvidia reports Wednesday, 2/21/24 after the closing bell. Per Briefing.com, Street consensus expects $4.59 in EPS on $20.4 billion in revenue. (Clients have no direct investment in NVDA shares, but instead are long primarily through QQQ and SMH.) Walmart (WMT) reports Tuesday morning, February 20, 2024, before the opening bell. When Walmart reported their Q3 ’24 in mid-November ’23, the stock fell from $170 to $150 in the days following on a gross margin miss, and some not very well-explained one-time litigation charges. Here is this blog’s earnings preview for Walmart’s Q4 ’24 (ends January ’24). Like Alphabet (GOOG) (GOOGL), Amazon (AMZN), and Meta (META), Walmart is getting into advertising, which could help margins over and above what AI and supply chain automation might achieve in terms of margin expansion. S&P 500 data: Summary/conclusion: Some say Q4 ’23 earnings season unofficially ends this week, and this clip from this blog’s quarterly EPS and rev growth rate from LSEG’s “earnings scorecard” shows that expected Q4 ’23 EPS growth rate is now 9.6% versus 4.4% expected in early January ’24. Q4 ’23 earnings wound up much stronger than expected for Q4 ’23, on mainly inline revenue growth.  Look at that round trip in “expected” S&P 500 EPS growth starting at the peak on 9/30/23, and then through Friday, 2/16/24. This happens more than you think. Thursday night, February 15th’s earnings reports from Applied Materials (AMAT), Trade Desk (TTD) and Coinbase (COIN) were very strong. It would be great to see Nvidia pull back 10% this week, but with AMAT’s report it also tells me “old semis” like Applied, Micron (MU) are still in the good part of the cycle. The 2nd half of February calendar returns have not been great. I was trying to find the bar chart with 100 years of history on how/where the 2nd half of February returns were displayed (couldn’t find it) but it’s one of the worst 2-week periods of the year. The S&P 500, the Nasdaq 100 and QQQ could use a good flush. None of this is advice or a recommendation. Past performance is no guarantee of future results. Investing can involve the loss of principal, even with short time horizons. Readers should gauge their own comfort with portfolio volatility and adjust accordingly. Thanks for reading. Original Post Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}