{
    "title": "NVDA Stock Price Predictions: Can Nvidia Really Hit $800 From Here?",
    "date": "2/5/2024",
    "url": "https://investorplace.com/2024/02/nvda-stock-price-predictions-can-nvidia-really-hit-800-from-here/",
    "text": " NVDA stock is up on the new price target Advertisement Source: Sergio Photone / Shutterstock.com Nvidia (NASDAQ:NVDA) stock is gaining on Monday after Goldman Sachs analysts set a new price target for the technology company’s shares. Goldman Sachs analyst Toshiya Hari increased the price target for NVDA stock from $625 per share to $800 per share. That has the firm expecting a potential growth of 20.9% for the company’s shares over the next 12 months. It’s also an incredibly bullish price prediction compared to the analysts’ consensus of $612.68 per share. The latest coverage of Nvidia also has the Goldman Sachs analyst reiterating his “buy” rating for the company’s shares. For comparison, the analysts’ consensus rating for NVDA is a moderate buy based on 39 opinions. Here’s what Hari had to say about Nvidia and the price target increase in a note to clients obtained by CNBC: “Consistent with recent years and quarters, we expect Nvidia’s FY4Q (January) results and FY1Q (April) outlook in its core Data Center segment to illustrate the ongoing wallet share shift from general-purpose compute (i.e. CPU) in favor of accelerated computing (i.e. GPU).” NVDA stock is up 3.1% as of Monday morning and is up 37.4% year-to-date as of Friday’s close. Investors seeking out even more of the most recent stock market stories are going to want to stick around! We have all of the hottest stock market news that traders need to know about on Monday. A few examples include what’s going on with shares of Polestar (NASDAQ:PSNY), NanoString Technologies (NASDAQ:NSTG) and Cano Health (NYSE:CANO) stock today. You can catch up on all of these matters at the links below! On the date of publication, William White did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Artificial Intelligence, Semiconductor, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/nvda-stock-price-predictions-can-nvidia-really-hit-800-from-here/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}