{
    "title": "Some investors switch direction as Nvidia and AI stocks soar",
    "date": "2/24/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240224194/some-investors-switch-direction-as-nvidia-and-ai-stocks-soar",
    "text": "By Philip van Doorn Also, warnings as the stock market sets records, why tech investors should look beyond P/E and advice from the Moneyist. Coverage of the stock market has been dominated by Nvidia Corp. this week, as another eye-popping set of numbers has made the case that we are still in an early phase of the infrastructure rollout to support artificial intelligence technology. Nvidia (NVDA) added a record $277 billion to its market capitalization on Thursday as it propelled a surge for exchange-traded funds that track AI and related technology companies. But something else has been happening, as explained by Isabel Wang in the ETF Wrap newsletter, with record inflows of new money into a different pocket of the stock market. Nvidia's results and the reaction Therese Poletti looked beyond sales growth to focus on Nvidia's improving profit margins. Steve Goldstein shared a chart that paints Nvidia in contrast to the other members of the \"Magnificent Seven\" group of companies: Microsoft Corp. (MSFT), Apple Inc. (AAPL), Amazon.com Inc. (AMZN), Meta Platforms Inc. (META), Alphabet Inc. (GOOGL) and Tesla Inc. (TSLA). More reaction to Nvidia: Super Micro's stock enjoys near-historic surge upon Nvidia fervor'AI bubble is not in trouble.' History shows Nvidia's blistering post-earnings rally won't fade, says Citi.Dow Jones Newswires: Nvidia Lists Huawei as an AI Chip-Making Rival for the First TimeNvidia earnings spark records across chip sector, and AMD's stock popsNvidia's surge ripples across stock market - lifting AI, tech and semiconductor ETFsIt turns out, the better way to play Nvidia's success was FTXJensen Huang sees wealth increase by $9.6 billion on Nvidia's share price surgeNvidia's growth and Intel's chip-making plans depend on AI fulfilling its promiseAfter Nvidia's latest blowout, here are 20 AI stocks expected to rise as much as 44% Stock-market warnings A period of exuberance, with the S&P 500 SPX and Dow Jones Industrial Average DJIA hitting record highs on Thursday, leads to inevitable warnings. Some of the warnings are based on what is perceived to be a high valuation for the market as a whole. The forward price-to-earnings ratio for the S&P 500, based on Thursday's closing prices and weighted earnings-per-share estimates for the next 12 months among analysts polled by FactSet, was 20.2, up from 17.9 a year earlier. Here are long-term average forward P/E ratios for the index: Here's how the S&P 500's current forward P/E compares to the long-term averages: And now for the warnings: R.I.P. the 'Magnificent Seven' says analyst who coined the big-tech moniker. Here's why.The AI boom of today and the telecom bubble of 1990s share these similaritiesStock-market investors fear short-volatility bets could crush the rallyThree things could pop megacap stock bubble - and 'weigh heavily' on broader marketStock-market investors should still brace for '70s-style 'stagflation,' warn strategistsWall Street keeps likening Nvidia to dot-com-era Cisco. Is the comparison justified?Hulbert: Think the S&P 500 is top-heavy? Five stocks command 60% of this market. Nvidia makes the case for looking beyond P/E ratios An aversion to high P/E ratios might cause investors to miss out on extraordinary growth. Wedbush analyst Dan Ives wrote in a note to clients on Thursday that \"investors that have missed the biggest transformational tech stocks the last decade, including Amazon, Netflix, Meta, Apple, Alphabet among many others, have dogmatically stuck with the forward P/E valuation approach on these unique tech stories.\" He wrote that for \"transformational tech stories,\" including Nvidia and the other companies involved with the AI build-out, \"investors must see the forest through the trees to where this spending wave (and estimates) can head over the next 3 years.\" Nvidia's forward P/E ratio was 31.6 early Friday, reflecting rising estimates for the company's profit over the next year, as well as this week's price increase. The stock's forward P/E was 52.6 a year ago. Meanwhile, the share price has risen 232%. Back to the moon - there is money to be made For the first time since 1972, a U.S. spacecraft landed on the moon on Thursday. Shares of Intuitive Machines Inc. (LUNR), which built the Odysseus lander, were up 24% for one week through Thursday. The stock was up another 17% Friday morning. James Rogers covered the Odysseus landing, and before that had an email exchange with Apollo 17 astronaut Harrison Schmitt, who walked on the moon in 1972 with Gene Cernan, the mission commander. Here's what Schmitt had to say about the moon's potential for investment and development. Advice from the Moneyist This week Quentin Fottrell - the Moneyist - helped a woman whose parents have died, but whose sister seems not to be motivated to settle their estate. More from the Moneyist: I have $1.5 million in stocks and bonds. I asked my broker to convert my bonds to cash. He didn't and my portfolio fell by $100,000. Can I sue? Two years since Russia invaded Ukraine When Russia began its invasion of Ukraine on Feb. 24, 2022, some expected a quick surrender. But the battle continues. Sanctions against Russia by the U.S. and other governments have helped to cause a contraction of the invader's economy. Hundreds of Western companies have also taken action against Russia, as James Rogers reported. How one active fund manager keeps things simple and beats the market Michael Brush interviewed Ryan Kelley, who co-manages the Hennessy Cornerstone Mid Cap 30 Fund HIMDX, which has been an outstanding performer and has a five-star rating (the highest rating) from Morningstar. Kelley outlines five investing lessons - one of them is to be optimistic. Passive vs. active investing: Has it become easier to beat index funds? Thoughts on retirement and planning for it Beth Pinsker interviewed Jacques Torres, who is now 65 and talks about his business's changing fortunes and plans for retirement at his chocolate factory in Brooklyn. Mark Hulbert has been inundated with material from brokerage firms and money managers with results of retirement-readiness surveys. Here's what he thinks of the surveys and what might be a better approach for people and their financial advisers to take when thinking of retirement. In the Help Me Retire column, Alessandra Malito helped a woman in her early 30s to decide whether or not to raid her tax-deferred retirement account to pay for tuition as she heads back to college. Want more from MarketWatch? Sign up for this and other newsletters to get the latest news and advice on personal finance and investing. -Philip van Doorn This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 02-24-24 0522ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}