{
    "title": "Nvidia Hit With Lawsuit For Allegedly Using Copyrighted Works Without \nPermission To Train Its AI Platform",
    "date": "3/10/2024",
    "url": "https://www.tradingview.com/news/benzinga:d5f1a28ab094b:0-nvidia-hit-with-lawsuit-for-allegedly-using-copyrighted-works-without-permission-to-train-its-ai-platform/",
    "text": "NVIDIA Corp NVDA has been sued by three authors for allegedly using their copyrighted works without permission to train its AI platform. What Happened: The lawsuit was filed on Friday in a San Francisco federal court by authors Brian Keene, Abdi Nazemian, and Stewart O’Nan, Reuters reported. The authors claimed that their works were part of a dataset of approximately 196,640 books used to train Nvidia’s NeMo AI platform to simulate ordinary written language. The dataset was reportedly taken down in October due to reported copyright infringement. The authors are seeking unspecified damages for individuals in the United States whose copyrighted works were used to train NeMo’s large language models over the last three years. The lawsuit includes works such as Keene’s “Ghost Walk,” Nazemian’s “Like a Love Story,” and O’Nan’s “Last Night at the Lobster.” Despite the lawsuit, Nvidia’s stock has been performing well. The company’s stock price has risen by almost 600% since the end of 2022, giving Nvidia a market value of nearly $2.2 trillion. Nvidia chose not to provide a comment on Sunday. Attorneys representing the authors did not respond immediately to requests for further comment on Sunday, according to the report. See Also: Bitcoin, Ethereum, Dogecoin Spike As BTC Eyes All-Time Highs Again: Analyst Says ‘Keep An Eye On Crucial Levels’ For King Crypto Why It Matters: The lawsuit against Nvidia comes at a time when the company is facing other challenges. On Mar. 9, Nvidia’s shares fell by 5.55%, marking the end of a six-session winning streak. This decline was accompanied by a warning of further downside from a portfolio manager, Jeff Kilburg, founder of boutique investment management firm KKM Financial, who noted that Nvidia lost about $225 billion in market cap from its intraday peak. Despite this, Nvidia’s stock has been on a remarkable surge, leading to discussions about a potential stock split to make shares more accessible, especially to small retail investors deterred by the high share price. However, money manager Cathie Wood has raised concerns about a potential market correction in the semiconductor sector, which could impact Nvidia’s future performance. Despite these challenges, Nvidia’s stock price has risen almost 600% since the end of 2022, giving Nvidia a market value of nearly $2.2 trillion. Read Next: Dogecoin ‘Looks Like It’s In Trouble’, Warns Crypto Analyst, Sees DOGE In For A Deeper Correction: ‘Wear An Extra Shirt Incase You Lose The First One’ Image Via Shutterstock Engineered by Benzinga Neuro, Edited by Kaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}