{
    "title": null,
    "date": "3/28/2024",
    "url": "https://www.benzinga.com/news/24/03/37978815/the-most-bought-ai-stock-by-congress-isnt-nvidia",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW NVIDIA NVDA ushered in a new age with the surge of AI and its lean into full-stack AI services. The company's leadership position is reflected in its results and stock price, which is still advancing. Members of Congress are on board the NVIDIA freight train, but it isn't the most bought AI stock for the group. That title goes to Microsoft MSFT, which has a commanding lead over the No. 2 AI stock, NVIDIA. More Congress members bought NVIDIA than Microsoft, but that is where the dominance ends for this tech stock. 10 members made 17 purchases of NVIDIA totaling about $3.186 million, while eight members made 24 trades in Microsoft totaling about $31.7 million — nearly 10 times as much. If that doesn't register as an opportunity for investors, they aren't listening hard enough. Who's buying NVIDIA? Members on both sides of the aisle from both houses bought NVIDIA. But Democrats, specifically Nancy Pelosi, purchased the bulk of shares. Representative Pelosi bought more than $1 million in late November, just before the stock price began to rally and double. Other members of note include Representatives Pete Sessions (R-TX) and Kathy Manning (D-NC), as well as Senator Markwayne Mullin (R-OK), who are all reasonably active investors. Each made more than one purchase during the year. The list of Congressional investors buying Microsoft is equally distinguished. including the same members. Again, the bulk of purchases are by Democrats, but buyers exist from both houses and on both sides of the aisle. For Microsoft, the largest buyer is Representative Josh Gottheimer (D-NJ), who purchased several millions worth of the stock. The second largest purchaser is Representative Pelosi, who bought at least $500,000 worth of shares. Republicans on the list include Representative Sessions, Representative Michael Guest (R-MS) and Senator Mullin. Extremely bullish market sentiment for Microsoft is likely to propel the stock to new highs. Microsoft is a Most Searched and Most Followed Name among Markebeat subscribers, also holding the 4th position on Marketbeat's Most Upgraded Stock list and is featured on our Top-Rated Stocks. The analysts' sentiment is noteworthy because Microsoft is gaining new coverage. The sentiment is edging upward from Moderate Buy and on the cusp of a strong Buy, and the price target is trending higher. At the end of March, the consensus of $423 assumes fair value at current price points but is up 50% YOY and being led higher by analysts. Every price target issued since late November 2023 is above the consensus, and all targets issued since the Q4 release are above $450. The latest revisions include a new price target from Wedbush, which adds 17% to the consensus. Analysts are also leading NVIDIA. The analysts' activity over the last twelve months has NVIDIA stock in the No. 1 position as Most Upgraded, and the upgrade cycle is unlikely to end now. The company is expected to post another 240% YOY gain in revenue, and the forecasts may be light. NVIDIA is the leading supplier of chips for AI and is leaning hard into partnerships with everyone, including Microsoft, to build out its AI empire. Microsoft's technical outlook is bullish. The market broke out of a trading range late last year and signaled a continuation of long-term trends that could lead it up to the $490 level. That target aligns with the Wedbush target and still leaves another $100 of upside at the range's high end. That target has also been recently reiterated by Truist, which sees AI and Copilot driving outperformance this year. The article \"The Most Bought AI Stock by Congress Isn't NVIDIA\" first appeared on MarketBeat. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}