{
    "title": "Have Investors Missed the Boat on Nvidia?",
    "date": "3/2/2024",
    "url": "https://www.fool.com/investing/2024/03/02/have-investors-missed-the-boat-on-nvidia/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) has been one of the top investment stories this year and last. Since the start of 2023, the stock has risen over 440%. Nvidia's sheer size makes this rise even more impressive, as it is now the third-largest U.S. company behind Microsoft and Apple. Because of this unbelievable rise, many investors (including myself) have missed out on some or all of this rise. But that doesn't mean you can't buy now. But should you? Let's find out. Nvidia is at the core of the artificial intelligence (AI) revolution. The computing power required to create advanced AI models is immense, and Nvidia's GPUs are the best in the world at performing this task. GPUs (graphics processing units) were created to process the calculations needed for gaming graphics, but their ability to efficiently process other workloads, like engineering simulations, drug discovery, and mining cryptocurrency, made their usage more widespread. While a single GPU might be used for basic engineering simulations or a gaming computer, complex tasks like AI model training require hundreds or thousands of GPUs. With Nvidia's flagship GPU for data centers (the H100) rumored to cost around $30,000 a piece, it's easy to see why Nvidia's business has taken off with the AI gold rush beginning. Getting the computing power necessary to train AI models is essentially the first task for any company interested in creating its own AI product. Purchasing a dedicated supercomputer isn't necessary for companies; these businesses can also rent computing power from cloud computing giants, who are also building out capacity for computing power that can be rented. As a result, Nvidia's business has boomed, with revenue rising 265% year over year to $22.1 billion. Furthermore, it accelerated 22% from the previous quarter, which shows demand is increasing. But just how long can this demand keep up? That question will determine if investors have missed out on Nvidia. Unfortunately for investors, Nvidia doesn't provide a full-year outlook; management just offers a peek into the next quarter. Still, it gave guidance for revenue of $24 billion, indicating 234% revenue growth. That's an impressive figure and showcases how strong the demand is for GPUs. However, third-party market research firms also believe this demand will persist for many years. Global Market Insights expects the GPU market to reach $400 billion in 2032. With Nvidia posting revenue of $60.9 billion in fiscal year 2024, it's clear that it could continue to rise for some time. This is a positive note for investors, as Nvidia is a hardware company. Because Nvidia's products are one-time buys, purchasing additional GPUs isn't necessary unless a company wants to increase its computing power. This concerns many investors (including myself), as demand for Nvidia's GPUs may drop once initial computing capacity is built out. But with many market research firms confirming that this is just the beginning of the AI boom, it eases my mind to buy Nvidia stock. Additionally, Nvidia's valuation isn't as far-fetched as it once was. When valuing a company going through a massive transformation or growth phase, using the trailing price-to-earnings (P/E) ratio isn't wise, as it looks inflated. But if you utilize forward earnings, you can see what the company may look like in one year by utilizing analyst projections instead of older results. This is one situation where forward-looking estimates can be more useful than the proven results of yesteryear. If you do this with Nvidia, its price tag doesn't look too lofty anymore.  NVDA PE Ratio data by YCharts. A forward P/E of 32 isn't that pricey, especially when Microsoft trades for 35 times forward earnings and Apple trades for 28. So, have investors missed the boat on Nvidia stock? Yes. Nvidia won't be able to increase five times in value in just over a year again. But can it be a market-beating investment in the future? I think so. The demand for GPUs will only continue to increase for a while, and Nvidia is set to cash in on this transition. Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}