{
    "title": "Dell Is Hoping To Build A Brighter Future With Strategic AI Partnerships",
    "date": "3/4/2024",
    "url": "https://www.tradingview.com/news/benzinga:2290760ca094b:0-dell-is-hoping-to-build-a-brighter-future-with-strategic-ai-partnerships/",
    "text": "On Thursday, Dell Technologies Inc DELL surpassed both top and bottom-line analyst expectations with fiscal 2024 fourth-quarter results. Upon results, Dell shares popped almost 20% as through its ongoing partnerships with AI leaders including Nvidia Corporation NVDA and Advanced Micro Devices AMD, AI tech advances enabled Dell to report significant gains. Fourth fiscal quarter highlights For the quarter ended on February 2nd, Dell reported revenue dropped 11% YoY to $25.04 billion. But net income increased 89% YoY to $1.16 billion. Revenue segmentation Infrastructure Solutions Group (ISG) brought in 9.3 billion to the revenue table and although it was a 6% YoY drop, the figure is a 10% increase from the previous, third, quarter. Servers and networking were the main revenue fuels with $4.9 billion of revenue being driven by AI-optimized servers. Storage revenue observed a 16% sequential increase as it brought in $4.5 billion. Client Solutions Group (CSG) observed a 12% YoY drop to $11.7 billion, including $9.6 billion in commercial client revenue that reported a 11% YoY rise and $2.2 billion in consumer revenue that tanked 19% YoY. Fiscal year highlights Fiscal year revenue dropped 14% YoY to $88.4 billion, but still topped estimates. Dell made a net income of $7.7 billion, smashing the consensus estimate of $4.9 billion. Full-year ISG revenue tanked contracted 12% YoY to $33.9 billion. Full-year CSG revenue also contracted 16% YoY to $48.9 billion. Chief Operating Officer Jeff Clarke spoke of the company’s strong AI-optimized server momentum with orders expanding nearly 40% sequentially and backlog nearly doubling, ending the fiscal year with $2.9 billion. Outlook built on AI potential and the power of joined forces For its first quarter, Dell guided for revenue between $21 billion and $22 billion. Encouraged by AI momentum around AI, Dell expects to return to growth during fiscal 2025. However, Dell acknowledged the pressure of the macroeconomic environment due to which some customers are approaching infrastructure investments cautiously. Despite macroeconomic pressures, Dell is hoping for a brigther future built on AI  strategic investments. Last year, Dell announced a joint initative with Nvidia. Through project Helix, Dell and Nvidia embarked on a journey to make it easier for businesses to quickly develop and use generative AI models to securely deliver quality customer service, along with a range of capabilities. With this project, Dell and Nvidia will support the complete lifecycle of generative AI. Dell also ended 2023 by expanding its partnership with AMD. Dell’s PowerEdge XE9680 server will support the AMD Instinct™ MI300X accelertor, a CPU-GPU design for AI workloads. With its latest chip, AMD is promising to challenge the AI chip dominance that Nvidia enjoyed. AMD claims that the MI300X chip offers superior memory capacity and bandwith compared to Nvidia-made chips. Undoubtedly, AMD’s Instinct MI300 series marked a pivotal moment, bringing a promise of a potential power shift in the AI chip landscape. Dell is betting its recovery on strategtic AI investments. As a testament to its business self-confidence, it announced it will increasing its annual dividend by 20% to $1.78 per share. DISCLAIMER: This content is for informational purposes only. It is not intended as investing advice. This article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}