{
    "title": "Nvidia cements AI leadership with more powerful CPU, in this week's R&D \nPower Index - Research & Development World",
    "date": "3/25/2024",
    "url": "https://www.rdworldonline.com/nvidia-cements-ai-leadership-with-more-powerful-cpu-in-this-weeks-rd-power-index/",
    "text": "Research & Development World By Tim Studt | March 25, 2024  The R&D World Index (RDWI) for the week ending March 22, 2024, closed at 3,686.22 for the 25 companies in the RDWI. The Index was up 1.92% (or 69.27 basis points). Click to enlarge. Fourteen RDWI members gained value last week from 1.45% (Meta Platforms) to 8.59% (Toyota).  Eleven RDWI members lost value last week from -0.08% (AstraZeneca PLC) to -4.04% (Roche Holdings AG). The leader in AI microprocessors, Nvidia, Santa Clara, California, held a large technology conference last week in San Jose, California (and online). The GTC (GPU Technology Conference) 2024 made 40 separate product announcements, including the release of its next-generation AI GPU microprocessor, the B200 Blackwell, operating 30 times faster than its predecessor, the H100 Hopper. That predecessor currently costs about $25,000 each, and the B200 will likely cost between $30,000 and $40,000. The B200 is expected to ship this summer. Nvidia’s CEO, Jensen Huang commented that the R&D budget for creating the B200 was close to $10 billion, which he hopes to recoup with future sales. Among its many announcements, the company announced the creation of a GPU family of chips that can be used for humanoid robotic applications. The company continues to form business relationships with the likes of Amazon Web Services, Microsoft, Google, and Oracle. The company has an 80% market share in AI microprocessors. RDW Index member Apple, Cupertino, California, was noted last week as having preliminary talks with Internet service provider Baidu, Beijing, China, concerning using the company’s generative AI technology in Apple devices in China. Apple also had discussions with Google and OpenAI about using their AI technologies. Sourcing AI in China through Baidu would prevent regulatory bottlenecks for Apple products. Apple competitor Samsung uses Baidu’s Ernie software in China to power its Galaxy AI features. Apple’s discussions with outside firms, including Baidu, reveal that Apple has not managed to develop internal tools as sophisticated as other dominant AI players. RDW Index member Cisco Systems, San Jose, California, announced last week that it had closed its $28 billion all-cash acquisition of cybersecurity and analytics company Splunk, San Francisco. Companies are making extraordinary efforts to remake their businesses around data and AI. For example, Cisco completed it’s the largest deal in its history,months earlier than the projected date. The CEOs of both companies stated that AI will be deeply woven into the combined firm and that their current wave of business AI adoption will not slow. The U.S. Federal Reserve, as expected, held interest rates steady last week in their regularly scheduled meeting. Fed chair Jerome Powell however, commented that his outlook on inflation to continue has not changed substantially in recent weeks. The Fed’s projections and Powell’s remarks left a clear impression that the Fed will reduce interest rates once or twice in 2024 with their benchmark rate settling out just below 4% by the end of 2025 and slightly above 3% after that. Following through on the 2022 U.S. Chips Act, the U.S. Department of Commerce granted RDW Index member Intel, Santa Clara, California, last week up to $8.5 billion to help fund new semiconductor chip manufacturing plants in Arizona, New Mexico, Ohio, and Oregon. Intel is likely to be the biggest recipient of these types of funds under the Chips Act. The company could also draw on up to $11 billion in government loans. Intel also plans to apply for related tax credits. RDW Index member AstraZeneca (AZ), Cambridge, U.K., announced last week that it was buying Fusion Pharmaceuticals, Hamilton, Ontario, Canada, for up to $2.4 billion as part of a plan to accelerate the development of next-generation cancer treatments. AZ already had a collaboration with Fusion, but the deal deepens AZ’s commitment to the field and gives it access to a next-generation radioisotope, actinium-225. Radiopharma is a nascent field and there are few late-stage assets remaining for big pharma to target. Members of the European trade group Cloud Infrastructure Service Providers of Europe (CISPE) said last week that changes taking place within the Broadcom-VMware partnership (both are in Palo Alto, California) mean that companies that license and resell VMware software will need to eat higher costs internally to pass them on to customers. CISPE said that as a market leader in the cloud visualization sector, Broadcom’s Vmware should be regarded as a gatekeeper under the terms of the European Union’s Digital Markets Act. CISPE asked European and national regulatory bodies to institute a freeze on the termination of existing contracts. BMW, Munich, Germany, spending on capital expenditures (capex) and R&D for 2024 are forecast to be 6% and 5% respectively of the company’s revenue. These data are well above BMW’s long-term targets and led to an underwhelming free cash flow guidance of more than $6.6 billion for 2024. The company’s capex has been steadily rising in recent years from 4% of revenue in 2020 to 5.7% in 2023 and now above 6% in 2024. Their long-term target is below 5%. The reason for the rise is that the company is getting ready for its next generation of electric vehicles (EVs) — the Neue Klasse — which the company will introduce in 2025. The company expects the current slowdown in EV sales to resume in 2025.  R&D World’s R&D Index is a weekly stock market summary of the top international companies involved in R&D. The top 25 industrial R&D spenders in 2020 were selected based on the latest listings from Schonfeld & Associates’ June 2020 R&D Ratios & Budgets. These 25 companies include pharmaceutical (10 companies), automotive (6 companies), and ICT (9 companies) which invested a cumulative total of nearly 260 billion dollars in R&D in 2019, or approximately 10% of all the R&D spending in the world by government, industries, and academia combined, according to R&D World’s 2021 Global R&D Funding Forecast. The stock prices used in the R&D World Index are tabulated from NASDAQ, NYSE, and OTC common stock prices for the companies selected at the close of stock trading business on the Friday preceding the online publication of the R&D World Index. Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ Browse the most current issue of R&D World and back issues in an easy to use high quality format. Clip, share and download with the leading R& magazine today. Copyright © 2024 WTWH Media LLC. All Rights Reserved. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of WTWH Media Privacy Policy  | Advertising  | About Us "
}