{
    "title": "Zacks Investment Ideas feature highlights: Nvidia, Meta Platforms, Cadence \nDesign Systems and Amazon",
    "date": "3/1/2024",
    "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-142200274.html",
    "text": "Chicago, IL – March 1, 2024 – Today, Zacks Investment Ideas feature highlights Nvidia NVDA, Meta Platforms META, Cadence Design Systems CDNS and Amazon AMZN. This article's title, \"It's a bull market you know!\" is a quote from a famous investing book Reminiscences of a Stock Operator, which accounts the life of famous speculator Jesse Livermore. The book, which is a must read for any stock trader, details the wins and losses of Livermore's volatile life and shares many of his formative learning experiences. One of his earlier lessons occurred while he was hanging out at a brokerage firm he traded with. There he met a market veteran who went by the name Old Turkey. Up until this period Livermore was a very active trader, buying and selling shares at a high frequency, sometimes multiple times during the day. But this phrase from Old Turkey \"It's a bull market you know!\" stuck with Livermore. Old Turkey would repeat it over and while at first, he thought it was just a platitude he learned that it held much deeper insights than that. Instead of trading in and out of stocks, taking profits and waiting for a dip to buy again, this phrase was an encouragement to hold on to you winners for as long as possible. Bull markets often endure much longer than investors expect. In fact, the US stock market spends the vast majority of time in bull markets that steadily grind higher, climbing a wall of worry. This insight deeply changed the way Livermore approached the market. Instead of quick profits he now focused on the big trends and owning the leading stocks for as long as the bull market persisted. Although Livermore's trading was marked by wild boom and busts, it was his overuse of leverage that was his Achilles heel. In fact, he would make huge profits riding these longer-term bull moves and occasional bear markets. The current market regime is one that has a litany of bullish tailwinds, and we are likely closer to the beginning of this bull market than the end. The factors include: - AI revolution: The hype is real – AI tech could be as influential as the internet has been and will make major contributions to productivity gains. - Strong economic growth: The US economy is showing above trend growth surprising nearly all economists on wall street. - Interest rate cuts: It won't be long before the Fed begins to lower rates again, beginning the expansionary cycle again. Often, as a stock makes incredible gains, you will hear very loud voices talking about how \"it has gone too far!\" Just look at the commentary surrounding Nvidia, these traders have been saying this month after month, yet the stock pushes higher. Leading stocks lead for a reason, and in this current market they are leading because of growing sales and earnings. That is the opposite of hype and exactly what you want to see strong stocks do. After a little more than a year of using the Zacks Rank I have been continuously impressed by its ability to pick big winners. Nvidia and Meta Platforms sat on the list for the majority of 2023, when most analysts doubted them, yet they were the biggest winners in the S&P 500. There are a handful of stocks sitting on the Zacks Rank right now that have performed very well recently and I think are likely to continue. They represent the secular economic trends of this economy, have strong business models, growing earnings and of course top Zacks Ranks. Meta Platforms and Nvidia are still on the top of the list, and both enjoy Zacks Rank #1 (Strong Buy) ratings reflecting upward trending earnings revisions. EPS for Nvidia are forecast to grow an incredible 30% annually for the next 3-5 years and Meta's are projected to climb 20% annually over the same period. They also continue to show impressive relative strength against the market YTD. Another company that is quietly making a significant contribution to the semiconductor and AI industry is Cadence Design Systems. The company builds software for designing chips and leads the space. Software within the semiconductor industry is a particularly appealing vertical. Semiconductor production is a very high capex intensive business, while software is a high margin low capex business. Candence Design enjoys gross margins of 90% and net margins of 26%. In addition to a Zacks Rank #1 (Strong Buy) rating, reflecting upward trending earnings revisions, CDNS also has a compelling technical trade setup. The price action of the stock has been forming a bullish consolidation, and a breakout should send the stock higher. Amazon is another leader that is likely to continue to lead. Both the ecommerce business and cloud services boast massive tailwinds with the expansion of online retail and digital transformation. Amazon web services dominates the cloud industry with 31% of the market share. Additionally, its advertising business has exploded from seemingly nowhere and now contributes $60 billion a year to the top line annually. The emergence of this business shows that Amazon continues to execute at a high level as it enters new highly competitive industries. Zacks Rank #1 (Strong Buy) rating, indicating upward trending earnings revisions. Earnings estimates are being upgraded significantly and EPS are expected to grow at a very high pace over the next 3-5 years. Earnings are projected to grow 28% annually over that time. There will be hiccups along the way, 5% and 10% corrections as the market continues higher, but don't let the bears scare you out of this market. It's a bull market you know! Why Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Cadence Design Systems, Inc. (CDNS) : Free Stock Analysis Report Meta Platforms, Inc. (META) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}