{
    "title": "NVDA's Soaring Valuation: A Risky Stock Bet Amidst AI Expansion?",
    "date": "1/4/2024",
    "url": "https://investorplace.com/2024/01/nvdas-soaring-valuation-a-risky-stock-bet-amidst-ai-expansion/",
    "text": " Sell NVDA now, profits may not show up in the coming years Advertisement Source: Evolf / Shutterstock.com Nvidia (NASDAQ:NVDA) has been the darling of the S&P 500 in the past year, and NVDA stock is up over 230% since the beginning of 2023 with the expansion of AI. However, investors must understand that a high-quality business doesn’t always mean a good stock. Even if we disregard the regulatory challenges and competitive pressures that Nvidia faces, its stock offers minimal growth at best and ridiculously overvalued at worst. Bulls often tout Nvidia’s forward P/E ratio of 24.39 times, which is not much higher than the S&P 500’s ratio of 21x. However, projections are likely to be revised as growth slows down and the temporary boost from China wears out. First, the company projects $20 billion in revenue in Q4. It’s impressive, but growth is slowing down, from 88% QoQ to 34% QoQ to 10% QoQ. In addition, the company estimates gross margins to remain similar while operating expenses increase. Second, Nvidia’s revenue has been artificially inflated since the U.S. banned Nvidia GPU exports to China this year. As a result, Chinese companies began to stockpile Nvidia’s older models, which are likely to be banned soon. Together, they’ve spent over $5 billion in a couple of months. Traditionally, China accounted for almost 20% of Nvidia’s revenue. Though we’re not sure if that will go to 0%, it’s a huge blow to Nvidia’s revenue growth. Nvidia is launching slower chips in China to comply with restrictions. However, this allows Huawei to take market share and build its own GPU business. Since GPUs have become a centerpiece of competition between the U.S. and China, there is no doubt that the Chinese government will do all that it can to ensure Huawei succeeds. Currently, Nvidia trades at a trailing P/E ratio of 63.58, showing that investors are paying a hefty premium at best and massively overvaluing it at worst. Its forward p/e ratio of 24.39 and PEG ratio of 0.48 is a dangerous trap because it looks like the stock is fairly valued, but it means that any negative EPS revisions could send the stock down massively. So far, analysts have continuously pushed EPS estimates higher. That trend is bound to reverse since predictions never fully materialize. In addition, it has a 26.74x price-to-sales ratio, many times greater than the S&P 500’s average of 2.57x, and a 60% premium compared to its ratio at the end of last year. Finally, it’s still essential to address competitive risks. Your business has a problem when your biggest customers are trying to replicate what you’re selling. Most big tech companies are all spending billions of dollars to become the AI leader and invest in developing their GPUs in-house. Analysts are projecting that Nvidia’s revenue will grow by 20% yearly for the next five years. They assume that Nvidia’s market share will be virtually unchallenged with this estimate, making their sequential valuations very likely inaccurate. It’s tough to tell if Nvidia will maintain market share, and its current valuation gives too little room for error to make that estimate. Despite what you might think of Nvidia’s fundamental business, its stock is undoubtedly costly, and betting on it means you have less room for error. Despite near-term headwinds and slowing growth, the stock’s valuation has only been propped up by analyst estimates of the future. Therefore, approach Nvidia with extreme caution. On the date of publication, Michael Que did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. The researchers contributing to this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Michael Que is a financial writer with extensive experience in the technology industry, with his work featured on Seeking Alpha, Benzinga and MSN Money. He is the owner of Que Capital, a research firm that combines fundamental analysis with ESG factors to pick the best sustainable long-term investments. Technology, Semiconductor   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/nvdas-soaring-valuation-a-risky-stock-bet-amidst-ai-expansion/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}