{
    "title": "Nvidia becomes latest darling of Korean investors, alongside Tesla and Apple",
    "date": "1/16/2024",
    "url": "https://m.koreatimes.co.kr/pages/article.asp?newsIdx=366968",
    "text": "Copyright@KoreaTimes.co.kr All rights reserved ⓕ font-size Copyright@KoreaTimes.co.kr All rights reserved gettyimagesbank Kim Jin-sung, a member of an online community of retail stock investors, said he decided to keep the shares of American tech titan Nvidia. \"I bought them for $190 (251,000 won) per share in January of last year. There were moments I wanted to cash out, but I'm glad I didn't. It's now about $550. I'll just keep holding them.\" Kim is one of many local retail investors who own U.S. shares, including Apple and Tesla stocks. Data from the Korea Securities Depository showed the outstanding value of Nvidia shares held by local investors came to $4.7 billion as of Jan. 11, after automaker Tesla ($12.3 billion) and IT giant Apple ($4.8 billion). The $4.7 billion is more than double the $2 billion a year prior, led by a spike in share valuation, not by the increase in the number of shareholders. Nvidia rose 238.86 percent last year, while Apple shares inched up 48.18 percent. Apple shares showed a year-to-date downward movement to end at $180.78, Jan. 5, a drop from $197.57, Dec. 13, last year. Behind the adjustment was a series of underweight positions by global investment banks on concerns that the supposed leader in cutting-edge technologies is lagging in artificial intelligence (AI) innovations. Apple's diminished standing gave way to its main competitor Nvidia to thrive. The biggest beneficiary of the Generative AI surpassed the psychologically significant $500 mark Jan. 8. It soared to an all-time high of $553 dollars on Jan. 11. Hana Securities said in a report that Nvidia's earnings outlook is strong in fiscal year 2024. \"Sales in the fiscal year 2024 will increase 119 percent from the year prior, propelled by growth in data center sales together with AI tech developments. The smart vehicle- and data centers-oriented sales will remain strong despite U.S. sanctions against China,\" the report said.  Copyright@KoreaTimes.co.kr All rights reserved "
}