{
    "title": "Is the rally in Nvidia's stock overblown? | NYSE:RTX, ETR:5UR",
    "date": "1/12/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1038244/is-the-rally-in-nvidia-s-stock-overblown-1038244.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Jessica has spent 15 years covering private and public markets, business, law and investment in the transition to cleaner energy. She spent several years as an editor at Dow Jones, covering private equity and private markets, where she led the team that broke the news of alleged misuse of funds at Abraaj Group. During her time at the company, she sat on the Women @ Dow Jones committee. She also spent four years as an editor and journalist at Centaur Media PLC covering investment in... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Last updated: 15:35 12 Jan 2024 GMT, First published: 14:21 12 Jan 2024 GMT Nvidia Corporation (NASDAQ:NVDA) shares rallied by more than 13% to new highs on Nasdaq this week, prompting sceptics to wonder if the stock could be overvalued, overbought, or stuck in a growing bubble. Last year, its stock tripled in value as excitement around artificial intelligence (AI) began to build, and since then has continued to climb. The stock, already a standout performer in the S&P 500 last year, broke new records this month. This latest rally in the tech company’s stock follows the unveiling of several new AI products at the Consumer Electronics Show (CES) 2024 in Las Vegas this week. The tech company’s share price edged 1.7% higher in a single day on Tuesday, lifting an otherwise lacklustre Nasdaq market that day, and by Friday was trading at $548.22 per share. Deutsche Bank equities research analysts said on Wednesday that “investors may be getting a little carried away with the AI story for semicaps”. “For example, a 10% increase in AI penetration of servers would drive huge revenue to Nvidia, but could require as little as 40k wpm of logic capacity. That's dwarfed by Apple.” But could Nvidia’s stock be overvalued? Because its stock is trading above historic levels, this has led some observers to speculate that the stock could be overvalued, or overbought, while others believe it could be the start of a new upward trend suggestive of potentially more skyrocketing highs for the company. Nvidia’s market capitalisation on Nasdaq is about US$1.35 trillion, nearly half of the valuation that Apple Inc (NASDAQ:AAPL, ETR:APC)’s market-leading US$2.9 trillion stock boasts, with Microsoft Corporation (NASDAQ:MSFT)'s US$2.87 trillion market cap not far behind. Nvidia’s valuation might raise eyebrows because it is a much younger company than Apple or Microsoft, though it has been quietly gaining ground for two decades, and is a year older than Amazon.com Inc (NASDAQ:AMZN, ETR:AMZ). It was founded in California in 1993 as a gaming technology company and listed on the stock market in 1999, while Apple and Microsoft had a headstart, as they were set up in the mid-seventies. For clues as to whether its stock could be overvalued, it might be helpful to look at the wider tech market to get a picture of how valuation trends have played out in recent decades. The dot com boom and bust cycle that began in the mid-nineties had burst by the early noughties, but the crash was survived by all three companies. Financial services firm Kepler Chevereux’s analysts Sébastien Sztabowicz and Ruben Devos wrote: “Over the past two decades, the only time the upcycle has lasted for more than two to three years was after the tech bubble crash in 2001. “The market surged by 37% in 2000, then crashed by 32% in 2001 and stabilised in 2002.” The semiconductor market shot up in the four years after the dot com crash and remains a structurally growing market. Kepler forecasts that it could grow at a rate of 7% to the end of this decade, driven by demand for data centres and artificial intelligence (AI). Analysts suggest the semiconductor market has now ‘bottomed out’ and that an inventory correction is gradually coming to an end, suggesting the market could be about to enter another expansion phase. Kepler named Nvidia as the ‘clear beneficiary’ of the generative AI market boom, and an undisputed leader in graphics processing units. “NVIDIA is the clear leader in the build-out of accelerated computing and Generative AI, with an estimated share of more than 85% in AI training models,” Sztabowicz and Devos wrote. Nvidia's quarterly sales soared to US$20 billion in the fourth quarter of 2024, ending in January, according to the analysts' estimates, up from US$6 billion in the recent trough period of the third quarter of its fiscal year 2023. The computer processor and microchip developer has beaten expectations nearly every quarter since the start of 2024, the analysts said. In Las Vegas this week, Nvidia unveiled a new suite of technology at CES 2024 including drive solutions for autonomous AI-powered electric vehicles developed by Li Auto, Great Wall Motor, ZEEKR and Xiaomi, and new 3-D modelling for car companies. It also rolled out new graphics card chips (RTX 4080) for gaming developers and teamed up with Getty Images on a generative AI offering on the stock image platform. In addition, it launched the Nvidia Avatar Cloud Engine to enable developers to build interactive AI-based avatars. This year, Nvidia is expected to launch its next generation of products, including the H200 core processing line in the second quarter and the B100 greater bandwidth processors in the second half. Nvidia holds a 70% market share of the AI processor market globally, and an up to 90% share in AI training models. The tech company is strengthened by both its rapid core innovation and through its partnerships. Nvidia and Apple are developing their own chips using Arm architecture. One of Nvidia's most fruitful relationships is with Amazon. Adam Selipsky, Chief Executive Officer of Amazon Web Services (AWS), said in December that the companies had expanded their partnership. Nvidia’s latest hardware will be integrated into Amazon EC2 and DGX cloud technology will be available as part of its web services. AWS is expected to be the first cloud provider to use Nvidia's GH200 Superchips for the cloud. Nvidia isn’t the only chip maker to have had a rally lately. Kepler and Deutsche downgraded BE Semiconductor Industries after its latest surge, with the latter citing scepticism in the potential for AI advances to sustain the semiconductor market for long. Demand for inventory will be important, perhaps more so than innovation, this year and going into next year, and the impact of reduced demand from China cannot be ignored.      Sign up to receive alerts and news direct to your inbox Oriole Resources PLC (AIM:ORR) CEO Tim Livesey and chief financial officer Bob Smeeton join Proactive's Stephen Gunnion with details of the company's 2023 financial and operational performance.\r\n\r\nLivesey highlighted successful exploration programs in Cameroon, at the Bibemi and Mbe projects,... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}