{
    "title": "A Bull Market Is Coming: 2 Stock Split Stocks That Could Help Make You Rich \nin 2024",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/bull-market-coming-2-stock-150700092.html",
    "text": "If you want to buy stocks in the new year, historical patterns are on your side. Since its founding in 1971, the Nasdaq Composite has risen an average of 19% in each year following a rebound year like the one we experienced in 2023. And with the Federal Reserve expected to lower interest rates and begin easing its monetary policy, there is no reason to think 2024 will be any exception to this long-running pattern. One way for investors to bet on a new bull market is with stock split stocks -- shares in companies that have recently divided their shares into more units to make them more available for retail investors. While splits don't change business fundamentals, they can boost liquidity and signal that these companies are moving in the right direction. Let's explore why Nvidia (NASDAQ: NVDA) and Tesla (NASDAQ: TSLA) fit the bill. Chipmaker Nvidia is no stranger to explosive growth; often its stock price is out of reach for smaller investors who don't have access to fractional shares. To manage the challenge, the company has split its stock five times since 2000, including a 4-for-1 conversion in 2021. The good news is that Nvidia's bull run looks far from over -- especially as it benefits from rising interest in generative artificial intelligence (AI). Despite surging 244% over the last 12 months, Nvidia stock still appears to have plenty of steam left. According to analysts at Bloomberg, the generative AI industry could expand at a compound annual growth rate (CAGR) of 42% to $1.3 trillion by 2032 as the technology is refined and adapted to more use cases. Nvidia stands to benefit because of its 80% market share in the advanced chips that make training these applications possible. While competition is growing from rivals like Advanced Micro Devices, the opportunity looks big enough for multiple companies to share the action. Further, Nvidia's early lead has given it a competitive moat because more programmers are familiar with its hardware and have built software and servers specially designed for their use. Despite seeing its net income rise over 12-fold to $9.2 billion, Nvidia's shares remain reasonably valued at just under 25 times forward earnings. This is below the Nasdaq-100 average of 28, suggesting it isn't too late for investors to bet on Nvidia's long-term potential. Like Nvidia, Tesla is another rapidly growing company that has relied on stock splits to manage its expanding share price. Most recently, this included a 3-for-1 split in 2022. Like many automakers, Tesla faces macroeconomic challenges from high interest rates and competition. But its strategy to become a mass-market automaker remains on track. In the near term, the EV industry is under a lot of pressure. With interest rates high, and recent inflation putting pressure on consumer wallets, people are putting off new car purchases -- forcing automakers like Tesla to lower prices to maintain their market share. With that said, the company is also using the opportunity to accelerate its mass-market strategy. CEO Elon Musk claims to be developing a $25,000 car called the Model 2 expected to be unveiled this year. And Reuters reports that the company is also working on a 25,000 Euro ($26,838) vehicle at its factory in Berlin. Lower-cost options could help Tesla make up for lower margins with higher volumes, while vertical integration efforts like lithium refining could help this strategy by bringing down production costs. With a price-to-earnings (P/E) multiple of 68, Tesla stock is expensive, considering the near-term challenges it faces. But the company is no stranger to being a high-priced stock. And it has historically proven the naysayers wrong by growing into its valuation. While historical patterns and stock splits can make investors more comfortable in the market, they take a back seat to fundamentals over the long term. Nvidia and Tesla are great buys because of their dominant position in their industries and the potential to ride the wave of transformational technologies. But for me, Nvidia looks like the better bet right now because of its faster bottom-line growth rate and relatively low valuation. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Tesla. The Motley Fool has a disclosure policy. A Bull Market Is Coming: 2 Stock Split Stocks That Could Help Make You Rich in 2024 was originally published by The Motley Fool Related Quotes "
}