{
    "title": "Nvidia: 50 Billion Reasons Why This Artificial Intelligence (AI) Stock \nCould Skyrocket in 2024",
    "date": "1/2/2024",
    "url": "https://www.fool.com/investing/2024/01/02/nvidia-reasons-why-artificial-intelligence-ai/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia's (NVDA 0.12%) data center graphics cards were the driving force behind the rapid growth in the company's top and bottom lines in recent quarters. The cards help train large language models (LLMs) being developed by cloud service providers, start-ups, governments, and any organization looking to harness the power of artificial intelligence (AI). The semiconductor giant's AI prowess came into the limelight when Microsoft-backed OpenAI's ChatGPT took the world by storm toward the end of 2022. It is worth noting that ChatGPT was reportedly trained using 30,000 of Nvidia's A100 data center GPUs (graphics processing units). Not surprisingly, the demand for Nvidia's AI chips blew up, with its flagship H100 data center GPU turning out to be a massive success in 2023. Reports suggest that the waiting period for H100-powered AI servers ranges between nine and 12 months. Major cloud service providers are trying to get their hands on this chip that reportedly costs between $25,000 and $40,000 depending on the configuration. This is precisely why Nvidia seems set to have another bumper year in 2024. British newspaper the Financial Times forecast in August 2023 that Nvidia could ship 550,000 of its H100 GPUs. But a new report from market research firm Omdia points out that Nvidia sold half a million units of the H100 in the third quarter of fiscal 2024 (which ended on Oct. 29, 2023). Assuming that the company clocked an average selling price (ASP) of $25,000, it would have sold $12.5 billion worth of H100 processors last quarter. That number doesn't seem surprising given that Nvidia generated $14.5 billion in revenue from its data center segment last quarter, which houses the sales of its H100 processors. This explains why the latest estimates peg sales of Nvidia's H100 processors at 1.5 million units in 2023, which means that the company may have generated $37.5 billion in revenue from this processor alone in 2023. For 2024, Nvidia is now expected to ship 2 million units of the H100. At a base price of $25,000, that would translate into revenue of at least $50 billion for Nvidia in 2024. The company is expected to finish the current fiscal year with revenue of $59 billion, which means that the H100 alone could move the needle in a big way for the semiconductor giant in the new fiscal year. However, there is a chance that Nvidia may be able to significantly raise its H100 shipments in the new year thanks to support from its supply chain partners, which are busy ramping up their production capacity, as well as the introduction of updated chips. This explains why analysts estimate that Nvidia's AI GPU shipments could jump a whopping 150% in 2024. Assuming the H100 accounts for the entire jump in Nvidia's AI GPU shipments in 2024, the company could end up shipping 3.75 million units of its flagship processor. This points toward more than $93 billion in revenue from a single product for Nvidia. For comparison, analysts anticipate the company's total revenue in the new fiscal year to come in at $92 billion. As such, there is a chance that Nvidia could easily eclipse Wall Street's growth expectations in 2024, and this could help the stock sustain its red-hot run on the stock market in the new year as well. That's why investors who are asking if they should be buying Nvidia stock following its impressive 2023 gains should consider buying it hand over fist right now, especially considering its attractive forward valuation. Nvidia stock's terrific rally in 2023 explains why it is trading at a rich 27 times sales right now. The company also has a trailing price-to-earnings (P/E) ratio of 65. But a closer look at the forward sales and earnings multiples suggests that the stock may be undervalued.  NVDA PE Ratio (Forward 1y) data by YCharts Nvidia's forward P/E ratio of 25 is lower than its five-year average forward earnings multiple of 42. Additionally, the sales multiple of 13 is also lower than the five-year average price-to-sales ratio of 20. Buying Nvidia at this valuation looks like a no-brainer, especially considering the terrific acceleration analysts anticipate in its bottom line. Consensus estimates predict Nvidia's earnings to increase at an annual rate of 102% for the next five years. That would be a big jump over the 48% annual earnings growth the company has clocked in the past five years. Also, Nvidia's price/earnings-to-growth ratio (PEG ratio) is just 0.5, indicating that the stock is quite cheap considering the impressive pace at which it is growing. The S&P 500 index, for comparison, has a PEG ratio of 1.56. In all, investors looking to buy a top AI stock right now can still consider investing in Nvidia, as it looks set to soar higher in 2024 -- and beyond. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Microsoft and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}