{
    "title": "Stock Market Remains Ahead As Nvidia Hits New High; WD-40 Stock Soars",
    "date": "1/10/2024",
    "url": "https://www.investors.com/market-trend/stock-market-today/stock-market-struggles-for-gains-bitcoin-stocks-see-more-drama/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Major stock market indexes generated a little momentum Wednesday with the Dow Jones Industrial Average, S&P 500 and Nasdaq all padding gains slightly in afternoon trading. Meanwhile, three Magnificent Seven stocks, Amazon.com (AMZN), Meta Platforms (META) and Nvidia (NVDA) all moved higher. The Dow advanced 0.2% while the S&P 500 added 0.3%. The Nasdaq climbed 0.5% in the stock market today. Tech-heavy Nasdaq stocks remain above their 21-day exponential moving average after retaking the line on Monday. The small-cap Russell 2000 underperformed the major indexes and fell 0.1%. Meanwhile, the Invesco QQQ Trust (QQQ) bumped up 0.5% as the Innovator IBD 50 ETF (FFTY) edged 0.3% higher. Volume fell on the New York Stock Exchange and the Nasdaq vs. the same time on Tuesday. Further, the 10-year Treasury yield added 1.5 basis points to 4.03%. IBD 50 stocks CrowdStrike (CRWD) and Nvidia each gained more than 2%. CRWD stock hit a 52-week high, while NVDA stock reached a new all-time peak. WD-40 (WDFC) gapped up around 14% and broke out of a flat base with a 245.76 buy point, according to MarketSmith pattern recognition. The stock formed a base-on-base pattern after a failed breakout from a cup base with a 234.69 buy point. WD-40 reported better-than-expected earnings and sales for its fiscal first quarter and maintained its full-year 2024 profit and revenue outlook. The stock and its relative strength line reached 52-week highs. Magnificent Seven stock Amazon gained 1.7% after announcing plans to lay off 500 workers from its Twitch streaming platform. In addition, it will reduce jobs at its Amazon Prime Video and MGM studios. Amazon shares topped the 5% buy zone of a 145.86 buy point of a cuplike base. Now the stock is nearing a 52-week high it reached on Dec. 20. Further, IBD 50 and fellow Magnificent Seven stock Meta Platforms (META) jumped nearly 4% and hit a 52-week high in stock market trading. META stock is extended from a previous 326.20 buy point. Aehr Test Systems (AEHR) plummeted after the maker of chip-equipment testing gear reported fiscal second-quarter earnings and sales that beat estimates. The company lowered its fiscal 2024 revenue outlook. Cloud-services provider Hewlett Packard Enterprise (HPE) rose 1% after Tuesday's 8.9% sell-off in heavy volume. The company had announced it will buy Juniper Networks (JNPR) for $14 billion in cash. HPE stock plunged below its 50-day moving average on Tuesday after word of the deal emerged. The stock is now testing that line below a 17.29 buy point. Also, JNPR stock climbed 2.1% on Wednesday following Tuesday's deal-induced 21.8% jump in heavy trading. Shares are extended from a long consolidation with a 34.53 buy point. The network products stock reached a 52-week high on Wednesday. Intuitive Surgical (ISRG) gapped up after the maker of robotic surgery gear reported preliminary fourth-quarter and full-year 2023 revenue above estimates. Shares are extended from the 5% buy zone of a 318.26 buy point of a cup-with-handle base. ISRG stock was the S&P 500's biggest gainer on Wednesday. Medical technology stock Stryker (SYK) tapped the 306.93 buy point of a consolidation. The company said it expects full-year 2023 sales to exceed $20 billion. Tesla (TSLA) gave back early morning gains and pulled back after announcing Tuesday night that its updated Model 3 is now available in North America. TSLA stock remains below its 50-day line with its 200-day line as support. The electric-vehicle maker still has a 265.13 handle buy point from a double-bottom base. Cryptocurrency exchange Coinbase Global (COIN) and bitcoin miner Marathon Digital (MARA) reversed course from earlier losses. The two stocks dived after the price of bitcoin retreated below $45,000, but then bitcoin rebounded. Also, news broke that the Securities and Exchange Commission's X social media account was compromised and a false post said that a bitcoin ETF was approved. Lennar (LEN) gapped up after the homebuilder raised its annual cash dividend to $2 per share from $1.50 and authorized an additional $5 billion in its share buyback program. Shares are trading tightly and recently formed a bullish three-weeks-tight pattern. IBD 50 stock GigaCloud Technology (GCT) spiked, then retreated in huge volume. Shares reached a 52-week high earlier in the session before falling nearly 4% in recent stock market action. Etsy (ETSY) fell after Goldman Sachs downgraded the online marketplace stock to neutral from buy. The brokerage also lowered its price target to 80 from 84. Meanwhile, Toast (TOST) gained 1.8% after Goldman upgraded the restaurant technology stock to buy from neutral. Goldman put a 24 price target on shares. Finally, Bloom Energy (BE) eased from larger gains, and added 0.7% after Baird upgraded the renewable energy stock to outperform from neutral. Baird raised its price target on the stock to 22 from 16. Follow Kimberley Koenig for more stock market news on X/Twitter @IBD_KKoenig. YOU MAY ALSO LIKE: Get Free IBD Newsletters: Market Prep | Tech Report | How To Invest What Is CAN SLIM? If You Want To Find Winning Stocks, Better Know It IBD Live: Learn And Analyze Growth Stocks With The Pros Looking For The Next Big Stock Market Winners? Start With These 3 Steps Futures: MSFT Eyes Apple's Title; SEC OKs Bitcoin ETFs 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}