{
    "title": "Hyderabad-based Kore.ai raises $150 million from FTV Capital, NVIDIA",
    "date": "1/31/2024",
    "url": "https://www.moneycontrol.com/news/business/hyderabad-based-kore-ai-raises-150-million-from-ftv-capital-nvidia-12158241.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Hyderabad-based Kore.ai has secured $150 million in funding led by FTV Capital to drive AI-powered customer and employee experiences for global brands, the company announced on January 30. NVIDIA and existing investors, including Vistara Growth, Sweetwater PE, NextEquity, Nicola, and Beedie, also participated in this funding round. The latest funding will accelerate Kore.ai’s market expansion and continuous innovation in AI to deliver tangible business and human value at scale, the company further stated on its website. Kore.ai provides an enterprise-grade no-code platform to help companies of all sizes power business interactions with AI safely and responsibly while driving significant revenue and cost savings. Gartner estimates the conversational AI market to reach $377 billion in revenue by 2032, up from $66 billion in 2023. “We have been working with advanced AI for a decade now – our deep technology expertise and market understanding put us in a prime position to take advantage of the momentum and to do AI right in order to meet growing customer needs,” said Raj Koneru, founder and CEO of Kore.ai. The company further noted that it automates 450 million interactions a day for about 200 million consumers and two million enterprise users worldwide.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}