{
    "title": "Nvidia explores AI partnerships with Indian government for building \nsovereign AI using DPIs",
    "date": "2/28/2024",
    "url": "https://www.moneycontrol.com/news/technology/nvidia-explores-ai-partnerships-with-indian-government-for-building-sovereign-ai-using-dpis-12371071.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now India's digital public infrastructure (DPI) can be used for building sovereign artificial intelligence (AI), Nvidia's senior vice president for enterprise sales and business development Shankar Trivedi said after a recent meeting with Union minister Rajeev Chandrasekhar. During the meeting Trivedi and Chandrasekhar discussed potential areas of partnership in the field of sovereign AI. After the meeting with Chandrasekhar on February 26, Trivedi said, \"What's happening today in India is extremely exciting. New infrastructure is being built. A huge startup ecosystem is well underway and the DPI has now reached critical mass. Many new applications can be built on DPIs.\" \"From Nvidia's perspective, what is really interesting is the growth  and pervasiveness of sovereign AI. The DPI can be used as a basis for building sovereign AI, together with very strong infrastructure, to run these generative AI models, which can be built on DPI,\" he said. \"I find this very exciting. And it is a huge opportunity for Nvidia to partner with the government and all of the startup, large corporate ecosystem,\" he added. However, the official Digital India account on X, formerly Twitter, described the discussion between the two on \"potential areas of partnerships\". The development follows Nvidia's January announcement of partnering with India Inc to set up AI data centre facilities. Earlier in February, Nvidia founder and CEO Jensen Huang said that every country needs to own the production of their own intelligence. Huang described sovereign AI as a country’s ownership over its data and the intelligence it produces. In September 2023, NVIDIA and Reliance Industries announced a collaboration to develop India’s own foundation large language model trained on the nation’s diverse languages and tailored for generative AI applications to serve the nation. Disclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}