{
    "title": "This Artificial Intelligence (AI) Stock Has Been Hailed as a \"Stealth \nNvidia.\" Time to Buy?",
    "date": "2/29/2024",
    "url": "https://www.fool.com/investing/2024/02/29/this-artificial-intelligence-ai-stock-has-been-hai/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Developments in artificial intelligence (AI) are playing a major role in overall market dynamics right now. Last year, the tech-heavy Nasdaq Composite soared more than 40% thanks in large part to euphoria surrounding the AI narrative. Specifically, the \"Magnificent Seven\" -- Apple, Microsoft, Alphabet, Amazon, Meta Platforms, Tesla, and Nvidia -- have had a major influence on the record-setting performance by the S&P 500 so far in 2024. But there are many opportunities beyond those seven. One company that has experienced quite a bit of volatility over the last year is Super Micro Computer (SMCI -1.30%), which works extremely closely with semiconductor leaders Nvidia and Advanced Micro Devices. Given that Super Micro Computer stock has surged 812% over the last year, it's no surprise that one Wall Street pundit has hailed the company as a \"stealth Nvidia.\" Could Super Micro have prospects as lucrative as Nvidia stock? Maybe. But a more thorough understanding of the company's business, underlying market trends, and valuation compared to peers should help determine if it is a buy right now. Both Nvidia and AMD manufacture a series of high-end chips called graphics processing units (GPUs), which play an instrumental role in quantum computing, especially as it relates to generative AI. Super Micro does not produce semiconductors itself, but it plays an important role in how they are deployed. The company specializes in designing IT architecture including server racks and storage clusters. Given the unprecedented demand for GPUs, it's not surprising that its business has been a major beneficiary.  SMCI revenue (quarterly) data by YCharts. I'll concede that the slope of the revenue line above is impressive. However, there are some important things to consider before pouring into Super Micro. Image source: Getty Images. The chart below illustrates the stock movements of Nvidia and Super Micro over the last year.  SMCI data by YCharts. Not only are both stocks up significantly, but they have also demonstrated eerily similar ebbs and flows throughout the last 12 months. As I wrote in a prior article, Super Micro's stock seems to trade almost in parallel with that of Nvidia. While some investors have undoubtedly profited from this theme, this dynamic does not come without significant risk. For example, Arm Holdings is a smaller and somewhat troubled semiconductor company. But an encouraging earnings report earlier this year coupled with a newly revealed ownership stake from Nvidia sent Arm stock soaring, with its market cap nearly doubling in just a matter of days. While Super Micro Computer and Arm Holdings each have some investment merit, the overlapping feature between the two companies is that both have witnessed abnormally high buying activity thanks in large part to their relationships with Nvidia. As long as demand for GPUs remain high, Super Micro should remain a beneficiary one way or another. But the primary risk I see is the company's heavy reliance on Nvidia in particular.  SMCI PS ratio data by YCharts. The chart above benchmarks Super Micro stock against a cohort of other IT-systems integrators on a price-to-sales (P/S) basis. The analysis clearly illustrates that Super Micro's P/S of 5.3 is essentially double that of its next closest competitor, International Business Machines. Of note, IBM is a much more diversified conglomerate that even sells its own AI-powered software in addition to its many other businesses. The other important thing to drive home here is that many other IT architecture companies trade at a P/S of less than 1. While it could be argued that Hewlett Packard Enterprise, Dell Technologies, and Lenovo have lacked innovation in recent years, the disparity among legacy players and Super Micro is tough to brush aside. To me, Super Micro will need to generate market-leading revenue and profit growth in order to justify its premium valuation. But I see this as unlikely as demand for GPUs will eventually normalize, which will affect Super Micro's long-term performance. Moreover, it's paramount that the company foster and nurture relationships outside of Nvidia and AMD, since the GPU market will begin to see other players emerge -- potentially from big tech stalwarts like Amazon. While I understand Wall Street's metaphorical comparison to Nvidia, investors should understand that Super Micro and chipmakers are very different businesses. The former could represent a unique stock to own outside of traditional AI opportunities. But it's important to realize that the long-term investment prospects between Super Micro and other semiconductor leaders like Nvidia are not the same and carry much different risk profiles. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends International Business Machines and Super Micro Computer and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}