{
    "title": "Highflying Nvidia's earnings could test US stock market's AI dreams",
    "date": "2/18/2024",
    "url": "https://today.thefinancialexpress.com.bd/stock-corporate/high-flying-nvidias-earnings-could-test-us-stock-markets-ai-dreams-1708184520",
    "text": " / STOCK & CORPORATE February 18, 2024 00:00:00 NEW YORK, Feb 17 (Reuters): Next week's earnings report from chipmaker Nvidia, opens new tab could prove a gut check for one of the market's hottest names, and for the artificial intelligence fever that has helped power gains for US stocks in recent months. Excitement over the business potential of AI has boosted Nvidia's shares by more than 46 per cent since Jan. 1. Its $570 billion increase in market capitalization is more than triple the market value of Intel (INTC.O), opens new tab. Shares of Nvidia, whose chips are considered the gold standard in the AI industry, surged nearly 240 per cent in 2023. The chipmaker's gains have accounted for more than a quarter of the S&P 500's increase this year. The benchmark index is up nearly 5 per cent year-to-date, after optimism about AI helped drive the index up 24 per cent in 2023. Now the third most valuable company on Wall Street after Apple, opens new tab and Microsoft, opens new tab, Nvidia has also become a bellwether for the artificial intelligence industry. Other AI-focused stocks have surged this year, including Super Micro Computer Inc, opens new tab, which is up 182 per cent year-to-date, and Arm Holdings , up nearly 71 per cent. \"When people say that the market is doing well this year, they really mean that tech is doing well, and Nvidia is at the core of that,\" said Keith Lerner, chief market strategist at Truist Advisory Services. \"There is excitement within AI and if that optimism is not fulfilled by earnings then you could see that reverberate quickly and weigh on sentiment.\" Nvidia will release quarterly earnings results on Feb. 21. Wall Street expects earnings of $4.56 a share, and a rise in quarterly revenue to $20.378 billion from $6.05 billion a year ago, according to the mean estimate from 33 analysts, based on LSEG data. Given the company's size and its importance to the AI story, Nvidia's results could be pivotal for market sentiment, said Kevin Landis, a portfolio manager at Firsthand Capital. \"Every time you get a big stock market rally there's a favorite stock that leads it,\" said Landis, who regrets selling his shares in Nvidia last year. \"It's hard not to look at Nvidia and see … that's driving the psychology of the overall market.\" Not surprisingly, traders are bracing for big moves in the company's shares. Nvidia options are pricing a swing of about 11 per cent in either direction following its results, according to data from options analytics service ORATS. That's the largest expected move options traders have priced ahead of Nvidia's earnings over the last three years and well above the stock's average earnings move of 6.7 per cent over that period, ORATS data showed. Tom Hainlin, senior investment strategist at US Bank Wealth Management, said positive updates to Nvidia's corporate outlook could fuel more AI optimism and extend a market rally that has been concentrated in the so-called Magnificent Seven group of megacap stocks, of which Nvidia is a member. Shares of Meta Platforms, opens new tab, another member of the group, have surged 34 per cent this year while Apple's have fallen by 5 per cent. Shares of Tesla, opens new tab have tumbled nearly 20 per cent after the electric car maker warned of \"notably lower\" sales growth this year and shrinking margins. \"Right now investors are rewarding visibility into earnings growth and that keys up well for more gains for Nvidia,\" Hainlin said. On the other hand, investors may use a less-than-stellar report as an opportunity to take profits. Ryuta Makino, research analyst at Gabelli Funds, believes investor enthusiasm for Nvidia is so high that its shares could fall by at least 10 per cent if the company simply meets expectations, without exceeding them. He remains bullish on Nvidia due to rising capital expenditures from customers such as Amazon.com and Microsoft into their cloud businesses, which rely on the company's chips. A disappointing report from Nvidia could also exacerbate concerns over crowding in the market's largest stocks, said Michael Purves, head of Tallbacken Capital Advisors. Overall, investors have their highest allocation to the tech sector since August 2020, according to fund managers in the latest survey conducted by BofA Global Research. \"This is the pillar of the growth for the index today, but at some point the gas tank will go empty,\" Purves said. Share if you like Editor : Shamsul Huq Zahid Published by Syed Manzur Elahi for International Publications Limited from Tropicana Tower (4th\nfloor), 45, Topkhana Road, GPO Box : 2526 Dhaka- 1000 and printed by him from The Transcraft Limited, 229, Tejgaon Industrial Area, Dhaka-1208. Phone: 02223388153, 02223388154 and 02223380377 PABX : 9553550 (Hunting) Fax : 880-2-02223387049 E-mail : [email protected], [email protected] © 2024 - All Rights with The Financial Express "
}