{
    "title": "Is AI a new dot com bubble? Will Nvidia and Arm see shares crash land?",
    "date": "2/24/2024",
    "url": "https://www.thisismoney.co.uk/money/investing/article-13118993/Will-tech-star-Nvidia-soar-higher-crash-land-like-Cisco.html",
    "text": "By Anne Ashworth Updated:  09:44 GMT, 24 February 2024  12 View  comments  Nostalgia for the music and fashion of the 1990s has enjoyed an upsurge – thanks in part to the Netflix drama One Day. But until this week, there's been less focus on that era's less pleasant events, such as the bursting of the dot.com bubble in which soaraway technology shares like Cisco collapsed at the decade's end. However, this rout has been frequently mentioned following Wednesday's bumper results from what Goldman Sachs calls 'the most important stock on earth' – Nvidia, the company with a pivotal role in the artificial intelligence (AI) industrial revolution. The Californian semi-conductor maker was founded in 1993 amid dot.com excitement. Its first customers were video game designers, and its name is an amalgam of NV, which stands for 'next vision', and invidia, the Latin word for envy.  So are these predictions of a replay of the dot.com slump spurred by envy among those who have not enjoyed this year's 45 per cent increase in Nvidia's share price to $694? The rise in 2023 was 240 per cent. Could there be parallels between the outlook for Nvidia and the fate of 1990s technology darling Cisco? Its shares have never recovered from their dot.com descent. These comparisons are being made, although Nvidia controls about 90 per cent of the market in GPU (graphic processing unit) chips required for generative AI, which can produce text and images akin to those made by humans. Demand is insatiable for these chips, which cost about $50,000 each. Microsoft and other tech giants may be developing their own. But, for the moment, 'if AI is a gold rush, Nvidia is selling the picks and shovels', as James Thomson, manager of the Rathbones Global Opportunities fund, puts it. More innovation is in the offing, with Jensen Huang, Nvidia's founder and chief executive, promising 'a whole bunch of things we've been working on'. Huang, 61, is known for his perfectionism and still runs the $1.8 trillion group with the warning that 'our company is 30 days from going out of business'. His expertise is one reason why 60 analysts rate Nvidia shares a buy. The average 12-month target is $734, but an optimist foresees a leap to $1,200. Hundreds of thousands of private investors, including me, have an interest in such forecasts since Nvidia shares are held by funds and trusts like Alliance Trust, Allianz Technology, Blue Whale Growth, F&C, Polar Capital Technology, Rathbone Global Opportunities and Scottish Mortgage. The signs are that Nvidia will continue to consolidate its dominant position in the AI industrial revolution thanks to its strengths on a number of fronts. Cuda, Nvidia's own computer language, has been used to build the digital libraries of information from which generative AI garners data to deliver its results. Demand: Doom 3 screengrab using Nvidia graphics chip As a consequence, Stephen Yiu, manager of Blue Whale Growth, disputes the claim that Nvidia will suffer Cisco's fate. The fund first invested in the firm in June 2021. He says: 'At the end of March 2000, just before the dot.com bubble burst, Cisco shares were trading at 130 times earnings. 'This compares with 32 times for Nvidia today, which is roughly the same as Amazon, Apple and Microsoft – and half of Tesla's multiple of 61.' Yiu also highlights the digital adoption gulf between the dot.com boom and 2024. He says: 'In 2000, it could take an hour to buy something off Amazon. Subsequently people have acquired mobile phones and laptops whose use for banking, work, shopping and entertainment allows the accumulation of the data stored in the cloud, on which generative AI relies.' This data offers a wealth of opportunities to the tech giants which they can exploit, with the help of Nvidia chips. Yiu says: 'Microsoft is selling its Copilot generative AI package to Windows customers for $30 a month. 'Meta can put together advertisements that appeal individually to its Facebook and Instagram users – for which advertisers will pay extra.' Thomson says that generative AI has been described as a 'FOMO' (fear of missing out) technology. He says: 'Company executives are worried about losing relevance if they don't utilise AI effectively.' But he argues that Nvidia may face challenges. 'Nvidia's been the top performer in our fund over the past year, but we have taken profits on a significant part of the position, as we believe that upside has naturally become more limited from here.' The dot.com episode may not be repeated. But its lessons are still applicable, such as the risk of placing too much faith in one share. Nvidia is a hugely important stock to which you should have exposure through a fund, or directly. There is almost certainly more upside in the shares. But the journey is likely to be marked by the thrills and spills of a 1990s video game. Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence. MORE HEADLINES Work out how a lump sum or regular monthly savings would grow Find the top deals in our independent best-buy tables This is Money is part of the Daily Mail, Mail on Sunday & Metro media group "
}