{
    "title": null,
    "date": "2/10/2024",
    "url": "https://interestingengineering.com/culture/sam-altman-aims-to-raise-a-staggering-7-trillion-to-challenge-nvidias-monopoly",
    "text": "Altman estimates that he would need between $5 trillion and $7 trillion to overhaul the semiconductor industry, which is currently dominated by Nvidia. Wikimedia Commons By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time. Sam Altman, the CEO of OpenAI, has a bold vision for the future of artificial intelligence: he wants to increase the global production of AI chips massively, and he is looking for trillions of dollars in funding to do so. According to a report by The Wall Street Journal, Altman is in talks with various investors, including the government of the United Arab Emirates, to launch a project that would expand the chip-building capacity of the world. He believes that the current supply of AI chips is insufficient to meet the demand of the AI giants, such as OpenAI, Alphabet, and Metamand, creating large and powerful language models that can generate text, images, code, and more. we believe the world needs more ai infrastructure–fab capacity, energy, datacenters, etc–than people are currently planning to build. building massive-scale ai infrastructure, and a resilient supply chain, is crucial to economic competitiveness. openai will try to help! — Sam Altman (@sama) February 7, 2024 Altman estimates that he would need between $5 trillion and $7 trillion to overhaul the semiconductor industry, which is currently dominated by Nvidia, the leading provider of graphics processing units (GPUs) for AI applications. Nvidia’s market cap has soared to $1.72 trillion in 2023, surpassing many tech giants such as Amazon and Alphabet. Altman wants to challenge Nvidia’s monopoly and create more competition and innovation in the AI chip market. Meanwhile, The White House announced the US government’s plan to spend $11 billion on semiconductor-related research and development on Friday. This move comes in the wake of Congress approving the Chips and Science Act in August 2022, which provides $52.7 billion for semiconductor production and R&D. Of this, $39 billion is allocated for subsidies and $11 billion for R&D. The law also offers a 25% investment tax credit, worth $24 billion, for building chip plants. The National Semiconductor Technology Center, a public-private partnership, is the centerpiece of this R&D program. It aims to research and prototype advanced semiconductor technology, bringing together stakeholders, including government, industry customers, suppliers, academics, entrepreneurs, and venture capitalists. US Commerce Secretary Gina Raimondo described the center as a platform for innovation, networking, problem-solving, and competition with the rest of the world. Altman’s ambitious plan is not without controversy, however. He has faced some backlash over his previous chip-related ventures and investments. In 2018, he invested in Rain Neuromorphics, an AI chip startup based in San Francisco, and in 2019, OpenAI signed a letter of intent to buy $51 million worth of Rain’s chips. However, in December 2020, the US government forced a Saudi-backed venture capital firm to sell its stake in Rain, citing national security concerns. Altman was also reportedly seeking billions for a new chip venture code-named “Tigris,” which he hoped to compete with Nvidia in the future. He traveled to the Middle East to raise money from investors, but his plan was interrupted by his brief ouster as CEO of OpenAI in November 2023. He was reinstated a week after a wave of protests and resignations from OpenAI’s employees and investors, including Microsoft. Since then, OpenAI has announced a new board of directors, which includes former Salesforce co-CEO Bret Taylor, former Treasury Secretary Larry Summers, and Quora CEO Adam D’Angelo. Microsoft also obtained a nonvoting board observer position, and the company plans to add more seats. Altman’s vision for the future of AI is clear: he wants to build more AI infrastructure, such as fab capacity, energy, data centers, and chips, than people are currently planning to build. He believes this is crucial for economic competitiveness and advancing the field of artificial intelligence. Whether he can find the trillions of dollars he needs to make it happen remains to be seen. "
}