{
    "title": "After Amazon, NVIDIA is now at a striking distance from Google's Alphabet",
    "date": "2/14/2024",
    "url": "https://www.firstpost.com/tech/after-amazon-nvidia-is-now-at-a-striking-distance-from-googles-alphabet-13725552.html",
    "text": "NVIDIA’s shares experienced a marginal decline of 0.17%, bringing its market value to $1.78 trillion, surpassing Amazon’s $1.75 trillion valuation after the latter’s stock dropped by 2.15%. Google-parent Alphabet’s stock also dipped by 1.62% resulting in a market capitalisation of $1.81 trillion On Tuesday, NVIDIA stood on the brink of surpassing Alphabet to become the third most valuable company on Wall Street, as the leading AI chipmaker’s market capitalization exceeded Amazon’s for the first time in two decades. NVIDIA’s shares experienced a marginal decline of 0.17 per cent, bringing its market value to $1.78 trillion, surpassing Amazon’s $1.75 trillion valuation after the latter’s stock dropped by 2.15 per cent. Meanwhile, Google-parent Alphabet’s stock also dipped by 1.62 per cent, resulting in a market capitalization of $1.81 trillion. NVIDIA has significantly benefited from the widespread integration of AI into various products and services by technology companies. The company’s graphics processors have been in high demand, with Meta Platforms and other major tech firms purchasing billions of dollars worth of its components. In anticipation of NVIDIA’s quarterly results scheduled for February 21, Mizuho raised its price target for the company’s stock to $825 from $625. The current stock price stands at $721.28. Mizuho analyst Vijay Rakesh noted that while lead times for NVIDIA’s top-tier H100 processor have decreased, the demand continues to exceed the supply, projecting considerable AI growth potential for NVIDIA, Broadcom, and Advanced Micro Devices. NVIDIA’s dominance in the high-end AI chip market, commanding approximately 80 per cent of the sector, has contributed to a 46 per cent surge in its stock value this year, following a more than threefold increase in 2023. The optimism surrounding AI has also propelled other technology-related companies like Microsoft and Meta to record highs. Alphabet has integrated chatbot technology into its Google search engine and offers generative AI tools to its cloud customers. Although its stock reached an all-time high recently, its quarterly report on January 30 fell short of investors’ expectations, resulting in a decline in its shares. Nonetheless, Alphabet’s stock remains up by 4 per cent in 2024. While NVIDIA briefly surpassed Amazon’s market capitalization on Monday, Amazon reclaimed the top spot by the end of the trading session. The last time NVIDIA exceeded Amazon’s value was in 2002 when both companies were valued at under $6 billion. Microsoft recently surpassed Apple to become the world’s most valuable company, valued at over $3 trillion, with state oil giant Saudi Aramco holding the third position. Apple’s stock has experienced a 4 per cent decline in 2024, while Saudi Aramco boasts a $2 trillion market capitalization, predominantly owned by the Saudi Arabian government. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}