{
    "title": "The way to make money is to ignore the crowd – so forget Nvidia and buy \nthis miner",
    "date": "2/26/2024",
    "url": "https://www.telegraph.co.uk/money/investing/stocks-shares/anglo-american-ignore-crowd-forget-nvidia-make-money/",
    "text": "Questor share tip: profits may have fallen, but investors should never forget that this is a cyclical business As Nvidia gallops relentlessly higher, and momentum investing in technology and particularly in AI-related stocks feels like the only game in town, this writer is left to ponder whether the experience offered by 30-odd years in the financial markets is worth a bean. This is particularly the case now, when a process-driven preference for contrarian, value-oriented picks has led to trouble at Close Brothers, Springfield Properties and Smith & Nephew, to name but three. Yet this approach has also unearthed winners such as Hunting, Beazley and a good few takeover targets too, and the subject of unearthing takes us to our next unloved object of attention, Anglo American. On the face of it, the giant miner’s full-year results for 2023, released last week, offered little to recommend them: profits down, a dividend cut and weak free cash flow, with a rise in net debt on top. December’s cuts to the 2023 production outlook had at least got a lot of the bad news out early, but chief executive Duncan Wanblad and his team have continued to attract brickbats for not doing enough to simplify the group’s structure, sell assets and cut costs and debt, not least because the share price has fallen by about 60pc since Wanblad took the helm in spring 2022. There is nothing that management could have done to stop platinum or diamond prices from plunging, thanks to concerns over the move away from the internal combustion engine and the rise of lab-grown alternatives to mined gemstones respectively, while Wanblad and his team inherited the Woodsmith potash project in North Yorkshire. That became part of the portfolio when Anglo bought Sirius Minerals for £405m in 2020 and the deal has left the FTSE 100 miner with a big capital investment bill. Nor should investors forget that mining is a cyclical, boom-and-bust business, related to both momentum in the global economy and capital investment trends: high mineral prices (and profits) attract more investment, which generates more supply, which eventually exceeds demand and drives down prices. That leads to a collapse in profits, cuts in capital expenditure and retrenchment in supply to the point where demand catches up, prices start to rise and the cycle starts again. Unless investors are convinced it will be “different this time” – and Anglo American is still a major, and profitable, producer of copper and iron ore, as well as steelmaking coal – it may be worth pondering how close we are to any cyclical bottom right now. Yes, Britain, Germany and Japan are in recession, but itchy-fingered central bankers are likely to push the button on interest rate cuts, or even more quantitative easing if they have to, rather than face a deep downturn that would do untold damage to heavily indebted economies. And with Bidenomics in full swing, America is applying plenty of fiscal stimulus to its economy; it seems unlikely that a Trump presidency would press for a return to hair-shirt austerity. All of that may mean inflation is not quite as tame as it may seem and, should it remain higher for longer than expected, history suggests “real” assets (ones that cannot be printed) may be more highly prized than assets than can be printed by central banks (cash) or issued like confetti by governments (bonds). Either way, sentiment feels washed out on miners and Anglo American in particular (with the mad dash towards Nvidia and AI stocks playing its role). Broadly, the Bloomberg Commodity index stands at 0.94 times the value of the FTSE All-World index. This compares with a peak of 2.5 times in 2012, when commodity stocks and miners were king of the hill, and a low of 0.5 in 1999 when the tech bubble was nearing its zenith. The post-1994 average is 1.2 times. More narrowly, Anglo American’s shares trade no higher than in 2005. As a result, the company has a market value of £23.1bn ($29.3bn), which compares with net assets (excluding $1.5bn of intangibles) of $30.1bn. So anyone who buys now is doing so at less than book value. Granted, the miner has just taken a $2.6bn asset writedown so nothing is set in stone, but this lowly valuation may give us some protection, while $1bn of cost and $1.6bn in capital expenditure cuts over the next three years may be the first steps to self-help. Time to wave the flag for Anglo American. Questor says: buy Ticker: AAL Share price at close: £17.27 Russ Mould is investment director at AJ Bell, the stockbroker. The views expressed are his own Read the latest Questor column on telegraph.co.uk every Monday, Tuesday, Wednesday, Thursday and Friday from 6am Read Questor’s rules of investment before you follow our tips "
}