{
    "title": "Nvidia hits record high as Goldman Sachs boosts PT on AI prospects",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/news/nvidia-eyes-fresh-record-goldman-141152433.html",
    "text": "(Reuters) -Nvidia's shares scaled a new peak on Monday after Goldman Sachs raised its price target for the high-flying chipmaker's stock in anticipation of a major boost to its earnings from the artificial intelligence (AI) boom. The stock rose about 4% to $689.21 and looked set to add about $70 billion to the company's market capitalization. Nvidia was valued at $1.63 trillion as of Friday's close. Nvidia has emerged as a poster child of the AI frenzy and saw a record monthly jump in its market value in January. The searing growth in the stock price - already up about 39% so far this year - has made it more expensive to own relative to its peers. Nvidia's shares trade at 31.4 times the company's forward earnings estimate, compared with the industry average of 22.9. Still, Goldman Sachs analyst Toshiya Hari sees more room for growth. \"We believe Nvidia will remain as the industry gold standard for the foreseeable future, given its robust hardware and software offerings and, importantly, the pace at which it continues to innovate,\" Hari said. Goldman Sachs analysts raised their price target for Nvidia to $800, the third highest among U.S. analysts covering the stock and indicating a 21% upside from current levels, according to LSEG data. Its previous price target was $625. The bank also lifted its full-year 2025-2026 earnings estimates for Nvidia by 22% on an average, citing signs of robust AI server demand and improving graphics processing unit (GPU) supply. Hari pointed to signs of AI monetization from companies including Microsoft and Meta Platforms as well as positive earnings outlook from AI server maker Super Micro Computer. While Nvidia has unlocked billions in revenue on the back of the AI frenzy, other chipmakers that are not so deeply involved in making chips for AI, such as Intel, have seen their shares lag. Nvidia is set to report results on Feb. 21, with analysts expecting fourth-quarter earnings per share of $4.51 and revenue of $20.19 billion, according to LSEG data. (Reporting by Sruthi Shankar in Bengaluru; Editing by Saumyadeb Chakrabarty and Shweta Agarwal) Related Quotes "
}