{
    "title": null,
    "date": "2/6/2024",
    "url": "https://ca.finance.yahoo.com/news/nvidia-stock-hits-record-high-020000433.html",
    "text": "Written by Amy Legate-Wolfe at The Motley Fool Canada NVIDIA (NASDAQ:NVDA) simply cannot be stopped. The world’s most valuable chipmaker hit record highs recently with shares almost hitting the US$700 per share mark. After coming back slightly, shares continued to climb yet again this week. So the question is, should investors buy the slight dip? Before we get into whether investors may want to consider Nvidia stock or not, let’s look at why the tech stock climbed in the first place. The company achieved a record-breaking surge in market value for the month of January. This was the largest monthly increase ever, mainly focusing around the optimism that surrounds artificial intelligence (AI), as well as earnings projections. AI in particular was a key focus. This came after Nvidia announced it would expand its AI offerings, and companies around the world were all ears. The chipmaker will provide new desktop graphics processors, as well as advancements for AI-related components and software. Nvidia stock has now passed the trillion-dollar mark, with a current market cap of US$1.7 trillion as of writing. But that high market cap certainly does not come with value. And there are some fears that shares could collapse should interest rate cuts come later as opposed to sooner and investors take returns. Which is why despite being an excellent company, I would consider this other tech stock instead. With all this optimism about the future of software, it’s a great time to consider other tech stocks in the field. For this I would go straight to Kinaxis (TSX:KXS), with positive outlooks on fintech and payments strengthening the future of the tech stock. The beginning of this year is likely to see conservative outlooks for software-as-as-service (SaaS) companies like Kinaxis stock. These companies have been making massive cuts, and Kinaxis stock is included. But this year that should lead to stabilization, and when interest rate cuts come, so too should more spending. So while shares may not be demonstrating the same insane growth as Nvidia stock, I wouldn’t knock Kinaxis stock off your watchlist. After all, its revenue continues to grow at a solid compound annual growth rate (CAGR) of 21% over the last five years. What’s more, it seems as though insiders have been using this opportunity to buy shares as well. And that certainly bodes well for today’s investor. Shares are now up 2% in the last year, and up 24% since bottoming out in October. Both Kinaxis and Nvidia have strong balance sheets and portfolios to entice today’s investors. Furthermore, they have a solid outlook for the future, especially as the market and economy improve, as well as with lower interest rates. But if you’re going to choose one, Kinaxis stock simply offers far more value and less volatility. The company continues to retain a high percentage of clients, all at enterprise level with not one taking up more than 10% of its total portfolio. This portfolio is also on a global scale, providing diversified revenue despite being a Canadian company. So while shares may wobble for now, this is a stellar long-term hold that’s only going to do better in 2024. The post Nvidia Stock Hits Record High: Time to Buy? (Or Buy This Lesser-Known Deal Instead?) appeared first on The Motley Fool Canada. Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor Canada analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could potentially produce monster returns in the coming years. Consider MercadoLibre, which we first recommended on January 8, 2014 ... if you invested $1,000 in the “eBay of Latin America” at the time of our recommendation, you’d have $17,988!* Stock Advisor Canada provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month – one from Canada and one from the U.S. The Stock Advisor Canada service has outperformed the return of S&P/TSX Composite Index by 35 percentage points since 2013*. See the 10 stocks * Returns as of 1/24/24 More reading 10 Stocks Every Canadian Should Own in 2024 [PREMIUM PICKS] Can You Guess the 10 Most Popular Canadian Stocks? (If You Own Them, You Might Be Losing Out.) More Canadian Stock Market News How to Build a Bulletproof Monthly Passive-Income Portfolio in 2024 With Just $25,000 Subscribe to Motley Fool Canada on YouTube Two New Stock Picks Every Month! Fool contributor Amy Legate-Wolfe has positions in Kinaxis. The Motley Fool recommends Kinaxis and Nvidia. The Motley Fool has a disclosure policy. 2024 Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup. A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o They soft-launched their relationship at the supermodel's cookbook event in Miami. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company. The president mocked his campaign rival for doing the one thing he claimed he wouldn’t have time for. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. Public disagreements about how to handle immigration resulted in U.S. Rep. Alexandria Ocasio-Cortez reminding Elon Musk he is an immigrant himself. "
}