{
    "title": "Nvidia Stock Is 'Almost Like A Replacement For Tesla,' Says Tastytrade's \nTom Sosnoff: 'It's A Beast' - Br",
    "date": "3/8/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/37553538/nvidia-stock-is-almost-like-a-replacement-for-tesla-says-tastytrades-tom-sosnoff-its-a-beast",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tastytrade founder Tom Sosnoff spotlighted the remarkable trading activity of Nvidia Corporation NVDA. What Happened: Talking to CNBC’s “Last Call,” Sosnoff described that Nvidia’s current market position has very little to do with its fundamental story. “You’re talking about a stock at this point, it’s a $900 stock that’s trading with penny-wide markets. The depth of liquidity today in Nvidia was off the charts. I mean it was the number one stock traded on our platform today. It just crushed everything else,” he said. Sosnoff also added that Nvidia will continue picking up steam with many retail customers getting attracted to the prospects. “It’s A Beast,” he said. “It’s almost kind of like a replacement for Tesla, what Tesla was a couple of years ago,” he added. See Also: Shiba Inu Lead Developer Kusama Echoes Dot Com Era Ahead Of Key Launch As SHIB Tops Charts: ‘Can Get Ther Why It Matters: Nvidia’s prominence in the trading sphere is not without reason. The Jensen Huang-led giant continues to hold the broadest ownership among fund managers, with 67% holding the stock. This is part of a broader trend where semiconductor stocks have seen a slight decline in their relative weighting in portfolios compared to their weight in the S&P 500 index. Moreover, a recent analysis by Mizuho analyst Vijay Rakesh has reiterated a Buy rating on Nvidia, along with other semiconductor giants like Advanced Micro Devices and Broadcom Inc. Rakesh has raised the price target of Nvidia to $1,000, up from $850, in anticipation of multiple catalysts ahead, including the AI boom. Read Next: Shiba Inu Lead Developer Denies Report Of ‘$100B Market’ Prediction: ‘Not My Words’ Image via Shutterstock Engineered by Benzinga Neuro, Edited by \nPooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}