{
    "title": "Microsoft, OpenAI and Nvidia back $2.6bn robot start-up",
    "date": "3/1/2024",
    "url": "https://www.irishtimes.com/business/2024/03/01/microsoft-openai-and-nvidia-back-26bn-robot-start-up/",
    "text": "AI engineer Jenna Reher works on a humanoid robot (Jae C Hong/AP) Microsoft, OpenAI and Nvidia are among the investors backing a Silicon Valley start-up that aims to introduce artificial intelligence-powered humanoid robots to the workforce and transform the global labour market. Figure AI said on Thursday it had raised $675 million from some of the world’s leading AI companies in a new funding round that valued the company at $2.6 billion. It plans to use the capital to scale up its AI training, robot manufacturing and hire more engineers. The start-up has also struck an agreement with OpenAI to develop the “next generation AI models for humanoid robots” and signed an AI infrastructure deal with Microsoft, the company added. “Our vision at Figure is to bring humanoid robots into commercial operations as soon as possible,” said chief executive Brett Adcock, who founded Figure nearly two years ago. Adcock, who also co-founded flying taxi service Archer Aviation, added that with the latest investment the company was poised to have a “transformative impact on humanity”. Figure AI believes its humanoid robots, which are capable of carrying out tasks such as moving crates on to a conveyor belt, could ease a labour shortage and fill as many as 10mn “undesirable or unsafe” jobs in the US alone. By 2030, the US manufacturing sector will have 2.1mn unfilled jobs, a 2021 study by Deloitte found. The latest funding round includes OpenAI’s start-up fund, Align Ventures and Ark Invest as well as Bezos Expeditions, the family office of Amazon founder Jeff Bezos. Parkway Venture Capital and Intel Capital, which invested in Figure’s previous $70 million funding round in May, have also thrown their weight behind the company again. Figure is seeking to accelerate its commercial plans with its OpenAI collaboration and enhance the ability of its robots to process language, it said. Peter Welinder, vice-president of product and partnerships at OpenAI, said the two companies would be able to “explore what humanoid robots can achieve when powered by highly capable multimodal models”. Microsoft will provide Figure access to the AI infrastructure, training and storage services of its cloud computing platform Azure. That will “support the deployment of humanoid robots to assist people with real world applications”, said Jon Tinter, corporate vice-president of business development at Microsoft. The start-up struck a deal in January with BMW, its first commercial agreement, to deploy its robots in the carmaker’s factories in the US, initially in South Carolina. It aims to start this year. Nvidia’s involvement in the funding round follows a bumper earnings report, which helped power global stock markets to record highs. The US chipmaker has been the chief beneficiary of an AI boom that has pushed demand for its chips. Nvidia has at the same time emerged as one of the most prolific investors in AI start-ups, investing in 35 companies in 2023. OpenAI, whose ChatGPT chatbot triggered the AI boom in late 2022, has a complex relationship with Microsoft. Microsoft has made a $13 billion investment in OpenAI but owns no conventional equity. OpenAI was founded as a not-for-profit organisation in 2015, but owns for-profit subsidiaries set up to facilitate Microsoft’s investment. The company is still in the process of changing its management structure following a high-profile meltdown of its board that resulted in chief executive Sam Altman being temporarily fired in November. Copyright The Financial Times Limited 2024 © 2024 The Irish Times DAC © 2024 The Irish Times DAC "
}