{
    "title": "Jeff Bezos and Nvidia are throwing serious cash at a human-like robot \nstartup",
    "date": "3/22/2024",
    "url": "https://ca.news.yahoo.com/jeff-bezos-nvidia-throwing-serious-030320879.html",
    "text": "Figure AI is raising millions from investors like Jeff Bezos and Microsoft for its humanoid robots. The startup's robot, Figure 01, will perform dangerous warehouse jobs amid labor shortages. Big-name backers include OpenAI, Nvidia, and Intel Corp. A startup that wants to put humanoid robots in warehouses around the world has an increasingly elite slate of big-name backers with deep pockets. Figure AI Inc. is raising about $675 million in funding with the help of investors like Jeff Bezos and the Microsoft Corporation, according to a Friday Bloomberg report, citing people familiar with the situation. The artificial intelligence startup aims to create autonomous humanoid workers that can support labor shortages amid a waning workforce, the company's website says. The machine, called Figure 01, is an AI-powered, self-reliant robot with the ability to think, learn, and interact safely alongside humans, according to the company. The robots will be tasked with performing dangerous warehouse jobs for which there aren't enough workers. Other big backers include OpenAI, which once thought about acquiring Figure, according to Bloomberg, as well as Nvidia Corp., which just this week announced $22.1 billion of revenue in its fourth quarter, stunning analysts and the AI industry alike. Amazon founder Jeff Bezos has committed $100 million to Figure's mission through his firm Explore Investments, LLC, Bloomberg reported, and Microsoft is investing $95 million. Nvidia and an Amazon.com-affiliated fund both pledged $50 million, and Intel Corp.'s investing arm is giving $25 million, according to the outlet; OpenAI has pledged $5 million. Figure had a pre-money valuation of about $2 billion, Bloomberg reported. News of Figure's funding comes amid an AI boom as several companies, including Tesla, work on their own robots. Read the original article on Business Insider Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Thanks to the attention it’s getting on TikTok and Instagram, stores around the world are selling out of this lean muscle builder. But, before you... \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia.  \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con  \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret.  They soft-launched their relationship at the supermodel's cookbook event in Miami. The \"Late Night\" comedian brutally summed up the former president's media company. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. "
}