{
    "title": "NVIDIA Co. (NASDAQ:NVDA) Director John Dabiri Sells 128 Shares",
    "date": "3/27/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-nvda-insider-buying-and-selling-2024-03-27/",
    "text": "NVIDIA Co. (NASDAQ:NVDA - Get Free Report) Director John Dabiri sold 128 shares of the stock in a transaction dated Monday, March 25th. The stock was sold at an average price of $940.00, for a total transaction of $120,320.00. Following the sale, the director now owns 2,055 shares of the company's stock, valued at approximately $1,931,700. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. NASDAQ NVDA traded down $23.11 during mid-day trading on Wednesday, reaching $902.50. 58,480,323 shares of the stock were exchanged, compared to its average volume of 54,159,652. The stock has a market capitalization of $2.26 trillion, a PE ratio of 75.50, a PEG ratio of 1.37 and a beta of 1.73. The business's fifty day simple moving average is $758.96 and its 200 day simple moving average is $569.38. NVIDIA Co. has a 1-year low of $258.50 and a 1-year high of $974.00. The company has a debt-to-equity ratio of 0.20, a quick ratio of 3.67 and a current ratio of 4.17. NVIDIA (NASDAQ:NVDA - Get Free Report) last announced its quarterly earnings results on Wednesday, February 21st. The computer hardware maker reported $5.16 earnings per share for the quarter, beating analysts' consensus estimates of $4.21 by $0.95. The company had revenue of $22.10 billion for the quarter, compared to analyst estimates of $20.40 billion. NVIDIA had a net margin of 48.85% and a return on equity of 93.61%. NVIDIA's revenue for the quarter was up 265.3% on a year-over-year basis. During the same quarter last year, the business earned $0.65 EPS. On average, research analysts anticipate that NVIDIA Co. will post 22.4 earnings per share for the current fiscal year. The business also recently declared a quarterly dividend, which will be paid on Wednesday, March 27th. Shareholders of record on Wednesday, March 6th will be issued a $0.04 dividend. The ex-dividend date of this dividend is Tuesday, March 5th. This represents a $0.16 dividend on an annualized basis and a dividend yield of 0.02%. NVIDIA's dividend payout ratio (DPR) is presently 1.34%. Hedge funds have recently made changes to their positions in the stock. Studio Investment Management LLC purchased a new position in shares of NVIDIA in the 4th quarter valued at $27,000. LFA Lugano Financial Advisors SA purchased a new position in shares of NVIDIA in the 4th quarter valued at $28,000. Criterion Capital Advisors LLC purchased a new position in shares of NVIDIA in the 4th quarter valued at $28,000. Peoples Financial Services CORP. purchased a new position in shares of NVIDIA in the 3rd quarter valued at $30,000. Finally, Your Advocates Ltd. LLP purchased a new position in shares of NVIDIA in the 3rd quarter valued at $30,000. Institutional investors and hedge funds own 65.27% of the company's stock. Several research firms recently issued reports on NVDA. Argus increased their price target on shares of NVIDIA from $850.00 to $950.00 and gave the stock a \"buy\" rating in a report on Wednesday, March 20th. Piper Sandler Companies increased their price target on shares of NVIDIA to $850.00 and gave the stock an \"overweight\" rating in a report on Friday, February 16th. Mizuho increased their price target on shares of NVIDIA from $850.00 to $1,000.00 and gave the stock a \"buy\" rating in a report on Thursday, March 7th. JPMorgan Chase & Co. increased their price target on shares of NVIDIA from $650.00 to $850.00 and gave the stock an \"overweight\" rating in a report on Thursday, February 22nd. Finally, Needham & Company LLC increased their price target on shares of NVIDIA from $600.00 to $850.00 and gave the stock a \"buy\" rating in a report on Thursday, February 22nd. Four analysts have rated the stock with a hold rating, thirty-seven have issued a buy rating and one has issued a strong buy rating to the company's stock. According to data from MarketBeat, the company has a consensus rating of \"Moderate Buy\" and an average price target of $908.68. Read Our Latest Stock Analysis on NVIDIA NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications.See AlsoFive stocks we like better than NVIDIAWhat Are Dividend Champions? How to Invest in the ChampionsBest Bear Market Funds: Top 3 Investment Options to ConsiderComparing and Trading High PE Ratio StocksIs DraftKings A Good Bet Ahead of Q1 Earnings?How to Use the MarketBeat Excel Dividend CalculatorMid-Cap Stocks to Outperform the Market This Cycle  Before you consider NVIDIA, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list. While NVIDIA currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of the 10 best stocks to own in 2024 and why they should be in your portfolio. Expert insights into the psychological impact of stock splits and the potential candidates for future splits. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}