{
    "title": "Nvidia's Jensen Huang says CEOs should manage the most people",
    "date": "3/9/2024",
    "url": "https://www.businessinsider.com/nvidia-jensen-huang-ceo-should-have-most-direct-reports-2024-3",
    "text": "       Nvidia's CEO, Jensen Huang, doesn't believe in gatekeeping. Huang, who oversees 50 direct reports, said that \"by definition,\" CEOs should have the most direct reports of anyone at a company. He made the comment during an interview with Stanford's Graduate School of Business on Tuesday. Huang's rationale is that those who report to the CEO (theoretically) require the least amount of oversight, so CEOs have more bandwidth than other managers. And taking on more direct reports could help CEOs level the playing field, too. According to Huang, the more people a CEO directly communicates with, the less likely an employee's stance at a company will be determined by their access to critical information. Related stories \"I don't believe in a culture, in an environment, where the information you possess is the reason why you have power,\" he said. In Huang's view, the role of the managers is not to broker power between workers but to collectively motivate the company's workforce. \"Our position at the company should have something to do with our ability to reason through complicated things, lead other people to achieve greatness, inspire, empower other people, support other people,\" he said. \"Those are the reasons why the management team exists, in service of all the other people that work at the company.\" The AI chipmaker has captured headlines since it announced its blockbuster earnings for the fourth quarter of 2023 late last month. And while Huang manages more people than other big-name CEOs (Amazon CEO Andy Jassy has 16 direct reports), Nvidia has close to 30,000 employees, according to a company report from 2023. So, Huang is only overseeing a small fraction of Nvidia's employees. While Huang might be an outlier (and overachiever) as a manager, the number of direct reports CEOs are taking on is on the rise. CEOs' direct reports doubled from five in the mid-1980s to close to 10 in the mid-2000s, according to the Harvard Business Review. That's a pretty optimal number. Hal Gregersen, formerly the executive director of the MIT Leadership Center, previously told BI the ideal number of direct reports — whether you're a CEO or lower-level manager — is between six and twelve. Read next Jump to "
}