{
    "title": "Nvidia's stock continues to hit new highs. Why that may be 'a bit \nunhealthy.'",
    "date": "3/7/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240307360/nvidias-stock-continues-to-hit-new-highs-why-that-may-be-a-bit-unhealthy",
    "text": "By Emily Bary A Mizuho analyst flags strong momentum for chip stocks in the absence of new information Nvidia Corp. shares are up for the sixth day in a row, and they're on track to rack up their sixth straight record high. That's an example of the type of market activity that has at least one analyst feeling somewhat worried. It \"feels a bit unhealthy\" to see Nvidia shares (NVDA) race to new records almost daily, Mizuho desk-based analyst Jordan Klein wrote in a note to clients Thursday morning. And it's not just Nvidia's momentum that's starting to spook Klein - as he notes that shares of \"new\" AI winners like Broadcom Inc. (AVGO), Marvell Technology Inc. (MRVL) and Taiwan Semiconductor Manufacturing Co. Ltd. (TSM) (TW:2330) were each up in the realm of 6% to 8% last Friday on seemingly no new fundamental information. See also: Micron's stock gets new buy call as it's deemed another chip-sector play on AI In light of some semiconductor stocks' moves Thursday and their sharp rallies in recent months, Klein said he was \"starting to actually get worried\" about the tech market - not because he doesn't believe chip companies will benefit from growth in spending on artificial-intelligence hardware, but because investor sentiment is starting to resemble a \"frenzy.\" Investors seem to be \"either in pure chase mode\" or behind their benchmarks such that they're dumping past winners in favor of boosting their exposure to AI-chip plays that continue to show strong momentum, he said. Also read: It's not just Nvidia. These companies are finally making real money from AI. Klein called out the \"self-reinforcing\" nature of the current march higher for chip stocks. \"This takes prices higher, but pushes some of the laggards lower as folks rotate out of losers and chase winners,\" he noted. The frenzied market action and the fact that sell-side analysts continue to boost their price targets on semiconductor names are giving Klein flashbacks to the technology sector circa 1999 and 2000. Needless to say, \"that did not end well,\" he observed. Nvidia is gearing up for its annual GTC event later this month, and that could be the \"blow-off top\" moment for the market. He doesn't think managers want to trim their Nvidia positions before that event, but at same time, he's not expecting too many surprises from Nvidia's management team. \"I could see some fast money take profits on the headlines, then others see a pullback and get nervous that the launch or event was somehow a disappointment (when it would not be), [and] then the flywheel starts working in reverse,\" Klein wrote. And since Nvidia is leading the tech rally, he's not sure which stock could step in to prop up the market if Nvidia were to break. Apple Inc. (AAPL), Tesla Inc. (TSLA), Alphabet Inc. (GOOG) (GOOGL) and \"even\" Meta Platforms Inc. (META) don't have that same power, in his view. Meanwhile, Broadcom and Marvell are due to report quarterly results after Thursday's closing bell. Neither one is poised to \"tank\" sentiment around Nvidia and, in fact, both seem more likely to further fuel the excitement, Klein said. Don't miss: Nvidia's stock sees one advantage that only two other chip makers share Those companies have non-AI businesses that are in decline and muddy their stories, but Klein added that \"any more bullish tone [or] financial guides from AI products\" could send their stocks surging. Klein said he has an overall \"positive\" view on the semiconductor sector, though he worries some investors could take profits following Nvidia's GTC and in the lead up to the next chip earnings season. -Emily Bary This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 03-07-24 1300ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}