{
    "title": "NVIDIA's AI chip surge visualized",
    "date": "3/6/2024",
    "url": "https://www.spglobal.com/marketintelligence/en/news-insights/blog/nvidias-ai-chip-surge-visualized",
    "text": " NVIDIA's AI chip surge visualized MediaTalk | Season 2  Ep.6 All Things Streaming Despite turmoil, project finance remains keen on offshore wind Next in Tech | Episode 160: AI use cases Eastern Europe multichannel markets begin to shrink After a blowout earnings report for the fourth quarter 2023, with revenues growing 265.3% year over year, NVIDIA Corp. now generates more annual revenue than Intel and is closing in on Taiwan Semiconductor Manufacturing Co. Ltd.  NVIDIA grew its full-year revenue to $60.92 billion, up 125.9% year over year. Among the top five semiconductor companies, NVIDIA is the only one that grew annual revenue in 2023. NVIDIA also more than doubled its EBITDA margin year over year while each of the four other top semiconductor companies' margins declined. NVIDIA's growth underlines the success of its advanced chip architecture amid the emergence of generative AI applications. The company's history of pushing the limits of graphics processing technologies put it in prime position to build the hardware powering the large models behind services such as ChatGPT. The vast majority of the company's revenue gains are running through its datacenter operation, which grew 216.7% to $47.5 billion in revenue in 2023. On the company's earnings call, management estimated that 40% of data center revenue was for AI inference. This figure is much higher than most analysts were expecting.  NVIDIA CEO Jensen Huang said the company is primed for continued growth through at least calendar year 2025 as customers continue to adopt NVIDIA's purpose-built hardware and lean away from general-purpose computing solutions. NVIDIA guided to $24 billion in revenue in the first quarter of 2024, which would make for three consecutive quarters of 200%-plus year-over-year growth. However, the company will begin to face a tougher year-over-year comparison as soon as the second quarter, which will mark a year since the company's datacenter revenue started to surge. NVIDIA's success is also reflected in its EBITDA and margins. It surpassed both Intel and Qualcomm in terms of annual EBITDA in 2023 but is still $12.17 billion behind TSMC.  Granted, there are key structural differences between TSMC and NVIDIA, including the fact that TSMC manufactures chips while NVIDIA is focused on chip design. NVIDIA is a primary customer of TSMC along with other key semiconductor companies such as Apple Inc., Qualcomm and AMD. However, a discussion of top moneymakers in this segment would not be complete without TSMC's unrivaled scale in the industry, which will make it difficult to catch. Furthermore, NVIDIA will face increasing competition in the AI chip space challenging its market share in the years ahead. Advanced Micro Devices Inc. and Intel Corp. are each growing their offerings of AI chips while hyperscalers like Amazon.com Inc., Microsoft Corp. and Alphabet Inc. are designing their own. It also faces losing access to the massive Chinese market as US export restrictions tighten. Still, NVIDIA's head start in the segment will give it a distinct advantage for years to come.  Technology is a regular feature from S&P Global Market Intelligence Kagan. This article was published by S&P Global Market Intelligence and not by S&P Global Ratings, which is a separately managed division of S&P Global. "
}