{
    "title": "Is the surging Nvidia share price causing a stock market bubble?",
    "date": "3/5/2024",
    "url": "https://www.fool.com.au/2024/03/05/is-the-surging-nvidia-share-price-causing-a-stock-market-bubble/",
    "text": " Access all of your premium services in our Member Centre Click here to learn more about our premium services TO MAKE THE WORLD SMARTER, HAPPIER, AND RICHER. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services. Is one high-flyer a sign of investors getting too excited? Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The NVIDIA Corp (NASDAQ: NVDA) share price has been on an incredible run. It's impressing the market with its strong financial growth. In this article, I'm going to look at whether this is the sign of a stock market bubble. It's a fantastic time to own NVIDIA shares and be involved in any company that has genuine exposure to artificial intelligence growth. Since the start of 2024, the NVIDIA share price has risen 77%. The last year has seen a 262% increase for the company. In five years, it has gone up more than 2,100%. Some investors may think it's fair to compare this period to the 1999 dot com bust. Businesses that were involved with the internet that had hardly any revenue (or none at all) were being valued astronomically. But, NVIDIA, Microsoft and many others are generating lots of revenue. A few weeks ago, NVIDIA reported quarterly revenue of US$22.1 billion, up 22% quarter over quarter and up 265% year over year. FY24 full-year revenue was up 126% to $60.9 billion. It also said that underlying earnings per share (EPS) was US$12.96, an annual increase of 288%. NVIDIA revealed it's expecting the FY25 first-quarter revenue to be around US$24 billion, which would be a quarter-over-quarter increase of 8.6%. It's demonstrating real growth, making huge revenue and posting enormous growth in its profit. The current forecast on Commsec puts the NVIDIA share price at 36 times FY25's estimated earnings and 30 times FY26's estimated earnings. To me, those sorts of forward price/earnings (P/E) ratios are not excessive at all considering how quickly it's growing. It could deliver stronger growth than what investors are expecting. Microsoft shares are trading at 31 times FY25's estimated earnings. I'm not going to call these stocks cheap, and the higher interest rate environment does raise the question of what multiple is fair in the current economic environment. However, in three years, these large tech stocks may have materially grown earnings and interest rates could be materially lower. Billionaire investor recently commented on LinkedIn about the stock market bubble question: When I look at the US stock market using these criteria, it—and even some of the parts that have rallied the most and gotten media attention—doesn't look very bubbly. The Mag-7 is measured to be a bit frothy but not in a full-on bubble. Valuations are slightly expensive given current and projected earnings, sentiment is bullish but doesn't look excessively so, and we do not see excessive leverage or a flood of new and naïve buyers. That said, one could still imagine a significant correction in these names if generative AI does not live up to the priced-in impact. We can look for instance at Nvidia today versus Cisco during the tech bubble. The two cases have seen similar share price trajectory. However, the path of cash flows has been quite different. Nvidia's two-year forward P/E is around 27 today, reflecting that, even as the market cap has grown ~10x, earnings have also grown significantly and are expected to continue to grow over the next year or two because of actual orders that we can validate. During the tech bubble, Cisco's two-year forward P/E hit 100. The market was pricing in far more speculative/long-term growth than we see today. I'm not an expert on US shares or AI. But, businesses that are delivering strong long-term growth are likely to see rising share prices as the market realises their potential. In my opinion, most of the large US tech companies are delivering earnings growth that can justify the investor excitement we're seeing. Hence, I don't think this is a stock market bubble. Are other industries and businesses reporting numbers that justify their current share prices? That's what investing in shares is all about – making decisions about price and value. I was very excited about share prices in late October 2023 and early November 2023, with loads of opportunities. I'm a lot less excited now. I believe business profits and share prices can rise over time from here, and there are still some undervalued areas, in my opinion, while some areas look challenged. Keep in mind that if economies remain strong, interest rates are likely to remain higher for longer. For a five-year investment, I'd rather buy a name like Nvidia, Microsoft or Alphabet over Commonwealth Bank of Australia (ASX: CBA) or BHP Group Ltd (ASX: BHP) because of the potential earnings growth for those US tech names. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Motley Fool contributor Tristan Harrison has no position in any of the stocks mentioned. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Alphabet, Microsoft, and Nvidia. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has recommended the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool Australia has recommended Alphabet and Nvidia. The Motley Fool has a disclosure policy. This article contains general investment advice only (under AFSL 400691). Authorised by Scott Phillips. March 29, 2024 | Tristan Harrison I’m a believer in the long-term outlook of these stocks. Read more » March 28, 2024 | Sebastian Bowen I would happily exchange dollars for these two shares right now. Read more » March 28, 2024 | Bernd Struben I believe these ASX 200 shares will continue rewarding passive income investors for years to come. Read more » March 28, 2024 | Tristan Harrison I decided to put this stock in my shopping basket over Woolies. Read more » March 28, 2024 | Tony Yoo Reliable dividend shares are everywhere on the ASX. Here's how you could use that to your advantage. Read more » March 28, 2024 | Tony Yoo The best performer on the index last year has had a poor start to 2024. Let's examine whether this is… Read more » March 28, 2024 | Mitchell Lawler Just because a company's share price has gone up doesn't mean it's no longer good value. Read more » March 27, 2024 | Sebastian Bowen I think these index funds are well worth a look right now. Read more » View All Sign Up for Take Stock Investment news, stock ideas, and more, straight to your inbox. Get Started Investing You can do it. Learn about investing with our Investing Education hub. Win at Retirement Our latest articles and strategies for the post-work life you want. Listen to Our Podcast Hear our experts take on shares, the market & how to invest. Join Our Premium Community Join our flagship membership service, Share Advisor. The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service. Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. The Motley Fool launched its Australian presence in 2011, and since then has grown to reach over 1 million Australians. Read more about us >  This Service provides only general, and not personalised financial advice, and has not taken your personal circumstances into account. The Motley Fool Australia operates under AFSL 400691. For more information please see our Financial Services Guide. Please remember that investments can go up and down. Past performance is not necessarily indicative of future returns. The Motley Fool Australia does not guarantee the performance of, or returns on any investment. We respectfully acknowledge the Traditional Custodians of the land where we live and work and pay our respects to all Elders, past and present, of all Aboriginal and Torres Strait Islander nations. © 2010 - 2023 The Motley Fool Australia Pty Ltd. All rights reserved. ACN: 146 988 052 Australian Financial Services Licence (AFSL): 400691 The Motley Fool Australia, PO Box 104, Isle of Capri, Qld 4217 Contact Details: Phone: (03) 8592 4841 Email: [email protected] Our friendly customer service team will happily get back to you as soon as they can. Notifications Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! "
}