{
    "title": "Tech war: Huawei's AI chip capabilities under intense scrutiny after market \nleader Nvidia taps it as potential rival",
    "date": "3/3/2024",
    "url": "https://finance.yahoo.com/news/tech-war-huaweis-ai-chip-093000034.html",
    "text": "The closely-guarded semiconductor capabilities of US-sanctioned Huawei Technologies have come under fresh scrutiny after Nvidia identified the Chinese telecommunications equipment giant as a potential rival in artificial intelligence (AI) chips for the first time. With Nvidia currently unable to ship its advanced graphics processing units (GPUs) to mainland China under Washington's export restrictions, a new AI chipset from Huawei has emerged as a replacement for the US firm's Chinese products, industry insiders and analysts say. The Huawei Ascend 910B, already available via distributor channels on the mainland, is considered by some industry participants to be on par in terms of computing power with Nvidia's sought-after A100 data-centre GPUs. Huawei has not made any public comment on the 910B. Do you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. The Ascend 910B is believed to succeed the Ascend 910, which was released by Huawei in August 2019, three months after it was put on a trade blacklist by the US Commerce Department. The chip can compete with Nvidia's A100 in terms of powering AI algorithms, according to Dylan Patel, chief analyst at San Francisco-based semiconductor research firm SemiAnalysis. A Chinese flag is seen near the logo atop Semiconductor Manufacturing International Corp's headquarters in Shanghai. The country's top contract chip maker is said to be the supplier of Huawei Technologies' new artificial intelligence chipset, the Ascend 910B. Photo: Bloomberg alt=A Chinese flag is seen near the logo atop Semiconductor Manufacturing International Corp's headquarters in Shanghai. The country's top contract chip maker is said to be the supplier of Huawei Technologies' new artificial intelligence chipset, the Ascend 910B. Photo: Bloomberg> \"It [the Ascend 910B] is a bit above the A100 theoretically,\" Patel said, adding that the chip is fabricated by China's top foundry, Semiconductor Manufacturing International Corp (SMIC), on a 7-nanometre process. US sanctions since 2019 have restricted Huawei's semiconductor development and dealt a severe blow to its smartphone business. But the Shenzhen-based company has been quietly bolstering its chip business by partnering with various domestic suppliers, according to several people familiar with the matter, who declined to be identified due to the sensitivity of the matter. Huawei showed its resilience in August last year, when it surprised the industry with the Mate 60 Pro, the company's first 5G smartphone release since the Mate 40 series in October 2020. Sales of the new handset propelled Huawei back to the top of the domestic smartphone market earlier this year. The SMIC-made Kirin 9000s processor that powers the Mate 60 Pro sparked intense industry speculation over how Huawei managed to overcome a blanket US chip ban. A Kirin 9000s processor, developed by Huawei Technologies chip design arm HiSilicon, is taken from a Mate 60 Pro 5G smartphone in Ottawa, capital of Canada, on September 3, 2023. Photo: Bloomberg alt=A Kirin 9000s processor, developed by Huawei Technologies chip design arm HiSilicon, is taken from a Mate 60 Pro 5G smartphone in Ottawa, capital of Canada, on September 3, 2023. Photo: Bloomberg> At the domestic release of the Ascend 910, Huawei touted the chip at the time as \"the world's most powerful AI processor\", fabricated by the world's top contract chip maker, Taiwan Semiconductor Manufacturing Co, using a 7-nm process. Huawei's new AI chip appears to have emerged around the same time as the Mate 60 Pro's release last August. Chinese online search and AI giant Baidu ordered 1,600 of Huawei's Ascend 910B chips in the same month, according to a Reuters report in November 2023 that cited a source. Two weeks before Reuters published that report, Chinese AI company iFlytek launched its Feixing One computing platform based on Huawei's Ascend chips. This means the iFlytek Spark 3.0, the firm's updated large language model (LLM), may have been developed on AI chips. LLMs are the technology used to train generative AI services like ChatGPT. Huawei declined to comment on the matter. Jensen Huang, the co-founder, president and chief executive of US chip design firm Nvidia, attends a session of the World Governments Summit in Dubai, United Arab Emirates, on February 12, 2024. Photo: Reuters alt=Jensen Huang, the co-founder, president and chief executive of US chip design firm Nvidia, attends a session of the World Governments Summit in Dubai, United Arab Emirates, on February 12, 2024. Photo: Reuters> In an interview with tech media outlet Wired last month, Nvidia chief executive Jensen Huang described Huawei as a \"really, really good company\". \"They're limited by whatever semiconductor processing technology they have, but they'll still be able to build very large systems by aggregating many of those chips together,\" Huang said. Amid the increased focus on generative AI in the past year and tighter US sanctions, Huawei and SMIC have allocated more capacity to AI chips, according to a Reuters report last month. One GPU distributor, who declined to be named due to the sensitivity of the matter, said that the Ascend 910B is \"available for order, but supply is really tight at the moment\". A server used for AI training and embedded with eight Ascend 910B cards costs around 1.5 million yuan (US$208,395), which is roughly in the same range as A100 server prices quoted in black market channels, according to a separate person familiar with the matter who also declined to be named. Huawei has not made any comment on the Ascend 910B, despite reiterating that AI is a \"key strategy\" ahead of the firm's exhibition at the four-day trade show MWC Barcelona in Spain last week. Many analysts and industry professionals are reluctant to comment on the Nvidia and Huawei showdown, although they pointed out that the US chip designer has depth in GPUs and benefits from its software ecosystem CUDA, a computing platform that allows developers to unleash the full potential of semiconductors. \"CUDA is sticky, Nvidia did all of this hard work on its own and is reaping the benefits,\" said Brian Colello, technology equity strategist at Morningstar. \"Huawei and its software partners will need to build out an ecosystem comparable [to Nvidia's CUDA] when it comes to tools to build AI models.\" Despite lagging CUDA's 2 million-strong list of registered developers, Huawei has its proprietary Compute Architecture for Neural Networks, a platform that connects Ascend hardware and software, crucial to unlocking AI computing power. Colello said Huawei might have to make similar [big] investments in mainland China to strengthen its software capabilities. He added that perhaps other companies will work on the software libraries, while Huawei focuses on chip design. \"Huawei's strength is not in the software stack,\" said one Shanghai-based tech investor who requested anonymity. \"The US sanctions put limits on chip performance and production yields.\" This article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2024 South China Morning Post Publishers Ltd. All rights reserved. Copyright (c) 2024. South China Morning Post Publishers Ltd. All rights reserved. Related Quotes "
}