{
    "title": "NVDA Stock on Fire: Can Potential Nvidia Investors Still Get In or Will \nThey Get Burned?",
    "date": "1/28/2024",
    "url": "https://investorplace.com/2024/01/nvda-stock-on-fire-can-potential-nvidia-investors-still-get-in-or-will-they-get-burned/",
    "text": " Valuation concerns aside, Nvidia stock remains a must-own in the tech sector Advertisement Source: Evolf / Shutterstock.com Nvidia (NASDAQ:NVDA) stock has started 2024 just as it finished 2023, hotter than a pistol, up 28% year-to-date and 211% over the past year. Nothing can stop it. ThinkAdvisor.com interviewed investment strategist Harry Dent Jr. about the 2024 market outlook. Dent argued that the S&P 500 could lose 86% of its value in 2024. However, try not to take the doom and gloom too seriously. He also suggested that January would foretell the pain ahead. Well, Nvidia’s up 28% this month, while the index has gained over 3%, a respectable number given its convincing performance in 2023. Is it too late to buy NVDA stock? I’ll look at both sides of the argument. Well, it is if you listen to Harry Dent. He believes the apocalypse will soon be upon us. In Dent’s defense, I saw a chart recently (I’ll be damned if I could remember where) that made a convincing case that stocks were ready for a bit of a shakeup. On Jan. 24, Nvidia’s market cap hit $1.5 trillion for the first time. It hit $1 trillion in May 2023. With 2.47 billion shares outstanding, it can get to $2 trillion with another 33% gain. If successful, that would be a 631% gain from its October 2022 low of around $112. Based on the analyst EPS estimate for 2024 of $11.07 a share, it’s currently trading at 56x earnings. Its five-year average forward P/E is 42, so there’s no question it’s not a cheap buy right now. However, with 49 of 53 analysts rating it Overweight or Buy, anything’s possible. InvestorPlace’s Josh Enomoto declared in early November that Nvidia had a high price-to-earnings ratio relative to its AI and machine learning peers. Further, he suggested NVDA stock was more expensive than 90% of its tech peers. As a result, he was near-term bearish on the stock. I don’t think there’s any doubt that Nvidia has to hit its ambitious growth targets. The average analyst estimate for revenue growth in 2024 is 119% and 58% in 2025, with 2024 and 2025 EPS of $3.34 and $12.31, respectively, for its share price to keep moving higher. That’s not a slam dunk. In July 2017, I wrote about why the perception Nvidia’s stock was expensive at the time — it traded at 55x its trailing earnings and 14x sales — wasn’t entirely accurate. I used McCormick & Company’s (NYSE:MKC) acquisition of Reckitt Benckiser’s (OTCMKTS:RBGLY) French’s and Frank’s Hot Sauce brands to illustrate why value is relative. “Nvidia’s fiscal 2017 free cash flow was $1.5 billion, or 22% of its annual revenue. McCormick’s free cash flow was $658 million or 15% of its annual revenue,” I wrote in 2017. “If McCormick is willing to pay seven times sales for a business that likely doesn’t generate free cash flow equal to or greater than 15% of its annual revenue, Nvidia shareholders paying 14 times sales is the price you pay to own a business that generates 50% more free cash flow relative to annual revenue.” The most impressive part of that quote concerns free cash flow. In fiscal 2017, it was $1.5 billion. Bank of America recently highlighted that Nvidia should be able to generate $100 billion in free cash flow over the next two years, more than 3x what it generated over the past two and 56x what it did seven years ago. “Of the ~$100 billion [of] free cash flow, we estimate only ~$30 to $35 billion could be deployed for buybacks, leaving a meaningful $65 to $70 billion in ammunition for new organic and inorganic growth initiatives,” Business Insider reported BofA analyst Vivek Arya’s comments from a Jan. 4 note to clients. While there’s no question we are in the early innings of AI, and the leadership positions could change over time, I don’t think there’s any doubt that it’s Nvidia’s game to lose. Until someone can show they’re up to the challenge of toppling the company from the top of the AI mountain, its stock seems destined to keep moving higher. I believe it’s still a buy. However, pick up half a position now, and the other half should it correct into the low $500s or high $400s. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. Technology, Artificial Intelligence, Semiconductor   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/nvda-stock-on-fire-can-potential-nvidia-investors-still-get-in-or-will-they-get-burned/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}