{
    "title": "The 3 Most Undervalued Tech Stocks to Buy in January",
    "date": "1/20/2024",
    "url": "https://finance.yahoo.com/news/3-most-undervalued-tech-stocks-015525408.html",
    "text": "Fueling the main narrative for undervalued tech stocks to buy in January is the rotation principle. With the usual suspects still garnering much attention, it’s tempting to continue riding the same horse. However, a better idea may be to consider innovators that just haven’t received much attention. For example, everyone seemingly loves talking about Nvidia (NASDAQ:NVDA) and for good reason. In the trailing 52 weeks, NVDA skyrocketed over 227%. However, in the past half-year period, the equity unit gained about 21%. It’s still a decent performance but it appears investors are getting leery about its forward prospects. On the other hand, the technology players that fell by the wayside as Nvidia stormed to new heights may be attractively de-risked. For speculators, these ideas could see blue skies ahead. With that, below are the undervalued tech stocks to buy this month. InvestorPlace - Stock Market News, Stock Advice & Trading Tips Source: Shutterstock A semiconductor specialist focused on advanced microchips, STMicroelectronics (NYSE:STM) provides critical services to multiple industries. However, as a stagehand manager if you will, it doesn’t quite get the attention it deserves. Still, that makes the enterprise an intriguing idea for undervalued tech stocks. In the past 52 weeks, STM only gained about 8%, possibly suggesting room for additional upside. Mainly, the bullish narrative centers on its broad relevancies. For example, one of ST’s bread-and-butter businesses is providing semiconductors to automotive manufacturers. These chips cover various applications such as powertrain management, safety systems, and advanced drive-assistance systems, among others. Better yet, the auto semiconductor market could print revenue of $77.76 billion by 2030, representing a compound annual growth rate (CAGR) of 8.1% from 2023. Just as well, STM trades at only 12.53X forward earnings, below the sector median of 21.69X. Further, the company’s return on invested capital (ROIC) stands at nearly 31%, reflecting effectiveness in generating profitable investments. Lastly, analysts rate shares as a consensus strong buy with a $50.75 average price target. Source: Peshkova / Shutterstock A global enterprise specializing in the design, manufacture and distribution of end-to-end networking and connectivity productions and solutions, Belden (NYSE:BDC) offers wide relevancies. Whether targeting industrial automation, smart buildings or 5G integration, Belden brings innovative solutions to the table. Despite its strengths, BDC slipped more than 5% in the past 52 weeks. That might change, making BDC one of the undervalued tech stocks to consider. How can investors be confident in the bullish narrative? Mainly, it has to do with the underlying Network as a Service (NaaS) industry. According to Grand View Research, the global NaaS space reached a valuation of $6.67 billion in 2021. However, by 2030, the sector could print revenue of $81.82 billion. If so, that would translate to a CAGR of 32.9%. As the market that Belden serves gets stronger, BDC should receive downwind benefits. In the meantime, shares trade for only 13.19X forward earnings, below the sector median of 16X. In closing, analysts peg shares as a unanimous strong buy with an $87.50 price target. Source: Chompoo Suriyo / Shutterstock.com A technology research and development company, InterDigital (NASDAQ:IDCC) provides wireless and video technologies for mobile devices, networks, and services worldwide. Per its public profile, InterDigital features a portfolio of about 32,000 U.S. and foreign-issued patents and patent applications. Tremendously relevant, those in the know bid up IDCC to a return of nearly 69% in the past 52 weeks. Even better, it remains a candidate for undervalued tech stocks. Fundamentally, the company could see robust gains through its wireless technology licensing business. With its intellectual property (IP) covering technologies used in connected devices and the Internet of Things (IoT), InterDigital commands a large addressable market. For example, Precedence Research estimates that the global IoT space reached a valuation of $320.9 billion in 2022. By 2032, the sector could hit over $1.56 trillion, resulting in a CAGR of 17.2%. Notably, IDCC trades at a mere 19X forward earnings, favorably below 60.8% of its peers. Yet its ROIC clocks in at an impressive 22.86%. In the past seven months, all four analysts who covered IDCC rated it a buy. On the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. A former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The post The 3 Most Undervalued Tech Stocks to Buy in January appeared first on InvestorPlace. Related Quotes "
}