{
    "title": "Nvidia's investment in startups has nearly tripled as other tech \nheavyweights pull back",
    "date": "1/31/2024",
    "url": "https://finance.yahoo.com/news/nvidias-investment-startups-nearly-tripled-182920547.html?prefer_reader_view=1&prefer_safari=1",
    "text": "Nvidia's startup investments jumped 280% year-over-year, S&P Global reported. While its venture activity jumped, other tech giants largely pulled back investing. Nvidia's blowout year provided it with a massive cash pile to unleash on AI-focused firms. Nvidia's blowout performance last year has helped cement the firm as a rising star in corporate venturing, with the chipmaker's startup investments having nearly tripled in 2023, S&P Global reported on Tuesday. Specifically, Nvidia's annual year-on-year investing has ballooned 280%, the agency calculated. That's in stark contrast to a broad retreat amid other tech giants, as leading firms such as Microsoft, Alphabet, and Meta curbed their startup activity. In fact, the Facebook parent company suspended venture initiatives altogether in 2023. Pullbacks also extend to other firms that are historically leaders in corporate venturing, such as SoftBank Group and Tencent Holdings. Only IBM and Amazon expanded investments, which grew 100% and 13% year-on-year. Nvidia's participation in 38 funding rounds also made the semiconductor juggernaut the fourth-biggest corporate venture investor of the year. Ahead of it stand Microsoft, Softbank, and Alphabet. The firm tunneled $872 million in non-affiliated firms in the first nine months, according to its third-quarter report. The total value of rounds surpasses $5 billion, S&P Global cited. Its rise in the space has been facilitated by the company's stellar stock and revenue outperformance in 2023. Nvidia's shares jumped roughly 225% through the year, as its chips have become an integral component of emerging artificial intelligence technology. Within just two quarters, the company nearly tripled its revenues, hitting $18.1 billion for the year in the company's last earnings report. Investors are betting that Nvidia's product roadmap and more AI frenzy will only continue to boost growth. With so much capital, this has allowed Nvidia to unleash its cash pile on smaller companies. The firm's 2022 termination of a deal to acquire Arm Holdings suggests that bigger M&A deals are off the table, S&P Global said. The firm is largely interested in emerging technologies that propel it deeper into the AI space. Last year, it invested into 11 firms that deal with AI infrastructure, while also focusing on generative AI developers. Healthcare was also a bigger investing theme, with Nvidia focused on firms that apply AI in the sector. For 2024, the chipmaker doesn't seem to be slowing down; its already announced three startup investments, S&P Global said. Read the original article on Business Insider "
}