{
    "title": null,
    "date": "1/30/2024",
    "url": "https://www.benzinga.com/markets/equities/24/01/36851259/ai-growth-lower-interest-rates-foil-recession-threats-in-2024-says-imf",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Fears of a severe economic downturn are fading as economic growth continued to outpace expectations, and on Tuesday, the International Monetary Fund (IMF) backed up hopes of a soft landing in its quarterly report. The Washington, D.C.-based IMF said economic resilience seen in the second half of 2023 will carry over into 2024 and forecast annual growth this year of 3.1%, an upgrade of 0.2 percentage points from its previous quarterly report. “The global economy begins the final descent toward a soft landing, with inflation declining steadily and growth holding up. But the pace of expansion remains slow, and turbulence may lie ahead,” said Pierre-Olivier Gourinchas, economic counselor and director of research at the IMF. It won’t be an even path for all economies and the IMF said it expected slower growth in the U.S. where tight monetary policy continues to exert a drag. Watch out for some potential headwinds that could help fuel higher growth than the IMF’s baseline scenario of 3.1%. These include the possibility of disinflation that could prompt central banks to ease more quickly and delays to fiscal tightening plans as governments increase public spending and investment. The IMF also looked at the rapid development of artificial intelligence (AI), which could boost investment and spur rapid productivity growth. Indeed, this has been a major theme of the past year and U.S. markets have been among the best represented by the AI phenomenon, with stocks such as Nvidia Corp NVDA, which is the market leader in AI chip production. “It’s hard to find a company that has benefited more from AI than Nvidia. Currently, Nvidia produces 70%-90% of all AI chips globally. As just about every analyst calls a top, the company keeps pushing higher,” the Kobeissi Letter said Tuesday on X. For exposure to Nvidia and other key players in AI, investors have been backing the Global X Robotics & Artificial Intelligence ETF BOTZ. Also Read: AI, Biotech, Energy Sectors Expect M&A Revival For 2024 The geopolitical outlook seems to become more fraught with every passing day yet, thus far, the usual sensitive suspects such as oil and commodities have barely responded. This could soon change if Iran gets drawn further into the troubles around the Middle East and the Red Sea. The United States Oil Fund ETF USO has gained 8% since the start of the year. The IMF also notes that inflation could prove to be stickier than markets currently believe. While it seems to be mainly service sector based, a rise in energy and commodity prices could begin to push the price of goods higher. The IMF expects the U.S. economy to grow by an annual 2.1% in 2024, unchanged from its October projection, but down from 2.5% in 2023. The slower rate of growth is down to “the lagged effects of monetary policy tightening, gradual fiscaltightening, and a softening in labor markets slowing aggregate demand,” the IMF said. One of the biggest challenges in 2024, however, will be for governments — loaded up with debt after huge pandemic-era spending — to tighten fiscal policy. “The most pressing risk is that countries do too little. Fiscal fragilities will build up until the risk of a fiscal crisis forces sudden and disruptive adjustments, at great cost,” said Gourinchas. Read Next: Raise Taxes Or Be Damned: Robert Rubin Warns Of ‘Enormous’ Risks Of Runaway Deficit Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}