{
    "title": "History Tells Us the Nasdaq Is About to Surge: 1 Stock to Buy Before It Does",
    "date": "1/13/2024",
    "url": "https://finance.yahoo.com/news/history-tells-us-nasdaq-surge-142000981.html",
    "text": "Even after a big rally over the last year (it jumped 43% in 2023), the Nasdaq Composite index is still down roughly 7% from its record high. While past performance doesn't necessarily dictate future results, there's a historical connection between lower interest rates and stronger performance for growth stocks. Some analysts predict the Federal Reserve will begin cutting interest rates this year. Rate cuts generally lead to lower yields on bonds, which makes borrowing money cheaper. Such conditions also tend to increase the appeal of stocks as an investment vehicle. In addition to the potential for positive valuation catalysts stemming from rate cuts, strong demand for companies involved with artificial intelligence (AI) could further power strong growth for the Nasdaq in 2024. Within the AI space, no company has a stronger competitive position than Nvidia (NASDAQ: NVDA). If you're aiming to position your portfolio for the next Nasdaq bull market, read on to see why building a position in this AI leader stands out as a smart move. Nvidia is the leading provider of high-performance graphics processing units (GPUs). While these hardware technologies were originally used for video games, they've become crucial for AI and cloud computing as well. The company currently controls roughly 90% of the market for high-performance GPUs, and it doesn't seem that its rivals, which include Advanced Micro Devices and Intel, will be able to match its technologies any time soon. As a result, Nvidia is expected to be one of the biggest winners in the still-nascent AI revolution. Nvidia has already reported stellar business momentum. Here are some key performance points from Q3 of fiscal 2024 (for the three months ending Oct. 29, 2023): Data center revenue surged 279% year over year to reach $14.51 billion. Overall revenue rose 206% year over year to hit $18.12 billion. Gross margin increased to 74%, up from 70.1% in Q2 2023 and 53.6% in Q3 of 2023. Non-GAAP (adjusted) earnings per share soared 593% year over year to hit $4.02. Notably, Nvidia guided for the stellar growth to continue in fiscal 2024's Q4. The company's midpoint sales target calls for revenue of roughly $20 billion -- good for annual growth of roughly 231%. Meanwhile, the company expects continued margin expansion -- with its adjusted gross margin expected to tick up to 75%. It's also worth noting that Nvidia's guidance has proven to be very conservative over the last year. Nvidia stock trades at roughly 45 times this year's expected earnings. On the face of it, that's a highly growth-dependent valuation. However, the company's current forward earnings multiple actually comes in far lower than might usually be expected given how fast the business is increasing its profits. For comparison, Microsoft posted earnings growth of 27% year over year in its last quarter and trades at a forward PE of 34. Meanwhile, Apple grew earnings by 13% year over year in its most recently reported quarter and has a forward PE of roughly 28. Given that Nvidia has been posting such incredible growth, the company's current PE could indicate the stock is quite cheap. Why is the GPU leader trading at such a comparatively low earnings multiple given its growth? The core reason is that Nvidia's business has historically been prone to cyclical performance shifts. But continued tailwinds from AI may be underestimated, and the company is making moves that could limit its exposure to future cyclical downturns. These initiatives revolve around building software and service components that generate dependable recurring revenue streams at consistently high margins. As the leading provider of GPUs for high-performance-computing applications, Nvidia is perfectly positioned to build its own data center business. The company just started to expand its AI-as-a-service (AIaaS) business, and there's a good chance that this initiative will reduce cyclicality and open up new, high-margin sales streams. Nvidia is still in the early stages of capitalizing on massive long-term trends connected to the AI revolution and trades at earnings multiples that look low in the context of its incredible momentum and opportunities. If the Fed shifts to a policy of significantly cutting interest rates this year and beyond, it's reasonable to expect that investors could become willing to assign significantly more growth-dependent valuation multiples to stocks. While there's no guarantee that rate cuts and AI will push the Nasdaq to new highs this year, Nvidia stock is a great way to play AI trends. Long-term investors who build positions in top companies at the forefront of world-shaping trends position themselves to reap the rewards whenever the next bull market hits. Nvidia certainly fits the bill. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 8, 2024  Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. History Tells Us the Nasdaq Is About to Surge: 1 Stock to Buy Before It Does was originally published by The Motley Fool Related Quotes "
}