{
    "title": "February 2024 The AI race makes first meaningful impact on the suppliers of \noptics",
    "date": "2/13/2024",
    "url": "https://www.lightcounting.com/research-note/february-2024-the-ai-race-makes-first-meaningful-impact-on-the-suppliers-of-optics-348",
    "text": "LightCounting releases a research note on the early financial results for Q4 2023\nDemand for 4x100G and 8x100G transceivers from Nvidia made its first significant impact on the revenues of two transceiver suppliers in Q4 2023. Coherent reported more than $100 million in revenues from sales of 800G transceivers – up 100% sequentially and the company expects further growth in 2024. Innolight reported more than $505 million in Q4 revenue – up 30% y-o-y and 20% sequentially. Most of this growth must be also related to more business from Nvidia, but the company has not disclosed any of the details yet. Fabrinet (Nvidia’s contract manufacturer) reported 20% growth in datacom revenues, driven primarily by “800G AI programs”, but the company noted that “the rate of sequential growth has begun to moderate”. Fabrinet’s guidance for Q1 2024 is almost flat.All these data points confirm the trend observed in the past: Nvidia manufactures most of the optics internally (at Fabrinet) for the first year of deployments but allocates the bulk of the volume to Coherent and Innolight after that. This is exactly what is happening now with 4x100G and 8x100G transceivers. Both Coherent and Innolight have extensive manufacturing capacities to support a sharp ramp in production during 2024.The Figure below shows the year-over-year growth in revenues and spending for the Top 5 Mega Datacenter operators that recently reported their Q4 2023 results.\nRevenue growth picked up in the third quarter and again in the fourth quarter, with Alphabet, Amazon, Meta, and Microsoft all reporting double-digit year-over-year growth and new record highs. Apple sales improved slightly compared to Q4 2022 (up 2%), although its Services business grew faster (11%).Q4 2023 spending growth (red bars in the figure above) was either “way up” or “way down”. Alphabet reported record high capex and both Alphabet and Microsoft reported spending increases of 45-55%. In stark contrast, Amazon, Apple, and Meta reported spending declines of 12%, 37%, and 15% respectively, but all of them spent more in the last two quarters sequentially.The market momentum is positive as we enter 2024 – a huge change from 12 months ago. AI is the hottest area now, but we expect a recovery in the broader market to start in Q2 2024.Full text of the research note is available to LightCounting subscribers at: https://www.lightcounting.com/login LightCounting releases a research note on the early financial results for Q4 2023 Demand for 4x100G and 8x100G transceivers from Nvidia made its first significant impact on the revenues of two transceiver suppliers in Q4 2023. Coherent reported more than $100 million in revenues from sales of 800G transceivers – up 100% sequentially and the company expects further growth in 2024. Innolight reported more than $505 million in Q4 revenue – up 30% y-o-y and 20% sequentially. Most of this growth must be also related to more business from Nvidia, but the company has not disclosed any of the details yet. Fabrinet (Nvidia’s contract manufacturer) reported 20% growth in datacom revenues, driven primarily by “800G AI programs”, but the company noted that “the rate of sequential growth has begun to moderate”. Fabrinet’s guidance for Q1 2024 is almost flat.All these data points confirm the trend observed in the past: Nvidia manufactures most of the optics internally (at Fabrinet) for the first year of deployments but allocates the bulk of the volume to Coherent and Innolight after that. This is exactly what is happening now with 4x100G and 8x100G transceivers. Both Coherent and Innolight have extensive manufacturing capacities to support a sharp ramp in production during 2024.The Figure below shows the year-over-year growth in revenues and spending for the Top 5 Mega Datacenter operators that recently reported their Q4 2023 results. Revenue growth picked up in the third quarter and again in the fourth quarter, with Alphabet, Amazon, Meta, and Microsoft all reporting double-digit year-over-year growth and new record highs. Apple sales improved slightly compared to Q4 2022 (up 2%), although its Services business grew faster (11%).Q4 2023 spending growth (red bars in the figure above) was either “way up” or “way down”. Alphabet reported record high capex and both Alphabet and Microsoft reported spending increases of 45-55%. In stark contrast, Amazon, Apple, and Meta reported spending declines of 12%, 37%, and 15% respectively, but all of them spent more in the last two quarters sequentially.The market momentum is positive as we enter 2024 – a huge change from 12 months ago. AI is the hottest area now, but we expect a recovery in the broader market to start in Q2 2024.Full text of the research note is available to LightCounting subscribers at: https://www.lightcounting.com/login Enabling effective decision-making based on a unique combination of quantitative and qualitative analysis.\n                                    \n                      Reach us at info@lightcounting.com Contact Us "
}