{
    "title": "Copper stocks can benefit from Nvidia and AI data centers - THE BHARAT \nEXPRESS NEWS",
    "date": "3/29/2024",
    "url": "https://thebharatexpressnews.com/copper-stocks-can-benefit-from-nvidia-and-ai-data-centers/",
    "text": " Nvidia‘s (NVDA) move to fiber-optic copper cables for short-distance data transmission in AI data centers signals a major increase in copper demand, Wall Street analysts say.  The trend could give copper stocks a boost. X At the GTC conference last week, Nvidia announced increased use of copper in its artificial intelligence computing systems.  Nvidia has taken the step to reduce power consumption in its data center equipment. “Exponential growth in AI computing capacity this decade… will require exceptional growth in global energy capacity,” JPMorgan analysts said in a client note on Thursday. In the base case, the International Energy Agency estimates that global energy demand in data centers will increase at a compound annual growth rate of 15% through 2026.  JPMorgan estimates that this growth rate would require approximately 2.6 million tons of cumulative new copper demand by 2030.  It would also translate into about 2% of expected global copper demand in 2030, the company said. This new demand for copper matches an already forecast supply shortfall of 4 million tons by 2030, JPMorgan said.  The growth of battery-electric vehicles and renewable energy plus the limited supply of new copper mines underlie the forecast shortage, the report said. Table of Contents JPMorgan named three companies as regional picks among copper stocks.  It called Teck Resources (TECK) are “top picks” in North America.  There was also selection Anglo-American (NGLOY) and Sandfire, which trades on the Australian Securities Exchange. Other major copper deposits include Freeport-McMoRan (FCX) and Southern copper (SCCO). Investor’s Business Daily added Freeport-McMoRan to its SwingTrader list on Thursday. Nvidia’s shift to optics buyer was a major topic of discussion at the Optical Fiber Communication 2024 conference in San Diego earlier this week, Evercore ISI analyst Amit Daryanani said in a client note on Wednesday. “Nvidia’s recent announcement that they plan to use a significant amount of copper to network GPUs at distances of less than 1 meter has been the subject of much debate, but the power and cost benefits make it clear that as much copper as possible will be used,” he says.  Daryanani said. Nvidia noted that using copper instead of optics saves 20 kilowatts of power per server rack. “A key factor in using more copper is liquid cooling, which allows more GPUs (graphics processing units) to be packed into a single rack,” he says. Of the major copper stocks listed here, Southern Copper has been the best performer lately.  It has an IBD relative strength rating of 89 out of 99. On March 13, Southern Copper stock broke out of a flat base with a buy point of 88.40, according to IBD MarketSurge charts.  In today’s stock market, shares of Southern Copper rose 2.1% to 106.52. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer tech, software and semiconductor stocks. YOU MAY ALSO LIKE: This Chip Stock Is a ‘Hidden Gem,’ Analyst Says Adobe investors will need patience for AI windfall, analyst says Netflix stock removed from ‘Best Ideas List’ after steep climb MarketSurge: research, charts, data and coaching all in one place View stocks on the leader list near a buy point  Save my name, email, and website in this browser for the next time I comment.   Δ "
}