{
    "title": "Samsung Still Lacking in AI Investors' Eyes After Nvidia Boost",
    "date": "3/21/2024",
    "url": "https://finance.yahoo.com/news/samsung-still-lacking-ai-investors-000104151.html",
    "text": "(Bloomberg) -- A surprise endorsement from Nvidia Corp. may have excited some investors over the prospects for Samsung Electronics Co. to catch up in the artificial intelligence race, but others remain unconvinced. Most Read from Bloomberg Trump’s Net Worth Hits $6.5 Billion, Making Him One of World’s 500 Richest People Biden Gains Ground Against Trump in Six Key States, Poll Shows Trump Vows to Pay Fraud Trial Bond Cut by 68% to $175 Million Vital Baltimore Bridge Collapses After Being Struck by Ship After Exposing Realtors, Eliminate the Mortgage Interest Deduction Key Samsung rival SK Hynix Inc. is already supplying Nvidia with the latest version of high-bandwidth memory, HBM3E. While Jensen Huang seems to have indicated that Nvidia will buy some HBM chips from Samsung as well, SK Hynix has gotten a big jumpstart by supplying previous generations of the technology. “It’s true that Samsung Electronics has become more attractive than in the past,” said Yoon Joonwon, a fund manager at DS Asset Management Co. “But it’s too early to buy it on expectations for its HBM business.” Read More: Samsung Jumps Most in Six Months After Nvidia CEO’s Backing The AI theme has been more of a boon for SK Hynix so far, with its shares roughly doubling over the past year, outpacing Samsung’s 30% gain. The difference lies in SK Hynix’s lead in HBM chips, which work alongside processors crucial for the training of large language models. Samsung is more exposed to the cyclical demand and pricing of commoditized traditional memory, given its market share in consumer devices. That’s why it was a surprise when Huang reportedly said he plans to buy Samsung memory too. His comments helped boost shares of South Korea’s most valuable company to a 9% weekly gain, their biggest in more than three years. Options traders have been more ambivalent. Bets on both directions soared this week for Samsung, including puts wagering on a 70% drop in the next three months and calls that will cash in if the stock surges 300% in the same time span. Day traders took a contrarian stance on the Huang boost. While institutional investors poured cash into Samsung shares Wednesday and Thursday, retail traders sold 3 trillion won ($2.3 billion) worth of the stock on a net basis, a record two-day withdrawal. “Majority opinion is still that Samsung won’t be getting the call on HBM3E from Nvidia,” said Cha So-yoon, a fund manager and equity team head at BNK Asset Management Co. “If there is a turnaround in tech sentiment, it will be great for both companies but SK Hynix doesn’t appear to be losing its HBM hegemony.” --With assistance from Jeanny Yu. (Updates as of Friday’s closing prices) Most Read from Bloomberg Businessweek AI Is Putting the Silicon Back in Silicon Valley Hong Kong’s Elderly Are Increasingly Retiring in Mainland China In This Coworking Space, Only the Cappuccino Isn’t Classified Tesla’s Hunt for Self-Driving Revenue Jokes, Pop Music and Radical Honesty: How TikTok Is Changing Home Sales ©2024 Bloomberg L.P. Related Quotes "
}