{
    "title": "Congressman Buys Nvidia Stock Day Before Earnings, Here's How Much He's \nMade - NVIDIA (NASDAQ:NVDA)",
    "date": "3/13/2024",
    "url": "https://www.benzinga.com/general/politics/24/03/37679313/congressman-buys-nvidia-stock-day-before-earnings-heres-how-much-hes-made",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW A Congress member bought shares of Nvidia Corporation NVDA just one day before the company reported fourth-quarter financial results. Here's a look at the trade and how much the position has risen in value. What Happened: Congresswoman Nancy Pelosi (D-Calif.) has generated numerous headlines for her disclosures of trading of Nvidia stock and options thanks to her venture capitalist husband Paul Pelosi. Other Congress members bought shares of AI leader Nvidia as well. A new trade disclosed by a member of Congress won't raise as many red flags as million-dollar questionable trades made by the Pelosi’s. U.S. Representative Michael Guest (R-Miss.) disclosed buying $1,000 to $15,000 worth of shares of Nvidia. The disclosure, shared by Congresstrading on Twitter, shows the trade took place on Feb. 20. This means the trade happened the day before the fourth quarter earnings from Nvidia. The technology giant reported earnings per share and revenue that beat estimates from analysts. Revenue of $22.1 billion was up 265% year-over-year. Nvidia shares are up over 275% in the last year, and the strong fourth-quarter financial results have helped Nvidia shoot past a market capitalization of $2 trillion as one of the most valuable companies worldwide. Here's a look at how Guest's trade is working out. Related Link: 10 Best Stock Traders In Congress In 2023 (Spoiler: Nancy Pelosi Has Reentered The Chat) Nvidia Trade by Congressman Guest: Shares of Nvidia traded between $662.48 and $688.88 on Feb. 20, 2024. Based on the trading range and the $1,000 to $15,000 purchase amount in the disclosure, we can estimate how many shares of Nvidia were bought. If the trade was $1,000, Guest could have bought between 1.45 and 1.51 shares of Nvidia at the time. The $1,000 would be worth a range of $1,318.43 to $1,372.98 today. This marks a gain of 31.8% to 37.3% in less than one month. If the trade was $15,000, Guest could have bought between 21.77 and 22.64 shares of Nvidia at the time. The $15,000 would be worth a range of $19,794.59 and $20,585.64. This marks a gain of 32.0% to 37.2% in less than one month. While the trade was likely somewhere in the middle of the range, Guest is up anywhere from 31.8% to 37.3% in less than one month. Guest was previously named as one of the 10 best trading members of Congress in 2022 based on an annual report from UnusualWhales. NVDA Price Action: Nvidia shares trade at $909.26 versus a 52-week trading range of $233.60 to $974. Read Next: Pelosi Loves Palo Alto Networks Stock, So Do These Other Top Performing Traders In Congress © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}