{
    "title": "Nvidia Stock Has 40% Upside, According to 1 Wall Street Analyst. Is the \nStock a Buy Near Its All-Time High?",
    "date": "3/11/2024",
    "url": "https://finance.yahoo.com/news/nvidia-stock-40-upside-according-222700682.html?ref=upstract.com",
    "text": "There's no denying that Nvidia (NASDAQ: NVDA) has become the poster child for artificial intelligence (AI). Its chips have become the industry standard for creating and running AI models, which has kicked its stock into overdrive, soaring roughly 500% since the start of 2023. One Wall Street analyst believes this is just the beginning. Cantor Fitzgerald analyst C.J. Muse boosted his price target to $1,200 while maintaining a buy rating on Nvidia stock. This represents gains of almost 40% compared to the stock's closing price on Monday. The analyst believes investors are underestimating the company's software business, which has already achieved a $1 billion run rate annually and is \"only in the first inning.\" The analyst further suggests generative AI will largely run in data centers, which could be a \"$500 billion business for Nvidia,\" pushing earnings per share (EPS) to $35 next year. The analyst could be on to something. Just last month, CEO Jensen Huang laid out the opportunity: There's about a trillion dollars' worth of installed base of data centers. Over the course of the next four or five years, we'll have $2 trillion worth of data centers that will be powering [AI] software around the world. This is contingent on the continued adoption of generative AI, but most market commentators believe it's still early days. Data centers will need to increase their capabilities in order to keep up with the greater computational demands required by AI. Nvidia dominates the data center market with an estimated 95% share. Furthermore, Nvidia is the gold standard for machine learning -- an established branch of AI -- with a 95% share of that market. All the pieces are in place for Nvidia to maintain its dominance. Furthermore, if Nvidia earns $35 per share next year, a stock price of $1,200 works out to a price-to-earnings (PE) ratio of 34, so the stock would be a steal at its current price. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 11, 2024 Danny Vena has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Nvidia Stock Has 40% Upside, According to 1 Wall Street Analyst. Is the Stock a Buy Near Its All-Time High? was originally published by The Motley Fool Related Quotes "
}