{
    "title": "Stocks end week at fresh records as Nvidia tops $2 tn",
    "date": "3/2/2024",
    "url": "https://www.mcduffieprogress.com/news/national/stocks-rally-rolls-on-into-march/article_24331002-c749-5989-a965-bb9f3d70c546.html?=/&subcategory=237%7CFolk+Music",
    "text": "   Please purchase a subscription to read our premium content. If you have a subscription, please log in or sign up for an account on our website to continue. Your current subscription does not provide access to this content. Postal Delivery of the McDuffie Progress plus Full access to all components of our website including Online e-Editions. If you are a paid subscriber to the printed edition of the McDuffie Progress, use this verification process to setup your free digital access. The account number can be found on the label of your mailed copy of the paper. Note: The account number and last name field must exactly match what is printed on the label. Web only (anywhere) $60 annual Web only (anywhere) $5 one month      Abundant sunshine. Warm. High 79F. Winds WSW at 10 to 15 mph.. Clear to partly cloudy. Low around 50F. Winds SW at 5 to 10 mph. Updated: March 30, 2024 @ 12:25 pm          Wall Street stocks finished the week with a flourish Friday behind continued momentum for equities tied to artificial intelligence, especially Nvidia, which finished wih a valuation above $2 trillion for the first time. Both the S&P 500 and Nasdaq ended at fresh all-time highs following records in Tokyo and Frankfurt. \"This week saw risk on sentiment take several global stock indices to record highs, the first day of March being no exception,\" said Axel Rudolph, senior market analyst at online trading platform IG. David Morrison, senior market analyst at Trade Nation, said \"market sentiment remains bullish, and there seems little appetite for profit-taking.\" Stock markets have been on a march higher since late last year, initially on hopes that central banks will soon be able to begin lowering their high interest rates as inflation began to fall closer to normal levels. While hotter-than-expected inflation data from recent months has pushed expectations for the first interest rate cut to mid-year, markets have instead been propelled by stellar results from AI firms in recent weeks. Perhaps no company has benefited as much as Nvidia, which is led by Jensen Huang, who has developed technology perfectly suited for developing the large language models (LLMs) that underpin generative AI interfaces such as ChatGPT. Nvidia jumped four percent Friday to end the day with a valuation above $2 trillion, joining an elite club that includes just Apple, Microsoft and Saudi Aramco. Also Friday, Dell Technologies became the latest big beneficiary of the AI fever, surging more than 31 percent following an earnings report that highlighted its growing AI business. The tech-rich Nasdaq led the major US indices, rising 1.1 percent. CFRA Research's Sam Stovall said the gains in New York were also supported by weaker economic data, including the Institute for Supply Management survey of manufacturers and consumer confidence data as \"indicating that there could be more reason\" for the Fed to cut interest rates in May. In Europe, Frankfurt's DAX set a new record while the CAC in Paris was also near its record high, with a less-than-expected drop in eurozone inflation failing to derail sentiment. Meanwhile in Asia, Tokyo's benchmark Nikkei index almost touched 40,000 points for the first time. Asian markets mostly rose, with better-than-expected Chinese data helping sentiment. \"China's factory growth rising above forecasts even though manufacturing shrank for a fifth straight month did not dent investors' mood with the country's stock indices pursuing their recovery,\" said IG's Rudolph. New York - Dow: UP 0.2 percent at 39,087.38 (close) New York - S&P 500: UP 0.8 percent at 5,137.08 (close) New York - Nasdaq Composite: UP 1.1 percent at 16,274.94 (close) London - FTSE 100: UP 0.7 percent at 7,682.50 (close) Frankfurt - DAX: UP 0.3 percent at 17,735.07 (close) Paris - CAC 40: UP less than 0.1 percent at 7,934.17 (close) EURO STOXX 50: UP 0.4 percent at 4,894.86 (close) Tokyo - Nikkei 225: UP 1.9 percent at 39,910.82 (close) Hong Kong - Hang Seng Index: UP 0.5 percent at 16,589.44 (close) Shanghai - Composite: UP 0.4 percent at 3,027.02 (close) Euro/dollar: UP at $1.0841 from $1.0805 on Thursday Dollar/yen: UP at 150.11 yen from 149.98 yen Pound/dollar: UP at $1.2656 from $1.2625 Euro/pound: UP at 85.65 pence from 85.58 pence Brent North Sea Crude: UP 2.0 percent at $83.55 per barrel West Texas Intermediate: UP 1.9 percent at $79.77 per barrel burs-jmb/sst Originally published on doc.afp.com, part of the BLOX Digital Content Exchange. Sorry, there are no recent results for popular commented articles. Success! An email has been sent to  with a link to confirm list signup. Error! There was an error processing your request. Would you like to receive our daily news? Signup today! We're always interested in hearing about news in our community. Let us know what's going on! Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}