{
    "title": "\"NVIDIA Shares Surge, There Are Valuation Concerns, But No Need To \nShrink\"\"Artificial intelligence (.. - MK",
    "date": "3/27/2024",
    "url": "https://www.mk.co.kr/en/stock/10976689",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share \"NVIDIA Shares Surge, There Are Valuation Concerns, But No Need To Shrink\" \"Artificial intelligence (AI) will be used in all industries, and semiconductors are a key element of AI development, so they must be included in the portfolio regardless of price,\" said Bae Jae-kyu, president of Korea Investment Trust Management, at a meeting held under the theme of \"Icon Semiconductors of the times, how to see and invest.\" \"If we focus on certain industries and stocks in semiconductors, yields can fluctuate greatly depending on the business conditions,\" CEO Bae said. \"It is better to invest in ETFs (exchange index funds) that contain memory, non-memory, foundry, and small manager in their portfolios.\" President Bae is considered the \"father of ETF\" in the Yeouido stock market. He was the first person to create ETF products in Korea in 2002 while working at Samsung Asset Management. \"Investment is not about the present time, but about the future in five or 10 years,\" he said. There is no need to be afraid that prices have risen too much, he stressed. President Bae also said, \"In the past, PCs first led the demand for semiconductors, and secondly, smartphones and data centers created demand. This time, AI is increasing demand, but it's still starting, so if you look at the five and 10 years, there's no better prospect than this,\" he suggested. The keynote speech at the meeting was given by Chris Miller, a professor at Tufts University in the U.S., author of \"Chip War,\" a best-selling semiconductor-related book. Professor Miller said, \"As AI systems are advancing, demand for high-performance chips is increasing,\" and analyzed, \"R&D is becoming more and more difficult as technological development at the level of testing our knowledge limits in physics, chemistry, and material science is needed to make advanced semiconductors.\" In particular, semiconductor themes are expected to deepen the structure of monopolization by companies in a small number of countries. The reason is that it requires a large amount of capital and skilled high-quality manpower. Professor Miller said, \"The semiconductor industry is led by a small number of companies that have built moats through years of research and development and huge capital investment. Moreover, as semiconductor manufacturing becomes more complex, the barriers to entry are higher,\" he explained. Professor Miller continued, \"There are only five companies around the world that can make semiconductor equipment (1 in the Netherlands, 3 in the United States, and 1 in Japan), and the cost of designing advanced semiconductors is increasing day by day. It costs more than $100 million per unit to design before the manufacturing stage, he said. \"The higher the entry barrier, the more solidified the concentration structure to the top companies.\" \"In order to understand the semiconductor market, it is essential to analyze monopoly companies,\" he stressed. \"The AI semiconductor market will grow rapidly to $137 billion by 2027,\" said Kim Sun-woo, a researcher at Meritz Securities, who was a speaker. \"Domestic semiconductor exports are expected to recover from the second and fourth quarters of last year, turning to growth in the fourth quarter, and improving year-on-year growth in the second half of this year.\" Kim Seung-hyun, in charge of ETF consulting at Hantu Management, introduced his company's product, \"ACE Global Semiconductor TOP4 Plus SOLACTIVE.\" \"It is important to select products that reflect the rapidly changing market for semiconductor investment,\" he said. \"ACE Global Semiconductor TOP4 Plus SOLACTIVE ETF is a product that reflects the benefits of the semiconductor industry from AI, and has been ranked first in the domestic semiconductor ETF yield (126.75%, excluding leverage) since November 2022.\" As of the closing price on the 27th of this month, ACE Global Semiconductor TOP4 Plus SOLACTIVE's one-year yield is 85.82%, and its six-month yield is 64.68%. \"The ETF can even expect intensive investment in the No. 1 stock by global semiconductor area and diversified investment in the U.S.-centered four-nation semiconductor alliance,\" Kim said. \"We have high expectations for future performance as it has shown steady growth since the listing.\" 2024-03-29 17:44:51 2024-03-28 14:43:55 2024-03-28 08:35:39 2024-03-29 10:06:50 2024-03-29 16:18:40 2024-03-28 22:06:01 2024-03-30 06:02:41 2024-03-28 18:05:38 2024-03-29 20:51:03 2024-03-29 09:51:58 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}