{
    "title": "Nvidia is the new company facing a lawsuit for its AI",
    "date": "3/15/2024",
    "url": "https://en.softonic.com/articles/nvidia-is-the-new-company-facing-a-lawsuit-for-its-ai",
    "text": "Advertisement Trending News Three authors sue the company for training their AI with copyrighted works. Pedro Domínguez The technology giant Nvidia is facing a lawsuit from a group of American authors who claim that their copyrighted works were used without permission for training NeMo, the company’s artificial intelligence platform. According to Reuters, writers Brian Keene, Abdi Nazemian, and Stewart O’Nan claim that their books were part of a dataset of about 196,640 works that helped train NeMo to simulate normal written language, before being removed in October “due to alleged copyright infringement”. The lawsuit, filed last Friday in a federal court in San Francisco, argues that the fact that the books were withdrawn is an admission by Nvidia that it trained NeMo with the dataset and, therefore, infringed its copyright. According to Reuters, the authors are requesting an unspecified amount of compensation for damages to individuals in the United States whose copyrighted works have helped train NeMo’s large language models over the past three years. This new class action lawsuit is the latest in a series of similar litigations targeting AI companies. In December, a group of 11 authors joined a lawsuit against OpenAI, the company behind ChatGPT, and its partner Microsoft, accusing the companies of copyright infringement. That same month, The New York Times filed its own copyright infringement lawsuit against OpenAI and Microsoft, alleging that the tech companies used its content without permission to develop their AI products. In addition, the artist community has been denouncing AI tools like Midjourney for over a year, which are capable of generating images precisely because they have been trained with millions of artworks without the permission of their authors. Link Copied! Pedro Domínguez Publicist and audiovisual producer in love with social networks. I spend more time thinking about which videogames I will play than playing them. Advertisement Advertisement Advertisement Next story New York has just approved robotaxis Loading next article  Copyright SOFTONIC INTERNATIONAL S.A. © 1997-2024 - All rights reserved "
}