{
    "title": "NVIDIA (NASDAQ:NVDA) Shares Up 1.4% Following Analyst Upgrade",
    "date": "3/22/2024",
    "url": "https://www.defenseworld.net/2024/03/23/nvidia-nasdaqnvda-shares-up-1-4-following-analyst-upgrade.html",
    "text": "Posted by Defense World Staff on Mar 23rd, 2024 Shares of NVIDIA Co. (NASDAQ:NVDA – Get Free Report) rose 1.4% during mid-day trading on Friday after UBS Group raised their price target on the stock from $800.00 to $1,100.00. UBS Group currently has a buy rating on the stock. NVIDIA traded as high as $931.30 and last traded at $927.38. Approximately 16,909,819 shares were traded  during trading, a decline of 68% from the average daily volume of 53,337,313 shares. The stock had previously closed at $914.35. Other analysts also recently issued reports about the company. CICC Research started coverage on NVIDIA in a report on Wednesday, March 6th. They set an “outperform” rating and a $870.00 price target for the company. Benchmark  reissued a “buy” rating and issued a $1,000.00 target price on shares of NVIDIA in a report on Wednesday. Needham & Company LLC boosted their target price on NVIDIA from $600.00 to $850.00 and gave the company a “buy” rating in a report on Thursday, February 22nd. Jefferies Financial Group boosted their target price on NVIDIA from $610.00 to $780.00 and gave the company a “buy” rating in a report on Thursday, February 22nd. Finally, Oppenheimer boosted their target price on NVIDIA from $850.00 to $1,100.00 and gave the company an “outperform” rating in a report on Wednesday. Four investment analysts have rated the stock with a hold rating, thirty-seven have issued  a buy rating and one  has issued  a strong buy rating to the stock. Based on data from MarketBeat, NVIDIA presently has a consensus rating of “Moderate Buy” and an average target price of $908.68. Get Our Latest Stock Report on NVDA In other news, Director Mark A. Stevens sold 12,000 shares of the business’s stock in a transaction on Monday, March 4th. The shares were sold at an average price of $853.54, for a total transaction of $10,242,480.00. Following the transaction, the director now directly owns 1,107,583 shares of the company’s stock, valued at $945,366,393.82. The transaction was disclosed in a filing with the SEC, which is available at the SEC website. In related news, Director Mark A. Stevens sold 12,000 shares of the company’s stock in a transaction on Monday, March 4th. The shares were sold at an average price of $853.54, for a total value of $10,242,480.00. Following the sale, the director now directly owns 1,107,583 shares of the company’s stock, valued at $945,366,393.82. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available at this hyperlink. Also, Director Mark A. Stevens sold 5,000 shares of the business’s stock in a transaction on Monday, February 26th. The shares were sold at an average price of $800.74, for a total transaction of $4,003,700.00. Following the sale, the director now owns 1,119,583 shares of the company’s stock, valued at approximately $896,494,891.42. The disclosure for this sale can be found here. Over the last three months, insiders have sold 104,774 shares of company stock valued at $64,322,528. Corporate insiders own  3.99% of the company’s stock. Several institutional investors have recently modified their holdings of the company. Studio Investment Management LLC bought a new position in  NVIDIA in the 4th quarter valued at about $27,000.  LFA Lugano Financial Advisors SA purchased a new stake in  NVIDIA during the fourth quarter valued at about $28,000.  Criterion Capital Advisors LLC purchased a new stake in  NVIDIA during the fourth quarter valued at about $28,000.  Able Wealth Management LLC purchased a new stake in  NVIDIA during the fourth quarter valued at about $32,000.  Finally, Peoples Financial Services CORP. purchased a new stake in  NVIDIA during the third quarter valued at about $30,000. Institutional investors own  64.79% of the company’s stock. The company has a quick ratio of 3.67, a current ratio of 4.17 and a debt-to-equity ratio of 0.20. The company has a market capitalization of $2.36 trillion, a PE ratio of 78.41, a price-to-earnings-growth ratio of 1.36 and a beta of 1.73. The business’s 50 day simple moving average is $735.75 and its 200 day simple moving average is $558.28. NVIDIA (NASDAQ:NVDA – Get Free Report) last released its quarterly earnings data on Wednesday, February 21st. The computer hardware maker reported $5.16 EPS for the quarter, topping analysts’ consensus estimates of $4.21 by $0.95. NVIDIA had a return on equity of 93.61% and a net margin of 48.85%. The firm had revenue of $22.10 billion for the quarter, compared to the consensus estimate of $20.40 billion. During the same quarter in the prior year, the company posted $0.65 earnings per share. The firm’s revenue was up 265.3% on a year-over-year basis.  As a group, analysts forecast that  NVIDIA Co. will post 22.27 EPS for the current year. The firm also recently disclosed a quarterly dividend, which will be paid on Wednesday, March 27th. Stockholders of record on Wednesday, March 6th will be given a $0.04 dividend. The ex-dividend date of this dividend is Tuesday, March 5th. This represents a $0.16 annualized dividend and a dividend yield of 0.02%. NVIDIA’s dividend payout ratio  is 1.34%. (Get Free Report) NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications.  Receive News & Ratings for NVIDIA Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for NVIDIA and related companies with MarketBeat.com's FREE daily email newsletter. Analyzing Alvotech (ALVO) and The Competition Alphabet (NASDAQ:GOOGL) Trading 2.4% Higher  Following Analyst Upgrade "
}