{
    "title": "Nvidia unveils robots powered by super computer and AI to take on world's \nheavy industries",
    "date": "3/16/2024",
    "url": "https://www.aol.com/finance/nvidia-unveils-robots-powered-super-002159619.html",
    "text": "Advertisement For premium support please call: Nvidia unveiled Monday that it is planning to release a software and hardware platform that can be used to build human-like robots which will continue to learn through generative artificial intelligence (AI). The platform is made up of a computer system to power the robot and AI, along with a suite of software that includes various tools like genAI, to build human-like robots. Nvidia made the announcement during its annual developer conference, where it touted the abilities genAI will provide for the robots. Jim Fan a research manager and lead of embodied AI at Nvidia posted to X that through GR00T, robots will be able to understand instructions through language, video and demonstrations to perform a variety of tasks. US-FUNDED REPORT ISSUES URGENT AI WARNING OF ‘UNCONTROLLABLE’SYSTEMS TURNING ON HUMANS \"We are collaborating with many leading humanoid companies around the world, so that GR00T may transfer across embodiments and help the ecosystem thrive,\" Fan said. READ ON THE FOX BUSINESS APP He also said Project GR00T is a \"cornerstone\" of the \"Foundation Agent\" roadmap for the GEAR Lab. Fan said at GEAR, the team is building robots that learn to act skillfully in many worlds, both virtual and real. He also provided a video in the post showing team members working with robots. \"These smarter, faster, better robots will be deployed in the world's heavy industries,\" Rev Lebaredian, Vice President, Omniverse and Simulation Technology, told reporters. \"We are working with the world's entire robot and simulation ecosystem to accelerate development and adoption.\" Nvidia’s \"Jetson Thor\" is the computer behind the genAI software, while the package of software is called the \"Isaac\" platform. \"Jetson Thor\" will provide enough horsepower for the robot to be able to compute and perform complex tasks, the company noted, while also allowing the robot to interact with other machines and people. WHAT IS ARTIFICIAL INTELLIGENCE (AI)? \"Isaac\" and the new GR00T features will enable \"any robot embodiment in any environment,\" Nvidia added. Over time, the tools will train the software to improve its decision-making through reinforcement learning. Along with the software and hardware platform, Nvidia announced it would be releasing pre-trained robotics models and additional software to improve camera sensing abilities and robotic arm functions. Earlier this month, Nvidia CEO Jensen Huang announced that artificial general intelligence (AGI) could arrive in as little as five years. NVIDIA CEO JENSEN HUANG SAYS AI COULD PASS MOST HUMAN TESTS IN 5 YEARS The company’s artificial intelligence chips are being used to create systems like OpenAI’s ChatGPT, and Huang said AGI’s arrival depends largely on how the goal of AGI is defined. \"If I gave an AI… every single test that you can possibly imagine, you make that list of tests and put it in front of the computer science industry, and I'm guessing in five years’ time, we'll do well on every single one,\" Huang said. AI can currently pass tests like legal bar exams but has struggled on specialized medical tests like gastroenterology. NVIDIA CEO IS $9.6B RICHER AS AI CHIPMAKER'S STOCK SOARS But how fast AI can develop and learn has many people concerned about robots taking over the world. The U.S. government commissioned a report that came out earlier this month, saying there is a \"clear and urgent need\" to act, as swiftly developing artificial intelligence could potentially lead to human extinction through weaponization and loss of control. \"Given the growing risk to national security posed by rapidly expanding AI capabilities from weaponization and loss of control — and particularly, the fact that the ongoing proliferation of these capabilities serves to amplify both risks — there is a clear and urgent need for the U.S. government to intervene,\" read the report, issued by Gladstone AI Inc. The report also recommended the government tighten controls on the manufacture and export of AI chips. Fox News Digital’s Stephen Sorace and Eric Revell, and Reuters contributed to this report.  Original article source: Nvidia unveils robots powered by super computer and AI to take on world’s heavy industries Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}