{
    "title": "Nvidia Geforce Cloud Gaming Service Returns To Power After Massive Global \nOutage",
    "date": "3/10/2024",
    "url": "https://www.tradingview.com/news/benzinga:65f52c351094b:0-nvidia-geforce-cloud-gaming-service-returns-to-power-after-massive-global-outage/",
    "text": "Following a global outage, Nvidia Corp.’s NVDA GeForce Now cloud gaming service is back online. What Happened: The GeForce Now service, which allows users to open the app, view their library, and try to launch a game, experienced a global outage on Sunday. It reportedly prevented users from accessing their game libraries and launching games. The issue persisted for over two hours before Nvidia identified and resolved the problem. Benzinga See Also: Donald Trump Is Against TikTok Ban Because It Would Help ‘Facebook And Zuckerschmuck’ Double Their Business Despite the outage, games themselves were unaffected and could still be played on local machines. Nvidia’s status page initially confirmed the global outage but later updated to reflect that the issue had been identified and resolved. lets go guys pic.twitter.com/Ns35O3wAsx At the time of writing, the status page showed Nvidia Global Services as “Operational,” and users on Downdetector also reported no ongoing problems with Nvidia. Benzinga The issue was first reported by 9to5Google. Why It Matters: This outage comes on the heels of a lawsuit filed against Nvidia for allegedly using copyrighted works without permission to train its AI platform. The lawsuit, filed by three authors, claims that their works were part of a dataset of approximately 196,640 books used to train Nvidia's NeMo AI platform to simulate ordinary written language. The dataset was reportedly taken down in October due to reported copyright infringement. In February, Nvidia reported fourth-quarter results and forward guidance that exceeded optimistic forecasts. The company reported fourth-quarter non-GAAP earnings per share of $5.16, which came in ahead of a Street consensus estimate of $4.64. Moreover, the company’s fourth-quarter revenue of $22.10 billion beat a Street estimate of $20.62 billion. Photo via Shutterstock Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Cathie Wood’s Chip Stock Warning, Brin Admits Google’s Gemini Mess And Musk’s ChatGPT Banter: This Week In AI Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}