{
    "title": "Nvidia stock surges after blowout sales, pushing US futures sharply higher",
    "date": "3/7/2024",
    "url": "https://ca.style.yahoo.com/nvidia-stock-surges-blowout-sales-103236764.html",
    "text": "We've rounded up the best long weekend Amazon deals at every price point. US futures jumped ahead of the bell as investors cheered Nvidia's better-than-expected revenues. European markets and Japan's Nikkei 225 are also riding high on tech optimism. Brent crude oil continued to trade higher amid supply concerns. Nvidia stock surged almost 15% in premarket trading after posting blockbuster quarterly sales on Wednesday that beat even Wall Street's most optimistic expectations. The AI chipmaker had revenues of $22.1 billion in the fourth quarter, a 265% year-on-year increase, and said revenues for the current quarter would be about $24 billion. Nvidia closed at $674 but is set to open at about $770 when trading begins on the New York Stock Exchange at 9:30 a.m ET. The stock's surge pushed futures sharply higher ahead of the bell and bolstered global markets as well. S&P 500 futures jumped by 1.12%, while Nasdaq 100 futures rode the Nvidia wave to jump by 1.96% shortly before 5 a.m. ET. Dow Jones Industrial Average futures posted a slightly more subdued rise of 0.25%. Ten-year treasury notes dipped marginally ahead of the bell after hitting their highest level since November on Wednesday. Elsewhere, Brent crude oil was trading above $83 amid supply concerns resulting from several outages at key refineries and worries over escalating conflict in the Middle East. After dipping anxiously ahead of Nvidia's much-anticipated earnings on Wednesday, markets soared globally after Nvidia's beat. Insider Intelligence senior analyst Jacob Bourne noted the company's \"blockbuster quarter\" and said it had a \"massive lead in the growing global AI chip sector,\" but warned it could not rest on its laurels. Tech optimism bolstered global markets, with the Stoxx Europe 600 climbing 0.9% to hit a record high and Japan's Nikkei 225 index reaching a 34-year peak, surging more than 2%. Though it did little to dampen investors' tech optimism, the minutes from the Federal Reserve's January meeting lowered market expectations on the pace and scale of interest rate cuts. Earnings for Booking Holdings and software company Intuit are set to be announced Thursday. The release of US jobless earnings, January home sales, and flash manufacturing PMIs will also provide traders with fresh insight into the economy. Read the original article on Business Insider Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era.  \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… SHAPE 款接、旅遊及文娛: 1年完成海外課程| 2地講師拓展視野| 3重認證國際認可 Seven reportedly cost $20 million The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con  \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... They soft-launched their relationship at the supermodel's cookbook event in Miami. The \"Late Night\" comedian brutally summed up the former president's media company. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. "
}