{
    "title": "Top 10: ESG Stocks to Consider in 2024",
    "date": "1/23/2024",
    "url": "https://sustainabilitymag.com/esg/top-10-esg-stocks-to-consider-in-2024",
    "text": "A company’s ESG credentials can make or break its fortunes, now more than ever. ESG investing has seen a meteoric rise over the past decade. Consumers and investors are increasingly looking for companies that care about people and the planet as much as they do about their products and profits. Investors are demanding more from companies and positioning their investments accordingly, putting their money into companies that prioritise positive change, ethical standards and transparent reporting And this is where critical analysis from impartial experts can prove essential. One such source is MSCI, which for more than 50 years has leveraged research, data and technology to help people understand the potential risks and returns on investments. MSCI evaluates companies and gives them a ranking from AAA (the best) to CCC (not so good), with the ESG Leaders in each industry achieving an AAA or AA ranking. All of the companies listed here have reached those heights, but some are ESG Laggards in certain areas. Find out by reading more. The microchip megastar is one of the biggest beneficiaries of the artificial intelligence boom. That’s not by accident. The company’s founder and CEO Jensen Huang doubled down on the technology required to deliver AI a decade ago, when others around him failed to see the future. Now, ChatGPT and Bard are really only possible thanks to the high processing power of Nvidia’s specialist chips and other hardware. The company has built what looks like an unassailable lead in the AI race, accounting for more than 70% of AI chip sales and widely recognised as the best, not just the biggest. But what does that mean for its ESG credentials? Well, the good news is Nvidia has the enviable rating of AAA, a position it is held since October 2020. Nobody’s perfect, of course, and MSCI finds that Nvidia – when the chips are down – could do better when it comes to corporate governance. Microsoft is another tech giant with a top ranking from MSCI, and another company getting high on AI. Savvy investment in ChatGPT’s creator OpenAI has put Microsoft in pole position, while also leveraging its positions in hardware and software, not to mention one of the top cloud providers globally. Microsoft is working toward 100% renewable energy by 2025, carbon negative by 2030, and has famously set out to offset all historical carbon emissions since it was formed in 1975 by 2050. “While the world will need to reach net zero, those of us who can afford to move faster and go further should do so,” stated Vice Chair and President Brad Smith. There are some blemishes on that record, according to MSCI, who says Microsoft could do more on corporate governance and corporate behaviour. Anyone outside of North America may not be familiar with the tech retail giant which has more than 1,000 stores in the US and Canada. “At Best Buy, we aim to meaningfully reduce our impact on the environment and help our customers do the same,” explains CEO Corie Barry. “We make decisions with the future in mind, to strengthen our business, improve people’s lives and promote the health of our communities for years to come.” Best Buy embraces gender diversity and 45% of board directors are female – including CEO Barry. Best Buy is also praised for its DE&I five-year plan, and its network of Teen Tech Centers that provides training for young people from disinvested communities. The aim is to have 100 of those centres by 2025. The company has pledged to be carbon neutral by 2040 and has already reduced carbon emissions by two thirds since 2009. Barron’s has named Best Buy in the 100 Most Sustainable US Companies for six years running, this year taking 7th position – making it the top-ranked retailer in the list. An industry standard software for the creative industries – from design to video editing – Adobe is most well known for inventing the PDF and for photo editing software Photoshop. The boom in digital content creation in recent years has seen Adobe really fly. “Over the past four decades, Adobe has embraced invention and reinvention to better serve our customers and communities and deliver the best of Adobe to our stakeholders,” said Shantanu Narayen, Adobe Chair & CEO. “This sense of purpose has guided our evolution and continues to inspire our employees to invent the future and change the world for the better.” That better future is already being achieved, with Adobe reaching global gender pay parity, and investing more than US$85 million in minority communities. The company has set a goal of sourcing 100% renewable energy by 2035. MSCI has clearly been impressed with progress, and updated Adobe’s ESG rating from AA to AAA in December 2021. Intuit rose to the AAA ranking in February 2023 and has been praised by MSCI for its corporate governance, human capital development, and carbon emissions. You’ve probably heard of Intuit thanks to its accounting software Quickbooks, and it’s the company behind Mailchimp and Credit Karma too. The company has more than 100 million customers worldwide, 17300 employees, and 20 offices in nine countries. “We’re living through a period of massive change,” said CEO Sasan Goodarzi. “The pandemic accelerated many trends and propelled us into a new era of challenges. “The people and communities we serve are experiencing economic volatility, societal inequality, and a growing climate crisis. At Intuit, we embrace these challenges and view them as an opportunity to deliver on our mission to power prosperity around the world.” Most well known as a company that helps pets lead longer, healthier lives via diagnostics and tech innovations, Idexx products help ensure the safety of milk and water around the world – for humans too. Listed in the S&P 500, Idexx employs 11,000 people and has customers in more than 175 countries and territories. Idexx says everything it does is guided by a commitment to create exceptional long-term value by enhancing the health and wellbeing of pets, people, and livestock. Clearly, the company is doing something right, with MSCI upgrading them to AAA rating in July 2023 and praising its product safety and quality. There is still improvement to be made, however, when it comes to carbon emissions. Proving that you don’t have to trample over people to get to the top, it has been a period of constant improvement from Lam Research, scoring an A rating in 2019, elevating to AA in 2020, and hitting the heights of AAA in January 2023. Lam makes equipment that makes the semiconductors we all rely on, and business is booming. Lam is adopting sustainability across its organisation as it aims to reach net zero by 2050 and use 100% renewable energy by 2030. MSCI praised the company for corporate governance and human capital development, and Lam has done much to drive gender equality and promote inclusivity. However, MSCI says it could do even better when it comes to its clean tech ambitions. Everyone has surely heard of Salesforce – the cloud-based software that handles customer relationship management (CRM) and applications focused on sales and customer service. Salesforce is one of the companies that boomed during the pandemic and the accelerated shift to digital and cloud solutions for remote teams. Software-as-a-Service (SaaS) is common these days, but was pioneered by Salesforce in 1999 when it was a small company of four people working from a San Francisco apartment. Pre-pandemic, Salesforce was ranked AAA but that dropped to AA in November 2020 and that is where it remains. So where can Salesforce improve when it comes to ESG? MSCI says it scores average for corporate governance, like others on this list, but worryingly it is seen as a laggard when it comes to corporate behaviour. That could be down to previous non-disclosure agreements enforced by the company – a stance that has been addressed to provide a more transparent workplace culture. As you might have guessed, Pool manufactures equipment and machinery for swimming pools, and is the largest such company in the world. With more than 6,000 employees and over 420 locations worldwide, Pool Corp serves roughly 125,000 wholesale customers around the world. Pool was upgraded from an A to AA in 2019 in recognition of efforts made to be more sustainable, especially when it comes to labour management, where MSCI says it is a leader. Part of those efforts includes striving to be an Employer of Choice thorough DE&I initiatives. However, the company is lagging when it comes to product carbon footprint. The good news for electronic systems design leader Cadence is that MSCI does not recognise it as an ESG Laggard in any of its criteria. However, Cadence misses out on the highest ranking as it is, well, bang average on too many criteria, including carbon emissions and human capital development. That may come as a surprise, as Cadence has been recognised as a Great Place to Work, and one of Fortune magazine’s Top 100 Best Companies to Work For for nine years straight. It also made the Wall Street Journal’s List of Best managed Companies 2023. With that in mind, maybe Cadence will be hoping for a AAA score card on its next MSCI assessment. ****************** Make sure you check out the latest edition of Sustainability Magazine and also sign up to our global conference series - Sustainability LIVE 2024. ******************* Sustainability is a BizClik brand. * This is not financial investment advice. Don’t miss out on your chance to attend Sustainability LIVE New York in 2024 Virtually, 3-4 June… That’s a wrap on Sustainability LIVE Singapore, but that’s not all we have in store, see below essential dates for upcoming Sustainability LIVE events… Don’t miss out on your chance to attend Sustainability Magazine’s LIVE events this year, discover our upcoming events below…… Sustainability Magazine is a Digital Community for the global sustainability space that connects the world’s most sustainable brands & projects and their most senior executives with the latest trends as the sustainability market pivots towards technology and digital transformation. "
}