{
    "title": null,
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/news/zacks-approach-beat-market-annexon-115800165.html",
    "text": "Last Friday, the three widely followed indexes closed out a second straight winning week. The Dow Jones Industrial Average, the S&P 500 and the tech-heavy Nasdaq Composite gained 0.7%, 1.2% and 2.3%, respectively. The S&P 500 hit its first all-time closing high in 2 years and confirmed that, by one measure, it had entered a bull market. Investors’ mood was mixed throughout the week, with a prevailing uncertainty about the timeline for rate cuts. While numbers coming in from various sectors remained relatively strong, falling jobless claims especially indicated that the labor market continues to remain resilient. Expectations for a rate cut of at least 25 bps in March moved down to 52% to close out the week, according to CME's FedWatch Tool. The steep fall of these expectations which were hovering round the 80% mark the week before indicates that even as investors are currently anticipating rate cuts from the Fed, it may not be as early as March. Regardless of market conditions, we, here at Zacks, provide investors with unbiased guidance on how to beat the market. As usual, Zacks Research guided investors over the past three months with its time-tested methodologies. Given the prevailing market uncertainty, you may want to look at our feats to prepare better for your next action. Here are some of our key achievements: Shares of Annexon, Inc. ANNX have gained 75% (versus the S&P 500’s 7.5% increase) since it was upgraded to a Zacks Rank #2 (Buy) on November 15. Another stock, The Pennant Group, Inc. PNTG, which was upgraded to a Zacks Rank #2 on November 17, has returned 23.3% (versus the S&P 500’s 7.1% increase) since then. Zacks Rank, our short-term rating system, has earnings estimate revisions at its core. Empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. A hypothetical portfolio of Zacks Rank #1 (Strong Buy) stocks returned +20.63% in 2023 vs. +24.83% for the S&P 500 index and +15% for the equal-weight S&P 500 index. The portfolio of Zacks Rank #1 stocks is an equal-weight portfolio, while the S&P 500 index is a market-cap-weighted index that has been notably distorted by the concentrated performance of mega-cap stocks in 2023. We are not trying to cherry-pick here. But since this Zacks Model portfolio, consisting of Zacks Rank #1 stocks, is an equal-weight portfolio, the equal-weight S&P 500 index is the appropriate benchmark for comparison. Looked at this way, this portfolio has handily outperformed the index. The Zacks Model Portfolio - consisting of Zacks Rank #1 stocks – has outperformed the S&P index by more than 13 percentage points since 1988 (Through January 1st, 2024, the Zacks # 1 Rank stocks generated an annualized return of +24.18% since 1988 vs. +10.88% for the S&P 500 index).You can see the complete list of today’s Zacks Rank #1 stocks here >>> Check Annexon’s historical EPS and Sales here>>> Check Pennant’s historical EPS and Sales here>>> Image Source: Zacks Investment Research Shares of Dream Finders Homes, Inc. DFH and James Hardie Industries plc JHX have advanced 35.6% (versus the S&P 500’s 7.5% rise) and 29.1% (versus the S&P 500’s 9.4% rise) since their Zacks Recommendation was upgraded to Outperform on November 15 and November 13, respectively. While the Zacks Rank is our short-term rating system that is most effective over the one- to three-month holding horizon, the Zacks Recommendation aims to predict performance over the next 6 to 12 months. However, just like the Zacks Rank, the foundation for the Zacks Recommendation is trends in earnings estimate revisions. The Zacks Recommendation classifies stocks into three groups — Outperform, Neutral and Underperform. While these recommendations are determined quantitatively, our analysts have the flexibility to override them for the 1100+ stocks they closely follow based on their better judgment of factors such as valuation, industry conditions and management effectiveness than the quantitative model. To access our research reports with Zacks Recommendations for the 1100+ stocks we cover, click here>>> Shares of Shopify Inc. SHOP, which belongs to the Zacks Focus List, have gained 72.4% over the past 12 weeks. The stock was added to the Focus List on September 6, 2022. Another Focus-List holding, NVIDIA Corporation NVDA, which was added to the portfolio on May 20, 2019, has returned 46.9% over the past 12 weeks. The S&P 500 has advanced 17.5% over this period. The 50-stock Zacks Focus List model portfolio returned +21.72% in 2023 (through November 30) vs. +20.79% for the S&P 500 index and +6.32% for the equal-weight S&P 500 index. In 2022, the portfolio produced -15.2% vs. the S&P 500 index’s -17.96%. Since 2004, the Focus List portfolio has produced an annualized return of +11.07% through November 30, 2023. This compares to a +9.49% annualized return for the S&P 500 index in the same time period. On a rolling one-, three- and five-year annualized basis, the Zacks Focus List returned +13.49%, +9.21%, and +14.05% vs. +13.82%, +9.74% and +12.51% for the S&P 500 index, respectively. Unlock all of our powerful research, tools and analysis, including the Focus List, Zacks #1 Rank List, Equity Research Reports, Zacks Earnings ESP Filter, Premium Screener and more, as part of Zacks Premium. Gain full access now >> Fair Isaac Corporation FICO, a component of our Earnings Certain Admiral Portfolio (ECAP), has jumped 48.6% over the past 12 weeks. Intuit Inc. INTU has followed Fair Isaac with 29.8% returns. The Zacks Earnings Certain Admiral Portfolio (ECAP), which consists of 30 concentrated, ultra-defensive, long-term Buy and Hold stocks, returned +12.17% in 2023 vs. +26.28% for the S&P 500 index. The portfolio returned -4.7% in 2022 vs. the S&P 500 index’s -17.96%. With little to no turnover and annual rebalance periodicity, the ECAP seeks to minimize capital loss by holding shares of companies whose earnings streams exhibit a proven 20+ year track record of surviving recessionary periods with minimal impact on aggregate earnings growth relative to the overall S&P 500. The ECAP and many other model portfolios are available as part of Zacks Advisor Tools, a cloud-based solution to access Zacks award-winning stock, mutual fund and ETF research. Click here to schedule a demo. Tractor Supply Company TSCO, which is part of our Earnings Certain Dividend Portfolio (ECDP), has returned 23.3% over the past 12 weeks. Another ECDP stock, Public Storage PSA, has climbed 22.4% over the same time frame. Of course, the inclination of investors toward quality dividend stocks to secure an income stream amid heightened market volatility contributed to this performance. Check Tractor Supply’s dividend history here>>> Check Public Storage’s dividend history here>>> With an extremely low Beta and a history of minimum earnings variability over the last 20+ years, this 25-stock portfolio helps significantly mitigate risk. The Zacks Earnings Certain Dividend Portfolio (ECDP) returned -0.9% in 2023 vs. +26.28% for the S&P 500 index) and +8.11% for the Dividend Aristocrats ETF (NOBL). The portfolio returned -2.3% in 2022 vs. -17.96% for the S&P 500 index and -8.34% for NOBL. Click here to access this portfolio on Zacks Advisor Tools. CyberArk Software Ltd. CYBR, from the Zacks Top 10 Stocks for 2024, has jumped 6.1% since the list was released on January 2 compared to a 1.5% increase for the S&P 500 Index. The Top 10 portfolio returned +25.15% in 2023 vs. +26.28% for the S&P 500 index. Since 2012, the Top 10 portfolio has produced a cumulative return of +1060.9% through the end of 2023 vs. +360.1% for the S&P 500 index. On a rolling one-, three- and five-year annualized basis, the Zacks Top 10 portfolio returned +25.15%, +14.13%, and +29.3% vs. +26.28%, +10.23% and +15.61% for the S&P 500 index, respectively. Since 2012, the Zacks Top 10 portfolio has returned an annualized return of +22.67% through the end of 2023 vs. +13.56% for the S&P 500 index. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Public Storage (PSA) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Tractor Supply Company (TSCO) : Free Stock Analysis Report Intuit Inc. (INTU) : Free Stock Analysis Report Fair Isaac Corporation (FICO) : Free Stock Analysis Report James Hardie Industries PLC. (JHX) : Free Stock Analysis Report CyberArk Software Ltd. (CYBR) : Free Stock Analysis Report Shopify Inc. (SHOP) : Free Stock Analysis Report The Pennant Group, Inc. (PNTG) : Free Stock Analysis Report Annexon, Inc. (ANNX) : Free Stock Analysis Report Dream Finders Homes, Inc. (DFH) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}