{
    "title": "Zuckerberg: Meta Is Buying Up to 350000 Nvidia H100 GPUs in 2024",
    "date": "1/19/2024",
    "url": "https://www.extremetech.com/extreme/zuckerberg-meta-is-buying-up-to-350000-nvidia-h100-gpus-in-2024",
    "text": "It was almost a year ago when Mark Zuckerberg boldly proclaimed that the company he co-founded would focus on AI going forward. Sure, there was that whole name change to Meta and the metaverse, but artificial intelligence was now the company's biggest priority. Now Zuckerberg is doubling down, as he has revealed Meta will be running up to 350,000 Nvidia H100 GPUs by the end of this year to train its AI models, making Meta the owner of one of the largest AI infrastructures in the world. Zuckerberg revealed his company's plans in a video on Instagram and elaborated on his vision of the future. The short video is all about AI and where he sees it going in the future. The top-line notes are that Meta's primary goal is to advance general intelligence (AGI) and make it open-source so everyone can use it safely. As part of this effort, he says Meta will bring the company's two long-term AI research projects (FAIR and GenAI) \"closer together\" to achieve this goal faster. A post shared by Mark Zuckerberg (@zuck) Donning his future cap, Zuckerberg then lays out his vision, saying it's now become clear to him that the next generation of services will require AI. This will mean there will be customized AIs for various use cases, including general AI assistants, AIs for creators, AIs for business, and so forth. To get there, Zuckerberg says we will need advances in every area of AI, which requires hardware to train new and existing models. To that end, Zuckerberg says by the end of this year, Meta will have 350,000 Nvidia H100 GPUs running full-time and that overall, it will have the equivalent of 600,000 H100s GPUs when you add up all the power of its other GPUs. He says it's currently training its Llama 3 model and has a roadmap of future models it'll be training responsibly. Circling back to the metaverse, Zuckerberg says we'll need new devices to interact with these AIs, and that's where its Ray-Ban smart glasses come into play. He says in the future, we'll all be talking to AIs throughout the day, and the best way to do that is with a pair of glasses. He notes glasses are the perfect vehicle for AI interaction since they see what you can see and hear what you hear while also allowing you to talk to the assistant. Though we've all shared many jokes at Zuckerberg's expense over his metaverse ambitions, his thoughts on AI's potential seem grounded in reality, at least as it exists in early 2024. AI is the new buzzword for the industry, and Meta wants to be at the forefront of this new technological frontier. Whether it will achieve that is anyone's guess, and how that will impact our lives in a few years also remains to be seen, but the company is undoubtedly placing a large bet that AI will be the next big thing in computing. ExtremeTech supports Group Black and its mission to increase greater diversity in media voices and media ownerships. © 2001-2024 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved. ExtremeTech is a federally registered trademark of Ziff Davis, LLC and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of ExtremeTech. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant. "
}