{
    "title": null,
    "date": "1/30/2024",
    "url": "https://www.livewiremarkets.com/wires/no-nvidia-is-not-a-bubble",
    "text": "Share a direct link to this wire:\n            \nCopy or embed it in your site:\n            \n              \n            \nCopy Global X ETFs Financial markets last year were defined by the rise of Artificial Intelligence (AI), with some analysts describing AI as the “saviour” of the S&P 500. Among those AI stocks, Nvidia (NASDAQ: NVDA) was a clear standout, climbing more than 230% in 2023 and becoming the eighth company to hit US$1 trillion in valuation ever. However, with such an explosive rise to stardom, some questions have naturally arisen: GPUs (a.k.a. graphics cards) are microchips designed to output graphics onto computer screens; and Nvidia, with its origins in the video games industry, has long been the industry leader in that market, maintaining almost 80% market share in 2023. Source: Global X ETFs  But Nvidia’s GPUs didn’t matter in the AI rally because of their graphics rendering capabilities, instead, it was their prowess in data processing that was the focus, a feat largely attributed to Nvidia’s proprietary software CUDA (Compute Unified Device Architecture). Introduced in 2006, CUDA transformed Nvidia’s GPUs by enabling developers to harness each processor’s computing power for whatever programs they wished – including AI development, which favoured the fast computational speeds of GPUs over the accuracy of a traditional CPU. Since then, Nvidia has continued to develop and support CUDA, and today the platform is used by over four million software developers, representing the world’s most robust AI ecosystem. Following the launch of ChatGPT, Nvidia, with its extensive history in AI development, found itself in the prime position to meet the growing demand for AI GPUs. It benefitted from your classic network effects and switching costs, as programmers worldwide were deeply ingrained in its CUDA software. Furthermore, GPUs fine-tuned for AI workloads already existed within Nvidia’s hardware line-up, meaning extra development was mostly unnecessary. These factors combined entitled Nvidia to unrivalled pricing power (the premium end of the GPU market observes the most pricing power, and Nvidia’s high-end AI chips can cost over US$40,000), allowing for margins of up to 1,000% of production costs on chipsets such as the H100. At the time of writing, Nvidia has just hit a new all-time high of US$603.31, marking a 12-month return of 210% and a total market cap of more than US$1.3 trillion. With such immense growth, questions have naturally arisen about overvaluation. It is our view that, despite Nvidia’s dizzying rally over the past year, there is no clear evidence of a bubble. Evidence suggests the rally has been driven by the market pricing-in consensus future earnings rather than by hype. This is reflected in the table and graph below. Source: Global X ETFs  Source: Global X ETFs Breaking down Nvidia’s growth for the next few years, we can see the following:  Source: Global X ETFs Source: Global X ETFs What are the risks for Nvidia looking forward? While we view Nvidia as an ongoing opportunity, we also see two possible risks for its growth assumptions. Crucially, as with any hardware company, Nvidia’s success relies on future demand. Should Google, Facebook, and Amazon pull back from developing large language models or AI capabilities, future chip demand could slow. Furthermore, Amazon, Google, and Microsoft are all developing custom silicon as an attempt to detach from Nvidia’s data centre GPU monopoly. We see this as a low-risk development in the near term as Nvidia maintains a significant technological moat over competitors, but meaningful in the mid to long term as custom hardware will eventually form tangible economic and performance advantages. While Nvidia has certainly had an impressive run over the past 12 months, we believe the valuation for the stock remains realistic and is rooted in fundamentals. Strong earnings outlook, high market demand, an extensive technological moat, and growing AI adoption are all factors that we see driving Nvidia forward in the coming years. As such, it is our view that Nvidia continues to be one of the best companies to capitalise on the growth of artificial intelligence and should not be considered to be ‘in a bubble’. Stocks mentioned 7 stocks\n          mentioned Funds mentioned 2 funds\n          mentioned Justin joined the firm in 2022 prior to the acquisition of Global X and supports Product and Investment Strategy initiatives. Previously, Justin worked in business development and marketing in the legal industry. Justin holds a Bachelor of Liberal... Only to be used for sending genuine email enquiries to the Contributor. Livewire Markets Pty Ltd reserves\n            its right to take any legal or other appropriate action in relation to misuse of this service. Personal Information Collection StatementYour personal information will be passed to\n            the Contributor and/or its authorised service provider to assist the Contributor to contact you about your\n            investment enquiry. They are required not to use your information for any other purpose. Our\n            privacy policy explains how we store\n            personal information and\n            how you may access, correct or complain about the handling of personal information. Justin joined the firm in 2022 prior to the acquisition of Global X and supports Product and Investment Strategy initiatives. Previously, Justin worked in business development and marketing in the legal industry. Justin holds a Bachelor of Liberal... Only to be used for sending genuine email enquiries to the Contributor. Livewire Markets Pty Ltd reserves\n            its right to take any legal or other appropriate action in relation to misuse of this service. Personal Information Collection StatementYour personal information will be passed to\n            the Contributor and/or its authorised service provider to assist the Contributor to contact you about your\n            investment enquiry. They are required not to use your information for any other purpose. Our\n            privacy policy explains how we store\n            personal information and\n            how you may access, correct or complain about the handling of personal information. Livewire gives readers access to information and educational content provided by financial services professionals\n            and companies (”Livewire Contributors”). Livewire does not operate under an Australian financial services licence\n            and relies on the exemption available under section 911A(2)(eb) of the Corporations Act 2001 (Cth) in respect of any advice given.\n            Any advice on this site is general in nature and does not take into consideration your objectives, financial situation or needs.\n            Before making a decision please consider these and any relevant Product Disclosure Statement. Livewire has commercial relationships with some Livewire Contributors. "
}