{
    "title": "Nvidia Goes AWOL. But Top Funds Latch Onto This AI Stock.",
    "date": "1/25/2024",
    "url": "https://www.investors.com/research/breakout-stocks-technical-analysis/adobe-stock-stokes-ai-driven-demand-and-buy-point-as-nvidia-goes-awol/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     The Nvidia (NVDA) artificial intelligence juggernaut continues to make waves — and new highs. Yet you won't find NVDA stock on this month's list of new buys by the best mutual funds. But you will find Adobe (ADBE) as savvy money managers scoop up $1.3 billion worth of Adobe stock. Throughout 2023, the AI wave fueled demand across a wide swath of industries. Both this month and last, Adobe joined Microsoft (MSFT) on this screen that showcases where institutional investors are focusing their money. Nvidia, on the other hand, has been AWOL from the list since October. But the latest IBD Breakout Stocks Index, which is updated weekly, features both Adobe and Nvidia. As Nvidia continues to hit record highs, Adobe stock looks to generate a breakout and an all-time high of its own. Adobe also joins Magnificent Seven stocks Nvidia and Microsoft in garnering another sign of demand. While 221 funds with an A+ rating from IBD have a position in MSFT and 120 have a stake in NVDA, a solid 88 A+ funds own shares of Adobe stock. See Who Joins Adobe Stock On The IBD Breakout Stocks Index Although Adobe doesn't join Microsoft on the IBD Long-Term Leaders list, it actually has a better Earnings Stability Rating than its AI peer. Unlike the higher-the-better Composite Rating, the lower the Earnings Stability Rating the more stable the earnings. Adobe earns a strong 4 rating, a better score than Microsoft's 6. Nvidia, by comparison, has a 28 rating. While Microsoft reports earnings on Jan. 30 and Nvidia on Feb. 21, Adobe doesn't give its next performance report until mid-March. In its latest quarterly report on Dec. 13, Adobe eclipsed the $5 billion mark in sales, marking a 12% year-over-year gain to $5.01 billion. The AI leader drove earnings per share of $4.24, a 19% rise over the prior-year quarter. Having now generated a second-stage flat base, Adobe stock is targeting a 633.89 buy point. The generative AI firm has just popped back above its 50-day line, rising nearly 3% in above-average and rising volume Thursday. Up 1.6% for the week so far, Adobe now stands above three benchmarks: its 21-day line, 50-day line and the 600 mark. Meanwhile, Microsoft just jumped to the very top of its buy range and Nvidia hits yet another all-time high. Firmly established as a leader in marketing, analytics and creative tools, Adobe has tied them all together to emerge as a powerhouse in generative AI. Advancing what it calls Generation AI, the Adobe Sensei platform provides AI for business. With Adobe Sensei GenAI serving as co-pilot, generative AI aims to help clients reshape every aspect of their marketing initiatives. From planning to execution to analysis, Adobe helps partners deploy natively embedded AI technology to amplify their expertise and deliver more accurate and personalized customer journeys. The AI leader will showcase what's new and on the horizon at the Adobe Summit 2024 in March. Using his stage name DJ DIESEL, NBA legend and entrepreneur Shaquille O'Neal is set to speak at the event, which features AI experts and other experts from around the world. Just ahead of the 2024 Sundance Film Festival earlier this month, Adobe unveiled major audio updates to its tools to help filmmakers enhance their sound design. The beta release includes AI-powered audio category tagging to automate the identification and labeling of dialogue, music, sound effects and ambience. The IBD Breakout Opportunities ETF (BOUT) from Innovator Capital Management tracks the IBD Breakout Stocks Index. As with other index ETFs, this fund allows you to invest in the entire index in addition to, or rather than, buying individual stocks. Learn more here about the ETF and Innovator. Follow Matthew Galgani on Twitter at @IBD_MGalgani. YOU MAY ALSO LIKE: Top Funds Kick Off 2024 With Huge Bet On MSFT Stock — And 1 Sector 11 Companies Including Nvidia Are Growing Like A House On Fire How To Invest In Magnificent Seven Stocks In 2024 Stock Picks: Google, Nvidia Reveal 7 Telltale Traits To Monitor Identify Bases And Buy Points With This Pattern Recognition Tool 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}