{
    "title": "Why Nvidia (NVDA) is a Top Stock for the Long-Term",
    "date": "2/2/2024",
    "url": "https://www.zacks.com/stock/news/2220261/why-nvidia-nvda-is-a-top-stock-for-the-long-term",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    February 02, 2024 NVDA Quick QuoteNVDA Better trading starts here. You follow Tale of the Tape - edit You follow Zacks Equity Research - edit Zacks Equity Research Tale of the Tape Here at Zacks, we offer our members many different opportunities to take full advantage of the stock market, as well as how to invest in ways that lead to long-term success. The Zacks Premium service makes this easier. It features daily updates of the Zacks Rank and Zacks Industry Rank; full access to the Zacks #1 Rank List; Equity Research reports; and Premium stock screens like the Earnings ESP filter. All of these can help you quickly identify what stocks to buy, what to sell, and what are today's hottest industries. The service also includes the Focus List, which is a long-term portfolio of top stocks that boast a winning, market-beating combination of growth and momentum qualities. Breaking Down the Zacks Focus List Building an investment portfolio from scratch can be difficult, so if you could, wouldn't you take a peek at a curated list of top stocks? Enter the Zacks Focus List. It's a portfolio made up of 50 stocks that are set to beat the market over the next 12 months; each company selected serves as a foundation for long-term investors looking to create an individual portfolio. Additionally, each selection is accompanied by a full Zacks Analyst Report, something that makes the Focus List even more valuable. The report explains in detail why each stock was picked and why we believe it's good for the long-term. The portfolio's past performance only solidifies why investors should consider it as a starting point. For 2020, the Focus List gained 13.85% on an annualized basis compared to the S&P 500's return of 9.38%. Cumulatively, the portfolio has returned 2,519.23% while the S&P returned 854.95%. Returns are for the period of February 1, 1996 to March 31, 2021. Focus List Methodology When stocks are picked for the Focus List, it reflects our enduring reliance on the power of earnings estimate revisions. Brokerage analysts are in charge of determining a company's growth and profitability expectations, or earnings estimates. These analysts work together with company management to evaluate all factors that may affect future earnings, like interest rates, the economy, and sector and industry optimism. Earnings estimate revisions are very important, since investors also need to take into consideration what a company will earn in the future. The stocks that receive positive changes to earnings estimates are more likely to receive even more upward changes in the future. Take this example: if an analyst raised their estimates last month, they'll probably do so again this month, and other analysts will follow. Harnessing the power of earnings estimate revisions is where the Zacks Rank comes in. The Zacks Rank, which is a unique, proprietary stock-rating model, employs earnings estimate revisions to make it easier to build a winning portfolio. The Zacks Rank consists of four main pillars: Agreement, Magnitude, Upside, and Surprise. Each one is given a raw score, which is recalculated every night and compiled into the Rank. Then, stocks are classified into five groups, ranging from \"Strong Buy\" to \"Strong Sell,\" using this data. The Focus List is comprised of stocks hand-picked from a long list of #1 (Strong Buy) or #2 (Buy) ranked companies, meaning that each new addition boasts a bullish earnings consensus among analysts. Because stock prices react to revisions, buying stocks with rising earnings estimates can be very profitable. Focus List stocks offer investors a great opportunity to get into companies whose future earnings estimates will be raised, potentially leading to price momentum. Focus List Spotlight: Nvidia (NVDA Quick QuoteNVDA  -  Free Report) NVIDIA Corporation is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit, or GPU. Over the years, the company’s focus has evolved from PC graphics to artificial intelligence (AI) based solutions that now support high performance computing (HPC), gaming and virtual reality (VR) platforms. On May 20, 2019, NVDA was added to the Focus List at $39.13 per share. Shares have increased 1510.71% to $630.27 since then, and the company is a #2 (Buy) on the Zacks Rank. One analysts revised their earnings estimate higher in the last 60 days for fiscal 2024, while the Zacks Consensus Estimate has increased $0.13 to $12.30. NVDA also boasts an average earnings surprise of 19%. Moreover, analysts are expecting NVDA's earnings to grow 268.3% for the current fiscal year. Reveal Winning Stocks Unlock all of our powerful research, tools and analysis, including the Zacks #1 Rank List, Equity Research Reports, Zacks Earnings ESP Filter, Premium Screener and more, as part of Zacks Premium. You'll quickly identify which stocks to buy, hold and sell, and target today's hottest industries, to help improve the performance of your portfolio. Gain full access now >>  NVIDIA Corporation (NVDA) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}