{
    "title": "Nvidia overtakes Alphabet to become third most valuable US company | Mint",
    "date": "2/15/2024",
    "url": "https://www.livemint.com/market/stock-market-news/nvidia-overtakes-alphabet-to-become-third-most-valuable-us-company-11707964119198.html",
    "text": "Nvidia overtook Google-parent Alphabet to become the third most valuable US company on Wednesday, ahead of the AI chipmaker’s upcoming quarterly. Nvidia share price rose 2.46% with its market capitalization surging to $1.825 trillion, while Alphabet stock price rose 0.55%, leaving it with a value of $1.821 trillion. A day before, Nvidia’s market capitalization rose above Amazon’s for the first time in two decades. Amazon’s market capitalization was $1.776 trillion after its stock rose 1.39% on Wednesday. Nvidia stock price has surged 47% this year after it more than tripled in 2023 led by strong demand for its chips as the company controls about 80% of the high-end AI chip market. Also Read: Wall Street Regains Footing After CPI-Fueled Rout: Markets Wrap Customers face shortages of Nvidia's top-of-the-line components while AI developers face months-long waiting lists to use its processors through cloud-computing providers, Reuters reported. Technology-related companies, including Microsoft and Meta Platforms, have also rallied to record highs on AI optimism. Nvidia is set to report its quarterly earnings next Wednesday and analysts expect another blowout quarter and outlook from the company. Nvidia's January fiscal quarter revenue is expected to more than triple to $20.37 billion, fueled by demand for its top-shelf AI chips, as per average analysts estimates. Adjusted net profit is seen surging over 400% to $11.38 billion. Meanwhile, Microsoft, now valued at over $3 trillion, overtook Apple in January to become the world’s most valuable company. Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG. Catch Stock Market Live Updates here (With inputs from Reuters) Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Get the best recommendations on Stocks, Mutual Funds and more based on your Risk profile! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}