{
    "title": "You Don't Have to Buy Nvidia to Benefit From Its Explosive Artificial \nIntelligence (AI) Growth. You Can Buy These 2 ...",
    "date": "2/25/2024",
    "url": "https://www.fool.com/investing/2024/02/25/you-dont-have-to-buy-nvidia-to-benefit-from-its-ex/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) just reported another quarter of explosive growth, with revenue and net income climbing in the triple digits into the billions of dollars. The artificial intelligence (AI) chip leader scored big as more and more companies flocked to buy its top-performing chip and related products and services. And Nvidia's revenue even reached a record at more than $22 billion. Meanwhile, Nvidia's stock has soared about 285% over the past year. Even after these gains, Nvidia still remains a great stock to buy thanks to its solid future prospects. But there's another way to benefit from Nvidia's growth -- without even owning the stock. And that's by investing in companies that work hand in hand with this chip giant, and two perfect examples are leading cloud service provider Amazon (AMZN 0.31%), through Amazon Web Services (AWS), and server giant Super Micro Computer (SMCI -1.30%). Why would you want to do this? Because it offers you the best of both worlds: Nvidia's growth along with exposure to another top-notch business operating in other compelling areas. Let's take a closer look at each. Image source: Getty Images. Amazon's AWS is the world's leading cloud services provider, and it also generally drives overall profitability at the company. AWS offers clients a wide variety of cloud solutions, and in recent times, it's put the focus on AI, investing in technology infrastructure and in supporting clients across their AI projects. By buying Amazon shares, you can benefit from Nvidia's growth because the company's graphics processing units (GPUs), or the chips powering AI, are found in AWS' offerings. And at AWS, you'll also find various Nvidia products and services such as the Nvidia AI Enterprise platform to accelerate AI development. Late last year, AWS and Nvidia even announced an extension of their collaboration to include new projects, such as work to create the world's fastest AI supercomputer -- powered by Nvidia GPUs of course. And since so many companies already use AWS, it's likely they'll stick with the cloud services provider when they're looking for Nvidia products and services. All of this represents a huge revenue growth opportunity for Amazon moving forward. On top of this, when you buy Amazon shares, you also benefit from the company's e-commerce business, which is another area with top growth prospects and a solid earnings track record. So, trading for 41x forward earnings estimates, Amazon makes a top buy right now. Supermicro is a seller of servers, storage systems, full rack scale solutions, and related products. Now here's where things get exciting: The company uses a building blocks method of constructing its products so that it assembles a rack, for instance, according to the customer's needs. And Supermicro monitors Nvidia's product development so that it can ensure its own products are compatible -- and ready to integrate the Nvidia innovation as soon as it's released. Supermicro also maintains this collaborative relationship with other chip companies like Advanced Micro Devices and Intel so it's able to benefit from the growth of all players in the space. As a result, Supermicro offers customers a customized product, powered by the world's fastest chips as soon as they hit the market. In the most recent quarter, the company said it saw record demand for systems at rack scale, incorporating chips from Nvidia and other market leaders. Supermicro's earnings have roared higher in recent times thanks to its close work with these AI chip giants, and in the fiscal year 2023 -- 30 years after the company launched -- it reported its first $2 billion quarter. Now, the company predicts revenue for the current full fiscal year to climb at least 101% to $14.3 billion. All of this means that when the leading chipmakers win, so does Supermicro. And that makes the valuation of 40x forward earnings estimates look pretty reasonable for this top AI growth stock. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Adria Cimino has positions in Amazon. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, and Nvidia. The Motley Fool recommends Intel and Super Micro Computer and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}