{
    "title": "Goldman Sachs hikes Nvidia price target on strong future",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/video/goldman-sachs-hikes-nvidia-price-151234128.html",
    "text": "Goldman Sachs analyst Toshiya Hari raised the firm's price target on chip-making giant Nvidia (NVDA) from $625 to $800 per share. Hari cites optimism for the company's growth potential based on significant increase in the forecasted non-GAAP (Generally Accepted Accounting Principles) earnings per share. Yahoo Finance Reporter Madison Mills joins the Live show to break down the latest development for the company and what it could mean for the stock moving forward. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino SEANA SMITH: Goldman Sachs feeling bullish on NVIDIA. Raising their price target on the stock to $800 a share from $625 reiterating. Their buy rating Yahoo Finance's Madison Mills on the floor of the New York Stock Exchange with the details there. Madison we're looking at 3% move to the upside ahead of the open. MADISON MILLS: A huge upside for this name that's likely to hit another record as of the opening bell coming up at 9:30 here. And exactly like you said Seana, that is because of this giant upgrade to the semiconductor giant that is NVIDIA, coming out from Goldman Sachs this morning, upping their price target to $800. That implies an over 20% gain from their previous price target for NVIDIA, which was at $625. I also want to point out the average analyst estimate for this name in terms of the price target, which was $679.64. So over $100 above that average analyst estimate. And if you take a look at the Yahoo Finance platform, you can see that NVIDIA is at the very top of its 52-week trading range. So that could be an indication of bullishness across our audience of retail investors on this name as well. We're also hearing bullishness from the likes of Stanley Druckenmiller, saying that this is not only going to be a good play for this year. It's going to be a good play heading into 2025 and 2026 as well. So seeing a long term story here. Now, why is that? That is because we had some questions about whether or not the data center demand was there for NVIDIA. And we've already gotten some clues in previous earnings that demand story is stable. Right. We heard obviously great earnings report from Meta on Friday. Great earnings from Microsoft as well. Two of the big customers for NVIDIA's data centers. So that is a bullish signal for NVIDIA. Also, it's continuing to be a bullish story across the chip sector. When you look at earnings from, I think about an IBM even. Strong demand there is going to indicate strong demand for NVIDIA moving forward. And that is what they noted in this Goldman Sachs report. Talking about positive earnings from SMCI as a bullish indicator for NVIDIA moving forward. The big final question I have is, what is the demand going to look like out of China. That made up about a fifth of NVIDIA's revenue in 2023. Are they going to be able to continue that? We'll find out more in their earnings print on the 21st. Related Quotes "
}