{
    "title": "Inside Nvidia's Stunning Report And Its Impact",
    "date": "2/27/2024",
    "url": "https://seekingalpha.com/article/4673803-nvidia-stunning-report-impact",
    "text": "Lemon_tm  Lemon_tm In the fourth quarter, Nvidia’s (NVDA) sales surged by 265.3% to $22.1 billion, compared to $6.05 billion in the same quarter a year ago. The company’s earnings soared by 771.6% to $12.29 billion, compared with just $1.41 billion in the fourth quarter of 2022. Excluding extraordinary items, Nvidia’s operating earnings reached $4.93 per share. The analyst community was expecting sales of $20.4 billion and operating earnings of $4.20 per share, so the company posted an 8.3% sales surprise and a 17.4% earnings surprise. Nvidia also raised its first-quarter sales guidance to $24 billion, substantially higher than the analysts’ consensus estimate of $20.4 billion. Founder and CEO Jensen Huang said, “Accelerated computing and generative AI has hit the tipping point.” Huang added that, “Demand is surging worldwide across companies, industries and nations.” In other words, Huang and Nvidia are taking over the world! Google (GOOG, GOOGL) laid off 12,000 workers, despite a record $20.4 billion in fourth-quarter earnings, and AI is being blamed for these layoffs. There is a growing apprehension that the push towards automation and AI could eventually lead to further job replacements, adding to worker anxiety​​. Ironically, what is happening at Google is called “productivity growth,” since Google is boosting its earnings with fewer employees. Speaking of productivity, Walmart (WMT) reported same-store quarterly sales growth of 4%, significantly higher than analysts’ consensus expectation of 3.1%. The retailer also beat earnings estimates and raised its guidance for fiscal 2025. For all of fiscal 2025, Walmart is expecting 3-4% sales growth, so the good news is that the U.S. consumer is not dead, despite a dismal -0.8% decline in January retail sales. An early spring seems to have arrived in parts of the Northern Hemisphere, so the demand for crude oil and refined products may soon expand. As a result, crude oil demand is steadily rising. Brent crude oil prices are now over $80 per barrel and WTI crude oil prices are also on the verge of reaching $80 per barrel. According to the U.S. Energy Information Administration (EIA), U.S. refineries are only operating at an 80.6% capacity, as many refineries were shut down for seasonal maintenance, as well as a reformulation shift to summer fuels. As a result, prices at the pump are expected to remain high. I should add that natural gas prices are now nearing a three-decade low, since this winter has been warmer than normal, so LNG exports are necessary to boost natural gas demand. Since the Biden Administration prohibited new LNG expansion, the energy sector is very upset. However, a new Trump Administration would almost certainly reverse Biden’s LNG expansion ban and further boost U.S. energy exports. Shell (SHEL) is forecasting that LNG demand will surge 50% by 2040 as the world transitions to cleaner fossil fuels. Specifically, Shell said, “The global LNG market will continue growing into the 2040s, mostly driven by China’s industrial decarbonization and strengthening demand in other Asian countries.” I still find it very odd that the Biden Administration is trying to impede a booming U.S. industry that is helping to lower worldwide carbon dioxide emissions. The U.S. war against natural gas appliances is also very perplexing and would likely be stopped if America votes in a new Trump Administration. If the U.S. ban on LNG expansion is not lifted, Guyana might be where U.S. energy companies look next to expand LNG exploration. Guyana President Irfaan Ali called for the “immediate” development of the country’s natural gas resources. Specifically, Ali said, “The time to develop our gas is now” and added, “There’s an immediate window of opportunity between now and the end of the decade to monetize and maximize” Guyana’s natural gas resources. Currently, Exxon Mobil (XOM) is injecting most of Guyana’s natural gas back into crude oil reservoirs as a waste product, which is cleaner than flaring the natural gas. Bloomberg posted an excellent article on Wednesday, titled, “Biden’s EV Dreams Are a Nightmare for Tesla (TSLA) and the U.S. Car Industry.” In this article, there is a chart illustrating “Tesla’s Buying Spree” of battery imports from China. Not only is Tesla utilizing CATL’s LFG batteries, but it is also using BYD’s (OTCPK:BYDDF) blade battery technology in the Model Y it makes in Berlin. So, it looks like the goal of onshoring battery manufacturing in the U.S. was a Biden pipe dream, since the Big 3 all cancelled their new battery plants with partners from China and South Korea, due to a lack of demand as well as a battery glut in China. The Biden Administration’s efforts to onshore chip manufacturing is proceeding better than its EV battery push, as the big Taiwan Semiconductor (TSM) plant in Arizona is scheduled to open in 2025. One major glitch is that the neon used in lasers to make semiconductors has mostly come from Ukraine and Russia. Since Ukrainian production is off-line and Russia is subject to sanctions, new neon supplies must be developed. Navellier & Associates owns Nvidia Corp. (NVDA), Exxon Mobil Corp. (XOM), Walmart Inc. (WMT), Alphabet Inc. Class A (GOOGL) and Shell Plc Sponsored ADR (SHEL) in managed accounts, and a few clients hold Tesla (TSLA), and Taiwan Semiconductor Manufacturing Co., Ltd. Sponsored ADR (TSM), per client request in managed accounts. Louis Navellier and his family own Nvidia Corp. (NVDA), Exxon Mobil Corp. (XOM), and Shell Plc Sponsored ADR (SHEL) via a Navellier managed account and Nvidia Corp. (NVDA) in a personal account. He does not own Walmart Inc. (WMT), Alphabet Inc. Class A (GOOGL), Taiwan Semiconductor Manufacturing Co., Ltd. Sponsored ADR (TSM), or Tesla (TSLA) personally. All content above represents the opinion of Louis Navellier of Navellier & Associates, Inc. Disclaimer: Please click here for important disclosures located in the \"About\" section of the Navellier & Associates profile that accompany this article. Disclosure: *Navellier may hold securities in one or more investment strategies offered to its clients. Original Post Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}