{
    "title": "Can Nvidia Hit $1000 in 2024? The Crazy Answer.",
    "date": "2/11/2024",
    "url": "https://investorplace.com/2024/02/can-nvidia-hit-1000-in-2024-the-crazy-answer/",
    "text": " The long-term NVDA stock forecast remains very promising for patient investors Advertisement Source: Poetra.RH / Shutterstock.com Nvidia (NASDAQ:NVDA) was the top-performing S&P 500 stock in 2023, up 239%, 45 percentage points higher than Meta Platforms (NASDAQ:META). The NVDA stock forecast for 2024 looks equally impressive. Nvidia’s share price was up 41.55% through Feb. 7, making it the top-performing S&P 500 stock in 2024, 888 basis points ahead of Meta. The chip maker continues to get a lot of love from analysts. It doesn’t hurt that the Semiconductor Industry Association predicts 13% sales growth for semiconductors in 2024, which absultely factors into any comprehensive NVDA stock forecast. Other than valuation, there doesn’t appear to be anything that could deliver a body blow to Nvidia’s share price in the months ahead. What’s an investor to do? If you bought NVDA stock five years ago, you’re up 1,784%, more than 11x the index’s performance. If you bought five years ago and are still holding, I’d advise you to do something—options, futures, etc.—to ensure you protect these unrealized gains. Long-term, I’m a big fan of CEO Jensen Huang and the management team he’s assembled. But, as they say, “What goes up must come down, Spinning Wheel got to go round.” Here’s what I might do and why I’d do it. The first significant correction for Nvidia came between September 2018, when it hit a high of $73.19, and December 2018, when it hit a low of $31.11, a 57% correction over three months. Its second big correction came in late 2021 after it had been on a nearly three-year run, moving from $31.11 in December 2018 to $346.47 in October 2021, a 1,014% gain. It fell to a low of $108.13 in October 2022, a 68% correction over 12 months. Since mid-October 2022, its shares have risen by 544% over 15 months. With AI creating massive free cash flow, it’s not surprising that analysts like Bernstein Managing Director and Senior Analyst Stacy Rasgon believe Nvidia is one of the cheaper AI plays. The NVDA stock forecast calls for the company to generate $100 billion over the next two years, more than 3x what it generated in the preceeding two. She points out that although semiconductor sales are expected to grow by 13% this year, not all semiconductor companies will benefit from this growth. Those most exposed to AI will see the greatest benefits. “But one of the areas that I think should be growing a lot is AI. And they are clearly, like, the most exposed to that space. They’re one of the few that are actually making real money in that space,” Rasgon stated while appearing on Yahoo Finance on Feb. 5. So, while significant corrections can even happen to the Nvidia’s of the world, nothing I can think of on the near-term horizon points to black clouds for the company. As the Bernstein analyst said in her Yahoo Finance appearance, things like PCs, networking, and data center server CPUs should all experience growth in 2024. Nvidia’s Q3 2024 revenue was $18.12 billion. Of that, 80% was from its data center division, including its AI-accelerating chips. The company doesn’t break out the numbers for the various parts of data center revenue, AI, and non-AI. On pg. 28 of its Q3 2024 10-Q, it said networking revenue was up 155% year-over-year and 52% sequentially. That’s something. However, it also noted that most of the increase was due to its InfiniBand infrastructure to support its HGX platform, which is AI-related. I read an article earlier this year that estimated Nvidia’s external networking products generated 30% of data center revenue in the past year. If we use the same number for Q3 2024, the networking revenue would be approximately $4.35 billion [$14.51 billion x 30%], up 155% from $2.81 billion a year earlier [$4.35 billion / 155%]. So, if we annualize the $4.35 billion estimated networking revenue, we get $17.4 billion. Multiply that by a similar increase for 2025, and we get $27.0 billion. That’s 28.5% of the analysts’ 2025 revenue estimate of $94.41 billion. The percentage seems a tad high, but it’s only meant to suggest there is revenue growth potential outside AI. The remaining non-AI growth should come from its Gaming business, which grew revenue by nearly 15% in the third quarter to $2.86 billion. I do like Nvidia’s stock for a long-term hold of forever. However, we know that Nvidia’s stock has been prone to decent-sized corrections, so that’s always a possibility in the months ahead. If you want to buy Nvidia stock, consider using options to reduce the capital required to gain a potential entry point. Perhaps in a future article, I’ll get into the specifics of what options to buy to get the job done. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. Technology, Artificial Intelligence, Semiconductor   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/can-nvidia-hit-1000-in-2024-the-crazy-answer/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}