{
    "title": "Top Research Reports for NVIDIA, Visa & Amgen",
    "date": "2/28/2024",
    "url": "https://finance.yahoo.com/news/top-research-reports-nvidia-visa-184200643.html",
    "text": "Wednesday, February 28, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corp. (NVDA), Visa Inc. (V) and Amgen Inc. (AMGN). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>NVIDIA’s shares have outperformed the Zacks Semiconductor - General industry over the past year (+239.1% vs. +164.8%). The company’s Computer & Networking revenues are gaining from the strong growth of artificial intelligence (AI), high-performance computing and accelerated computing.The data center end-market business is likely to benefit from the growing demand for generative AI and large language models using graphic processing units (GPUs) based on NVIDIA Hopper and Ampere architectures. A surge in hyperscale demand and a solid uptake of AI-based smart cockpit infotainment solutions are acting as tailwinds.Collaborations with Mercedes-Benz and Audi are likely to advance its presence in autonomous vehicles and other automotive electronics space. However, its near-term prospects are likely to be hurt by softening IT spending amid macroeconomic headwinds.(You can read the full research report on NVIDIA here >>>)Shares of Visa have outperformed the Zacks Financial Transaction Services industry over the past year (+29.8% vs. +25.2%). The company’s strategic acquisitions and alliances are fostering long-term growth and consistently driving its revenues. It expects net revenues to increase in the low double digits for fiscal 2024.Visa, fueled by increased payments and sustained investments in technology, is witnessing bottom-line growth. The ongoing shift to digital payments is advantageous for Visa, with strong domestic volumes supporting its overall performance. A robust cash position enables the company to enhance shareholder value.The company beat earnings estimates by 3.4% in the fiscal first quarter of 2024. However, elevated operating expenses pose margin challenges. Additionally, it is witnessing a declining cash volume from the Asia-Pacific and CEMEA regions. As such, the stock warrants a cautious stance.(You can read the full research report on Visa here >>>)Amgen’s shares have outperformed the Zacks Medical - Biomedical and Genetics industry over the past year (+24.3% vs. -4.5%). The company expects strong sales growth of products like Tezspire, Evenity, Repatha, Prolia and Tavneos to be offset by lower revenues from oncology biosimilars and legacy established products such as Enbrel in the future quarters.The addition of Horizon Therapeutics has given Amgen a significant rare disease business. Amgen also has some key pipeline assets in obesity and inflammation, which are indications that can have a large market opportunity. Several data readouts are expected in the next 12 months.However, increased pricing headwinds and competitive pressure are hurting sales of many products, including some biosimilars. Weakness in some key brands like Otezla and Lumakras create potential revenue headwinds. Estimates have gone up ahead of Q4 earnings release. Amgen has positive record of earnings surprises in recent quarters.(You can read the full research report on Amgen here >>>)Other noteworthy reports we are featuring today include Chubb Ltd. (CB), Emerson Electric Co. (EMR) and PACCAR Inc (PCAR).Mark VickerySenior EditorNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>> Today's Must Read NVIDIA (NVDA) Rides on Strong Adoption of GPUs, Partnerships Visa (V) Rides On Growing Cross Border Volume, Expenses High Amgen (AMGN) Well-Poised for Growth on a Solid Pipeline Featured Reports Better Rate, Increased Exposure Aid Chubb (CB), Cat Loss AilPer the Zacks analyst, Chubb is set to grow on better rate environment, increasing exposures and market share, solid capital position and cash generation capabilities. Yet, exposure to cat loss ails. Intelligent Devices Unit Aids Emerson (EMR), High Costs HurtPer the Zacks analyst, Emerson will benefit from strength in Intelligent Devices segment, driven by strong demand in the hybrid and process end markets. However, high costs remain concerning. Solid Expansion Efforts Aid Domino's (DPZ), High Costs AilPer the Zacks analyst, Domino's is benefiting from solid expansion efforts, digitalization and sales-building initiatives. However, inflationary pressures in commodity and labor costs are a concern. TransUnion's (TRU) Recent Acquisition Aids Amid CompetitionPer the Zacks Analyst, the acquisition of Verisk Financial is helping TransUnion to offer enhanced solutions and improve fraud prevention. A high degree of competition restricts pricing power. Organic Growth to Support KeyCorp (KEY) Amid Cost ConcernsPer the Zacks analyst, decent loan growth, higher interest rates and KeyCorp's efforts to strengthen fee income will likely aid the top line. Elevated costs on technology upgrades will hurt profits. Solid Demand Momentum Driving Itron's (ITRI) PerformancePer the Zacks analyst, easing supply chain troubles and operational execution is driving Itron's performance. Higher demand for electric vehicles and distributed energy resource management bode well. Carter's (CRI) Pricing & Other Efforts Appear EncouragingPer the Zacks analyst, Carter's is making pricing efforts to address market conditions and enhance profitability. In fourth-quarter 2023, the company saw improved price realization and profit margins. New Upgrades Aftermarket Parts Growth & Low Leverage to Aid PACCAR (PCAR)The Zacks analyst is optimistic about PACCAR's continued growth in the aftermarket parts, which is a high margin and less cyclic business. Low leverage offers it financial flexibility. Exact Sciences (EXAS) Thrives on Strong Cologuard AdoptionThe Zacks analyst is impressed with Exact Sciences' broad-based momentum in Cologuard adoption by healthcare providers with an all-time high 172,000 Cologuard orders in Q4. Sunoco (SUN) to Gain From Rising Motor Fuel Sale VolumePer the Zacks analyst, Sunoco is cashing in on higher motor fuel sale volume, which is being distributed to convenient stores. This will get translated to increased distributable cash flows. New Downgrades Lower IT Spending to Hurt DXC Technology's (DXC) ProspectsPer the Zacks analyst, DXC Technology's growth prospects might be hurt by soft IT spending as organizations are pushing back their large IT investment plans amid the macroeconomic headwinds. Vishay (VSH) Suffers From Sluggish MOSFET and Opto SegmentsPer the Zacks analyst, Vishay is suffering from weakness in MOSFET and optoelectronics product lines, particularly in the Americas and Asia regions. Competition From Clean Fuel Sources Ail Arch Resources (ARCH)Per the Zacks analyst, Arch Resources' results are adversely impacted as emissions concerns push coal back in comparison with other clean fuel sources. Strict regulations also act as a headwind. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Visa Inc. (V) : Free Stock Analysis Report Emerson Electric Co. (EMR) : Free Stock Analysis Report Amgen Inc. (AMGN) : Free Stock Analysis Report Chubb Limited (CB) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report PACCAR Inc. (PCAR) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}