{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.investors.com/news/sp500-chips-vs-oil-nvidia-now-outweighs-the-sp-500s-entire-energy-sector/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     With Nvidia (NVDA) surging 40% since the end of 2023, hitting a market cap of more than $1.7 trillion on Monday, the tech stock is now valued more than the S&P 500's entire energy sector, which includes Exxon Mobil (XOM) and Chevron (CVX). As of Monday, the 23 stocks that make up the S&P 500's energy sector had a combined market capitalization of $1.585 trillion. That's 8% less than Nvidia's market cap of $1.712 trillion. The market figures were gathered by Charlie Bilello, the chief market strategist at Creative Planning. With computer hardware and chip stocks leading the market's current tech rally, Nvidia has catapulted in value in recent years and now is above the entire combined value of the S&P 500 energy sector. That still leaves it No. 4 among S&P 500 stocks. Microsoft (MSFT), Alphabet (GOOGL) and Amazon.com (AMZN) top the list. Meta Platforms (META), Berkshire Hathaway (BRKB) and Eli Lilly (LLY) weigh in just behind. The S&P 500 energy sector represents around 3.8% of the index's total market cap. S&P 500 energy names includes Exxon Mobil, Chevron, ConocoPhillips (COP), Halliburton (HAL), SLB (SLB) and Occidental Petroleum (OXY) among others. Exxon Mobil's current market cap is $413.5 billion while Chevron's is $287.6 billion. At the end of 2018, Nvidia had a market cap of $81.4 billion compared to Exxon's $289 billion. Meanwhile, Chevron had a market value of $207 billion at the end of 2018. Since then, Nvidia value has rocketed higher as XOM, CVX and other S&P 500 energy sector stocks have moderated. Through Feb. 2, the S&P 500 has notched seven new all-time highs, six of which were recorded in January, placing the S&P 500 on pace to record 72 new highs in 2024, ranking it behind the 1954 and 1995 tallies of 77, according to Sam Stovall, CFRA Chief Investment Strategist. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla A Buy Or A Sell? Get Full Access To IBD Stock Lists And Ratings Learning How To Pick Great Stocks? Read Investor's Corner Is Rivian A Buy Right Now With The Cybertruck Hype? Stocks Erase Most Losses But These Soft Spots Call For Attention 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}