{
    "title": "Here's How High Analysts Think Nvidia Stock Can Rise",
    "date": "2/12/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/TXCX/pressreleases/24010025/heres-how-high-analysts-think-nvidia-stock-can-rise/",
    "text": "Nvidia (NVDA) is among the hottest tech stocks globally and has already created massive wealth for shareholders. Shares of the mega-cap semiconductor designer have surged 241.5% over the last year, and a staggering 15,738% in the last 10 years. Valued at a market cap of $1.78 trillion, let’s see how high NVDA stock can rise in the next 12 months. Nvidia provides graphics computing and networking solutions in the U.S. and other international markets. Its products are used in verticals such as gaming, professional visualization, data center, and automotive, among others. It sells products to original equipment manufacturers, system builders, add-in board manufacturers, independent software vendors, cloud service providers, and auto manufacturers, among others. One of the most popular megatrends now and over the next two decades is expected to be artificial intelligence, or AI. According to a report from Statista, the total addressable market for AI-powered products and solutions is forecast to grow from $241 billion in 2023 to $738 billion by 2030, indicating annual growth rates of over 15%. Nvidia designs and supplies AI chips, and has seen robust demand for these products in the last 15 months. The demand for AI chips has surged exponentially, and the International Energy Agency (IEA) now expects the energy consumed by data centers to double in the next three years. The IEA report states that data centers consume 460 terawatt-hours of electricity each year, amounting to 1% of electricity consumption globally. We can see that the infrastructure required to build AI products at scale is bound to accelerate, making Nvidia among the best investment options right now. In the last 12 months, Nvidia has reported sales of $45 billion, up from $26 billion in fiscal 2023. Despite its massive size, Wall Street expects the tech behemoth to report sales of $59.16 billion in fiscal 2024 (ended in January) and $94.46 billion in fiscal 2025. Investors should stay tuned for the chip giant's upcoming Q4 results, due out after the closing bell next Wednesday, Feb. 21. Due to an asset-light model, Nvidia’s free cash flow has grown to $17 billion in the last four quarters, which is much higher than the free cash flow of $1 billion for rival semiconductor stock Advanced Micro Devices (AMD). Comparatively, its adjusted earnings per share are forecast to touch $115 by the end of fiscal 2028. If Nvidia stock is priced at 25x forward earnings, its shares should be priced at $2,875 in the next four years, indicating an upside potential of 300% from current levels. Ahead of the upcoming earnings report, analysts at leading investment banks, such as Morgan Stanley (MS) and Goldman Sachs (GS), have raised their price targets on NVDA stock. Morgan Stanley raised its price target by $147, and now expects NVDA to touch $750. Meanwhile, Goldman Sachs expects NVDA stock to surge to $800, about a 10% premium from current levels. Out of the 38 analysts covering Nvidia stock, 33 recommend “strong buy,” two recommend “moderate buy,” and three recommend “hold.” NVDA is already trading above its mean target price of $675.52, though the Street-high price target of $1,100 implies expected upside of 51%. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}