{
    "title": "NVIDIA Corporation's (NASDAQ:NVDA) Stock's On An Uptrend: Are Strong \nFinancials Guiding The Market?",
    "date": "3/17/2024",
    "url": "https://finance.yahoo.com/news/nvidia-corporations-nasdaq-nvda-stocks-130015727.html",
    "text": "NVIDIA's (NASDAQ:NVDA) stock is up by a considerable 75% over the past three months. Given the company's impressive performance, we decided to study its financial indicators more closely as a company's financial health over the long-term usually dictates market outcomes. In this article, we decided to focus on NVIDIA's  ROE. Return on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. In other words, it is a profitability ratio which measures the rate of return on the capital provided by the company's shareholders. See our latest analysis for NVIDIA The formula for ROE is: Return on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity So, based on the above formula, the ROE for NVIDIA is: 69% = US$30b ÷ US$43b (Based on the trailing twelve months to January 2024). The 'return' is the income the business earned over the last year. So, this means that for every $1 of its shareholder's investments, the company generates a profit of $0.69. Thus far, we have learned that ROE measures how efficiently a company is generating its profits. We now need to evaluate how much profit the company reinvests or \"retains\" for future growth which then gives us an idea about the growth potential of the company. Assuming everything else remains unchanged, the higher the ROE and profit retention, the higher the growth rate of a company compared to companies that don't necessarily bear these characteristics. Firstly, we acknowledge that NVIDIA has a significantly high ROE. Second, a comparison with the average ROE reported by the industry of 14% also doesn't go unnoticed by us. So, the substantial 39% net income growth seen by NVIDIA over the past five years isn't overly surprising. We then compared NVIDIA's net income growth with the industry and we're pleased to see that the company's growth figure is higher when compared with the industry which has a growth rate of 29% in the same 5-year period. The basis for attaching value to a company is, to a great extent, tied to its earnings growth. What investors need to determine next is if the expected earnings growth, or the lack of it, is already built into the share price. Doing so will help them establish if the stock's future looks promising or ominous. One good indicator of expected earnings growth is the P/E ratio which determines the price the market is willing to pay for a stock based on its earnings prospects. So, you may want to check if NVIDIA is trading on a high P/E or a low P/E, relative to its industry. NVIDIA has a really low three-year median payout ratio of 5.2%, meaning that it has the remaining 95% left over to reinvest into its business. This suggests that the management is reinvesting most of the profits to grow the business as evidenced by the growth seen by the company. Besides, NVIDIA has been paying dividends for at least ten years or more. This shows that the company is committed to sharing profits with its shareholders. Existing analyst estimates suggest that the company's future payout ratio is expected to drop to 0.5% over the next three years. Still forecasts suggest that NVIDIA's future ROE will drop to 51% even though the the company's payout ratio is expected to decrease. This suggests that there could be other factors could driving the anticipated decline in the company's ROE. On the whole, we feel that NVIDIA's performance has been quite good. Particularly, we like that the company is reinvesting heavily into its business, and at a high rate of return. Unsurprisingly, this has led to an impressive earnings growth. Having said that, the company's earnings growth is expected to slow down, as forecasted in the current analyst estimates. To know more about the company's future earnings growth forecasts take a look at this free report on analyst forecasts for the company to find out more. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}