{
    "title": "Poroste Nvidia až do pomyslného nekonečna?",
    "date": "3/5/2024",
    "url": "https://medium.seznam.cz/clanek/burzovnisvet-cz-poroste-nvidia-az-do-pomyslneho-nekonecna-49865",
    "text": "Tlačítkem Sledovat můžete odebírat oblíbené autory a témata. Články najdete v sekci Moje sledované. Ocenění akcií NVDA není příliš vysoké… Společnost Nvidia (NASDAQ:NVDA) nadále dosahuje vynikajících finančních výsledků, protože je stále vedoucí společností na trhu s čipy, které se používají k výrobě umělé inteligence. Přitom její ocenění, založené na průměrných odhadech analytiků pro budoucnost společnosti, není příliš náročné. V důsledku toho očekávám, že akcie NVDA v následujících měsících a letech výrazně porostou. Nadále se však domnívám, že společnost čelí významným hrozbám, které by mohly v nepříliš vzdálené budoucnosti způsobit výrazný pokles akcií společnosti Nvidia. Vzhledem k těmto bodům doporučujeme investorům, kteří hledají titul, který jim poskytne expozici jak v sektoru čipů, tak v tzv. „Velkolepé sedmičce“ společností z USA, aby si koupili malé množství akcií NVDA. Společnost NVDA dosáhla dobrých výsledků, když zůstala lídrem v oblasti čipů s umělou inteligencí V minulém čtvrtletí vzrostl nejvyšší zisk výrobce čipů o 265 % oproti stejnému období předchozího roku na 22 miliard USD, zatímco zisk na akcii bez započtení některých položek vyskočil meziročně o neuvěřitelných 486 %. V prvním čtvrtletí letošního roku navíc NVDA očekává, že její tržby vzrostou na „24 miliard dolarů, plus minus 2 %“. A co víc, podle Bank of America prodala Nvidia ve čtvrtém čtvrtletí obrovský podíl čipů grafických procesorů, které se používají k vytváření umělé inteligence, a to 95 %. Za zmínku stojí také to, že Nvidia v minulém čtvrtletí prodala 900 000 takových čipů, což představuje více než 100% nárůst oproti počtu procesorů, které dodala svým zákazníkům ve 4. čtvrtletí roku 2022. Společnost Nvidia čelí ale také významným hrozbám Bank of America rovněž upozornila, že počet prodaných GPU jednoho z konkurentů společnosti Nvidia, společnosti AMD (NASDAQ:AMD), se ve 4. čtvrtletí oproti 3. čtvrtletí „více než ztrojnásobil“. Mezitím, jak jsem již poznamenal v minulých sloupcích, čipy s umělou inteligencí společnosti Intel (NASDAQ:INTC), známé jako procesory Gaudi, se zřejmě stávají poměrně populárními, neboť společnost oznámila, že na konci loňského roku měla na tyto čipy nevyřízené objednávky v hodnotě více než 2 miliardy dolarů. Vzhledem k těmto rostoucím konkurenčním hrozbám je pravděpodobné, že extrémně vysoké ceny, které si Nvidia účtuje za své čipy umělé inteligence, spíše dříve než později klesnou. Herní čipy přitom stále generují významnou část tržeb společnosti Nvidia, neboť v minulém čtvrtletí tvořily 2,9 miliardy dolarů jejích příjmů. Pro ty, kdo uvažují o nákupu akcií NVDA, proto jistě stojí za zmínku, že společnost Electronic Arts (NASDAQ:EA), významný výrobce videoher, nedávno zveřejnila, že propustí 5 % svých zaměstnanců, zruší hru Star Wars, kterou vyvíjela, a zavře „jedno ze svých herních vývojářských studií“. Kromě toho společnosti Microsoft (NASDAQ:MSFT), Sony (NYSE:SONY) a Tencent (OTCMKTS:TCEHY) v posledních měsících snížily počet zaměstnanců ve svých videoherních odděleních o stovky. Ve světle tohoto vývoje se domnívám, že poptávka po videohrách by v tuto chvíli mohla významně klesat. V takovém případě by mohla výrazně klesnout i poptávka po herních čipech společnosti Nvidia. Za zmínku stojí také to, že několik velkých zákazníků společnosti Nvidia, včetně společností Amazon (NASDAQ:AMZN) a Microsoft, vyvíjí vlastní čipy s umělou inteligencí. Z dlouhodobého hlediska tyto projekty pravděpodobně výrazně zatíží poptávku po grafických procesorech Nvidia a jejich ceny. Herní čipy společnosti Nvidia se dále používají také k výrobě kryptoměn. Ačkoli hodnota kryptoměn v posledních týdnech výrazně stoupá, jejich ceny jsou historicky poměrně volatilní. V důsledku toho bych se nedivil, kdyby ceny kryptoměn někdy v nedaleké budoucnosti výrazně klesly. Takový jev by pravděpodobně způsobil výrazný pullback akcií NVDA. Ocenění a konečný verdikt ohledně akcií NVDA Výhledový poměr ceny a zisku společnosti Nvidia ve výši 33,3 není vzhledem k jejímu obrovskému růstu a vysokému pákovému efektu v souvislosti s boomem umělé inteligence příliš vysoký. Přesto vzhledem k významným hrozbám, kterým firma čelí, doporučuji dlouhodobým investorům omezit expozici vůči akciím na 5 % nebo méně. Máte na tohle téma jiný názor? Napište o něm vlastní článek. Texty jsou tvořeny uživateli a nepodléhají procesu korektury. Pokud najdete chybu nebo nepřesnost, prosíme, pošlete nám ji na medium.chyby@firma.seznam.cz. Reklama Reklama Stačí mít účet na Seznamu a můžete začít psát. Ty nejlepší články se mohou zobrazit i na hlavní stránce Seznam.cz Reklama Copyright © 1996–2024, Seznam.cz, a.s. "
}