{
    "title": "Wall Street Hunts For Next AI Gold Mine After Nvidia's Meteoric Rise - \nMicrosoft (NASDAQ:MSFT), Apple (NA",
    "date": "3/1/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/37414655/wall-street-hunts-for-next-ai-gold-mine-after-nvidias-meteoric-rise",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The stock market’s growing interest in artificial intelligence (AI), fueled by NVIDIA Corp NVDA, has set off a race among money managers to identify other companies leveraging the technology. What Happened: Nvidia’s stock, which has been on a meteoric rise, has surged by approximately 60% this year, following a threefold increase in 2023. This has propelled the company’s market value to nearly $2 trillion, making it the third-largest U.S. company by market cap, after Microsoft Corp MSFT and Apple Inc AAPL, Reuters reported. As a result, Wall Street is now on the lookout for other AI-focused companies, with the consensus being that AI is here to stay. The surge in AI interest has driven the Nasdaq Composite Index to a record high, with the S&P 500 also reaching a new high. See Also: Floki Staking Hits Record $105M, Surges Ahead Of Dogecoin, Pepe Coin, Shiba Inu In Total Locked Value Goldman Sachs analysts have noted a significant increase in AI mentions during conference calls in the fourth quarter, indicating a growing fixation on AI. A Morgan Stanley survey also suggests that 2024 is “a Year of Investment for AI,” with AI/machine learning being named as the top priority for the first time by chief information officers. \"It’s not a fad,” said Francisco Bido, senior portfolio manager for F/m Investments’ Large Cap Focused Fund. “There are too many … cases where companies can make really good use of the technology to enhance both their top and bottom lines.\" According to portfolio manager Zehrid Osmani, the Martin Currie U.S. Unconstrained Fund has allocated nearly 10% of its assets, the maximum allowed for one stock, to Nvidia. Osmani is confident that Nvidia will sustain its competitive edge by investing more heavily in research and development compared to its rivals. Why It Matters: The surge in AI-related stocks, particularly Nvidia, has raised concerns about a potential bubble in the market. Renowned finance professor Jeremy Siegel recently warned of a possible bubble forming, although he acknowledged that it is impossible to predict when it will burst. However, other experts like tech venture capitalist Gene Munster have dismissed fears of an imminent bubble burst, pointing to the strong performance of tech giants and the AI sector. The recent strong performance of mid-cap AI companies like c3.ai and Microsoft’s high demand for its Copilot AI tool has been cited as early proof of an accelerating AI revolution. Despite the risks, many investors are still confident in sticking with big Nvidia positions. Read Next: This Trader Turned $2,708 Into $3.25 Million With Trump-Related MAGA Memecoin Image: Pete Linforth from Pixabay Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}