{
    "title": "Forget Nvidia: Billionaire Investors Are Selling It and Buying These 2 \nArtificial Intelligence (AI) Stocks Instead",
    "date": "3/12/2024",
    "url": "https://finance.yahoo.com/news/forget-nvidia-billionaire-investors-selling-090600040.html",
    "text": "Over the past 30 years, one of Wall Street's few constants is that there's always a next-big-thing trend or innovation garnering the attention of professional and everyday investors alike. At the moment, no trend is captivating the attention and pocketbooks of investors quite like artificial intelligence (AI). When discussing \"AI,\" I'm talking about the use of software and systems to handle tasks that humans would normally manage. However, the true value of AI is seen with the incorporation of machine learning, which allows AI software and systems to evolve over time so they can become more efficient at their tasks. Last year, researchers at PwC released a report (\"PwC's Global Artificial Intelligence Study: Exploiting the AI Revolution\") that suggested AI would add $15.7 trillion to the global economy by the turn of the decade. This would include a $6.6 trillion increase in productivity, as well as $9.1 trillion derived from consumption-side effects. The sector- and industrywide appeal of AI isn't lost on Wall Street's smartest and most-successful money managers. Billionaire investors from many of the most-watched investment funds have been strategically moving their capital into and out of certain artificial intelligence stocks. What's particularly noteworthy is that billionaires have been active sellers of the face of the AI movement -- semiconductor stock Nvidia (NASDAQ: NVDA) -- while piling into two other AI stocks. Following the end of every quarter, institutional investors with at least $100 million in assets under management are required to file Form 13F with the Securities and Exchange Commission. These 13Fs provide investors with detailed snapshots of what the top asset managers have been buying and selling. Based on the latest round of 13F filings, eight prominent billionaires put Nvidia on the chopping block, including (total shares sold in parenthesis): Israel Englander of Millenium Management (1,689,322 shares) Jeff Yass of Susquehanna International (1,170,611 shares) Steven Cohen of Point72 Asset Management (1,088,821 shares) David Tepper of Appaloosa Management (235,000 shares) Philippe Laffont of Coatue Management (218,839 shares) Chase Coleman of Tiger Global Management (142,900 shares) David Siegel and John Overdeck of Two Sigma Investments (30,663 shares) Nvidia has become what I regularly refer to as the \"infrastructure backbone\" of the AI movement. Its A100 and H100 graphics processing units (GPUs) are a staple of high-compute data centers. Demand has, thus far, handily outpaced supply of Nvidia's chips, leading to off-the-scale pricing power that's sent the company's data center sales through the roof. But there's also no shortage of reasons to believe that the best for Nvidia has come and gone. In addition to growing external competition from the likes of Intel and Advanced Micro Devices, Nvidia could contend with a significant amount of internal competition for AI chips from its own top customers. Microsoft, Meta Platforms, Amazon (NASDAQ: AMZN), and Alphabet, collectively account for around 40% of Nvidia's sales, yet all four companies are developing high-powered AI chips of their own. Billionaires might also be turned off by the regulatory headwinds Nvidia is dealing with. An initial round of export restrictions to China, the world's No. 2 economy by gross domestic product, prompted Nvidia to develop the toned-down A800 and H800 chips. However, U.S. regulators ultimately restricted the export of these chips to China, as well. China is a key market for Nvidia, and these restrictions threaten to reduce its sales by billions of dollars every quarter. The valuation doesn't make much sense, either. Nvidia is nearing the same levels that Amazon and Cisco Systems peaked at during the dot-com bubble, based on trailing-12-month sales. We've simply never seen a market-leading business trade at such a premium to its sales for an extended period of time. It shouldn't be that surprising that billionaires have been selling Nvidia stock. The first AI stock that had billionaire money managers completely forgetting about Nvidia during the December-ended quarter is China-based Baidu (NASDAQ: BIDU). Though not all billionaire investors will put their funds' money to work in China stocks, eight billionaires were buyers of Baidu (say that three times fast) during the fourth quarter, including (total shares purchased in parenthesis): Jeff Yass of Susquehanna International (290,154 shares) Israel Englander of Millennium Management (147,481 shares) Steven Cohen of Point72 Asset Management (135,600 shares) Ken Griffin of Citadel Advisors (80,815 shares) Jim Simons of Renaissance Technologies (47,000 shares) David Siegel and John Overdeck of Two Sigma Investments (38,966 shares) Philippe Laffont of Coatue Management (5,545 shares) Baidu's utilization of AI can be seen in two of its fastest-growing segments: cloud and intelligent driving. The company's AI Cloud can allow merchants to use generative AI solutions to tailor ads to individual customers. Meanwhile, Apollo Go is the world's most-successful autonomous ride-hailing service, with accumulated rides on public roads surpassing 5 million since inception. AI-fueled ventures are helping Baidu's non-online marketing segment grow by a double-digit percentage more often than not. What billionaire investors might appreciate with Baidu, in relation to Nvidia, is that its foundational operating segment would likely prevent it from tumbling if the AI bubble bursts. Baidu's internet search segment has accounted for between 60% and 85% of China-based internet search share over the past nine years. Having the clearly dominant search engine in China should afford Baidu strong ad-pricing power in most economic climates. Billionaires are likely also attracted to Baidu's minuscule valuation. Even factoring in the regulatory risks of investing in China-based companies, Baidu is valued at just 8 times forward-year earnings and less than 2 times trailing-12-month sales. It's a far cry from the mammoth valuation Wall Street has assigned to Nvidia, and presumably places a safe floor beneath Baidu's stock. The other AI stock that had billionaires forgetting about Nvidia is none other than \"Magnificent Seven\" component Amazon. During the December-ended quarter, eight successful billionaire investors piled into Amazon stock, including (total shares purchased in parenthesis): Ken Griffin of Citadel Advisors (4,321,477 shares) Jim Simons of Renaissance Technologies (4,296,466 shares) Chase Coleman of Tiger Global Management (947,440 shares) Ken Fisher of Fisher Asset Management (888,369 shares) David Siegel and John Overdeck of Two Sigma Investments (726,854 shares) Steven Cohen of Point72 Asset Management (462,179 shares) Israel Englander of Millennium Management (85,532 shares) Amazon is incorporating AI solutions into its operations in more ways than can be counted here. Some of the more intriguing applications include leaning on generative AI solutions within its cloud infrastructure services platform Amazon Web Services (AWS) to help merchants personalize advertising to consumers, as well as relying on generative AI to improve the quality of product listings for merchants. Although most people are familiar with Amazon because of its market-leading e-commerce platform, online retail sales contribute very little in the way of operating cash flow or profits since it's a low-margin segment. The lion's share of the cash flow Amazon generates can be traced back to its ancillary operations: AWS, subscription services, and advertising services. AWS is the critical cog that's powering Amazon's cash flow higher. Enterprise cloud spending is still in its early stages of growth, which suggests AWS can sustain its leading share of global cloud infrastructure service spending. Despite only accounting for a sixth of Amazon's net sales, AWS was responsible for two-thirds of Amazon's operating income last year. Amazon is also historically cheap, when compared to Nvidia. Shares are currently valued at less than 13 times consensus cash flow per share for 2025, which represents a 44% discount to Amazon's average multiple to cash flow over the prior five-year period. Should you invest $1,000 in Baidu right now? Before you buy stock in Baidu, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Baidu wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 11, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Sean Williams has positions in Alphabet, Amazon, Baidu, Intel, and Meta Platforms. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Baidu, Cisco Systems, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Forget Nvidia: Billionaire Investors Are Selling It and Buying These 2 Artificial Intelligence (AI) Stocks Instead was originally published by The Motley Fool Related Quotes "
}