{
    "title": "SOUN Stock: The AI Voice Revolution Starts Here, and Nvidia Knows It",
    "date": "3/23/2024",
    "url": "https://www.tradingview.com/news/investorplace:0245a11ba094b:0-soun-stock-the-ai-voice-revolution-starts-here-and-nvidia-knows-it/",
    "text": "In 2023 and 2024, the rising tide has been lifting generative artificial intelligence boats. Nvidia NVDA is an obvious beneficiary, but SoundHound AI SOUN stock has caught people’s attention. You may have heard about Nvidia’s blowout fourth-quarter fiscal 2024 financial report. Nvidia isn’t the only AI company with impressive revenue growth. For a well-rounded AI market exposure, invest in both Nvidia and SoundHound AI. A Famous Company Invested in SoundHound AI Nvidia is a kingmaker among AI-related businesses, so it speaks volumes if Nvidia invests in an AI company. Prospective shareholders should be interested to know that Nvidia invested $3.7 million in SoundHound AI. Why would Nvidia pour so much money into SoundHound AI? Perhaps Nvidia’s management envisions robust growth for the niche market that SoundHound AI serves. SoundHound AI CEO Keyvan Mohajer recently explained in an interview that, while Nvidia creates the “infrastructure for AI,” SoundHound “puts that infrastructure to good use. So the synergy is very clear.” This synergy means that there’s room for both Nvidia and SoundHound AI to ride the gen-AI trend higher. SoundHound AI’s specialization is AI-powered voice software, which businesses could use for customer service. This could be a largely untapped, niche market. Mohajer stated that there’s a “$100 billion opportunity” as SoundHound AI’s products enable voice-AI functionality in televisions and other devices, and even automobiles. SoundHound AI’s Revenue Growth Is Undeniable Still, discerning investors don’t just want to see opportunities. They also want to see improvement in the hard data. As it turns out, SoundHound AI has the data to back up the bull case for SOUN stock. Much like Nvidia, SoundHound AI is a revenue grower. Specifically, in the fourth quarter of 2023, SoundHound AI’s revenue increased 80% year over year to $17.1 million. Furthermore, SoundHound AI’s gross margin improved by 6 percentage points YOY to 77%. This capped off an impressive performance for the full year of 2023, in which SoundHound AI’s gross margin increased by 6 percentage points YOY to 75%. While there is still room for SoundHound to improve its fundamentals, its full-year 2023 net earnings loss of 40 cents per share is certainly better than the company’s net loss of 74 cents per share from 2022. SOUN Stock Could Be a Worthy Add-on AI Investment SoundHound AI shares have rapidly gained value this year. The upward momentum could continue throughout 2024 as businesses discover the many use cases for gen-AI voice software. This doesn’t mean investors have to choose SoundHound AI or Nvidia. It’s entirely possible to own both NVDA stock and SOUN stock, even if Nvidia is the better established company. Going forward, you should monitor SoundHound AI’s progress as a notable, Nvidia-backed up-and-comer. On the date of publication, David Moadel did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. David Moadel has provided compelling content – and crossed the occasional line – on behalf of Motley Fool, Crush the Street, Market Realist, TalkMarkets, TipRanks, Benzinga, and (of course) InvestorPlace.com. He also serves as the chief analyst and market researcher for Portfolio Wealth Global and hosts the popular financial YouTube channel Looking at the Markets. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}