{
    "title": "A biotech stock that could deliver 20x gains… because of AI",
    "date": "3/20/2024",
    "url": "https://www.curzioresearch.com/a-biotech-stock-that-could-deliver-20x-gains-because-of-ai/",
    "text": "I kick things off with some thoughts on NVIDIA’s (NVDA) GPU Technology Conference (GTC). In short, it was incredible and I explain why NVDA is on an island all by itself when it comes to dominating AI. I breakdown why AI isn’t even out of the 1st inning in terms of growth and why it will disrupt every sector of our economy. Yes, every single sector. I’m so excited about the investment opportunities in AI that I’ve created a new service—Curzio AI—that focuses on the technology. Join me on Tuesday, March 26 at 7 p.m. for a FREE presentation and LIVE Q&A session. Sign up for free at www.curzioai.com. I’ll share how individual investors can make a fortune as small cap companies who are using AI right now, become market leaders. In fact, my latest recommendation is a small biotech company that is aiming to disrupt one of the longest and costliest processes in biotech. biotech. This stock could rocket 20x from current levels. Plus, March Madness—the most exciting event in sports starts tomorrow… Check out my special podcast on YouTube where I breakdown this year’s NCAA Men’s Basketball Tournament. I bet you will be shocked by my final four picks. Submit your questions for the Curzio AI event on Tuesday, March 26 at 7 p.m.. This transcript was automatically generated. Announcer: Wall Street Unplugged looks beyond the regular headlines heard on mainstream financial media to bring you unscripted interviews and breaking commentary direct from Wall Street right to you on Main Street. Frank Curzio: How’s it going out there? It’s March 20th. I’m Frank Curzio. This is the Wall Street Unplugged podcast where I break down the headlines and tell you what’s really moving these markets. On today’s show. My final four picks for the NCA tournament, which include  no number one seeds, believe it or not. Yes, that means no Yukon, the official launch  of our Cursio AI newsletter. Also gonna talk about how to find the next  Microsoft’s Apples, Googles within the AI space. But first, let’s begin with the latest from  NVIDIA’s GTU Conference. Holy s**t, that’s the only two words I have to say. So Nvidia and CEO Jen-Hsun Huang  introduced a new hardware. And more importantly, because NVIDIA’s always seen  as a hardware company, but there’s software  and those developments coming in 2024 and beyond. Now, I’m sure most  of you never heard of this conference before. That was even as far as last year. I think it’s been going on for 15 years now. So it’s multi-day conference. Now it’s become the biggest day in tech  where it’s surpassing Apple’s iPhone launch,  which Tim Cook hosts every September. But there was 11,000 people that attended the conference. Most of ’em are top developers, creators. Another 20 30,000 of her that attended virtually. And the CEO Jen-Hsun did not disappoint. I’m gonna give a shout out. Congrats to Cramer  who interview Jen-Hsun at the conference,  which I thought was really good, especially  after he put pressure on the CEO to split his stock  and said, what are you getting to split?  And he’s like, well, I’d like to split and we’ll see. It’s better for the employee. So I guess you could expect  a split coming in the stock, which again,  has no fundamental value,  but means a lot in terms of the stock price. ’cause there’s proof of that. So that’s all that matters, right?  One is higher stock price gonna give  access to more people buying. And you’re gonna have people, I’m a fundamental analyst. Nothing changes fundamentally, okay? Nothing. But there is change in sentiment when it comes to the price. And when companies split,  you normally see over the next six months,   So more people, more access,  he says, especially for his employees. But I thought the interview was pretty good. You could tell a gym and, and a lot of us, right?  It’s like a brand new market. Like what do this mean? What do these chips mean?  What’s does software mean? What’s going on?  Everyone’s learning, trying to learn as fast as they can  because there’s so much money going into the sector  and it’s still in its very early stages. But the biggest announcement came  with Nvidia introduced a new Blackwell B 200 chip. Okay? I don’t wanna get technical here,  but last year at this conference,  Nvidia introduced a hopper, which is h and it’s H 100 chip. And they said in the middle of the year, we’re gonna have an  upgrade to that, which is the H 200 chip,  which is the most powerful. These are the most powerful chips in the  world, used to power everything. AI, what everyone’s buying. And the H 200, just to let you know,  is just starting to ship now. And they’re talking about the Blackwell B 200 ship. That’s how far two generations in front of everyone. And when you look at this Blackwell trip, it it, it powers  trillion parameters, multi-mode models. And I say, what the hell’s a parameter?  It’s basically how data gets transformed. And if you look at a chat, GBT, which was launched in 2018,  amazing, one of the biggest technology launches of our time. This had 117 million parameters  to be looking at CHATT four, which is one  of the most powerful AI systems in the world. Which by the way, is not even the fastest. Claude three is the fastest right now, has close  to a hundred IQ chat. GT put that in perspective. The average person in the  United States has an IQ a little bit less than a hundred. That’s where chat GT is right now  that uses 1. 7 trillion parameters. The new Blackwell chip is gonna be able  to power 10 trillion parameters. So imagine by 2025 ChatGPT being  five times faster, right?  Just one year. I mean,  I’m not even gonna throw in the hyper parameters,  which is the machine learning on top of that influence  how the machines learn, how they perform,  the new algorithms by themselves. But when you look at Nvidia,  they’re on an island by themselves. It used to be viewed as a hardware company. It’s not. It’s creating all this software around it. And it, it’s like having 15 individual companies  because they’re targeting every single industry  and they’re building these systems around their chips. And as you build this infrastructure, in order for you  to use a competitor, you have  to destroy all the infrastructure and start from scratch. And if you do that, look what happens. Look what happened to Apple. Great announcement with Google, powering the AI  through their smartphone. Look what happens to companies that are falling behind. You’re going to see it because I’m seeing it. I’m seeing it in so many small mid-caps  that are using this technology when everyone’s saying  they’re getting it, and these companies have been doing it  for two years and you’re seeing the  results, it’s incredible. When I look at Nvidia  and what they’re doing, creating this moat  and partner, it’s a different model. I love different models. I love studying  models for businesses. I love it. It’s one of my favorite things to do. ’cause you realize, you know,  what the hell is Netflix doing?  Why are they trading at 200 times pe you know, instead  of looking and saying, which I do now,  why is company trading at a premium?  What do they offering to deserve that premium?  You know, back in the day to be like 200  times for earnings, you’re crazy. I’m not even going near it. Well, there’s probably a reason  why it built. Look at where Nvidia was, 10, 15 years. Nvidia was, look where, where Netflix was, look  where all these companies were with these massive PEs  and how they trillion dollar companies today. It’s where they’re going. But the model  that they have now, and it comes Nvidia, it, it, it’s,  it goes against a traditional technology model,  which is Meta Google, Apple. I have to f*****g own everything and keep everything. It’s mine, mine, mine. It’s why the metaverse, which is the omniverse now,  which they’re talking about, which I’ll get to in a minute,  why it hasn’t fully developed. ’cause they want full control. They want control  of everything and they have it. That’s not what the internet was made for,  but they were able to do it and control everything. And we really didn’t realize that until COVID,  until election season. And, and what you’re allowed to say  and what you’re not allowed to say before you get kicked off  these platforms where you thought it was your content,  you owned it and you didn’t. That’s not what NVIDIA’s doing. They’re building these systems to say they’re  proprietary to your business. You own it. We’re gonna build everything for you. We’re gonna make it as easy as possible. We’re gonna tailor it to your business. And it’s not like, here’s a chip, here you go. Everybody go buy it. It’s what do you need?  How can we build these systems? How much power do you need?  I mean, it’s just such light years in terms of even  how much power these chips use, which is going to,  they just, they’re looking ahead constantly looking ahead,  five years, 10 years ahead where you can’t say, well,  NVIDIA’s chips, well why use them?  Because they, they require so much more power. No, they don’t. So when I, I, I look at what they’re doing in terms  of the model, in terms of the partnerships. Let’s just partner with everyone this way. Everyone has to flow through their systems. All the cloud companies hold everything. Let’s flow through Nvidia, let’s use Nvidia. They’re trying to create their own chips,  but they can’t create the chips  and everything around it that makes these things work. And the time they figure it out, they’re gonna have  to destroy their whole entire model  and build it from scratch, which is gonna force them  to be light years behind the competition. Which we know what happens,  especially in this incredibly fast moving industry where  holy cow, every week new announcements come out,  chat t four’s the greatest thing ever. And it’s not even the fastest  and the most productive right now. Claude three already surpassed them. That’s a lot of technical jargon. You’re like, what?  Yeah, Frank, I just don’t get it. I, I understand. Well, lemme break this down for you. Make it really, really simple. AI is not even in the first inning of its growth. It’s about to change the landscape of every single industry,  every industry, finance, healthcare, software development,  gaming, supply chain, social media infrastructure,  industrials, agriculture, e-commerce,  transportation, everything. And I’m seeing it implemented in  across all these industries. As you take a deep dive in the financials, what I do,  trade a little bit, but traders look at prices  and they say, wow, look at the price of Nvidia  and how far it’s gone up. It’s parabolic and it’s in a bubble. Actually, Nvidia, you could argue, was in a much, much,  much bigger bubble three months, six months, a year ago. And when you’re looking at the,  at at again, they’re just looking at the price. They’re not looking at earnings exploding,  they’re not looking at margins. They’re not looking at at, you know, sales exploding  from 5 billion to 20 billion and a quarter. Are you kidding me? And bubbles have created,  expectations of what’s gonna happen in the future. It’s not based on all this money coming in. Now. These guys have the numbers. If you look at the historical PE over the last 10 years  for Nvidia it’s probably 50 ish, 45. It’s trading at 35 times forward earnings. Right now it’s cheaper now  that it’s been in the last 3, 4, 5 years outside  of when a crash probably in 2022, really quick. Now you’re calling it a bubble. So  by focusing on all these markets  and not targeting one thing here, one thing here,  one consumer, one business, it’s a hundred  trillion dollar total addressable market that they dominate. So when you see those forecast call for AI  to add 15 trillion to GDP by 2030, I think  that forecast is gotta come to fruition  by 2027, much, much quicker. And AI is such a big trend. Sometimes it’s difficult to see,  to understand the actual impact it could have. It requires looking into the future, having an imagination  of where we could actually go. I mean, similar to the internet,  the early nineties was 30 years ago. Holy s**t, am I old? Where from, Hey,  you better get a website or you’re gonna be left out  and you know, I don’t wanna find a  website or whatever to everyone. You better have an email then it’s text smartphones   social media, cryptocurrencies. Did you see all that stuff? Did you see it in 2010?  Did you even see it seven years ago  of where we would be today?  Trillion dollar companies. I mean, it’s such a fast moving market. It it’s really incredible when you look at it, it,  there’s an incredible chart here that, that I wanna try  to bring up and lemme see if I could find it really quick. And it just shows the, the forecasts  when you’re looking at the forecast of where they were  predicting this, this adoption compared to right now. And when you look at it, it, it’s, this is, so this is  artificial general artificial intelligence, right?  So when you look at a A GI  and what is a GI, so a GI is  how a computer, like once we hit a GI, it means  that a computer’s operating exactly like a  human pretty much. Now I’m gonna show this  to you and bring this up. So if you’re watching this on YouTube,  it says AI accelerated faster than forecast. If you look at 2019, okay, so this is pre,  g BT three average, right?  So this is, this is before catchy two’s launched 2019. They were predicting 80 years before we hit that,  before we hit a GI this is in 2019. By 2020 they updated that to 50 years  by 2021, it’s 34 years. By 2022 it’s 18 years. And now in 2023, again, we just started 2024,  they’re forecasting it to happen in eight years  based on this trend of being wrong. If you take that trend of being wrong,  we’re gonna get to that point in two years. In two years you might be saying, what the hell?  I mean, Frank, what the hell does that mean?  So if you have a computer that can do  and perform all the tasks that you wanted to  and act like a human, just imagine, like from,  from my perspective, imagine having, a, a, you know,  three frank COOs  and what you could achieve with that in terms of, okay,  I’m calling everyone, right?  I, I like everyone subscribed to, to new services. Now we offer that in,  and you know, I’ll have a 10 minute  phone call with new subscribers. It’s a service that we offer. I don’t think anyone else offers a guy in the name  of the door’s gonna actually talk to you  because I’m not looking for a quick sale. I’m looking to establish a relationship with you. And a lot of those times those relationships are amazing  ’cause everybody’s brilliant in some way. I believe. I truly believe that there’s people, I know a lot  of stuff that I don’t know, I’m pretty good at  what I do when it comes to stocks. This why you listen to me and try  to provide you ideas and things like that. But imagine having someone, having this system, being able  to, to to learn e everything that I do  and be able to answer questions, be able to, to, you know,  focus on customer service. I imagine how important that would be if you have a problem  with customer service and,  and the guy you know,  that’s basically talking has his name on the door,  or you’re gonna get the exact thing that he would say. I mean, it’s hard to comprehend where  we’re so early in this stage. It’s going to keep learning, keep learning, keep learning. And and I think Jensen said, that, you know,  Moby Dick could be read in in a second. Okay, that’s awesome. Holy cow. It could be read in less than a second. What’s,  what’s unbelievable to me is  after it reads it in a second, it’s gonna be able  to answer any single question you have on that book. Try to think about that. That may require you taking mushrooms  or smoking a joint or whatever. But if you sit down and really think about this  and then you start researching on the internet, this is  where I’ve been for the past few months  and going in rabbit holes, I’m like, holy s**t,  where this is going to lead to. And the funny thing is, I didn’t really get it too long ago. I was like, man, AI and these big company, it’s not that. I mean, you know what I see coming, I mean Omniverse,  one’s called the metaverse, right?  Everybody, it’s here. You can create  players robots that that act  and function just like players  that are gonna be in this world with you 3D rendering,  which, you know, I sampled this technology  and it was with Steph Curry,  it was a ba it was a real basketball game that was taped for  that was a week old and it had a consumer electronics show. And you put the glasses on and you’re not an avatar,  you almost like an invisible camera. And you can go anywhere inside the game. You’re playing Cleveland  and I’m on the court, I’m watching Steph Curry,  like cross dribbling and, and and,  and you know, just, you know, go to the hole and,  and I’m at half court, I’m turning around,  it’s behind me, it’s in front of me. But that whole 3D rendering and stuff, you need faster. You actually need faster speeds for that. But that’s coming as well. And when it does, what is that gonna provide?  It’s gonna provide me to put on, you know,  whatever headset you want  and actually be at the Super Bowl,  being able to watch it anywhere. Being able to interact with people in real time. That is coming, that is coming  being anywhere, any place you wanna be. I mean you have that. And,  and again, I’m saying I sample these systems. My daughter has a, the new, vision quest  and it’s incredible right now. But just the interaction where you want more people. The reason why the Fortnite and the Roblox so big. ’cause you got these so many people  and Call of Duty so many people in there. But imagine having those people where they’re,  they’re basically different personalities,  but they’re built by these robots and bots. Now you have this real world interaction,  different personalities, different everything. It’s gonna create more  and more people wanting to be in that world. Spatial computing, whatever you wanna call it. But it, it’s like, you know, the the, this digital  universe on top of our universe, which is incredible. It’s incredible. Research is stuff. It’s unbelievable. I mean, you think AI is not around. AI is, it’s not even in the smartphone yet. It’s not even in the smartphone. I mean that, what was it yesterday,  the day before Apple announced?  Oh, Google, okay, it’s not even in the smartphone. So now you’re gonna have a whole entire refresh cycle  of an industry that’s basically peaked in terms of sales. Everybody has a smartphone now. It’s hard to upgrade because they’re just so freaking good. You don’t need to, you know, Apple needs  to put out a phone every year, but you  really don’t need a phone every year. They force you to get a phone every three years, right?  They, you know, kinda admitted that and got sued for that. I mean, I know owning a phone store, it’s not even computers  yet, like the standard. It’s very little and only 5%  of companies are currently using AI within their businesses. Only 5%. And people are like, it’s a bubble. Listen, there’s some stocks that are in a bubble. A quick hint. Uh, anyone  who has AI in their name isn’t in a bubble. You shouldn’t have to put your AI in your name. But the ones that are currently using AI,  they’re seeing earnings and sales explode. And it’s not a lot of companies, it’s just starting. But not only are they seeing the,  the lowing cost considerably. So if you look at it, what does this mean that the companies  that are implementing AI today, right now, right now,  these are the names that are gonna become the next leaders. The next Microsofts Apples Googles of the world. Okay?  That’s the basis of launching my cur AI newsletter. Okay?  It’s officially, I told  you it was gonna have the launch date. It’s gonna be on Tuesday, March 26th,  so 7:00 PM on Tuesday  and be holding a free web event, taking questions live,  took everything about AI could register by going to  www.CurzioAI.com. This is gonna be our third web event, which we’re starting  to do a lot because we’re getting  amazing reviews for these things. ’cause it’s cool, it’s real, it’s not b******t. You’re not reading something that you don’t know who wrote. It’s me. You see it, it it’s, you know, the q and a lives  and stuff like that and a live of events. It’s really, really cool. I love doing live stuff. But the first two events that we did revolved around crypto  and six months ago we highlighted  how Bitcoin was trading at 25,000 was about surge. It was a hard sell because crypto was getting annihilated. That’s why we discounted Crypto Intelligence. And people came in and I’m glad they did. I mean Bitcoin surged and we said it was gonna surge  because you’re gonna have all these ETFs getting approved  just before the halving and even after the halving. Bitcoin does fantastic  and it’s pulled back and it should pull back. It’s up incredibly. And  after the halving forget it,  this thing’s gonna go, it’s gonna go. So then we had another event,  which was only three months ago. And what do we say? Said Hey, if you’re going going  to own this stuff, right Bitcoin,  we told you Bitcoin’s gonna go higher. It’s going higher. But you wanna own the alt coins. I mean the meme stocks, some of ’em up 10000%. I’m not telling you if you wanna take a chance on some  of them, you’re not gonna see any of those  in the newsletter. But when you look at these altcoins, right,  that these utility tokens, they outperformed Bitcoin  by three to one And over 18 month period after the halving. So start positioning yourself  and we have 22 positions on our portfolio  and as of Friday the average gain in these positions,  the average even a couple loses in the portfolio  is over 200%. I’m not bringing this up to pat myself in the back. You guys know that I shouldn’t, according  to every marketing strategy  and every book 1 0 1, never ever, you know,  it’s kinda like politicians never admit that you’re wrong. I love going over my losers. I have more winners and losers. That’s why I don’t mind because you learn  the most when you lose money. When, when you have those losers  and you wanna figure out, what did I get wrong?  ’cause that’s gonna make you better  and doing that over 30 years. Yes, you have lots of mistakes. So this is about patting myself on the back. What it’s about is if you wanna be a great investor,  you have to go to where the puck is going. We told you where the puck was going six months ago  with Bitcoin and then three months  after what everyone was, where the puck is at  Bitcoin telling you to buy Bitcoin. We were telling you to buy all coins. Now everyone’s telling you to buy alt coins when you’re in  them and up a lot When it comes  to this event on Tuesday at 7:00 PM  This is not about buying Nvidia super micro Meta, Google,  Amazon, okay?  That’s where the puck is. That’s what everybody’s talking about. Who’s the hardware companies are gonna benefit?  Who the big companies gonna benefit? Who’s it?  It’s not about that. This is gonna be about  where the puck is going. And you need to understand that in this trend. ’cause it’s one of the most fascinating trends  that you see since the invention of the internet. It’s here. There’s no b******t around it. Okay?  You have b******t trends. The ultimate confirmation of a trend that’s not a fad  is spending CapEx. Look at the amount of money that is pouring into this. Just look at NVIDIA’s numbers. Holy s**t, we’ve never seen anything like  this ever, ever, ever. And there’s a reason why  because if you have the best systems,  if you have the best services, now when you are working  with cloud companies, whether it’s AWS Azure, Microsoft,  if it’s Dell, notice how good Dells do. And even Hewlett Packer, you could  throw in there some of these bigger names. They want, you wanna be able to combine your services,  your AI systems with these companies. And that’s why they need to get ahead of this. That’s why they’re spending so much money Now  where the puck is going in that presentation. I promise you one thing I’m gonna blow your f-ing mind out  with the research that I’ve uncovered. I haven’t seen it everywhere. I mean people are talking about all  kinds of things within AI, generative AI ChatGPT,  this again, this isn’t going to be about that. It is about the next wave, which is the small  and mid-cap companies that are currently using AI  that are already seeing an explosion  in almost every single metric. And they’re doing this while cutting their employees. And that’s something as someone a covered financials all my  life, you don’t see, you have to spend money  to make money when you’re cutting 10% plus  of your workforce, you’re trying to save money,  you’re cutting costs, but yet you’re seeing  more productivity. The holy grail of every business  that is happening with a few companies. ’cause there select companies that have been doing this over  the past two years while everyone else is playing up. So one name recommending Curzio AI in the newsletter,  Charles Sub’s gonna have access to,  it’s in the healthcare industry. This is just one industry. And listen to this Competitors all over the place,  even in Cramer’s interview he mentioned it to in healthcare  with Jensen and stuff like that. That was yesterday. They’re all using AI  because they’re forced to be using AI  because it’s all about, you know,  data discovery, all this stuff. And, but a lot of ’em are late to the party. Some of them are using raising capital  and they’re raising capital with unfavorable terms. ’cause then rates are really high. Some  are using warrants or whatever. And they’re buying like specific AI companies  that you may not have heard of. Most of the best ones have been bought in the  private market by the big guys. But they’re incorporating AI into their businesses. And some of ’em are a little bit further along than others. And I’m researching these going,  wow, this is a pretty cool company. Wow, if this works happen, then all  of a sudden I see a company trading  at a massive, massive premium. This company doesn’t generate really any revenue  as a $500 million market cap. It’s a company that’s not gonna show up at any screens. And I found it just because I tell everyone,  when you do your research and you find a stock pick  that you really wanna buy within a specific industry,  do comp analysis com, comparative analysis. ’cause chances are you might find another name  that could be a little bit cheaper, has better technology  that you never heard of or  trust me it happens to be all the time. I’m like, wow, this is a really good name. And then I see something else like this. This is a much better play  and a lot of times it’s not gonna be on anyone’s radar. So this company, while all  of its competitors are getting into AI  and some of ’em are just exploring it,  they’ve been doing this for three years. So again, it’s barely generating any revenue. So it looks crazy expensive  and it’s not showing up on any screens,  but it just signed six partnerships. Two with big two big pharma companies  That could, and this is from the company. It could result in $900 million plus in  royalties inside few years. It’s crazy considering it’s a $500 million mark cap company. Now what does that mean? As someone  that covers biotech when it comes to revenue,  you could easily, easily, easily place,  if you have a growing biotech company generating revenue  easily a 10 times sales number on it easily. That’s probably a conservative in biotech. And if you did that for this $500 million mark company  and this forecast comes to fruition,  this is a $10 billion plus company,  which is a 20 x from here. I know you’re like 20 x. That’s b******t. You should, your b******t radar should go up when somebody  says that you should. I’ll be the first to tell you that. Until you see  that the greatest tech investor in the world,  which is my opinion, just took a stake  in this company in February. And by the way, I love this name. Before finding that data point which was buried someplace  wasn’t as easy to find plus a CEO to founder. I’m like, all right, these guys selling  or the insider selling, you know, you have, you know,  a company that that has gone up  and it’s $500 million market cap and it went higher  and then it pulled back and they did a nice capital raise. ’cause they’re spending a lot of money to build this system. ’cause it’s state of the art. It’s the whole entire package. It’s not just a system where, hey, let me see some  of your compounds, we’ll throw this in here. Here’s AI, this could work. They actually have a system where they take it  and it’s called a wet lab. And they use it  with those compounds in a six week study along  with all their data, through their learning, through AI. And now they formulate it and say, here you go Pfizer. Here you go Merck. Holy s**t. ’cause When you look at the healthcare industry,  there’s 16 million compounds in the libraries  of the largest pharmaceutical companies in the world. And what does that mean, right?  These compounds, these little compounds, right?  They, they stay on the shelves and you wanna  mix and match those compounds. You can come up with the best drugs ever. However, you’re not really pushing the issue  because it costs over $2 billion  and takes over 13 years to bring a new drug to market. I know we all, hell hate the healthcare companies. I understand we all hate ’em, especially through COVID. You had like Pfizer getting bribes. The FDA you have, you know, the, the prices  that these guys charge you. You never want to cure. You want a treatment only, you know,  again, these guys are  businesses and they wanna generate money. I think the US outside of one other country,  only two countries, I think that,  that allow healthcare companies to advertise in the media. And correct me if I’m wrong on that, I’m pretty sure. But with those costs, 2 billion  to bring a new drug to market. with over 2 billion in costs. This company through its AI platform right now that works,  is cutting the preclinical time to bring a drug  to market from five years  that preclinical stage to two years. And that preclinical costs from 45 million to $15 million. Take a second and think of the possibilities. How will not every single big pharma company use  this small company’s platform?  A service that shortened the timeframe to bring a drug  to market from 13  and a half years to say overall maybe eight or nine. And that guys, it’s a real f*****g big deal considering  these patents are only for 20 years. So the time they come to the market,  and that’s an average of 13  and a half year, it could take 15 years. Imagine how much money you make every single  year that you’re able to save. Not to mention the cost to bring it to market. I mean you see tens of billions of dollars  and more sales just by using this company. What is that worth to the biggest  pharmaceutical companies in the world?  That’s why they’re all going into AI. Now this is one company in one industry  that become the next Amgen, the next Eli Lilly,  the next a hundred billion Eli Lilly may be the first  trillion dollar healthcare mark cap company. But these are the ideas  that are gonna make their way into the Curzio AI newsletter. And the first newsletter that I’m launching in seven years,  I just launched newsletters on every trend. I believe it’s something. The last one was crypto. Look where we are on crypto. It’s gonna be different from  almost every other newsletter out there that covers AI. Since the names even the one I just meant you,  you’re not gonna see, it’s not gonna show up on on screens. It requires lots of working hours. It requires lots of digging with this name. I found by researching for the companies  before this in detail,  before OneNote had this one as a comparison, I’m like,  why is this one trading at such a high premium?  What, what’s going on here? Again,  that should not be a red flag. That should be like, let me see why  this company’s trading at such expense valuation. What kind of technology that they have  that people are paying such a high premium. And it may be nothing and that might be a good short,  but you should be digging when you see  expensive companies don’t run. I used to run and I missed so many. I missed the Apples and the Microsoft when I was  younger, I missed them. I didn’t get it. I didn’t get it. I didn’t understand Netflix. I didn’t understand. I I compare them to a cable company. It’s trained three times if outta a cable  company, why am I gonna buy it for?  Because they’re not competing against cable companies. Every single cable company was competing against Netflix. They own the pie. Tesla owns the pie  for EVs it  where they’re bigger than all the mark caps combined while  everyone’s trying to get in now they can’t even get in  and trust me, Tesla, it’s on a downturn  and low on prices sort  of first cyber truck the other day too. It it, it reminded me of, of the $6 million Man was it,  it was something from that old, almost like a, you know,  night rider that tank, that kit fought it. It just looks like a, it looks like a toaster. It was just like, but people are gonna buy it  and they’re gonna be all right Tesla, they’ll be fine. A little bit of a downturn. Now we  know EVs and stuff like that. I think Rivian is gonna be fine as well. Great company. But that’s how you have to value some  of these companies when you look at them  it’s like don’t look at them as a comparison to, you know,  how I could take market share. They’re becoming the pie and everyone’s looking. Take market share from them. That’s when you change your landscape. That’s why I love looking at models. To me it’s fascinating. I mean my boring s**t to you, I don’t know. To me it’s fascinating ’cause that’s  what you find the greatest ideas  and this is an opportunity  to find some of the greatest ideas. ’cause there’s, companies have been doing this  for three years that have been partnered with Nvidia  for three years talking about. But no one’s really paying attention  ’cause they’re small caps and everyone loves the big guys  especially over the past few years since COVID  own seven larger stocks  and disappear now 35% of, of the market. And I got news for you that numbers,  that percentage gonna go a lot higher. So you’re looking at AI newsletter, these are the ideas,  it’s small mid caps going deep into them. And I’m gonna show you during this event how deep I go. I’m not gonna make it boring. And you don’t have to do s**t. You don’t have to do any of this. I’m doing it for you. All you have to do is recommend the stock. I’m gonna tell you re just buy the stock I tell you to buy,  which I’m gonna be investing in these personally as well  do also could be sampling new AI technologies,  which are coming out like every single week. It’s fascinating. Exclusive interviews. I’m taping one a little bit later today. That person happens to be the director  of AI for the Mayo Clinic. It doesn’t get better than that. Looking for new ideas. I was on the phone an hour for this guy. I could been on the phone for for three hours with him. It just, I felt terrible. I was asking so many questions  like I gotta do an interview with you. These are gonna be exclusive interviews for the newsletter. Maybe we’ll offer a glimpse of that of  what he’s saying on, on on Tuesday. I’m taping it later. And look, I’m not gonna BS you  and you look at Tuesday’s AI event. It it, it’s gonna be roll around selling our,  our new product Kurzi AI, right?  It’s the first newsletter again. I launched at seven years. Yes, attendees are gonna get a special deal since  we’re only marketing this to Curzio followers. We’re not, you know, you’re not seeing this in on Yahoo  Finance or anything like that. But you don’t have to buy anything. I just want you to attend the event. It’s free. It’s gonna be a quick presentation. You’re gonna sit back, take all your questions live. Daniel’s gonna be here with me as well. Daniel Creech taste,  Wall Street Unplugged Premium with me all the time. Lots of compliments on him, which is cool. We sit here, it’s fun. I’ll be drinking beers, hanging out. And a lot of times the last two times we did this  with the webinar, a lot of people stayed on,  which is rare with these events. You say, okay, I got the event. All right, I got the off. Okay, I’m gone. But it’s really cool  because we’re answering all the questions. You get to ask the questions live  and you know, look, I’m independent. Nobody owns me. I’m gonna tell you how it is. Sometimes that might hurt your feelings,  but I’m not gonna b******t you. You could say Frank’s an idiot. I don’t agree with his opinion. He’s a effing idiot. But what you’ll never say is I don’t trust him. I’m gonna tell you exactly how I feel. I’m gonna tell you what names to avoid, which there’s some  of them are definitely in your portfolio right now  that you have to be really, really careful. And I’ll tell you why. Tell you why. It’s actually gonna be one of our, our, our bonus reports  of AI names to avoid. ’cause some of those you could say are in a bubble. Definitely in a bubble. You attend this event, you ask questions,  you’re gonna see stuff that you’re not  seeing any place else. And trust me, it’s gonna blow your mind  because it doesn’t, it’s not easy to blow my mind. I’ve seen everything I’ve seen Wall Street,  where Wall Street is designed  to always f**k the retail investor. It’s how do we get the retail the most excited  to sell them all the crap that we could dump to them. That’s Wall Street. That’s it. I’ve been there, I didn’t do that but I’ve been there. That’s what SPACs are about. That’s what so many of these companies are about. It’s all about, you know, getting retail investors  so excited about something where they’re not even gonna  look at the fundamentals or anything. They’re just gonna buy this s**t. And you have guys like Chamath and hedge fund managers  and Branson buying 10 jets  after telling everyone, wow, you know, we’re all going  to space and this company’s great  and selling it 35, it’s a dollar, it’s going outta business. Virgin Galactic. That’s the s**t you have to contend with. That’s why I do this. Seriously. I don’t have to work. I don’t, I don’t have to do this. I’ve done well enough in  my life where I could just do one podcast  and say okay, I’m gonna shut the business and that’s it. But I’m passionate about this  and there’s tens of millions of people, million  that want someone out there they could actually listen to  that they could trust. You don’t have to agree with everything I say, that’s fine. Just being able to trust someone and say, okay, I get it. I mean holy s**t, if an industry isn’t,  I’ve never seen an industry of more dire need than  that right now, ever. There’s just so much b******t out there  and it’s insane and it’s crazy. That’s the industry, unfortunately the industry I’m in,  where sometimes we get lumped with that b******t,  which p****s me off  when you’re looking at, at this industry  and AI, You have to have  to have to have money allocated  to the sector in the right areas. You could own Nvidia. I’m not saying not to own Nvidia,  I’m just saying you’re not gonna be a  millionaire buying Nvidia here. Even if you bought it last  year, you’d be up a hundred percent. You’re not gonna be a millionaire. It’s not gonna be like 20, 30 x to to move the needle. Some of these stocks, they’re  probably gonna go a lot higher. But it’s a small ones  that are not gonna have AI in their name,  that are not gonna have divisions of AI that they can say,  Hey, we generated X millions because of AI. It’s how they’re using AI within these divisions. And you’re going to see the earnings explode. You’re gonna see sales explode, you see margins go higher  and the cost get cut. And I’m gonna show examples of this where it’s hard to find,  but when you see it, you’re gonna be like ho,  like things I haven’t seen for 30 years  covering the fundamentals. That’s why I’m like w whoa, what happened to Microsoft?  How did Microsoft lay off? 13% of it,  its employees cut CapEx by 4 billion  and see almost a tripling in earnings  that never, ever, ever happens. You don’t see that. How did it happen?  And that’s how you find these companies. When you look under the hood, there’s a lot  of opportunities out there to be  next Microsoft Apples and videos. I’m gonna show you exactly how did it significantly  increase your odds of finding one of these, holding them  buying and holding them and just forgetting about them. And there’s small caps  that are gonna start taking market share from the  big caps from bigger names. I’m not talking about the big technology companies are  so big and positioned so well,  but there’s industry leaders across all these sectors  that are late to the party. And these smaller names are just, they’re starting  to spend a lot of money in getting into,  they’re more nimble, they’re, they  can make decisions a lot quicker. It’s less bureaucratic from these small companies  that is these big companies and convincing the right person. I’ve seen that even in the drug discovery area  where one company I had a while ago in one  of our newsletters is like AI’s b******t. Now he is like, oh, oh, you know,  no we’re gonna get into AI. Well there’s nine companies now that are into it  and the one company I’m recommending  has been in for three years. You’re late, you’re in trouble,  you’re gonna lose market share now you gotta make a big  splash, a big move. Buy AI, buy a company,  maybe buy this company or tr whatever. But when you fall behind now if you fall behind,  this isn’t something, oh well they’re doing something in  three years this is gonna happen. You could fall behind immediately. Apple is the biggest company  and the greatest company on the planet  and in six months you saw all these other technology  companies significantly outperformed the biggest  because they were a few months late on AI. Few months with the biggest company  with a hundred billion at its fingertips to spend  and to buy anything they want. That’s how effing quick this is moving  that should have you excite as an investor, just have  to know where to look in the right areas. And I’m gonna show you that on Tuesday. So it’s next Tuesday, March 26th, 7:00 PM I was going  to do it this Thursday. However, it’s the most important day in the world,  which is opening day of March Madness. And I’m like, there’s no way for my sake  or everyone else’s sake that I’d have that then,  even though you’d be able to watch a  replay a couple days later or whatever. Uh, but I don’t care how exciting the event would be,  it’s not gonna be more exciting than basketball  and open day of the big dance,  which you guys know that I love. Okay, speaking of March Madness,  I dunno if I should give you my final four picks  because I taped a special podcast yesterday,  so it’s on iTunes and I cover it. It’s like 15 minutes really in depth details. Uh, my Final four does not include any number one teams  and only includes one number two team. And I think I have candidates go into Sweet 16  ’cause they’re supposed supposed to get both  of their best players back. And when they’re at full strength, they beat Houston,  they beat Tennessee, they, they beat Connecticut. You know, something like you, they’re not gonna lose  as quick as everybody believes. They lost the last few games. But I just found out yesterday  night that one of their top players, their top player,  which not Dickinson, it’s McCullough, is not going to play  for the tournament, which is a big deal. I mean, Natalie’s the leading score,  he’s the best defender on the team  and there’s a shot that they could lose in the first round. But other than that, a lot of analysis, a lot  of details go to iTunes. And again, you can really see me get into it. And I will say this, if you have a spouse  that’s not into college basketball,  have them fill out a bracket this year. I mean, the parody this year is incredible. I mean, so much so if you look, and I’ve never seen this  and I watched college basketball for 40 years. Can 51 May maybe 45 years. I mean, that’s been my life basketball  such a long time before this. Uh, I’ve never seen like the top three teams lose  the top three or four  or the four number one seats  lost on the way into the tournament. Usually they win their tournaments. But it’s not just that they lost Houston lost  by 30 to Iowa State. They were supposedly the best team. Probably gonna be number one seat head of Connecticut. Okay?  Number one seat Purdue lost a Wisconsin. Wisconsin is a s**t show. That team’s terrible. That team’s terrible. They’ve been terrible all year. And by the way, Virginia making that tournament over St. John’s is an effing joke. It’s an effing joke. I mean, St.  John’s won the last seven games. They did everything required of them. And then they came down to the last game playing Connecticut  and they lost by five to the best team in the nation on a  neutral court by five. If you look at the last eight games from from Connecticut,  they blew out every single team other than St.  John’s. They’re averaging 90 points a game. I, this is a team that could have  made a massive, massive run. And just to see Virginia, really? Virginia, come on. Six Mountain West teams come on. Three biggest team. Come on. That’s just my rant. Nothing else. You had Purdue lost to Wisconsin  and then North Carolina lost to North Carolina State. North Carolina State was terrible. Now they made this amazing run. How doesn’t North Carolina win that game?  And they, it wasn’t close. They got a beaten. These are three of them won seats. And then you have Yukon who was in the Big East  who really wasn’t that good this year. And Yukon is not better than they were last year. It’s very difficult to repeat. And they are by far in the hardest bracket of four teams  that could actually win coming out of that bracket. So it’s the only hint,  only little tease I’m gonna give you to listen to it again. It’s on there. My final four picks. People like to listen. I like the Super Bowl where I get it wrong all the time. And I tell you guys so you can make money off of my pick. I think I was, three times in the past 13 years  for a Super Bowl when it comes to, college basketball. It’s a little different. Uh,  but yeah, you’ll have fun with that. And take a look at my picks again, no number one seeds,  which you’re not gonna see out there and it should be fun,  but have someone that doesn’t really have a lot  of knowledge of college basketball. Don’t fill a bracket out  because they are eight, nine seeds  that could beat one seeds. It, it’s, there’s a lot of really, really, really good,  good teams out there that could beat number one seats. Uh, so it should be fun. I’m looking forward to that tournament. But more  importantly, I’m also looking forward to next Tuesday,   and a and you can register for that event at Curzioai.com. Uh, gonna have a lot of fun. Probably talk about it a little bit more in tomorrow’s  podcast, which is Wall Street Unplugged Premium. But definitely take a look at some of the stories, some  of the things happened at the video conference. ’cause it really, really is exciting. I wanna get too technical. It’s my job to read all the s**t,  analyze it, try to explain it to you,  to understand hopefully I did that today,  but I’m really gonna do that on Tuesday. But, um, there’s some amazing announcements. Uh, and you could see why they’re light  years ahead of everybody else. I mean, if you look at AMD AMD’s expected  to generate $3 billion off of AI over the next 12 months,  and NVIDIA’s expected to generate a hundred billion. So, you know, for, for those of you buying AMD up here  with those expectations, that it’s, you know,  they’re gotta be able to compete with Nvidia. They’re not, they’re not just be careful. Expectations are so freaking high for AMD right now. They can go higher and can keep going higher and go higher  and higher and go up another 300%. I’m just saying that they’re not Nvidia NVIDIA’s a cheaper  company growing much faster, seeing the results  and AMD doesn’t have what Nvidia has. This whole ecosystem around all their hardware  that everyone’s falling in love with  and they’re all building this stuff. It’s gonna be really hard for anyone else to compete,  especially for a long, long time. So really cool stuff. Looking forward to that presentation, that webinar. Again, you can join at curzioai.com. Any questions, comments from here for you, feel free  to gimme a Frank@Curzioresearch.com  and I’ll see you guys  tomorrow on Wall Street Unplugged Premium. Take care, love this episode of Wall Street Unplugged. I think you’ll really love Wall Street Unplugged Premium. The Wall Street Unplugged Premium is my members only podcast. Where I dive even deeper into this week’s events. I’ll do even more than tell you what’s moving these markets. I’ll tell you specifically what moves you can make today. So this is gonna be about trading. So put big money in your pocket right away due  to inconsistencies I see daily in the market. I’m talk about specific investment ideas I’m recommending  and tracking each week that I believe would be impacted  directly by everything I just talked about today. Plus, you’re gonna get the chance  to go even further down the rabbit hole with me  and my co-host, who’s Daniel Creech. As we discuss which  of these weeks’ trends could turn into massive windfalls,  could the big trends that we see lurking horizon,  also the news we’re picking up from our network of insiders,  which has gotten bigger and bigger thanks to you  and so many people listening  to this podcast in over a hundred countries. And you get a chance to talk to me directly in my special,  ask me anything q and a session, all of that,  and a lot more like premium interviews  with world leaders in finance,  technology, industry, and politics. This is all part of Wall Street Unplugged Premium  and becoming a member is super simple and super cheap. So I don’t know, over to WSUoffer.com to check it all out. Sign up today and you won’t miss a thing. That’s WSUoffer.com. Announcer: Wall Street Unplugged is produced by Curzio Research, one of the most respected financial media companies in the industry. The information presented on Wall Street Unplugged is the opinion of its host and guests. You should not base your investment decisions solely on this broadcast. Remember, it’s your money, and your responsibility. A trip to the Big Apple… The Consumer Pricing Index shows hot inflation reading… You should do this when the Fed cuts interest rates… Artificial intelligence is starting to take over—I can show you how to profit. Bitcoin plunged 10%—for a split second, and is back to all-time highs—here's how to use the situation to your advantage. Apple's stock is down and mainstream media is panicking… But don't be too quick to turn bearish. This new AI… In today's episode: A recent Billy Joel concert experience… AI is booming, providing efficiencies, and disrupting industries… Get in now. Crypto—and our portfolios—are on fire… Bitcoin crosses over $60,000… And MicroStrategy buys more Bitcoin… Is AI a bubble or a disruptor? What to expect after NVIDIA's (NVDA) earnings report. And stock volatility, despite solid earnings, signals an extremely dangerous market. Why the Fed could start hiking rates again soon… Sam Bankman-Fried will get a hefty sentence—but it won't stick… And the collapse of the Francis Scott Key Bridge will send serious shockwaves throughout the economy. Bitcoin is surging to new all-time highs—but it has way more room to run… The CPI shows inflation is back—why are economists shrugging it off? … And what's behind Lyft's crazy post-earnings action? The market is ignoring some major risks… Which \"Magnificent 7\" stock is a buy right now … Company fundamentals finally matter again… Frank's shocking take on Disney (DIS) ahead of its quarterly report… And the Bitcoin 'Super Halving.' Why Microsoft (MSFT), Alphabet (GOOG), and AMD (AMD) are down after earnings—and which stock to buy on the pullback… Why Elon Musk deserves his massive pay package… And the next crypto catalyst could mean 10,000%-plus gains. Netflix's (NFLX) blowout results—and why the company remains the undisputed king of streaming… What to expect from Tesla's (TSLA) latest quarter—and how to trade the stock… And why you MUST prepare for a major pullback. The best and worst tech from CES 2024… A first for sex tech at the Consumer Electronics Show… How VR/AR will change entertainment forever… And which companies have an early lead in the artificial intelligence (AI) space. Amazon's new artificial intelligence investment… Sam Bankman-Fried won't serve his full sentence… How tomorrow's PCE data will impact the Fed's decision on interest rates… A... Powell's press conference… Why would you trust the Fed? A perfect Final Four bracket? The DOJ vs Apple… Is Hertz going bankrupt, again? Reddit starts... PPI data coming in hot… The Fed is F**ked! Is TikTok a national security threat? Michael Saylor is at it again. Is Google reviving the... NYCB and Mnuchin: Turning $1 billion into $3.5 billion in 10 minutes… Gold is breaking out to new highs, companies to invest in, and avoid,... Prepare for a holy sh*t moment in the markets when interest rates finally get cut… These cryptos will outperform Bitcoin… A struggling sector and some... Amazon's new artificial intelligence investment… Sam Bankman-Fried won't serve his full sentence… How tomorrow's PCE data will impact the Fed's decision on interest rates… A stock that's immune to the Baltimore disaster… And is Trump Media the next meme stock? Last week, social media giant Reddit (RDDT) and AI infrastructure company Astera Labs (ALAB) both IPOed—and hit the market running. Genia explains why the successful IPOs are huge news for the entire IPO sector… and shares 3 ways to profit. Powell's press conference… Why would you trust the Fed? A perfect Final Four bracket? The DOJ vs Apple… Is Hertz going bankrupt, again? Reddit starts trading today, should you buy shares? A proven winner to leverage Bitcoin's rise. In the past few years since its widespread release, 5G has quickly become a critical technology across industries. Genia shares how 5G is transforming the tech landscape… and an ideal stock to profit as the trend unfolds. PPI data coming in hot… The Fed is F**ked! Is TikTok a national security threat? Michael Saylor is at it again. Is Google reviving the metaverse? Today's pick: An AI company at the core of the industry, with the best… Growth stocks are on a tear… but market history tells us it won't last. You don't have to guess when the market will shift. One simple strategy lets you \"buy low and sell high\" without trying to time the market. NYCB and Mnuchin: Turning $1 billion into $3.5 billion in 10 minutes… Gold is breaking out to new highs, companies to invest in, and avoid, as gold moves higher… Netflix feat. Mike Tyson vs. Jake Paul… Our fascination with AI—it… All content Copyright © 2024 – Curzio Research. All rights reserved. Subscribe to access daily market updates and exclusive content Claim a FREE copy of our latest report and discover: "
}