{
    "title": "Here Are 2 Remarkable Growth Stocks to Own Right Now",
    "date": "3/29/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/NVDA-Q/pressreleases/25145104/here-are-2-remarkable-growth-stocks-to-own-right-now/",
    "text": "The artificial intelligence (AI) revolution continues to draw investors' focus towards the top tech titans, including Nvidia (NVDA), Super Micro Computer (SMCI), and Amazon (AMZN), among others. However, there are a few other growth stocks that could provide robust returns to patient investors. Growth stocks are typically viewed as long-term investments, because the companies' growth trajectory may take some time to materialize. Here are two top growth stocks that Wall Street is very optimistic about. The first stock on my list is membership-only retailer Costco Wholesale (COST), which may not be an appealing choice among the field of hypergrowth stocks, such as AI plays. However, Costco has proven to be a resilient company in the face of challenging macroeconomic times, with its stock returning 556% in the last 10 years, outperforming the S&P 500 Index's ($SPX) return of 180.6% by a wide margin. Year-to-date, COST stock has gained 11%. Costco's membership-based business model benefits both the company and consumers. The company provides bulk products at discounted prices to its members, as well as other exclusive deals and discounts. In return, the company receives a membership fee that serves as a recurring source of revenue - which came in at $1.1 billion, an increase of 8.8% year-over-year, in the second quarter of fiscal 2024. In the second quarter, Costco’s total revenue grew by around 5.7% to $57.33 billion. Net income for the period came in at $3.92 per share, compared to $3.30 per share in the year-ago quarter. Costco’s revenue and earnings have increased at a compound annual growth rate of 9.6% and 11.4%, respectively, over the last five years. In addition to selling goods, Costco operates self-service gas stations in the U.S. and around the world, which adds to its top line. Costco's global presence has allowed it to mitigate the risk of depending on a single market to drive growth. It currently operates 875 warehouses and e-commerce sites in several countries. Costco is also a dividend stock, paying a yield of 0.56%, compared to the consumer staples sector average of 1.8%. Its forward payout ratio of 23.5% implies dividend payments are sustainable with the current earnings growth rate. For fiscal 2024, analysts expect Costco’s revenue to grow by 4.9% to $254 billion, with earnings rising by 12.4%. Furthermore, revenue and earnings could jump by 7.2% and 9.3%, respectively, in fiscal 2025. Costco is trading at 42 times forward 2025 estimated earnings. Costco stock is currently expensive when compared to big-box rival Walmart's (WMT) forward price-to-earnings ratio of 23x. However, I believe Costco is a prime example of a resilient stock, with its membership-based model driving revenue and earnings growth even in challenging times. Furthermore, its shift to e-commerce and its vast global presence may help the company continue to thrive. Whether you're a seasoned investor looking for stability or a newcomer looking to capitalize on retail trends, Costco provides an appealing option to build wealth over time. Overall, Wall Street rates COST stock a \"strong buy.” Of the 19 analysts covering COST, 19 have rated it a “strong buy,” three have a “moderate buy” recommendation, and seven suggest a “hold.” The mean price target for COST stock is $774.58, which implies a potential upside of 5.7% from current levels. Additionally, its high target price of $905 implies a potential upside of 23.5% in the next 12 months. As the AI era progresses, the semiconductor industry is expanding rapidly. Marvell Technology (MRVL) is attracting investors as demand for its AI products rises. Marvell's products have a significant impact on everything from high-performance networking solutions that power data centers to advanced storage technologies that enable cloud computing and 5G connectivity. Valued at $62 billion, Marvell’s stock has gained 17.5% year-to-date, outperforming compared to the broader market. Marvell's total revenue for the fourth quarter of fiscal 2024 exceeded the company's mid-point guidance, rising 1% year-on-year to $1.43 billion. Revenue also surpassed Wall Street's expectations. Furthermore, adjusted net income for the quarter totaled $0.46 per diluted share. CEO Matt Murphy explained, “AI drove strong growth in our data center end market revenue which increased 38% sequentially and 54% year-over-year.” Looking ahead, management expects “continued sequential growth” in the data center segment. Furthermore, Marvell also expects “soft demand impacting consumer, carrier infrastructure, and enterprise networking in the near term” to affect the first quarter of fiscal 2025 performance. However, a recovery is expected in the second half of fiscal 2025. On that note, management forecasts Q1 revenue of $1.15 billion (plus or minus 5%). Adjusted diluted income per share could be $0.23 (+/- $0.05) per share. Analysts also have a soft outlook for fiscal 2025, predicting a 3.4% revenue drop and a 4.9% earnings decline for the year. However, revenue and earnings are expected to increase by 31.9% and 72.5%, respectively, in fiscal 2026. Marvell stock trades at 29 times forward earnings and eight times forward sales, which appears reasonable for a semiconductor stock with strong long-term prospects in AI. Wall Street is growing increasingly bullish on Marvell’s stock after its exceptional Q4 results. Stifel Nicolaus analyst Tore Svanberg maintained his “buy” rating on the stock with a price target of $86. The word on the Street, overall, is a “strong buy” rating for MRVL stock. Out of the 28 analysts covering MRVL, 25 have rated it a “strong buy,” two have a “moderate buy” recommendation, and one suggests a “hold.” The average price target for MRVL stock is $87.78, which implies a potential upside of 23.8% from current levels. Additionally, its high target price of $100 implies a potential upside of 41.1% in the next 12 months. Provided Content: Content provided by Barchart. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Nvidia Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}