{
    "title": "Markets News, March 22, 2024: Nike Weighs on Dow; Nvidia, Google Lift \nNasdaq to Fresh Record",
    "date": "3/22/2024",
    "url": "https://www.investopedia.com/dow-jones-today-03222024-8613176",
    "text": "Colin is an Associate Editor focused on tech and financial news. He has more than three years of experience editing, proofreading, and fact-checking content on current financial events and politics. He received his M.A. in journalism from The New School and his B.A. in history and political science from McGill University. Update—March 25, 2024: For today's live markets news, see here. Stocks finished Friday mostly lower, though the S&P 500 and Nasdaq got a boost from big tech gainers Nvidia (NVDA) and Alphabet (GOOGL). The Nasdaq Composite rose 0.2% Friday to finish the week 2.9% higher and snap a two-week losing streak. The S&P 500 slipped 0.1% Friday but closed up 2.3% for the week. The Dow Jones Industrial Average gained 2% this week despite falling 0.6% on Friday. It was a rough day for sports apparel companies. Lululemon (LULU) stock tumbled after its full-year revenue and earnings guidance fell short of analyst estimates, raising concerns about stagnating U.S. sales. Nike (NKE) fell after its sales outlook also disappointed Wall Street. Treasury yields fell and the dollar climbed as Congress rushed to pass a spending bill. The legislation will need to be passed and signed by the President before midnight to keep the lights on at several critical government branches including the departments of Defense, Homeland Security, Labor, Health and Human Services, and Education. Stocks gained ground yesterday as AI stocks rallied following a big earnings beat from memory chip maker Micron (MU) and a successful first day of trading for Reddit (RDDT). Equity Indexes Wrap: Nvidia, Alphabet Lead Nasdaq, S&P 500; Nike Drags on Dow The Dow Apple (AAPL) rose 0.5%, recovering some of yesterday’s losses after the Justice Department filed an antitrust suit against the iPhone maker. Tech peers Amazon (AMZN) and Intel (INTC) each advanced 0.4%. Nike (NKE) fell 7% after the company forecast sales would decline slightly in the first half of its 2025 fiscal year, overshadowing a fiscal 2024 third-quarter earnings beat. Financial stocks slipped, led by Visa (V), down 2.3%, and Goldman Sachs (GS), down 1.7%. The S&P 500 FedEx (FDX) jumped 7.4% after beating earnings estimates with its fiscal third-quarter results as cost-cutting measures boosted the bottom line. Competitor United Parcel Service (UPS) inched up 0.5%. AbbVie (ABBV) rose 0.6% after getting full approval from the FDA for Elahere for the treatment of certain ovarian cancers. Nike’s footwear peers V.F. Corp (VFC) and Deckers Outdoor Corp. (DECK) each fell 3.1%. The Nasdaq 100 Nvidia (NVDA) led the index, rising 3.1% as UBS analysts raised their price target to $1,100 from $800 following the conclusion of its GPU Tech Conference, where it unveiled next-generation AI chips. Alphabet (GOOGL) rose 2.2% as Wedbush analysts put the company on their “Best Ideas List,” citing its AI opportunity. Lululemon Athletica (LULU) tumbled 15.8% after it offered revenue guidance that fell short of Wall Street’s estimates. Nvidia-Backed SoundHound AI Tumbled This Week on Short-Selling Report, Downgrade Shares in SoundHound AI Inc. (SOUN) shot up after Nvidia Corp. (NVDA) disclosed a stake in the AI voice solutions provider last month, but the past few days have been less than stellar for the company. Its volatile shares are down about 33% this week following a short seller’s report on Tuesday, then a reported downgrade of the stock to \"underweight\" from \"overweight\" by Cantor Fitzgerald analysts on Wednesday. A short-selling report issued by Capybara Research titled \"Lies, Damned Lies, and Cheeseburger 'AI'\" alleges that SoundHound AI is a \"failing company peddling lies and deception.\" “After 18 years of losses, and multiple pivots, the company still has no clear path to profitability,” the short sellers allege, saying they \"believe that SoundHound is worth $1.00 per share or less,\" well below its price Friday afternoon around $6 a share. A spokesman for SoundHound wasn't immediately available to comment on the Capybara Research report on Friday. Shares of SoundHound were off about 10% at $6.03 a share shortly before markets closed Friday. -Nisha Gopalan Nvidia, Alphabet Lead Nasdaq on Analyst Love Tech giants Nvidia (NVDA) and Alphabet (GOOGL) were among the S&P 500’s best-performing stocks on Friday after analysts expressed confidence both companies have benefits left to reap from AI investment. UBS analysts on Friday raised their price target on Nvidia stock to $1,100, a 38% increase from their prior target and more than 15% above its price on Friday. Analysts said the company “sits on the cusp of an entirely new wave of demand from global enterprises and sovereigns.” Analysts suggest that investment in artificial intelligence by national governments, including those of Japan, South Korea, and Sweden, could each deliver the company as much business as a large U.S. cloud customer. Meanwhile, Wedbush analysts on Friday added Google parent Alphabet to their “Best Ideas List” and raised their price target to $175 from $160. \"We think Google benefits from structural search and generative-AI advantages that insulate the company from competitors and potential shifts to conversational chatbots,\" analysts wrote. The company’s stock has lagged those of its mega-cap peers Microsoft (MSFT) and Amazon (AMZN) this year, in part due to a disappointing earnings report and controversy around images generated by its Gemini AI model. \"While longer-term debates related to generative AI persist, we think the setup has become more attractive in recent weeks with a reversal in sentiment emerging,” said Wedbush. Sentiment got a boost earlier this week, they say, from reports Google was in talks to license Gemini to Apple (AAPL) for use in future operating systems. Nvidia shares were up 2.6% at $938.50 late in the session on Friday, putting the stock on track to close at a record high. Alphabet shares gained 2.1% to trade at $150.74. Tesla Shares Slide as EV Maker Reportedly Scales Back Production in China Tesla (TSLA) shares fell in intraday trading Friday following a report that the company has slowed production at its facility in Shanghai, China. Production at Tesla's Shanghai facility, where the electric vehicle (EV) maker produces its Model Y and Model 3 vehicles, has been scaled back to operating five days a week from the prior schedule of six and a half days a week, Bloomberg reported. The EV maker reportedly told workers and suppliers to expect certain production limits to last through April. Tesla did not immediately respond to a request for comment. The move to reduce production comes amid growth concerns as the EV market has cooled and as Tesla faces rising competition. Analysts at Wells Fargo (WFC) and UBS (UBS) downgraded Tesla's stock last week, with UBS analysts calling it a \"growth company with no growth.\" Tesla shares were down about 1.5% at $170.26 Friday afternoon. The company has had a rough start to the year, with its stock price down more than 30% so far in 2024. -Aaron McDade Reddit Slips on Second Day; Astera Labs Continues Its Run Reddit (RDDT) shares fell on Friday, their second day of trading, after surging nearly 50% in the first social media IPO since 2019. Reddit soared yesterday, rising as high as $57.80 per share, well ahead of the $34 IPO price the company set on Wednesday. Share gave up some gains, but still closed at $50.44. On Friday afternoon, they were trading 5.5% lower at $47.65. Reddit was the second new issue to surge on its first day of trading this week. Astera Labs (ALAB) surged 72% on Wednesday and has continued to rise above its $36 IPO price. On Friday, the stock was up about 4% at nearly $67. The debuts could breathe new life into the IPO market, which effectively froze in 2022 and 2023 as interest rates rose and appetite for new offerings remained muted. Nike Stock Falls Despite Earnings Beat as Retailer Issues Weak Sales Guidance Nike (NKE) stock fell nearly 6% in after-hours trading Thursday as the athletic apparel company provided a sluggish outlook for revenue that offset a better-than-expected quarterly earnings report. Shares initially surged after Nike said that revenue in the third quarter of fiscal 2024 inched up to $12.43 billion while earnings per share came in at 77 cents, both surpassing the consensus view of analysts. During the company's earnings call, Chief Financial Officer Matthew Friend reiterated the expectation that full-year fiscal 2024 revenue will be up about 1%. However, he said the company projects a low single digit decline in revenue in the first half of fiscal 2025. \"(T)his reflects near-term headwinds from lifecycle management of our key product franchises, more than offsetting the scaling of new products, as we shift our product portfolio toward newness and innovation,\" Friend said. \"This also continues to reflect the subdued macro outlook around the world.\" Nike shares fell 7.6% to $93.16 Friday afternoon, hitting their lowest levels since last September. -Aaron McDade and Stephen Wisnefski FedEx Stock Surges as Earnings Get a Boost From Cost-Cutting Efforts FedEx (FDX) shares soared Friday morning after the logistics company reported quarterly earnings that topped analysts' expectations, as ongoing cost-cutting efforts gave a boost to the bottom line. The shipping giant late Thursday posted adjusted net income of $966 million and diluted earnings per share (EPS) of $3.86 for the third quarter of fiscal 2024. Both numbers were higher than the year-earlier quarter and well ahead of estimates compiled by Visible Alpha. FedEx said that its efforts to trim costs and improve efficiency helped offset a decline in revenue, which fell to $21.7 billion from $22.2 billion in the year-earlier quarter. Revenue has decreased year-over-year for several consecutive quarters as FedEx has struggled to maintain the level of demand for its services that hit all-time highs during the pandemic. FedEx said it is reducing its planned capital spending for full-year fiscal 2024 to $5.4 billion, compared with the previously announced $5.7 billion. The company sees permanent cost reductions related to the DRIVE program—the cost-cutting program it announced almost a year ago—of $1.8 billion in 2024. FedEx shares were up 7.7% at $286 midday Friday, after rising as high as $291.27 earlier in the day. The stock is trading at its highest levels since mid-2021. -Aaron McDade DWAC Stock Slips as Shareholders Approve Trump Merger Shares of Digital World Acquisition Corp. (DWAC) fell on Friday after shareholders approved the blank check company’s merger with Trump Media & Technology Group (TMTG), the parent company of Donald Trump’s social media platform, Truth Social. TMTG could begin trading under the ticker “DJT,” which stands for Donald J. Trump, as early as next week. It has been a long and winding road to Friday’s vote. The merger was first announced more than two years ago, but has been delayed amid regulators' investigations of DWAC and Trump’s business. Donald Trump, who is embroiled in several high-profile court cases and racking up hundreds of millions of dollars in legal expenses and penalties, is set to own more than 50% of the business. That stake would be worth more than $3 billion at DWAC’s current valuation. Under the terms of the merger agreement, he is required to hold onto those shares for a 6-month lock-up period. But it’s possible he could be relieved of that obligation by the new company’s board. DWAC shares were up about 10% ahead of the vote on Friday. They tumbled after the approval and traded about 4% lower late in the morning. Stocks Making the Biggest Moves Premarket Gains: Losses: Stock Futures Slip After Two-Day Rally Futures contracts connected to the Dow Jones Industrial Average were less than 0.1% lower in premarket trading. S&P 500 futures were down a little more than 0.1%. Nasdaq 100 futures traded 0.3% lower about an hour before markets opened. Spencer Platt / Getty Images Investing.com. “SoundHound AI Stock Tumbles as Cantor Fitzgerald Cuts to Sell on Lofty Valuation.” Capybara Research. “SoundHound: Lies, Damned Lies, and Cheeseburger \"AI\".” UBS. \"Nvidia Corp - The Only Chip Company That Can Create Its Own Mkt; PT To $1100.\" Wedbush Securities. \"Perplexing Fall From Grace? No, Overhyped Transition Period; Best Idea, $175 TP.\" Bloomberg. \"Tesla Trims Car Output in China as EV Sales Growth Slows.\" EY. “EY Global IPO Trends 2023.” Nike. \"NIKE, INC. REPORTS FISCAL 2024 THIRD QUARTER RESULTS.\" The Motley Fool. \"Nike (NKE) Q3 2024 Earnings Call Transcript.\" Nike. \"REMARKS AS PREPARED FOR DELIVERY Q3FY24 NIKE Inc. Conference Call.\" FedEx Corporation. \"FedEx Reports Higher Third Quarter Diluted EPS of $3.51 and Adjusted Diluted EPS of $3.86.\" "
}