{
    "title": "AI chipmaker, NVIDIA to rank world's 3rd most valuable company",
    "date": "3/4/2024",
    "url": "https://interestingengineering.com/culture/nvidia-on-ai-steroids-beats-oil-giant-armco-to-be-worlds-3rd-rich-firm",
    "text": "It is also the third most valuable company in the United States. What is NVIDIA doing right? By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time. Three weeks after surpassing Google’s parent company Alphabet to become the fourth most valuable company in the world, NVIDIA has now overtaken Saudi Aramco in market value. This makes the AI chipmaker the third most valuable company in the world and in the United States, trailing only behind Apple Inc. and Microsoft Corp. At the close of Friday’s trading session, NVIDIA’s market capitalization stood at $2.06 trillion, marking its inaugural venture above the $2 trillion threshold. Meanwhile, Saudi Aramco experienced a decline in value, settling at $2.03 trillion, as per data gathered by Bloomberg. There are only four companies in the world with a market value above $2 trillion and NVIDIA has joined their ranks. Meanwhile, there’s only one company whose value is above $3 trillion, and that’s Microsoft. But the intense surge in NVIDIA’s share price has solidified the chip maker’s dominance in the high-end AI chip market, where it captures around 80 percent of the market share. The driving force behind NVIDIA’s meteoric rise lies in the unprecedented demand for its AI chips, which power data centers for complex tasks essential in AI applications. The demand for NVIDIA’s H100 accelerators remains robust, particularly from major clients like Microsoft and Meta Platforms, as Wall Street foresees sustained growth for the company. NVIDIA’s top-tier GPU lineup, featuring the Turing and Ampere series, is like the superhero of graphics cards, delivering unmatched performance and versatility that’s driving breakthroughs left and right across different fields. But NVIDIA isn’t just about killer hardware. They’ve built a bustling ecosystem around their GPUs, teaming up with developers and industry pals to fine-tune AI algorithms for their gear. And let’s not forget their savvy acquisitions, like nabbing Mellanox Technologies and ARM Holdings, which have boosted NVIDIA’s abilities and put them front and center in the AI revolution. While its share shot up mainly because of its lineup of impressive inventory, the company’s CEO, Jensen Huang is also investing in other AI companies. The companies are: chip designer Arm Holdings, medical AI company Nano-X Imaging, Recursion Pharmaceuticals which uses AI to find new drugs, a self-driving truck company Tusimple Holdings and developer of AI voice recognition SoundHound AI, reported The Motley Fool blog. Nvidia put the most money into Arm Holdings, but SoundHound AI’s stock is doing the best. It’s gone up 180 percent this year, making it worth $1.5 billion. "
}