{
    "title": "The Globe and Mail",
    "date": "3/14/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/24789452/stock-split-watch-is-nvidia-next/",
    "text": "Nvidia (NASDAQ: NVDA) has had an incredible rise since the start of 2023, up around 500%. As a direct result of its huge stock price increase, the cost of one Nvidia share is nearing $1,000. This threshold may seem arbitrary, but it's actually an important milestone with a special place in the stock market's mass psychology. Therefore, management teams often consider splitting their stocks around this nice, round number. Furthermore, Nvidia's management team has a history of enacting stock splits. Is Nvidia preparing for another split? Stock splits can have both real and artificial effects. On the artificial side, you're essentially cutting the same-sized pizza into smaller slices. Investors with access to brokerages that offer fractional shares can already cut Nvidia's stock into pieces as small as they want (usually down to one-thousandth of a share). However, not every investor (especially those outside the U.S.) has access to this capability. In that sense, Nvidia's potential stock split becomes a real factor since more investors can purchase the stock without fear of overweighting their portfolio to one company. If you only have $100 to invest this month, a stock changing hands at $1,000 per share feels out of reach (even if fractional shares are available in your favorite stock brokerage). But will Nvidia do it? The company's history of stock splits suggests that another one could be imminent. Nvidia has split its stock five times since it went on the market. The latest was in 2021, when it did a 4-for-1 split. The stock traded for around a pre-split price of $744 -- cheaper than it is today. Before that, Nvidia last split its stock in 2007, when it would have traded at a split-adjusted price of just over $50. Stock splits were far more common back then, so the instances before the 2021 split may be less useful for forecasting purposes in 2024. Now that the stock price is above 2021 pre-split levels again, I'd say Nvidia is highly likely to enact a stock split. After Nvidia announced its stock split on May 21, 2021, the stock had a strong run-up until the split took effect on July 20, increasing nearly 40% at its peak.  NVDA data by YCharts. This same time frame would also make sense in 2024, as Nvidia's annual meeting occurs in June. So if you're looking for a stock split announcement, stay tuned to Nvidia's Q1 FY 2025 results, which will be reported sometime in late May. Is right now a good time to buy the stock in anticipation of a run-up due to buying frenzies caused by a stock split? I'd say no. The only good reason to buy a stock is if the underlying business is worth owning. In Nvidia's case, the answer to that question has been a resounding \"yes,\" as its graphics processing units (GPUs) have been in high demand due to interest in artificial intelligence (AI) computing. Nvidia has continuously posted amazing revenue growth figures. Its latest results (Q4 FY 2024, ending Jan. 28) included a revenue rise of 265% to $22.1 billion and a projection for another 234% rise to $24 billion in Q1 FY 2025.) That sounds like a great business. If the company continues to post results like that, management will likely enact a stock split. While some price movement may be associated with that announcement, don't lose sight of the bigger picture: Nvidia has been one of the biggest winners so far in the AI movement. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}