{
    "title": "NVIDIA Corporation (NASDAQ:NVDA) is a favorite amongst institutional \ninvestors who own 68%",
    "date": "3/16/2024",
    "url": "https://simplywall.st/stocks/us/semiconductors/nasdaq-nvda/nvidia/news/nvidia-corporation-nasdaqnvda-is-a-favorite-amongst-institut",
    "text": "Stock Analysis If you want to know who really controls NVIDIA Corporation (NASDAQ:NVDA), then you'll have to look at the makeup of its share registry.  We can see that institutions own the lion's share in the company with 68% ownership.  Put another way, the group faces the maximum upside potential (or downside risk). Since institutional have access to huge amounts of capital, their market moves tend to receive a lot of scrutiny by retail or individual investors.  Hence, having a considerable amount of institutional money invested in a company is often regarded as a desirable trait. Let's delve deeper into each type of owner of NVIDIA, beginning with the chart below. Check out our latest analysis for NVIDIA Institutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing. As you can see, institutional investors have a fair amount of stake in NVIDIA.  This implies the analysts working for those institutions have looked at the stock and they like it. But just like anyone else, they could be wrong.  If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at NVIDIA's earnings history below. Of course, the future is what really matters. Institutional investors own over 50% of the company, so together than can probably strongly influence board decisions.    NVIDIA is not owned by hedge funds.      The company's largest shareholder is The Vanguard Group, Inc., with ownership of 8.3%.       BlackRock, Inc. is the second largest shareholder owning 7.3% of common stock, and FMR LLC holds about 4.9% of the company stock.      Additionally, the company's CEO Jen-Hsun Huang directly holds 3.5% of the total shares outstanding. On studying our ownership data, we found that 25 of the top shareholders collectively own less than 50% of the share register, implying that no single individual has a majority interest. While studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance.   There are plenty of analysts covering the stock, so it might be worth seeing what they are forecasting, too. The definition of an insider can differ slightly between different countries, but members of the board of directors always count.  The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves. I generally consider insider ownership to be a good thing. However, on some occasions it makes it more difficult for other shareholders to hold the board accountable for decisions. We can report that insiders do own shares in NVIDIA Corporation.   Insiders own US$86b worth of shares (at current prices).  we sometimes take an interest in  whether they have been buying or selling. The general public-- including retail investors -- own 28% stake in the company, and hence can't easily be ignored.   While this group can't necessarily call the shots, it can certainly have a real influence on how the company is run. While it is well worth considering the different groups that own a company, there are other factors that are even more important.    Consider for instance, the ever-present spectre of investment risk.   We've identified 1 warning sign  with NVIDIA , and understanding them should be part of your investment process. But ultimately  it is the future, not the past, that will determine how well the owners of this business will do. Therefore we think it advisable to take a look at this free report showing whether analysts are predicting a brighter future. NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures. Find out whether NVIDIA is potentially over or undervalued by checking out our comprehensive analysis, which includes fair value estimates, risks and warnings, dividends, insider transactions and financial health. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. Exceptional growth potential with outstanding track record. Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. "
}