{
    "title": "RNC Capital Management LLC Increases Stock Position in NVIDIA Co. \n(NASDAQ:NVDA)",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/rnc-capital-management-llc-increases-stock-position-in-nvidia-co-nasdaqnvda.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 RNC Capital Management LLC increased its position in shares of  NVIDIA Co. (NASDAQ:NVDA – Free Report) by 3.2% during the fourth quarter, according to its most recent Form 13F filing with the SEC. The institutional investor  owned 18,936 shares of the computer hardware maker’s stock after buying an additional 588 shares during the period. RNC Capital Management LLC’s holdings in NVIDIA were worth $9,378,000 as of its most recent filing with the SEC. Other hedge funds have also recently added to or reduced their stakes in the company. Peoples Financial Services CORP. purchased a new position in  NVIDIA during the third quarter valued at $30,000.  Your Advocates Ltd. LLP acquired a new stake in shares of  NVIDIA in the third quarter valued at about $30,000.  Quarry LP acquired a new stake in shares of  NVIDIA in the first quarter valued at about $34,000.  Compass Wealth Management LLC acquired a new stake in shares of  NVIDIA in the fourth quarter valued at about $39,000.  Finally, Trivant Custom Portfolio Group LLC raised its position in shares of  NVIDIA by 44.1% in the third quarter. Trivant Custom Portfolio Group LLC now owns 98 shares of the computer hardware maker’s stock valued at $43,000 after buying an additional 30 shares during the last quarter. 65.27% of the stock is owned by hedge funds and other institutional investors. Shares of NASDAQ NVDA opened at $903.56 on Friday. The firm has a market capitalization of $2.26 trillion, a P/E ratio of 75.68, a PEG ratio of 1.30 and a beta of 1.73. NVIDIA Co. has a one year low of $262.20 and a one year high of $974.00. The company’s fifty day moving average is $772.45 and its two-hundred day moving average is $574.01. The company has a debt-to-equity ratio of 0.20, a quick ratio of 3.67 and a current ratio of 4.17. NVIDIA (NASDAQ:NVDA – Get Free Report) last released its quarterly earnings data on Wednesday, February 21st. The computer hardware maker reported $5.16 EPS for the quarter, topping the consensus estimate of $4.21 by $0.95. NVIDIA had a net margin of 48.85% and a return on equity of 93.61%. The business had revenue of $22.10 billion for the quarter, compared to analyst estimates of $20.40 billion. During the same period in the previous year, the firm earned $0.65 EPS. The business’s revenue for the quarter was up 265.3% compared to the same quarter last year.  Analysts forecast that  NVIDIA Co. will post 22.45 EPS for the current fiscal year. The business also recently disclosed a quarterly dividend, which was paid on Wednesday, March 27th. Stockholders of record on Wednesday, March 6th were paid a dividend of $0.04 per share. This represents a $0.16 dividend on an annualized basis and a dividend yield of 0.02%. The ex-dividend date of this dividend  was Tuesday, March 5th. NVIDIA’s dividend payout ratio  is currently 1.34%. In other news, insider Donald F. Robertson, Jr. sold 450 shares of the company’s stock in a transaction dated Friday, January 5th. The shares were sold at an average price of $484.62, for a total transaction of $218,079.00. Following the completion of the transaction, the insider now owns 50,961 shares of the company’s stock, valued at approximately $24,696,719.82. The transaction was disclosed in a filing with the SEC, which is available at this hyperlink. In related news, Director John Dabiri sold 128 shares of the stock in a transaction that occurred on Monday, March 25th. The shares were sold at an average price of $940.00, for a total transaction of $120,320.00. Following the completion of the sale, the director now owns 2,055 shares of the company’s stock, valued at approximately $1,931,700. The transaction was disclosed in a filing with the SEC, which can be accessed through the SEC website. Also, insider Donald F. Robertson, Jr. sold 450 shares of the stock in a transaction that occurred on Friday, January 5th. The stock was sold at an average price of $484.62, for a total transaction of $218,079.00. Following the sale, the insider now directly owns 50,961 shares of the company’s stock, valued at approximately $24,696,719.82. The disclosure for this sale can be found here. Insiders sold a total of 105,352 shares of company stock valued at $64,853,077 in the last 90 days. 3.99% of the stock is currently owned by insiders. A number of equities research analysts have recently commented on NVDA shares. Morgan Stanley increased their target price on shares of NVIDIA from $750.00 to $795.00 and gave the company an “overweight” rating in a research report on Thursday, February 22nd. Loop Capital started coverage on shares of NVIDIA in a research report on Friday, February 16th. They set a “buy” rating and a $1,200.00 price objective for the company. Piper Sandler lifted their price target on shares of NVIDIA from $850.00 to $1,050.00 and gave the company an “overweight” rating in a research report on Wednesday, March 20th. Jefferies Financial Group lifted their price target on shares of NVIDIA from $610.00 to $780.00 and gave the company a “buy” rating in a research report on Thursday, February 22nd. Finally, Susquehanna lifted their price target on shares of NVIDIA from $850.00 to $1,050.00 and gave the company a “positive” rating in a research report on Tuesday, March 19th. Four investment analysts have rated the stock with a hold rating, thirty-seven have given a buy rating and one  has assigned  a strong buy rating to the stock. According to MarketBeat.com, the stock currently has an average rating of “Moderate Buy” and an average target price of $908.68. View Our Latest Stock Report on NVDA (Free Report) NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications.  Want to see what other hedge funds are holding NVDA? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for NVIDIA Co. (NASDAQ:NVDA – Free Report).   Receive News & Ratings for NVIDIA Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for NVIDIA and related companies with MarketBeat.com's FREE daily email newsletter. Cresta Advisors Ltd. Boosts Holdings in NVIDIA Co. (NASDAQ:NVDA) Patriot Investment Management Group Inc. Lowers Stock Holdings in NVIDIA Co. (NASDAQ:NVDA) "
}