{
    "title": "If You Invested $10,000 in Nvidia in 2020, This Is How Much You Would Have \nToday",
    "date": "1/6/2024",
    "url": "https://finance.yahoo.com/news/invested-10-000-nvidia-2020-121500166.html",
    "text": "It's no secret that Nvidia (NASDAQ: NVDA) had one of the strongest years of any stock in the market in 2023. With many companies ramping up their purchases of its class-leading graphics processing units (GPUs) for developing artificial intelligence (AI), Nvidia's revenue shot through the roof. That boom is far from over, and the stock has already responded to the sales jump incredibly. In 2023, the stock rose nearly 240%. That's a magnificent return, but what would have happened if you had held Nvidia for slightly longer than that -- say, starting in 2020? Well, the results and lessons learned might surprise you. The first thing to understand about Nvidia's business is that it is cyclical. Its GPUs are used to run arduous workloads like gaming graphics, engineering simulations, drug discovery, cryptocurrency mining, and creating AI models. The business booms when consumers are flush with cash and companies are willing to invest in their computing capabilities. Before the AI gold rush, the previous two Nvidia booms were spurred by cryptocurrency miners. Because GPUs are used to mine digital currencies, many people bought thousands of the company's chips to perform the task. This caused a sales spike in 2018 and 2021. But the problem with booms is that they are usually followed by a bust, which is exactly what happened with Nvidia. When the cryptocurrency market collapsed in 2019 and 2022, demand for GPUs evaporated, causing the company to post multiple consecutive quarters of revenue declines. Before the AI competition took off, Nvidia was still dealing with declining GPU sales, but the shot in the arm provided by AI quickly reversed its fortunes. So, if you look at how much money you would have made by investing $10,000 in Nvidia at the start of 2020, you would have experienced quite the roller coaster ride. In late 2021 (at the height of the market for many tech stocks and cryptocurrencies), Nvidia had turned a $10,000 investment into more than $50,000. But that figure was down to about $20,000 in just a few short months. In 2023, AI lifted the stock significantly, turning that original $10,000 into an incredible $82,000. There are two important lessons about Nvidia's stock that this hypothetical exercise provides: It is a cyclical company. Most of its sales aren't subscription-based, so its incredible revenue right now might not seem so incredible by next year. As a result, investors need to consider how much demand the AI market can support. Once this limit is reached, expect sales to fall, which should cause the stock to collapse. You must buy and hold companies for the long term. Many investors likely sold Nvidia stock in 2022 when it fell apart. While they were still up from their 2020 investment price, it wasn't nearly as much as if they had just held shares through the difficult times. So what should investors do with Nvidia's stock now? In my opinion, if you don't own any Nvidia stock now, it might not be a great time to establish a position due to its high valuation. However, this could be a terrible decision if the market for Nvidia's GPUs is much larger than I expect. So, taking a smaller position (no more than 1% of your portfolio) might not be a bad idea. If you've held on to Nvidia's stock for this long, it's likely a substantial part of your portfolio due to its recent performance. Taking some gains here is wise, as the shares are highly valued and still cyclical (as many investors might be forgetting). Nvidia's stock has gone through a few boom-and-bust cycles; I don't know when the next bust is coming, but I think it's prudent to prepare should it come soon. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. If You Invested $10,000 in Nvidia in 2020, This Is How Much You Would Have Today was originally published by The Motley Fool Related Quotes "
}