{
    "title": "Nvidia RTX 40-Series Enhanced Edition Cards Set for Release at Consumer \nElectronics Show",
    "date": "1/1/2024",
    "url": "http://nextunicorn.ventures/nvidia-rtx-40-series-enhanced-edition-cards-set-for-release-at-consumer-electronics-show/",
    "text": "Nvidia is gearing up for an impactful presentation at the upcoming CES event in Las Vegas, creating anticipation with rumors of unveiling new RTX Super GPUs. As the event draws near, excitement builds with regulatory filings from Nvidia’s partners hinting at the specifications of the upcoming GPUs. The RTX 4080 Super is expected to receive a mild upgrade, while the RTX 4070 series is rumored to undergo more significant improvements, though pricing remains uncertain until the official release. On January 8th, Nvidia plans to present its latest developments at 8 am PST, focusing on “AI innovations,” a theme that seems prevalent for this year’s CES. In addition to AI, the company is slated to reveal three new Super GPUs: the RTX 4080 Super, RTX 4070 Ti Super, and RTX 4070 Super. Regulatory filings from MSI, as reported by Videocardz, and teasers from Gigabyte give a glimpse into Nvidia’s plans, indicating substantial upgrades for the RTX 4070 series cards. In total, Nvidia is preparing 12 new GPUs for launch, with four variations of each SKU hitting the market. The RTX 4070 Ti Super appears to be receiving the most significant update, upgrading from a 12GB card with a 192-bit memory bus to a 16GB model with a 256-bit memory bus. Additionally, it’s expected to see an increase in CUDA cores from 7680 to 8448, while power consumption remains steady at 285W, suggesting no change in GDDR6X memory speed. Initially priced at $799, the pricing strategy for the Super version is anticipated to be competitive, especially against AMD’s 20GB Radeon 7900 XT priced around $779. Meanwhile, the RTX 4070 Super is also set for a considerable upgrade in CUDA cores, rising from 5888 to 7168, a substantial 21% increase. This is all while maintaining the same 192-bit memory bus and 12GB of GDDR6X memory. Originally priced at $599, this model faces competition from AMD’s RX 7800 XT, priced at $549, prompting curiosity about Nvidia’s pricing response. The RTX 4080 Super seems to be in line for the least dramatic upgrade, sticking with the AD103 die and retaining the 16GB memory configuration of its predecessor. It’s speculated to receive a slight increase in CUDA cores, from 9728 to 10240, which is a modest 5% enhancement. Given the minimal changes, it’s possible that the price will remain at the original $1,199, unless Nvidia decides to make it more appealing with a price drop, potentially to $999. As the tech community eagerly awaits the official unveiling, these speculations and rumored details set the stage for a potentially game-changing series of GPU launches from Nvidia. The exact specifications, performance improvements, and pricing strategies will only be confirmed at the CES presentation, where Nvidia will reveal how it plans to shape the future of gaming and AI technology with its new lineup of Super GPUs. Your email address will not be published. Required fields are marked * Comment Name * Email * Website  Have an awesome business idea?\r\nTell us more about it. 2-41-3, Persiaran Anggerik Vanilla,\nKota Kemuning Sek 31, 40460\nShah Alam, Selangor (603) 5131 2663 "
}