{
    "title": "Nvidia, TSMC CEOs meet in Taiwan as chip constraints threaten AI boom",
    "date": "1/26/2024",
    "url": "https://www.scmp.com/tech/tech-trends/article/3249848/heads-chip-giants-nvidia-tsmc-meet-taiwan-tight-chip-supply-threatens-hinder-ai-boom",
    "text": "The heads of the world’s two most valuable chip firms met in Taipei over dinner to discuss the Taiwanese firm’s role as producer of the Nvidia chips that now power the majority of generative AI training systems worldwide, Huang told reporters in Taipei. 01:36 AI chip maker ordered by US government to halt exports to China While Nvidia has said little about that low-profile tour, Huang talked openly Thursday about Taiwan and TSMC’s pivotal role in Nvidia’s business as well as the broader semiconductor sector. “The single greatest challenge in AI, of course, is scaling the capacity of AI,” Huang said before heading into his company’s local annual new year celebrations. “And so we’re working very hard, TSMC, all of our supply chain partners here, are working very hard to keep up with the demand.” “This year is going to be a huge year,” he added. Huang declined to answer questions about its China business. The Nvidia chief has previously warned that an escalation in US sanctions, designed to staunch the flow of AI training chips to China, could drive local firms to develop their own alternatives. That could harm American tech leaders in the long run. Born in Taiwan, Huang is feted like a celebrity on an island whose economy depends on technology and semiconductors in particular. Local media often feature him checking out his favourite haunts and, this week, broadcast a clip of the executive at a noodle place. Huang on Thursday acknowledged the island’s most critical industry. “It’s a rebirth of the computer industry and that’s why Taiwan is so central to that,” he said. “TSMC, the ecosystem of Taiwan system makers are all going to participate in this new era of computing.” "
}