{
    "title": "Trump vs. Biden: How the 2024 election could affect Exxon, Nvidia, and \nother stocks",
    "date": "1/28/2024",
    "url": "https://finance.yahoo.com/news/trump-vs-biden-how-the-2024-election-could-affect-exxon-nvidia-and-other-stocks-150001815.html",
    "text": "A likely Biden-Trump rematch is top of mind for investors as former president Donald Trump moves closer to clinching the GOP nomination. For investors, history suggests a strong pre-election year will carry over into the following year. Analysis from Carson Group’s Ryan Detrick found the S&P 500 has recorded gains every election year after a 20%-plus gain in the pre-election year. And while history shows stocks usually go up regardless of which party is in the White House, analysis from Goldman Sachs found that Tech is usually the worst-performing sector in the year leading up to the general election, while Utilities and Consumer Staples tend to outperform. In the near term, President Biden’s green energy push, crackdown on fossil fuels, and escalating tech war with China are among the top issues for investors. For Trump, the former president’s trade agenda, along with his pledge to \"drill baby, drill,\" have different implications for stock portfolios. Energy policy will likely be a priority for both sides of the aisle in November. Though critics of Biden’s renewable energy push argue he's waged a war on fossil fuels, the sector has performed quite well under the current administration. Exxon Mobil (XOM) and Chevron (CVX) have reported record profits, and US oil production has hit record levels. But Trump’s campaign promise to deregulate energy production and abolish current renewable energy subsidies will be another boon to the oil industry, according to Keith Bliss, global head of markets and strategy for BloxCross. \"Big oil will be able to export as much as possible to new markets,\" Bliss told Yahoo Finance. \"When you sum up the reduction in cost, the access to new markets, the reduction in regulation costs, and the ability to produce additional products with increased feedstock, then Big Oil will make even more money.\" On the other hand, Bliss warned that oil giants will \"struggle\" if President Biden is reelected, arguing the administration will likely become \"more aggressive.\" No matter who wins, some industries will be facing an uphill battle. Both Trump and Biden’s aggressive stances toward China have the potential to \"rattle investors and corporate decision makers,\" warned China Beige Book’s Shehzad Qazi. \"I think we're going to see a lot of aggressive maneuvers on the China front,\" Qazi told Yahoo Finance. Trump’s decision to target China with tariffs as high as 25% during his first term put investors on edge, while Biden's initiatives to crack down on China’s technological advancements placed chip giants in the crosshairs. Portfolio Wealth Advisors president Lee Munson warned that while neither candidate is good news for chipmakers like Nvidia (NVDA), Trump could pose a bigger risk. \"Biden has not been friendly to China, but Trump's going to be even worse,\" Munson told Yahoo Finance Live. \"When you look at Trump, he's mercurial and could just cut off the tap... and tell Nvidia they can’t sell anything.\" A total ban could be a massive hit to American chip giants. China accounted for about one-third of the sector’s global sales in 2023, with AI leaders like Nvidia (NVDA) and AMD (AMD) generating at least 20% of their revenue from the country. \"Companies that rely on China for sales or for supply chains are going to have to adapt,\" Munson added. Since Biden took office, electric vehicle sales have more than quadrupled as automakers jumped on board with the administration's ambitious EV sales goals. But the transition is proving costly for traditional automakers. Ford (F) recorded a $1.3 billion loss in its EV division in its most recent quarter; General Motors (GM) is also losing money on its EVs. \"They haven't figured out the EV market yet, and if Biden comes back in, the government will keep pushing the EV story,\" Bliss said. \"The Big Three could continue to struggle.\" Higher manufacturing costs have driven up EV price tags, making affordability an issue. Ford CEO Jim Farley told Yahoo Finance earlier this month that the company needs to lower its costs to succeed. \"We're seeing mainstream customers who are interested in EVs, but they're not convinced, and they're not going to pay a big premium,\" Farley said. \"So what it means for the [manufacturers] is cost — we have to dramatically reduce the cost.\" Investments that take into account environmental, social, and governance (ESG) factors have become a top target for Republicans ahead of the 2024 election. Trump has been vocal about his opposition to ESG initiatives in the past, promising to support \"a law to keep politics away from Americans’ retirement accounts forever.\" During the final months of his term, he pushed to discourage employers from considering ESG issues for retirement plans, a rule later reversed by Biden. The increased skepticism and scrutiny of sustainable funds from politicians and regulators has had a chilling effect on fund flows. Investors pulled a total of $13 billion from US sustainable funds in 2023, the worst year on record, according to Morningstar's data. Seana Smith is an anchor at Yahoo Finance. Follow Smith on Twitter @SeanaNSmith. Tips on deals, mergers, activist situations, or anything else? Email seanasmith@yahooinc.com. Click here for in-depth analysis of the latest stock market news and events moving stock prices. Read the latest financial and business news from Yahoo Finance Related Quotes "
}