{
    "title": "Nvidia CEO makes quiet LNY China trip amid U.S. chip controls",
    "date": "1/21/2024",
    "url": "https://fortune.com/asia/2024/01/22/nvidia-ceo-jensen-huang-lunar-new-year-trip-china-us-biden-chip-controls/",
    "text": "Nvidia Corp. co-founder Jensen Huang celebrated the new year with staff during his first trip to China in four years, a low-key tour that coincided with growing concerns about Beijing’s ability to get around US chip restrictions. He visited Nvidia’s offices in Shenzhen, Shanghai and Beijing earlier this month, according to a person familiar with the matter. Images and video of the 60-year-old donning colorful traditional garb and dancing with staff emerged online over the weekend. It wasn’t clear if he’d held formal meetings with other executives or officials, said the person, who asked not to be named discussing a private visit. Huang embarked on his tour—first reported by state newspapers off Chinese social media posts—as Nvidia’s artificial intelligence accelerators become pivotal in a tech race between Washington and Beijing. Huang has warned that an escalation in sanctions designed to cut off the flow of AI training chips could drive Chinese firms to develop their own alternatives. That could harm American tech leaders in the long run, he has said. The Nvidia co-founder name-checked Huawei Technologies Co.—which in 2023 alarmed Washington by including an advanced made-in-China processor in a smartphone—as a potential rival. An Nvidia representative confirmed Huang had celebrated the upcoming Lunar New Year with staff, without elaborating. Nvidia, which more than tripled its market value in 2023 thanks largely to its pivotal role in AI development, is up another 20% this year as investors bet on its sector leadership. It’s designed versions of its semiconductors for China that it says are compliant with successive rounds of US sanctions, as Washington watches closely. Among the social media posts, one person describing himself as an Nvidia staffer shared an image of Huang handing over a raffled Nvidia GeForce RTX 4080 graphics card. The CEO has since moved on to Taiwan, according to local newspaper EDN, for his fourth visit to the island in less than a year. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}