{
    "title": "NVIDIA commands 90% of AI GPU market, competitors are 'years from catching \nup'",
    "date": "1/29/2024",
    "url": "https://www.tweaktown.com/news/95888/nvidia-commands-90-of-ai-gpu-market-competitors-are-years-from-catching-up/index.html",
    "text": "NVIDIA has reportedly secured itself a huge 90% of the AI GPU market share, which will see competitors in the AI GPU space with years before they can begin to catch up. The huge race for AI GPU dominance sees NVIDIA set to sell 1.5 million to 2 million AI GPUs this year, with analysts from both Gartner and Moor Insights & Strategy both chiming into the AI GPU market share discussion. Moor Insights & Strategy CEO Patrick Moorhead said: \"What NVIDIA does is they help create markets and that puts competitors in a very tough situation out there, because by the time they've caught up, NVIDIA is on to the next new thing\". Gartner VP analyst Chirag Dekate said: \"Software continues to be NVIDIA's strategic moat. These ... turnkey experiences enable NVIDIA to be at the forefront of mindshare, as well as adoption\". NVIDIA, with its eyes on 1.5 million to 2 million AI GPU shipments this year, is huge, a massive 3x increase over AI GPU shipments in 2023. NVIDIA will continue shipping its current-gen Hopper H100 AI GPU, while it's beefed-up Hopper H200 is right around the corner... speaking of corners, NVIDIA's next-gen Blackwell GPU architecture and B100 AI GPU will be released this year, too. Anthony Garreffa Anthony joined the TweakTown team in 2010 and has since reviewed 100s of graphics cards. Anthony is a long time PC enthusiast with a passion of hate for games built around consoles. FPS gaming since the pre-Quake days, where you were insulted if you used a mouse to aim, he has been addicted to gaming and hardware ever since. Working in IT retail for 10 years gave him great experience with custom-built PCs. His addiction to GPU tech is unwavering and has recently taken a keen interest in artificial intelligence (AI) hardware. Similar News Related Tags © 1999-2024 Tweak Town Pty Ltd. All Rights Reserved. TweakTown® and its logo are registered trademarks. "
}