{
    "title": "3 Stocks You Can Confidently Buy After a Market Downturn",
    "date": "1/23/2024",
    "url": "https://www.fool.com/investing/2024/01/21/3-stocks-you-can-confidently-buy-after-a-market-do/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Editor's note: This article has been corrected. Microsoft does not own any portion of OpenAI; it is entitled to a share of profit distributions. 2023 was a year of recovery after an economic downturn in 2022 triggered a dramatic sell-off that saw the Nasdaq Composite plunge 33%. The challenging period highlighted vulnerabilities in many companies' business models as they suffered repeated revenue declines. However, macroeconomic headwinds also showcased the strength of companies that successfully navigated the market downturn. In 2023, the Nasdaq Composite rose more than 40%, driven by growth from a few key stocks. Tech stocks have played a crucial role in the market's recovery, as advances in areas like artificial intelligence (AI) and cloud computing made Wall Street particularly bullish. Tech is one of the most reliable industries, with its stocks never down for long. As a result, the period after a market downturn could be one of the best times to invest in the lucrative industry. Here are three stocks you can confidently buy after a market downturn. Shares in Nvidia (NVDA 0.12%) plummeted 50% in 2022 as spikes in inflation curbed consumer spending in the PC market and other areas of tech. However, the company delivered an impressive turnaround last year when its shares soared around 240%. As a leading chipmaker, Nvidia's hardware can be found powering a wide range of devices and systems from cloud platforms to artificial intelligence (AI) models, video game consoles, laptops, custom-built PCs, and more. Demand for these products is rarely down for long. Consequently, a market downturn could be the perfect time to buy Nvidia's stock at a bargain and reap the rewards over the long term. Nvidia's business model is diverse. However, its biggest growth catalyst for now is likely AI. According to Grand View Research, the AI market is projected to expand at a compound annual growth rate of 37% until at least 2030, which would see it exceed a value of $1 trillion. Meanwhile, Nvidia has achieved a powerful role in the sector with its graphics processing units (GPUs) -- the chips necessary to train and run AI models. In 2023, Nvidia's GPUs became the preferred chips for AI developers worldwide, leading to soaring earnings. In the third quarter of 2024 (ending October 2023), the company posted revenue growth of 206% year over year as operating income rose 1,600% thanks to soaring chip sales.  Data by YCharts This chart shows Nvidia's earnings could hit $24 per share by fiscal 2026. That figure, multiplied by its forward price-to-earnings ratio of 45, implies a potential stock price of $1,080. If projections are correct, its stock will rise 95% over the next two fiscal years. The company has come back strong after a market downturn, making its stock an excellent long-term investment. Amazon's (AMZN 0.31%) e-commerce business was also hit hard by macroeconomic headwinds in 2022. Consumer pullback led to steep declines in retail profits and a tumbling stock price. However, the company's performance last year proved why it's one of the most reliable stock investments over the long term, as it strategically brought its business back to growth. Poor market conditions led Amazon to introduce a range of cost-cutting measures, such as closing or canceling construction on dozens of warehouses, laying off thousands of employees, and sunsetting unprofitable divisions like Amazon Care. The restructuring paid off, as the company's free cash flow has soared 427% over the last year. Amazon's ability to successfully navigate economically challenging conditions makes it an excellent option after a market downturn. The company is using its significant cash reserves to invest in AI and its highly profitable cloud platform, Amazon Web Services (AWS). The company's price-to-sales ratio currently sits at an attractive 2.8, indicating its stock is trading at a value and is a no-brainer right now. Microsoft (MSFT -0.17%) is not only a great option after a market downturn, but also during one.  Data by YCharts In 2022, while companies across tech felt the pangs of poor market conditions, Microsoft was not unscathed. However, the chart above shows that it was one of the few to still outperform the Nasdaq Composite, experiencing more moderate declines than many of its rivals. The company's greater focus on the commercial and digital markets, such as productivity software and cloud computing, made it less vulnerable to economic declines than its peers. Moreover, in 2023, the company's shares shot up 57% as it emerged as one of the principal names in AI. Its investment in ChatGPT developer OpenAI generated a lot of investor enthusiasm and gave it access to some of the most advanced AI models in the industry. Microsoft has so far used OpenAI's tech to bring AI upgrades across its product lineup, including Bing, Azure, and its popular Office productivity programs. The massive user base for these platforms could see the company become the go-to for consumers and businesses everywhere looking to boost efficiency with AI. The company's stock trades at a premium, with a price-to-earnings ratio of 36. However, with proven reliability and $63 billion in free cash flow, Microsoft has earned its high price tag. It's a screaming buy for anyone looking for a consistent long-term investment. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}