{
    "title": "If You Invested $1000 in Nvidia a Decade Ago, This is How Much It'd Be \nWorth Now",
    "date": "1/31/2024",
    "url": "https://finance.yahoo.com/news/invested-1000-nvidia-decade-ago-133004805.html",
    "text": "How much a stock's price changes over time is important for most investors, since price performance can both impact your investment portfolio and help you compare investment results across sectors and industries. Another thing that can drive investing is the fear of missing out, or FOMO. This particularly applies to tech giants and popular consumer-facing stocks. What if you'd invested in Nvidia (NVDA) ten years ago? It may not have been easy to hold on to NVDA for all that time, but if you did, how much would your investment be worth today? Nvidia's Business In-Depth With that in mind, let's take a look at Nvidia's main business drivers. NVIDIA Corporation is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit, or GPU. Over the years, the company’s focus has evolved from PC graphics to artificial intelligence (AI) based solutions that now support high performance computing (HPC), gaming and virtual reality (VR) platforms.NVIDIA’s GPU success can be attributed to its parallel processing capabilities supported by thousands of computing cores, which are necessary to run deep learning algorithms. The company’s GPU platforms are playing a major role in developing multi-billion-dollar end-markets like robotics and self-driving vehicles.NVIDIA is a dominant name in the Data Center, professional visualization and gaming markets where Intel and Advanced Micro Devices are playing a catch-up role. The company’s partnership with almost all major cloud service providers (CSPs) and server vendors is a key catalyst.NVIDIA’s GPUs are also getting rapid adoption in diverse fields ranging from radiology to precision agriculture. The company’s GPUs power the top supercomputer in the world, located at Oak Ridge National Laboratories in the United States, as well as the top supercomputers in Europe and Japan.Santa Clara, CA-based, NVIDIA reported revenues of $26.97 billion in fiscal 2023, slightly up from $26.91 billion in fiscal 2022.Beginning first-quarter fiscal 2021, NVIDIA started reporting revenues under two segments – Graphics and Compute & Networking.Graphics includes GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems.Compute & Networking comprises Data Center platforms and systems for AI, HPC, and accelerated computing; DRIVE for autonomous vehicles; and Jetson for robotics and other embedded platforms. Mellanox revenues included in this segment beginning second-quarter fiscal 2021.Graphics and Compute & Networking accounted for 44% and 56% of fiscal 2023 revenues, respectively. Bottom Line Anyone can invest, but building a successful investment portfolio takes a combination of a few things: research, patience, and a little bit of risk. So, if you had invested in Nvidia a decade ago, you're probably feeling pretty good about your investment today. A $1000 investment made in January 2014 would be worth $159,730.28, or a gain of 15,873.03%, as of January 31, 2024, according to our calculations. This return excludes dividends but includes price appreciation. Compare this to the S&P 500's rally of 174.50% and gold's return of 57.04% over the same time frame. Analysts are forecasting more upside for NVDA too. NVIDIA's Compute & Networking revenues are gaining from the strong growth of artificial intelligence (AI), high-performance computing and accelerated computing. The data center end-market business is likely to benefit from the growing demand for generative AI and large language models using graphic processing units (GPUs) based on NVIDIA Hopper and Ampere architectures. A surge in hyperscale demand and a solid uptake of AI-based smart cockpit infotainment solutions are acting as tailwinds. Collaborations with Mercedes-Benz and Audi are likely to advance its presence in autonomous vehicles and other automotive electronics space. We expect NVIDIA’s revenues to witness a CAGR of 53.7% through fiscal 2024-2026. However, its near-term prospects are likely to be hurt by softening IT spending amid macroeconomic headwinds. Over the past four weeks, shares have rallied 30.32%, and there have been 1 higher earnings estimate revisions in the past two months for fiscal 2024 compared to none lower. The consensus estimate has moved up as well. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}