{
    "title": "If You Like Nvidia, Then You Will Love These 2 Hot AI Stocks",
    "date": "2/11/2024",
    "url": "https://www.fool.com/investing/2024/02/11/if-you-like-nvidia-then-love-these-2-ai-stocks/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) could be about to do the unthinkable. The company was worth less than $100 billion five years ago. And now, it is less than 5% away from surpassing both Alphabet and Amazon in market cap, and around 15% away from reaching a $2 trillion valuation. The market is in forward-looking mode, as evidenced by the willingness to pay a pretty penny for results that are still likely years down the road. But if artificial intelligence (AI) is a sustained game changer, then investors buying red-hot stocks at all-time highs could be making the right move over the long run. Here's why Nvidia, Taiwan Semiconductor Manufacturing (TSM -0.47%), and Microsoft (MSFT -0.17%) are three top growth stocks to buy now. Image source: Getty Images. Scott Levine (Nvidia): It's hard to imagine that a company with a market capitalization that exceeds $1.7 trillion is still in growth mode, but that seems to be the case with Nvidia. Thanks to the skyrocketing demand for artificial intelligence -- and the significant computing requirements of deep learning and analytics -- the company's data center business is booming. And it shows no signs of slowing down as AI continues to pervade more and more areas of our lives. Nvidia achieved record financial results in its fiscal third quarter of 2024, ended Oct. 29, 2023, smashing its guidance of $16 million in revenue and reporting $18.1 billion on the top line. To what does the company attribute this stellar performance? Its data center business. Up 279% year over year, Nvidia's data center business drove the strong quarterly performance, and it's expected to extend into the fourth quarter. Nvidia expects to break another record and report quarterly revenue of $20 billion in the fiscal fourth quarter of 2024. It's not solely on the income statement where Nvidia is seeing explosive growth. The cash-flow statement is also prospering thanks to the strong data center business. Through the first three quarters of fiscal 2023, Nvidia reported free cash flow of over $2 billion. In fiscal 2024, however, Nvidia has reported a whopping $15.7 billion in free cash flow. Nvidia is continually innovating to stay at the vanguard of the AI industry. This week, for example, it announced a partnership with Cisco Systems that will even further enhance its data center business. Using Nvidia's Tensor Core GPUs in Cisco's servers, Nvidia believes it will \"enable optimal performance across a broad array of AI and data-intensive workloads in the data center and at the edge.\" Lee Samaha (Taiwan Semiconductor): The explosion of interest in AI and global 5G rollouts is translating into unprecedented demand for energy-efficient computing power. As such, data centers and communication companies need to invest in high-performance computing (HPC) solutions, and that means chips manufactured by semiconductor foundries like Taiwan Semiconductor. For reference, Nvidia, Qualcomm, and Apple are all clients of Taiwan Semiconductor. As a foundry, the company neither designs nor markets semiconductors under its name. Instead, it focuses on manufacturing for its customers. According to CEO C.C. Wei on the recent earnings call, \"almost all the AI innovators are working with TSMC,\" and management's projection of low- to mid-20% revenue growth (in U.S. dollar terms) for 2024 is built on \"robust AI-related demand.\" Taiwan Semiconductor's management is particularly excited by its 2 nanometer, or N2, technology (a new generation of chips), with Wei noting, \"We are observing a much higher level of customer interest and engagement at N2 as compared with N3 at a similar stage from both HPC and the smartphone applications.\" Given that its N2 technology will be introduced in 2025, and management is forecasting strong revenue growth for 2024 already, it's clear the company has favorable AI-driven tailwinds behind it. It adds up to make Taiwan Semiconductor an excellent play on AI and a cyclical return to growth in the economy. Daniel Foelber (Microsoft): Nvidia is top of mind when it comes to investing in leading AI companies. At this rate, it may soon become the third most valuable U.S.-based company. But it's still far away from surpassing Microsoft or Apple. I think Microsoft can become the first $4 trillion company, and the reason is beautifully simple. Microsoft has direct ways to implement AI solutions across its consumer and (more importantly) enterprise customers. This is a similar market opportunity to Nvidia, which is mainly selling to businesses, not consumers. And I think this is the far more lucrative and easier path toward AI, at least for now, than the consumer market (like the Apple Vision Pro). AI-powered enterprise solutions have a straightforward purpose -- making the task easier, better, and less time-consuming. Microsoft has real results from its \"everyday AI companion\" Microsoft Copilot. This generative AI solution fits into several Microsoft software products, like its flagship Microsoft 365. Microsoft's cloud business is another sandbox for AI to thrive. Microsoft reported 53,000 Azure AI customers last quarter, with over one-third joining Azure over the past 12 months. GitHub, Microsoft's developer program, is another place where AI is having an immediate impact. Microsoft grew GitHub revenue by 40% in the fiscal second quarter of 2024, ended Dec. 30, 2023, compared to the same quarter last fiscal year. The company attributed the growth to GitHub Copilot, which has over 1.3 million paid subscribers, a 30% increase in just one quarter. The growth is there for Microsoft. It has many levers it can pull and is showing traction across multiple AI solutions. Microsoft also trades for a 37.3 price-to-earnings ratio, significantly below Nvidia's 92.6 ratio. Neither stock is cheap by any means. But given Microsoft's unique combination of brand power, diversification, cash flow, legacy businesses, and growth potential, the stock is still a good value and has room to run from here. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Daniel Foelber has no position in any of the stocks mentioned. Lee Samaha has no position in any of the stocks mentioned. Scott Levine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Cisco Systems, Microsoft, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}