{
    "title": "Unlike the Internet Bubble, AI Is \"Not Hype,\" Says JPMorgan CEO Jamie \nDimon. 1 Stock to Buy Hand Over Fist if He's ...",
    "date": "2/28/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/NVDA-Q/pressreleases/24416903/unlike-the-internet-bubble-ai-is-not-hype-says-jpmorgan-ceo-jamie-dimon-1-stock-to-buy-hand-over-fist-if-hes-right/",
    "text": "In a far-reaching interview on Monday with CNBC’s Leslie Picker, outspoken JPMorgan Chase(NYSE: JPM) CEO Jamie Dimon addressed the debate over the growing interest in all things artificial intelligence (AI) and whether or not the technology is more hype than substance. Some market commentators are starting to suggest there's a bubble in AI stocks, and it's bigger than the dot-com bubble in the late 1990s. Dimon categorically refutes that assertion, saying there's no comparison. Image source: Getty Images. Dimon told Picker on CNBC: When we had the internet bubble the first time around ... that was hype. This is not hype. It's real. People are deploying [AI] at different speeds, but it will handle a tremendous amount of stuff. He went even further, arguing that generative AI will eventually \"be used in almost every job\" and could even cure cancer, \"because it can do things the human mind simply cannot do.\" If Dimon's views hold true, then there is potential gains to be had by investing in AI-related ventures. If I could buy just one stock to capture the accelerating adoption of AI, it would have to be Nvidia(NASDAQ: NVDA). After pioneering the graphics processing units (GPUs) that render lifelike images in video games, the company adapted the technology to withstand the rigors of AI. Parallel processing, which breaks down larger computational jobs into smaller, more manageable chunks, works equally well for AI as it did in gaming. Furthermore, Nvidia has expanded beyond the processor itself, providing turnkey AI systems that include the chips and the software that makes them more efficient. Cloud and data center operators are scrambling to revamp their systems to handle the massive influx of AI, an upgrade cycle that could be worth more than $1 trillion. Furthermore, with an estimated 95% share of the GPU data center market, Nvidia will likely reap the lion's share of the rewards. If you have any doubts, consider this: In its fiscal 2024 fourth quarter (ended Jan. 28), Nvidia's revenue grew 265% year over year to $22.1 billion, while adjusted earnings per share surged 486% to $5.16. That's why Nvidia is the one stock to buy hand over fist to profit from the AI boom that Jamie Dimon is confirming. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Danny Vena has positions in Nvidia. The Motley Fool has positions in and recommends JPMorgan Chase and Nvidia. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Nvidia Corp stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}