{
    "title": "Nvidia's Latest Move Could Make It a Hot Buy for EV Investors, Too",
    "date": "2/3/2024",
    "url": "https://www.fool.com/investing/2024/02/03/nvidias-latest-move-could-make-it-a-hot-buy-for-ev/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Electric vehicle (EV) stocks have been crashing in the early part of 2024. Tesla, Rivian, and Nio have all fallen more than 20% already to start the year. As competition ramps up in the EV market and concerns rise about affordability, investors have been moving away from these stocks. One stock that could be an underrated EV play is Nvidia (NVDA 0.12%). The company is known for being a top artificial intelligence (AI) stock, but the popular chipmaker could also benefit from the EV market's growth. Here's why. Nvidia has an AI platform, Nvidia Drive, which can be used to help with driver assistance and automated driving. Rather than doing AI in the cloud, it can be done right within the car, as the platform can analyze all the data that a vehicle can accumulate, including sensory data and even video, to convert all of that into useful information that can then assist drivers. Danny Shapiro, Nvidia's vice president for automobiles, told Yahoo Finance that the goal is to eventually get to self-driving capabilities. The company is working on this with Mercedes-Benz but admits it doesn't have a timeline for when a self-driving car might be ready. Nvidia has spent more than a decade, with Shapiro saying, \"I think the entire industry underestimated the complexity.\" He added that safety is the company's top priority. Nvidia's growth has been explosive thanks to AI, but one area of its operations that remains fairly modest is its automotive segment. Over the nine-month period ending Oct. 29, 2023, it reported $810 million in automotive revenue. That represents just 2% of the more than $38.8 billion in total revenue that the company accumulated during that time. While automotive revenue did increase 33% year over year, it's still a fairly small part of the overall business. As the company develops an AI platform for vehicles that can potentially one day lead to a self-driving solution, Nvidia could make for an underrated EV investment since it has a lot to gain from the industry's growth and success. The risk with EV stocks these days is that the industry is still in its early stages. Prices are high, competition is fierce, and there's a lot of ambiguity as to which manufacturer will end up the big winner. If Nvidia is simply building an AI platform that could potentially be used by other car manufacturers, it doesn't need to worry about which will be the top EV brand. Its AI chips helped create an advanced chatbot in ChatGPT, and if it can achieve similar results for the automobile industry, the company could be on the cusp of yet another promising growth opportunity. And by investing in Nvidia, growth investors don't have to worry about being too exposed to just one industry. With a strong, growing, and profitable business already, Nvidia is in great shape, and it can be one of the safer ways to invest in the EV market. David Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nio, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}