{
    "title": "After Sam Altman, SoftBank founder Masayoshi Son joins AI chip race to \nchallenge Nvidia dominance",
    "date": "2/17/2024",
    "url": "https://www.businesstoday.in/technology/news/story/after-sam-altman-softbank-founder-masayoshi-son-joins-ai-chip-race-to-challenge-nvidia-dominance-417918-2024-02-17",
    "text": "Feedback The race for dominance in the realm of generative AI is reaching new heights as SoftBank's Founder and CEO, Masayoshi Son, unveils ambitious plans to raise a staggering $100 billion for his AI venture. This move is seen as a direct challenge to the supremacy of graphics chip giant Nvidia. Reports from Bloomberg suggest that SoftBank intends to inject $30 billion of its own capital into the venture, with an additional $70 billion sought from investment firms in the Middle East. This substantial investment aims to bolster SoftBank's position in the AI sector and could potentially disrupt the market dynamics currently dominated by Nvidia. The proposed AI venture is expected to synergise with the operations of UK chip designer Arm, in which SoftBank holds a commanding 90 per cent stake following its IPO. Recent developments have propelled Arm into the spotlight, with its shares experiencing an uptick following Nvidia's disclosure of a $147.3 million investment in the company, backed by SoftBank. This strategic move underscores the evolving landscape of the tech industry, where major players are vying for supremacy in emerging fields such as AI and chip design. SoftBank's journey with Arm has been eventful, marked by the acquisition of the company for $32 billion in 2016. However, attempts to sell Arm to Nvidia for $40 billion in 2022 were thwarted by regulatory challenges, highlighting the complexities inherent in such high-stakes transactions. Masayoshi Son is not alone in his quest to reshape the future of AI. According to reports from the Wall Street Journal, Sam Altman, Co-founder and CEO of OpenAI, is actively engaging with investors, including the UAE government, to secure funding for a transformative tech initiative aimed at enhancing global chip-building capacity. This ambitious project, which could necessitate raising up to $5 trillion to $7 trillion, underscores the growing demand for cutting-edge technologies to power AI applications. Altman has repeatedly emphasised the need for expanded GPU capabilities to support OpenAI's ambitious objectives in AI research and development. With global chip sales reaching $527 billion last year and projected to surpass $1 trillion annually by 2030, the race to harness the potential of AI is set to intensify. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}