{
    "title": "Hon Hai says it is planning AI cooperation with Nvidia",
    "date": "3/20/2024",
    "url": "https://focustaiwan.tw/business/202403210008",
    "text": "Taipei, March 21 (CNA) Hon Hai Precision Industry Co. Chairman Young Liu (劉揚偉) has said that details of cooperation on artificial intelligence (AI) with Nvidia Corp. are expected to be announced in June. Liu made the remark while speaking with reporters at Nvidia's GPU technology conference (GTC) in San Jose, California, at which Hon Hai had a booth, demonstrating AI servers and smart driving innovations. Liu said he had discussed cooperation on AI with Nvidia CEO Jensen Huang (黃仁勳) during a meeting at Hon Hai's pavilion Wednesday, adding that the two companies hoped to unveil part of their partnership during Computex Taipei from June 4-7. Liu added Huang is expected to make the announcement himself when he visited Computex 2024, one of the largest computer trade exhibitions in the world. The Hon Hai chairman said he attended a keynote speech delivered by Huang on Monday, the first day of the GTC, where the Nvidia CEO expressed optimism toward the development of generative AI and had faith that the emerging technology will bring a big change to the world. Generative AI refers to AI that can generate new forms of creative content, including audio, code, images, text, simulations and videos, according to market information advisory firm Gartner. Liu said Hon Hai, the world's largest contract electronics maker, has long devoted itself in hardware development and now is seizing the opportunities created by AI to allow itself to become a supplier of solution platforms to its clients. Hon Hai, also known as Foxconn globally, is one of the largest suppliers to Apple Inc., rolling out generations of the flagship iPhones. According to Liu, Hon Hai has assigned its efforts in AI development to three major platforms: smart manufacturing, smart electric vehicles and smart city development. Through the integration of generative AI applications, these three platforms will be able to build a more efficient and useful big data base, Liu said. At an investor conference on March 14, Liu gave guidance for 2024, saying sales generated by AI servers are expected to grow more than 40 percent from a year earlier with AI servers estimated to account for over 40 percent of the company's total server revenue. Liu has upgraded his forecast for Hon Hai's AI operations to \"significant\" growth from an earlier \"neutral\" in November after considering fast-growing generative AI applications. Hon Hai shares have moved sharply higher as investors had embraced high hopes about the company's AI efforts, market analysts said, adding that as a market laggard, the stock also attracted many bargain hunters. Since the beginning of this month, Hon Hai shares had soared about 34 percent before Thursday to replace smartphone IC designer MediaTek Inc. to become the second largest stock in terms of market value, only trailing contract chipmaker Taiwan Semiconductor Manufacturing Co. (TSMC). Commenting on the high-flying share price, Liu said he had no idea how the stock fluctuated in recent sessions, but he believed the value of a company would be reflected in its share price eventually. (By Chung Jung-feng, Chang Hsin-yu and Frances Huang) Enditem/ASG "
}