{
    "title": "Nvidia adds generative AI to power humanoid robots",
    "date": "3/18/2024",
    "url": "https://www.thehindu.com/sci-tech/technology/nvidia-adds-generative-ai-to-power-humanoid-robots/article67967348.ece",
    "text": "To enjoy additional benefits CONNECT WITH US March 19, 2024 11:35 am | Updated 11:35 am IST - SAN FRANCISCO CEO Jensen Huang speaks beside a robot to conclude his keynote address of Nvidia GTC in San Jose, Calif., Monday, March 18, 2024.\n| Photo Credit: AP  Nvidia on Monday announced a hardware and software platform for building human-like robots that includes generative artificial intelligence features. The new platform will consist of a computer system that will power the robot and AI, plus a package of software including genAI and other tools in order to build robots that are human-life, the company said at its annual developer conference. The addition of genAI will let the humanoid robots take actions based on inputs with a combination of language, video, \"human demonstrations,\" and past experiences. Called Project GR00T, the genAI components will add to the company's existing hardware and software platform for robotics. \"These smarter, faster, better robots will be deployed in the world's heavy industries,\" said Rev Lebaredian, Vice President, Omniverse and Simulation Technology, in a briefing with reporters. \"We are working with the world's entire robot and simulation ecosystem to accelerate development and adoption.\" (For top technology news of the day, subscribe to our tech newsletter Today’s Cache) The powerful computer behind the genAI software is called the \"Jetson Thor\" and is based around one of the company's AI chips and other hardware. Th computer will give a robot enough computing horsepower to perform complex tasks and interact with people and machines, the company said. The suite of software tools is called the \"Isaac\" platform, and the new GR00T genAI features are designed to operate for \"any robot embodiment in any environment,\" it said. The tools include the ability to train the software to make better decisions over time, a process known as reinforcement learning. Nvidia also said it would release pre-trained robotics models and other software that will improve robotic arm functions and multi-camera sensing capabilities. technology (general)\n\n/\n\nArtificial Intelligence\n\n/\n\nWorld\n\n/\n\nemerging technologies BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. "
}