{
    "title": "ASX Small Cap Lunch Wrap: Market dives to three-week low, junior extends \ndeal with hot AI stock NVIDIA",
    "date": "3/14/2024",
    "url": "https://stockhead.com.au/news/asx-small-cap-lunch-wrap-market-dives-to-three-week-low-junior-extends-deal-with-hot-ai-stock-nvidia/",
    "text": "Pic: Getty Images News March 15, 2024March 15, 2024 |  Nadine McGrath Link copied to clipboard Aussie markets are down to a three week-low in morning trade, as the heavyweight materials sector lead broad sell-offs. At 12.06pm (AEDT) on Friday, March 15, the S&P/ASX 200 had fallen 1.39% to 7606 points.  Pity the poor schoolchildren in Miss I. Elder’s class at Wormit Primary School in Scotland in 1984.  Elder was a terrible teacher who made her kids do maths, according to a message in a bottle found washed up on a beach ~10km from the school recently. Jenny Smith told the BBC she was filling bags with trash along the Tay Estuary in Angus when she found the message in a bottle. “I picked up three bin bags of rubbish and found this bottle, and I thought there was something like a felt-tip pen inside it,” Smith says. Instead she found a map with an elastic band around it. Smith says the girl who drew the map had cleverly used wax crayon as the outside wrapping protecting it from water that had managed to seep in over the years. Inside the map was three messages, written by a trio of 8-year-olds. “Please please help me,” one of the notes reads. “I am one of the crew of Wormit Primary School and have been taken captive by the terrible Miss I. Elder. “My name is Kelly McColm and I am age 8. “Well back to Miss L. Elder, she makes us do awful work like sums and I am just managing to write this letter in private. PLEASE someone help me!” Jenny wrote a post on the local Wormit Community Facebook Group about the messages in a bottle and quickly received responses, including one from Linda Bell, who still lives in the village. “When I first read Jenny’s Facebook post and saw that the date on the letters from Wormit Primary was June 1984, I thought that I must know who the letters were written by,” Linda told the BBC. “When I read further, I realised that one of the pupils that wrote one of the letters was me and the other two letters were written by my primary school friends, Anna and Kelly.”   And today’s message in a bottle for investors is the “ASX has continued its pretty crappy week hitting a three-week low on Friday, March 14, 2024.” Just two sectors remain in the green at lunchtime today with energy rising 0.86% and realestate barely up 0.1%. Leading the laggards is the materials sector which has slumped 2.16%, followed by discretionary down 1.92% and financials falling 1.64%. Major banks are all heading downwards today, with Westpac (ASX:WBC)  the weakest performer down ~3%. Iron ore miners are also falling with Fortescue (ASX:FMG) losing 2.77% at lunchtime.  Lithium miners are suffering losses with Liontown Resources (ASX:LTR) down by 6.2%. Tabcorp Holdings (ASX:TAH) is down 6.27% after announcing its embattled CEO and managing director Adam Rytenskild has resigned. “The Tabcorp board became aware of inappropriate and offensive language used by Mr Rytenskild in the workplace,” TAH says in the ASX announcement. “Mr Rytenskild will receive only the termination payments required by law and under his contract and will forfeit all his unvested short term incentive and long term incentive awards.  Ariadne Australia (ASX:ARA) is paying 0.25 cents fully franked\nCAR Group Limited (ASX:CAR) is paying 34.5 cents 50 per cent franked\nDuratec (ASX:DUR) is paying 1.5 cents fully franked\nKaizen Global Inv (ASX:KGI) is paying 5 cents fully franked  Overnight on Wall Street, the tech-heavy NASDAQ and the broader S&P500 both lost 0.3%. The Dow Jones Industrial fell over 100 points or 0.35% to end its 3-day winning streak. Hotter-than-expected PPI data was released overnight which combined with higher than anticipated US inflation figures, released earlier this week, had investors pondering if the US Federal Reserve might wait longer than expected to cut interest rates. The Bureau of Labor Statistics reported that the producer price index for final demand rose by 0.6% in February, double the unchanged 0.3% increase in January and the most since August 2023, with the price of fuel and food surging. Economists surveyed by Reuters had anticipated a 0.3% uptick in the PPI with the higher than expected number along with the latest inflation figures raising concerns inflation prices may once again be ticking upwards. Also overnight, initial jobless claims came in unexpectedly lower, but retail sales disappointed. The PPI figures are the last of the major reports to come in before the Fed meets next week. Selling in New York was focused on property stocks, utilities, and healthcare – the three major laggards overnight. At lunchtime in Sydney US futures are pointing to another weaker night on Wall Street to end the week.  Oil prices have retreated at lunchtime coming off their upward trend as domestic US demand improves and the squeeze continues on the geopolitical front. WTI is currently down 0.06% to US$81.21/barrel, while Brent is down 0.12% to US$85.32/barrel. Iron ore continues its downward trajectory falling 1.86% to US$1.05/tonne. Prices of the steel making material are down almost 11% this week and 22% YTD following a host of concerns including a glut of global supply and decreasing demand in China. Gold is up 0.05% to US$2162.09/ounce, while copper has also risen, up 0.38% to US$4.05/lb. The Aussie dollar is down 0.28%, currently buying US67 cents, while the world’s most popular cryptocurrency is down 0.17% today to US$70,603.  Here are the best performing ASX small cap stocks for March 15 [intraday]: Swipe or scroll to reveal full table. Click headings to sort: LW winners Code Company Price % Volume Market Cap 5GG Pentanet 0.076 52% 49,556,269 $18,686,361 MCT Metalicity Limited 0.003 50% 110,000 $8,970,108 KAL Kalgoorlie Gold Mining 0.027 35% 7,579,325 $3,170,014 MRD Mount Ridley Mines 0.002 33% 869,755 $11,677,324 NES Nelson Resources 0.004 33% 1,454,017 $1,840,783 ASP Aspermont Limited 0.012 33% 1,970,000 $22,100,712 TSL Titanium Sands Ltd 0.009 29% 253,622 $13,956,112 ASR Asra Minerals Ltd 0.005 25% 305,201 $6,655,983 MHC Manhattan Corp Ltd 0.003 20% 820,000 $7,342,449 NRX Noronex Limited 0.012 20% 2,906,286 $3,783,018 IMI Infinitymining 0.073 20% 10,000 $7,243,957 FNX Finexia Financialgrp 0.225 18% 5,008 $9,358,013 RR1 Reach Resources Ltd 0.0035 17% 153,501 $9,835,977 BNZ Benzmining 0.15 15% 20,000 $14,466,137 GGE Grand Gulf Energy 0.008 14% 62,625 $14,666,729 GSR Greenstone Resources 0.008 14% 25,614 $9,576,794 SP8 Streamplay Studio 0.008 14% 2,454,198 $8,054,366 TTI Traffic Technologies 0.008 14% 100,000 $5,303,691 XAM Xanadu Mines Ltd 0.049 14% 6,994,646 $73,788,258 QML Qmines Limited 0.074 14% 76,069 $14,088,296 BKT Black Rock Mining 0.07 13% 4,377,686 $68,043,289 ATH Alterity Therap Ltd 0.0045 13% 770,008 $20,952,072 CCZ Castillo Copper Ltd 0.0045 13% 1,001,000 $5,198,021 CTO Citigold Corp Ltd 0.0045 13% 1,650,000 $12,000,000 SRR Saramaresourcesltd 0.018 13% 360,276 $1,283,505 Wordpress Table Plugin Cloud gaming stock Pentanet (ASX:5GG) says its will extend the GeForce NOW Alliance Partner Agreement with hotter-than-hot AI stock NVIDIA to include New Zealand, with more territories to come. “Pentanet has fostered a deeply engaged cloud gaming community in Australia with GeForce NOW Powered by CloudGG. Its commitment to delivering GeForce RTX 3080-level performance that elevates experiences for gamers nationwide and\nunderscores the company’s dedication to pushes the boundaries of gaming and internet connectivity,” NVIDIA GeForce NOW vice president Phil Eisler says. Kalgoorlie Gold Mining (ASX:KAL) has drilled into thick, shallow gold at the Kirgella Gift prospect, which shows early similarities to the nearby Rebecca project of miner Ramelius Resources (ASX:RMS). Highlights include 33m at 3.10g/t from 51m depth. Black Rock Mining (ASX:BKT) has secured a $53.4 million loan approval from The Industrial Development Corporation. BKT says it will proceed to finalise full form facility agreements and determine the ultimate structure of the Mahenge project’s debt package.  Here are the most-worst performing ASX small cap stocks for March 14 [intraday]: Swipe or scroll to reveal full table. Click headings to sort:  Northern Territory-focused explorer Litchfield Minerals (ASX:LMS) listed on the ASX this morning following an oversubscribed $5 million IPO. The company’s shares were holding firm at the 20c issue price at the time of writing. Proceeds from the IPO will go towards a maiden drilling program at the Mount Doreen copper project, about 350km north-west of Alice Springs, expected to begin imminently. Mount Doreen is also prospective for uranium and sits right next door to the Bigryli deposit being developed by Energy Metals (ASX:EME). LMS also announced Peter Harding-Smith has been appointed company secretary and chief financial officer.  At Stockhead, we tell it like it is. While Litchfield Minerals is a Stockhead advertiser, it did not sponsor this article. Link copied to clipboard Get the latest Stockhead news delivered free to your inbox.  It's free. Unsubscribe whenever you want. By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy. News March 26, 2024   |        Gregor Stronach News March 14, 2024   |        Nadine McGrath News March 8, 2024   |        Nadine McGrath Mining Mining Mining Get the latest stock news and insights straight to your inbox.  By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy. Stockhead is providing factual information where there is a reasonable likelihood of doubt.\n\t\t\t\t\t\tThe information is not intended to imply any recommendation or opinion about a financial product. A note about relevant advertising \n\t\t\t\t\t\tWe collect information about the content (including ads) you use across this site and use it to make both advertising and content more relevant to you on our network and other sites.\n\t\t\t\t\t\tThis is also known as Online Behavioural Advertising. You can find out more about our policy and your choices, including how to op-out here For investors, getting access to the right information is critical. Stockhead’s daily newsletters make things simple: Markets coverage, company profiles and industry insights from Australia’s best business journalists – all collated and delivered straight to your inbox every day. Markets coverage, company profiles and industry insights from Australia’s best business journalists – all collated and delivered straight to your inbox every day. It’s free. Unsubscribe anytime. By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy.  Get the latest Stockhead news delivered free to your inbox.   Email Lists\n\n\nMorning Update\n\n\nLunch Update\n\n\nMarket Close Update\n\n\nWeekend Update By proceeding, you confirm you understand that we handle personal information in accordance with our Privacy Policy "
}