{
    "title": "Nvidia Stock Soared 82.5% in the 1st Quarter of 2024 -- Here's What Drove \nthe Leading AI Stock",
    "date": "3/30/2024",
    "url": "https://www.fool.com/investing/2024/03/30/nvda-stock-gain-first-quarter-2024-ai-stocks/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) stock soared 82.5% in the first quarter of 2024. (The market's quarter ended on Thursday, as U.S. financial markets were closed on Friday for the Good Friday holiday.) That performance made the artificial intelligence (AI) chip leader the second-best performer on the S&P 500 index, behind only Super Micro Computer, a server specialist that's also benefiting from strong demand for AI products and services. For context, in the first quarter, the S&P 500 gained 10.2%, and notched an all-time closing high on Thursday, while the tech-heavy Nasdaq Composite index gained 9.1%. The main catalyst behind Nvidia stock's amazing performance so far in 2024 can be stated in two words: artificial intelligence. More specifically, it's generative AI, which has significantly expanded the potential applications of AI. This tech enables users to quickly generate new content of various types based on a variety of input categories, such as images and sounds. Generative AI captivated the tech world in November 2022 when OpenAI broadly released ChatGPT. This chatbot's popularity skyrocketed, leading to a frenzy among companies and other entities to obtain generative AI capabilities. Nvidia's data center platform is its primary beneficiary of the strong demand among entities of all types to acquire generative AI capabilities. The data center is Nvidia's largest platform, accounting for 83% of its total revenue in its quarter ended Jan. 28. This business has been growing like gangbusters, as will be quantified below. Nvidia's data center graphics processing units (GPUs) accelerate the processing of AI and high-performance computing workloads. The company's current flagship data center GPU is the H100, and its next Hopper architecture-based GPU, H200, is scheduled to begin shipping in the second quarter of this year. Its data center GPUs based on its next-generation architecture, Blackwell, promise a huge leap in performance and are expected to launch later this year. In 2023, Nvidia stock rocketed 239%, earning it the No. 2 spot among the S&P 500 index's top performers. (Super Micro Computer was the best performer with a 246% gain.) For context, the S&P 500 and the Nasdaq Composite returned 26.3% and 44.6%, respectively, last year. Nvidia stock's momentum at the end of 2023 and through late February 2024 was driven by the company's release of blockbuster quarterly results on Nov. 23, 2023. In its third quarter of fiscal year 2024 (ended Oct. 29, 2023), Nvidia's revenue and adjusted earnings per share (EPS) surged 206% and 593%, respectively, year over year. Growth was powered by the data center platform's revenue soaring 279% from the year-ago period. In 2024 through Feb. 21 (when the company released its next round of quarterly results), Nvidia stock gained 36.2%. On Feb. 21, Nvidia released its report for its fourth quarter of fiscal year 2024 (ended Jan. 28). It was another blockbuster report, fueled by the data center platform's phenomenal AI-driven growth. For the quarter ended Jan. 28, Nvidia's revenue and adjusted EPS rocketed 265% and 486%, respectively, year over year. Both results easily beat Wall Street's estimates. Growth was driven by the data center platform's 409% revenue surge. The gaming and professional visualization platforms also performed well, with their year-over-year revenue jumping 56% and 105%, respectively. Investors propelled shares up 16.4% on the day following the earnings release, and the stock continued to move upward through the end of the first quarter of 2024. Nvidia is poised to turn in another fantastic quarterly report. For the period ending in late April, management guided for revenue to grow 234% and adjusted EPS to increase 396% year over year. The AI revolution is in the early stages, so Nvidia has a potentially very long runway for growth. It's not too late to consider buying Nvidia stock. Beth McKenna has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}