{
    "title": "Nvidia May Not Be Able To Save The Market From A Hot CPI Report This Time",
    "date": "3/10/2024",
    "url": "https://mottcapitalmanagement.com/nvidia-may-not-be-able-to-save-the-market-from-a-hot-cpi-report-this-time/",
    "text": "Home » Nvidia May Not Be Able To Save The Market From A Hot CPI Report This Time Follow @michaelmottcm Subscribe to The Free Market Chronicle and join the 2,721 subscribers getting it for FREE! Check your inbox or spam folder to confirm your subscription.  3/8/24 #Stocks –  $NVDA #Macro – $NDX, $SPX, #VOLATILITY, #CPI Mike’s Reading The Markets Macro Subscription Service on Seeking Alpha Some Recent Titles:  This week will be dominated by inflation data and the bond auction returning to the 1 PM ET time slot. On Monday, a 3-year Treasury auction will be at 1 PM ET. Tuesday will release the highly anticipated CPI report, estimated to have increased by 0.4% m/m, up from 0.3% last month and 3.1% y/y, in line with January. Core CPI is increasing by 0.3% m/m, down from 0.4% in January, while rising by 3.7% y/y, down from 3.9%. The 10-year Treasury auction will follow at 1 PM ET. Wednesday will bring the 30-year Trueasry auction at 1 PM, while Thursday brings retail sales, estimated to have increased by 0.8% m/m in February versus a decline of 0.8% in January. Also, on Thursday morning, we get PPI, which is expected to have increased by 0.3% m/m flat to last month and increase by 1.2% y/y, up from 0.9% in January. Finally, Friday is the University of Michigan with preliminary March data showing 1-year inflation expectations have risen to 3.1% from 3.0%, and 3 to 5-year expectations have risen from 3% to 2.9%. As previously noted, inflation swaps and Kalshi suggest that inflation will be hotter than expected on Tuesday morning. Both predict numbers to come in 0.1% hotter than the median analysts’ forecast, at 3.2% y/y and 0.5% m/m.  Since July, the actual CPI rate has met or beaten the CPI swaps 7 out of 8 times, except for November. Meanwhile, the actual CPI rate has met or beaten analysts’ median forecast 5 out of 8 times. For the most part, the CPI Swap market has just done a better job predicting the y/y inflation rate over the last several months. This suggests that if the swap market is right again, we could see a CPI y/y print of 3.2% or higher come Tuesday morning. So, we will need to watch these numbers closely. Remember, the NASDAQ fell after the CPI number in February, and it looked ready to crack. Nvidia essentially saved it. But basically, the NASDAQ 100 closed this past Friday in the same spot it was a month ago, one day before the January CPI report. So, for all the talk about how the market doesn’t care, one could easily say that it may care more than it would seem.  Since February 12, the NASDAQ 100 has been up 56.05 points or 0.31%, with Nvidia contributing 197.06 points to the NASDAQ 100. Basically, without Nvidia’s move, the index would have been lower. One could also easily argue that without Nvidia’s result, AMD wouldn’t have gained 20%, adding 75 points to the NDX either, because the number of stocks up versus down is pretty much near even currently at 52 to 49 winners to losers.  Meanwhile, the NASDAQ 100 had a relatively large bearish engulfing pattern on Friday, which doesn’t always work out and needs confirmation by moving lower on Monday. Still, it is notable, especially considering it came on a sharp intraday reversal.  The reversal was driven by Nvidia imploding on itself like a star that goes supernova. The idea is the same: when a star ages and grows large, its mass increases, and eventually, the mass grows so large that the star collapses on itself. In this case, Nvidia’s price kept rising, pushing its implied volatility higher; eventually, the implied volatility got so high that call buyers could no longer profit, and that essentially ended the squeeze taking place, causing the stock to collapse. As soon as that IV on the $975 call for expiration on March 15 hit 75%, the stock collapsed.  This also created a bearish engulfing pattern on Nvidia on massive volume. While the total volume may have been less than on August 24 or May 25, 2023, the stock is more than double and triple the price of those prior days, which means the notional dollar values that traded were at insane levels. Consider almost 115 million shares of an almost $900 stock trading hands.  This tells us two things for this week: be mindful that where Nvidia goes likely means the market will follow and that a hot CPI print come Tuesday morning may very well matter, and this time, Nvidia may not be able to save it. -Mike Charts used with the permission of Bloomberg Finance L.P. This report contains independent commentary to be used for informational and educational purposes only. Michael Kramer is a member and investment adviser representative with Mott Capital Management. Mr. Kramer is not affiliated with this company and does not serve on the board of any related company that issued this stock. All opinions and analyses presented by Michael Kramer in this analysis or market report are solely Michael Kramer’s views. Readers should not treat any opinion, viewpoint, or prediction expressed by Michael Kramer as a specific solicitation or recommendation to buy or sell a particular security or follow a particular strategy. Michael Kramer’s analyses are based upon information and independent research that he considers reliable, but neither Michael Kramer nor Mott Capital Management guarantees its completeness or accuracy, and it should not be relied upon as such. Michael Kramer is not under any obligation to update or correct any information presented in his analyses. Mr. Kramer’s statements, guidance, and opinions are subject to change without notice. Past performance is not indicative of future results. Neither Michael Kramer nor Mott Capital Management guarantees any specific outcome or profit. You should be aware of the real risk of loss in following any strategy or investment commentary presented in this analysis. Strategies or investments discussed may fluctuate in price or value. Investments or strategies mentioned in this analysis may not be suitable for you. This material does not consider your particular investment objectives, financial situation, or needs and is not intended as a recommendation appropriate for you. You must make an independent decision regarding investments or strategies in this analysis. Upon request, the advisor will provide a list of all recommendations made during the past twelve months. Before acting on information in this analysis, you should consider whether it is suitable for your circumstances and strongly consider seeking advice from your own financial or investment adviser to determine the suitability of any investment. Mott Capital Management, LLC\nGarden City,  NY  11530 © 2024 Mott Capital Management, LLC.  Use, publication or reproduction in any media prohibited without the permission of the copyright holder. © 2024 Michael Kramer.  Use, publication or reproduction in any media prohibited without the permission of the copyright holder. Legal/Privacy/Terms "
}