{
    "title": null,
    "date": "3/19/2024",
    "url": "https://www.barrons.com/livecoverage/nvidia-gtc-ai-conference/card/schneider-electric-and-nvidia-want-to-standardize-data-center-designs-rA8sxuX1cvo5VZy8pxj5",
    "text": "LIVE UPDATES | CONCLUDED Last Updated: March 20, 2024 at 2:48 AM EDT 10 days ago By Al Root The artificial intelligence boom being powered by Nvidia chips looks like it is “for real.” That will keep investors focused on AI-related stocks for years to come. AI-related businesses will be focused on rolling out the game-changing technology smoothly. Monday, the Paris-based electrical-hardware company Schneider Electric unveiled a collaboration designed to do just that. Schneider and Nvidia are working to industrialize the data-center business. Schneider “will leverage its expertise in data center infrastructure and Nvidia’s advanced A.I. technologies to introduce the first publicly available AI data center reference designs,” reads part of a news release. Practically speaking, the pair are introducing standards and standard processes to power-hungry AI data centers. Every new center doesn’t need to be a brand-new design from the ground up. The result should make building and maintaining AI data centers easier and less expensive. “This provides organizations with the necessary infrastructure to tap into the potential of AI, driving innovation and digital transformation across industries,” said Ian Buck, Nvidia’s vice president of Hyperscale and HPC, or high-performance computing. Data centers aren’t a new phenomenon, but the ones used for training AI models demand more power, hardware, and software than traditional server farms. At a “typical data center today, the density would be up to 20 kilowatts a rack” of computers, Pankaj Sharma, executive vice president of Schneider’s secure power division and data center business, told Barron’s, referring to the amount of power those computers need to run. Twenty kilowatts amount to about 300 incandescent light bulbs. “With these A.I. deployments, and the compute capability of the servers coming from Nvidia, the density on a rack could go to as much as up to 150 kilowatts,” Sharma said. That is closer to 2,500 light bulbs. A.I. brains require a lot of fuel. The International Energy Agency estimates that data centers now account for about 2% of global electricity demand. It says demand to run data centers could double by 2026. That rapid demand growth is one reason standardization and planning make sense. The collaboration is another example of how the AI boom is helping businesses beyond Nvidia. Some of the AI news is reflected in Schneider stock. Through Monday trading, shares were up almost 50% over the past 12 months and had gained more than 200% over the past five years. The S&P 500 was up about 30% and 85%, respectively, over those two spans. Nvidia stock is another story. Shares were up roughly 240% over the past 12 months and up about 1,900% over the past five years. “I’ve seen the shift and growth cycles of the enterprise to the cloud, cloud to ecommerce…everything around blockchain and then you had metaverse just a few years ago,” said Sharma. “I haven’t seen anything like [A.I.] in my career. This one is for real.” NVIDIA Corp. NVDA (U.S.: Nasdaq) Schneider Electric SE ADR SBGSY (U.S.: OTC) Advertisement - Scroll to Continue "
}