{
    "title": "Nancy Pelosi's husband just dumped his NVIDIA stock right before Congress \nis set to pass the 'CHIPS-plus' bill",
    "date": "3/22/2024",
    "url": "https://ca.movies.yahoo.com/nancy-pelosis-husband-just-dumped-151017638.html",
    "text": " Speaker Nancy Pelosi reported that her husband sold all of his stock in chip-maker NVIDIA. The document states Paul Pelosi sold 25,000 shares worth up to $5 million — at a reported loss. The trade comes as Congress is set to pass a $54 billion bill to bolster US chip manufacturing and research. Speaker of the House Nancy Pelosi husband, Paul Pelosi, has sold all of his stock in NVIDIA on Tuesday as Congress is set to pass the \"CHIPS-plus\" bill. Paul Pelosi sold between $1 million and $5 million worth of NVIDIA stock, or 25,000 shares, at an average price of $165.05 on July 26, according to a mandatory congressional financial disclosure filed Tuesday by the speaker. Members of Congress are only required to report the values of their trades in broad ranges. The disclosure states that by selling the shares, Paul Pelosi suffered a \"total loss of $341,365.\" This disclosure of a financial loss is notable because Nancy Pelosi, a Democrat from California, rarely volunteers such detailed information about her husband's stock and stock option trades. But the Pelosis have faced significant questions and criticism from the right in recent days about the timing of Paul Pelosi's NVIDIA investments.  Insider previously reported that Paul Pelosi exercised 200 call options, or 20,000 shares, of NVIDIA worth between $1 million and $5 million on June 17, 2022, at a strike price of $100. Paul Pelosi's trades come at a time when Congress is set to pass the \"CHIPS-plus\" bill, which will invest $54 billion in stateside semiconductor manufacturing and research. NVIDIA, a producer of graphics processing units and developer of integrated circuits, was one of many companies to sign an open letter in June asking leaders of Congress to pass the bill. Last week, Pelosi denied at a press conference that her venture capitalist husband traded stocks using information she's given him. \"Absolutely not,\" Nancy Pelosi said. The speaker's husband's trades also arise at a time when Congress is debating whether its members and their spouses should even be allowed to buy, sell, and hold individual stocks at all. Pelosi herself originally opposed the idea, saying: \"We are a free market economy. They should be able to participate in that.\" She ultimately backtracked after sharp criticism from members of Congress on both sides of the aisle and the general public, allowing bipartisan groups of lawmakers to draft bills and hold a public hearing. \"I've said to the House Administration Committee, review all the bills that are coming in and see which ones — where the support is in our caucus,\" Pelosi said. \"If members want to do that, I'm okay with that.\" Despite several proposed bills from Republicans and Democrats in both chambers, not a single one has been brought to a vote. Rep. Abigail Spanberger told Insider that she thinks leadership is \"trying to run out the clock\" and that the push has been halted by \"anyone who has the ability to move\" the bills forward. Speaker Pelosi herself does not trade stocks, but her husband is a frequent investor. Insider collected each of his trades that the speaker reported in 2021 and 2022. Many of his trades are worth millions — a previous analysis from Insider found in late 2021 that the speaker is ranked as the 14th wealthiest member of Congress with an estimated net worth of at least $46,123,051. Read the original article on Business Insider Hammers concede three times in final 13 minutes to lose thriller One person reporteds hearing an ‘explosion’ as the tricycle bursts into flames outside Buckingham Palace  STORY: The U.S. has authorized the transfer of billions of dollars worth of bombs and fighter jets to Israel in recent days, two sources familiar with the effort say. That's despite the growing concerns Washington has expressed about an anticipated Israeli military offensive in Rafah, where more than a million displaced Palestinians are sheltering.Some members of President Joe Biden's party are calling for him to cut U.S. military aid. The new arms packages include more than 1,800 MK84 2,000-pound bombs and 500 MK82 500-pound bombs, said the sources, who on Friday (March 29) confirmed a report in the Washington Post.Israel faces strong international criticism over its bombing campaign and ground offensive in Gaza, which had killed at least 32,700 people as of Saturday (March 30), according to the health ministry in the Hamas-run enclave.The decision on weapons follows a visit to Washington by Israeli Defense Minister Yoav Gallant this week when he discussed Israel's weapons requirements with U.S. counterparts.Washington gives $3.8 billion in annual military assistance to its longtime ally Israel, which is the leading recipient of U.S. foreign aid.It has been sending air defenses and munitions, demonstrating how Biden's administration continues to support Israel ... despite an increasingly public rift with Israeli Prime Minister Benjamin Netanyahu.Some Democrats and Arab American groups have criticized that support and say it gives Israel a sense of impunity.Biden on Friday acknowledged, quote, \"the pain being felt\" by many Arab Americans over the war in Gaza and U.S. support for Israel and its military offensive, which was launched after Hamas attacked southern Israel on October 7, killing 1,200 people.The White House declined comment on the weapons transfers, and the Israeli embassy in Washington did not immediately respond to a request for comment. A stalker moved next door to where his victim lived and bought the same dog and car as her, a court heard. SCHAFFHAUSEN, Switzerland — Canada's Brad Gushue defeated Czechia's Lukas Klima 9-8 in an extra end on Saturday at the world men's curling championship. Gushue, from St. John's, N.L., made a hit-and-stick for the victory in the round-robin opener at the IWC Arena. His team of Mark Nichols, E.J. Harnden and Geoff Walker was scheduled to play Germany's Marc Muskatewitz later in the day. In other early games, American John Shuster opened with a 5-3 win over Switzerland's Yannick Schwaller and Swede He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Pressure on Michael Gove to act as householders see bills rise 40%, with many saying that they cannot afford to pay Jamahal Hill can't just walk out normal to the octagon at UFC 300 now – not after this. Service charges for shared-ownership houses have rocketed, leaving many unable to pay. We hear their stories  Don't miss the discount on this powerful sucker with over 167,000 fans. Follow all the action from Villa Park A cross-party letter sent to Foreign Secretary Lord Cameron called for the UK to resume funding without delay.  The Easter story of the Tulsa Church with the big letters As a child in the 1970s, Boy George didn’t have the easiest time at school, thanks to his gender-bending androgynous looks and desire to shock. BALTIMORE (AP) — Teams of engineers are working on the intricate and careful process of hauling away the twisted steel and shattered concrete of the Francis Scott Key Bridge in Maryland while also trying to recover the bodies of four workers still missing and presumed dead. The bridge was sent crashing into the Patapsco River on Tuesday after a massive cargo ship crashed into one of its main supports. “With a salvage operation this complex — and frankly with a salvation operation this unpreceden  The light blue stroke put in an incredible effort to upset Oxford in the men’s race This week's First Student Super 7 athlete takes us to the diamond where we introduce you to Orchard Park senior Evelyn Wozniak. She's showing us how a future D1 athlete can excel on and off the field. The old-school rule of matching your shoes to your handbag still holds up. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ Counterterrorism police are investigating after Pouria Zeraati, who works for Iran International, was attacked in south London Shape your Future Healthy Kitchen: Ginger Carrot Soup The rapid collapse of a Baltimore bridge that was struck by large cargo ship highlighted the importance that bridges play in the daily lives of many Americans. Six construction workers who were on the bridge are presumed dead. The drivers of more than 30,000 vehicles that crossed the bridge daily must find a new route around or over the Patapsco River. And shipments at the Port of Baltimore will be shut down for some time, forcing numerous businesses to find alternative means of getting their go "
}