{
    "title": "Nvidia boss Jensen Huang believes CEOs should have the most direct reports",
    "date": "3/27/2024",
    "url": "https://ca.movies.yahoo.com/nvidia-boss-jensen-huang-believes-153857180.html",
    "text": " Nvidia's CEO Jensen Huang has 50 direct reports. He said CEOs should have the most direct reports, in an interview with Stanford GSB. \"I don't believe in a culture, in an environment, where the information you possess is why you have power,\" he said. Nvidia's CEO, Jensen Huang, doesn't believe in gatekeeping. Huang, who oversees 50 direct reports, said that \"by definition,\" CEOs should have the most direct reports of anyone at a company. He made the comment during an interview with Stanford's Graduate School of Business on Tuesday. Huang's rationale is that those who report to the CEO (theoretically) require the least amount of oversight, so CEOs have more bandwidth than other managers. And taking on more direct reports could help CEOs level the playing field, too. According to Huang, the more people a CEO directly communicates with, the less likely an employee's stance at a company will be determined by their access to critical information. \"I don't believe in a culture, in an environment, where the information you possess is the reason why you have power,\" he said. In Huang's view, the role of the managers is not to broker power between workers but to collectively motivate the company's workforce. \"Our position at the company should have something to do with our ability to reason through complicated things, lead other people to achieve greatness, inspire, empower other people, support other people,\" he said. \"Those are the reasons why the management team exists, in service of all the other people that work at the company.\" The AI chipmaker has captured headlines since it announced its blockbuster earnings for the fourth quarter of 2023 late last month. And while Huang manages more people than other big-name CEOs (Amazon CEO Andy Jassy has 16 direct reports), Nvidia has close to 30,000 employees, according to a company report from 2023. So, Huang is only overseeing a small fraction of Nvidia's employees. While Huang might be an outlier (and overachiever) as a manager, the number of direct reports CEOs are taking on is on the rise. CEOs' direct reports doubled from five in the mid-1980s to close to 10 in the mid-2000s, according to the Harvard Business Review. That's a pretty optimal number. Hal Gregersen, formerly the executive director of the MIT Leadership Center, previously told BI the ideal number of direct reports — whether you're a CEO or lower-level manager — is between six and twelve. Read the original article on Business Insider Hammers concede three times in final 13 minutes to lose thriller One person reporteds hearing an ‘explosion’ as the tricycle bursts into flames outside Buckingham Palace  STORY: The U.S. has authorized the transfer of billions of dollars worth of bombs and fighter jets to Israel in recent days, two sources familiar with the effort say. That's despite the growing concerns Washington has expressed about an anticipated Israeli military offensive in Rafah, where more than a million displaced Palestinians are sheltering.Some members of President Joe Biden's party are calling for him to cut U.S. military aid. The new arms packages include more than 1,800 MK84 2,000-pound bombs and 500 MK82 500-pound bombs, said the sources, who on Friday (March 29) confirmed a report in the Washington Post.Israel faces strong international criticism over its bombing campaign and ground offensive in Gaza, which had killed at least 32,700 people as of Saturday (March 30), according to the health ministry in the Hamas-run enclave.The decision on weapons follows a visit to Washington by Israeli Defense Minister Yoav Gallant this week when he discussed Israel's weapons requirements with U.S. counterparts.Washington gives $3.8 billion in annual military assistance to its longtime ally Israel, which is the leading recipient of U.S. foreign aid.It has been sending air defenses and munitions, demonstrating how Biden's administration continues to support Israel ... despite an increasingly public rift with Israeli Prime Minister Benjamin Netanyahu.Some Democrats and Arab American groups have criticized that support and say it gives Israel a sense of impunity.Biden on Friday acknowledged, quote, \"the pain being felt\" by many Arab Americans over the war in Gaza and U.S. support for Israel and its military offensive, which was launched after Hamas attacked southern Israel on October 7, killing 1,200 people.The White House declined comment on the weapons transfers, and the Israeli embassy in Washington did not immediately respond to a request for comment. A stalker moved next door to where his victim lived and bought the same dog and car as her, a court heard. SCHAFFHAUSEN, Switzerland — Canada's Brad Gushue defeated Czechia's Lukas Klima 9-8 in an extra end on Saturday at the world men's curling championship. Gushue, from St. John's, N.L., made a hit-and-stick for the victory in the round-robin opener at the IWC Arena. His team of Mark Nichols, E.J. Harnden and Geoff Walker was scheduled to play Germany's Marc Muskatewitz later in the day. In other early games, American John Shuster opened with a 5-3 win over Switzerland's Yannick Schwaller and Swede 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ Pressure on Michael Gove to act as householders see bills rise 40%, with many saying that they cannot afford to pay Jamahal Hill can't just walk out normal to the octagon at UFC 300 now – not after this. Service charges for shared-ownership houses have rocketed, leaving many unable to pay. We hear their stories He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Don't miss the discount on this powerful sucker with over 167,000 fans. Follow all the action from Villa Park A cross-party letter sent to Foreign Secretary Lord Cameron called for the UK to resume funding without delay.  The Easter story of the Tulsa Church with the big letters As a child in the 1970s, Boy George didn’t have the easiest time at school, thanks to his gender-bending androgynous looks and desire to shock. BALTIMORE (AP) — Teams of engineers are working on the intricate and careful process of hauling away the twisted steel and shattered concrete of the Francis Scott Key Bridge in Maryland while also trying to recover the bodies of four workers still missing and presumed dead. The bridge was sent crashing into the Patapsco River on Tuesday after a massive cargo ship crashed into one of its main supports. “With a salvage operation this complex — and frankly with a salvation operation this unpreceden  The light blue stroke put in an incredible effort to upset Oxford in the men’s race This week's First Student Super 7 athlete takes us to the diamond where we introduce you to Orchard Park senior Evelyn Wozniak. She's showing us how a future D1 athlete can excel on and off the field. The old-school rule of matching your shoes to your handbag still holds up.  Counterterrorism police are investigating after Pouria Zeraati, who works for Iran International, was attacked in south London Shape your Future Healthy Kitchen: Ginger Carrot Soup The rapid collapse of a Baltimore bridge that was struck by large cargo ship highlighted the importance that bridges play in the daily lives of many Americans. Six construction workers who were on the bridge are presumed dead. The drivers of more than 30,000 vehicles that crossed the bridge daily must find a new route around or over the Patapsco River. And shipments at the Port of Baltimore will be shut down for some time, forcing numerous businesses to find alternative means of getting their go "
}