{
    "title": "3 AI Stocks That Could Be Multibaggers in the Making: March Edition",
    "date": "3/29/2024",
    "url": "https://investorplace.com/2024/03/3-ai-stocks-that-could-be-multibaggers-in-the-making-march-edition/",
    "text": " Find out which AI stocks are primed for high growth and even higher returns Advertisement Source: shutterstock.com/Victor Runov AI, or artificial intelligence, is not a new concept but is one that has taken the stock market by storm over the past year. It seems like any stock even remotely related to AI has enjoyed incredible gains. While some refer to it as a bubble, there is plenty of smart money investing in these stocks. Every growth investor dreams of finding the next multi-bagger stock. When it comes to the AI sector, there is potential for many of these AI stocks to be long-term winners. Just like recent waves that saw major returns from software-as-a-service (SaaS) and cloud companies, AI stocks are in the early innings of what could be a multi-year bull run. These three AI stocks have already provided shareholders with solid returns this year but here’s why we think they have a lot higher to go. Nvidia (NASDAQ:NVDA) is one of the world’s largest companies and the engine behind this AI revolution. The company was founded in 1993 by current CEO Jensen Huang. As per Yahoo Finance, Nvidia’s stock has 46 analysts covering it with a wide price target range of $478.40 to $2,762.14. The average target is $973.12 which is right in line with NVDA stock’s current price. This AI stock has nearly doubled since the start of 2024. It is now the third-largest company in the world by market capitalization. It recently announced its Blackwell B200 GPU which will be the world’s most powerful chip. These are expected to sell for about $40,000 and according to Nvidia, are already sold out through 2025. These AI chips can process data 30 times faster with a quarter of the power usage. With these types of returns from NVDA stock, you might think it is trading at a high multiple. Incredibly, Nvidia’s stock trades at just 39x forward earnings, which is stellar considering its crazy price movements. This shows the company is not as overvalued as many think and may even be undervalued. Advanced Micro Devices (NASDAQ:AMD) is an American semiconductor company that was established in 1969. Its current CEO is Dr. Lisa Su who is the first cousin once removed of Nvidia’s Huang. AMD also has a wide price target range of $60.00 to $270.00 per share. The average target of $190.75, however, suggests there is upside potential from its current price. AMD has always been treated as Nvidia’s younger sibling, even though the company is older. This semiconductor maker first established itself with CPUs where it took a considerable market share from Intel. AMD’s AI GPUs are considered powerful enough to compete with Nvidia. They are used by companies like Meta Platforms (NASDAQ:META), Microsoft (NASDAQ:MSFT) and OpenAI. This AI stock trades at a premium to Nvidia. Currently, AMD trades at about 53x forward earnings and nearly 13x sales. The company does have an impressive 3-year revenue compounded annual growth rate (CAGR) of 32%. It shows that AMD may be able to grow into its premium sales multiple in the future. Soundhound AI (NASDAQ:SOUN) is a relatively new name in the AI sector but one that is backed by an investment from Nvidia. Despite several recent analyst downgrades, the average price target of $7.15 shows this AI stock has more room to run. If you’ve never heard of this company, you aren’t the only one. Soundhound develops and creates AI-voice-powered products and services, similar to Amazon’s (NASDAQ:AMZN) Alexa or Apple’s (NASDAQ:AAPL) Siri. It received a lot of hype because Nvidia was revealed as owning more than 1.7 million shares. Soundhound has an impressive list of clients including Mercedes-Benz (OTCMKTS:MBGAF), Netflix (NASDAQ:NFLX), Honda (NYSE:HMC), and Mastercard (NYSE:MA). Of the three stocks on this list, Soundhound is easily the riskiest investment. On that note, it also has the highest potential to be a massive multi-bagger stock. This is a not-yet-profitable company that trades at 30x sales and has some major tech juggernauts as competitors. Still, with the backing of Nvidia and some A-list clients, Soundhound could be the AI stock that provides the highest returns on this list. On the date of publication, Ian Hartana and Vayun Chugh did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chandler Capital is the work of Ian Hartana and Vayun Chugh. \r\n\r\nIan Hartana and Vayun Chugh are both self-taught investors whose work has been featured in Seeking Alpha. Their research primarily revolves around GARP stocks with a long-term investment perspective encompassing diverse sectors such as technology, energy, and healthcare. Technology, Artificial Intelligence Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/3-ai-stocks-that-could-be-multibaggers-in-the-making-march-edition/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}