{
    "title": "AMD stock analyst sets surprising new price target",
    "date": "3/4/2024",
    "url": "https://www.dcourier.com/news/2024/mar/05/amd-stock-analyst-sets-surprising-new-price-target/",
    "text": "  When two heavyweights square off, it's time to step back and let the chips fall where they may. The heavyweights in this case are tech titans Advanced Micro Devices  (AMD)  and Nvidia  (NVDA) , and the chips in question are semiconductors that are capable of meeting the ever-increasing demands of artificial intelligence. This is indeed a fight for the future. Bloomberg&solGetty Images A Deloitte study issued in November said that the market for specialized chips optimized for generative AI will exceed $50 billion in 2024. From close to zero in 2022, that sum is expected to make up two-thirds of all AI-chip sales in the year, the firm said. Deloitte also predicted that total AI-chip sales this year will be 11% of the predicted global chip market of $576 billion. Recent AI chip market forecasts for 2027 range from an aggressive $400 billion to a more conservative $110 billion, the firm said. Related: Key analyst reveals new S&P 500 price target as AI powers record rally Deloitte noted that \"the major chip companies as well as others have built or are building chips that are specially optimized for generative AI, as older AI chips are too slow or too inefficient to do it well and are lacking the right kind of design and memory.\" General-purpose chips like central processing units can also be used for some simpler AI tasks, but CPUs are becoming less and less useful as AI advances. Wall Street is getting the message loud and clear. The S&P 500, which is already on pace for one of its best first-quarter rallies in decades, has a lot more left in its tank over the coming year, analysts are forecasting, as the AI-led investment rally continues to drive gains. Advanced Micro Devices and Nvidia are key players in this rally. Nvidia, currently the leading provider of chips specially designed to train and run AI applications, has seen its shares skyrocket recently. On Feb. 22, the company saw a stock surge that added more than $277 billion to the AI-chip maker's market value — the single-largest market gain in U.S. history — and helped power the S&P 500 to an all-time high of 5,087.03 points. Nvidia reported adjusted fourth-quarter earnings of $5.16 a share, a nearly sixfold increase from the year-earlier period, as revenue more than tripled to $21.1 billion. The company had a market cap of $2.134 trillion — with a T — at last check. Meanwhile, AMD on Jan. 30 reported fourth-quarter earnings of 77 cents a share, an 11.5% increase from the year-earlier period and matching Wall Street’s forecasts. Revenue rose 10% to $6.17 billion, ahead of analysts' forecasts of $6.12 billion. During the company's earnings call CEO Lisa Su reminded analysts that “we closed multiple wins with large financial, energy, automotive, retail, technology and pharmaceutical companies, positioning us well for continued growth, based on expanded production deployments planned for 2024.” AMD's new MI300X, a graphics-processing unit designed to support generative artificial intelligence technologies, is expected to produce around $2 billion in sales over the coming year as the company leverages its new launch against Nvidia's ability to meet the global surge in demand. More AI Stocks: Industry analysts believe the MI300X could challenge Nvidia's dominant H100 graphics processing unit chip in the large language model AI market. Huatai Research analyst Purdy Ho said last month that he believed “AMD’s MI300 is one of the most competent products poised to challenge Nvidia.” And on March 4, Barclays analyst Tom O'Malley raised the firm's price target on AMD to $235 from $200 while affirming an overweight rating on the shares. Shipments of client MPUs — microprocessor units-shipments — came in stronger than expected in December, but are leading to a meaningful reset in March, the analyst wrote in a report about the semiconductor industry. For the full year, the firm sees mid-single-digit growth in client MPUs and mid-single-digit declines in servers with AMD continuing to gain share in both markets. \"We continue to see AMD taking share in the server market in 1Q24 and holding share stable through the remainder of the year, moving from 25% in 4Q23 to 27% through 2024,\" the analyst wrote. Related: Veteran fund manager picks favorite stocks for 2024 Click Below to: Contents of this site are © Copyright 2024 Prescott Newspapers, Inc. and Western News&Info®, Inc. All rights reserved. |  Terms of Service | Privacy Policy "
}