{
    "title": "Nvidia CEO reiterates solid partnership with TSMC, Business News",
    "date": "3/21/2024",
    "url": "https://www.asiaone.com/business/nvidia-ceo-reiterates-solid-partnership-tsmc",
    "text": "TAIPEI, March 22, 2024 /PRNewswire/ -- One key takeaway from the ongoing GTC is that Nvidia's AI empire has taken shape with strong partnerships from TSMC and other Taiwanese makers, such as those major server ODMs. Credit: AFP According to the news report from the technology-focused media DIGITIMES Asia, during his keynote at GTC on March 18, Huang underscored his company's partnerships with TSMC, as well as the supply chain in Taiwan. Speaking to the press later, Huang said Nvidia will have a very strong demand for CoWoS, the advanced packaging services TSMC offers. He said the company is embarking on a new journey and will work closely with TSMC. He said he believes TSMC's capacity will continue growing. A major reason for the shortages of Nvidia's AI chips is insufficient CoWoS support from TSMC. To serve Nvidia and other AI chip customers, TSMC is accelerating the expansion of CoWoS capacity and has just confirmed that it will build two advanced packaging fabs in Chiayi, southern Taiwan. Nvidia's AI foundry service Nvidia is taking inspiration from TSMC's business model. Huang admitted that the way Nvidia is working for its partners and the AI industry is like the way TSMC is making chips for Nvidia. Nvidia is learning from TSMC's business model where the foundry only handles the manufacturing. Nvidia is working in the same as an AI foundry, according to Huang. In November 2023, Nvidia introduced an AI foundry service to customize generative AI applications for enterprises and startups deploying on Microsoft Azure. Sources from Taiwan's server supply chain noted that Nvidia has been the biggest winner in the AI boom with its prowess from the CUDA and GPU platforms. Taiwanese firms have played a key role in helping build Nvidia's AI empire. At the same time, the Taiwanese supply chain also has been a major beneficiary of Nvidia's rise to dominance. Nvidia is expected to introduce upgrades to its H100 and GH100 in the second quarter of 2024 – the H200 and GH200. It has also unveiled the B100/B200 and GB200 on its new Blackwell platform at GTC. The launch of new chip products will benefit not only their contract maker TSMC and equipment suppliers but also the server supply chain. TSMC is sole maker of Nvidia AI GPUs The sources said TSMC has been the sole maker of Nvidia's AI GPUs. Nvidia had Samsung make its RTX30 series at the 8nm node for the gaming market. However, yield and performance issues at Samsung later prompted Nvidia to let TSMC make all of its next-generation RTX40 series at the 4nm node, the sources said. The upcoming RTX50 series will still be made by TSMC using 3/4nm processes, sources added. The Blackwell GPUs will also be made by TSMC. Its next-generation AI GPUs to be introduced in 2025 are expected to embrace 3nm processes, the sources said. As switching chipmaking partners will incur very high costs, Nvidia will continue using TSMC's 2nm, A14, and A10 services in the coming years, barring unexpected developments. Nvidia's server partners in Taiwan, including ASRockRack, Asustek, Foxconn, Gigabyte, Inventec, Pegatron, Quanta Cloud Technology (GCT), Wistron, and Wiwynn, will supply servers running on the Blackwell platform. "
}