{
    "title": null,
    "date": "1/14/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/nvidias-red-hot-2024-start-bright-spot-sp-500-eyes-record",
    "text": "NVIDIA is off to its strongest-ever start to a year by one measure, keeping up a blistering rally that saw shares gain nearly 240 per cent in 2023. The artificial-intelligence (AI) darling has added roughly US$128 billion in market capitalisation after rising about 10 per cent this month, an unprecedented gain in value in the first nine trading days of the year for the company. It is a boon for Nvidia bulls and signals that the AI trend still has momentum, at least for the company viewed by many as one of the biggest early winners. Nvidia this year is easily outpacing the broader market and the rest of the so-called Magnificent Seven megacap technology stocks. That is making it a major bright spot as the S&P 500 Index has stalled near record highs amid questions around corporate profits and the timing of anticipated Federal Reserve interest-rate cuts. “From my standpoint, Nvidia is best of breed,” said Shana Sissel, chief executive officer of Banrion Capital Management, adding that it is dominant in its marketplace, has strong customer relationships and is growing fast. “It’s hard to find a lot of holes in the story.” Nvidia had a better start on a percentage basis last year, to kick off its record rally. To be fair, those gains came after the stock lost half its value in 2022. For the next 12 months, analysts covering Nvidia have an average target price of almost US$650, indicating roughly 19 per cent upside for a company that now has a market capitalisation greater than US$1.3 trillion. Start and end each day with the latest news stories and analyses delivered straight to your inbox. The CES trade show this month solidified confidence for proponents of Nvidia shares. The company announced three new desktop graphics chips that will allow computer users to make better use of AI on personal machines. The shares also got a boost last week when chief financial officer Colette Kress reaffirmed chief executive officer Jensen Huang’s assertion that the company expects it can continue to grow through calendar year 2025. “Nvidia expressed a tone of confidence regarding end demand and pointed to supply increases each quarter this year,” Piper Sandler & Co analysts wrote in a note dated Jan 11, referring to a meeting with management at CES. “To us, this indicates high conviction regarding backlog and order patterns throughout the 2024 calendar period.” Nvidia is expected to release fourth-quarter earnings next month. Analysts project revenue rose some 230 per cent in the period after a roughly 206 per cent jump in the third quarter, data compiled by Bloomberg show. BLOOMBERG BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}