{
    "title": "Hunting For The Next NVIDIA? Check Out IonQ Stock",
    "date": "1/2/2024",
    "url": "https://www.valuewalk.com/hunting-for-the-next-nvidia-check-out-ionq-stock/",
    "text": "Home » Investing Many contrarian investors follow this mindset: buy what’s on the last page of the financial media — not what’s on the first page. Thus, if you’re a forward-looking contrarian investor who follows this principle, then your focus shouldn’t be on NVIDIA (NASDAQ:NVDA), which was front-page news in 2023. Instead, you should look for the next company to take an early lead in a potential hyper-growth industry, much like NVIDIA did. IonQ (NYSE:IONQ) could very well be that company in 2024. It’s off most people’s radars today and is definitely on the last page in the financial press — if the company is even mentioned at all. In fact, IonQ also has a tie-in with an e-commerce company that you’re undoubtedly quite familiar with. Let’s delve into this intriguing technology company, which could demonstrate NVIDIA-like growth in 2024. For a moment, consider what made NVIDIA so special last year. The company had already been manufacturing processors and accelerators that could be used to power artificial intelligence (AI) applications. Then ChatGPT suddenly boosted the popularity of generative AI, and NVIDIA gained favor on Wall Street for what it was already doing: making powerful generative AI-compatible chips. In the same way, IonQ could become a darling of the market for continuing to do what it was already doing. Specifically, IonQ advances quantum-computing technology and develops extremely fast and powerful supercomputers. You might be thinking right now that quantum computing isn’t a hot topic right now. However, generative AI wasn’t a hot topic at the beginning of 2023, and look what happened next. Furthermore, IonQ might be on the last page of the news, but it has the potential to move its way up to the first page. Not long ago, Fast Company honored IonQ by adding it to its third annual list of the Next Big Things in Tech. The press release announcing that honor mentions an important point. IonQ has a $25.5 million project with the U.S. Air Force Research Lab. With this contract, the company is tasked with deploying “two barium-based trapped ion quantum computing systems for quantum networking research and application development.” This shows that IonQ isn’t just a flash-in-the-pan startup business. The Air Force wouldn’t trust just any company with such an important project. In the private sector, IonQ has worked with the likes of Hyundai Motor (OTCMKTS:HYMTF), Airbus and General Electric’s (NYSE:GE) GE Research. Thus, both the public and private sectors have demonstrated interest in pursuing the latest and greatest in quantum computing. Moreover, IonQ never ceases to advance its ultra-powerful computers. Recently, the company celebrated a milestone moment, “achiev[ing] 29 algorithmic qubits on a barium platform for the first time.” Qubits can be thought of as a basic building block for measurement in quantum computing. It’s perfectly fine if you don’t understand the ins and outs of supercomputers, as you can still appreciate the landscape-altering possibilities of IonQ’s industry-leading quantum-computing systems. It’s practically indisputable that having a tie-in with e-commerce giant Amazon (NASDAQ:AMZN) is a major coup for small-to-midsized businesses. Consequently, it’s a huge win for IonQ that its Forte quantum computer is now available through Amazon’s Braket Direct program. IonQ’s press release clarifies that Amazon Braket is a “fully managed quantum computing service from Amazon Web Services (AWS).” As you may be aware, AWS is Amazon’s well-known cloud-computing platform. Literally and figuratively, Braket Direct is the Amazon of quantum-computing products. As Amazon Braket General Manager Richard Moulds explains, Braket Direct provides its customers with “access to quantum technologies needed to build expertise, and expand their research and development horizon.” Getting Forte listed on Braket Direct will undoubtedly increase IonQ’s exposure to quantum-computing specialists and to the public at large. It’s a win-win for IonQ and Amazon but also for the broad range of industries that could benefit from supercomputers in the future. Moulds mentioned some of these industries: “materials research, computer vision, machine learning, pharmaceuticals and more.” In the long run, quantum computing’s range of influence could be as deep and wide as that of generative AI. Hence, if quantum computing becomes the next generative AI, then IonQ could actually be the next NVIDIA. It’s a gamble to buy and hold IonQ stock, no doubt, but a small share position may set investors up with a last-page tech phenomenon with exciting first-page prospects. Disclaimer: All investments involve risk. In no way should this article be taken as investment advice or constitute responsibility for investment gains or losses. The information in this report should not be relied upon for investment decisions. All investors must conduct their own due diligence and consult their own investment advisors in making trading decisions.  Never Miss A Story! Subscribe to ValueWalk Newsletter. We respect your privacy. Subscribe  Subscribe ValueWalk.com is a highly regarded, non-partisan site – the website provides unique coverage on hedge funds, large asset managers, and value investing. Crypto promotions on this site do not comply with the UK Financial Promotions Regime and is not intended for UK consumers.  "
}