{
    "title": "Surging AI Chip Stocks Could Stay Red-Hot This Year",
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/surging-ai-chip-stocks-could-164739106.html",
    "text": "Throughout 2023, demand for next-generation GPUs and CPUs soared as companies sought to power their new AI applications. And as a result, AI chip stocks offered some of the best ways to play the emerging AI megatrend. Take Nvidia (NVDA), for example. That AI chipmaker saw its stock more than triple last year! Worried you missed out on the boom? InvestorPlace - Stock Market News, Stock Advice & Trading Tips Don’t be. Yesterday, we received confirmation that this Chip Boom will potentially repeat on an even bigger scale in 2024. The world’s largest chipmaker, Taiwan Semiconductor (TSM) – also known as TSMC – just reported quarterly earnings yesterday. And those earnings were outstanding. Both revenues and earnings smashed expectations. But far more importantly, management said that 2024 will be a great year for the company (far better than even 2023) because of burgeoning demand for AI chips. In response, TSMC stock popped about 10%. And it wasn’t alone. Nvidia stock rose 2%. Intel (INTC) and Advanced Micro Devices (AMD) shot higher, too. Qualcomm (QCOM) popped almost 5%. Broadcom (AVGO) rose about 4%. Arm (ARM) soared nearly 7%. The entire iShares Semiconductor ETF (SOXX) rose almost 4%. AI chip stocks truly blasted off. And it seems they’re going to stay hot for all of 2024. Our technical work suggests chip stocks could pop about 30% this year, on average. And of course, that means certain chip stocks will rise a lot more than that, too. Which look best positioned to soar in 2024? Well, we’re confident it’s not NVDA. We moved on from that stock last year – after we were able to score ~1,000% gains for subscribers. Now we’re focused on the next batch of potential big-time AI chip stock winners. Find out what’s on our radar. On the date of publication, Luke Lango did not have (either directly or indirectly) any positions in the securities mentioned in this article. P.S. You can stay up to speed with Luke’s latest market analysis by reading our Daily Notes! Check out the latest issue on your Innovation Investor or Early Stage Investor subscriber site. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The post Surging AI Chip Stocks Could Stay Red-Hot This Year appeared first on InvestorPlace. Related Quotes "
}