{
    "title": "NVDA Stock Alert: What Nvidia Investors Can Expect in 2024",
    "date": "1/15/2024",
    "url": "https://investorplace.com/2024/01/nvda-stock-alert-what-nvidia-investors-can-expect-in-2024/",
    "text": " This semi giant remains a top pick, for good reason Advertisement Source: Sergio Photone / Shutterstock.com Nvidia (NASDAQ:NVDA) remained a top pick throughout 2023 as a leading AI play. The company’s high-performance chips essentially power much of the AI revolution, with NVDA stock holding pole position in tiers of market share in key GPU markets. The company’s Q3 revenue surged by 206% to $18.12 billion, propelling its market cap to $1.2 trillion, the sixth-largest globally. Nvidia’s strategic collaborations, notably with Microsoft’s (NASDAQ:MSFT) Azure, signify a focused push into cloud-based AI solutions, strengthening its position as a tech innovation leader. From a fundamentals perspective, Nvidia’s Q3 results were impressive, with non-GAAP earnings per share surpassing expectations by 63 cents at $4.02 and a revenue surge to $18.12 billion, up 205.6% year-over-year. As 2024 begins, the question arises: what’s next for Nvidia? NVDA stock, a top semiconductor firm focused on graphics cards and data centers, thrived in 2023 due to the prevalence of the AI narrative. Its 2024 outlook centers on chip demand, innovation, and AI’s trajectory. With growing AI interest and a potential AI PC launch, Nvidia’s prospects appear promising. The gaming sector, where Nvidia established itself, is also indicating a resurgence. The gaming sector rebounded with higher console sales, game purchases, and player engagement. Nvidia’s Q3 gaming revenue surged 15% sequentially and 81% year-over-year. Despite regulatory challenges preventing a merger with Arm Holdings, Nvidia secured access through an investment in Arm’s IPO. Nvidia’s latest AI Superchip, the Grace Hopper H200, utilizes Arm’s architecture. Established in 1993, Nvidia swiftly became a key GPU hardware provider, primarily targeting high-end gaming and visual applications. Over the past decade, the company diversified, delving into chips for autonomous vehicles and significantly expanding its GPU presence in cloud-computing data centers. In 2019, Nvidia acquired Mellanox for $6.9 billion, a pivotal move in the company’s transformation. By 2022, its data segment became the top revenue generator, hitting new performance highs. Fueled by AI demand, Q3 2023 data center revenue surged 279% year-over-year to $14.51 billion, constituting about 80% of total revenue. Eager to capitalize on AI, Nvidia has expanded its software offerings and introduced AI computations as a service, leveraging existing strengths for potential long-term success. In Q3 of fiscal 2024, Nvidia reportedly sold 500,000 units of its H100 GPUs, generating a potential $12.5 billion with an assumed $25,000 average selling price. With data center revenue reaching $14.5 billion in the same quarter, the estimates suggest H100 sales of 1.5 million units in 2023, potentially contributing $37.5 billion to Nvidia’s revenue. In 2024, Nvidia is anticipated to ship 2 million H100 units, potentially generating a minimum revenue of $50 billion at a $25,000 base price. With an expected fiscal year-end revenue of $59 billion, the H100 could significantly impact Nvidia’s performance in the upcoming fiscal year. Analysts predict a remarkable 150% surge in Nvidia’s AI GPU shipments in 2024, fueled by enhanced chip offerings and support from expanding supply chain partners. If the H100 contributes to the entirety of Nvidia’s increased AI GPU shipments in 2024, the company might ship 3.75 million units, yielding over $93 billion in revenue. With analysts projecting a $92 billion total revenue for the new fiscal year, Nvidia stands poised to surpass Wall Street’s growth expectations. This potential outperformance could fuel the stock’s momentum into the new year, making it an attractive investment, particularly given its appealing forward valuation. In Q4, Nvidia soared with $20 billion in revenue, beating the $18.35 billion expectation. The robust Q4 guidance, nearly tripling last year’s growth, affirms ongoing AI strength. Notably, Q3 saw an 81% rise in Gaming revenues and 108% growth in Professional Visualization. Nvidia consistently exceeds expectations, projecting fiscal 2023 revenue around $60 billion. Trading at just 24 times forward estimates, Nvidia remains a compelling choice for 2024 in growth portfolios, backed by its stellar performance. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/nvda-stock-alert-what-nvidia-investors-can-expect-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}