{
    "title": "A Wall Street Analyst Believes This Semiconductor Stock Is Better Than \nNvidia, and It Could Jump an Impressive 71%",
    "date": "1/26/2024",
    "url": "https://finance.yahoo.com/news/wall-street-analyst-believes-semiconductor-220000808.html",
    "text": "Semiconductor stocks have been in fine form on the market, which is evident from the impressive 56% gains recorded by the PHLX Semiconductor Sector index over the past year. Graphics specialist Nvidia (NASDAQ: NVDA) has played a starring role in this surge as its shares have shot up a whopping 233% during this period, driven by the company's rock-solid position in the market for artificial intelligence (AI) chips. Nvidia's graphics processing units (GPUs) have witnessed massive demand thanks to their ability to train large language models (LLMs), which form the backbone of popular applications such as ChatGPT. The price of each AI-focused GPU that Nvidia sells can range from $10,000 to $30,000. It is worth noting that the company reportedly makes a profit of almost 1,000% on these chips, according to investment banking firm Raymond James. The market for AI chips is set to grow rapidly in the future and Nvidia is in the pole position to capitalize on its growth, but Citi analyst Atif Malik believes that Marvell Technology (NASDAQ: MRVL) could be a better semiconductor pick than Nvidia. Let's see why. The Citi analyst maintained his buy rating on Marvell stock and pointed out that the company is well placed to capitalize on the growing demand for custom AI chips and its optical modules that enable high-speed communication between data centers. Malik, however, is not the only one upbeat about Marvell's prospects. Rick Schafer of Oppenheimer is predicting an acceleration in Marvell's sales this year thanks to its AI exposure, pointing out that the company's data center storage and switching solutions will witness stronger demand. Schafer believes that Marvell stands to gain from multiple new product cycles and potential content gains, which explains why the analyst has an outperform rating on the stock. A closer look at the semiconductor solutions that Marvell provides will tell us just why Wall Street is upbeat about the company's AI-related prospects. Marvell is known for making custom application-specific integrated circuits (ASICs), which the company says are customized \"for the unique demands of each AI, cloud data center and OEM customer.\" It is worth noting that major cloud service providers such as Microsoft, Alphabet, and Meta Platforms have been focused on the development of custom ASICs for tackling AI workloads. The reason why these major AI players are developing custom AI chips is that they can help them derive more performance and power efficiency. That's not surprising as ASICs are programmed to run specific workloads and perform dedicated operations, and they can help accelerate AI training and inference models as a result. Morgan Stanley estimates that ASICs could account for 30% of the overall AI chip market by 2027, which the investment bank believes could be worth $182 billion then. So, the market for AI-focused ASICs could be worth almost $55 billion a year in 2027 based on Morgan Stanley's estimates. This could unlock a healthy growth opportunity for Marvell considering that it has generated $5.5 billion in revenue in the past year. Marvell Technology reportedly controls 12% of the ASIC market, according to JPMorgan. Assuming Marvell can hold on to this share in 2027 and the market for AI-focused ASICs indeed hits $55 billion, the company is looking at an additional $6.6 billion in AI-related revenue. That would be a big jump over Marvell's current quarterly revenue run rate of $200 million from AI-driven chip sales, as well as the potential $1 billion revenue that the company could generate from this market in fiscal 2025 (which will begin at the end of this month). Analysts are predicting Marvell's top-line growth to accelerate following a 7% decline in fiscal 2024 to $5.5 billion, jumping to $6.1 billion in fiscal 2025 and $7.3 billion in 2026. The pace of growth could be higher considering the additional AI-related revenue that Marvell could generate, as was just noted. Assuming Marvell does achieve incremental revenue of $6.6 billion by 2027 (which will coincide with the majority of its fiscal year 2028), its top line could increase to $12 billion after four years -- more than double the fiscal 2024 estimate of $5.5 billion. Multiplying the projected revenue with Marvell's five-year average price-to-sales ratio of 8.6 points toward a market cap of $103 billion, which would translate into 71% gains from current levels. With Marvell currently trading at 11 times sales, it isn't too expensive based on historical levels, especially considering the new growth driver it could benefit from. So, investors looking to buy an AI stock that isn't as expensive as Nvidia -- which trades at 33 times sales -- can consider buying Marvell Technology as it could indeed win big from the growing sales of custom AI chips in the long run. Should you invest $1,000 in Marvell Technology right now? Before you buy stock in Marvell Technology, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Marvell Technology wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 22, 2024  JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Citigroup is an advertising partner of The Ascent, a Motley Fool company. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, JPMorgan Chase, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Marvell Technology. The Motley Fool has a disclosure policy. A Wall Street Analyst Believes This Semiconductor Stock Is Better Than Nvidia, and It Could Jump an Impressive 71% was originally published by The Motley Fool Related Quotes "
}