{
    "title": null,
    "date": "1/30/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36840139/amd-analysts-spotlight-crucial-swing-factor-ahead-of-q4-earnings-amid-tough-chip-in",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Advanced Micro Devices, Inc. AMD shares have run up sharply in January as sell-side analysts touted the company as an AI play which will likely give Nvidia Corp. NVDA a run for its money. Expectations are lofty, heading into the earnings day of the Lisa Su-led company. AMD’s fourth-quarter earnings report is scheduled to be released Tuesday after the market closes. The stock gained 20.6% in January as traders bid up the stock in response to analysts raising estimates and stock price targets. Will the company live up to the hype? Is there scope for further upside for the stock as it trades at overbought levels? Key Q4 Expectations * according to Benzinga Pro data KeyBanc Capital Markets semiconductor analyst John Vinh said in a note that he expects higher results for the fourth quarter, premised on strong server demand. Peer Intel Corp.’s INTC shares slumped about 12% Friday after the chipmaker reported fourth-quarter revenue that came in slightly shy of estimates and issued below-consensus guidance. See Also: Best Artificial Intelligence Stock Segments’ Outlook: AMD’s four main business segments are the Client business, comprising primarily PC processor revenue, the Data Center business, which derives revenue from server processor sales, Gaming, comprising gaming processors and semi-custom products, and the Embedded segment, which caters to commercial and industrial customers. The revenue share of each of these segments was over 20% in the third quarter. KeyBanc’s Vinh said he expects improving Genoa processor demand despite weakness in traditional servers. Genoa is AMD’s fourth-generation EPYC server and data center processor based on the Zen 4 microarchitecture. Intel’s Data Center and AI segment revenue fell 10% year-over-year in the fourth quarter. Vinh noted that AMD’s MI300X AI accelerator chips were seeing positive inflection in customer traction. The analyst flagged potential weakness in the Client segment even as peer Intel reported 33% growth in its Client Computing revenue. Data released by IDC showed that global PC shipments fell 2.7% year-over-year in the fourth quarter. “4Q23 was the eighth consecutive quarter of year-over-year shipment volume contraction. The holiday quarter shipments also marked the lowest fourth quarter volume since 4Q06, underscoring a market recovering slowly amidst weak demand and reliance on substantial promotions,” the agency said. Commenting on the Gaming segment, Susquehanna analyst Christopher Rolland said console sell-through data was better but graphics cards have seen a mixed performance. He expressed concerns about FPGA inventory levels that could impact the Embedded segment. Forward Outlook: For the 2024 first quarter, analysts, on average, expect non-GAAP earnings per share of 67 cents on revenue of $5.73 billion. The consensus estimates for the fiscal year 2024 are at $3.88 and $26.79 billion, respectively. Barclays analyst Tom O'Malley expects the company to exit 2024 with an AI revenue run-rate of $4 billion, which will likely increase to more than $7 billion in 2025.  Citing channel checks, the analyst said the MI300 AI accelerator has received stronger feedback. Susquehanna’s Rolland on Monday upwardly revised his price target for the stock from $170 to $210. The analyst called for a slightly disappointing guidance but was not unduly worried about it. “We think the most important swing factor for investors is the narrative and update for MI300,” he said. Earnings Call Focus: Investors will likely seek clarity on customer engagements for MI300X and any update to the $2 billion+ MI300X run-rate guidance for 2024, Genoa ramp-up, and the status of PC recovery and market share dynamics vis-a-vis Intel, KeyBanc said. AMD Price Action: In premarket trading on Tuesday, AMD shares were down 0.90% at $176.23, according to Benzinga Pro data. The stock hit an all-time closing high of $180.33 (intra-day peak at $184.92), on Thursday but has since then slipped back from the peak. Analysts’ average price target for AMD shares, according to TipRanks, is at $163.87, an 8% downside from current levels. Read Next: Tech Titans Microsoft, Apple Lead ‘Magnificent Seven’ Earnings Wave This Week: Can Mega-Caps Ignite Market Optimism? Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}