{
    "title": "Nvidia and AMD set for fresh record highs after update from key AI player",
    "date": "1/18/2024",
    "url": "https://www.news-journal.com/arena/thestreet/nvidia-and-amd-set-for-fresh-record-highs-after-update-from-key-ai-player/article_078003d1-ed68-5eed-a7a4-db97e892fd8a.html",
    "text": "Partly cloudy skies this morning will become overcast during the afternoon. Warm. High around 80F. Winds SSW at 10 to 15 mph.. Cloudy. Low 63F. Winds S at 5 to 10 mph. Updated: March 30, 2024 @ 11:18 am    Nvidia  (NVDA) - Get Free Report shares powered higher in early Thursday trading, with rival chipmaker Advanced Micro Devices  (AMD) - Get Free Report following suit, after a key industry player forecast robust demand for AI-related technologies in the coming year. AI chips, which power everything from generative platforms such as ChatGPT to the more advanced supercomputers used by Google  (GOOGL) - Get Free Report and Tesla  (TSLA) - Get Free Report, have transformed the semiconductor industry. They represent one of the biggest developments in tech since the internet launched in the early 1990s. Related: Elon Musk says AI push requires massive Tesla ownership change Nvidia, the market leader in AI-chip manufacturing, has seen its market value nearly double to around $1.4 billion, since it stunned Wall Street last spring by forecasting a massive surge in sales tied to artificial-intelligence demand. Taiwan Semiconductor,  (TSM) - Get Free Report the world's biggest contract chipmaker and a lead supplier for Apple  (AAPL) - Get Free Report iPhones, added to that optimism Thursday when it said 2024 sales would likely rise around 20%, after it posted better-than-expected fourth-quarter profit. SOPA Images/Getty Images Taiwan Semi, which is also a major component of Nvidia's supply chain, called itself a \"key enabler for AI applications\" and said it expected to spend between $28 billion and $32 billion on capital improvements over the coming year. Both the group's outlook, as well as its willingness to spend on capital improvements, underscore the investment case for AI chipmakers such as Nvidia and AMD. Both are trading at all-time highs heading into the December-quarter-earnings season. Nvidia, which earlier this week unveiled a new set of AI-focused chips designed for the broader consumer market, expects revenue in the region of $20 billion, plus or minus 2%. Profit margins, the company said, are likely to be between 74.5% and 75.5%. AMD, which unveiled an AI-focused chip for the data-center market late last year, forecast fourth-quarter sales in the region of $6.1 billion, plus or minus $300 million, with gross margins of around 51.5%. Smaller rival Micron Technology  (MU) - Get Free Report, meanwhile, told investors late last month that it expected to post a narrower-than-expected second-quarter loss in February, with revenue approaching $5.3 billion, thanks to what it saw as improving AI demand. More Business of AI: Nvidia shares were marked 1.62% higher in premarket trading to indicate an opening bell price of $569.62 each. Such a move would extend the stock's one-month gain to around 13% and value the group at just under $1.4 trillion. The stock hit a record $568.35 each this week amid its strongest rally since the blowout second-quarter earnings in May, which effectively fired the starting gun to the tech's AI-driven surge. AMD shares, meanwhile, were marked 2.83% higher and set to open at an all-time high of $164.70 each, putting the stock on pace for a six-month gain of 38%. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}