{
    "title": "3 Promising AI Stocks That Are Cheaper Than Nvidia",
    "date": "2/4/2024",
    "url": "https://finance.yahoo.com/news/3-promising-ai-stocks-cheaper-125900278.html",
    "text": "Nvidia (NASDAQ: NVDA) represents one of the most straightforward ways to invest in the booming artificial intelligence (AI) market. Most of the world's top AI companies -- including Microsoft, ChatGPT's creator OpenAI, and Amazon -- currently use its high-end GPUs to process complex AI tasks. That market is growing rapidly as more organizations harness the power of generative AI tools to predictively generate fresh content instead of simply crunching large amounts of data. That's why analysts expect Nvidia's revenue and adjusted earnings to soar 119% and 268%, respectively, in fiscal 2024 (which ended this January). They expect its revenue and adjusted earnings to grow another 58% and 69%, respectively, in fiscal 2025 as the AI market continues to expand. Those growth rates are remarkable, but Nvidia's stock isn't exactly a screaming bargain at 30 times forward earnings and 16 times next year's sales. Therefore, investors who want some exposure to the AI market at lower valuations might consider buying three stocks -- Super Micro Computer (NASDAQ: SMCI), Taiwan Semiconductor Manufacturing (NYSE: TSM), and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) -- instead of Nvidia. Super Micro Computer, more commonly known as Supermicro, produces high-performance servers. It controls a much smaller slice of the global server market than Hewlett Packard Enterprise and Dell Technologies, but it's carved out a high-growth niche with its dedicated AI servers. Supermicro's long-standing partnership with Nvidia grants it access to the chipmaker's top-tier data center GPUs before its larger competitors. As a result, its sales of pre-built AI servers skyrocketed as the AI market expanded. Supermicro's revenue surged 46% in fiscal 2022 (which ended in June 2022) and rose 37% in fiscal 2023, and analysts expect an acceleration to 103% growth in fiscal 2024. Its adjusted EPS more than doubled in both fiscal 2022 and fiscal 2023, and analysts anticipate 70% growth in fiscal 2024. But at $535 per share, Supermicro trades at just 27 times this year's earnings. Supermicro might seem pricier than HPE and Dell, but it's not a slow-growth server company. Instead, it's an AI company that is tightly tethered to Nvidia and should keep growing as long as the market is starved for Nvidia-powered AI servers. Taiwan Semiconductor Manufacturing, more commonly known as TSMC, is the world's largest and most technologically advanced contract chipmaker. It manufactures chips for a long list of \"fabless\" chipmakers, including Nvidia, Advanced Micro Devices, Apple, and Qualcomm. Nvidia designs its own GPUs, but it outsources the production to TSMC's foundries, which are capable of manufacturing the world's smallest, densest, and most power-efficient chips. AMD, which is trying to catch up to Nvidia with its own data center GPUs, also outsources the production of those chips to TSMC. OpenAI has even reportedly been holding talks with TSMC to form a joint venture to manufacture its own AI chips. Simply put, TSMC is a linchpin of the global semiconductor and AI markets. But its growth is also cyclical. In 2023, TSMC's revenue and earnings fell 9% and 21%, respectively, in USD terms as the smartphone and PC markets cooled off. But in 2024 the company expects its revenue to rise by more than 20% as those markets recover, it ramps up its production of its latest 3nm chips, and profits from the \"robust\" growth of the AI market. Analysts expect TSMC's revenue and earnings to grow 23% and 10%, respectively, this year. However, its stock trades at just 18 times forward earnings -- which makes it a cheaper way to profit from the expansion of the AI market than Nvidia. Alphabet's Google owns the world's largest search engine and online advertising business, and the third-largest cloud infrastructure platform. Its sprawling ecosystem also includes the world's most popular streaming video platform (YouTube), top mobile operating system (Android), and leading webmail service (Gmail). Google ties together all of those services with its own AI algorithms, and it's been expanding into the generative AI market with its Bard chatbot and Gemini large language models. It's already one of the world's largest buyers of Nvidia's data center GPUs, and it's been developing its own AI accelerators to gradually reduce its dependence on those chips. Alphabet's revenue only rose 9% in 2023 as Google's advertising business struggled with tough macro headwinds throughout the first half of the year. However, its growth accelerated again in the second half as its cloud platform -- which it's been beefing up with new AI tools -- continued to generate double-digit sales growth with rising operating margins. Analysts expect Alphabet's revenue and earnings to grow 11% and 16%, respectively, in 2024. Those growth rates are stable, but it trades at just 21 times forward earnings, which makes it another cheap play on the growing AI market. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 29, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon, Apple, and Qualcomm. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Microsoft, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Super Micro Computer. The Motley Fool has a disclosure policy. 3 Promising AI Stocks That Are Cheaper Than Nvidia was originally published by The Motley Fool Related Quotes "
}