{
    "title": null,
    "date": "2/10/2024",
    "url": "https://finance.yahoo.com/news/missed-nvidia-2-incredibly-cheap-111500025.html",
    "text": "The artificial intelligence (AI) gravy train has given several stocks a big boost over the past year, notably Nvidia, which has capitalized on the booming demand for AI chips and enjoyed an eye-popping jump in its revenue and earnings. Shares of Nvidia have shot up a terrific 215% in the past year. As the chart shows, the stock's surge is justified, considering how rapidly its revenue and earnings have increased in recent quarters. However, the big jump in price means that shares of Nvidia are not in value territory anymore. Nvidia sports a stunning price-to-sales ratio of 37. It also trades at a lofty 90 times trailing earnings, which is higher than its five-year average of 79. Of course, Nvidia can justify these expensive multiples by sustaining its solid growth in the future, but there are cheaper options to capitalize on the AI wave as well. Super Micro Computer (NASDAQ: SMCI) and Qualcomm (NASDAQ: QCOM) are two attractively valued stocks that you may consider buying right now. Super Micro Computer is already in red-hot form on the stock market, surging a whopping 587% in the past year and crushing Nvidia's returns by a huge margin. However, shares of the company that's known for making AI server and storage solutions continue to trade at very attractive levels despite this huge jump. You can buy Super Micro stock for just 3.3 times sales right now. Buying the stock at this valuation looks like a no-brainer, not only because it is way cheaper than Nvidia, but also because it is growing at a tremendous pace. Super Micro released its fiscal 2024 second-quarter results (for the three months ended Dec. 31) on Jan. 29. The company's revenue more than doubled from the year-ago period to $3.66 billion last quarter. Its non-GAAP (generally accepted accounting principles) net income shot up from $3.26 per share in the year-ago period to $5.59 per share. The company's impressive revenue and earnings growth was driven by the rapid deployment of AI servers. Super Micro has optimized its server solutions according to the requirements of AI servers, helping data center operators reduce electricity and cooling costs. Its server rack solutions are used for deploying AI chips from multiple vendors such as Nvidia, Intel, and Advanced Micro Devices. The good part is that the company is witnessing terrific demand for its offerings, which is why it has been focused on enhancing its production capacity. Charles Liang, CEO of Super Micro, pointed out on the company's latest earnings conference call: Today, our production utilization rate is about 65% across our USA, Netherlands, and Taiwan facilities, and they are quickly filling. To address this immediate capacity challenge, we are adding two new production facilities and warehouses near our Silicon Valley HQ, which will be operating in a few months. The new Malaysia facility will focus on expanding our building blocks with lower costs and increased volume, while other new sites will support our annual revenue capacity above $25 billion. It won't be surprising to see Super Micro eventually hitting $25 billion in annual revenue thanks to its capacity expansion moves, as demand for AI servers is expected to grow fivefold between 2023 and 2027, generating an annual revenue of $150 billion at the end of the forecast period. More importantly, Super Micro is already benefiting from this solid growth in AI server demand, as its latest guidance update tells us. The company now expects to end fiscal 2024 with revenue of $14.5 billion at the midpoint of its guidance range, which would be a 106% jump over the prior year. Super Micro was earlier expecting fiscal 2024 revenue to land at $10.5 billion. Assuming Super Micro does hit its annual revenue guidance and maintains its sales multiple, its market capitalization could increase to $48 billion. That would be a 50% jump from current levels, which is why investors looking to add an AI stock to their portfolios should consider acting quickly before Super Micro heads higher. Share of Qualcomm have underperformed the broader market over the past year with gains of just 5%, which is not surprising, considering the mobile chipmaker's tepid financial performance. Qualcomm has been weighed down by poor smartphone sales in the past year. According to market research firm IDC, smartphone shipments were down 3.2% in 2023 to 1.17 billion units. Qualcomm gets more than two-thirds of its total revenue from selling chipsets used in smartphones, so the weakness in this segment was bound to have a negative impact on the company's performance. The good news for Qualcomm is that the smartphone market is set for a solid turnaround from 2024. The turnaround is already underway, with smartphone shipments rising 8.5% in the fourth quarter of 2023, outpacing the 7.3% growth that analysts were looking for. Morgan Stanley is anticipating the global smartphone market to grow by 4% in 2024 and 4.4% next year. However, the pace of growth in Q4 2023 points toward better smartphone sales growth this year, with AI expected to play a central role in driving a stronger performance. Counterpoint Research estimates that shipments of generative AI-powered smartphones could hit 100 million units in 2024. Annual shipments of AI-enabled smartphones are expected to hit 522 million units in 2027, clocking an annual growth rate of 83%. In all, a total of 1 billion AI-powered smartphones are expected to be shipped over the next four years. Qualcomm is already on its way to capitalizing on this opportunity, with its Snapdragon 8 Gen 3 chip powering AI features on Samsung's latest Galaxy S24 Ultra smartphone. Qualcomm's management pointed out on the latest earnings conference call that Samsung's S24 family of devices includes \"on-device AI features such as live translate interpreter, chat assist, nightography, and more.\" Additionally, Qualcomm has \"extended a multi-year agreement with Samsung relating to Snapdragon platforms for flagship Galaxy smartphone launches starting in 2024.\" This should pave the way for Qualcomm to take advantage of the nascent AI-enabled smartphone market in the long run, considering that Samsung is the world's second-largest smartphone manufacturer. It is worth noting that analysts have already been raising Qualcomm's revenue growth estimates of late. AI could give the company an additional lift and help Qualcomm outpace analysts' expectations in the future. But even if the company hits $44 billion in annual revenue over the next couple of years and maintains its current sales multiple of 5, its market capitalization could jump to $220 billion. That would be a 39% increase over current levels. However, don't be surprised to see Qualcomm stock delivering stronger gains on the back of a faster jump in its revenue. Moreover, the market may reward it with a higher sales multiple based on its AI prospects, which is why savvy investors would do well to buy the stock now. Should you invest $1,000 in Super Micro Computer right now? Before you buy stock in Super Micro Computer, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Super Micro Computer wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 5, 2024 Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Nvidia, and Qualcomm. The Motley Fool recommends Intel and Super Micro Computer and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Missed Out on Nvidia? 2 Incredibly Cheap Artificial Intelligence (AI) Stocks to Buy Before They Skyrocket 39% to 50%. was originally published by The Motley Fool Related Quotes "
}