{
    "title": "Missed Out on Nvidia's Terrific Rally? Buy This Magnificent Artificial \nIntelligence (AI) Stock Before It Goes on a Bull Run.",
    "date": "2/3/2024",
    "url": "https://finance.yahoo.com/news/missed-nvidias-terrific-rally-buy-102000167.html",
    "text": "Shares of Nvidia have shot up 206% in the past year as the massive demand for the company's artificial intelligence (AI) chips triggered rapid growth in its top and bottom lines. That rally has also lifted the broader semiconductor sector, as shown by the 49% gain in the PHLX Semiconductor Sector index in the past year. But not all components of the index have benefited equally. ASML Holding (NASDAQ: ASML) is one such example. Shares of the Dutch chipmaking equipment company have jumped only 32% in the past year, underperforming the index and Nvidia by a big margin. But all that could change very soon -- ASML stock shot up nearly 9% after the company released its fourth-quarter 2023 results on Jan. 24. Let's see why Wall Street gave those results a big thumbs-up. ASML finished 2023 with total revenue of 27.5 billion euros ($29.8 billion), up 30% over the previous year. Its fourth-quarter revenue of $7.84 billion, however, increased at a slower 12% over the prior year. The good news was that ASML's top line exceeded the $7.43 billion consensus estimate. The company's earnings of $5.64 per share were also well ahead of the $5.16 Wall Street predicted. The slower year-over-year growth in the fourth quarter can be attributed to the slowdown in semiconductor equipment spending last year, which is estimated to have been 15% lower. This explains why ASML saw a decline in orders in 2023. The company's net bookings, which refers to all the system sales orders for which it has received written authorizations, fell to $21.7 billion from $33.2 billion in 2022. What's more, management adopted a cautious approach on guidance. The company expects 2024 revenue to remain at last year's levels, which means that its growth could drop sharply this year. That cautious guidance could be attributed to the drop in orders last year, but ASML adds that there are \"positive signs\" in the semiconductor industry and the company is witnessing an improvement in utilization levels. This is evident from the sharp increase in ASML's orders in the fourth quarter of 2023. The company received net bookings worth $10 billion in the fourth quarter, a huge jump from $2.8 billion in the preceding quarter. The year-over-year growth in bookings was 46%. Analysts would have settled for net bookings worth just $3.9 billion, but ASML knocked it out of the park with a substantially stronger order book. The reason behind this significant outperformance is simple: AI. The company's extreme ultraviolet (EUV) lithography machines are used for manufacturing chips based on advanced process nodes, allowing chipmakers to produce 7-nanometer (nm), 5nm, and 3nm chips. The demand for these advanced chip nodes, especially 5nm and 3nm, is booming thanks to AI. That's because chips manufactured using these smaller process nodes carry more computing power and are more power efficient -- ideal for AI workloads. Nvidia, for instance, is expected to move to a 3nm manufacturing node for its next-generation H200 data center GPUs (graphics processing units) in 2024. Its new GPU is expected to have more than double the performance of the current H100, which is manufactured on an advanced 5nm node. With the demand for AI chips predicted to increase at an annual rate of 38% through 2032, according to Allied Market Research, chipmakers are aggressively placing orders for ASML's EUV lithography machines. The company received $6.1 billion worth of orders for its EUV machines last quarter, which was 60% of the total orders. On a year-over-year basis, EUV bookings jumped 65% from $3.7 billion in the 2022 fourth quarter. The demand for ASML's EUV machines could increase further as the AI chip market gains momentum. Investors should also note that ASML exited 2023 with a massive order backlog of $42.3 billion, which is more than the company's 2024 revenue forecast. So, it won't be surprising to see ASML outpacing its prediction and delivering stronger growth this year. ASML is also expecting to achieve \"significant growth\" from 2025 following this year's flat performance, which explains why analysts have substantially raised their forecasts for the next two years. ASML is a much cheaper AI bet when compared to Nvidia right now. ASML is trading at 11 times sales and 40 times trailing earnings. These multiples are lower than Nvidia's price-to-sales (P/S) ratio of 34 and trailing earnings multiple of 81. ASML's forward multiples are lower than Nvidia's readings as well. However, ASML might not be available at such attractive multiples in the future given the increase in the company's AI business, its impressive backlog, and the sharp jump that analysts are expecting in its revenue from next year. That's why investors looking to buy an AI stock that's cheaper than Nvidia right now, but one that could go on a bull run, should consider buying ASML while it is still trading at relatively affordable levels. Should you invest $1,000 in ASML right now? Before you buy stock in ASML, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and ASML wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 29, 2024  Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends ASML and Nvidia. The Motley Fool has a disclosure policy. Missed Out on Nvidia's Terrific Rally? Buy This Magnificent Artificial Intelligence (AI) Stock Before It Goes on a Bull Run. was originally published by The Motley Fool Related Quotes "
}