{
    "title": "Amid the surge of AI semiconductor companies such as Nvidia in the U.S. \nstock market, analysts say t.. - MK",
    "date": "3/18/2024",
    "url": "https://www.mk.co.kr/en/stock/10968249",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share Amid the surge of AI semiconductor companies such as Nvidia in the U.S. stock market, analysts say that if the high stock prices of these companies are burdensome, it is time to pay attention to industrial goods. In particular, the advice is to pay attention to the machinery industry. On the 19th, Min Byung-kyu, a researcher at Yuanta Securities, said, \"The U.S. stock market is still showing an upward trend that is concentrated on a small number of stocks. Among the M7 components that led the strong performance in 2023, Tesla, Apple, and Alphabet are rather below the returns of the S&P 500 index, he said. \"Tesla has the lowest returns among 500 components.\" Nvidia, which has a high concentration of artificial intelligence (AI), is still performing well, ranking second in earnings and Meta fourth. However, it analyzed that the burden on companies such as Nvidia has increased. Researcher Min analyzed, \"Recently, Nvidia's daily volatility has increased, and this volatility is also occurring in gold and bitcoin, which are sensitive to interest rates.\" As an alternative to these companies, it is time to pay attention to machinery and defense in the industrial goods sector. Researcher Min said, \"If AI-led stocks' high stock price growth and recent volatility are burdensome, economic sensitivity will be a good alternative.\" \"The U.S. composite leading index has been steadily recovering since its low point in April last year, and industrial goods and finance are the sectors that move most similarly to the leading index.\" \"The defense industry has recently attracted attention in the industrial goods sector, but the machinery industry is also likely to improve,\" he said. \"The economic outlook for the domestic machinery industry is also reversed.\" He explained that Caterpillar, a leading U.S. stockholder, has returned 17.4% since the beginning of the year, far exceeding the S&P 500 index. \"Considering that the U.S. economic outlook is rapidly changing (soft landing), we believe it is not too late to buy it,\" he stressed. 2024-03-29 17:44:51 2024-03-28 14:43:55 2024-03-28 08:35:39 2024-03-29 10:06:50 2024-03-29 16:18:40 2024-03-28 22:06:01 2024-03-30 06:02:41 2024-03-28 18:05:38 2024-03-29 20:51:03 2024-03-29 09:51:58 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}