{
    "title": "NVIDIA CORP. (CDRS) Trade Ideas — SWB:NVDG — TradingView",
    "date": "3/26/2024",
    "url": "https://www.tradingview.com/symbols/SWB-NVDG/ideas/page-149/?sort=recent",
    "text": "On NVDA at the breakout of the resistance line with a big candle and with a large volume and if we have a pullback as we see on the chart it means that we have a big probability of an uptrend. We have a potential area of value shown. If we get a candlestick pattern then we could enter. If you are an aggressive trader you could have already entered the trade at the area/level shown. Possible short. No entry yet, but weakness is clear.\n\nMy TP level.. for now. Expect a short ferm pullback to the moving avg or nearest support level. RSI looking good with strong ADR confirmation. MACD on daily looks interesting. If we can hold these levels next stop would be test $275s looks like this bounce could have potentially topped out prepare for mega down I think. I think next week will be good for $NVDA and the whole industry. if next week break 265.98, it will heading down to 256.29 to support level and hit high. Nvidia (NVDA) has been on a monster rally since middle of March before corrected for a past few days. Prices are currently trading above the $265.45 level and EMA10-EMA20 showing golden cross, both which suggesting NVDA possibly has a trend continuation towards the upside. First resistance is $289.54 while second resistance is $305. In contrasts, a daily close... Broke the 1hr H&S most likely going to retest the neckline to then be rejected to a target of 260. Could potentially drop to a low of 240~ to bring it up to 310~ +/- $3 NVDA with a massive triple bottom on the 1hr , also the last time the MACD was this low and about to cross we jumped from 210ish to 270 in 7 days. \nBoth RSI and Stoch are heavily oversold and are about to fly back to the upside. Assuming we are beginning to consolidate while using a fib ext we could see a bounce up to the 300 to 320 mark in the coming days, weeks,... nice scalp on nvda 44% return, compression candle. 15min plus the 2min with the 30 sec time frames. elliot analyse for nvidia now we are in b from wave 4 and we will go down with 5 waves zigzag nvda  buy  ...  buy  after  the  break  above  the  resistance  level 1  at  284.69  ...  finally  target  resistance  level 2 ... Nvidia will move up then start shorting , get ready to open a sell postions . Hello traders and investors! Let’s see how NVDA is doing today!\n \nFirst, in the 1h chart, NVDA is still in a clear bull trend, and there’s not a single bearish structure around. In this case, all we can do is assume it’ll keep pushing up, until it hits the next resistance level, which we’ll talk about soon.\n \nHowever, the most important key point on NVDA is the... Hello guys \n\nAccording to the chart you can see the price is moving downward trend and it has need more correction to have good R/r then we have permission to take short position until the target. \nYou should take signal at first then dont forget use stop loss and observe to your capital management.\n\nTake a look on volume guys dont forget to check it, And dont... ZIGZAG correction.happy trading. all the best. Target should be 269. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}