{
    "title": "5 Things to Know About Heavy Insider Selling on Nvidia Stock",
    "date": "3/9/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/IXTC/pressreleases/24678010/5-things-to-know-about-heavy-insider-selling-on-nvidia-stock/",
    "text": "If there has been any stock that has defined the artificial intelligence (AI) rally over the better part of two years now, it has been Nvidia (NVDA). The Jensen Huang-led designer of chips - an essential piece of the architecture needed for demanding AI computing tasks - has been at the forefront of the tech revolution, with the impact showing on both its top- and bottom-line results over the past year. Despite a pullback of more than 5% in Friday's session, NVDA stock is up a staggering 76.5% in 2024. The shares have easily more than tripled over the past 52 weeks, pushing Nvidia's market cap past $2 trillion. With questions rising about the possibility of an AI bubble, and whether breakout stocks like NVDA might be overvalued, a bout of heavy selling by one longtime company insider was the topic of headlines this past week. But is insider selling on NVDA a reason for investors to dump the stock? Here's a closer look. A recent company filing with the Securities and Exchange Commission (SEC) revealed that Director Tench Coxe offloaded 200,000 shares of the company for about $170 million. Coxe, a board member since 1993, acquired these shares for an unbelievable $0.82 in 1997, two years before the company went public. To put that into context, Nvidia's market cap back then was less than a billion dollars. Up a staggering 112,911% since then, it would be an understatement to say that the third-largest shareholder of the company has made a tidy profit on his NVDA shares. Notably, after this sale, Coxe still owns a stake worth 0.1515% in the company. Other longtime insiders also dumped NVDA stock in early March. Mark Stevens, a director at the company since 2008, sold 12,000 shares of the company on March 4 for a total value of about $10.2 million. Meanwhile, on March 5, Dr. Persis Drell, who joined the company's board in 2015, parted with 5,000 NVDA shares worth about $4.2 million. So, are these insider sales reason to panic? Probably not - here are 5 things investors should know: 1. Insider selling isn't always straightforward: Insider buying offers a more clear-cut sentiment read, as it's generally accepted that insiders might sell their stock for any number of possible reasons. It can be a red flag in some circumstances; here are a few indications to know when investors should be wary of heavy insider selling. 2. Why would insiders sell Nvidia? Notably, there has been no insider buying on NVDA since 2020, and no insider buying of any real size since a roughly $4.8 million purchase by Coxe himself in 2004. Over this same time frame, though, the growth-focused company paid out millions worth of stock-based compensation, lessening the incentive for this group to buy NVDA stock on the open market. 3. The shares were sold through Coxe's trust: As a longtime NVDA insider, Coxe holds shares through multiple vehicles - through a trust, a profit sharing plan retirement trust, and directly held shares. In the sale reported on March 5, Coxe's directly held shares were left untouched, and only shares held through his trust were unloaded. 4. Coxe has been a regular seller of NVDA: A brief review of insider selling activity on NVDA indicates that Coxe has regularly unloaded large tranches of the stock at various prices over the years. The last time a flurry of headlines hit the wires around insider selling on Nvidia, it was last June, when Coxe was selling shares through this same trust at around $422 each. 5. His directly held share count is climbing: Since that June 2023 sale through his trust, Coxe's directly held share count in Nvidia has actually increased, from 4,578 shares to more than 5,200 now. Meanwhile, through his trust, Coxe still owns more than 3 million shares of the company. So, with few clues to go on from insiders, it's worth taking a look at the fundamentals - and Nvidia's consistently impressive quarterly results continued in Q4, as the company reported blockbuster revenue and earnings. Revenues for the quarter came in at $22.1 billion, up a whopping 265% from the previous year, and above the consensus estimate of $20.62 billion. EPS grew even faster, up 486.4% YoY to come in at $5.16, which comfortably surpassed the consensus estimate of $4.59. Notably, over the past 10 quarters, the company's EPS has exceeded consensus expectations nine times. The company also has a solid cash position, given its asset-light model, ending Q4 of 2023 with a cash balance of $26 billion - almost double the previous year's figure of $13.3 billion, and well above its short-term and long-term debt levels of $1.25 billion and $8.46 billion, respectively. Net cash from operating activities came in at $11.5 billion, more than 4x of the prior year's figures. Even after its rapid expansion over the past few years, analysts believe Nvidia's strong growth can continue. Forward revenue growth is pegged at 69.2%, compared to NVDA's 5-year average pace of 25.1%. EPS growth estimates for the current quarter are lofty, at 467.1% on average, with fiscal year 2025 earnings expected to increase 83.9% to $21.77 per share. Overall, analysts remain bullish about NVDA stock, which has an average rating of “Strong Buy.” Although the mean target price of $838.93 has already been surpassed, the high target price of $1,400 denotes an upside potential of about 60% from current levels. Out of 39 analysts covering the stock, 34 have a “Strong Buy” rating, 2 have a “Moderate Buy” rating, and 3 have a “Hold” rating. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}