{
    "title": "Humanoid robots will all the rage all in 2024, Nvidia / WiMi is actively \nstudying AI development",
    "date": "3/25/2024",
    "url": "https://www.newstrail.com/humanoid-robots-will-all-the-rage-all-in-2024-nvidia-wimi-is-actively-studying-ai-development/",
    "text": "Newstrail.com At present, artificial intelligence is in the third climax stage of development. From ChatGPT swept the world to today, there have been countless breakthroughs. On the other hand, humanoid robots have shown great potential and attraction in the past two years. According to the consensus of the industry, under the enabling of the “big AI” model, humanoid robots have become the competitive highland for enterprises to embrace the AI industry and enter the AI industry chain. Not long ago, the general robot Mobile ALOHA developed by the Stanford Chinese team became popular on the Internet. In the video, ALOHA not only completed dishes such as slippery egg shrimp and dried shell roast chicken, but also realized complex movements such as cleaning the pan, cleaning the glass and broom sweeping the floor.  Tech companies push for humanoid robots Following that, Tesla (TSLA) posted a new video of the humanoid robot Optimus on social media, showing more fluency than did a few weeks ago. In addition, the AI agent Eureka developed by Nvidia (NVDA) can teach the robot complex motion control skills, such as turning pens, opening drawers and cabinets, throwing and catching balls, and operating scissors. Nvidia says the breakthrough will redefine machine learning. It’s worth noting that humanoid robot startup FigureAI announced $675 million in funding. This is a tech company backed by Nvidia and Amazon, whose robot Figure01 is popular for making coffee. Figure 01 They can train them for a cup of coffee, which is the ‘GPT moment’ of a humanoid robot.”  Humanoid robot, a new quality productivity carrier integrating advanced technologies such as artificial intelligence, high-end manufacturing and new materials, will have a subversive impact on social industrial transformation and global competition pattern. As the best entity for the original application of AI, humanoid robots may be accelerated in the background of more and more technology giants entering the market. Citic Securities Research report pointed out that thanks to the promotion of global technology giants, the development of the humanoid robot industry will be further accelerated, and the landing of each use scenario will also be accelerated. Some industry insiders analyze that with the acceleration of industrialization and commercial application, the development of humanoid robot industry is at an inflection point. WiMi, the development opportunities Humanoid robot station on the new opportunity, is expected to open up industrial, commercial, household and other scenarios, become a new engine of economic development. In this background, the data shows, WiMi Hologram Cloud (NASDAQ: WIMI) is a focus on technology companies in the field of AI, after years of focus on independent innovation, with “AI + vision”, “originality” and “disruptive” and a variety of technical foundation, through production, walk the path of high level technology self-improvement, strive to grab frontier technology high. At present, WiMi has successively won the patent of humanoid robot, which is derived based on the in-depth understanding of AI visual control technology. The development of the robot industry is expected to become an important position for the development of new quality productivity. In addition, driven by AI technology, WiMi accelerates the research and development process of perceptual understanding, motion control and operation ability of humanoid robots, which creates the possibility for humanoid robots to further penetrate into industry applications. In the face of a new round of scientific and technological revolution and industrial transformation, WiMi actively seize the opportunity, increase innovation efforts, cultivate and strengthen emerging industries, increase the layout and construction of future industries, and improve the humanoid robot industry system. Looking into the future, WiMi will always maintain the attention to the development trend of the humanoid robot industry, accelerate the building of a strategic emerging industrial cluster with international competitiveness, and bring new growth space for the business. To sum up The humanoid robot industry has great development potential and wide application prospects, which is a new track for the future industry. At present, the development of humanoid robot industry is from point to surface, and AI achievements are expected to accelerate the landing of humanoid robots. With the emergence of artificial intelligence models, the robot industry has set off a new climax, attracting many enterprises, capital and research and development institutions to actively participate. In the future, the humanoid robot will continue to be close to people’s lives, and have a broad and profound impact on the progress of human society. It is expected to become a subversive product after computers, smart phones and new energy vehicles. In short, in 2024, with the maturity of humanoid robots, humanoid robots may accelerate the realization of qualitative leap. "
}