{
    "title": "Nvidia board members sell nearly $300M of AI chipmaker's surging stock",
    "date": "3/7/2024",
    "url": "https://www.aol.com/nvidia-board-members-sell-nearly-185512769.html",
    "text": "Advertisement For premium support please call: Nvidia’s board members collectively cashed in on nearly $300 million worth of holdings in the $2 trillion artificial intelligence giant so far this year, reaping the benefits of the company’s recent stock surge. Longtime Nvidia board member Tench Coxe — the former managing director at California-based venture capital investment firm Sutter Hill Ventures — sold 200,000 shares on March 5 at $850.03 to $852.50, according to a regulatory filing. The transaction marks a windfall as high as $170.5 million for Coxe, who has been on Nvidia’s board since 1993. Under the terms of his agreement as a director, Coxe earns restricted stock valued at $255,000 annually as well as $85,000 in cash, Fortune reported. He acquired shares for just $0.82 in the chipmaker in 1997 — two years before the firm went public. The figure means Coxe made a more than 100,000% profit on his investment nearly three decades ago. For reference, the AI-chip developer’s CEO, Jensen Huang, holds about 86 million shares in the company, a 3.5% stake. Huang’s holdings in the company have minted him a $78 billion fortune, rocketing him to the No. 20 spot on the Bloomberg Billionaire’s List. The day before Coxe’s selloff, Nvidia director Mark Stevens — who joined the board in 2008 — sold 12,000 shares at $852.06 to $855.02, earning him roughly $10.2 million, per Fortune, citing a separate Securities and Exchange Commission filing. Stevens — the billionaire managing partner at private family office investment firm S-Cubed Capital and former partner of high-profile VC firm Sequoia Capital — shed another 15,000 shares last month, worth about $12 million. And in January, Stevens — a director since 2008 — shed 36,000 Nvidia shares, when they were trading at roughly $546 each, for an approximately $19.7 million payday, according to Fortune. Yet another board member, biopharmaceutical veteran Mark Perry — who also serves as an independent consultant to Nvidia — 15,000 shares for about $11.9 million on Feb. 23, per Fortune. Perry’s transaction took place two days after Nvidia reported that its fourth-quarter revenue beat estimates by an impressive 7% margin. A week later, longtime Nvidia board member and managing partner of private investment firm Square Wave Venture Harvey Jones sold 65,000 of his shares in the company for a total value of $53 million. The six transactions year to date have made four of Nvidia’s 13 board members a collective $276.8 million. Despite their sales, all board members still have a significant stake in Nvidia. Coxe holds around 4.1 million shares, while Stevens’ stake consists of about 4.4 million shares, according to Fortune. Perry still boasts 152,000, shares, and Jones holds roughly 1 million, Fortune reported. The selloffs come as Nvidia has seen historic gains on the Nasdaq, jockeying with Microsoft and Apple — who have $3 trillion and $2.6 trillion valuations, respectively — for a spot among the most valuable companies. At the time of writing, Nvidia was trading at $917.10 — up more than 30% over the past month alone, and a whopping 90.51% year-to-date increase. The company currently boasts a market cap of $2.3 trillion. Representatives for Nvidia declined to comment. Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}