{
    "title": "ServiceNow, Hugging Face, and NVIDIA Release Open Access LLMs",
    "date": "3/2/2024",
    "url": "https://svdaily.com/2024/03/02/servicenow-hugging-face-and-nvidia-release-open-access-llms/",
    "text": "Silicon Valley Daily News about Silicon Valley business almost everyday. SANTA CLARA— ServiceNow, Hugging Face, and NVIDIA, have announced the release of StarCoder2, a family of open‑access large language models (LLMs) for code generation that sets new standards for performance, transparency, and cost‑effectiveness. StarCoder2 was developed by the BigCode community, stewarded by ServiceNow, the leading digital workflow company, and Hugging Face, the most‑used open‑source platform where the machine learning community collaborates on models, datasets and applications. Trained on 619 programming languages, StarCoder2 can be further trained and embedded in enterprise applications to perform specialized tasks such as application source code generation, workflow generation, text summarization, and more. Developers can use its code completion, advanced code summarization, code snippets retrieval, and other capabilities to accelerate innovation and improve productivity. StarCoder2 offers three model sizes: a 3 billion‑parameter model trained by ServiceNow, a 7 billion‑parameter model trained by Hugging Face, and a 15 billion‑parameter model built by NVIDIA with NVIDIA NeMo and trained on NVIDIA accelerated infrastructure. The smaller variants provide powerful performance while saving on compute costs, as fewer parameters require less computing during inference. In fact, the new StarCoder2 3 billion‑parameter model also matches the performance of the original StarCoder 15 billion‑parameter model. “StarCoder2 stands as a testament to the combined power of open scientific collaboration and responsible AI practices with an ethical data supply chain,” emphasized Harm de Vries, lead of ServiceNow’s StarCoder2 development team, and co‑lead of BigCode. “The state‑of‑the‑art open‑access model improves on prior generative AI performance to increase developer productivity and provides developers equal access to the benefits of code generation AI, which in turn enables organizations of any size to more easily meet their full business potential.” “The joint efforts led by Hugging Face, ServiceNow and NVIDIA enable the release of powerful base models that empower the community to build a wide range of applications more efficiently with full data and training transparency,” said Leandro von Werra, machine learning engineer at Hugging Face and co‑lead of BigCode. “StarCoder2 is a testament to the potential of open‑source and open science as we work toward democratizing responsible AI.” “Since every software ecosystem has a proprietary programming language, code LLMs can drive breakthroughs in efficiency and innovation in every industry,” said Jonathan Cohen, vice president of applied research at NVIDIA. “NVIDIA’s collaboration with ServiceNow and Hugging Face introduces secure, responsibly developed models, and supports broader access to accountable generative AI that we hope will benefit the global community.” Fine‑Tuning Advances Capabilities with Business‑Specific Data StarCoder2 models share a state‑of‑the‑art architecture and carefully curated data sources from BigCode that prioritize transparency and open governance to enable responsible innovation at scale. The foundation of StarCoder2 is a new code dataset called The Stack v2 which is more than 7x larger than The Stack v1. In addition to the advanced data set, new training techniques help the model understand low‑resource programming languages (such as COBOL), mathematics, and program source code discussions. StarCoder2 advances the potential of future AI‑driven coding applications, including text‑to‑code and text‑to‑workflow capabilities. With broader, deeper programming training, it provides repository context, enabling accurate, context‑aware predictions. These advancements serve seasoned software engineers and citizen developers alike, accelerating business value and digital transformation. Users can fine‑tune the open‑access models with industry or organization‑specific data using open‑source tools such as NVIDIA NeMo or Hugging Face TRL. Organizations have already fine‑tuned the foundational StarCoder model to create specialized task‑specific capabilities for their businesses. ServiceNow’s text‑to‑code Now LLM was purpose‑built on a specialized version of the 15 billion‑parameter StarCoder LLM, fine‑tuned and trained for ServiceNow workflow patterns, use‑cases, and processes. Hugging Face also used the model to create its StarChat assistant. BigCode Fosters Open Scientific Collaboration in AI BigCode represents an open scientific collaboration jointly led by Hugging Face and ServiceNow. Its mission centers on the responsible development of LLMs for code. The BigCode community actively participated in the technical aspects of the StarCoder2 project through working groups and task forces, leveraging ServiceNow’s Fast LLM framework to train the 3 billion‑parameter model, Hugging Face’s nanotron framework for the 7 billion‑parameter model, and the end‑to‑end NVIDIA NeMo cloud‑native framework and NVIDIA TensorRT‑LLM software to train and optimize the 15 billion‑parameter model. Fostering responsible innovation is at the core of BigCode’s purpose, demonstrated through its open governance, transparent supply chain, use of open‑source software, and the ability for developers to opt data out for training. StarCoder2 was built using responsibly sourced data under license from the digital commons of Software Heritage, hosted by Inria. “StarCoder2 is the first code generation AI model developed using the Software Heritage source code archive and built to align with our policies for responsible development of models for code,” stated Roberto Di Cosmo, Director at Software Heritage. “The collaboration of ServiceNow, Hugging Face, and NVIDIA exemplifies a shared commitment to ethical AI development, advancing technology for the greater good.” StarCoder2, as with its predecessor, will be made available under the BigCode Open RAIL‑M license, allowing royalty‑free access and use. Furthermore, the supporting code for the models resides on the BigCode project’s GitHub page. All StarCoder2 models will also be available for download from Hugging Face and the StarCoder2 15B model is available on NVIDIA AI Foundation models for developers to experiment with directly from their browser, or through an API endpoint. California remains the most populous state in the nation from new figures by the U.S. Census Department. According to the U.S. Census Bureau’s Vintage 2021 national and state population estimates and components of change, the population of the United States grew in the past year by 392,665, or 0.1%, the lowest rate since the nation’s […] MOUNTAIN VIEW— Intuit Inc., the financial software company known for TurboTax, QuickBooks, Mint and Credit Karma, is getting into the venture capital business with the launch of Intuit Ventures, its corporate venture capital arm. Intuit Ventures will help accelerate innovation for businesses and consumers through the companies it invests in, driving future innovations for consumers and small businesses. The […] LEIXLIP, Ireland — Intel has begun using Intel 4 technology at its new Fab plant in Ireland, which deploys extreme ultraviolet (EUV) technology, and the first use of EUV in high-volume manufacturing (HVM) in Europe. The new technology paves the way for future products like Intel’s upcoming Intel Core Ultra processors (code-named Meteor Lake), which […]  "
}