{
    "title": "It's Not Impossible for Nvidia Stock to Hit $10000 by 2025",
    "date": "3/30/2024",
    "url": "https://www.tradingview.com/news/investorplace:f079f9568094b:0-it-s-not-impossible-for-nvidia-stock-to-hit-10-000-by-2025/",
    "text": "You know those far-fetched headlines asking if a stock can go to $10,000 by 2025, but it’s only trading at $1,000? It is pure silliness. However, Nvidia NVDA stock could be the exception. As I write this, Nvidia’s share price is $904, up 14% for the month, 107% for six months, 234% for the past 52 weeks, and 1,912% over the last year. From its October 2022 low of around $112, it’s up 707% in 18 months. To reach $10,000 by the end of 2025, Nvidia must generate a compound annual growth rate of nearly 300%. It seems outlandish and probably is, but if the company continues to deliver AI-fueled growth in 2024 and 2025, I’m not sure investors can count it out. I mean, look at Monster Beverage MNST. Over the past 30 years, its shares have appreciated by around 200,000%, a CAGR of nearly 29%. Now, beverages might not have cyclical corrections like chip companies, but they also don’t have the kind of rocket-fueled growth that chip companies experience, especially when we’re talking about life-altering technology like generative AI. I don’t think it can reach $10,000 by 2025. But if it did, here’s how it would do so. Multiple Expansion Would Need to Kick In Nvidia trades at a multiple of nearly 75 times its trailing 12-month earnings and 35.6 times its forward earnings. The latter is actually below its five-year average of 39.3x. At the same time, its price-to-sales ratio is 36.6x, while its five-year average is 18.2x. Its PEG ratio, at 1.55, suggests that it is undervalued, considerably lower than its five-year average of 2.44. For those unfamiliar with the PEG ratio, it is P/E (current price divided by EPS estimate for the current fiscal year) divided by its projected 5-year EPS growth rate. As Motley Fool contributor David Jagielski pointed out in February, Nvidia’s EPS growth rate projection is very bullish for Nvidia. Any unexpected slowdown in AI would put a major dent in the PEG ratio. In a January article, Jagielski quotes OpenAI CEO Sam Altman from his appearance at the World Economic Forum in Switzerland. “It will change the world much less than we all think and it will change jobs much less than we all think,” Altman said. Investors are faced with a dilemma. Buy into the AI hype, and face crippling losses as NVDA stock returns to more historical levels below $400. Before June 2023, it had never traded above $400. The only way Nvidia will get to $10,000 by the end of 2025 is if the PEG ratio expands to a five-year average double where it is now. NVDA Stock Strikes Gold Twice No one understood that AI was a big deal until ChatGPT came out. Then, a light went on in most people’s heads that this technology was a game-changer. That was November 30, 2022. It’s been out there for 16 months. In February 2023, ChatGPT Plus launched for subscribers only. Everyone and their dog is trying to create the next great generative AI app or program. The University of Toronto’s Schwartz Reisman Institute for Technology and Society published a commentary on Jan. 31, 2023, called ChatGPT “a game changer for artificial intelligence.” “With more than one million users within the first five days of its launch, followed by news that Microsoft will invest US $10 billion in OpenAI in January 2023, ChatGPT is a transformative development in AI natural language processing,” the institute’s commentary stated. One area that will benefit from ChatGPT and AI is academia. Plenty of university students will use the technology to cheat their way through school. However, there is so much good from the technology. “Tech’s ability to revolutionize schools has been overhyped in the past, and it’s easy to get caught up in the excitement around ChatGPT’s transformative potential,” stated MIT Technology Review contributor Will Douglas Heaven in April 2023. “But this feels bigger: AI will be in the classroom one way or another. It’s vital that we get it right.” We don’t know what lies beyond the original generative AI chatbots like ChatGPT, Gemini, Copilot, Claude, Jasper, etc. That could be an even bigger revenue generator than current AI initiatives. Nvidia would surely benefit. The only caveat: It won’t happen soon enough to get NVDA stock to $10,000 by 2025. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.comPublishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @rajpalgore @palmernancy7 @gratitudefinancialllc @johndollery @jeavons_louise1 @tradinglearning @notfundamental @aliams_david_trading_gram @shirin_m_moghaddam @setupstrading @jeavons_louise1 @cypherfeed1 @michaelbamber @bradfairbridge @forex.alex @540wvn @mytradingsetup @l.m._investment Whatever the trade "
}