{
    "title": "The Globe and Mail",
    "date": "3/3/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/24504705/is-it-too-late-to-buy-nvidia-stock/",
    "text": "Shares of Nvidia(NASDAQ: NVDA) have soared big time since the beginning of 2023, clocking astronomic gains of 441% as the stock market has handsomely rewarded the company's outstanding top- and bottom-line growth, but that tremendous rally has made the stock extremely expensive. Nvidia stock is currently trading at 41 times sales, significantly higher than its five-year average sales multiple of 17.7. Meanwhile, the S&P 500 index has an average price-to-sales ratio of 2.7. Nvidia's price-to-earnings (P/E) ratio is also quite expensive at 97. The tech-heavy Nasdaq-100 index, of which Nvidia is a part, has an average P/E ratio of 34. These valuation multiples indicate that Nvidia isn't exactly a value pick right now. However, that's half the story, as a closer look at Nvidia's forward multiples and its potential growth prospects suggests something else. While Nvidia does seem expensive as far as its trailing multiples are concerned, the picture changes completely when it comes to the company's forward-looking multiples. The stock sports a forward P/E multiple of 33. That's almost in line with the Nasdaq-100 index's forward earnings multiple of 30, using the index as a proxy for tech stocks. Given Nvidia's leading position in the market for chips used for training artificial intelligence (AI) models -- the driving force behind the company's outstanding performance in the recently concluded fiscal year 2024 -- it is easy to see why its forward earnings multiple is substantially lower. The chipmaker's revenue jumped an impressive 126% in fiscal 2024 (which ended on Jan. 28) to almost $61 billion. Non-GAAP (generally accepted accounting principles) earnings shot up to $12.96 per share from $3.34 per share in the previous year, almost quadrupling in value. Worth noting is that Nvidia's growth in the final two quarters of fiscal 2024 was majestic. In Q3, for instance, its revenue was up 206% year over year to $18 billion. That was followed by a 265% year-over-year increase in revenue in the previous quarter to $22.1 billion. The chipmaker anticipates its revenue in the ongoing quarter to come in at $24 billion at the midpoint, which would be a 234% year-over-year increase. But that's not where the good part ends, as analysts are anticipating Nvidia's revenue to increase significantly in the new fiscal year, and beyond.  NVDA Revenue Estimates for Current Fiscal Year data by YCharts As the chart above indicates, Nvidia's revenue is expected to jump 2.5x in the next three fiscal years from fiscal 2024's reading. That's not surprising, considering the potential growth opportunity in the AI chip market and Nvidia's pole position in this space. Nvidia management pointed out on the latest earnings conference call that its data center revenue shot up a whopping 409% year over year to $18.4 billion and produced 83% of its total revenue thanks to robust demand for \"both training and inference of generative AI and large language models across a broad set of industries, use cases, and regions.\" The company also added that it is witnessing an improvement in the supply of its data center chips. But despite that, it sees demand for its next-generation AI chips to be stronger than supply. That's not surprising, as Nvidia reportedly controls more than 80% of the market for AI chips, and customers have been lining up to get their hands on its offerings for AI training and inference. More importantly, the company is focused on maintaining its leadership position in this lucrative market with its upcoming H200 AI graphics processing unit (GPU). Nvidia will start the initial shipments of this processor in the next quarter and claims that it is already witnessing solid demand for this product. With the AI chip market set to clock annual growth of almost 38% through the end of the decade, generating an annual revenue of $207 billion in 2030, Nvidia is all set to capitalize on this tremendous opportunity thanks to its aggressive product plan. As a result, it won't be surprising to see Nvidia's stock head higher in the future, especially considering the terrific earnings growth it is predicted to deliver. Nvidia delivered $12.96 per share in earnings in fiscal 2024. As the chart below tells us, analysts have significantly raised their earnings growth expectations.  NVDA EPS Estimates for Current Fiscal Year data by YCharts If Nvidia does hit $34.21 per share in earnings in fiscal 2027, as seen in the chart, and maintains its five-year average forward earnings multiple of 39.2 at that time, its stock price could increase to $1,341. That would be a 70% increase from current levels. Given that Nvidia is trading at a lower forward earnings multiple at present, investors are getting a good deal on this AI stock right now, which they should consider grabbing with both hands, as its red-hot rally seems here to stay. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}