{
    "title": "Better AI Stock: Nvidia vs. Super Micro Computer",
    "date": "3/10/2024",
    "url": "https://finance.yahoo.com/news/better-ai-stock-nvidia-vs-183000082.html?ref=mc.news",
    "text": "You're a very happy investor if you've owned Nvidia (NASDAQ: NVDA) or Super Micro Computer (NASDAQ: SMCI) over the past year. Since the start of 2023, Nvidia's stock is up 530%, while Supermicro's has risen an astounding 1,300%. In other words, if you invested $10,000 in each company on Jan. 1, 2023, you'd have nearly $205,000. But after that kind of performance, many investors may wonder if they can still invest in these two AI leaders without the risk of losing serious capital in just a few months. So, are either of these two stocks a buy right now? And if so, which is the better purchase? Nvidia makes best-in-class graphics processing units (GPUs) that are perfect for training AI models. GPUs can process intense calculations efficiently, making them the best tool for the job. When a client wants to build a supercomputer capable of training AI models, it doesn't order a handful of GPUs; it orders thousands. With Nvidia's flagship GPU, the H100, costing an estimated $30,000 a piece, that's a massive growth driver for Nvidia. However, you can't just connect these GPUs together with a few cables and call it a day. You need a specialized server that properly networks these devices and combines them in clusters to maximize efficiency. That's where Super Micro Computer comes in. While some tech giants may have this expertise in-house, many do not, so they contract Supermicro to build their servers. Supermicro has many different server designs based on the application and expected workload size, so customers of all varieties can find what they need. This highlights the first difference between these two investments: Nvidia is a company that nearly all AI-focused businesses work with, while only some work with Supermicro. This doesn't mean Supermicro is doomed to fail, but it is a risk factor investors should consider. Supermicro could be dethroned by a competitor undercutting pricing, while Nvidia might only be knocked off its pedestal by someone creating a more powerful GPU -- something competitors have been struggling to do for a long time. When examining each company's financials, Nvidia also starts to pull away. Both companies are growing rapidly, and their projections for the next quarter are also quite strong. In Q4 of FY 2024 (ending Jan. 28), Nvidia's revenue rose 265% year over year to $22.1 billion. It also gave guidance for Q1 revenue of $24 billion, indicating 234% growth. Supermicro also delivered strong results, with its Q2 FY 2024 (ending Dec. 31) revenue rising 103% to $3.67 billion. For its next quarter, Supermicro projects growth of 188% to 219%, placing it in the same realm as Nvidia. While Nvidia experienced the first wave of GPU demand, Supermicro's growth is just starting. However, the stock already responded with strong price appreciation because investors know what kind of growth to expect based on Nvidia's performance over the past year. As a result, Supermicro's stock is much more expensive than Nvidia's on a forward price-to-earnings (P/E) basis. Using a forward P/E ratio when a company is undergoing a massive change is wise, as it uses analyst projections to value it. There is still room for error (as no one has a crystal ball), but it gives investors an idea of what they're paying for. Because Nvidia is cheaper from this metric and has stronger growth and vital product positioning, I think it's a much better buy than Super Micro Computer. Should the strong AI demand persist for a few years, both stocks could be excellent picks, but Nvidia remains the king of AI investment opportunities right now. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 8, 2024 Keithen Drury has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool recommends Super Micro Computer. The Motley Fool has a disclosure policy. Better AI Stock: Nvidia vs. Super Micro Computer was originally published by The Motley Fool Related Quotes "
}