{
    "title": "Stocks end week at fresh records as Nvidia tops $2 tn",
    "date": "3/1/2024",
    "url": "https://www.bhpioneer.com/news/national_world_news/stocks-end-week-at-fresh-records-as-nvidia-tops-2-tn/article_3622391a-d4af-58f6-b17f-38cfccf71514.html",
    "text": "Cloudy skies with afternoon snow showers. High around 40F. Winds light and variable. Chance of snow 50%.. Rain and snow showers this evening transitioning to snow showers overnight. Low 29F. Winds light and variable. Chance of precip 50%. Snow accumulations less than one inch. Updated: March 30, 2024 @ 10:08 am          Wall Street stocks finished the week with a flourish Friday behind continued momentum for equities tied to artificial intelligence, especially Nvidia, which finished wih a valuation above $2 trillion for the first time. Both the S&P 500 and Nasdaq ended at fresh all-time highs following records in Tokyo and Frankfurt. Javascript is required for you to be able to read premium content. Please enable it in your browser settings. Originally published on doc.afp.com, part of the BLOX Digital Content Exchange.      Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Support Local Journalism Locally Owned and Operated Since 1876 Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Account processing issue - the email address may already exist We'll send breaking news and news alerts to you as they happen! A daily e-mail to let you know when the new e-edition has been posted. A weekly newsletter to let you know what's going on in the Hills currently. Each month's obituaries, delivered to your inbox. Get the latest headlines on local sports! Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}