{
    "title": "History Suggests the Nasdaq Will Surge in 2024: 2 Superb AI Stocks to Buy \nBefore It Does",
    "date": "1/28/2024",
    "url": "https://www.fool.com/investing/2024/01/28/2-superb-ai-stocks-as-history-suggests-2024-surge/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Investing in stocks can be tricky, as the market's past performance isn't always indicative of what's to come. However, knowledge is power, and noticing past trends and patterns can help ensure you're ready to strike if history decides to repeat itself. As a result, it can only help investors to know that history suggests the Nasdaq Composite could surge in 2024. Since the index launched in 1971, it has risen by an average of 19% in each year that followed a market recovery of the magnitude you saw in 2023. Consequently, it's not a bad idea to consider investing in the companies fueling the bulk of the Nasdaq Composite's growth. A boom in the artificial intelligence (AI) space last year was instrumental in driving the market's recovery and will likely continue to propel big gains in 2024. Nvidia (NVDA 0.12%) and Microsoft (MSFT -0.17%) are two attractive options for investors looking to profit from the rise of the AI industry. Even the most casual of investors is probably aware of Nvidia's meteoric rise last year. Its stock soared by 239% in 2023 as its graphics processing units (GPUs) became the gold standard for hardware for AI developers worldwide. These high-powered parallel-processing chips are crucial for training and powering AI models. As interest in AI skyrocketed, so did demand for GPUs, and Nvidia was positioned to supply hardware to a market where demand exceeded supply. The company achieved an estimated 90% market share in AI chips and its earnings soared even as rivals like Advanced Micro Devices and Intel scrambled to catch up on the technology front. In its fiscal 2024 third quarter, which ended Oct. 29, Nvidia's revenue rose 206% year over year while operating income soared by 1,600%. The spike in its AI GPU sales drove its data center revenue 279% higher. Competition in the AI chip space is expected to heat up this year, with AMD, Intel, and even Amazon bringing powerful new hardware to market. However, trends in the chip sector suggest Nvidia's dominance will be a tough nut to crack. Intel was the king of central processing units (CPUs) for years, with an 82% market share at the start of 2017. It was then that AMD began a serious push into that niche with the debut of its Ryzen line of CPUs. AMD has managed to draw a significant share of the market away from Intel since then. However, Intel still holds a market share above 60% in CPUs, with AMD's share at 35%. If that pattern is any indication of what's to come in AI, Nvidia could retain its leadership spot in GPUs for years. Nvidia's forward price-to-earnings ratio (P/E) of 49 makes it look like an expensive stock right now. However, its forward earnings-per-share (EPS) estimates illustrate why its stock remains a buy.  Data by YCharts. Nvidia's earnings could reach $24 per share by fiscal 2026. Multiplying that figure by the company's current forward P/E of 49 yields a stock price of $1,176, projecting stock growth of 96% over the next two fiscal years. Granted, it's a lofty target. Nvidia's stellar business growth may slow down in coming years, lowering the P/E-based price target in the process. However, it's based on reasonable financial forecasts. Nvidia's stock is a screaming buy in 2024 if you expect it to get anywhere near these growth targets. With a market capitalization of $2.9 trillion, Microsoft is the world's second-most valuable company and one of the biggest growth drivers in the Nasdaq Composite index. Thanks to potent products like Windows, Office, Azure, Xbox, and LinkedIn, the company has become a tech behemoth with the brand power and financial resources to succeed in almost any arena. Microsoft emerged as one of the biggest players in AI last year when it boosted its investment in ChatGPT developer OpenAI. Their partnership has granted Microsoft exclusive access to some of the most advanced AI models, which it has used to make upgrades across its product lineup. Over the past year, elements of ChatGPT have been integrated into Microsoft's search engine, Bing, a range of new AI tools have been added to its cloud platform Azure, and its various Office applications now offer improved productivity. Excitement over Microsoft's prospects in AI has helped propel its stock upward by 65% in the last 12 months, and it shows no signs of slowing.  Data by YCharts. As the chart above shows, Microsoft's earnings are forecast to reach $15 per share over the next two fiscal years. Using a calculation similar to the one we did for Nvidia and multiplying that EPS figure by Microsoft's current forward P/E of 35 yields a stock price of $525. Again, I'm looking at bullish growth projections here but Microsoft may very well meet these lofty goals. Based on its current position, projections indicate Microsoft's stock could soar by 33% in two years. Like Nvidia, Microsoft looks like a no-brainer buy this year and an attractive way to invest in AI. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}