{
    "title": "Optimism returns to semiconductor industry - analyst | NASDAQ:NVDA, ETR:NVD",
    "date": "1/10/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1038020/optimism-returns-to-semiconductor-industry-analyst-1038020.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence William kickstarted his career as a researcher and reporter for a global legal publication, covering everything from public law to M&A. Before moving to Proactive Investors, he worked as a reporter for a major fintech company with a focus on cryptocurrency and blockchain technology.\r\n\r\nHarking from Queensland, Australia, William obtained first-class honours in journalism and media from Birkbeck University before going on to complete an MA in creative and critical writing. Other jobs have... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 16:15 10 Jan 2024 GMT A sense of optimism has returned to the intensely cyclical semiconductor industry. Though 2023 was by no means a washout, particularly for artificial intelligence-focused chip makers like Nvidia Corporation (NASDAQ:NVDA), there has been no shortage of headwinds bearing down on the sector. Sectoral threats ranged from collapsing Chinese demand and US-imposed export controls to inventory build-up and poor smartphone and computer sales. Semiconductors are the underpinning of modern technology, making them highly exposed to downcycles in global technology demand. Fortunately, Taiwan Semiconductor Manufacturing Company (TSMC), which serves as a bellwether for the manufacturing side of semiconductors, has just expressed cautious optimism for a rebound in demand. The Taiwanese megacap, which is the largest global semiconductor manufacturer by a considerable margin, reported a fourth-quarter revenue beat driven by AI chip sales, particularly for cornerstone clients Apple Inc (NASDAQ:AAPL, ETR:APC) and Nvidia. Though annual revenues fell by 4.5% to NT$2.16 trillion in 2023, attributed to a surplus in consumer electronics and moderated capital expenditure, the company anticipates growth in 2024, driven by its high-performance computing segment and increasing demand for AI chips. Jefferies analysts added to the bullish semiconductor outlook in a Wednesday research note, suggesting that the semiconductor industry is expected to experience rapid growth through 2024 before peaking in the first half of 2025, with an anticipated 20% growth this year and mid-teen growth in 2025. According to analysts: “The cycle's sharp reacceleration has so far been driven by the re-normalisation of sales post the inventory correction in segments like PCs and smartphones, the rise in memory pricing, as well as strong AI demand.” This upcycle is predicted to elevate valuations, with a rebound in smartphone and Internet-of-Things device sales boding well for fabless chip designer Arm Holdings PLC (NASDAQ:ARM). Meanwhile, Dutch lithography machine manufacturer ASML is tipped for a rebound once wafer fabrication equipment sales start to rise again. 2024 will also be the year when major chip designers such as Nvidia, AMD, Qualcomm and Mediatek will begin seriously looking into two-nanometre wafer capacity, marking the next generation of cutting-edge chips. However, 2nm chips are not expected to be printed until 2025/26, presumably at the tail end of the next cyclical upswing. Sign up to receive alerts and news direct to your inbox Oriole Resources PLC (AIM:ORR) CEO Tim Livesey and chief financial officer Bob Smeeton join Proactive's Stephen Gunnion with details of the company's 2023 financial and operational performance.\r\n\r\nLivesey highlighted successful exploration programs in Cameroon, at the Bibemi and Mbe projects,... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}