{
    "title": "Ex-Nvidia Exec Raises $4.7 Million for Testing Tool That Can Fix AI System \nFlaws",
    "date": "1/23/2024",
    "url": "https://www.pymnts.com/news/investment-tracker/2024/ex-nvidia-exec-raises-4-million-dollars-testing-tool-that-can-fix-artifiical-intelligence-system-flaws/",
    "text": "RagaAI, a startup founded by tech veteran and former Nvidia executive Gaurav Agarwal, secured $4.7 million in seed funding to develop a tool that can automatically diagnose and fix flaws in artificial intelligence systems. “Today, we’re publicly introducing RagaAI’s breakthrough foundation models called RagaAI DNA designed specifically for AI testing,” the company said in a Tuesday (Jan. 23) announcement. “Powered by RagaAI DNA, RagaAI is the most comprehensive AI testing platform that offers 300+ tests to automatically detect issues, diagnose and fix them instantly.” The money will be used for research and hiring staff, Bloomberg reported Tuesday. Agarwal began his career at Texas Instruments and worked at computer behemoth Nvidia and mobility startup Ola. He founded RagaAI in January 2022. The company aims to use AI testing to close the gap between technology advancements and commercial results. RagaAI relies on foundation models to identify and fix issues like hallucinations, per Bloomberg. In applications such as autonomous vehicles and healthcare where AI systems producing incorrect or distorted outputs can lead to serious consequences, RagaAI aims to play a role. Another aspect that RagaAI wants to address is the failure of AI systems to consider real-time information, the report said. RagaAI plans to diagnose and fix this flaw to enhance the responsiveness and accuracy of AI systems. Agarwal highlighted in a Tuesday press release the consequences of AI failures resulting from a lack of comprehensive testing, an issue he said he observed during his tenure at Ola and Nvidia. It’s a problem that RagaAI is actively addressing and solving for large Fortune 500 companies today. “Our vision is to liberate AI from the constraints of human interventions and foster continuous improvement,” Agarwal said in the release, adding that the startup is “committed to pushing the boundaries of automated AI issue detection, automated root cause analysis, and fixing the issues, [while] staying at the forefront of cutting-edge methods.” RagaAI’s focus on automatically testing and fixing AI systems aligns with the growing demand for safer and more reliable AI. Last month, the U.S. Department of Commerce’s National Institute of Standards and Technology (NIST) took an initial step toward establishing standards for the safe deployment of AI, including measures around testing and safeguarding even the newest systems. For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}