{
    "title": null,
    "date": "1/27/2024",
    "url": "https://finance.yahoo.com/news/where-nvidias-soaring-stock-10-085500712.html",
    "text": "Nvidia's (NASDAQ: NVDA) growth thesis hinges on generative artificial intelligence (AI) -- a tech megatrend sending demand for its advanced hardware through the roof. And according to analyst projections, this booming market has plenty of room left to run. That said, the company could find even more synergistic growth drivers over the long term. Let's dig deeper into what the next 10 years could hold. When Nvidia was founded in 1993, it would have been hard to imagine that the hardware it was pioneering, the graphics processing unit (GPU), would have such a transformative effect on the technology landscape. Originally designed to render video-game visuals, GPUs work through parallel processing, which involves computing multiple tasks simultaneously. This functionality made them extremely useful for new uses like cryptocurrency mining and training the large language models (LLM) behind generative AI applications. For Nvidia, these trends have transformed its operations. As of the third quarter, data center chip sales (such as the AI-capable H100) make up 80% of revenue, while its previously core gaming business has fallen to just under 16%. With industry experts expecting the market for AI chips to rise to $400 billion by 2027, Nvidia has plenty of room for near-term growth by selling its hardware. But the company will almost certainly face rising competition, which could eventually erode its market share and margins. To keep delivering market-beating growth, Nvidia may have to reinvent itself once again -- and management looks capable of pulling it off. The tech industry has several hardware companies that transitioned to more software-dependent business models to protect their economic moats and stabilize revenue streams. One of the best examples is Apple, which used sales of its industry-leading iPhones to drive iOS and app store adoption. According to analysts at Melius Research, Nvidia could be on the cusp of a similar move as it pivots to software and services. Nvidia has long relied on custom software to help data center clients make the most of their GPU-based systems. But over time, this business could become a core growth driver in its own right. Nvidia has launched a new AI supercomputer called DGX Cloud, which uses cutting-edge hardware to allow enterprise clients to build and deploy customized AI models without having to create their own data center infrastructure. Naturally, this move will bring the chipmaker into competition with traditional cloud service providers like Amazon AWS and Alphabet's Google Cloud. However, Nvidia's technical lead designing the GPUs that run these platforms gives it a competitive edge to rapidly scale this new growth driver. With a market cap around $1.50 trillion, Nvidia is already the sixth most valuable company in the world. And it probably isn't a coincidence that three of the companies above it (Apple, Microsoft, and Amazon) attained their position by transitioning away from only physical products into software. Over the next 10 years, Nvidia has significant growth potential, and I wouldn't be surprised if it eventually overtakes some of its large rivals. While shares have already risen 211% over the last 12 months, the company still boasts a reasonable price-to-earnings (P/E) multiple of 30, which is in line with the NASDAQ 100 average. That means it isn't too late for investors to bet on Nvidia's long-term success. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 22, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Where Will Nvidia's Soaring Stock Be in 10 Years? was originally published by The Motley Fool Related Quotes "
}