{
    "title": null,
    "date": "1/22/2024",
    "url": "https://www.ccn.com/analysis/nvidia-record-amd-alternative/",
    "text": "Nvidia stock reached a new record-high. Investors are seeking an alternative. Key Takeaways Nvidia continues to capture Wall Street’s attention amid the artificial intelligence (AI) boom. The stock jumped by 216% in one year, reaching a new historical record of $582.69 per share, with a market capitalization of $1380 billion as of January 19, thanks to strongly growing profits. Interest in AI has caused a spike in demand for graphics processing units (GPUs), with Nvidia best positioned to supply its hardware to the entire market. But now, with new highs hit, investors are looking to an alternative, in case NVDA stock  has reached its peak. The semiconductor industry continues to be a hotbed of growth, with Nvidia leading the charge in the past year. While the recent surge in Nvidia’s stock price has raised concerns about its valuation, analysts at Motley Fool  believe there’s still ample room for expansion. Investors are actively seeking the next big player in the semiconductor space, envisioning a company that combines robust infrastructure with the ability to meet the escalating demand for chips while delivering substantial returns. The advent of OpenAI’s ChatGPT in November 2022 sparked a renewed fascination with the possibilities of AI. It ignited excitement across various industries such as healthcare, consumer products, education, manufacturing, and autonomous vehicles. Consider investing in alternative Artificial Intelligence (AI) stocks instead of Nvidia. This analysis is presented by The Motley Fool. https://t.co/1v0ZAnJlJm — 0x4411 (@0xtyr473) January 19, 2024  Nvidia’s dominance in the chip market has underscored the critical role these components play in the era of AI. However, it has also exposed the lagging positions of other chip manufacturers in the realm of artificial intelligence. Motley Fool analysts suggest that Advanced Micro Devices (AMD) emerges as a compelling alternative to Nvidia. AMD boasts a strong foothold in multiple sectors and has consistently held the second-largest market share in desktop GPUs for an extended period. The company is gearing up to launch a new AI GPU this year, positioning itself to compete directly with Nvidia. While Motley Fool acknowledges AMD’s strengths, they caution that unseating Nvidia may prove challenging. As the semiconductor landscape evolves, investors and industry observers are closely watching the interplay between Nvidia and AMD, eagerly anticipating the next chapter in the AI-driven future of technology. Analysts at Motley Fool argue that, if it can replicate even half of Nvidia‘s stellar growth in 2023, AMD stands poised as a potentially lucrative investment. However, they caution that AMD is still in the nascent stages of its foray into AI. This channels a significant portion of its profits into strategic investments. This strategy, while geared towards future growth, has implications for the current valuation of AMD’s stock. Motley Fool analysts point to valuation metrics such as the price/earnings ratio (P/E) and the price-free cash flow ratio to underscore the divergence between AMD and Nvidia. According to these metrics, AMD’s stock appears notably more expensive than Nvidia‘s. $AMD  is up over $160 in after hours now less than $5 off of all time highs pic.twitter.com/ox6KCqS5lh — Evan (@StockMKTNewz) January 16, 2024  The P/E ratio and price-free cash flow ratio are vital indicators that assess a company’s financial health. Lower values are generally deemed more favorable. In the past year, AMD has seen a 47% decrease in its free cash flow, currently standing at $1 billion. In contrast, Nvidia has experienced a remarkable 360% increase, bringing its free cash flow to over $17 billion. The profitability disparity between the two companies is reflected in AMD’s overall financial performance. This contributed to a decline in its stock value. Motley Fool suggests that potential investors may find it prudent to await a more favorable entry point, allowing AMD’s stock to reach a more attractive valuation before considering investment. Furthermore, estimates show that Nvidia’s earnings per share could reach $24 in the next two years. While AMD’s could reach $5 per share. Multiplying these data by the P/E of the two companies (45 for Nvidia and 38 for AMD) gives prices for the two shares of 1,080 for Nvidia and $190 for AMD. The latter trades now  at $166.8. Nvidia $NVDA  is having a very strong start to the year 👀 – Bloomberg pic.twitter.com/5KmzB8TlnZ — Evan (@StockMKTNewz) January 14, 2024  Motley Fool analysts added: “If the forecasts prove correct, Nvidia’s stock could jump by another 97% in the next two years and that of AMD by 30%. “AMD has the infrastructure and experience to one day reach a position similar to that of Nvidia in AI. However, the expensive price of the stock makes it too risky for now with Nvidia still the most attractive investment.” Please note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment. "
}