{
    "title": "History Says the Nasdaq Will Soar in 2024: 1 Superb Stock-Split Stock to \nBuy Before It Does",
    "date": "1/6/2024",
    "url": "https://www.fool.com/investing/2024/01/06/history-says-the-nasdaq-will-soar-in-2024-1-superb/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More What a difference a year makes. After the Nasdaq Composite shed 33% of its value in 2022 -- one of the worst market performances in over a decade -- the index has nearly returned to its former glory, closing the door on 2023 with a gain of 43%. History offers a hint about what could be ahead in the coming year. Since it first began trading in 1972, in every year that followed a bear-market rebound, the tech-heavy index has continued to rally, gaining 19% on average. While there are no guarantees in investing, this suggests the current recovery has more room to run. One strategy investors use to find winning stocks is to look at companies that have conducted stock splits in recent years, as those moves are historically preceded by years of robust gains. One such company is Nvidia (NVDA 0.12%). Over the past decade, the stock has generated total returns of 12,780%, resulting in a 4-for-1 stock split in mid-2021. The chipmaker logged gains of 239% last year, which has some investors concerned about its valuation. However, a little digging will unearth evidence that the stock is cheaper than it might by some measures appear. Image source: Getty Images. Recent advances in the field of artificial intelligence (AI) have been a boon for Nvidia. More specifically, generative AI went viral last year, and these algorithms have been applied to a wide variety of mundane, time-consuming tasks, resulting in greater productivity. Increased efficiency generally results in greater profits, and businesses have been scrambling to integrate AI models into their operations to benefit from the expected windfalls. So why does this matter to Nvidia? In short, the company produces the gold standard of graphics processing units (GPUs), which can not only provide the computing power necessary to render lifelike images in video games but can also supply the computational horsepower necessary to support AI systems. This is all possible because of parallel processing, which takes computationally intensive jobs and breaks them down into smaller, more manageable chunks, allowing GPUs to conduct a multitude of complex mathematical calculations simultaneously. As a result, Nvidia processors have been deployed in a wide range of applications, including cloud computing and data centers, which will act as hubs for many AI systems. The accelerating adoption of AI will play to Nvidia's strengths, and while estimates vary greatly, there is general agreement that the opportunity is staggering. According to a report by Bloomberg Intelligence, the generative AI market will grow from $40 billion in 2022 to $1.3 trillion by 2032, a compound annual growth rate (CAGR) of 42%. A quick look at Nvidia's recent results helps illustrate the potential wrought by AI. In its fiscal 2024 third quarter (which ended Oct. 29), Nvidia's revenue grew 206% year over year to $18.1 billion -- a company record -- while its diluted earnings per share (EPS) soared 1,274% to $3.71. Those percentages were partially skewed by easy comps resulting from 2022's tech sector slowdown, but help illustrate the magnitude of the opportunity. Investors shouldn't expect the company's triple- and quadruple-digit gains to continue over the long term, but its ongoing growth should be robust nonetheless. For its fiscal fourth quarter, now underway, management is forecasting more record results, including revenue of $20 billion at the midpoint of its guidance range, which would be an increase of 230% year over year. This shows that the AI opportunity is far from over. There's more good news. Nvidia is the undisputed market leader for chips used for machine learning -- an established branch of AI -- controlling an estimated 95% of the market, according to New Street Research. As the default provider of processing solutions for AI, Nvidia is well positioned to ride this secular tailwind higher. While the prospects of AI are intriguing, Nvidia has several other growth drivers up its sleeve. For example, the recent slump in the gaming market is beginning to turn. The global graphics card market for gaming is expected to grow from $3.65 billion in 2024 to $15.7 billion by 2029, a CAGR of 34%, according to market research firm Mordor Intelligence. As the leading provider of gaming GPUs, this secular tailwind will boost Nvidia as well. Nvidia is also the leading provider of processors used to zip data through the ether and around data centers, with an estimated 95% of that market, according to CFRA Research analyst Angelo Zino. The digital transformation shows no signs of slowing as companies shift even more workloads and business systems to the cloud, so the data center boom will likely continue. The data center market is expected to grow from $263 billion in 2022 to $603 billion by 2030, a CAGR of roughly 11%, according to Prescient and Strategic Intelligence Market Research. This all shows that Nvidia's chips are so much more than just the gold standard for AI -- its products are also the semiconductors of choice for the gaming, cloud computing, and data center markets. After Nvidia shares notched gains of more than 200% in 2023, investors are naturally uneasy about its valuation -- but there's a catch. The stock is currently selling for 27 times sales and 65 times earnings -- lofty metrics that would seem to validate investor concerns. However, those measurements don't factor in Nvidia's triple-digit percentage growth rate. For a company expanding this rapidly, the more appropriate metric to use is the price/earnings-to-growth (PEG) ratio, which for Nvidia is less than 1 -- the standard for an underpriced stock. For the S&P 500, the PEG ratio is more than 2, which further puts Nvidia's valuation into the proper context. Given its dominant position in numerous growth markets, its strong history of growth, and its reasonable valuation, Nvidia is one stock-split stock investors should buy ahead of an expected Nasdaq surge in 2024. Danny Vena has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}