{
    "title": "Why This 1 Momentum Stock Could Be a Great Addition to Your Portfolio",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/why-1-momentum-stock-could-145008135.html",
    "text": "For new and old investors, taking full advantage of the stock market and investing with confidence are common goals. Many investors also have a go-to methodology that helps guide their buy and sell decisions. One way to find winning stocks based on your preferred way of investing is to use the Zacks Style Scores, which are indicators that rate stocks based on three widely-followed investing types: value, growth, and momentum. Is This 1 Momentum Stock a Screaming Buy Right Now? For momentum investors, upward or downward trends in a stock's price or earnings outlook take precedent, so they'll want to zero in on the Momentum Style Score. This Score can pinpoint good times to build a position in a stock, using factors like one-week price change and the monthly percentage change in earnings estimates. Nvidia (NVDA) NVIDIA Corporation is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit, or GPU. Over the years, the company’s focus has evolved from PC graphics to artificial intelligence (AI) based solutions that now support high performance computing (HPC), gaming and virtual reality (VR) platforms. NVDA is a Zacks Rank #2 (Buy) stock, with a Momentum Style Score of B and VGM Score of B. Shares are up 14.3% over the past one week and up 13% over the past four weeks. NVDA has gained 239.7% in the last one-year period as well. Looking at trading volume, an average of 36,078,476 shares exchanged hands over the last 20 trading days. Momentum investors also pay close attention to a company's earnings. For NVDA, 15 analysts revised their earnings estimate upwards in the last 60 days, and the Zacks Consensus Estimate has increased $1.48 to $12.31 per share for 2024. NVDA boasts an average earnings surprise of 19%. NVDA should be on investors' short list because of its impressive earnings fundamentals, a good Zacks Rank, and strong Momentum and VGM Style Scores. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}