{
    "title": "NVDA Stock: Next Stop $750 Per Share?",
    "date": "1/19/2024",
    "url": "https://investorplace.com/market360/2024/01/nvda-stock-next-stop-750-per-share/",
    "text": " While not for certain here's how it could happen Advertisement Source: Evolf / Shutterstock.com Until recently, it seemed as though $500 was the ceiling for Nvidia (NASDAQ:NVDA) stock. NVDA stock has recently surpassed this price level. You may wonder if shares will reach a new price milestone. I’m not talking about merely climbing to $600 per share (or just 5.3% above current price levels). I’m talking about hitting $750 per share. That would be quite a leap compared to where shares change hands today. Now, I’m not saying that it’s a lock that NVDA will soon hit this price point, but it is within the realm of possibility that Nvidia climbs more than 30% higher between now and year’s end, and here’s how it could happen. While Nvidia has been trending up lately, some may be concerned that many of the negatives that weighed on shares in the latter months of 2023 will make an unexpected return. For instance, concerns related to the company’s Chinese sales, following the U.S. Government’s crackdown on AI chip exports. Or the potential impact of increased competition. As you likely have heard, Advanced Micro Devices (NASDAQ:AMD), Nvidia’s key competitor, is quickly making up for lost time with the launch of new AI chip products. There have also previously been concerns about Nvidia’s valuation. Fortunately, it is very debatable whether these negatives will soon again weigh on the NVDA stock price. As I argued earlier this month, Nvidia has not only mitigated the potential impact of the export bans. Competition from the likes of chip companies like AMD isn’t likely to affect the company’s ability to meet or surpass growth expectations. Speaking of growth, and tying it into valuation, I’ve pointed out many times before that NVDA is more-than reasonably priced. Even today, as shares trade for around 45.8 times earnings, subsequent growth could help to sustain this valuation, making reaching considerably higher price levels well within reach. What can be calculated on the back of an envelope doesn’t always translate into reality when it comes to stocks. That’s the risk in trying to identify a path for NVDA stock to hit $750 per share between now and December. Even as sell-side forecasts call for Nvidia to generate $20 per share in earnings this fiscal year (ending January 2025), and all NVDA would need to do (assuming results meet this target) is sustain a price-to-earnings ratio of 37.5, investing, much like life, doesn’t play out neatly. Still, it’s not far-fetched to see NVDA hit $20 per share in earnings, given both current AI chip demand trend, plus macro factors like cooling inflation and interest rate cuts that may help spark a further demand rebound for Nvidia’s non-AI business (i.e. its sale of chips to end users in the gaming and PC markets). As for sustaining at least a high-30s multiple, beyond lower interest rates helping to support this, the prospect of continued elevated levels of growth will help as well. Don’t expect earnings to keep growing by 50%-100% in perpetuity, but a moderately high level of earnings growth is more-than-achievable. Again, unforeseen changes can occur, leading to a far less stellar outcome for NVDA between now and the end of the calendar year. However, not only is there a viable path to $750 per share within the year, a move to $1000 per share may be in reach far sooner than you think. Even if AI chip growth slows down, as Bank of America’s Vivek Arya pointed out earlier this month, Nvidia could use some of its windfall from this trend to finance a big move into areas like AI software. Such a move could drive continued high earnings growth, and lead to an expansion of NVDA’s forward multiple. With the bull case for NVDA stock stronger than ever, forget about skipping or cashing out now. This AI chip winner is still a solid buy. NVDA stock earns an A rating in Portfolio Grader. On the date of publication, Louis Navellier had a long position in NVDA. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Artificial Intelligence, Semiconductor, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/nvda-stock-next-stop-750-per-share/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Hot Stocks Stocks to Buy Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}