{
    "title": "Nvidia's SoundHound investment could be the start of something much bigger",
    "date": "2/17/2024",
    "url": "https://seekingalpha.com/news/4067665-nvidias-soundhound-investment-could-be-the-start-of-something-much-bigger",
    "text": "da-kuk Nvidia's (NASDAQ:NVDA) announcement that it had made strategic investments into several artificial intelligence-linked companies — including voice AI recognition firm SoundHound AI (NASDAQ:SOUN) — could wind up being just the start for the semiconductor giant, Wedbush Securities said. \"We view this as a positive indicator for the company as this investment now further solidifies the company's brand within the AI Revolution with the Godfather of AI Jensen [Huang] and NVDA now backing SOUN and we believe this could be the start of a broader investment into the company down the line which is a clear tailwind,\" analysts led by Dan Ives wrote in an investor note. The firm has an Outperform rating and $5 price target on SoundHound. (Nvidia also disclosed investments in Arm Holdings (ARM), Chinese self-driving truckmaker TuSimple (TSPH), biotech company Recursion Pharmaceuticals (RXRX) and medical imaging developer Nano-X Imaging (NNOX)). Nvidia first invested in SoundHound in 2017 when it participated in a $75M funding round to help it grow internationally. Since then, it has acquired roughly 1.73M shares worth $3.67M, a pittance to a company worth roughly $1.8 trillion. However, with AI increasingly playing a role in every facet of society, Nvidia is putting its money where its mouth is and helping usher in the era of AI, particularly in areas that consumers interact with everyday. SoundHound's Pillar 1 performance includes autos, televisions and devices connected to the internet, including partnerships with Stellantis (STLA) in Europe and Hyundai in the U.S. It also offers AI voice customer solutions, with retailers like Jersey Mike's and Krispy Kreme integrating the offerings into their stores. And now with Nvidia firmly behind the Santa Clara, Calif-based company, SoundHound is believed to be in a \"strong position\" to go after the AI chatbot market this year and beyond as more use cases come to fruition, Ives said. "
}