{
    "title": "Before the Bell: Nvidia reaches $US2 trillion mark, S&P 500 tops 5100",
    "date": "2/24/2024",
    "url": "https://www.afr.com/markets/equity-markets/nvidia-reaches-us2-trillion-mark-s-and-p-500-tops-5100-20240217-p5f5p8",
    "text": "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Wall Street’s rally paused after Nvidia topped the $US2 trillion market cap mark and the S&P 500 rose above 5100 points. Shares opened higher, then reversed. They were mixed with about half hour left in the session. At the close in New York, the S&P 500 was 0.03 per cent higher to 5088.80. After initially rising as high as 5111.06, the index fluctuated. The Dow edged higher, the Nasdaq Composite slipped. Quincy Krosby, chief global strategist for LPL Financial, said while Nvidia delivered on every level “markets being markets will want – and need – more”. As for Nvidia, it surged as high as $US823. 94 within minutes of opening, before it too reversed direction, finishing with a modest 0.4 per cent rise to $US788.17, giving it a market valuation of $US1.97 trillion. Tom Essaye, author of Sevens Report, said the relentless rally has entered a new phase. “A new justification for this market is becoming necessary if we look at valuation, sentiment and what’s priced in. “Starting with valuation, the S&P 500 is now trading at 21X 2024 S&P 500 earnings per share of $US243/share. A 21X multiple isn’t just high, it’s largely unheard of unless there’s ongoing Quantitative Easing [central banks buying assets] and 0 per cent rates.“ Essaye said the message from sentiment indicators is clear: “Investors are extremely bullish about the outlook and not overly concerned about risks.” Meantime, economists continue to pare back expectations that the US is heading towards a recession. A monthly survey by Bloomberg found that economists now see a 40 per cent chance of recession in the next year - the lowest reading since mid-2022. Economists led by Jan Hatzius at Goldman Sachs said they are pushing back their expectation for the first interest rate cut by the Federal Reserve to June, from May. In addition, Goldman has pared its forecast for five rates in 2024 to four – June, July, September, and December. However, it lifted to four, from three previously, more cuts in 2025, to the same terminal rate of 3.25-3.5 per cent. Hatzius said: “We continue to see the January inflation data as an outlier and expect core PCE inflation to fall to 2.5 per cent year-on-year by the May meeting and 2.2 per cent by the June meeting.” The latest core PCE data will be released next week. Capital Economics also pushed its forecast for the first cut this calendar year to June. It still forecasts 100 basis point cuts in 2024 and another 100 basis point cuts in 2025 to reach the same terminal rate as Goldman. CE’s Paul Ashworth said: “We remain confident that inflation will return to the 2 per cent target on a sustained basis. If we’re also right that GDP growth will dip below 2 per cent in q4/q4 terms this year, then the Fed should still shift policy from a restrictive stance back to nearer neutral next year.” ASX futures up 4 points or 0.1% to 7605 near 8am AEDT Nvidia extended its rally though it failed to hold above the $US2 trillion mark for long. There’s a raft of views on how investors should interpret Nvidia’s move and how to position. Fundstrat Global’s Tom Lee: “The biggest takeaway of stocks surging on the heels of strong Nvidia quarterly results signifies (to me) there is substantial ‘dry powder’ on the sidelines.” One of the key signs for an interim top, Lee said in a note, would be for equities to fall on good news and “that is not the case currently”. Lee argues that of the three general signs of a near-term top, none are in place: buying power exhausted - NYSE margin debt still low; stocks “fall on good news” - not the case yet; and, market technicals breakdown - S&P 500 bounced off 20-day moving average. Still, Lee said in conversations with investors, “we found many recently cautious. Citing both the higher inflation readings, and their generalised belief that the equity gains are so concentrated, that this was a sign of some sort of unhealthy market. In addition, there were some stocks down on big EPS or guidance misses. But as we note above, this negative sentiment is not a sign of a top”. Matt Maley, chief market strategist at Miller Tabak + Co, said the significant valuation divergence between Nvidia and other AI-related stocks has become more pronounced. “One of the most astonishing aspects of Nvidia’s advance is that the stock has rallied 156 per cent since the day before its earnings report since last May (which is when the euphoria surrounding the AI phenomenon really took off) and yet its forward P/E ratio has dropped from 53x to 33x earnings. “This shows that there is an excellent fundamental backing to the great rally for this particular stock. However, this is not particularly true for some of the other AI names. Since last May’s big blowout report from Nvidia, Palantir’s forward P/E has climbed from below 50x to more than 70x. For Advanced Micro Devices, it has jumped from 27x to 50x their forward estimate and for Microsoft, it has moved from 28.5x to 35.5x.” Maley said Nvidia “will very likely give you more upside performance if the group continues to rally but it will also give you more protection in a decline. “Usually, the best performer in a strong rally for a sector on the way up is also the worst performer on the way down. Given its valuation, this should not be the case for Nvidia, at least for the foreseeable future.” Companies expected to report results on Monday: Adairs | Dalrymple Bay Infrastructure | Endeavour Group | Liberty Financial | NIB Holdings | Praemium | Suncorp | TPG Telecom Wednesday is set as the most important day of the week with January CPI on the schedule and a policy meeting at the Reserve Bank of New Zealand. eToro’s Josh Gilbert on price pressures: “Expectations are for inflation to rise 3.5 per cent year-over-year, stalling slightly from January’s 3.4 per cent and snapping a streak of continuous easing. Market pricing has shifted in recent weeks, but June is still the first meeting where the expectation is a cut. The good news for the RBA is that data is most likely coming in as expected, leaving the potential for three cuts on the table in 2024.” TD Securities on the RNBZ: “It’s a close call for the RBNZ but we expect the Bank to hike by 25 basis points given the RBNZ’s household inflation expectations survey. A big jump in five-year inflation expectations will certainly raise eyebrows at the RBNZ and cast credibility on the Bank if they don’t take action. We also expect the Bank to signal a subsequent hike, pinning the terminal rate at 6 per cent for this hiking cycle.” On Thursday, Australia will release retail sales data. Here’s NAB’s view: “We expect a strong rebound in retail sales for January as the shifting seasonality that weighed in December unwinds. That is also what we saw across our seasonally adjusted transactions data. We pencil in 1.8 per cent month-over-month (consensus 1.5 per cent).” High tax rates fuelling avoidance schemes High personal tax rates are spurring the use of trusts, companies, SMSFs and negatively geared property to minimise tax, accountants and tax practitioners say. Six years in a leaky boat: the plan to fix an ailing navy Defence is betting that smaller ‘drone’ ships and plenty of missiles will be enough in a fast-changing world of remote-controlled warfare. ‘Scandalous’: free-to-air networks lash TV makers for demanding a cut Whether TV network apps appear on new TVs is an “existential” threat to broadcasters, CEOs told senators. Tech giants are demanding to clip the ticket. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}