{
    "title": "Billionaire Investor Stanley Druckenmiller's Firm Dumps Alphabet, Amazon, \nBoosts Investments In AI Leader",
    "date": "2/16/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37175336/billionaire-investor-stanley-druckenmillers-firm-dumps-alphabet-amazon-boosts-investments-in-ai-",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Stanley Druckenmiller‘s Duquesne Family Office has made significant changes to its portfolio, as per recent Security and Exchange Commission (SEC) filings. The firm has divested its holdings in Alphabet Inc GOOGL GOOG and Amazon.com Inc AMZN last quarter while increasing its stakes in Microsoft Corp MSFT and NVIDIA Corp NVDA. What Happened: The billionaire investor’s firm, Duquesne Family Office, increased its Microsoft stake by 6.7% in the last quarter, making it the firm’s top holding. The firm also reduced its exposure to Nvidia by 29% but acquired call options for the chipmaker worth over $242 million in notional value. Druckenmiller’s continued bullishness on AI stocks is evident. Last June, he announced plans to hold Nvidia for two years, despite growing concerns about overvaluation. Eight months later, the company’s stock has surged by nearly 90%, propelling it past Amazon and Alphabet to become the third most valuable company in the U.S. The firm’s focus on Microsoft and Nvidia has been in the works for over a year, with Duquesne investing a combined $430 million in both companies in early 2023. The optimism surrounding Microsoft is also fueled by its AI initiatives, with the technology being integrated into its cloud and software services. The company’s recent earnings report exceeded expectations, leading to an over 8% increase in its shares this year. See Also: Nvidia, AMD Stocks Slip Premarket Despite Price Target Boosts: What’s Going On? “AI is very, very real and could be every bit as impactful as the internet,” Druckenmiller previously said at the 2023 Sohn Investment Conference, according to the report. Why It Matters: The shift in Druckenmiller’s portfolio comes at a time when the AI industry is experiencing a significant boom. Nvidia’s stock has been on a meteoric rise, recently surpassing Amazon and Alphabet to become the fourth most valuable company in the U.S. This surge has been attributed to the increasing importance of Nvidia’s products in driving the growth of the AI industry. Meanwhile, Microsoft’s strong performance is also linked to its AI initiatives. The company’s consistent growth in this sector has been a key factor in its recent success, building on Microsoft’s solid reacceleration story in 2024. However, some experts have raised concerns about the sustainability of this AI-driven market surge. Josh Brown of Ritholtz Wealth Management suggested that the market may have reached its peak for the year, with Nvidia’s stock becoming an “algorithm casino freak show.” Additionally, the recent sale of Nvidia shares by Cathie Wood‘s Ark Invest amid discussions about Nvidia’s valuation and potential in the AI sector further adds to the uncertainty surrounding the sustainability of this market trend. Read Next: ‘Dogecoin Killer’ Shiba Inu Burn Rate Skyrockets Over 1800% As 27M SHIB Tokens Permanently Destroyed In A Single Day Image Via Shutterstock Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}