{
    "title": "Options Traders Bet On Big Move In Nvidia Stock After Earnings",
    "date": "2/19/2024",
    "url": "https://www.baystreet.ca/stockstowatch/17187/Options-Traders-Bet-On-Big-Move-In-Nvidia-Stock-After-Earnings",
    "text": " Options traders in the U.S. are betting on a big move in Nvidia's (NVDA) stock after the microchip and semiconductor company delivers its latest earnings report on Feb. 21. Nvidia’s share price is already up 50% this year and trading at $726.13 U.S. per share. That brings the stock’s 12-month gain to 252%. Options trading activity indicates that Nvidia’s shares could move a further 11% up or down following its quarterly results in coming days, according to data from options analytics service ORATS. Nvidia’s stock has moved an average of 6.7% after its earnings reports over the past three years, ORATS data shows. At the same time, analysts are warning that Nvidia’s earnings could prove to be a make-or-break moment for the U.S. stock market. Forecasts are calling for earnings per share (EPS) of $4.59 U.S. from Nvidia, a more than 700% increase from the same quarter last year. In a note to clients, Deutsche Bank (DB) said: “It’s a reflection of the world we live in that the most important event of the week may be Nvidia’s earnings… It is now the 4th largest company in the world and the best performer in the S&P 500 so far this year, so this will be very important for sentiment.” Nvidia's market capitalization now stands at $1.8 trillion U.S., greater than that of both Amazon (AMZN) and Google-parent company Alphabet (GOOG / GOOGL). On Feb. 15, more than 750,000 Nvidia options changed hands, making it the second most actively traded stock in the U.S. options market.  Copyright 1998 - 2024 Baystreet.ca Media Corp. All rights reserved. Nasdaq Stocks: Information delayed 15 minutes. Non-Nasdaq Stocks: Information delayed 20 minutes. Bid and Ask quotation information for NYSE and AMEX securities is only available on a real time basis. Market Data is provided by QuoteMedia.com. Earnings by Zacks. Analyst Ratings by Zacks "
}