{
    "title": "Where Will Nvidia's Soaring Stock Be in 5 Years?",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/news/where-nvidias-soaring-stock-5-121700205.html",
    "text": "With a market cap of $1.69 trillion, Nvidia (NASDAQ: NVDA) has already soared 34% so far in 2024 as optimism continues to swirl around its artificial intelligence (AI) chip business, which is expected to boost near-term growth and margins. But Nvidia's long-term story looks just as bright. Let's discuss the strategies this technology giant can use to maintain its momentum over the next five years and beyond. Over the last two years, one product type has powered most of Nvidia's growth: AI-capable graphics processing units (GPUs) like the a100 and h100, which help train and run generative AI applications like ChatGPT. Nvidia records sales of these chips under its data center segment, which expanded by an eye-watering 279% year over year to $14.51 billion in the third quarter. However, the company could soon play a bigger role in the software side of the fast-growing AI industry. According to analysts at IT analytics and investment firm Melius Research, Nvidia could be on the cusp of an \"Apple-like transformation\" as it uses its hardware business as a springboard to expand into software, much like the iconic smartphone maker used its iPhone to drive adoption of iOS and the app store. Nvidia has developed a supercomputer called DGX Cloud designed to give enterprise clients access to the infrastructure needed to train and run their AI applications on the cloud without the hassle of building their own on-premises system. While this move could bring the company into direct competition with cloud service providers, Nvidia's industry-leading hardware business could create synergies with its software and services. CEO Jensen Huang waxed poetic about the DGX Cloud service's long-term prospects at the launch in March, 2023. \"We are at the iPhone moment of AI. Startups are racing to build disruptive products and business models, and incumbents are looking to respond,\" Huang said in a written statement. \"DGX Cloud gives customers instant access to NVIDIA AI supercomputing in global-scale clouds.\" Nvidia's biggest customers are American tech giants like Meta Platforms, Microsoft, and Alphabet, which typically use its hardware to develop large language models and enterprise services for their cloud computing divisions. But while these companies can buy huge amounts of expensive hardware, they are also developing their own AI chips for internal use to reduce their reliance on third-party suppliers like Nvidia. The good news is that Nvidia is diversifying its revenue streams. CEO Jason Huang expects a \"second wave\" of AI-related demand as national governments address the need for \"sovereign AI\" to suit their unique characteristics and national security concerns. Recently, Nvidia inked a partnership with Singtel, the Singaporean state-owned Telecom, which aims to use Nvidia GPUs to bring AI services to companies in the Southeast Asian nation. More importantly, this deal will involve the use of Nvidia's AI software solutions, which could help the company gain market share and compete against traditional cloud service providers. Despite being the sixth most valuable company in the world with a $1.69 trillion market cap, Nvidia's stock is still relatively affordable. While the company's forward price-to-earnings (P/E) multiple of 33 is slightly higher than the Nasdaq-100 average of 30, this is a small premium to pay for a business growing at a triple-digit rate in an innovation-led industry. The discount could be a response to Nvidia's overreliance on h100 chip sales. Over the next five years, the company's investments in different sides of the AI opportunity (like software and international expansion) could help diversify its revenue streams and unlock a higher valuation. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 5, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Where Will Nvidia's Soaring Stock Be in 5 Years? was originally published by The Motley Fool Related Quotes "
}