{
    "title": "V.F. stock is a turnaround story hiding in plain sight",
    "date": "2/12/2024",
    "url": "https://www.marketbeat.com/originals/vf-stock-is-a-turnaround-story-hiding-in-plain-sight/",
    "text": " Today's stock market is not what you may have gotten used to from 2020 through 2023. For most of that time, technology stocks ruled the land due to their hypergrowth projections and attractive propositions. The epitome of this market preference can be seen in the price action for NVIDIA NASDAQ: NVDA. The stock kept breaking past all-time highs to trade at a massive 95x P/E ratio. So, where can you find additional upside after the S&P 500 and the NASDAQ indices have both been hitting all-time highs? Well, you can see some room to squeeze returns by spreading out the performances between the Technology Select Sector SPDR Fund NYSEARCA: XLK against the Consumer Discretionary Select Sector SPDR Fund NYSEARCA: XLY, which would come to be a vast 27.4% gap in favor of tech. You also have to consider that the FED will likely cut interest rates this year, which, according to the FedWatch tool at the CME Group NASDAQ: CME, could come as soon as May. When rate cuts become imminent, large investors and traders may start to bargain hunt for turnaround plays within the consumer discretionary names since they tend to do well during low interest rate environments. Here is why  V.F. NYSE: VFC could quickly become a prime target. Remember that the narrative here is mainly focused on turnarounds. This is where you seek a trend that is quickly going into a potential expansion after a brief – or net – period of contraction. Do you want to know how the big players on Wall Street pick the industries and sectors to invest in before they move? Here's the start. Following a 'top-down' research process, you can start by reviewing the ISM manufacturing PMI index trends. This will make it very clear to you why apparel stocks may be in play today. Over November and December, the apparel and textile mills industries saw heavy contractions, which could be blamed on the industry's seasonality. Still, it was more of a desperate attempt to clear out built-up inventory. Have you been getting emails for up to 40% discounts from Ralph Lauren NYSE: RL? Because it has been only one of several brands trying to move items out of their stores. The struggle could be over for these names, as the major PMI trends have taken a wild turn to start the 2024 year. For January, the apparel industry reported the most growth out of the 18 sectors the report keeps tabs on. Coming in second, textile mills also came in an expansion, which does check out since they will likely be pumping out more materials to meet the newfound breakout for their apparel customers. Here is where things get a bit more complex. While most retail investors and traders will focus on the bigger names like Abercrombie & Fitch NYSE: ANF, the real juice – that is worth the squeeze – is found in names like V.F. and even Foot Locker NYSE: FL and Under Armour NYSE: UAA. Abercrombie stock grew its earnings per share by a decent 46.5% in the past twelve months. Here's why you can disqualify this stock from your turnaround suspects. Analysts expect this stock to grow its EPS by only 6.4% in the next twelve months, which is significantly slower than the company did last year. That may be why these same analysts see a net downside of 36.9% from today's prices, based on their $69.4 share price target, far from a turnaround. For Foot Locker and Under Armour, there are signs of a potential turnaround in that they are both turning an EPS contraction from the past twelve months into an expansion for this year. Foot Locker saw falling EPS of 31.8% in the last twelve months, whereas analysts expect to see growth of 48.2% this year. With a $26 a share price target, though, Foot Locker analysts see an 11.3% downside in that stock. Under Armour's earnings declined by 18.3% in the past year, and analysts reward this name with a 22.4% upside for the next twelve months to bring you another turnaround prospect. For reasons kept by Wall Street, analysts are more bullish on this name with their $9.9 a share price target, implying a rally of 22.6% from today's price. Now, why and how is V.F. a better choice here? With an EPS decline of 14.1% last year, analysts think 2024 could be much different at 28.1% growth. A price target of $18.7 a share also brings you a potential upside of 22.2%; so far, nothing stands out from the rest of the peers except this. The price-to-book valuations for Foot Locker and Under Armour are 0.9x and 1.7x, respectively, below the industry average of 3.1x. Remember the saying, \"It must be cheap for a reason.\" Don't put yourself at risk to find out what that reason is. Instead, check this out. V.F. stock sells for 3x P/B to align with the rest of the industry, meaning that markets are more accepting of the potential turnaround being proposed by analysts in the company's EPS and price targets. As you may know – perhaps by painful mistakes -  you should never fight the market. Before you consider Abercrombie & Fitch, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Abercrombie & Fitch wasn't on the list. While Abercrombie & Fitch currently has a \"Hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Need to stretch out your 401K or Roth IRA plan? Use these time-tested investing strategies to grow the monthly retirement income that your stock portfolio generates. Value Stocks, Asian Markets, Macro Economics Gabriel Osorio-Mazilli has been a contributing writer for MarketBeat since 2023. Value investing, long/short trading, options, emerging markets CFA Level I candidate; Goldman Sachs corporate training; independent courses Analyst at Goldman Sachs, associate at Citigroup, senior financial analyst in real estate Expert insights into the psychological impact of stock splits and the potential candidates for future splits. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}