{
    "title": "The Weather Company, NVIDIA to Advance Weather Forecasting",
    "date": "3/18/2024",
    "url": "https://www.geospatialworld.net/news/weather-company-nvidia-weather-forecasting/",
    "text": "To mitigate disruptions from future weather- and climate-related events, The Weather Company announced an expanded collaboration with NVIDIA in the field of weather forecasting. Leveraging both companies’ deep expertise and advanced science and technology capabilities, this collaboration will progress artificial intelligence-based weather prediction and provide improved simulation using real weather data from the world’s most accurate weather forecaster to better visualize weather’s potential impacts on businesses, personal safety, and society. “Working to build future climate resilience as a society starts with having accurate, reliable, actionable weather data,” said Sheri Bachstein, CEO of The Weather Company. “By combining our leading weather data together with NVIDIA’s computing advancements, we plan to deliver forecasts from the first AI-based high-resolution numerical weather model as well as to improve digital twin climate scenarios for a more realistic view down to the scale of a thunderstorm.” NVIDIA computing technology will help power The Weather Company’s data processing, one of the largest collections of global weather data in the world, and The Weather Company data and insights will help expand NVIDIA’s Earth-2 open digital twin platform, which strives to accelerate climate and weather predictions using interactive, high-resolution simulation. A digital twin is a virtual replica of a real-world physical asset to test and monitor changes, oversee performance, and accelerate decision-making. “The impacts of extreme climate events are costing countries hundreds of billions of dollars each year,” said Dion Harris, Head of Data Center Product Marketing at NVIDIA. “We’re working with The Weather Company and other industry leaders to take advantage of accelerated computing and AI to make dramatic improvements in the accuracy of climate change predictions.” The Weather Company has worked with NVIDIA for years on GPU acceleration of its groundbreaking high-resolution weather forecasting system GRAF, a physics-based, rapidly updating model that predicts more realistic, small-scale detail than conventional global models. Proprietary to The Weather Company and in collaboration with the National Center for Atmospheric Research (NCAR), GRAF is enabled by NVIDIA graphics processing units (GPUs) to accelerate the computing power needed to process highly dynamic and complex weather data. Building on previous work, the expanded collaboration will focus on two main areas: The first-ever AI-based weather model focused on high-resolution forecasting The Weather Company is working with NVIDIA to create a first-of-its-kind kilometer-scale, AI-based numerical weather prediction model. The model will initially generate products for the U.S. and Europe and, with continued collaboration, eventually cover the entire globe. AI-powered forecasts and insights have the potential to fuel products that have real-world applications for businesses, consumers, and society at large. NVIDIA Earth-2 APIs already include AI-based weather models, although none currently focus on high-resolution, granular forecasts. The Weather Company’s model will leverage its GRAF system to fill this gap, providing training data to inform the AI model and applying forecasting in a more energy-efficient, economical way. AI models are only as good as the data and inputs that train them. As severe weather events grow in intensity amid a changing climate, current AI models simply don’t have the historical storm-scale data to predict some of the never-before-seen weather extremes that are now more common, such as record-breaking heat, devastating flooding and wildfires, and rapidly intensifying hurricanes. This collaboration aims to generate many years of retrospective GRAF forecasts to help develop AI techniques capable of emulating and understanding the physics of storm-scale weather. The only provider of actual weather data for use within synthetic environments As the weather grows more disruptive, it’s increasingly clear that operational planning requires reliable weather intelligence. While other current simulations and digital twins use synthetic weather, The Weather Company’s Weatherverse solutions deliver real weather, based upon historical, current, and forecasted datasets, into planning and simulation environments at a global scale. This results in better-informed insights, more confident decision making and improved outcomes where weather is a contributing influencer. The Weather Company’s Weatherverse capabilities will be made accessible on NVIDIA Omniverse, the platform for connecting and developing OpenUSD applications. This access enables customers building digital twins to better visualize and understand the actual effects of weather conditions interactively and intuitively. Looking forward, The Weather Company will also explore adopting NVIDIA score-based generative AI within its Weatherverse solutions, its new high-resolution weather modeling products, and its Weather Engine solution that helps fuel business insights through weather intelligence. Defense industry leaders such as BAE Systems and SimCentric Technologies are actively exploring how best to leverage Weatherverse solutions to help redefine military planning, training and simulation outcomes. Additionally, users of the Unreal Engine for visual rendering can take advantage of Weatherverse Sim, a plugin via API to visualize The Weather Company’s data for easier integration and deployment. Log in to leave a comment November – December2023  Get it delivered to your mailbox every Monday  Email Country  For Sponsored Content/Guest Post: [email protected] © Geospatial Media and Communications. All Rights Reserved.​ "
}