{
    "title": "Jensen Huang says even free AI chips from his competitors can't beat \nNvidia's GPUs",
    "date": "3/10/2024",
    "url": "https://www.tomshardware.com/pc-components/gpus/jensen-huang-says-even-free-ai-chips-from-his-competitors-cant-beat-nvidias-gpus",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Jensen says free 'isn't cheap enough' to stand a chance against the green team in data center AI. Nvidia CEO Jensen Huang recently took to the stage to claim that Nvidia's GPUs are \"so good that even when the competitor's chips are free, it's not cheap enough.\" Huang further explained that Nvidia GPU pricing isn't really significant in terms of an AI data center's total cost of ownership (TCO). The impressive scale of Nvidia's achievements in powering the booming AI industry is hard to deny; the company recently became the world's third most valuable company thanks largely to its AI-accelerating GPUs, but Jensen's comments are sure to be controversial as he dismisses a whole constellation of competitors, such as AMD, Intel and a range of competitors with ASICs and other types of custom AI silicon. Starting at 22:32 of the YouTube recording, John Shoven, Former Trione Director of SIEPR and the Charles R. Schwab Professor Emeritus of Economics, Stanford University, asks, \"You make completely state-of-the-art chips. Is it possible that you'll face competition that claims to be good enough – not as good as Nvidia – but good enough and much cheaper? Is that a threat?\" Jensen Huang begins his response by unpacking his tiny violin. \"We have more competition than anyone on the planet,\" claimed the CEO. He told Shoven that even Nvidia's customers are its competitors, in some cases. Also, Huang pointed out that Nvidia actively helps customers who are designing alternative AI processors and goes as far as revealing to them what upcoming Nvidia chips are on the roadmap.\n\nThis does indeed sound like quite an extraordinary way of doing business, but Huang's next claim that Nvidia operates as a \"completely open book\" while working with almost everyone else in the industry may be harder to believe. Remember, there were strong accusations of Nvidia operating a GPU Cartel just recently, with customers reportedly scared to speak to rival GPU / AI accelerator makers for fear of delayed orders. An industry consortium has also formed in an attempt to unseat the company's dominant CUDA programming model. Returning to the Stanford interview, Jensen Huang outlined Nvidia's currently unassailable unique selling points. The Nvidia CEO said that whereas you could build a chip to be good at one particular algorithm, Nvidia's GPUs are programmable. Moreover, the Nvidia platform is \"a great standard… in every single cloud computer company.\" A typical data center that wants to support a wide range of customers, from financial services to manufacturing and so on, will therefore be drawn towards Nvidia hardware. Huang also sought to provide a contrast that might be counterintuitive to those focused on GPU prices: people who buy and sell chips think about the price of chips, and people who operate data centers think about the cost of operations, he clarified. Of course, companies will be well aware of the Total Cost of Ownership (TCO), which basically means that Nvidia's claimed benefits like time to deployment, performance, utilization, and flexibility are \"so good that even when the competitor's chips are free, it's not cheap enough,\" according to Huang. Concluding his answer to Shoven, the Nvidia CEO underlined that keeping this far ahead, with this unbeatable TCO, is Nvidia's goal. Huang reminded summit attendees that what Nvidia does takes a lot of hard work and innovation — no luck involved here — and nothing is taken for granted. Join the experts who read Tom's Hardware for the inside track on enthusiast PC tech news — and have for over 25 years. We'll send breaking news and in-depth reviews of CPUs, GPUs, AI, maker hardware and more straight to your inbox. Naturally, Nvidia's competitors would beg to differ with Huang's statements, but the incumbent is the unquestioned 800lb gorilla of the AI world right now, placing the onus on its competitors to prove Jensen's statements wrong. Mark Tyson is a Freelance News Writer at Tom's Hardware US. He enjoys covering the full breadth of PC tech; from business and semiconductor design to products approaching the edge of reason. GPU pricing update: Nvidia RTX 4080 Super prices down to $999 MSRP now — 4060 starts at $279 New open source GPU is free to all — FuryGPU runs Quake at 60fps, supports modern Windows software We tried to install Windows 11 on Raspberry Pi 5 — lack of internet connectivity left us stuck By Christopher HarperMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Mark TysonMarch 28, 2024 By Christopher HarperMarch 28, 2024 By Roshan Ashraf ShaikhMarch 28, 2024 By Anton ShilovMarch 28, 2024 By Anton ShilovMarch 27, 2024 By Aaron KlotzMarch 27, 2024 By Anton ShilovMarch 27, 2024 By Paul AlcornMarch 27, 2024 By Paul AlcornMarch 26, 2024 Tom's Hardware is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}