{
    "title": "Nvidia's Revenue From This Business Soared More than 1,000% in 4 Years",
    "date": "3/2/2024",
    "url": "https://finance.yahoo.com/news/nvidias-revenue-business-soared-more-103500370.html?prefer_reader_view=1&prefer_safari=1",
    "text": "Nvidia (NASDAQ: NVDA) once was known as the company that powered gaming and graphics. The tech giant created graphics processing units (GPUs), or chips that process many tasks simultaneously. This, allowing for great speed, helped games spring to life on the screen. Today, Nvidia still leads in the gaming world -- but this no longer is the company's biggest business. Instead, it's moved on to another industry that's on fire at the moment and may continue to pick up momentum in the coming years. In fact, Nvidia's revenue from this particular market has climbed more than 1,000% in just four years. Let's find out more. Back in 2006, Nvidia launched CUDA, a programming model allowing GPUs to be used for just about any task. This expanded Nvidia's revenue potential and helped the company get into the business of artificial intelligence (AI) before this technology grabbed the world's attention. And this brings me to the business that's seen such enormous growth over the past few years. As shown in the Statista chart, below, Nvidia's revenue from compute and networking, which includes AI systems and high-performance computing, has skyrocketed 1,345% over the past four years to more than $47 billion in the 2024 fiscal year. Graphics, which includes gaming, used to be the company's biggest revenue source back in 2020, but this no longer is the case -- even though graphics revenue has climbed since that time. In short, Nvidia's entire revenue opportunity has expanded, led by AI products and services. You'll recognize this in the company's earnings reports as the data center business, and this unit reported record revenue in recent quarters. This has helped the company's total revenue to reach all-time high levels too. What does this mean for investors? Nvidia is the leader in the AI chip market, and this technology's growth is just getting started. So, investors interested in betting on AI winners may consider buying shares of this exciting tech player. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Adria Cimino has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy. Nvidia's Revenue From This Business Soared More than 1,000% in 4 Years was originally published by The Motley Fool Related Quotes "
}