{
    "title": "I'd buy these shares for Nvidia-like gains over the next decade",
    "date": "3/25/2024",
    "url": "https://www.fool.com.au/2024/03/26/id-buy-these-shares-for-nvidia-like-gains-over-the-next-decade/",
    "text": " Access all of your premium services in our Member Centre Click here to learn more about our premium services TO MAKE THE WORLD SMARTER, HAPPIER, AND RICHER. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services. I think these two stocks have the most potential to emulate NVIDIA… Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The gains of NVIDIA Corporation (NASDAQ: NVDA) shares over the past few months and years have quickly become legendary. Not just on the US markets, but around the world. That's what tends to happen when a company rockets 258% over the past 12 months, and a jaw-dropping 2,016% since March 2019. Oh, and Nvidia shares have also gained a cool 97.2% over 2024 to date. That leaves this growth monster and semiconductor and artificial intelligence (AI) stock with a market capitalisation of US$2.38 trillion today. Obviously, finding other shares whether they be ASX or international shares, that can offer investors even the potential of these kinds of returns is rather difficult. After all, even a small investment in Nvidia shares at any time in the past five years would have probably led to life-changing gains to one's wealth. So today, I'm going to discuss two stocks that I personally own that I have high hopes for emulating the Nvidia experience. I don't believe these stocks will truly rival Nvidia's recent returns in coming years, as I happen to think Nvidia's experience is a byproduct of exceptional circumstances. But they are the investments that have some of the best potential to come close in my opinion. Duolingo is a language and learning company whose business rests on its eponymous app. Users can use Duolingo to learn additional languages within a simple, easy-to-follow framework. It offers both a free experience, but also a paid subscription model that users can employ if they want to learn faster and more comprehensively. I bought Duolingo shares a few years ago, and have already seen some huge gains. But I think this company can continue to grow exponentially into the future. As an example, the company had 49.2 million monthly active users at the beginning of 2022. But by the end of 2023, this had grown to 88.4 million. Duolongo's finances are growing even faster though. The company reported revenue of US$531.1 million for 2023, which was a rise of 43% from the previous year. I think the total addressable market for this company is almost limitless, given how many people want to learn or brush up on a second, or even third or fourth, language around the world. Duolingo is also expanding into other learning areas, such as mathematics and music with its app. I'm very excited about Duolingo's future. Whilst I don't see this company with a market capitalisation of US$2.38 trillion anytime soon, I'm still expecting healthy growth for years to come. Moving on, we have another stock that most readers would be familiar with. Mark Zuckerberg's social media titan Meta is something of a controversial stock. But no one can deny that this company has some of the hottest assets in the world. It owns Facebook of course, but also Instagram, Whatsapp and Messenger. These are all among the most popular apps on the planet. I've owned Meta stock for many years now too. But this is another company that just doesn't seem to know how to slow down. It reported healthy (in most cases double-digit) rises in active monthly users across most of its apps last year – an impressive feat considering Facebook is celebrating its 20-year anniversary in 2024. Meta also managed to increase its revenues from US$114 billion in 2022 to US$132 billion in 2024. Operating income also increased, rising from US$29 billion to US$47 billion. Meta is also in the habit of conducting massive share buybacks and has even recently announced a maiden dividend payment. I think there are plenty of returns left in this growth beast in the coming years, and I think this company will continue to be a lucrative investment to own. In fact, I wouldn't be surprised if Meta had a market cap well north of US$2 trillion in just a few years. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Motley Fool contributor Sebastian Bowen has positions in Meta Platforms and Duolingo. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Duolingo, Meta Platforms, and Nvidia. The Motley Fool Australia has recommended Meta Platforms and Nvidia. The Motley Fool has a disclosure policy. This article contains general investment advice only (under AFSL 400691). Authorised by Scott Phillips. March 29, 2024 | Tristan Harrison I’m a believer in the long-term outlook of these stocks. Read more » March 28, 2024 | Sebastian Bowen I would happily exchange dollars for these two shares right now. Read more » March 28, 2024 | Bernd Struben I believe these ASX 200 shares will continue rewarding passive income investors for years to come. Read more » March 28, 2024 | Tristan Harrison I decided to put this stock in my shopping basket over Woolies. Read more » March 28, 2024 | Tony Yoo Reliable dividend shares are everywhere on the ASX. Here's how you could use that to your advantage. Read more » March 28, 2024 | Tony Yoo The best performer on the index last year has had a poor start to 2024. Let's examine whether this is… Read more » March 28, 2024 | Mitchell Lawler Just because a company's share price has gone up doesn't mean it's no longer good value. Read more » March 27, 2024 | Sebastian Bowen I think these index funds are well worth a look right now. Read more » View All Sign Up for Take Stock Investment news, stock ideas, and more, straight to your inbox. Get Started Investing You can do it. Learn about investing with our Investing Education hub. Win at Retirement Our latest articles and strategies for the post-work life you want. Listen to Our Podcast Hear our experts take on shares, the market & how to invest. Join Our Premium Community Join our flagship membership service, Share Advisor. The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service. Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. To make the world Smarter, Happier, And Richer Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show and premium investing services. The Motley Fool launched its Australian presence in 2011, and since then has grown to reach over 1 million Australians. Read more about us >  This Service provides only general, and not personalised financial advice, and has not taken your personal circumstances into account. The Motley Fool Australia operates under AFSL 400691. For more information please see our Financial Services Guide. Please remember that investments can go up and down. Past performance is not necessarily indicative of future returns. The Motley Fool Australia does not guarantee the performance of, or returns on any investment. We respectfully acknowledge the Traditional Custodians of the land where we live and work and pay our respects to all Elders, past and present, of all Aboriginal and Torres Strait Islander nations. © 2010 - 2023 The Motley Fool Australia Pty Ltd. All rights reserved. ACN: 146 988 052 Australian Financial Services Licence (AFSL): 400691 The Motley Fool Australia, PO Box 104, Isle of Capri, Qld 4217 Contact Details: Phone: (03) 8592 4841 Email: [email protected] Our friendly customer service team will happily get back to you as soon as they can. Notifications Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! "
}