{
    "title": "The Zacks Analyst Blog Highlights NVIDIA, Meta Platforms, Atmos Energy \nCorporation, Consolidated Water and Toll ...",
    "date": "3/13/2024",
    "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-133300007.html",
    "text": "Chicago, IL – March 13, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NVIDIA Corporation NVDA, Meta Platforms, Inc. META, Atmos Energy Corporation ATO, Consolidated Water Co. Ltd. CWCO and Toll Brothers, Inc. TOL. Here are highlights from Tuesday’s Analyst Blog: Fed Chair Jerome Powell always emphasized that interest rate cuts later this year will be fitting, but they are reliant on the path of the economy. Talking about the economy, the labor market continued to exhibit strength with 275,000 nonfarm jobs added in February, much higher than the forecasted 200,000, per the Bureau of Labor Statistics. Payrolls are, thus, almost double the number of monthly jobs needed to keep up with growth among the working-age population. However, it's the rise in the unemployment level and moderation in wage growth that has bolstered the expectation of an interest rate cut by the Federal Reserve in June. The unemployment rate increased 0.2 percentage points to 3.9% in February. It has been hovering at 3.7% in the previous three-month period. When it comes to wage growth, average hourly earnings increased 4.3% year over year, less than expectations of a 4.5% annual pace. Notably, average hourly earnings increased 4.4% year over year in January. The Fed, meanwhile, has kept the benchmark fed funds rate steady between 5.25% and 5.5%. The central bank intends to lower the rate by the end of this year and further trim rates in 2025 as inflationary pressure has slowed down considerably amid a resilient economy (read more: 5 Top Stocks to Gain From Lower Interest Rates in 2024). Now, with the Fed likely to remain dovish and trim interest rates this year, tech, utility and construction companies are positioned to gain the most. Tech stocks thrive in a low-interest rate environment. This is because, in the case of rising interest rates, the future cash inflows of tech companies are affected, leading to an increase in borrowing costs and lesser profit margins. Hence, interest rate cuts bode well for tech players. Utility companies, being capital-intensive, have higher levels of debt. In a low-interest rate scenario, their debt levels decrease, helping such companies pay off dues and register profits. Construction businesses also benefit from lower interest rates since the borrowing cost of projects is reduced. We have thus highlighted five stocks such as NVIDIA Corporation, Meta Platforms, Inc., Atmos Energy Corporation, Consolidated Water Co. Ltd. and Toll Brothers, Inc. that are well-positioned to make the most of the Fed's aim to trim interest rates. These stocks flaunt a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see the complete list of today's Zacks #1 Rank stocks here. NVIDIA is the worldwide leader in visual computing technologies. NVDA currently has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has increased 16.1% over the past 60 days. The company's expected earnings growth for the current year is 79.2% (read more: NVIDIA a Must-Buy After AI-Fueled Blowout Earnings). Meta Platforms is the world's largest social media platform. META currently has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has increased 13.2% over the past 60 days. The company's expected earnings growth for the current year is 34.1%. Atmos Energy is engaged in regulated natural gas distribution and storage business. ATO currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 0.5% over the past 60 days. The company's expected earnings growth for the current year is 8%. Consolidated Water is involved in the development and operation of seawater desalination plants and water distribution systems. CWCO currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings has increased 0.6% over the past 60 days. The company's expected earnings growth for the current year is 225.9%. Toll Brothers builds single-family detached and attached home communities. TOL currently has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings has increased 12.2% over the past 60 days. The company's expected earnings growth for the current year is 11%. Why Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Toll Brothers Inc. (TOL) : Free Stock Analysis Report Atmos Energy Corporation (ATO) : Free Stock Analysis Report Consolidated Water Co. Ltd. (CWCO) : Free Stock Analysis Report Meta Platforms, Inc. (META) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}