{
    "title": "Nvidia surpasses $2 trillion valuation as AI rally heats up",
    "date": "3/3/2024",
    "url": "https://gulfbusiness.com/nvidia-surpasses-2-trillion/",
    "text": "Get daily business news from the region delivered straight to your inbox Nvidia’s stock market value edged above $2 trillion for the first time before receding by the end of the session Nvidia’s stock market value closed above $2tn for the first time on Friday after an upbeat report from Dell Technologies reignited Wall Street’s AI-fueled rally. Nvidia’s stock added 4 per cent after Dell, which sells high-end servers made with Nvidia’s processors, gave an upbeat forecast late on Thursday, pointing to a surge in orders for its AI-optimized servers. Dell’s shares soared as much as 38 per cent to a record high before ending the session with a 32 per cent gain. Friday’s rally put Nvidia’s market capitalisation at $2.06tn, making it Wall Street’s third most valuable company behind Microsoft and Apple, at $3.09tn and $2.77tn, respectively. Super Micro Computer, another company that sells servers made with Nvidia’s chips, jumped 4.5 per cent. Other chipmakers exposed to AI rallied to record highs, with Broadcom and Marvell Technology each up about 8 per cent, while Advanced Micro Devices AMD.O climbed over 5 per cent. The PHLX chip index rallied 4.3 per cent to its own record high, lifting its 2024 gain to 18 per cent. Nvidia controls about 80 per cent of the high-end AI chip market, with customers including ChatGPT creator OpenAI, Microsoft, Alphabet and Meta Platforms snapping up tight supplies of its components to compete in the fast-emerging generative AI sector. The company has recently become Wall Street’s most traded stock by value, day to day, replacing Tesla. Investors exchanged $36bn worth of Nvidia’s stock on average over the past 30 sessions, compared to $21bn a day for Tesla. Trading in Nvidia on Friday reached $38bn worth of shares. Nvidia’s stock has now risen 66 per cent in 2024 after more than tripling last year. Last month, its stock market value overtook Amazon AMZN.O and Alphabet. A week ago, Nvidia’s stock market value edged above $2 trillion for the first time before receding by the end of the session. Saudi Aramco has a $2.045tn market capitalisation, although over 90 per cent of it is closely held by the government of Saudi Arabia and less than 2 per cent of its shares are available for trading by investors, according to LSEG data. © 2021 MOTIVATE MEDIA GROUP. ALL RIGHTS RESERVED. "
}