{
    "title": "Reporter Chun Hak-jong's Weekly Semiconductor-Story for the Fourth Week of \nMarchThere is a person wh.. - MK",
    "date": "3/21/2024",
    "url": "https://www.mk.co.kr/en/business/10971423",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share Reporter Chun Hak-jong's Weekly Semiconductor-Story for the Fourth Week of March There is a person who never misses the most important person to lead the AI era. I'm Jensen Huang, the head of Nvidia. It has an almost unrivaled position in the AI accelerator market, including GPUs. That's why all investors around the world are paying attention to his mouth. He unusually praised 'Samsung Electronics' at the public site. He said he is directly testing Samsung Electronics' high-bandwidth memory (HBM). His single word caused a warm breeze in the stock price of Samsung Electronics, which had been \"alienated\" even with the warm breeze of semiconductors. This week's Weekly Semiconductor will take a look at Nvidia and Samsung's changed mood. CEO Hwang recently expressed his expectations for Samsung at NVIDIA's developer conference 'GTC 24'. Asked if he is using Samsung's HBM, CEO Hwang said, \"I am not using it yet,\" but added, \"We are currently testing it (qualifying) and have high expectations.\" Going one step further, Jensen Huang visited Samsung Electronics' booth on the same day and emphasized the bond by leaving a handwritten signature on HBM3E. It is difficult to interpret that Nvidia will immediately use Samsung Electronics' HBM3E, but it seems clear that the relationship between the two companies has become so strong that they leave a \"wit\" signature. In fact, Samsung has been having difficulty entering Nvidia due to SK Hynix's barriers. NVIDIA's HBM has been virtually monopolized by SK Hynix since its early days. From the end of this month, the 5th generation HBM3E will also be mass-produced for the first time in the world and supplied to Nvidia. SK Hynix announced that it will be the first to supply HBM3E to customers after mass-producing the 4th generation HBM3 for the first time in the industry last year. Hynix also unveiled the performance of HBM4, a sixth-generation HBM, which is scheduled to be mass-produced in 2026. Compared to fifth-generation products, the goal is to increase speed by 40% and reduce power consumption to 70%. TSMC, a professional foundry company, will reportedly be responsible for the production of the \"logic die\" at the bottom to coordinate data flows. To this end, SK Hynix and TSMC have recently established a 'one-team' strategy for this. The triangular formation from Nvidia to TSMC to SK Hynix looked pretty solid. But this 'one team' is starting to change. As well as Samsung Electronics, U.S. Micron has officially announced that it has started supplying HBMs to Nvidia. The news also sent the stock price soaring 15% after-hours. Micron on Tuesday issued second-quarter earnings and third-quarter forecasts that exceeded market expectations. In particular, it was confident that sales in the third quarter would be $6.6 billion, surpassing the market forecast of $6.02 billion by about 10%. On the same day, Micron said that SK Hynix is already selling its next-generation products, unlike the first one that SK Hynix said. \"Sales began to come from HBM3E in the second quarter, and this semiconductor is part of the Nvidia AI accelerator,\" Micron explained. He also said he expects hundreds of millions of dollars in sales from HBM products in fiscal 2024, and that most of HBM's production is already out of contract for sales in 2025. If so, will the three companies continue to choke up to get Nvidia's choice in the future? Maybe not! Samsung Electronics is not just looking at Nvidia. They have officially announced that they will make their own super AI chips like Nvidia. It's a helper for Nvidia, but it's also a potential rival at the same time. Samsung Electronics announced that it will introduce the next-generation artificial intelligence (AI) accelerator 'Mach-1' early next year. \"We are developing an AI accelerator Mach-1 that reduces memory throughput by one-eighth and has 8 times power efficiency,\" said Kyung-hyun Byeon, head of Samsung Electronics' Device Solutions (DS) division at the shareholders' meeting. Mach-1 is being developed by General Artificial Intelligence (AGI) Computing Lab, a recent new organization in Samsung Electronics' DS division. For an explanation of the new organization AGI Computing Lab, please refer to the exclusive article below. Samsung Electronics' shareholders' meeting that it is developing \"Maha-1\" seems to be to publicly announce its willingness to regain its pride in the AI market. In particular, Nvidia's challenge to the AI accelerator market, which is dominated by next-generation technology, is seen as a sign that it will make up for practical skills (失期) in the HBM market and start exploring new AI markets in earnest. From leading Korean companies such as Samsung Electronics and SK Hynix to TSMC and Intel! We publish investment information about semiconductor companies, the core of the global industry, every week. Subscribe to the 'Reporters Page' and you won't miss out on news. :) 2024-03-29 17:44:51 2024-03-28 14:43:55 2024-03-28 08:35:39 2024-03-29 10:06:50 2024-03-29 16:18:40 2024-03-28 22:06:01 2024-03-30 06:02:41 2024-03-28 18:05:38 2024-03-29 20:51:03 2024-03-29 09:51:58 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}