{
    "title": "Nvidia Stock: Can NVDA Hit $1,400 in One Year?",
    "date": "3/6/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/ESG/pressreleases/24591444/nvidia-stock-can-nvda-hit-1400-in-one-year/",
    "text": "Nvidia (NVDA) stock registered a stellar gain of about 239% in 2023. The solid demand for its graphics processing units (GPUs) that power artificial intelligence (AI) computing led to this rally. Further, the uptrend has continued in 2024, with Nvidia stock recording a year-to-date gain of 74%, thanks to its end-to-end platform for building and deploying generative AI applications. Although Nvidia stock has already gained substantially year-to-date, at least one Wall Street analyst expects the chip giant’s stock to reach $1,400 - the Street-high price target - in the next 12 months. Let’s explore why. Nvidia recently delivered impressive Q4 earnings, despite higher expectations. Its Q4 FY24 revenue of $22.1 billion was up 22% sequentially and 265% year-on-year. In the fourth quarter, data center revenue of $18.4 billion set a new record, up 27% sequentially and up 409% year-over-year, driven by the NVIDIA Hopper GPU computing platform, along with InfiniBand end-to-end networking. Revenue for fiscal year 2024 was $60.9 billion, up 126% from the prior year. Data center revenue for the fiscal year 2024 was $47.5 billion, more than tripling from the prior year. Nvidia's exponential revenue growth throughout FY24, from $7 billion in the first quarter to over $22 billion in Q4, signifies stellar AI-led demand and its dominant competitive positioning, especially in the data center business. Further, the company's Hopper architecture and InfiniBand networking are seen as the benchmark for accelerated computing and AI infrastructure. It’s worth highlighting that the massive data center infrastructure base (about $1 trillion) is shifting towards accelerated computing. Meanwhile, Nvidia, with its dominant position in the AI and accelerated computing space, is well-positioned to capitalize on this shift. Nvidia has introduced its H200 AI chips, featuring advanced memory capabilities to handle large volumes of data efficiently for generative AI and high-performance computing tasks. This will further solidify its position as a market leader. The company noted that H200 chips are already witnessing solid demand. Further, the company is on track to ramp up H200 with initial shipments in the second quarter of the current year. Looking ahead, Nvidia’s management sees widespread adoption of AI solutions across industries and sectors, offering immense growth opportunities for the company. Besides data center, the company is well-positioned to capitalize on growing demand from gaming, autonomous vehicles, robotics, and industrial digitalization. The company's rapid product launches aimed at addressing diverse AI opportunities are expected to drive growth. Nvidia holds a leadership position in the PC gaming segment. Further, the growing adoption of NVIDIA GeForce RTX GPUs and the launch of the RTX 40 Super Series family of GPUs, which delivers exceptional gaming performance and generative AI capabilities, are expected to boost its sales. Furthermore, Nvidia holds a prominent market share in workstation graphics. With enterprises upgrading their workstations to support generative AI-related workloads, Nvidia is well-positioned to capitalize on this demand via its RTX Ada architecture GPUs. Meanwhile, its NVIDIA DRIVE platform is experiencing robust adoption, particularly with NVIDIA DRIVE Orin emerging as the preferred AI car computer for software-defined autonomous vehicle fleets. This positions the company well to capture a significant market share in the automotive industry. Nvidia is poised to deliver solid revenue growth, higher earnings, and strong cash flow on the back of soaring demand for its GPUs, which power AI solutions across diverse sectors and industries. This should support the upward trend in Nvidia stock and enable the company to return significant cash to its shareholders through share repurchases. The company repurchased shares worth $2.8 billion in Q4 of FY24, and bought back shares worth $9.5 billion in FY24. Further, Nvidia has a solid balance sheet with approximately $26 billion in cash, cash equivalents, and marketable securities. With AI likely to drive the company’s core earnings in the coming years, analysts have a bullish outlook on NVDA stock. Among the 39 analysts covering the shares, 34 recommend “Strong Buy.” Just two analysts have a “Moderate Buy” rating, and three maintain a “Hold.” The new Street-high price target for NVDA stock is $1,400, via Hans Mosesmann of Rosenblatt, which surpasses the previous Street-high of $1,200 from Loop Capital. That new high-water mark indicates about 62% potential upside for the shares, based on Tuesday's close. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}