{
    "title": "Nvidia offers developers a peek at new AI chip next week",
    "date": "3/17/2024",
    "url": "https://sg.news.yahoo.com/nvidia-offers-developers-peek-ai-110349486.html",
    "text": "By Stephen Nellis and Max A. Cherney SAN FRANCISCO (Reuters) - How long can Nvidia and its CEO, Jensen Huang, wear the crown as the tech world's dominant supplier of artificial-intelligence chips? Whether it is months, years or decades, the question will be key when Huang - who co-founded Nvidia in 1993 and has been CEO ever since - sets foot on the stage of a Silicon Valley hockey arena on Monday to unveil new flagship products. The occasion is the company's annual developer conference, the first to be held in person since the pandemic. Nvidia expects 16,000 people to attend its GTC event live, roughly double the number who went to the 2019 show in person. Nvidia's market capitalization topped $2 trillion in late February, and it is now a \"mere\" $400 billion away from eclipsing Apple as Wall Street's second-most valuable company, behind stock market leader Microsoft. Analysts expect Nvidia's revenue to soar 81% this year to $110 billion as companies snap up its top-of-the-line chips by the tens of thousands to power chatbots, image generators and other AI systems. That is double the sales that analysts expect from Intel, the chipmaker that dominated the personal computer boom. The question for Nvidia is whether it can parlay its recent, massive lead in AI computing into long-term dominance of a new era of computing. At the center of that effort will be Nvidia's next generation of high-end AI processor, which analysts expect to be called the B100. The chip will sit at the center of the AI systems that Nvidia sells and will likely start shipping later this year. Demand for Nvidia's current AI chips has outstripped supply, with software developers waiting months for a chance to use AI-optimized computers at cloud providers. Nvidia is unlikely to give specific pricing, but the B100 is likely to cost more than its predecessor, which sells for upwards of $20,000. Nvidia's stock has surged 83% in 2024 after more than tripling last year. Even after that meteoric rally, Nvidia is trading at 34 times its expected earnings, cheap compared with its PE of 58 a year ago, according to LSEG data. That decline in Nvidia's PE valuation is the result of analysts massively increasing their estimates of the chipmaker's future earnings, and if those forecasts turn out to be too optimistic, Nvidia's stock risks plummeting back to earth. The shares dipped 1.1% to close at $908.88 on Wednesday. \"The biggest concern is the numbers have just gotten so big, so quickly, you just worry they can't last,\" Bernstein analyst Stacy Rasgon said of Nvidia's recent financial performance. \"The more new products they've got coming out at higher performance and higher prices, the more runway they have.\" Nvidia will also likely introduce a raft of updates to its software known as CUDA, which provides tools for developers to run their AI programs on its chips, helping keep developers tied to Nvidia's chips. CUDA makes it harder to switch to components sold by rivals like Advanced Mirco Devices and in-house chips offered by Microsoft and Alphabet's Google. Nvidia last year started offering its chips and software as a cloud service to developers, and analysts are monitoring how the company expands that effort. \"The services side is really a software play,\" said Ryan Shrout of chip analysis firm Shrout Research. He said analysts will closely observe whether cloud and software providers are \"possibly getting nervous about Nvidia playing in their playground.\" CHINA BUSINESS Another critical question is whether Santa Clara, California-based Nvidia will establish a definitive technology advantage over Chinese rivals. Washington has cut off China's access to Nvidia's most advanced chips, and China has responded with chips from Huawei Technologies Co that rival the performance of Nvidia's A100 chip released in 2020. No Chinese company has yet claimed to match Nvidia's current flagship H100 chip released in 2022, and China-watchers expect the forthcoming B100 to leave China further behind. \"When the government developed these controls, they knew very well that companies like Nvidia would be on an almost annual basis making improvements in their silicon, their software coding and their application stack,\" said Jimmy Goodrich, an expert on China and semiconductors. \"Over time, that gap will just become exponentially larger.\" (Reporting by Stephen Nellis and Max A. Cherney in San Francisco; Editing by Matthew Lewis) Apple has quietly added Qi2 charging to iPhone 12. But why didn't it say anything? Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup.  Took four years to build, but can it play Crysis? ANALYSIS: The US and EU argue that Apple is abusing its power to crush competition and blight users’ experience. The iPhone maker says the proceedings threaten the company. Andrew Griffin examines what the row could mean for the technology in your pocket Google is bringing its powerful AI Circle to Search feature to more devices including the older Pixel 6 series, its mid-range tablets and the Pixel Fold.  The Darcula SaaS targets people in 100+ countries, with iMessage and other RCS formats particularly affected. I always get my five a day. Not fruit and vegetables. I mean the “Big Five” technology companies – Alphabet (Google), Amazon, Microsoft, Meta (Facebook) and Apple – which have their fingerprints over almost every aspect of my day-to-day life. And probably yours, too, as their digital infrastructure underpins a significant portion of the internet. Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  In this article, we will take a look at the 15 best 5G stocks to buy according to hedge funds. To see more such companies, go directly to the 5 Best 5G Stocks To Buy According to Hedge Funds. While artificial intelligence (AI) has been dominating headlines, another technological advancement is quietly gaining momentum and […] Fifteen years after it was created, the messaging app runs the world. A $3 iOS app now records better-looking spatial videos than Apple’s native camera app. Spatialify, available on the App Store, lets iPhone 15 Pro owners record 3D videos for Apple’s Vision Pro in either 1080p at 60fps or 4K at 30fps — with HDR.  Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\"  Abby Hensel officially tied the knot in 2021, it has been revealed \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia.  My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation "
}