{
    "title": "The stock every investor is talking about (but is Nvidia a good buy right \nnow?) - MoneyMagpie",
    "date": "3/9/2024",
    "url": "https://www.moneymagpie.com/manage-your-money/the-stock-every-investor-is-talking-about-but-is-nvidia-a-good-buy-right-now",
    "text": "Username or Email Address Password Remember Me  Karl\n\n\n\n 9th Mar 2024\n\n\n\nNo Comments Ai chipmaker Nvidia is now the fourth most valuable publicly traded company in the world. To say its share price has skyrocketed over the past year is a bit of an understatement. But given investors are piling in to buy Nvidia stock are we seeing the signs of another tech bubble? Or will the stock continue to soar given the unprecedented thirst for AI chips? In this article we’re going to take a deep dive in the performance of Nvidia’s share price over the past year or so, and discuss how investors can capitalise on the AI boom. Click on a link to head straight to a specific section, or scroll down for all of the details… Founded in 1993, Nvidia made its name designing and manufacturing graphics processing units (GPU) for the gaming industry after traditional computer processing units were becoming increasingly insufficient . Since then company has expanded into the artificial intelligence (AI) field and has enjoyed stupendous success. Today Nvidia is the world’s leading maker of AI chips with its hardware accounting for roughly 95% of applications in the machine learning sphere. ChatGPT, for example, was trained on 10,000 of Nvidia’s chips. Not only is demand for Nvidia chips red hot right now but thanks to a lack of competition, the firm is also making a massive profit on each chip it sells. Rumour has it that Nvidia makes a 800+% profit on each H100 GPU chip it churns out (assuming a ‘street value’ of around $25,000 to $30,00). Despite Nvidia’s rapid rise to fame, the Californian-based firm didn’t enter the world of AI on a whim. The company had its eye on the sector way back in 2014, with Nvidia’s CEO at the time describing AI as“one of the most exciting applications in high-performance computing”. Clearly he was right, and Nvidia’s gamble has well and truly paid off. Nowadays Nvidia looks pretty much unstoppable thanks to its complete domination of the AI chip market and this is why some analysts are comparing the firm’s extraordinary rise to the likes of Google in the late 1990s, and Apple in the 2000s. Whatever your thoughts on the hype surrounding Nvidia right now, nobody can escape the fact the chipmaker’s value recently surpassed $2,000,000,000,000. That’s two TRILLION dollars (£1.55tn). This is a remarkable valuation, especially when you consider Nvidia was worth less than half of that a year ago. To put Nvidia’s soaring value into in perspective, if you had a time machine and went back to 2019, a single Nvidia share would’ve set you back just $37 USD.  Today one Nvidia share costs $919 (at the time of writing on Friday 8 March 2024), which equates to rise of 383.78% in five years. Over the past 12months Nvidia’s share price is up almost 300%, and up 90% year-to-date. Here at Money Magpie, we can’t tell you whether now is a good time to buy Nvidia shares, or whether it would be wiser to sit tight and wait until the next dip. That’s because when it comes to investing, it’s extremely difficult to accurately predict the direction of a stock, especially in the short-term. Just because a stock has soared in value doesn’t mean it will continue soaring. On a similar note, if a stock has just plummeted in value then it’s just as likely to continue falling as it is to rebound So, while we can’t tell you whether the direction Nvidia stock is heading, what we can do is give you 3 reasons why you should, and 3 reasons why you shouldn’t, load up on Nvidia stock right now… Here are 3 reasons why investors may be tempted to gain exposure to Nvidia: Now we’ve given you some reasons to invest in Nvidia, here are 3 reasons why you shouldn’t: So, while Nvidia is dominating the AI chip market right now, there is no guarantee it will stay in Number 1 spot and if it doesn’t, the value of stock could easily plummet. If you’re interested in gaining exposure to AI there are essentially two ways to go about it. If you’re looking to invest in individual companies, then buying shares directly through an investment broker is the way to do it. Note: If your chosen AI stock is US-based, then there are a few things you need to know – see how to buy US shares in the UK. If you don’t particularly want to invest in a single firm, then buying an AI exchange-traded fund (ETF) can provide an effective and low-cost way to gain exposure to lots of AI stocks at once. Some examples of ETFs focusing on AI include the WisdomTree Artificial Intelligence UCITS ETF, and the L&G Artificial Intelligence UCITS ETF. For more information on adding AI to your portfolio, take a look at our article that explains how to invest in Artificial Intelligence. Do you want to learn more about investing? Sign up for our fortnightly MoneyMagpie Investing Newsletter. It’s free and you can unsubscribe at any time.  Disclaimer: MoneyMagpie is not a licensed financial advisor and therefore information found here including opinions, commentary, suggestions or strategies are for informational, entertainment or educational purposes only. This should not be considered as financial advice. Anyone thinking of investing should conduct their own due diligence. When investing your capital is at risk.  Δ  Δ Join our newsletter Get weekly ideas, deals & freebies New data capture form 2023 \"*\" indicates required fields Δ Your money-making expert. Financial journalist, TV and radio personality.  Jasmine Birtles\n[email protected]\n\nPress & PR Enquiries\n[email protected]\n\nAdvertising Enquiries\n[email protected] The MoneyMagpie Site is intended for reference purposes only and use of the Site and/or the Content is entirely at your own risk. You should always carry out your own research and/or take specific professional advice before choosing any financial products or services or undertaking any business or financial venture. Please note that, whilst we endeavour to provide accurate and useful information, the Content may not be wholly accurate or up-to-date and is subject to change, often at very short notice. Bold links are affiliate links that help fund us to keep writing informative, free articles. We only link to companies and offers that we think are genuinely good. © MoneyMagpie | Web Design by Cariad Marketing Sign up now New data capture form 2023. This is for the popup form to avoid duplicate IDs. \"*\" indicates required fields Δ "
}