{
    "title": "Nvidia Stock Lands On Multiple Buy Lists For 2024",
    "date": "1/4/2024",
    "url": "https://www.investors.com/news/technology/nvidia-stock-lands-on-multiple-buy-lists-for-2024/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Nvidia (NVDA) stock rocketed 239% in 2023, but the party is far from over for the AI-chip maker, Wall Street analysts say. Nvidia was the top performer among the Magnificent Seven stocks in 2023. That makes it the Yul Brynner or Denzel Washington of the group, depending on which version of the film you prefer. But will it be a hero or zero in 2024? At least four Wall Street firms this week put Nvidia stock on their buy lists for 2024. They include Goldman Sachs, KeyBanc Capital Markets, Piper Sandler and Wells Fargo. Piper Sandler analyst Harsh Kumar said Nvidia is his \"top pick\" among large-cap semiconductor stocks for 2024. He rates Nvidia stock as overweight with a price target of 620. On the stock market today, Nvidia stock climbed 0.9% to close at 479.98. Nvidia will continue to gain from strong sales of graphics processing units, or GPUs, to cloud data centers for artificial intelligence applications, Kumar said in a client note Thursday. The company is a prime beneficiary of the generative AI boom, he said. \"We are expecting the GPU accelerator and Gen AI-driven compute markets to perform remarkably well throughout calendar year 2024,\" Kumar said. \"Nvidia maintains a dominant position in its GPU data center products as well as the surrounding hardware, software and networking infrastructure.\" Kumar also likes Advanced Micro Devices (AMD) in the AI space as it increasingly takes on Nvidia. He reiterated his overweight rating on AMD stock and raised his price target to 165 from 150. AMD stock rose 0.5% to close at 136.01 on Thursday. Wells Fargo analyst Aaron Rakers said he prefers Nvidia stock to AMD stock at current levels and sentiment, but has buy ratings on both. In a client note Wednesday, he called Nvidia his \"AI top pick.\" Rakers kept his 675 price target on Nvidia stock. Meanwhile, he raised his target on AMD stock to 165 from 130. KeyBanc analyst John Vinh said Nvidia is one of his \"key stock ideas\" for 2024. He rates Nvidia stock as overweight with a price target of 650. Nvidia \"remains the best positioned play for generative AI,\" he said in a client note Wednesday. \"Despite significant appreciation in 2023 (+239%), we expect outsized AI tailwinds to sustain, supported by growing demand backlog and incremental supply, while possibly still constrained,\" Vinh said. Elsewhere, investment bank Goldman Sachs on Tuesday said Nvidia stock is on its U.S. Conviction List. The firm rates Nvidia as buy with a price target of 625. Nvidia is on two IBD lists: Leaderboard and Tech Leaders. Nvidia stock has formed a flat base with a buy point of 505.48, according to IBD MarketSmith charts. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: Apple Stock Gets Another Downgrade. Why Analysts Are Souring On iPhone Maker. Mobileye Stock Crashes On Weak Year-Ahead Outlook 'AI Is The Story Of The Show': What To Expect From CES 2024 See Stocks On The List Of Leaders Near A Buy Point Find Winning Stocks With MarketSmith Pattern Recognition & Custom Screens 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}