{
    "title": "Nvidia And AMD Are Overhyped And Overvalued",
    "date": "1/23/2024",
    "url": "https://seekingalpha.com/article/4664472-nvidia-and-amd-are-overhyped-and-overvalued",
    "text": "Justin Sullivan Justin Sullivan NVIDIA Corporation (NVDA) and Advanced Micro Devices, Inc. (AMD) are two of the highest flying stocks today. The companies both make GPUs that are in incredibly high demand for AI training. Nvidia is now a $1.5 trillion company, that at its rate of recent returns could soon pass Amazon.com, Inc. (AMZN), if not Alphabet Inc. (GOOG, GOOGL), in size. AMD, which was almost bankrupt in 2015, is now larger than both Cisco Systems, Inc. (CSCO) and Intel Corporation (INTC). As we'll see throughout this article, despite these companies carrying recent S&P 500 (SP500) returns, investing in them now would lead to negative shareholder returns in our view. Nowhere is there my symbolic GPU demand than Meta Platforms, Inc. (META), one of the other largest companies in the world. The company, best known for its massive investments in Virtual Reality, along with its core apps, has announced, through CEO Mark Zuckerberg, that by the end of 2024, the company's GPU infrastructure will include 350k Nvidia H100 GPUs. Mark Zuckerberg also stated, that counting other GPUs, the company's capacity will hit 600k \"H100\" equivalent GPUs, which includes AMD processors, etc. At an estimated retail price of $25-30k (versus a cost to produce of ~$3k), Meta alone is going to be spending almost $9 billion on Nvidia GPUs. It's also worth noting out of ~2 million H100s Nvidia is producing in 2024, 15% will go to Meta. What are the two takeaways from this? For example, in the 3rd quarter of 2023, out of an estimated 500k H100s, estimates are that virtually 100% of them were purchased by large tech companies, with Meta (30%), Microsoft (30%) leading, and Oracle, Tencent, Google, and Amazon with (10%) each. So, the question becomes, what is the potential of this market? Let's set aside a few bases for our viewpoints. (1) The vast majority of this market will be concentrated by several companies. These companies will either be primarily infrastructure providers (i.e., Google Cloud, Microsoft Azure) or they will be service providers with trained models (i.e., Open AI). Given that the most competitive models (i.e., GPT-5) will need an estimated 50k GPUs to be trained ($1.5 billion at current prices), very few companies have the technological know-how and cash to purchase these GPUs and deploy them at scale. Instead, they will go through an infrastructure provider. (2) LLMs (large language models) are currently at the peak of the market. LLM LLM There are many great articles to get an overview of what an LLM is, but fundamentally an LLM ingests massive amounts of text (hence lawsuits Open AI is facing) and then uses that training data to make a \"neural network\" with numerous parameters to predict the next output. he With enough parameters and training they look legitimate for drafting emails for example, but they also make a lot of silly mistakes. ChatGPT isn't smart, and the technology isn't new, but the scale of it and the consumer offering is. Hence why Google was able to build a competing model so fast. We understand this is a contentious topic, but we refer to this quote from Meta's chief AI scientist: LLMs aren't even as smart as dogs, says Meta's AI chief scientist The conclusion from this is that the vast majority of GPU resources will be for LLMs for the foreseeable future. We see this as the \"peak of the market\" in the sense that there's no new AI breakthrough or tech that needs additional long-term resources coming online (that's publicly known about). From this, and other developments in the market, we are concerned about the long-term demand for these GPUs. From #2 alone, the question is how much longer will increased numbers of GPUs be needed. There are already discussions about how GPT-4 from Open AI, is getting worse from each update, with a minimal cost to additional training. Sam Altman, CEO of OpenAI, himself has said that there's minimal benefit from increasing AI size. More so, GPUs don't lose their value instantly. Nvidia's own GPU sales indicate a 5-year lifespan on the GPU, which isn't unreasonable for modern hardware. We question for how many years will Meta need to purchase 200+k GPUs to fulfill its needs. There's already an indication the company is slowing down purchases, with Mark Zuckerberg saying the company will have 350k GPUs by year-end but that it purchased 150k in a single quarter. Current lead times for the GPUs are 9 months - 1 year, which is long, but given the initial craze lends credence to our view that the company won't be able to double or triple sales from here. The rollout of sales from AMD and Google's TPUs, along with Microsoft's AI chip, are more indications of this. As a result, we believe, even optimistically that Nvidia's long-term sales of the GPUs will taper off at 3-5 million units/year. Now, obviously, Meta by itself doesn't represent all GPU demand. However, rumors also exist that Microsoft is slowing down its GPU purchases, and estimated December 2023 Chat GPT users were lower than November 2023, indicating that demand for GPUs for customers won't need to grow as fast. Given that Microsoft + Meta are >50% of Nvidia's GPU purchases, this is a big deal. The next question becomes, what should a great GPU cost? In this sense, by GPUs, we mean the H100 and MI300x hardware accelerators Nvidia and AMD currently sell that are flying off the shelves, along with their peers at other large companies. Already discussed above are the rumors that Nvidia's GPUs are selling with a 90% profit margin at $30k but a $3k production cost. That's what happens when demand is off the charts. However, once that slows down, and production ramps up, where will production settle? Great research has already been done on Seeking Alpha about how the MI300x, currently clocking in faster than the HI300, could come in at ~$20k. AWS, which perhaps showed an early precursor to this with its Graviton CPUs, has said that all 100 of its top largest customers are using its custom silicon given the 40% lower costs. Google's latest TPU, which it has been working on since 2016, costs $1.2 / hour, and the company argues that for one customer it was 4.2x as good per dollar in usage. So, in the long term, what will the profit margins of the GPUs be? It's tough to tell, honestly. One can make the argument that in the long run, the profit margins will go down to what they were before the hype. Another argument is that the market and demand have fundamentally changed. We're more inclined to believe that margins will revert to where they were originally. In our view that would be a ~60% profit margin on each GPU. The downside of the popularity of GPUs is Microsoft, Google, AMD and more are incentivized to spend many billions of dollars building competitive GPUs, something they can all afford. So, at that point, the question becomes what's the value of these companies? Nvidia, before the GPU craze, was at 25% of its current market capitalization, or $1.1 trillion less. AMD was at 35% of its current price, or $180 billion less. We expect 2024 to be Nvidia's strongest year from a profit perspective, where forecasts are for 2 million H100 GPUs sold. Even at 20k profit margin / GPU, that's still only $40 billion, a tough profit to justify a $1.1 trillion valuation gain given we don't see it as sustainable. Our realistic forecast is as follows: - 1.5 million annual H100 GPU sales or the equivalent next generation. Companies having their full supply that they're rushing to buy now, combined with GPU competition slightly lowers sales from the current steady state. Specifically, we are assuming that the LLM market peaks at the current level, meaning demand doesn't grow past the 300-500k units / quarter range. - $3k / GPU profit margin. Nvidia continues to earn a massive 50% profit margin (given its first-mover advantage along with strong software positioning). Specifically, we are assuming that Nvidia's margins revert back to where they were pre-Open AI. - 300k MI300x sales or the equivalent next generation. AMD said it expects $2 billion in 2024 MI300x revenue, or roughly 100k in GPU sales. We do expect that to ramp up as the company undercuts Nvidia on price and expands capacity, albeit delayed, and industry insiders agree. - $2k / GPU profit margin. The company is forced to undercut Nvidia's profit margins given Nvidia's first-mover advantage and better software positioning. This is semi-arbitrary, but we've picked this number based on differences in their margins pre-Open AI ramp. That would imply $4.5 billion in annual profit for Nvidia and $500 million in annual profit for AMD. Even with a generous 20x profit multiple, it's easy to see that both companies would see their recent price appreciations disappear. This would imply Nvidia losing $1 trillion out of their $1.1 trillion market cap gain, a share price drop of ~80%, and AMD losing $170 billion out of its $180 billion market gain, or a share price drop of ~70%. More so, it's worth noting there's still optimism baked into the above assumptions. Google, Microsoft, and Amazon are not companies you want to be considering you their number one competition in terms of their R&D spending, when the competition is in tech. ARM is already expecting to pass a >20% market share in the data center market share thanks to AWS. Given that AWS has a 50% cloud computing market share, that implies that Graviton's CPU market share could be 40%. We see this as being a very realistic market share for Nvidia, Microsoft, and Google's internal GPUs to hit, exacerbated by the fact that for Microsoft / Open AI, they are some of their own largest customers. If nothing else, we expect that to dramatically reduce the profit margins that these GPU manufacturers are seeing. In a market where it seems like there are no interesting growth stocks to invest in, outside of the big tech stocks driving the market, there's a massive amount of capital that's flowing into Nvidia. The fact that Nvidia could pass Google and Amazon in size is a clear example. However, for those who invest today, keep in mind that even for Nvidia to match the S&P 500's long-term return rate, it'll have to hit a $2.5+ trillion dollar market cap by the end of the decade. In a world where that growth is required just to match the market, we find it exceedingly likely that anyone who invests in Nvidia and AMD will see negative returns in our view. As of market open on Monday, January 22, 2024, we will be using vertical PUT spreads to take out short positions on both AMD and Nvidia, greatly expanding the size of existing shorts. An example trade we're looking at: TD Ameritrade TD Ameritrade The above shows a vertical PUT spread on Nvidia where we buy a contract at $600 and sell one for $550. The midpoint is $27 but we're putting in an offer at $25. So what happens here? There are 3 scenarios for Dec. 18, 2026. Scenario 1: Share Price >$600 Scenario 2: Share Price <$550 Scenario 3: Share Price >= $550 <= $600. In Scenario 1, we lose our entire investment in this strategy ($25 / share). In Scenario 2, we double our money, with our $25 / share investment turning to $50 / share. In Scenario 3, we lose $1 / share from that $50 / share profit for each dollar above $550 / share. Our breakeven is at $575 / share. This is an investment where we break even if Nvidia finishes more than 5% below its current price 3 years from now. We are confident that will happen. The largest risk to our thesis of course is that AI continues to evolve into something that humanity can't get enough of. It doesn't just become a way for people to ask Chat GPT questions, get better customer service, or get more accurate answers from Google Search. It fundamentally changes society, with some generative AI, and demand remains so high for so long that Nvidia and AMD outperform. We see this as unlikely. Nvidia, especially, and current AMD were positioned in the right place at the right time. As a result of this, both managed to generate substantial returns for their shareholders, there's no denying that prior Nvidia and AMD shareholders are very happy right now. Unfortunately, Cisco and Intel shareholders were really happy in 2000. The vast majority of investments on Seeking Alpha recommend long, and they tend to outperform. However, it's also because the market as a whole tends to go up, and accurately picking and timing a short is incredibly hard. However, for those who are patient and willing to take the risk, we feel the choice at this point is obvious. Just remember, the market can remain irrational longer than you can remain solvent. Keep in mind with the option investment recommendation above, if we are wrong, you lose 100% of your initial investment. The Retirement Forum provides actionable ideals, a high-yield safe retirement portfolio, and macroeconomic outlooks, all to help you maximize your capital and your income. We search the entire market to help you maximize returns. Recommendations from a top 0.2% TipRanks author! Retirement is complicated and you only get once chance to do it right. Don't miss out because you didn't know what was out there.  We provide: Click for our discounted 2-week free trial! This article was written by The Value Portfolio specializes in building retirement portfolios and utilizes a fact-based research strategy to identify investments. This includes extensive readings of 10Ks, analyst commentary, market reports, and investor presentations. He invests real money in the stocks he recommends. Analyst’s Disclosure: I/we have a beneficial short position in the shares of NVDA, AMD either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}