{
    "title": "Market Rebounds As Nvidia Leads; Bitcoin ETFs, Tesla Fall: Weekly Review",
    "date": "1/12/2024",
    "url": "https://www.investors.com/news/stock-market-rally-rebounds-nvidia-tesla-jpmorgan-bitcoin-etfs-in-focus/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     The stock market rebounded this past week, with the Dow Jones briefly hitting a record high and the S&P 500 nearly doing so. Nvidia led the charge with new AI chips, but many leading stocks flashed buy signals. The SEC OK'd spot bitcoin ETFs, which began trading Thursday. JPMorgan Chase, Citigroup, UnitedHealth and Delta Air Lines helped kick off earnings season. Abercrombie & Fitch, Urban Outfitters, Intuitive Surgical and Dexcom were among companies reporting strong preliminary results or guidance. Boeing sold off on after a 737 Max 9 in-flight incident and the subsequent fallout. The stock market rally revved higher in the latest week amid a flurry of news. The Dow Jones briefly hit a record high while the S&P 500 came within a few points of its all-time high. Nvidia (NVDA) blasted out of a consolidation on its latest AI chips, with a number of leading stocks rebounding from key levels. JPMorgan Chase (JPM), UnitedHealth (UNH) and Delta Air Lines (DAL) were among the big earnings reports, with many medical and retail firms offering preliminary results or guidance. Bitcoin swung up and down as spot ETFs began trading. Treasury yields fell and rate-cut bets rose following key inflation reports. Crude oil fell despite Red Sea and Mideast tensions. Worry about Thursday's hot CPI report evaporated Friday as details from the producer price index indicated more good news for the Federal Reserve's primary inflation rate. Markets now see 83% odds that the Fed will start rate cuts at the March meeting, with Wall Street pricing in a likelihood of 1.75 percentage points in rate cuts for 2024. The CPI inflation rate rose to 3.4% from 3.1%, while the core inflation rate dipped to 3.9% from 4%. Yet while the CPI and core CPI both rose 0.3% on the month, the core PCE price index may rise just 0.15%, Ian Shepherdson, chief economist at Pantheon Macroeconomics, wrote after the release of PPI data. The upshot is that the Fed's key inflation rate, which fell below its 2% target on a six-month annualized basis in November, likely stayed there in December. Nvidia (NVDA) and Advanced Micro Devices (AMD) unveiled chips Monday to run on artificial intelligence on high-end personal computers or AI PCs. NVDA stock blasted out of a base while AMD also rallied. The announcements came on the eve of the CES event in Las Vegas, with Microsoft very much the theme in 2024. Eleven spot bitcoin ETFs began trading Thursday after winning long-awaited SEC approval, including ARK Invest, VanEck, WisdomTree and Fidelity. Grayscale Investments received approval to uplist GBTC and Hashdex was allowed to convert its bitcoin futures ETF into a spot bitcoin fund under the ticker DEFI. Trading volume across all the bitcoin ETFs topped $4.6 billion Thursday, led by GBTC, BlackRock's iShares Bitcoin Trust (IBIT) and the Fidelity Wise Origin Bitcoin Trust (FBTC). Still, the bulk of ETFs lost ground Thursday and were mixed in early trade Friday. Meanwhile, bitcoin reversed after spiking to $49,000 Thursday morning during the ETF launch — its highest price since December 2021. Bitcoin fell below $45,000 Friday morning. Many bitcoin stocks such as Coinbase (COIN) and Marathon Digital (MARA) sold off hard. The FAA on Friday said it will significantly increase oversight of Boeing (BA) manufacturing following an audit of the 737-9 Max. The FAA grounded 737 Max 9 jets on Jan. 6 after an emergency cabin door broke off during an Alaska Air (ALK) flight on Jan. 5. The grounding order affected 171 aircraft. On Monday, United Airlines (UAL) reported finding loose bolts and other parts during its inspections of 737 Max 9 door plugs. The Dow Jones giant fell more than 12% during the week. Supplier Spirit AeroSystems (SPR) saw shares tumble 15%. Boeing archrival Airbus (EADSY) jumped to a record high. Major banks kicked off Q4 results Friday with mixed reports. JPMorgan (JPM) and asset custodian Bank of New York Mellon (BK) beat earnings views, with BK popping and JPM stock erasing initial gains. Bank of America (BAC) and Wells Fargo (WFC) declined after coming short of forecasts. Asset management giant BlackRock (BLK) reported a 17% earnings increase and announced a $12 billion takeover of fund manager Global Infrastructure. BLK is trading in a buy zone for 31-week base. Citigroup (C) beat earnings estimates after earlier announcing various charges. Citi also plans to cut 20,000 jobs. Shares rebounded toward a buy point. The annual J.P. Morgan Healthcare Conference kicked off Monday with a quartet of acquisitions including a $2 billion Johnson & Johnson (JNJ) takeover of Ambryx (AMAM) and a Merck (MRK) pledge to buy Harpoon Therapeutics (HARP) for $680 million. Ambrx is studying antibody drug conjugates, which send toxic chemicals directly to tumor cells. Harpoon is in the immuno-oncology space. Meanwhile, Novartis (NVS) is buying privately held Calypso Biotech for $250 million upfront and Boston Scientific (BSX) will spend $3.7 billion in a takeover of Axonics (AXNX). Also during the conference, numerous companies preannounced their fourth-quarter results. Dexcom (DXCM) and Intuitive Surgical (ISRG) surged on their strong reports, though DXCM slashed gains for the week. TG Therapeutics (TGTX), Regeneron Pharmaceuticals (REGN) and Exelixis (EXEL) delivered lackluster preannouncements. A slew of retail stocks provided business updates Monday ahead of the ICR Conference. Abercrombie & Fitch (ANF), American Eagle Outfitters (AEO) and Urban Outfitters (URBN) jumped on strong holiday sales or upbeat Q4 and full-year guidance. Lululemon Athletica (LULU) raised Q4 guidance to in line with views. Shares fell for the week. Crocs (CROX) gave upbeat revenue guidance, lifting CROX. Shoe retailer Genesco (GCO) tumbled after slashing EPS guidance. Tesla (TSLA) cut prices modestly on the Model 3 and two Model Y variants in China on Friday. China was Tesla's strongest market last year, but the competition continues to increase. Meanwhile, the updated Model 3 is now on sale in North America, after already reaching China and Europe. Tesla didn't adjust prices, even though the Model 3 is no longer eligible for $7,500 tax credits. Tesla will suspend production at its Berlin factory from Jan. 29-Feb. 11, claiming parts delays due to Red Sea shipping issues. Meanwhile, Hertz (HTZ) will unload 20,000 electric vehicles, a third of its current EV fleet, citing weak demand and high collision repair costs. The rental-car giant is dumping the used EVs, mostly Tesla vehicles, at steep discounts. TSLA stock fell sharply. Hewlett Packard Enterprise (HPE) announced the $14 billion all-cash acquisition of Juniper Networks (JNPR), in a move expanding its computer networking business. HPE agreed to pay $40 a share for Juniper. HPE expects the deal to be earnings and free cash flow accretive in the first year post-close. The deal is expected to close in late 2024 or early 2025. HPE in May sold off its stake in H3C, a Chinese joint venture, for $3.5 billion. Although the H3C sale will help finance the Juniper purchase, HPE will still add significant debt in the deal. As part of the deal, HPE will get Juniper's wireless networking business, Mist Systems. HPE tumbled, JNPR soared. UnitedHealth Group topped Q4 estimates, as EPS grew 15% to $6.16 per share, while revenue rose 14% to $94.4 billion. But Jefferies analyst David Windley said that if not for a lower-than-expected tax rate and higher-than-expected interest income, EPS would have fallen 36 cents shy of the FactSet consensus. Spending on medical costs rose to 85% of premiums, above 84.1% views and 82.8% a year ago. UNH stock gapped below its 50-day line. Delta Air Lines (DAL) reported fourth-quarter earnings fell 13% while revenue grew 11% to $13.7 billion, while full-year EPS leapt 95% to $6.25. The carrier guided up on Q1 EPS amid bullish comments on travel in the new year. Its full-year EPS target of $6-7 is in line with analyst views, but doesn't signal much growth and is below some long-term targets. DAL stock tumbled Friday. Chesapeake Energy (CHK) and Southwestern Energy (SWN) agreed to merge in a $7.4 billion deal, marking a major consolidation in the U.S. natural gas sector amid weak prices. Investors will get 0.0867 CHK shares per SWN share, worth $6.69 per share as of Wednesday's close. The combined company will assume a new name when the merger is complete and have a market cap of $24 billion. Southwestern and Chesapeake, both S&P Midcap 400 stocks, were early players in the shale gas boom begun in the early 2000s. Taiwan Semiconductor (TSM) report December sales fell vs. November and a year earlier. The chip foundry giant's revenue slightly topped views, aiding by strong demand for AI chips. Netflix (NFLX) now has more than 23 million subscribers to its ad-supported tier, the streaming giant's ad chief told Variety. NFLX stock rose. KB Home (KBH) reported a 25% EPS decline with revenue off 14% in the November-ended Q4. That slightly beat views, but weak home prices and so-so 2024 guidance disappointed. KBH stock, which hit a long-term high ahead of results, fell slightly for the week. YOU MAY ALSO LIKE: Catch The Next Big Winning Stock With MarketSmith Want To Get Quick Profits And Avoid Big Losses? Try SwingTrader Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Futures Fall; Elon Musk Makes This Tesla Threat 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}