{
    "title": null,
    "date": "1/22/2024",
    "url": "https://finance.yahoo.com/video/why-ai-isnt-everyone-promising-170947633.html",
    "text": "As part of Yahoo Finance's AI Revolution week, Radio Free Mobile Founder Richard Windsor joins Yahoo Finance Live to discuss the outlook for generative AI adoption and corporate valuations. Windsor warns AI hype and competition may spark damaging price wars, making valuations unsustainable. Windsor argues Nvidia (NVDA) is at risk of a \"significant correction\" once the AI hype fades, and advises investors looking for AI exposure to consider Google (GOOG, GOOGL) and Meta (META) because the AI excitement has \"not really been priced in\" to their current valuations. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith BRAD SMITH: Richard, great to finally get you back on here with us. We tried a moment ago. One huge thing that we got to dive into right out of the gate here-- why do you believe that some of the investment is going to perhaps see a bubble burst here this year? That's something that you mentioned to us in your notes. RICHARD WINDSOR: Yeah. OK. The problem you have with artificial intelligence is that the general perception seems to be that the machines have now become much closer to what's referred to as superintelligent. Part of the reason for that is when people talk to these machines, they get the feeling they're talking to an actual person. The reality is that we're no closer to superintelligence, I would believe, than we were 10 years ago. And now while the AI, the generative AI is a big step forward in terms of what you can do with data and what you can do with voice-based services, it isn't what everyone is promising. And what I'm worried about is that combined with the fact that you're going to get massive competition with all of these different services is going to cause-- it's also going to cause a lot of price competition, which means that revenue targets are going to be missed. So what we're saying is to wrap it up, what we're really saying is there is a big use case for artificial intelligence. Yes, it's just not worth the valuations that people are ascribing to them because they think the prices are going to be much higher than they really are. SEANA SMITH: So then given that, Richard, if we do see this bubble that could potentially burst, it sounds like at least in terms of the price valuations for these stocks, what does that mean then for a name like NVIDIA, a name like AMD that is really ridden this hype here to the upside? RICHARD WINDSOR: Well, for NVIDIA, obviously, it would mean a significant correction because what would be likely to happen if you got a correction in valuation? What that would mean is that people would probably start buying less training chips because they would cut their estimates in terms of the revenue that-- or the return that they can have on that investment. So that would mean a significant correction for NVIDIA. It would also mean a correction for AMD. If you look at AMD's valuation compared to the rest of the semiconductor sector, arguably, it's very rich. So I think what you would see is a big correction. Now, the good news for NVIDIA is there are lots of people trying to challenge it in terms of being the AI training place to go, and no one has really laid a glove on the company yet. BRAD SMITH: NVIDIA was the runaway story of 2023. 2024 now, what is the best company that is positioned to perhaps siphon or at least poach some of that demand away? RICHARD WINDSOR: This is the problem. It's going to take a long time because what really has happened is that through 20 years of investment in Cuda-- Cuda is the place where everybody wants to go to train their AI algorithms. And so consequently, they demand NVIDIA. This is why you had Google invite Jensen on stage at I/O. This is why you had Satya Nadella invite Jensen on stage at his plant because his customers are saying if you don't give me NVIDIA's chips, I'm out of here. And that's why these guys are all trying to develop their own chips. The problem is until they get the software platform right and they can start to grab developers from NVIDIA, nothing's going to happen. SEANA SMITH: All right. When we talk about some of the future, I guess, opportunities here then looking forward, the use cases what investors need to keep in mind, they're trying to figure out the best time to buy in. Should they buy in? And what are the top one or two things that you think investors need to keep in mind then in terms of some of what you're saying could be maybe a bit of a disappointment there in terms of valuations, this run up here over the next 12 months? RICHARD WINDSOR: Yeah, that's part of the issue. Now, what I think the first thing to look for is that there are a number of companies out there that have significant exposure to AI, but it's not really been priced in. And I would immediately highlight Google, Meta Platforms, and even if you're feeling exceptionally brave, Baidu out of China. Now, the problem with these as AI of generative AI investments today is this is not where their revenues come from today. And so consequently, you are also making an investment in whatever their current business, so in Google's case is search, Baidu's case, it's Chinese search, and Meta Platforms, it's social media. So you have to be prepared for that, you know. And again, it is going to be a long-term investment. This is part of the problem. If you want to get in on the generative AI craze, NVIDIA at the moment is really the only pure play that's out there, apart from a few other small cap peripheral-like companies. BRAD SMITH: And NVIDIA on the chip side, but there's kind of different pillars to this. Right? There's the chips, there's the models that and the language learning models that sit on top of the chip, and then there's the applications. So of those other two pillars, are there companies that would be runaway market share leaders? RICHARD WINDSOR: Well, yes. Obviously, if you look at where the market share is today, it's OpenAI. The other problem, of course, you've got is the other pure players. They're pretty much all private at the moment, and there's no sign of them going public imminently. And so from that perspective, again, from an investment standpoint, it becomes very, very difficult. Now, the other thing to watch for this year in terms of the AI theme, last year was all about training, which is I'm going to create my model to do wonderful-- to provide wonderful service X or wonderful service Y. This year is the year I think when these models need to start generating traction, traffic, revenue, and that's really what people are going to be look-- that's what I'm looking for in terms of this, in terms of supporting this trend. But, again, I'm a little bit concerned that price erosion for these services may cause revenues to come in softer than expected. SEANA SMITH: Certainly, what shareholders seem to be wanting to see as well. Richard Windsor, always great to get your insight. Radio Free Mobile-- RICHARD WINDSOR: Thank you, Seana. SEANA SMITH: --thank you so much for joining us here this morning. Related Quotes "
}