{
    "title": null,
    "date": "1/30/2024",
    "url": "https://www.streetinsider.com/Hot+List/Kore.ai+secures+%24150+million+in+funding+with+participation+from+NVIDIA+%28NVDA%29/22693898.html",
    "text": "FREE Breaking News Alerts from StreetInsider.com! StreetInsider.com Top Tickers, 3/30/2024 Enterprise-level conversational AI platform Kore.ai announced Tuesday that it has secured $150 million in funding that is set to drive AI-powered experiences for customers and employees of global brands. The investment is led by sector-focused equity investor FTV Capital with participation from NVIDIA (NASDAQ: NVDA), as well as existing investors including Vistara Growth, Sweetwater PE, NextEquity, Nicola and Beedie. The investment will be used to support continuous innovation in AI to deliver business value at scale as well as to accelerate market expansion. \"As we look to enhance our Gen AI-powered innovations and drive wider adoption across a variety of market segments, we are pleased to have the backing of FTV Capital, a firm that has significant experience in our space and invaluable connections across the enterprise to augment our exciting growth trajectory,\" said Raj Koneru, founder and CEO of Kore.ai in a statement. \"We've spent significant time examining the landscape and evaluating advanced-AI platforms, and Kore.ai clearly stood out with its proven enterprise-grade platform capabilities, visionary leadership, strong R&D focus, established global customer base and clear path to profitability,\" added Kapil Venkatachalam, partner at FTV Capital. In recent years, Kore.ai has delivered triple-digit year-over-year growth in revenues. The company automates 450 million interactions a day for about 200 million consumers and two million enterprise users worldwide. In addition to domestic growth, Kore.ai's growth has been fueled by rising demand from emerging markets in Asia Pacific, Europe, LatAm, and the Middle East. As a result, Kore.ai has added new Global 2000 enterprise customers across major verticals. Receive full access to all new and archived articles, unlimited portfolio tracking, e-mail alerts, custom newswires and RSS feeds - and more! "
}