{
    "title": "RTX 4070 Super launch day sales are rumored to be a 'disaster' – what's \ngoing on with Nvidia's new GPU?",
    "date": "1/20/2024",
    "url": "https://www.techradar.com/computing/gpu/rtx-4070-super-launch-day-sales-are-rumored-to-be-a-disaster-whats-going-on-with-nvidias-new-gpu",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Do PC gamers feel 12GB of VRAM is simply not enough for the money in 2024? Update: We’ve heard from Nvidia and the company makes the point that the rumors aired by the YouTube leaker do not represent the full picture of RTX 4070 Super sales. Scan Computers in the UK is one retailer that offers up a different view to MLID’s sources, with CEO Elan Raja noting that: “The RTX 4070 Super has been a great launch at Scan. We’re pleased to have been able to get it in the hands of so many gamers.” Original story follows below... Nvidia’s RTX 4070 Super just came out yesterday, but day one sales might not have been what Team Green wanted to see, we’re told. Moore’s Law is Dead (MLID) on YouTube chewed over the subject of the initial response to the first new Super revamp (two more are inbound), and the feedback from the leaker’s sources is pretty negative. MLID quotes no fewer than six sources (at retailers and distributors) to give us a flavor for interest and sales levels with the RTX 4070 Super (along with others who didn’t want to be quoted). The consensus? That the sales of this graphics card were relatively lackluster on the initial day of release, with stock remaining strong, even with the MSRP models that can often sell out pretty sharpish on launch day. So, that very much wasn’t the case with the RTX 4070 Super, and even on the Nvidia site, the Founders Edition model didn’t sell out. At the time of writing, looking at Newegg for example, RTX 4070 Super stock still appears to be plentiful, with no models out of stock – and both the variants at the MSRP are still available to buy, too. Get the hottest deals available in your inbox plus news, reviews, opinion, analysis and more from the TechRadar team. On top of that, RTX 4070 Super stock is rumored to be a bit lighter than expected – and only ‘decent’ inventory levels were anticipated by MLID’s various insiders in the first place. Meaning that not only is stock still on shelves – at MSRP – but this is with thinner on the ground shipments than expected. Some of the quotes from MLID’s sources include that the RTX 4070 Super launch inventory is about half of what the RTX 4070 witnessed upon its release, and that sales of the new Super are “very low” and only MSRP models are really selling. Other sources commenting on sales go even stronger on the negative side, with one person claiming sales are a “disaster” for day one, and another observing RTX 4070 Super figures were actually worse than the RTX 4080 sales for launch day (yes – ouch). The source who made the disaster comment was from a graphics card maker, and also expressed some frustration at being told by Nvidia to push custom models which are priced over the MSRP, while Team Green sells its Founders Edition for the recommended price direct from its own website. So, what’s going on with the RTX 4070 Super? Well, firstly we need to bear in mind that this is just chatter from the grapevine. It is, however, some pretty consistent chatter that’s largely in agreement, so these are very definitely worrying rumblings. And as noted, stock is visibly staying strong (certainly in the US) for now, so there clearly isn’t any huge rush of demand, that’s for sure. The second thing to bear in mind is that these are just day one sales we’re talking about. Let’s give this graphics card a chance, shall we? Plus, January is traditionally a time when people are maybe struggling a bit more than usual financially (until that first pay packet rolls in). It’s entirely possible that momentum will pick up for the RTX 4070 Super. As indeed MLID points out, the vanilla RTX 4070 was a bit slow out of the gate, but it went on to sell very well (and rank nicely on our list of the best graphics card, where it has now been succeeded by the 4070 Super, we should add). That could happen again here, but there are concerns with the apparent sluggishness of the RTX 4070 Super even at this early stage. Exploring the reasons why PC gamers might not be so keen on Nvidia’s new graphics card, there’s a recurring theme around complaints online, which is that in 2024, 12GB seems like an even shakier loadout than it did with the RTX 4070 last year. What many gamers wanted was an upgrade to 16GB, and the pricing of the RTX 4070 Super, which is upper-mid-range, is really leaving a bad taste in the mouth of some folks given that 12GB of video memory. It’s lacking in future-proofing, and as we point out in our review of the Founders Edition, the VRAM hampers this graphics card’s potential when it comes to 4K gaming. What compounds all this on the value front is that AMD’s RX 7800 XT can now be had at around $500 in the US (again on Newegg), so it’s a clear hundred bucks cheaper than the RTX 4070 Super. Quite simply, that AMD graphics card makes more sense as a value proposition right now (assuming you don’t care about ray tracing, that is, where Nvidia reigns as the undisputed champ, of course). We’ll just have to watch Nvidia’s RTX 4070 Super sales going forward, of course, but we’re already wondering whether pricing will need to be adjusted down the line. Is that something Team Green will be willing to look at if things pan out that way? Well, we can only guess, but MLID also airs a worrying suggestion that future shipments of the RTX 4070 Super may be more skewed to custom models that are pitched above the MSRP – just another niggling doubt to add to the pile here for this revamped GPU. Another option might be to push the RTX 4070 Ti Super harder instead, with its 16GB of VRAM. (That GPU will supposedly have much lesser stock levels to begin with when it comes out, as per previous MLID rumors – allowing for the existing RTX 4070 Ti stock to be cleared). Darren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013). Intel Battlemage leak gives us hope that maybe there’ll be a more powerful 2nd-gen Arc GPU after all Samsung officially reveals GDDR7 memory for GPUs, which is great news for gamers OpenAI's new voice synthesizer can copy your voice from just 15 seconds of audio By Cesar CadenasMarch 29, 2024 By Alex WhitelockMarch 29, 2024 By Wayne WilliamsMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Peter HaylesMarch 29, 2024 By Mackenzie FrazierMarch 29, 2024 By Sead FadilpašićMarch 29, 2024 By Tom PowerMarch 29, 2024 By Mike MooreMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}