{
    "title": "The best CEOs of 2023—Nvidia's Jensen Huang and Microsoft's Satya Nadella \ndeliver huge returns",
    "date": "1/5/2024",
    "url": "https://fortune.com/2024/01/05/best-ceos-of-the-year-nvidia-jensen-huang-microsoft-satya-nadella-jpmorgan-jamie-dimon/",
    "text": "Good morning. Who was the best CEO of 2023? Fortune used to publish an annual Businessperson of the Year list, but stopped in 2020—a year in which Elon Musk took top prize. That frees me to take my own stab this year, which I do here for your Friday enjoyment. I started, as we always do at Fortune, with a screener from data guru Scott DeCarlo, which looked at total returns over the last year and the last three years. Then I added a good dollop of my own judgment, based on my understanding of the role that the CEO and the company played in driving important economic events of the year. My top five: 1. Jensen Huang, Nvidia2. Satya Nadella, Microsoft3. Jamie Dimon, JPMorgan Chase4. Lars Jorgensen, Novo Nordisk5. Sundar Pichai, Alphabet AI is obviously the big driver here, powering three of the five, and providing huge returns to investors. Nvidia offered a stunning 239% return for the year and 280% over three years; Microsoft returned 58% and 73%; and Alphabet returned 58% and 59%. I gave Nadella the edge over Pichai because he played the moment beautifully, partnering with OpenAI in a way his predecessors never would have, and rescuing Sam Altman from his board crisis. (I excluded Altman for failing Board Management 101.). Dimon, of course, emerged from the banking crisis of 2023 as the world’s greatest banker—if he hadn’t already earned that title several times before. He is, without doubt, the GOAT. And Jorgensen rode the other world-changing development of 2023—Ozempic. By the way, Huang topped Fortune’s Business Person of the Year list in 2017—a year in which Dimon took the number two spot—and Nadella topped the list in 2019.  Those three have staying power. Yale’s Jeff Sonnenfeld highlighted his three favorites in a piece for Fortune yesterday—CVS Health’s Karen Lynch, Intel’s Pat Gelsinger, and Salesforce’s Marc Benioff. I am a big fan of all three. But while Benioff offered returns on a par with my top five last year, he had a more lackluster three years. And while Gelsinger and Lynch are both on admirable world-changing missions, they have a ways to go to show success. A few sentimental favorites worth mentioning: ServiceNow CEO William McDermott has something going on that is getting plaudits from customers and employees alike, and also providing an 82% annual return to shareholders. Adobe’s Shantanu Narayen remains the sleeper in the tech crowd. And Occidental’s Vicki Hollub is my favorite among the oil majors, proving you can run a great oil company and care about the climate at the same time. Who/what am I missing? Send me your thoughts, and I’ll share the best next week. Other news below.  Alan Murray@alansmurrayalan.murray@fortune.com Carrefour pulls Pepsi French supermarket chain Carrefour is pulling products from PepsiCo from store shelves in four European countries, as it accuses the food manufacturer of “unacceptable price increases.” Carrefour had earlier blasted PepsiCo for engaging in “shrinkflation,” or reducing product sizes while keeping prices the same. European governments are also pressuring companies to reduce prices to help lower inflation. Fortune Google ends cookies Google is starting to block cookies–a tool that logs internet activity commonly used in internet advertising–from tracking users of its Chrome browser. While the initiative is limited to just 1% of its users for now, Google aims to block cookies for all Chrome users by the end of the year. Yet advertisers complain that they aren’t ready to implement Google’s replacement for cookies–and some allege that the end of cookies will ultimately help Google’s own advertising business. The Wall Street Journal Adani’s return Gautam Adani, founder and chairman of the Adani Group, is once again Asia’s richest person. Adani’s net worth rose to $97.6 billion on the Bloomberg Billionaires Index, putting him slightly ahead of Reliance Industries chair Mukesh Ambani. Adani’s fortunes took a hit following allegations of stock manipulation from short-seller Hindenburg Research, but Indian courts this week declared that no new probes were needed into the Indian conglomerate. Bloomberg Harvard had ‘no choice’ on Gay’s resignation amid plagiarism claims say private equity alums by Luisa Beltran What the heck is going on with headlines on X? by Kylie Robison Commentary: The anti-DEI movement has gone from fringe to mainstream. Here’s what that means for corporate America by Joelle Emerson Neiman Marcus doubled down on working from anywhere after dumping half a billion feet of office space. It has no plans to turn back by Jane Thier Outgoing Morgan Stanley CEO James Gorman, who saved the company after the 2008 financial crisis, gives himself an A– for his 14-year tenure by Paolo Confino Shipping giant Maersk’s stock buoyed by halt of Red Sea journeys following Houthi rebel attacks—but it may be bad news for inflation by Prarthana Prakash This edition of CEO Daily was curated by Nicholas Gordon. This is the web version of CEO Daily, a newsletter of must-read insights from Fortune CEO Alan Murray. Sign up to get it delivered free to your inbox. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}