{
    "title": "Equinix Announces Fully Managed Service for NVIDIA DGX AI Supercomputing",
    "date": "1/24/2024",
    "url": "https://www.prnewswire.com/news-releases/equinix-announces-fully-managed-service-for-nvidia-dgx-ai-supercomputing-302042632.html",
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET Available Now, Equinix Offers Enterprises a Turnkey Private Cloud With NVIDIA DGX SuperPODs News provided by 24 Jan, 2024, 09:00 ET Share this article REDWOOD CITY, Calif., Jan. 24, 2024 /PRNewswire/ -- Equinix, Inc. (NASDAQ: EQIX), the world's digital infrastructure company®, announced a fully managed private cloud service that enables enterprises to easily acquire and manage their own NVIDIA DGX AI supercomputing infrastructure for building and running custom generative AI models. Available immediately, the service includes NVIDIA DGX systems, NVIDIA networking and the NVIDIA AI Enterprise software platform. Equinix installs and operates each customer's privately owned NVIDIA infrastructure and can deploy services on their behalf in key International Business Exchange™ (IBX®) data centers globally. Available immediately, the service includes NVIDIA DGX systems, NVIDIA networking and the NVIDIA AI Enterprise software platform. Equinix installs and operates each customer's privately owned NVIDIA infrastructure and can deploy services on their behalf in key International Business Exchange™ (IBX®) data centers globally. \"To harness the incredible potential of generative AI, enterprises need adaptable, scalable hybrid infrastructure in their local markets to bring AI supercomputing to their data,\" said Charles Meyers, president and CEO of Equinix. \"Our new service provides customers a fast and cost-effective way to adopt advanced AI infrastructure that's operated and managed by experts globally.\" \"Generative AI is transforming every industry,\" said Jensen Huang, founder and CEO of NVIDIA. \"Now, enterprises can own NVIDIA AI supercomputing and software, paired with the operational efficiency of Equinix management, in hundreds of data centers worldwide.\" Scalable Service to Fuel Innovation Across IndustriesThrough the service, enterprises can scale their infrastructure operations to achieve the level of AI performance needed to develop and run massive models. Early access companies using the service include leaders in biopharma, financial services, software, automotive and retail, which are building AI Centers of Excellence to provide a strategic foundation for a broad range of rapidly developing LLM use cases. These include accelerating time to market for new medications, developing AI copilots for customer service agents and building virtual productivity assistants. Easy Access to Privately Managed NVIDIA AI SupercomputingEquinix's fully managed NVIDIA AI supercomputing service enables customers to operate their AI infrastructure in close proximity to their data. The service offers high-speed private network access to global network service providers, enabling quick generative AI information retrieval across corporate wide area networks. In addition, it provides private, high-bandwidth interconnections to cloud services and enterprise service providers to facilitate AI workloads while meeting data security and compliance requirements. Using the service, customers can easily access their NVIDIA AI Enterprise software to streamline the development and deployment of production-grade AI applications, including generative AI.  NVIDIA AI Enterprise includes pretrained models, optimized frameworks and accelerated data science software libraries—such as the NVIDIA NeMo™ framework for building LLMs, NVIDIA RAPIDS™ for data science, NVIDIA Clara for healthcare and NVIDIA TensorRT™-LLM for performance optimization of large language models. Enterprise-Level SupportThe comprehensive solution also features enterprise-grade support and security. This includes Equinix's IBX data center professionals to help customers rapidly build and deploy their custom AI models, as well as access to NVIDIA AI experts. AvailabilityThe fully managed private cloud service is available today. To learn more, visit the Equinix webpage or contact your NVIDIA representative or systems integrator to learn more. About EquinixEquinix (Nasdaq: EQIX) is the world's digital infrastructure company®. Digital leaders harness Equinix's trusted platform to bring together and interconnect foundational infrastructure at software speed. Equinix enables organizations to access all the right places, partners and possibilities to scale with agility, speed the launch of digital services, deliver world-class experiences and multiply their value, while supporting their sustainability goals. Forward-Looking StatementsThis press release contains forward-looking statements that involve risks and uncertainties. Actual results may differ materially from expectations discussed in such forward-looking statements. Factors that might cause such differences include, but are not limited to, risks to our business and operating results related to the current inflationary environment; foreign currency exchange rate fluctuations; increased costs to procure power and the general volatility in the global energy market; the challenges of acquiring, operating and constructing IBX® and xScale® data centers and developing, deploying and delivering Equinix products and solutions; unanticipated costs or difficulties relating to the integration of companies we have acquired or will acquire into Equinix; a failure to receive significant revenues from customers in recently built out or acquired data centers; failure to complete any financing arrangements contemplated from time to time; competition from existing and new competitors; the ability to generate sufficient cash flow or otherwise obtain funds to repay new or outstanding indebtedness; the loss or decline in business from our key customers; risks related to our taxation as a REIT and other risks described from time to time in Equinix filings with the Securities and Exchange Commission. In particular, see recent and upcoming Equinix quarterly and annual reports filed with the Securities and Exchange Commission, copies of which are available upon request from Equinix. Equinix does not assume any obligation to update the forward-looking information contained in this press release. NVIDIA NeMo™, NVIDIA RAPIDS™ and NVIDIA TensorRT™ LLM are trademarks of NVIDIA Corporation. SOURCE Equinix, Inc. Equinix, Inc. (Nasdaq: EQIX), the world's digital infrastructure company®, today filed an 8-K and announced that the Audit Committee of the company's ... Equinix, Inc. (Nasdaq: EQIX), the world's digital infrastructure company®, today announced a planned leadership transition effective late Q2 2024... Computer & Electronics Computer Software Computer Software Networks "
}