{
    "title": null,
    "date": "1/7/2024",
    "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-rose-strong-074301632.html",
    "text": "ClearBridge Investments, an investment management company, released its “ClearBridge Large Cap Growth Strategy” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. For both the quarter and the whole year, the Strategy exceeded the benchmark, the Russell 1000 Growth Index, supported by robust Magnificent Seven stock selection, opportunistic management of earnings reset names, and diverse non-tech contributions. The Strategy posted gains across 10 out of the eleven sectors in which it was invested, on an absolute basis. Overall stock selection contributed to performance on a relative basis. In addition, please check the fund’s top five holdings to know its best picks in 2023. In its Q4 2023 investor letter, ClearBridge Large Cap Growth Strategy featured stocks such as NVIDIA Corporation (NASDAQ:NVDA). Headquartered in Santa Clara, California, NVIDIA Corporation (NASDAQ:NVDA) provides computer graphics processors, chipsets, and related multimedia software. On January 5, 2024, NVIDIA Corporation (NASDAQ:NVDA) stock closed at $490.97 per share. One-month return of NVIDIA Corporation (NASDAQ:NVDA) was 5.30%, and its shares gained 214.16% of their value over the last 52 weeks. NVIDIA Corporation (NASDAQ:NVDA) has a market capitalization of $1.213 trillion. In its fourth quarter 2023 investor letter, ClearBridge Large Cap Growth Strategy stated the following regarding NVIDIA Corporation (NASDAQ:NVDA): \"Much of that differential can be attributed to the performance of the Magnificent Seven (Alphabet, Amazon.com, Apple, Meta Platforms, Microsoft, Nvidia and Tesla), a basket of mega cap growth stocks that accounted for 47.8% of the benchmark return for the quarter and 65.4% for 2023. The ClearBridge Large Cap Growth Strategy maintains exposure to six of the seven stocks, with overweights in Amazon.com, Meta and NVIDIA Corporation (NASDAQ:NVDA). Those three stocks, as well as Microsoft, were among the leading contributors to Strategy performance for the quarter. Microsoft and Nvidia continued to be supported by strong execution and leadership positions in the implementation of generative artificial intelligence (AI). These are high-quality, cash flow generative businesses that we will continue to own, actively adjusting our positioning sizes based on risk/reward and portfolio construction priorities. With Nvidia shares more than tripling in 2023, we opportunistically took profits throughout the year, an approach that continued in the fourth quarter with additional trims that brought the position down to 6% of overall assets. Active management of our mega cap exposure contributed to the Strategy outperforming the benchmark both in the fourth quarter and through the narrow leadership market of 2023. We also attribute these improved results to solid stock picking, being opportunistic in adding to or initiating new positions in growth companies at or near the bottom of their earnings cycle, and maintaining a commitment to diversification across our three buckets of growth: select, stable and cyclical.\" Photo by Christian Wiediger on Unsplash NVIDIA Corporation (NASDAQ:NVDA) is in fifth position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 180 hedge fund portfolios held NVIDIA Corporation (NASDAQ:NVDA) at the end of third quarter which was 175 in the previous quarter. We discussed NVIDIA Corporation (NASDAQ:NVDA) in another article and shared best tech stocks to buy according to billionaire Ken Griffin. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 12 Best Solar Power Stocks To Invest In According to Financial Media 20 Most Trusted Brands In The US 20 Best Beer Countries Heading into 2024 Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}