{
    "title": null,
    "date": "1/14/2024",
    "url": "https://www.fool.com/investing/2024/01/14/stock-split-watch-is-nvidia-next/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Nvidia (NVDA 0.12%) has split its stock five times since 2000. The most recent split was July 2021, when the company issued a 4-for-1 stock split -- meaning shareholders received four shares for every one share they held. Stock splits are not free shares and don't change the overall value of the company. The main benefit of a stock split is that it makes a company's shares more affordable, and therefore more available to be purchased by a wider base of investors, especially those who can't buy fractional shares through their broker. Many investors may want to invest in Nvidia but may not be able to afford to buy a single share after last year's performance. The shares soared 239% in 2023 and currently sit at $531. The last time Nvidia split its stock, the shares were trading at $748 -- a post-split price of $187. Nvidia shares may only get more expensive in 2024. Here's why Nvidia is positioned to have another big year of growth, and why that increases the chance of another stock split. The demand for Nvidia's graphics processing units (GPUs) has been off the charts. In the fiscal third quarter, revenue more than tripled compared to the year-ago quarter, primarily driven by demand for its H100 data center GPU. Competition will heat up this year from Advanced Micro Devices and Intel in the AI chip market, but Nvidia continues to plow more resources into innovation that has major corporate customers lining up to install its new chips in their data centers.  In November, Nvidia announced the new H200 chip, which is specifically designed to process massive amounts of data to train large language models for generative AI applications, among other advanced computing needs. Nvidia says the H200 is twice as fast as the H100 for AI inferencing, the process by which computers learn to make predictions on their own from new data. Nvidia said that cloud service providers drove about half of its data center revenue in fiscal Q3. Amazon Web Services, Alphabet's Google Cloud, Microsoft Azure, and Oracle Cloud are already on board to offer H200-powered AI processing to their customers next year. Although Nvidia's revenue growth is expected to slow in the near term, it's still going to put up strong double-digit growth rates. Not only is it selling every chip it makes, but management mentioned on the November earnings call that it would expand its offering and release new products faster to meet growing demand across a range of AI opportunities. Nvidia has strong relationships with all of the major cloud service providers. Its innovation and long history of specializing in GPU development means it can price its chips at a premium. This is bolstering Nvidia's profit margin and fueling robust earnings growth. While analysts expect Nvidia to post revenue growth of 56% this year, earnings per share are projected to increase by 66%. Those estimates would represent a significant slowdown from the triple-digit growth rates we've seen in recent quarters. But the stock could still be a bargain. Nvidia shares are trading at a forward price-to-earnings ratio of just 25 times next year's earnings estimate. That's less than half the growth of the company's earnings, which is usually a good signal that a growth stock is undervalued. Growing demand for AI chips should keep Nvidia in growth mode. A relatively modest valuation sets the stage for the share price to move higher, and therefore increases the chances of another split. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Ballard has positions in Advanced Micro Devices and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, Nvidia, and Oracle. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short February 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}