{
    "title": "Better Artificial Intelligence (AI) Stock: Nvidia vs. AMD",
    "date": "1/19/2024",
    "url": "https://www.fool.com/investing/2024/01/19/better-artificial-intelligence-ai-stock-nvidia-vs/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Artificial intelligence (AI) stocks were on fire on the market in 2023, especially chipmakers Nvidia (NVDA 0.12%) and Advanced Micro Devices (AMD 0.50%), which saw their shares jump significantly on the back of the booming demand for AI chips. These two chip stocks could have another solid year in 2024 thanks to AI. Investment bank UBS predicts that sales of AI-focused graphics processing units (GPUs) and chips could rise 60% annually between 2022 and 2027. It adds that the AI chip market could generate annual revenue of a whopping $165 billion in 2027 as compared to just under $16 billion in 2022. The investment banking firm also adds that semiconductor companies could witness a 25% jump in revenue and a 50%-plus jump in operating profit in 2024. So, shares of Nvidia and AMD could continue to head higher this year. But if you were to choose one of these two stocks to capitalize on the AI boom, which one should you be buying? Let's find out. Nvidia's fiscal 2024 will end this month. The chip giant's revenue for the first nine months of the year and its fiscal Q4 guidance indicate that it is set to report $59 billion in revenue for the year. That would be more than double the $27 billion revenue Nvidia reported in the previous fiscal year. This eye-popping growth can be attributed to the AI chip boom and the company's impressive share of this market. Given that Nvidia is expected to control a whopping 85% of the market for AI chips this year, according to investment banking firm Raymond James, it is set to make the most of this market's outstanding growth this year and in the long run. The firm projects Nvidia will generate $65 billion in revenue from sales of AI chips in fiscal 2025. That wouldn't be surprising, as Nvidia is leaving no stone unturned to ensure that it remains the dominant player in the AI chip market. From aggressively ramping up the supply of AI chips to introducing new and more powerful chips this year to making China-specific chips to tap the AI opportunity in that market, there are multiple reasons Nvidia is likely to sustain its solid position in AI chips. More importantly, the company is now looking to boost its reach in other niches of the AI market as well, such as AI personal computers (PCs). Nvidia recently released new consumer-class graphics cards aimed at helping users generate AI videos and images faster, as well as running AI inference applications on the latest large language models. Analysts are anticipating Nvidia's revenue to rise an impressive 54% to $91 billion in the new fiscal year, which will begin next month.  NVDA Revenue Estimates for Current Fiscal Year data by YCharts This impressive revenue jump explains why the company's forward price-to-sales ratio of 23 is lower than its current sales multiple of 30. Multiplying the forward price-to-sales multiple with Nvidia's estimated revenue for fiscal 2025 points toward a market cap of almost $2.1 trillion. That would be a 55% jump from current levels, indicating that Nvidia's AI-fueled surge is here to stay. While Nvidia should generate a massive amount of revenue from selling AI chips this year, AMD forecasts AI-related revenue of just $2 billion in 2024. That's not surprising given that Nvidia controls the major chunk of this market thanks to its early move into AI chips, which gave it terrific pricing power. On the basis of AI-driven revenue alone, Nvidia looks like the better bet. But at the same time, investors shouldn't forget that AMD has set its sights on the lucrative AI chip opportunity with its MI300X AI accelerator, which it claims can outperform Nvidia's flagship H100 data center GPU. Specifically, AMD claims that its AI accelerators are 1.6 times faster than Nvidia's chips. The chipmaker also says that the MI300X could train bigger AI models than its Nvidia counterpart. However, it remains to be seen if that claim could give AMD's AI business a bigger-than-expected boost. The good part is that AMD's latest AI chips will be deployed by multiple server OEMs (original equipment manufacturers) and cloud service providers, including the likes of Microsoft, Oracle, Dell, and Hewlett Packard Enterprise, among others. Another factor in AMD's favor this year is that it could benefit from an increase in advanced chip packaging capacity from the likes of Taiwan Semiconductor Manufacturing Company, which could allow the company to boost production of AI chips and help fill the supply shortage in the end market. All this indicates why AMD is anticipating its AI revenue to multiply nicely compared to last year's level of $400 million, but it cannot be denied that the company still has a lot of catching up to do. We have already seen that Nvidia's dominance of the AI chip market is likely to translate into 50%-plus revenue growth in fiscal 2025 (which will coincide with the majority of calendar 2024). AMD's revenue, on the other hand, is expected to grow at a much slower pace of 17% in 2024 to $26.4 billion. This slower growth explains why AMD is relatively cheaper than Nvidia with a price-to-sales ratio of 11. Moreover, AMD's forward sales multiple of 9 points toward a market cap of $238 billion after a year, based on its estimated 2024 revenue. That doesn't point toward a big jump from current levels, which probably explains why the 39 analysts covering AMD have a median price target of $145 -- 1% below the current stock price. Of course, AMD stock could be rewarded with a higher multiple if it can grow at a faster pace, assuming its AI business accelerates strongly. However, on current form and 2024 prospects, Nvidia seems like the better AI stock of the two, especially considering the potential upside it could deliver. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Microsoft, Nvidia, Oracle, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}