{
    "title": "Gartner differs from other analysts over Nvidia ...",
    "date": "1/16/2024",
    "url": "https://www.eenewseurope.com/en/gartner-differs-from-other-analysts-over-nvidia/",
    "text": "MENU Gartner’s view is that the global semiconductor revenue in 2023 declined to US$533 billion, a drop of 11.1 percent compared with 2022. Gartner asserts that Intel gained the top position because memory component weakness hit South Korean chip companies Samsung and SK Hynix. Gartner does see Nvidia rising dramatically up the ranking with a annual semiconductor revenue growth of 56.4 percent. However, this represents total sales of just US$24 billion putting Nvidia fifth. This rise is not as large as that charted by other analysts. Semiconductor Intelligence forecast Nvidia would almost double revenue in 2023 to US$52.9 billion and overtake Intel (see Nvidia set to become top chip company this year). Nvidia itself reported net sales of US$18 billion in its financial year Q3 and forecast sales of $20 billion in its financial Q4, which would be $38 million in the back half of the year. Another market analyst TrendForce reckons Nvidia has been the largest fabless chip company through the middle of 2023 with sales in 2Q23 of US$11.3 billion and of $16.5 billion in 3Q23. TrendForce puts Nvidia well ahead of Qualcomm and Broadcom – unlike Gartner. Gartner sees STMicroelectronics as a strong performer in 2023 climbing three positions to eight with sales of US$17 billion, driven by a strong position in the automotive segment. Top 10 semiconductor vendors ranked by worldwide revenue in 2023 (billions of US dollars). Source: Gartner. Revenue for memory products – essentially DRAM and NAND flash – declined 37 percent in 2023 on weakness in the smartphone and PC markets. DRAM revenue declined 38.5 percent to US$48.4 billion and NAND flash revenue decreased by 37.5 percent to US$36.2 billion. Nonmemory revenue declined by 3 percent in 2023. “Unlike the memory vendors, most non-memory vendors experienced a relatively benign pricing environment in 2023,” said Gartner analyst Joe Unsworth, in a statement. “The demand for non-memory semiconductors for AI applications was the strongest growth driver, with the automotive sector – especially electric vehicles – defense and aerospace industries, also outperforming most other application segments.” www.gartner.com Nvidia triples Q3 sales, confirms chip leadership Nvidia set to become top chip company this year Intel breaks into foundry top ten in 3Q23 ranking All material on this site Copyright © 2022  European Business Press SA. All rights reserved. "
}