{
    "title": "Earnings week ahead: NVIDIA, Walmart, Home Depot, Lucid and more",
    "date": "2/18/2024",
    "url": "https://seekingalpha.com/news/4068269-earnings-week-ahead-nvidia-walmart-home-depot-lucid-medical-properties-trust-and-more",
    "text": "MicroStockHub/iStock via Getty Images Despite a holiday-shortened week, investors have their plates full with a diverse range of earnings reports across various sectors. Tech leaders NVIDIA (NASDAQ:NVDA) and Palo Alto Networks (NASDAQ:PANW) will be in focus, alongside retail giants Walmart (NYSE:WMT) and The Home Depot (NYSE:HD), offering insights into consumer behavior. The healthcare sector will see updates from Moderna (NASDAQ:MRNA) and Teladoc Health (TDOC), while Medtronic (MDT) will provide insights into the medical device industry. In the real estate sector, Realty Income (O) and VICI Properties (VICI) are set to share updates. EV makers Lucid Group (LCID) and Rivian Automotive (RIVN) will offer insights into the electric vehicle market. From the mining sector, Newmont (NEM) and Pan American Silver Corp. (PAAS) will report, and the energy sector will see updates from Chesapeake Energy (CHK), Dominion Energy (D), Suncor Energy (SU), EOG Resources (EOG) and Cheniere Energy (LNG). Warner Bros. Discovery (WBD) will provide insights into the entertainment sector, while Etsy (ETSY) and Wayfair (W) will give updates on e-commerce trends. Financial sector updates will come from Main Street Capital (MAIN) and Blue Owl Capital (OBDC). Below is a rundown of the major quarterly updates anticipated in the week of February 19 to February 23: The U.S. stock market closed in observance of the President's Day holiday. Walmart (WMT) is set to begin the week's major earnings reports with its Q4 release during premarket hours on Tuesday. The Arkansas-based retail giant has seen its shares rise 7% on a YTD basis, aligning with the S&P's strong start in 2024. Headed into the results, analysts anticipate a year-over-year decline in EPS despite expected revenue growth. Market sentiment on Walmart is mixed, with sell-side analysts recommending a Buy, while Seeking Alpha's Quant Rating system suggests a Hold. JR Research, an SA Investing Group Leader, highlighted Walmart's (WMT) achievements in reaching new highs and its focus on growth through e-commerce, advertising and automation. The management's announcement of a 3-for-1 stock split aims to enhance investor access, the firm stated. JR Research sees Walmart as a growth story driven by operating leverage. However, the analyst advised investors to await a steeper pullback, as Walmart's valuation is currently above its 10-year average, suggesting a more cautious approach. Home Depot (HD) joins Walmart (WMT) on Tuesday, with its Q4 results also set to come out in premarket hours. The Atlanta-based home improvement retailer has seen its shares rise 4% since the beginning of 2024. Seeking Alpha's analysts and sell-side analysts maintain a broadly bullish outlook on Home Depot, recommending a Buy. However, Seeking Alpha's Quant Rating system takes a more cautious stance with a Hold rating. In comparison to its peer Lowe's, Seeking Alpha author Marcel Knoop finds Home Depot to be of higher quality. This is supported by Home Depot's consistent outperformance in same-store traffic growth, except in 2020. While both companies generate high returns on capital, the analyst noted that only Home Depot grows its capital base. Marcel believes Home Depot is slightly overvalued, while Lowe's is undervalued at current prices. Also reporting: Realty Income (O), Teladoc (TDOC), Medtronic (MDT), Chesapeake Energy (CHK), Palo Alto Networks (PANW), SolarEdge Technologies (SEDG), Diamondback Energy (FANG), Pan Am Silver (PAAS), Public Storage (PSA), Barclays PLC (BCS), Caesars Entertainment (CZR), RingCentral (RNG), Fluor (FLR), Toll Brothers (TOL) and more. Nvidia (NVDA) is gearing up to announce its Q4 results after the closing bell on Wednesday. The semiconductor company's shares have surged over 47% so far in 2024. Wall Street firms have praised Nvidia, with Loop Capital initiating coverage with a Buy rating and a new Wall Street-high price target of $1,200, implying a 60% upside from its levels when the call was announced. Amid the AI hype, analysts expect both EPS and revenue to grow triple digits Y/Y. NVIDIA has recently disclosed investments in U.K. chip designer Arm Holdings (ARM), voice AI recognition firm SoundHound AI (SOUN) and Chinese self-driving truck maker TuSimple (TSPH). SA Investing Group Leader Paulo Santos takes a contrarian stance, suggesting a Sell on Nvidia (NVDA) despite Strong Buy ratings from Wall Street analysts and a Hold rating from Seeking Alpha's Quant Rating system. Santos's recommendation is based on UBS' warning regarding potential growth issues due to decreased lead times for Nvidia's GPU orders. These lead times have shortened from 8–11 months to 3–4 months, Santos notes, signaling a potential peak in future growth for the company. While Nvidia's current growth appears robust, Santos believes the stock may not be priced to account for the end of its growth cycle, posing a risk for investors. Lucid Motors (LCID) is set to report its Q4 earnings after the closing bell on Wednesday. Following a 67% slump in shares over a 12-month period and a nearly 13% drop so far in 2024, opinions on the stock differ. Wall Street analysts and Seeking Alpha's Quant Rating System lean towards Hold. Meanwhile, Seeking Alpha analyst KM Capital rates it as Sell, saying that the stock's negatives outweigh the positives. On Thursday, Lucid Group announced price cuts on key electric vehicle models for the third time in seven months, aiming to address concerns about demand and affordability in the EV sector. SA author Dair Sansyzbayev maintains an extremely bearish stance on Lucid, noting that his outlook for 2023 has been validated by the stock's 70% price decline over the last twelve months. Sansyzbayev highlights that Lucid's EV sales growth lags behind competitors, indicating a struggle in the luxury segment. His valuation analysis suggests that the stock still has significant room to decline. Also reporting: Medical Properties Trust (MPW), Etsy (ETSY), Suncor Energy (SU), Marathon Oil (MRO), Rivian Automotive (RIVN), First Majestic Silver (AG), Mosaic (MOS), Analog Devices (ADI), Exact Sciences (EXAS), Sunrun (RUN), Exelon (EXC), Synopsys (SNPS), Garmin (GRMN), Five9 (FIVN), Cheesecake Factory (CAKE), Repligen (RGEN), Joby Aviation (JOBY) and more. Massachusetts-based vaccine manufacturer Moderna (MRNA) is expected to report its Q4 results before the opening bell on Thursday. Analysts anticipate a more-than-50% decline in top-line revenue following the peak of COVID-19 vaccine sales. Looking at the stock price, the pharmaceutical giant's shares have declined by approximately 50% over the past 12 months. Seeking Alpha's Quant Rating system recently upgraded its outlook on the stock from Sell to Hold, while Wall Street analysts maintain a consensus Buy recommendation. However, SA Investing Group Leader Stone Fox Capital holds a pessimistic Sell view. Stone Fox Capital suggests that Moderna's CEO's 2025 turnaround plan may have been overly optimistic, as the biotech faces challenges in 2024, including declining Covid vaccine sales and RSV vaccine sales. Also reporting: Arcadium Lithium (ALTM), Block (SQ), Iron Mountain (IRM), Newmont Goldcorp (NEM), MercadoLibre (MELI), Dominion Energy (D), Wheaton Precious Metals (WPM), Nutrien (NTR), EOG Resources (EOG), Fiverr (FVRR), Booking Holdings (BKNG), Intuit (INTU), Rocket Companies (RKT), Pioneer Natural Resources (PXD), MP Materials (MP), Intellia Therapeutics (NTLA), Coterra Energy (CTRA), Pembina Pipeline (PBA), Wayfair (W), Universal Display (OLED), Teck Resources (TECK), BioMarin Pharmaceutical (BMRN), PG&E (PCG), NovoCure (NVCR), Carvana (CVNA), Live Nation (LYV), Hyatt Hotels (H), and more. Warner Bros. Discovery (WBD) is set to report its Q4 financial data before the opening bell on Friday. Seeking Alpha's Quant Rating system upgraded the stock, which has lost about 12% so far this year, from Sell to Hold in the last week of January. Both Wall Street and Seeking Alpha analysts remain bullish on the stock, maintaining a Buy rating. SA Investing Group Leader The Value Portfolio recommends Warner Bros. Discovery as a top investment pick for 2024. This is due to its unique content portfolio and strong cash flow generation. Also reporting: Frontier Communications Parent (FYBR), Gray Television (GTN), AerCap (AER), Hudbay Minerals (HBM), Bloomin' Brands (BLMN), Lamar Advertising (LAMR) and more. "
}