{
    "title": "The AI Duel: How AMD's Secret Weapon Challenges Nvidia's Throne",
    "date": "3/3/2024",
    "url": "https://investorplace.com/market360/2024/03/the-ai-duel-how-amds-secret-weapon-challenges-nvidias-throne/",
    "text": " Consider a two-pack of AI-hardware superstars with AMD and NVDA Advertisement Source: JHVEPhoto / Shutterstock.com Advanced Micro Devices (NASDAQ:AMD) might seem like it’s playing second fiddle to chip maker Nvidia (NASDAQ:NVDA). However, it’s a mistake to overlook AMD stock in 2024, and we’re assigning it an “A” grade. We recommended staying long with NVDA stock prior to Nvidia’s fourth-quarter fiscal 2024 earnings report. Hopefully, you listened and profited handsomely from that successful call. Like Nvidia, AMD provided good quarterly results. AMD’s revenue increased by 10% YoY in Q4 2023. Nvidia’s exceptional quarterly results may overshadow AMD for some investors. That’s a shame, as the same market catalysts that could benefit Nvidia should also provide growth opportunities for AMD. Before we delve into Nvidia versus AMD, we should direct your attention to a news item that hardly anyone’s talking about. Specifically, AMD is partnering with interoperability platform Wormhole. Through this collaboration, the two companies will deploy AMD’s accelerators to support the development of multi-chain applications. According to the press release, this partnership represents AMD’s “strategic move into the Web3 space.” At the same time, it’s also AMD’s foray into the blockchain, or more specifically, blockchain-network security and trust enhancement. AMD seeks to “leverage its hardware expertise to accelerate blockchain interoperability and enhance security” through the collaboration with Wormhole. Where is all of this leading? Eventually, AMD and Wormhole envision the “deployment of zero-knowledge light clients across major blockchains.” That’s a long-term goal, of course, and it won’t be achieved tomorrow or next week. Nevertheless, if you’re generally bullish on the blockchain, stay tuned as AMD and Wormhole are poised to make waves in this space. It was a shot heard around the world. As Nvidia released its blockbuster Q4 FY2024 results, CEO Jensen Huang declared that “Accelerated computing and generative AI have hit the tipping point.” Huang added, “Demand is surging worldwide across companies, industries and nations.” Clearly, this demand surge should benefit not only Nvidia, but rival AI-hardware designer AMD, as well. This explains why AMD stock jumped along with NVDA stock (albeit not quite as high) after Nvidia released its quarterly earnings report. This was a “sigh of relief” moment for AI chip makers and not just for Nvidia’s shareholders. Huang isn’t the only chief executive with a notable quote, by the way. AMD CEO Lisa Su famously estimated that the value of the AI-chip market could expand to $400 billion in the next four years. Thus, what’s positive for Nvidia is also positive for AMD in the long run. There’s room for more than one competitor in this space, even if Nvidia is often seen as the market leader. To quote a Barron’s report, AMD is “widely viewed as offering the one clear alternative to” Nvidia’s graphics processing units. Huatai Research analyst Purdy Ho elaborated on this important point. He believes that “AMD’s MI300 is one of the most competent products poised to challenge Nvidia.” Moreover, on the topic of AI chips, Ho reported that Lamini AI “has announced the receipt of MI300 and plans to use it in training large models.” Even while Nvidia is the darling of the market, AMD stock certainly has the potential to rally in 2024 and deserves an “A” grade. AMD’s collaboration with Wormhole could be a quiet but impactful game-changer. The AI-hardware market’s “tipping point” should benefit both Nvidia and AMD this year and in the coming years. Therefore, investors should consider owning shares of both companies for a double-shot of AI power in their portfolios. On the date of publication, Louis Navellier had a long position in NVDA. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Artificial Intelligence, Semiconductor, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/03/the-ai-duel-how-amds-secret-weapon-challenges-nvidias-throne/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Hot Stocks Stocks to Buy Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}