{
    "title": "Tech giants’ share price boom: how to find the next Nvidia",
    "date": "3/5/2024",
    "url": "https://www.townsvillebulletin.com.au/business/tech-share-price-bonanza-prompts-investors-to-search-for-next-nvidia/news-story/c2eae6b6273ff1b3045a4a5e3b7dc35c",
    "text": "The AI juggernaut has taken The AI juggernaut has taken Full Digital Access $4 charged for the first 4 weeks, then $28 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. New customers only. Prices after the introductory pricing period may be varied as per full Terms and Conditions. See www.townsvillebulletin.com.au/subscriptionterms for full details. Full Digital Access 12 Month Plan costs $208 (min.cost) for the first 12 months, charged as $16 every 4 weeks. This automatically renews after the first 12 months to be charged as $16 (min. cost) every 4 weeks unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions.  See www.townsvillebulletin.com.au/subscriptionterms for full details. Full Digital Access $4 charged for the first 4 weeks, then $28 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. New customers only. Prices after the introductory pricing period may be varied as per full Terms and Conditions. See www.townsvillebulletin.com.au/subscriptionterms for full details. Ooops, an error has occurred! Please call us on 1800 070 535 and we’ll help resolve the issue or try again later. Any Questions? Please call 1800 070 535. Monday to Friday 7:30am – 6:00pm, Saturday & Sunday 7:00am – 11:30am (AEST) "
}