{
    "title": "Nvidia's stock market value rose $273 billion in a day",
    "date": "3/6/2024",
    "url": "https://www.ept.ca/2024/03/nvidias-stock-market-value-rose-273-billion-in-a-day/",
    "text": "By Associated Press \t\t\t\t\t   March 6, 2024 Nvidia’s stock price jumped 16% on Thursday of last week, increasing the company’s market value by a staggering $273 billion in just one day, a record amount. The chipmaker has been seeing soaring demand for its semiconductors, which are used to power artificial intelligence, or AI applications. The company’s revenue more than tripled in the latest quarter compared with the same period a year earlier. It’s the latest sign that the excitement surrounding artificial intelligence likely won’t subside anytime soon. Nvidia, which has positioned itself as one of the most prominent players in AI, has been producing some eye-popping numbers. A sign for a Nvidia building is shown in Santa Clara, Calif., May 31, 2023. The chipmaker posted stronger-than-expected results for its latest quarter and provided further evidence that the excitement surrounding artificial intelligence likely won’t subside anytime soon. (AP Photo/Jeff Chiu, File) $273 billion The amount Nvidia Corp.’s market value increased on Thursday alone, according to FactSet. The previous record one-day jump was Meta Platform’s gain of $205 billion on Feb. 2 of this year. In other words, Nvidia’s one-day gain is more than the total market values of market stalwarts Bank of America ($265 billion) and Coca-Cola ($263 billion). In all, just 26 of the 500 companies in the S&P 500 have market caps above $273 billion, including Nvidia. $1.915 Trillion Nvidia’s total market value as of the close of trading Thursday. It recently passed Amazon and Alphabet to become the third most valuable public company, behind Microsoft ($3.051 trillion) and Apple ($2.845 trillion). The company was valued at around $580 billion a year ago. $60.9 billion Revenue for the fiscal year ended Jan. 28, more than double Nvidia’s revenue for 2022 and about 6 times what it was five years ago. Wall Street expects Nvidia’s revenue to top $100 billion in fiscal 2025. 48.8% That’s Nvidia’s net margin, or the percentage of revenue that gets turned in profit. Looked at another way, almost 50 cents of every $1 in revenue Nvidia took in last year went to its bottom line. By comparison, Apple’s net margin is 25.3% and Microsoft’s is 34.1%. Both those companies have significantly higher revenue than Nvidia, however.  Intel launches standalone FPGA company – Altera\nU of Waterloo researchers create powerful, miniaturized antenna\nTech leaders say ‘BlackBerry’ movie doesn’t ring true\nDuke researchers are engineering carbon-based semiconductors\nElectric vehicles enter ‘next phase’: Gartner "
}