{
    "title": "Nvidia Stock Surged (Again) Today. Is It too Late to Buy the Red-Hot \nArtificial Intelligence (AI) Growth Stock?",
    "date": "3/12/2024",
    "url": "https://finance.yahoo.com/news/nvidia-stock-surged-again-today-204700536.html?guccounter=1&guce_referrer=aHR0cHM6Ly9uZXdzLmdvb2dsZS5jb20v&guce_referrer_sig=AQAAAJe9DsuPVp_4vCjbdpo3g2ovfekUGUNO1orWYa5XJh6_3vjnGhZrc8NDegZkGFuTEqzCSrrlqn_rKMSGOs2vFOZg6AP_RMVRJnKs5ZqYPiREcvlcguU1ogXULTmEd0_kEAhWnz5x7KWMn0V08twIfV6kMnLhuY-9piOo-61tq09N",
    "text": "Nvidia (NASDAQ: NVDA) jumped again on Tuesday, adding to its ongoing winning streak this year. The stock gained ground as the trading day wore on and by the time the market closed, the stock was up 7.2%. The broader market was decidedly mixed today, looking for direction, but the catalyst that helped send the chipmaker higher was strong quarterly results by Oracle (NYSE: ORCL). The company cited strong demand for AI-centric cloud services with demand far outstripping supply. Oracle also cited a recent cloud-infrastructure contract with Nvidia and hinted at more to come, saying \"We expect to have some very nice joint announcements with Nvidia next week,\" at the company's GPU Technology Conference (GTC), which begins on Monday. This announcement adds to the growing mountain of evidence that the demand for generative AI is just getting started. Nvidia has nabbed the pole position by supplying the graphics processing units (GPUs) equipped to handle the rigors of AI processing. Furthermore, rivals have been unable to come up with a better solution, allowing Nvidia to dominate the field -- in two ways. First, Nvidia is the leading provider of the GPUs used in data centers, with a dominant 98% of the market, according to Wells Fargo analysts. Since the vast majority of AI computing is done in the cloud and data centers, this benefits Nvidia. Second, the company is also the go-to for processors used in machine learning -- an earlier branch of AI -- controlling a 95% share of that market as well. This gives Nvidia an entrenched position, a clear advantage over would-be challengers. As a result, Nvidia has delivered three consecutive quarters of record-setting growth, highlighted by triple-digit, year-over-year revenue and profit growth, with another triple-digit quarter on tap. This leads to the quintessential investing question: Is Nvidia stock a buy. After the company's recent blockbuster earnings, Nvidia's valuation dropped significantly, currently trading for 36 times forward earnings. While that's a premium compared to a price-to-earnings (P/E) ratio of 28 for the S&P 500, Nvidia's track record of blockbuster growth illustrates that its deserving of a premium. It seems clear that the demand for AI will continue, with Nvidia sitting at the toll gate. This, in turn, will profit the company -- and investors. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 11, 2024 Danny Vena has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia and Oracle. The Motley Fool has a disclosure policy. Nvidia Stock Surged (Again) Today. Is It too Late to Buy the Red-Hot Artificial Intelligence (AI) Growth Stock? was originally published by The Motley Fool Related Quotes "
}