{
    "title": null,
    "date": "3/19/2024",
    "url": "https://www.barrons.com/livecoverage/nvidia-gtc-ai-conference/card/nvidia-s-showcase-event-kicks-off-today-here-s-what-to-expect--y0tlA7QJYsLlbnf1H3Xk",
    "text": "LIVE UPDATES | CONCLUDED Last Updated: March 20, 2024 at 2:48 AM EDT 11 days ago By Adam Clark Nvidia Santa Clara headquarters (Courtesy Nvidia) Nvidia is beginning its four-day GTC developers’ event on Monday and it’s no exaggeration to say it could decide the fate of the technology-stock rally. Some things at the event are a given. Nvidia will announce a flurry of partnerships across the technology sector. Representatives from all the biggest players in artificial intelligence are attending, including Microsoft, Alphabet’s Google and Meta Platforms, showing how Nvidia is still seen as a kingmaker in the AI space. Other things are widely expected. Nvidia is almost certain to give further details on its next-generation B100, or Blackwell, chip. There will be particular attention on any pricing and performance details, as competitors hope to cut into the company’s dominance in providing graphics-processing units for training AI systems by providing cheaper alternatives. Nvidia will aim to show that its chips are still indispensable for those seeking to be serious AI players. There’s a possibility that it will also unveil additional surprise hardware. Beyond just Nvidia’s chips themselves, there will also be attention on the wider AI ecosystem. CEO Jensen Huang has been talking up the need for each individual country to have its own ‘sovereign’ AI system, expanding the company’s market, so is likely to highlight any concrete agreements with national governments. There’s also likely to be a focus on how Nvidia proposes to deal with some of the obstacles to wider AI adoption such as power consumption and the environmental effects of data-center construction. “We anticipate the conference having more of an infrastructure focus this year and are curious about new data center designs and productivity improvements.\" wrote Oppenheimer analyst Timothy Horan in a research note. \"We've heard that cooling is of paramount concern to the hyperscalers, and Nvidia's solution to this problem may dictate the direction of new cap-ex [capital expenditure] spend.\" NVIDIA Corp. NVDA (U.S.: Nasdaq) Advertisement - Scroll to Continue "
}