{
    "title": "Director John Dabiri Sells Shares of NVIDIA Corp (NVDA)",
    "date": "3/27/2024",
    "url": "https://br.financas.yahoo.com/news/director-john-dabiri-sells-shares-053558241.html",
    "text": "John Dabiri, a director of NVIDIA Corp (NASDAQ:NVDA), has sold 128 shares of the company on March 25, 2024, according to a recent SEC filing. The transaction was executed at a price of $940 per share, resulting in a total sale amount of $120,320. Warning! GuruFocus has detected 6 Warning Signs with NVDA. NVIDIA Corp (NASDAQ:NVDA) is a global technology company known for its graphics processing units (GPUs) for the gaming and professional markets, as well as its system on a chip units (SoCs) for the mobile computing and automotive market. The company's GPU product brands include GeForce for gamers; Quadro for designers; Tesla and DGX for AI data scientists and big data researchers; and GRID for cloud-based visual computing users. NVIDIA's Tegra brand integrates an entire computer onto a single chip and incorporates GPUs to drive supercomputing for mobile gaming and entertainment devices, as well as autonomous robots, drones, and cars. Over the past year, John Dabiri has sold a total of 1,012 shares of NVIDIA Corp and has not made any purchases of the stock. The insider transaction history for NVIDIA Corp (NASDAQ:NVDA) indicates a trend of insider sales, with 46 insider sells and no insider buys over the past year. On the day of the insider's recent sale, shares of NVIDIA Corp were trading at $940, giving the company a market cap of approximately $2,256.25 billion. The price-earnings ratio of the company stands at 75.65, which is above the industry median of 31.31 and also above the company's historical median price-earnings ratio. With the current share price of $940 and a GuruFocus Value of $695.69, NVIDIA Corp has a price-to-GF-Value ratio of 1.35, indicating that the stock is considered Modestly Overvalued according to the GF Value metric. The GF Value is calculated based on historical trading multiples, a GuruFocus adjustment factor related to the company's past performance, and future business performance estimates provided by Morningstar analysts. This article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein. This article first appeared on GuruFocus. "
}