{
    "title": "Nvidia: Don't Chase AI Too Far (NASDAQ:NVDA)",
    "date": "1/28/2024",
    "url": "https://seekingalpha.com/article/4665602-nvidia-dont-chase-ai-too-far",
    "text": "BING-JHEN HONG  BING-JHEN HONG After a successful CES 2024, NVIDIA (NASDAQ:NVDA) surged to new all-time highs last week. The stock isn't exactly expensive, with revenue estimates surging and big customers highlighting the massive scale of the opportunity ahead in AI. My investment thesis is again Neutral on the AI chip giant after the big rally to start 2024 looking for a potential peak here above $600 with margin compression a likely story that develops in FY25. Source: Finviz Source: Finviz One of the biggest questions with Nvidia and the soaring AI GPU chip demand is whether the massive surge in spending levels is sustainable. The chip company is on the verge of reporting a year where demand surged over 100% and estimates for future years continue leaping higher. Meta Platforms (META) announced last week that the company plans to buy ~350K H100s from Nvidia to allow the company to hit new goals in AI. The tech giant has major plans to incorporate AI into existing platforms, such as via AI assistants and their LLM Lama 3. Source: Mark Zuckerberg Threads account Source: Mark Zuckerberg Threads account CEO Mark Zuckerberg estimates the company will have the computing power at the end of the year to match ~600K H100s. Raymond James has estimated the H100s are selling for anywhere from $25,000 to $30,000 each. Even if Meta is paying the lower-end amount due to bulk buying, the company alone will pay nearly $9 billion to Nvidia for these chips. On top of this huge purchase by Meta, a customer in India highlighted the almost endless demand situation. Mumbai-based Yotta Data Services is expected to order another 16,000 of Nvidia's H100 and GH200 chips for a value of $500 million. The deal is through March 2025 and doubles the prior spending leading to a total customer order reaching $1 billion already for a relatively unknown company. Yotta just launched GPU-based cloud services in India with 4,096 GPUs from Nvidia. If a company in a developing country is already placing a second major order, the prediction that the Data Center AI accelerators market will reach $400 billion by 2027 appears more realistic. AMD (AMD) again pushed the target at their Advancing AI event and the amount appears a lot more viable now considering the company pushed a target of just $150+ billion in the prior year Source: AMD Advancing AI presentation Source: AMD Advancing AI presentation Based on corporate guidance, the consensus analyst estimates have Nvidia reaching FY24 sales of nearly $59 billion, up from only $27 billion last FY. The key to the investment story is the FY25 forecasts for nearly $91 billion on a path to $120 billion for FY27. Source: Beith Kindig - Twitter/X Source: Beith Kindig - Twitter/X Based on the AI chip market estimates of $400 billion for FY27, the Nvidia revenue targets could be very low at only $120 billion. The consensus analyst estimates don't exactly prescribe to large sequential revenue gains going forward with the targets for just $1 billion in sequential growth starting with FQ1'25 (April quarter). The large sales gain for FY25 is due to the quarterly starting point at $21+ billion versus only $7 billion last FQ1. Even with limited sequential revenue growth, Nvidia will reach 200% growth in the next couple of quarters. The chip company will see a giant boost in EPS targets looking at nearly a $20 EPS in FY25. Clearly, the stock trends towards being expensive at 30x those EPS targets with the majority of the AI chip growth absorbed by FY25. The biggest question has been whether AMD or any other chip company will squeeze margins on Nvidia. The stock trades at ~15x FY25 sales targets and slow sequential growth will ultimately reduce the desire to pay higher multiples for the stock in comparison to the likes of AMD and Marvell Technology (MRVL), both with lower forward P/S multiples, but predicted strong growth rates. Data by YCharts Nvidia guided to FQ4'24 non-GAAP gross margins of 75.5% with operating margins topping 60%. The company only targets quarterly operating expenses of $2.2 billion while the gross profit should top $15.0 billion in the January quarter. Only a few short years ago, Intel (INTC) had gross margins similar to or higher than Nvidia in the 60% range. The key is that both companies struggle to generate much above low-60% gross margins prior to the recent surge in AI GPU chips. When throwing in AMD, the chip companies had the following gross margins over the last 5 years. Data by YCharts Some market estimates have AMD selling up to 600,000 AI GPU chips in 2024 after officially launching the Mi300 chips in December, clearly making a dent in the market share of Nvidia. At least at this point, the market difference is that AMD is selling the chips to Microsoft (MSFT) and Google (GOOG) in volume at much lower prices. Nvidia will maintain the vast majority of the revenue market share, but one does have to wonder how long the GPU chip giant can continue charging premium prices with these massive margins. The Yotta deal would suggest GPU chip prices of over $30,000 each. The issue is what happens when AMD supply pressures Nvidia margins. Meta Platforms even seems to suggest the company is buying ~260K AI GPUs from another supplier, possibly AMD. If one assumes the normalized AI GPU chips gross margins dip back to 65% (historically higher margins), Nvidia faces a 10 percentage point hit to margins. In essence, the FY25 revenue target of $91 billion from above would face around $9 billion in gross margin compression. From the below table, one can see the impact of gross margins getting compressed from the current 75% level to 65% assuming operating expenses of ~$9.5 billion in FY25 for Nvidia to hit the current $20 EPS target. Source: Stone Fox Capital Source: Stone Fox Capital The big question is whether Nvidia faces margin compression in FY25 or FY26 when sales growth is forecast to slow materially and AMD will have more supply to furnish chips beyond mega customers like Microsoft, Google, and Meta. History suggests chips with plenty of supply and competition don't maintain 70%+ margins and the market is never a big fan of declining margins. Either way, a normalized 65% gross margin would only support an EPS of $17 in FY25. The stock is expensive trading at 30x existing FY25 EPS targets of $20, but the issue is that normalized EPS levels are lower when margins decline due to higher supplies and a competitive threat from AMD. Even if Nvidia doesn't face a big gross margin hit in FY25 due to huge demand from Meta and other tech giants, the company will inevitably face this pressure. In such a scenario where margins actually compress during FY26, the current consensus EPS estimates of $24+ will collapse to where earnings hardly grow from the FY25 target of $20+. In such a scenario of limited to no growth, the stock will struggle. As with the prior research, after the market closed on October 23, our view is more Neutral on Nvidia now following the rally to $610. The prior call wanted to scoop up shares on dips from the $430 price and the stock immediately dipped below $400 on October 26 and dipped to $392 on October 31, providing such an opportunity to grab the stock nearly $40 lower within a week. Source: Seeking Alpha Source: Seeking Alpha An investor buying Nvidia down at $400, not the low at $392, would've boosted the return in a couple of months to 53% from the 42% total return of just blindly buying at current market prices. The stock definitely could continue the recent surge to possibly $650 or even higher with analyst targets currently above $670. Ultimately though, the expectation would be for Nvidia to trade back down to these levels or even retest the breakout levels of $500 with the success of AMD AI chips taking some shine off the market's willingness to pay up for the possibly unsustainable margins of Nvidia. The chip company will report FQ4 earnings at the end of February. Investors will pay clear attention to the margin guidance with AMD chips on the market now. The key investor takeaway is that Nvidia is back to where investors shouldn't chase the stock again. The market opportunity remains enormous, but Nvidia faces a scenario where competition is now entering the race, and growth rates will slow. If the company faces any margin hit, the stock will struggle to rally as the combination will squeeze EPS growth. Investors should ride the stock up to possibly $650 over the short term and look into cashing out Nvidia after the stock traded at only $120 back in late 2022. The expectation for margin compression as the year unfolds leading to limited EPS growth will likely cap any further upside in the stock. If you'd like to learn more about how to best position yourself in under valued stocks mispriced by the market to start 2024, consider joining Out Fox The Street. The service offers a model portfolio, daily updates, trade alerts and real-time chat. Sign up now for a risk-free 2-week trial. This article was written by Stone Fox Capital (aka Mark Holder) is a CPA with degrees in Accounting and Finance. He is also Series 65 licensed and has 30 years of investing experience, including 10 years as a portfolio manager. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The information contained herein is for informational purposes only. Nothing in this article should be taken as a solicitation to purchase or sell securities. Before buying or selling any stock, you should do your own research and reach your own conclusion or consult a financial advisor. Investing includes risks, including loss of principal. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}