{
    "title": null,
    "date": "1/30/2024",
    "url": "https://www.investopedia.com/microsoft-alphabet-and-other-magnificent-7-expected-to-boost-s-and-p-500-earnings-8553085",
    "text": " Cesc Maymo / Getty Images After helping drive gains for the S&P 500 last year, all but one of the \"Magnificent 7\" are expected to be the top contributors to S&P 500 earnings for the fourth quarter, according to projections from FactSet. Those six companies are Microsoft (MSFT), Alphabet (GOOGL), Amazon (AMZN), Apple (AAPL), Meta (META), and Nvidia (NVDA), members of the Magnificent 7 stocks that outperformed the S&P 500 in 2023. This week, Microsoft, Alphabet, Meta, Apple, and Amazon are set to report earnings, with Microsoft and Alphabet due to release their results after the bell on Tuesday. Apple, Meta, and Amazon will follow on Thursday. Nvidia will report its earnings next month on Feb. 21. Together, Nvidia, Amazon, Meta, Alphabet, Microsoft, and Apple are projected to report year-over-year earnings growth of 53.7% for the fourth quarter. Without those six, the remaining 494 S&P 500 companies are anticipated to post a 10.5% decline, blending actual and estimated results. That compares to an overall drop of 1.4% for all the S&P 500 companies. Tesla (TSLA) is the only Magnificent 7 member not contributing a gain in earnings, after reporting results that fell short of expectations last Wednesday. FactSet projects Nvidia, Amazon, Meta, and Alphabet could also lead S&P 500 earnings growth for the first quarter of 2024, with estimated year-over-year earnings growth of 79.9%. In comparison, the other 496 companies of the S&P 500 are projected to report a 0.3% rise for the same period, contributing to 4.6% overall gain for the index. Tesla shares have gained about 15% year-over-year, while Apple shares climbed 31%, Amazon shares advanced 58%, and Microsoft shares rose over 68%. Meta shares have more than doubled in value, while Nvidia shares more than tripled, compared to a 22% rise for the S&P 500 over the same period. FactSet. \"ARE THE “MAGNIFICENT 7” THE TOP CONTRIBUTORS TO EARNINGS FOR THE S&P 500 FOR Q4?\" Nvidia. “Events.” FactSet. \"Earning Insight Topic of the Week: 1 Are the 'Magnificent 7' the Top Contributors to Earnings for the S&P 500 for Q4?\" "
}