{
    "title": "Nvidia, Microsoft, Google, and others partner with US government on AI \nresearch program",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/nvidia-microsoft-google-and-others-partner-with-us-government-on-ai-research-program-160111850.html",
    "text": "The National Science Foundation (NSF) announced on Wednesday that it is teaming up with some of the biggest names in tech to launch the National Artificial Intelligence Research Resource (NAIRR) pilot program. The NAIRR pilot, the NSF said, is designed to create a national resource for researchers and educators to access high-powered AI technologies with the goal of ensuring the US continues to lead in AI research and innovation. Companies and nonprofits joining in the two-year pilot program consist of a murderers' row of some of the biggest names in AI, including Amazon (AMZN), Anthropic, Hugging Face, IBM (IBM), Intel (INTC), Meta (META), Microsoft (MSFT), Nvidia (NVDA), OpenAI, and Palantir (PLTR), among others. Federal agencies participating in the effort include the Defense Advanced Research Projects Agency (DARPA), the Department of Defense, the Department of Energy, NASA, the National Institutes of Health, the National Oceanic and Atmospheric Administration, and the Department of Agriculture. NAIRR, which was born out of President Biden’s AI executive order, will serve as a framework for how the government and private sector can advance AI technologies in the future. “By investing in AI research through the NAIRR pilot, the United States unleashes discovery and impact and bolsters its global competitiveness,” NSF director Sethuraman Panchanathan said in a statement. “To continue leading in AI research and development, we must create opportunities across the country to advance AI innovation and strengthen educational opportunities, empowering the nation to shape international standards and igniting economic growth,” he added. According to the NSF, NAIRR will function as a shared national infrastructure that will provide communities across the country with the hardware, models, and resources needed to advance the AI ecosystem. The program, the NSF said, is necessary because AI resources have become concentrated and difficult to access for many communities, whether those are smaller colleges or institutions in rural areas and territories. Examples of potential use cases include allowing an AI researcher to investigate the validation and verification of large models or a lecturer from a community college or minority institution to provide students access to AI systems. Tech companies, the foundation explained, aren’t being paid to provide access to their services, but rather are making in-kind contributions to those made by government agencies. Contributions include support for 20 research projects by Amazon, access to Anthropic’s Claude model for 10 researchers working on climate change projects, 100 compute grants from Hugging Face, datasets and benchmarks from IBM, $20 million in compute credits for Microsoft’s Azure, and $30 million in support from Nvidia, including $24 million worth of computing for the company’s DGX platform. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}