{
    "title": "StockWatch: Nvidia Jumps 24% on Recursion, Amgen AI Partnerships",
    "date": "1/21/2024",
    "url": "https://www.genengnews.com/gen-edge/stockwatch-nvidia-jumps-24-on-recursion-amgen-ai-partnerships/",
    "text": "Prime Medicine tumbles 20% on analyst downgrade tied to gene editing question: Are investors more interested in CRISPR? [L-R] Martin Chavez, Recursion’s board chair and a partner and vice chairman of global investment firm Sixth Street Partners, discusses the promise of AI-accelerated drug design with Nvidia Founder and CEO Jensen Huang at a fireside chat during a glitzy, invitation-only evening reception designed to highlight the Nvidia-Recursion partnership, held recently at The San Francisco Mint. Nvidia has spent the first three weeks of this year continuing its climb into the Wall Street stratosphere, as the company has wowed investors with announcements that include Recursion releasing the first in a potential series of foundation models for external use, to be hosted on Nvidia’s BioNeMo™ AI drug discovery platform. [Nvidia] Nvidia (NVDA), the Silicon Valley-based microprocessing giant with a growing presence in the life sciences, has spent the first three weeks of this year continuing its climb into the Wall Street stratosphere, as investors double down on the company’s recent successes in artificial intelligence (AI), let alone the broader promise of the technology to reshape biopharma among other industries. Shares of Nvidia have climbed 24% from the start of the year, closing at $481.68 on January 2 through Friday, when shares closed at $594.91. Three minutes before the closing bell, Nvidia’s shares hit another all-time high of an even $595, before the share dipped on profit-taking but still achieved a 4% one-day gain. Friday’s trading occurred the day after Nvidia received more good news: Meta founder and CEO Mark Zuckerberg posted on his Instagram Reels Thursday afternoon that it will build a “massive compute infrastructure” as part of a “future roadmap” that embraces AI. By year’s end, Zuckerberg said, Meta will have purchased 350,000 H100 graphics cards from Nvidia. Nvidia’s recent stock surge explains why two analysts raised their 12-month price targets on Nvidia shares this past week. John Vinh, a managing director, equity research analyst with KeyBanc Capital Markets covering the semiconductor sector, increased his firm’s price target 14%, from $650 to $740. Ivan Feinseth, who is senior partner, chief investment officer, and director of research with Tigress Financial Partners, lifted that firm’s target 41%, from $560 to $790. Both firms maintained their ratings of Nvidia stock, which are “Overweight” and “Buy,” respectively. Nvidia’s surge this year comes on top of its shares more than tripling in price during 2023, starting with a 180% jump in the first half of the year that grew to 246% as shares zoomed from $143.15 at the start of last year to $495.22 on the year’s final trading day December 29. Since then, Nvidia has wowed investors with a trio of announcements showcasing the company’s leading role in integrating AI within drug discovery, through a pair of collaborations and a product update timed to go public during the recent 42nd Annual J.P. Morgan Healthcare Conference: Starting, ending in silico Over the next decade, AI-accelerated drug design will see engineers building complex systems that operate entirely in simulation, just as computing systems can now be built in silico based on 40 years of advancements in computer-aided chip design, Nvidia Founder and CEO Jensen Huang predicted January 10 during a “fireside chat” conversation with Martin Chavez, Recursion’s board chair and a partner and vice chairman of global investment firm Sixth Street Partners, held at the San Francisco Mint. “Almost everything will largely start in silico, largely end in silico,” Huang declared. “If you want to do your drug design and drug discovery in silico, it is very likely that you have to process an enormous amount of data… It is likely going to require state-of-the-art models. But there are several ways that we can help you and we can partner with you.” One way, Huang explained, was through a Nvidia computing platform. Second was through access to his company’s algorithms. The third way, he said, was more intangible: “We are enthusiastic, we’re passionate, and we are determined to work with you to advance this field. We believe in this. Very, very few companies can say that they believe in this from the very beginning and we’re still here 15 years later.” The fireside chat was part of an invitation-only evening reception designed to highlight the Nvidia-Recursion partnership, with Recursion using the event to demonstrate its new LOWE (Large Language Model-Orchestrated Workflow Engine) software, which is designed to perform complex drug discovery tasks using a natural language interface. LOWE is powered by Recursion’s biological and chemical data and can orchestrate experiments using Recursion’s automated wet laboratories, unleashing the power of the Recursion Operating System in an easy-to-use tool. News of LOWE, and by extension progress in the Nvidia collaboration, sent Recursion shares rising 6% on January 9, from $12.61 to a year-to-date high of $13.40. While shares have since slid 28% to $9.63 at the close on Friday, Recursion shares have nearly doubled over the past 2 1/2 months, soaring 84% from $5.23 on November 9, 2023. That day, Recursion released third-quarter 2023 results showing a net loss of $93 million, 54% more than the net loss of $60.4 million reported for Q3 2022—but also announced a new partnership with Tempus Labs and updates to existing alliances with Bayer and Nvidia. Recursion agreed to pay Tempus $160 million cash or equity over five years, in return for preferred access to more than 20 petabytes of what the companies called one of the world’s largest proprietary, de-identified, patient-centric oncology datasets, spanning DNA, RNA, health records, and more. The data is intended to support the discovery of potential biomarker-enriched therapeutics at scale through the training of causal AI models. In the Bayer partnership, Bayer agreed to use Recursion’s AI-guided drug discovery platform to identify novel therapeutic targets for challenging oncology indications with high unmet need, with the pharma giant agreeing to pay Recursion up to $1.5 billion tied to achieving development and commercial milestones, plus royalties. Also in November, Recursion said, it had committed to substantially expanding BioHive-1, its on-premise NVIDIA DGX SuperPOD-based supercomputer, by adding more than 500 NVIDIA H100 Tensor Core GPUs to more than 300 NVIDIA A100 Tensor Core GPUs that were already in place, thus increasing its computational capacity 4X. Nvidia and Recursion launched their collaboration last summer, when increasingly AI-focused Nvidia agreed to invest $50 million in Recursion, a San Francisco-based AI-focused drug developer Prime Medicine (PRME) saw its share price tumble 20% this past week, from $7.99 on January 12 to $6.39 on Thursday, before bouncing back 2% to $6.50 on Friday. The gene editing therapy developer’s slide began January 16 when Dae Gon Ha, PhD, a director and equity research analyst covering the biotechnology sector for Stifel, downgraded the firm’s rating on Prime stock, from “Buy” to “Hold.” Ha also halved the firm’s price target for Prime Medicine, from $18 to $9. In a January 15 research note, Ha said the downgrades reflected what he said was greater investor interest in gene editing based on CRISPR than newer technologies—though Prime Medicine and other developers of post-CRISPR gene editing modalities assert that their technologies offer enhanced safety by avoiding off-target edits. Ha contended that the investor tilt toward CRISPR followed a few recent events that showed the viability of that gene editing approach—citing in part the FDA’s approval last month of Casgevy™ (exagamglogene autotemcel [exa-cel]) as a treatment for sickle cell disease—the first CRISPR-based therapy to be authorized by the agency. The Stifel analyst also cited Intellia Therapeutics’ clinical updates: During JPM, president and CEO John Leonard, MD, announced that Intellia had begun and was actively enrolling patients in the pivotal Phase III MAGNITUDE trial assessing NTLA-2001 in adults with ATTR amyloidosis with cardiomyopathy (ATTR-CM), while the company also completed enrollment and dosing in the Phase II portion of a Phase I/II study of NTLA-2002 in adults with hereditary angioedema (HAE). “We think CRISPR/Cas9-based technologies have a stronger appeal on investors,” Ha wrote. “We think the narrative of a different ‘spin’ to the technology (i.e., using a different Cas enzyme) or adding novel capabilities to Cas (i.e., prime editing) still engender a greater degree of skepticism—until proven otherwise.” During his presentation at J.P. Morgan, Prime Medicine president and CEO Keith Gottesdiener, MD, said his company was on track to file the first IND/CTA application for human trials of a prime editing therapy to the FDA during the first half of this year—PM359, a blood-targeting candidate for chronic granulomatous disease (CGD) now in the IND-enabling phase. The first clinical data is expected as soon as 2025, he said. “Important” headway, but… “PRME is making important headway into de-risking its prime editing technology that we, over the long-term, see as an important viable tool in therapeutics,” Ha acknowledged. “However, 2024 is setting up to be a quieter period as it pertains to stock-moving, potentially binary, catalysts that can generate definitive/compelling data that investors have been waiting for.” Gottesdiener cited the favorable safety profile of PM359, predicting that it “is going to become an important differentiation from other gene editing approaches.” Ha, however, said Stifel saw three challenges facing PRME shares: “With the first data readout in 2025 effectively branding 2024 as an execution year, and the challenges surrounding the data readout itself in 2025, we think shares may be more range-bound with a potentially better entry point later on,” Ha added.  "
}