{
    "title": "Are You Looking for a Top Momentum Pick? Why Nvidia (NVDA) is a Great Choice",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/looking-top-momentum-pick-why-170004166.html",
    "text": "Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades. While many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores, helps address this issue for us. Below, we take a look at Nvidia (NVDA), a company that currently holds a Momentum Style Score of B. We also talk about price change and earnings estimate revisions, two of the main aspects of the Momentum Style Score. It's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Nvidia currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period. You can see the current list of Zacks #1 Rank Stocks here >>> Set to Beat the Market? In order to see if NVDA is a promising momentum pick, let's examine some Momentum Style elements to see if this maker of graphics chips for gaming and artificial intelligence holds up. Looking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It's also helpful to compare a security to its industry; this can show investors the best companies in a particular area. For NVDA, shares are up 11.43% over the past week while the Zacks Semiconductor - General industry is up 0.4% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 13.66% compares favorably with the industry's 1.07% performance as well. Considering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Over the past quarter, shares of Nvidia have risen 29.13%, and are up 218.51% in the last year. On the other hand, the S&P 500 has only moved 9.43% and 20.94%, respectively. Investors should also pay attention to NVDA's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. NVDA is currently averaging 34,334,104 shares for the last 20 days. Earnings Outlook The Zacks Momentum Style Score encompasses many things, including estimate revisions and a stock's price movement. Investors should note that earnings estimates are also significant to the Zacks Rank, and a nice path here can be promising. We have recently been noticing this with NVDA. Over the past two months, 15 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost NVDA's consensus estimate, increasing from $10.90 to $12.31 in the past 60 days. Looking at the next fiscal year, 13 estimates have moved upwards while there have been 1 downward revision in the same time period. Bottom Line Taking into account all of these elements, it should come as no surprise that NVDA is a #2 (Buy) stock with a Momentum Score of B. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Nvidia on your short list. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report NVIDIA Corporation (NVDA) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}