{
    "title": "AI helps the world's biggest tech firms smash $10 trillion market \ncapitalization ceiling — Nvidia replaces Facebook as ...",
    "date": "1/20/2024",
    "url": "https://www.techradar.com/pro/ai-helps-the-worlds-biggest-tech-firms-smash-dollar10-trillion-market-capitalization-ceiling-nvidia-replaces-facebook-as-the-new-kid-on-the-block-while-microsoft-displaces-apple-at-the-helm",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Meta has yet to go above $1 trillion, despite recently pivoting to generative AI The world's biggest tech giants have swelled more than $1 trillion in valuation, thanks in part to investments and advancements in generative AI – collectively exceeding $10 trillion in valuation. But it's not good news for everyone, as Meta, which has only just pivoted to AI after misfiring on its metaverse bet, is yet to hit $1 trillion – specifically, $937.85 billion at the time of writing. The companies – including Microsoft, Apple, Google, Amazon and Nvidia – are all worth more than $1 trillion, according to the latest market capitalization figures on Google Finance, which was something incredibly rare before Apple became the first Silicon Valley giant to break this threshold in 2018. Apple also became the world's first $2 trillion US company, and the country's first $3 trillion company, but is now valued at $2.81 trillion – just shy of Microsoft. While it hasn't yet announced concrete AI integrations yet, Apple's long been rumored to be working on its flavor of generative AI ahead of incorporation into its products later this year. The most valuable tech giant right now is Microsoft, which is valued at $2.88 trillion, thanks in part to its massive investments in OpenAI and integration of large language models (LLMs) like GPT-4 into a vast range of products and services, from the Windows 11 operating system to the MS Paint app. Google, too, which is valued at $1.77 trillion has recently launched its Gemini AI series – which includes an on-device version known as Gemini Nano set to feature in the Pixel 8 Pro phone. This follows its bumbling first foray into AI with Google Bard. Beyond its dominance in many spaces, Amazon owes its $1.56 valuation in part after incorporating generative AI into its services, with a focus on advertising and e-commerce. Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! We all know how pivotal Nvidia has been to the latest explosion of interest in generative AI, meanwhile. Its components – including the H200 and H100 – are among the best graphics cards and are highly coveted by enterprises far and wide attempting to get in on the action. This is fuelling its valuation of $1.38 trillion. As for Meta, having gone all in on the metaverse while the rest of the tech industry focused on generative AI, it's only recently ventured into this realm – bringing an end to 20 different tests for how the technology can improve its services. It's better late than never, but it remains to be seen whether these tools and services can raise the company's valuation to the levels enjoyed by its contemporaries. Keumars Afifi-Sabet is the Technology Editor for Live Science. He has written for a variety of publications including ITPro, The Week Digital and ComputerActive. He has worked as a technology journalist for more than five years, having previously held the role of features editor with ITPro. In his previous role, he oversaw the commissioning and publishing of long form in areas including AI, cyber security, cloud computing and digital transformation. An ancient Linux flaw might be opening up users to dangerous cyberattacks PyPI stops signing up new users to try and block malware campaign DNA storage is coming, it's just a matter of when not if — SNIA quietly unveils first specifications for storing bytes in DNA medium, an important first step towards almost ultra-cheap, limitless storage By Mackenzie FrazierMarch 29, 2024 By Lance UlanoffMarch 29, 2024 By Craig HaleMarch 29, 2024 By Craig HaleMarch 29, 2024 By Rowan DaviesMarch 29, 2024 By Chris NortonMarch 29, 2024 By David NieldMarch 29, 2024 By Craig HaleMarch 29, 2024 By David NieldMarch 29, 2024 By Craig HaleMarch 29, 2024 By Darren AllanMarch 29, 2024 TechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}