{
    "title": "Nvidia stock hits record high as tech earnings reinforce AI bullishness",
    "date": "2/3/2024",
    "url": "https://www.businessinsider.in/stock-market/news/nvidia-stock-hits-record-high-as-tech-earnings-reinforce-ai-bullishness/articleshow/107371958.cms",
    "text": "Liked the article? Share it with your friends... or copy link Shares of Nvidia hit an intraday record of $666 per share on Friday as artificial intelligence bullishness grows after tech earnings this week reiterated companies' big plans for the nascent technology. Bank of America raised Nvidia's price target to $800 from $700 on Friday, anticipating a 23% upside from current levels. Analysts expect that Nvidia is poised to exceed revenue expectations when it reports earnings for the last three months of 2023 on February 21. BofA pointed to the company's dominance of the market for GPU chips that enable most AI technologies. Nvidia's position in the space will lead the company to maintain a 90% share of the AI training market and more than a 50% share of the AI inference market. The surge in the share price Friday comes after strong earnings from tech giants this week, many of which have big plans to incorporate AI into their businesses. Microsoft, Meta, and Amazon, all reported strong earnings this week, and executives from all three firms pledged more investment in AI. Meta CEO Mark Zuckerberg told investors to expect the company to invest \"aggressively\" in the space, while Amazon executives dedicated a lot of air time on the company's earnings call to talking about its new smart assistant, Rufus. Microsoft's own AI Copilot assistant was also a focus for investors when the firm reported earnings, with analysts at Wedbush Securities this week saying that the tech titan is on the verge of a multi-year, trillion dollar AI opportunity. Shares of Nvidia pared some gains as the market headed toward the closing bell on Friday. The stock was trading at $661.10 a share at 3:10 p.m. ET., up by 4.9%. Advertisement "
}