{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.investors.com/research/nvidia-stock-unstoppable-deckers-outdoor-soars-on-earnings-beat/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     In the midst of earnings season, three growth stocks — Nvidia (NVDA), Deckers Outdoor (DECK) and First Citizens BancShares (FCNCA) — top IBD's Screen Of The Day. The reasons: All three are hitting new highs and have best-possible Earnings Per Share ratings. As investors might expect, though, Nvidia stock tops them all in overall scores. The New Highs screen uses the IBD Stock Screener to find winning growth stocks with strong fundamentals that reached 52-week highs. The EPS rating, which measures a company's results with those of other firms, is particularly important now that earnings season is in high gear. It seems nothing can keep Nvidia stock down, as it topped yet another all-time high on Monday in higher-than-average daily volume. Shares gapped up nearly 4.8% Monday after Goldman Sachs raised its price target to a lofty 800 from 625 and maintained its buy rating on the stock. Monday's jump comes on top of Friday's nearly 5% increase after BofA Securities also lifted its price target on Nvidia stock to 800 from 700 with a buy rating. The leading chip and artificial intelligence stock is extended from the 20% profit zone of a flat base buy point of 505.48. The IBD 50 and SwingTrader stock soared more than 20% in 15 days producing a power-from-pivot flag, according to MarketSmith pattern recognition. Nvidia produced huge earnings growth of 593% and 429% over its last two quarters. Sales grew 206% year over year for its most-recent fiscal third quarter, up from 101% annual growth for the prior quarter. Investors find out if the trend continues on Feb. 21, when the Magnificent Seven name reports its January-ended quarterly results. For now, Nvidia stock holds an ideal EPS Rating of 99 from Investor's Business Daily. It also has a Composite Rating of 99 and a Relative Strength Rating of 98. Deckers Outdoor gapped up 14.1% in heavy volume following the company's better-than-expected fourth-quarter earnings and sales late Thursday. Deckers also issued fiscal 2024 earnings and sales that topped FactSet's estimates. Quarterly gross margin increased to 58.7% vs. 53% for last year's same time period. Several analysts raised their price targets on the footwear maker's stock following the report. Shares hit an all-time high Friday before pulling back around 3.5% on Monday. Deckers stock is extended from a flat base with a 568.47 buy point. The stock has ridden its 50-day moving average along the way. Its relative strength line also spiked in Friday's move and eased off on Monday. In addition to its best-possible EPS rating of 99, Deckers has a Composite Rating of 99. Its RS rating is 97. Deckers stock also holds an IBD Accumulation/Distribution Rating of A, indicating heavy institutional buying over the last 13 weeks. Deckers makes Hoka, UGG and Teva brand shoes, boots and sandals. Deckers Chief Executive Dave Powers is scheduled to retire on Aug. 1, according to a Barron's article. IBD 50 name First Citizens BancShares reached a 52-week high on Friday. Shares rose nearly 1% Monday and are back in a 5% buy zone reaching to 1,604.53. The bank stock broke out of a flat base with a 1,528.12 buy point following First Citizen's fourth-quarter earnings report on Jan. 26. The stock retraced and closed below the buy point after locking in a 5.5% gain. Shares reclaimed the 50-day line on the jump. The company missed on both profit and revenue estimates but posted enough growth to maintain its 99 EPS rating. Its Composite Rating is 92 and its RS Rating stands at 91. Quarterly earnings and sales growth have slowed following strong triple-digit increases. Fourth-quarter earnings grew 122%, down from 169% and 212% in the prior two quarters. Sales growth also tempered to 99% from 112% and 133% in the same time periods. First Citizens serves personal, small business and commercial clients in 23 U.S. states and has more than $220 billion in total assets. Follow Kimberley Koenig for more stock market news on X/Twitter @IBD_KKoenig. YOU MAY ALSO LIKE: Nvidia Partner Synopsys Stock Hits A Buy Point | Where To Invest These Brokers Help You Boost Your Cash | Where To Invest Warren Buffett Stocks Hit Highs | Where To Invest Have You Checked Out These S&P 500 Leading Stocks? | Where To Invest Cadence Design Systems Teams Up With Tesla| Where To Invest 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}