{
    "title": "Trillion-dollar company adds advertising to game streaming service - \nHypertext",
    "date": "2/28/2024",
    "url": "https://htxt.co.za/2024/02/trillion-dollar-company-adds-advertising-to-game-streaming-service/",
    "text": "Despite having a market capitalisation of $1.97 trillion, Nvidia has decided that what it needs right now is even more money. According to several reports, Nvidia’s game streaming service, GeForce Now, will soon feature advertising. Thankfully the advertising is limited to the free tier of the service but it’s part of a growing trend by big tech firms to plug advertising into more products in a bid to earn more money. Starting 5th March, gamers on the free tier of GeForce Now will see up to two minutes of advertising before they start a session. For now, advertising seemingly won’t affect the Priority or Ultimate subscription tiers (the only tiers available to South Africans) but that may change in the future. Some may argue that watching a few adverts in order to access a free service is fine but we disagree. For example, YouTube has become so aggressive with its advertising that using the platform without an ad-blocker or a YouTube Premium subscription is awful. We suspect that Nvidia is hoping that advertising will be such an annoyance that free users will open their wallets and pay for a Priority or Ultimate subscription. The response to this news from GeForce Now users has been mixed. The r/GeForceNow community on Reddit appears to be split on their opinion but the sentiment of the majority is that this is a net good for players on the free tier. Many appear to think that the revenue from these ads will be used to improve GeForce Now. While that may be the case, we suspect those improvements will happen for the higher tiers rather than for the free tier. There are also some, who like us, are concerned about the slippery slope this move introduces. If there isn’t much kickback to the introduction of ads in the free tier, Nvidia could start advertising to other subscribers. Given that Nvidia now needs to add to its trillion-dollar market cap, the firm will likely squeeze every rock and flip every couch it can to find a few extra dollars to add to the revenue sheet. GeForce Now is available in South Africa but as mentioned, only in the Priority and Ultimate tiers. However, the product is currently marked as “Sold Out” by rain which makes the game streaming service possible here in South Africa. You can join a waiting list to get an invitation when a spot opens up but that may take a while. Given that space is limited according to rain, we don’t expect the free tier of GeForce Now to arrive for South Africans anytime soon but if it does, keep in mind that there will be ads on that tier from 5th March. "
}